[{"rating": 1.0, "review": "The idea behind the afforable fire stick seemed a good one, but, it will not access my Amazon account.  My broadband is working-I can accessNetflix through my Samsung DVD player's wirless to the Samsung TV, but Amazon home will not come up. I have unplugged the DVD. The other TVin use accesses Amazon through a Sony DVD and has worked okay for some time. The stick is a disapointment, unlike most Amazon products.Please advise. Bennie Colantuono.", "verified": true, "helpfulness": "0/0", "author": "Bennie Colantuono"}, {"rating": 1.0, "review": "Total piece of crap... simply will not detect the remote. That pretty much makes the device worthless.", "verified": false, "helpfulness": "0/0", "author": "Jim Brady"}, {"rating": 4.0, "review": "I had such high hopes for the Fire TV Stick, and it has met most of them. We tried several streaming devices in our bedroom before getting the Fire Stick. Our Wi-Fi signal isn't the best in that particular room and the other devices we tried were very intermintent. The Fire Stick has worked the best of any so far. It does occasionally lose the signal (which wouldn't bother me much) but it is a pain to get it back. Sometimes it just magically works again. Other times we've had to unplug it. Yet other times I've had to delete all the wireless settings and start over because it will show the signal with a \"very good\" connection but just won't connect. It is irritating to go through the process but when the Fire Stick is working, it works really well! We mostly use it for streaming Amazon Prime and Netflix. I hope that more apps will be available in the future that will be useful for us. I love the ability to move it to another room or travel with it. It was well worth the price we paid when it was on special.", "verified": true, "helpfulness": "0/0", "author": "Edie Carter"}, {"rating": 3.0, "review": "Great features.... Very poor antenna design.  I have owned this device for several weeks and I continue to lose the network connection every few hours of viewing.  Reviewing the online forums I've found that many other users are experiencing the same thing even though, like myself, their firestick is only a few feet from the network router. All other devices on the network continue to work fine.  To recover from this we have to manually either power off the device or reset it by holding the select and play buttons in for 5 seconds. Some users have also found that taping a 14\" length of copper wire from the device has helped (ugly and not always practical).  If/when connected to the network this is a great device.", "verified": true, "helpfulness": "0/0", "author": "Mike in VT \"mikevt1\""}, {"rating": 5.0, "review": "Love it, I can watch anything, anytime I want", "verified": true, "helpfulness": "0/0", "author": "Michael J Powers"}, {"rating": 5.0, "review": "Just got it but thinking about getting rid of cable.", "verified": true, "helpfulness": "0/0", "author": "Mtenny"}, {"rating": 4.0, "review": "I cancelled my cable because it was to expensive and got this, I'm am very happy with it. Since my TV is not a smart TV I now have a smart TV and I have Netflix, am very content. The Fire Stick has an app so I can also control it from my cell phone too, the content on the stick is very easy to navigate in general as well.", "verified": true, "helpfulness": "0/0", "author": "Brittany"}, {"rating": 3.0, "review": "It'sok just another expense really, but it does come in handy if your bored", "verified": true, "helpfulness": "0/0", "author": "anthony poni"}, {"rating": 4.0, "review": "I purchased the Fire Stick for my mom for Christmas.  Did not receive before Christmas, I'm sure because of demand.  My mom LOVES it!!!!  She had been watching Netflix on a tablet and loves watching now on her larger screen.  My mom is in her 70's and Dad is in his 80's after a few tutorials from my 14 year old daughter they navigate the user interface like pros.  I'm very happy with the purchase!", "verified": true, "helpfulness": "0/0", "author": "Glenda L Johnston"}, {"rating": 1.0, "review": "Was ok for the first 2 days then it started to pass every 15 min so I took it back.", "verified": true, "helpfulness": "0/1", "author": "Joseph martin"}]