[{"rating": 3.0, "review": "It works as advertised. Once the free month of Amazon prime runs out its going to limit the choices by a lot.  I wish there were a few more apps from the Amazon app store or any from the play store that it would allow.  The availability to stream current TV/movies is based on how much you'd like to spend on rentals, and what cable company you have (many apps are based on you having regular access to that channel already.. AMC, AE, Disc, etc). I guess sideloading is always an option...", "verified": true, "helpfulness": "0/0", "author": "R. McKee"}, {"rating": 5.0, "review": "Love it so far, fast and easy to navigate, got it on sale just to try it and now thinking on getting another one", "verified": true, "helpfulness": "0/0", "author": "luis"}, {"rating": 4.0, "review": "I would like to be able to root it. Any suggestions?", "verified": true, "helpfulness": "0/0", "author": "michael ferguson"}, {"rating": 3.0, "review": "Beware,  no sdcard support,  minimal storage.  Basically limited to what Amazon wants you to watch.  I love my pure Adndroid boxes,  they give me same options and a world of extras..  One + thing is good UI, works well with the remote.", "verified": true, "helpfulness": "0/0", "author": "Moe"}, {"rating": 5.0, "review": "Love it! So easy to control.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "The remote could be bigger and have buttons that illuminate, otherwise its one of the best investments I have made this year.", "verified": true, "helpfulness": "0/0", "author": "William Spero"}, {"rating": 5.0, "review": "Simple fast fun", "verified": true, "helpfulness": "0/0", "author": "Danielle Williams"}, {"rating": 5.0, "review": "So convenient! !!!!!", "verified": true, "helpfulness": "0/0", "author": "GIA9400 \"GIA9400\""}, {"rating": 2.0, "review": "The fire stick keeps freezing up, it has done it several times and a few times it wouldn't unfreeze so I had to unplug it. It always runs really hot, now it starts glitching and skipping while watching videos on YouTube and Netflix. Only reason I'm giving it two stars is because it worked great the first few days of having it. I'll probably be returning it soon, I'm very displeased...", "verified": false, "helpfulness": "0/0", "author": "Cody Clouser"}, {"rating": 3.0, "review": "Have Apple TV and love it but that didn't come with Amazon Prime app so decided to give this a try when we chose to expand our homes TV footprint with these kind of devices. Not too fond of the navigation vs Apple TV. Love the price vs Apple TV though I should say we got a door buster. I may have just stuck with Apple TV if Fire Stick was full price. Wifi connection to our router has already had connection errors. The devices are directly across the hall so it is not a signal issue. A simple reboot of Fire stick solved the problem. 2 weeks out of the box does make me a bit concerned. Remote is Bluetooth so works via proximity vs line of site. That has plus and minus. I wish I could set up my existing TV remote with it but that is not possible due to the standard TV remote not having Bluetooth capabilities. It is nice to not have to point at anything in order for it to work everytime. These remotes are smaller so in our house they seem to get lost much easier. Overall, a nice less expensive alternative to other options but still has lots of room to improve. Most likely, if I expand the TV footprint again with devises like this, I will go back to my trusted Apple TV product.", "verified": true, "helpfulness": "0/0", "author": "Tom Moriarty"}]