[{"rating": 5.0, "review": "I loved it and all of it's  features.", "verified": true, "helpfulness": "0/0", "author": "dfeenx"}, {"rating": 4.0, "review": "I love it thus far, there are some movies i have been meaning to see,& they are right here for me to watch right at home,in which I'D  rather be", "verified": true, "helpfulness": "0/0", "author": "Christilee Johnson"}, {"rating": 5.0, "review": "WONDEFULL", "verified": true, "helpfulness": "0/0", "author": "COUSIN VINNIE"}, {"rating": 5.0, "review": "ONCE I REDID MY WIFI/MODEM, I FOUND THE \"STICK\" A QUICK METHOD TO GET TO THE AVAILABLE SITES. ITS A VERY USEFUL AND AN EASY \"TOOL\" TO USE", "verified": true, "helpfulness": "0/0", "author": "FLORIDA MARV \"better sleep\""}, {"rating": 5.0, "review": "I just luv it glad I bought it", "verified": true, "helpfulness": "0/0", "author": "Zenaida R. Ramirez"}, {"rating": 5.0, "review": "Have really enjoyed movies on the big screen from prime", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "So I've finally put my Fire TV Stick into action.It's great if you only use Prime or Netflix however I must state that the rest of the channels aka \"apps\" are lacking compared to other mainstream devices.. (ROKU.. I'm talking about ROKU)..For example their spotify integration requires that I actually control the \"fire stick\" from my phone or other device on the network instead of just connecting to my spotify directly.  The Showtime app doesn't have comcast for a provider.. I mean really who doesn't have \"xfinity\" these days.There are no \"news\" apps that I could find to run in the background.. (Not that Roku does this very well but they do have some).So overall I have to give this a 3 start attempt by Amazon to break into the streaming device market.  Nice start but needs updates and more options.  I am happy that I'll be able to use netflix and prime instant video on it though so I went into this with the attitude that I'd give it a try and at least use it for those 2 mainstream streaming services, I was just hoping for more.", "verified": true, "helpfulness": "1/1", "author": "Ramius"}, {"rating": 5.0, "review": "Works like a magic.", "verified": true, "helpfulness": "0/0", "author": "monthira mountry"}, {"rating": 5.0, "review": "love it! Makes using prime and netflx  so easy. Very easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Patricia P."}, {"rating": 5.0, "review": "Best birthday gift I have ever bought for myself. I'm addicted to anything BBC and have so enjoyed watching every series I can find. Throwing it on the big screen has been wonderful. I highly recommend the Fire Stick to everyone who owned a Kindle", "verified": true, "helpfulness": "0/0", "author": "V. MCconnell \"constant reader\""}]