[{"rating": 5.0, "review": "I would give it 0 stars if that was an option because it does not work at all.  It recognizes my wifi, but will not accept the wifi password.  Everything else I have manages to connect, including my computers, smart TVs, Kindle, Fire TV and my new Echo.  And the stick is not even 2 feet from the router.  This is very disappointing, especially since I bought another one to give as a gift.  Would hate to give a gift that does not work.Update ... I love Amazon tech support! I entered a ticket online and THEY called me immediately with all my account information available.  They were very pleasant, very helpful, very patient and very well trained (I am a corporate trainer so that is important to me).  Most importantly, they apologized for the issue.  I am currently dealing with Comcast on a tech issue and they NEVER apologize for ANYTHING! Within 15 minutes, the Amazon techs had my issue resolved with the utmost professionalism! Turned out to be a simple fix.  The tech suggested I install the HDMI extension ... apparently wifi noise can interfere with the signal and the extension provides a bit of amplification to clear the noise.  Works perfectly now. Thanks for the excellent tech support! And a strong positive shout out to the tech support trainers!", "verified": true, "helpfulness": "1/2", "author": "Rustyduck"}, {"rating": 5.0, "review": "i have a roku box at home and love it, primarily because it was the first on the market. and i didn't purchase this to replace it. i bought this to travel with. we vacation a great deal and even when you're on vacation at the end of the day you find yourself in your condo, apartment or rental home watching local stations or paying for cable.  not anymore, this is the answer and the only way to go.", "verified": true, "helpfulness": "0/0", "author": "roderick may"}, {"rating": 3.0, "review": "I was able to purchase the Fire TV stick for $19 when Amazon offered the deal to Prime members, I already own an almost 2-year old Roku 3 which still works great but couldn't pass up this Fire TV deal for another room.I would say that it's value is about $20-$30 but not the $39 retail price. Why? 1) it needs to be powered by a secondary connection either TV USB or to a power outlet. 2) Not enough good apps although the Prime content and Netflix/Hulu plus works very well. 3) just a bit of lag when moving around apps/content (no lag on Roku 3). 4) picture quality of Prime/Netflix/Hulu content is not as sharp compared to my 2-year old Roku 3 was surprised about that since Fire TV stick had better specs.Conclusion: Fire TV stick is a good 1st gen Amazon streaming stick which could be better. It is fairly easy to set up and get started with. But I still recommend to friends & family looking for a streamer box that they purchase the Roku 3 or wait for the 4 when Roku decides to release an update since their product is actually fun and very simple and easy to use and works great.", "verified": true, "helpfulness": "0/0", "author": "F.C.N.Y."}, {"rating": 2.0, "review": "I almost never leave reviews for anything, but here goes.  The only app I've used so far is HuluPlus, and it is effectively useless.  Sometimes the audio hiccups and sounds like dubstep for a few seconds.  Sometimes the screen goes black while the audio continues normally.  I'm not sure whether these issues happen with any other streaming app, but I don't really care to find out.  I'll be going back to my PS3 until Amazon fixes this.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 2.0, "review": "the stick is fine, the service is a huge disappointment.  If you look through the list of movies available, there are some good ones.  But if you go about it the more normal way - say - lets try to see if we can see movie X, or Y or Z (and I tried lots of oldies but goodies) every one i was interested in came with a price tag.  All of them!  I have Amazon Prime for the shipping, and I thought the movies would be an added plus.  I can see the movies are an added zero.  I already have all the other apps on my newish Samsung SmartTV, but Amazon was an excluded app for some reason .  So I bought the Fire Stick.  I doubt I will ever use it.  I have Netflix by mail - which has the largest selection anywhere of 'free' movies.", "verified": true, "helpfulness": "1/1", "author": "Amateur Woodworker"}, {"rating": 5.0, "review": "This was so easy to setup, I had it up and running in about 10 minutes. I also have the app setup on my phone and tablet and my wife's tablet. Everything is so easy to use. Fantastic!", "verified": true, "helpfulness": "0/0", "author": "fpright \"F. Philip Right\""}, {"rating": 2.0, "review": "Bought this for the mirroring capabilities it advertised. I have a Samsung GS5, Google Nexus, and a Kindle Fire HD(older version). Mirroring doesn't work with any of them. Otherwise it looks cool hanging out the side of my TV. Also, the fireplace app is neat. The Showtime app would've been cool except I have Xfinity service, which is not supported. At least I only paid 19 bucks.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fantastic, set up was easy and it works just fine. After reading some negative reviews I was skeptical, but it does what it says and more than I thought !", "verified": true, "helpfulness": "0/0", "author": "Bill Trevette"}, {"rating": 5.0, "review": "Really easy to set up. Menus are easy to negotiate. Downloading the Amazon Fire app to my tablet gave me voice control. I was very impressed.Certainly recommend it for someone who wants to add \"smart\" capability to their flat-screen TV at a very reasonable price. And it added value to Amazon Prime account since I can watch Instant Videos on my television now, as well as my laptop and tablet.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 2.0, "review": "We just got ours in the mail, and it seems to be okay, but the primary (and maybe only) reason we got the fire tv was for the 'fling' feature. The details read \"Connect your small screen to your big screen— Fire TV Stick lets you fling your favorite apps to your TV to free up your small screen for other uses. Or mirror your phone or tablet to your TV.\" So i instinctively thought I'd be able to fling it from my iPhone to the big screen......... but come to find out it supports every device BUT Apple products. If I'd purchased it for $40 I would return it... not happy about this.", "verified": true, "helpfulness": "0/0", "author": "trane"}]