[{"rating": 5.0, "review": "My husband bought this on his account but I thought I should post a review. We use only Amazon Prime and Netflix for our visual entertainment so I can't speak about any other interfaces.It took a few tries to get it to connect to our wifi network. It connected after switching to the hdmi2 port on our tv. Seems odd but try that if it keeps rejecting your password. Once connected, it immediately found my prime account and set up was crazy easy. The remote isnt bad at all but I also have a kindle fire hd and there's an app that is too fun! Searching by voice was a hoot and very accurate. So the stick works great and the fire tv app works great. I think we got what we were promised.", "verified": true, "helpfulness": "0/0", "author": "Desert dweller"}, {"rating": 5.0, "review": "Love this thing! Cable will become almost obsolete. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Nancy McNaul"}, {"rating": 5.0, "review": "I have an apple tv and got this just so i could watch amazon prime on my television.  LOVE IT!  In addition to watching amazon prime and hulu( i subscribe to aal these service because i dont have cable) i can stream al sorts of random content from my iphone... Including rhapsody.. The music service that i use. There are bunches of different apos you can download... From games to recipe channels to work out videos...  .  The only problem is that i cant stream apple videos that i have bought in the past..  Recommend.", "verified": true, "helpfulness": "0/0", "author": "cadizaeh"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Heather Winbush"}, {"rating": 5.0, "review": "So fair its GREAT.", "verified": true, "helpfulness": "0/0", "author": "twocams"}, {"rating": 5.0, "review": "The Fire TV Stick is amazing! I could not love this item anymore than I do already. We use this on a daily basis and have surely gotten our money's worth out of the month that we have owned it. It is very user friendly and an excellent way to access Amazon Prime, Hulu, Netflix, etc. It is very small and portable, so it is excellent to take on vacation. The remote control is awesome, as my 5 year old is easily able to maneuver around the options without constantly asking for help. I also love that is provides beautiful HD photos as a screensaver, if you are not actively watching TV. If you are thinking about cancelling cable and looking for an option to view all your favorite shows, look into getting the Fire TV Stick. It is well worth the investment!", "verified": true, "helpfulness": "0/0", "author": "SuperMarioMom"}, {"rating": 5.0, "review": "Great!!!", "verified": true, "helpfulness": "0/0", "author": "Zyaira"}, {"rating": 5.0, "review": "works great... easy setup", "verified": true, "helpfulness": "0/0", "author": "Kendall"}, {"rating": 5.0, "review": "It works great!", "verified": true, "helpfulness": "0/0", "author": "Janice Monson"}, {"rating": 4.0, "review": "Great value. I wish it had Chromecast-like features, but I'll take Kodi/XBMC unofficial support, 1080p and a remote. The Miracast display mirroring function does not work at all though.  Tried it with an HTC One M8 and Moto X.", "verified": true, "helpfulness": "0/0", "author": "Dan N"}]