[{"rating": 3.0, "review": "The Fire TV stick is a nice little device, slightly hampered by a merely okay service backing it.Pros:-Small device. It's about as wide and tall as any HDMI plug, but long enough that it sticks out quite a bit.-Included HDMI extender cable, basically this is to get the device away from the HDMI port in case it's getting in the way of other plugs, as it's only a few inches long, but it does help.-Functional remote. My remote paired instantly and has worked flawlessly, the buttons don't have the best tactile feel but overall everything works.-Definitely works. From playing couch games like You Don't Know Jack, to browsing Prime, to Netflix it all works right out of the box, with a minimum of fuss.-Sufficiently powerful. The device certainly isn't \"fast\", you'll notice a lot of problems while it's installing something in the background, but for running your streams and playing simple games it all works well.Cons:-Doesn't turn off. There is no power button anywhere. I understand Amazon wants an always-on device that updates itself while you're away, but for power-conscious people leaving the device and hoping it sleeps is not satisfactory. If you wanted to ensure the device turned off, you'd have to pull its power supply.-Lack of ports. As said, you'll probably need the HDMI extender to keep the device from blocking other ports on your TV, and it requires USB power which sort of sticks out the side, and it has absolutely no other ports- there's a variety of additions you can make to the Fire TV box which can't be added to the stick, having at least one port would have been nice. Overall, this unit can potentially be awkward when it comes to connections.-Might have connectivity issues. I've had one instance in a couple weeks' usage here the unit stopped reading my wireless connection, even though everything else in the house was working fine, and the only thing I could do to resolve it was to reset the device to factory defaults (losing all settings aside from registration with my Amazon account, it's nice that this hangs around).Included \"Prime Instant\" Viewing:As of writing, the bulk of the content that's included with prime revolves around popular television shows. If you want to see some Doctor Who, you're probably in luck. Variety however, especially for movies, is not great. Especially for movies they have a ton of categories for sorting, but few titles actually available- look around and you'll quickly be laughing at how often you see the same few titles over and over. Sure you still have access to Amazon's full library of titles you can buy or rent, but the actual streaming portion is barely passable.Overall:A great device for an older family member who buys things off Amazon, you can view a few free shows and rent movies whenever you want. Anyone interested in any kind of \"power\" usage, such as plugging in a game controller, will need the full set-top box. Everything about the Fire TV Stick is \"just okay\". For example, the buttons on the remote aren't very clicky, they're responsive but they're a bit mushy. Browsing quickly through menus is again just okay, only one item is highlighted at a time and trying to forward through the list goes too fast for browsing, so again it's not bad but it's just okay. If you have Prime, and you stream things from Amazon and/or Netflix and/or Hulu, this is a neat little device to have. It just doesn't have any \"wow\" factor at all.", "verified": true, "helpfulness": "0/0", "author": "Michigoon \"tech geek\""}, {"rating": 4.0, "review": "Love my Fire Stick so far. I got a 32\" TV for the bedroom and don't have cable. I had no way of getting Netflix on my TV besides hooking up my laptop every time so I snatched one of these guys up during the initial Prime discount sale. Couldn't be more happy.I chose this over a Chromecast because it includes a remote. I have a Windows Phone so Chromecast wasn't really an option for me. The specs on the Fire Stick are also quite a bit better than the other \"stick\" devices.The only issue I've had so far is that a few times while I've been watching Netflix there's been sort of a little stutter or buzzing noise almost as if there was a buffer underrun. I restarted the Fire Stick and I haven't had the problem since so I'll consider that to be a one time deal.All in all I'm really enjoying the Fire Stick. I would recommend it to anyone who is just looking to get some smart TV functionality on their dumb TV.", "verified": true, "helpfulness": "0/0", "author": "Jared B. Schwager"}, {"rating": 5.0, "review": "We received our Fire stick several weeks ago, and we are very happy with it, especially as we play with it and get to know the menu better.  We have mostly tried Amazon Prime areas at this time.  We have had a Roku box for several years now on our main TV, but we have now tried the stick on our bedroom TV and at a relative's home on hers.  We are hoping that more stations will be added, as on Roku (i.e. stations addressing autism).  Everything seems to work as well or better with the Fire stick, once we added on the extender.  We saw this direction on the website, but didn't try at first because instructions seemed to imply that it was just for convenience of hooking up.  There was a definite difference in Wi-fi speed/strength when we added the extender.  We are also looking forward to promised addition of password protection so we can safely use it at motels, etc.  We would have to remove a star if that option is not added.  We are very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "lpc for children"}, {"rating": 5.0, "review": "I’ll admit it; I’m an Amazon junkie. 1 Kindle, 3 Fires, Fire TV, and Prime are all used din my home on a daily basis, so of course I bought this the day it was made available for pre-order on Amazon. Then I waited. And waited some more. Finally when I could nigh wait any longer, it happened, the big brown truck arrived with my little package in hand. I was overjoyed to say the least and wasted about .0002 seconds before ripping open the outer wrappers and cracking open the box.My first thought, thank God it’s got a remote! I’ve no interest in having to cast from my devices all of the time, so having a dedicated remote to use is great! After inputting the passwords for the rest of my streaming accounts I was up and running, streaming YouTube, Hulu, and Prime videos with ease, and all seemingly faster than the Roku stick.This little stick rocks, and I’m so glad I didn’t hesitate to purchase. Amazon has a hit on its hands with the Fire TV stick!", "verified": true, "helpfulness": "0/0", "author": "Kevin l."}, {"rating": 5.0, "review": "The stick works as advertised. Easy to install and operate. some brief buffering that is not a problem only seconds at times and only when loading a app.", "verified": true, "helpfulness": "0/0", "author": "Ronald E."}, {"rating": 3.0, "review": "This thing works OK, but the Voice remote is an extra thing to buy.  Better off just buying theFire TV set top box.  It comes with that.  The voice search also only works with the AmazonPrime stuff.  Just an FYI for you !", "verified": true, "helpfulness": "0/0", "author": "Fred N. Evans"}, {"rating": 4.0, "review": "It works seamlessly with Amazon contents. More importantly, Miracast actually works after paying attention to a few things: First, HDMI switch can get in the way (my Kindle HDX can find Fire TV but can't connect to it when connecting the stick through an HDMI switch). In the end, I need to directly plug Fire TV stick into the TV's HDMI port. Second, going to the \"Settings->Display and Sound-> Enable \" can help if there is a discovery/connection issue, especially for non-Kindle device (like Samsung phone) to connect to Fire TV. Third, if the mobile device just fails to connect, rebooting it can usually solve the problem.", "verified": true, "helpfulness": "0/0", "author": "Xiaofan LIN"}, {"rating": 1.0, "review": "Device does not truly support Miracast. A recent update finally got the Miracast to work with my Note 4, but still no hope of connecting via a Windows 8.1 laptop. As soon as this is resolved I'll update my review.Otherwise, in a sea of comparable streaming devices there is no compelling reason to get this one. If you need Amazon Prime access a Roku is a seasoned device. If you don't need it the Chromecast is great. This device is jittery and feels rushed.If the Miracast starts working this would be the best reason to get this device, but for right now it's a disappointment.", "verified": true, "helpfulness": "9/11", "author": "Stacy P. Vicknair"}, {"rating": 2.0, "review": "I ordered this for use with my Kindle Fire HD 8.9\".  Unfortunately, when I got it I found that it only works with the new Kindle Fire HDX.  There appears to be no support for the older version of Kindle.  The second reason I wanted this was to fling my laptop screen to the TV.  Again, there is no software to support this function.  It feels like Amazon rushed this out to compete with the Chromecast, and they didn't get adequate support in place before shipping.  I have the Chromecast and it works brilliantly with my Nexus pad.", "verified": true, "helpfulness": "0/0", "author": "ken wells"}, {"rating": 3.0, "review": "This is a new device...  So I'm trying to be patient.  I have other streaming devices (2 different iterations of the Roku, Google Chromecast, PS3, Wii, DVD player, etc) so I'm familiar with how they work and some of the common problems.  So far, the biggest problem I've had with the Fire Stick is the screen freezing.  Either the screen freezes and I can still hear the sound or the screen goes black and I can still hear the sound.  When the picture just freezes, I can usually go back to the home page to reset it.  When the screen goes black, I have to unplug it.  I'm hoping they will take care of this problem with some software upgrades.  Otherwise, I'll go back to the Roku.", "verified": true, "helpfulness": "1/1", "author": "R. Bliss \"Cevennes\""}]