[{"rating": 2.0, "review": "For the price, I guess its ok.  I'm sorry, but I was pretty disappointed with the firestick.  First off I was unable to use it with my samsung tv.  Luckily this is not the only tv in my home (so I just switched around roku and other assorted devices).  And 2nd, more importantly, the firestick does not come close to the apps you can utilize as compared to the roku.  I have the following devices: firestick, roku (several assorted versions) and an apple tv.  The roku is by far the best on the market when it comes to the various apps/channels it has.  I must admit, I am keeping the fire stick simply because of the price.  I was able to get mine on promotion and paid less than $20 for it. So I am going to keep it and put it in the spare guestroom where I seldomly watch tv -- but I'm sure it will be a nice thing for my guests to be able to utilize.  Sorry amazon, I LOVE my kindle, but your fire stick (until you guys start adding better/more apps) will be exiled to the guestroom. Hey, at least it's not being returned for failure to work with my SAMSUNG 60\" tv.", "verified": true, "helpfulness": "1/1", "author": "Allison Magera \"BiggggAl\""}, {"rating": 2.0, "review": "Just got the fire tv stick delivered. I already have chromecast but bought this mainly to watch amazon prime videos. Interface was good1) I did not like the fact that it is complaining about power source. I used usb port in the tv.2) I connected to my network but was 'Loading' all the time3) I restarted it after plugging in to a real source complained about my network being flaky4) I tried to watch a movie and it stopped saying that your network is not good. Chromecast never complained thatI am sure there is a bug/issue with the network in the device. Hope this gets fixed for me to use it. I will keep two stars till I see an improvement in the network connection", "verified": true, "helpfulness": "0/0", "author": "Ram Balagurunathan"}, {"rating": 5.0, "review": "Really great way to watch my Amazon prime items.  Previously I tried watching prime on my computer, and the quality was so-so, but the Fire stick seems to do a significantly better job at buffering even on my unreliable internet connection.", "verified": true, "helpfulness": "0/0", "author": "Scott Kuntzelman"}, {"rating": 4.0, "review": "I use this with my Acer H6510BD projector and it works fine. I only use to stream a few hours of streaming a few days a week so pretty light use. Set up is easy and remote is simple. Connecting to my Android tablet was a bit of pain and the interface is weird. I have not tried to mirror any of my devices, yet.  Amazon prime videos streams perfectly. Sometimes it will freeze and reload with apps like Netflix and youtube. For $20  and for the amount of use and type of streaming I plan on using this for, it was a bargain.", "verified": true, "helpfulness": "0/0", "author": "Uber"}, {"rating": 1.0, "review": "Waited 2 months to get this product and it does not work.  Bought it at $19 so figured what the heck I would add it to a guest room TV.  Couldn't get it setup.  Wasted 45 min trying to trouble shoot.  I have 9 other wifii devices all connected and working fine so it is not my internet service.  The best/ only troubleshooting tip on Amazon's help site is to unplug it and replug it.  Well it is unplugged now and heading back to Amazon.  I will put the refund money towards a roku box", "verified": true, "helpfulness": "0/1", "author": "Vincent M. Kunz"}, {"rating": 5.0, "review": "Works well, and was very easy to install", "verified": true, "helpfulness": "0/0", "author": "Kevin Wangbickler"}, {"rating": 3.0, "review": "They claim no buffering and everything...It is lacking soo many apps, while watching the showtime app, on the live TV sections it has to keep on buffering, and I have super fast internent!!! It should not be soo slow! If i didn't slow out the box I would prob exchange.", "verified": true, "helpfulness": "0/0", "author": "E O"}, {"rating": 5.0, "review": "Got it for my daughter's tv.  We both love it!  We did have a small problem getting it to recognize the remote.  We just unplugged everything, checked our connections and plugged it back in.  After pressing the button for a couple seconds as indicated on the screen we were in business. Has a simple interface and is quick and responsive.  The playback looks and sounds great and very little wait time for video start up..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Fire TV Stick is so easy to setup and use, I think that even my 80 year old mother could use it.  Normally, I don't let mom get anywhere near anything resembling technology, but I think she could handle this.Picture quality is very good, and the interface is snappy, professional looking (as you'd expect) and simple to use.  The remote has a nice feel to it.  Seems like quality.I got the thing at the $19 special price, but even at the regular price it's ridiculously cheap.  Ultraportable too.What's not to like?  Got a few slight hitches where the display froze momentarily.  I also don't like the fact that I cannot add or search for new Prime music, but rather, I have to go to my computer to select new items.But again, nice unit, easy to use and easy to set up.  4 stars and an excellent value.", "verified": true, "helpfulness": "0/0", "author": "B.Willis"}, {"rating": 1.0, "review": "Inferior to everything else I've tried.  The streaming speed is sub-par for both local media server (Plex) and internet streaming content (Netflix, ESPN).  Both buffered several times in the first minute from the same location I stream football (Sunday Ticket) and Netflix through my PS4 (also wireless connected).  The Roku in the other room never has issues with streaming content either.I had high hopes for this, but it seems like it's a wasted purchase (plus the $5 Plex app that I used once for 5 minutes).  Spend the money on a Roku.", "verified": true, "helpfulness": "0/0", "author": "D. Vargo \"meep_42\""}]