[{"rating": 5.0, "review": "Great !!! Has all the channels I watch plus more, even has flappy bird!", "verified": true, "helpfulness": "0/0", "author": "Jordan S"}, {"rating": 5.0, "review": "It is great..I love it.  Movies, games, TV shows.  Haven't had a chance to check out the music.  Love that I can move it around to other rooms.It was a XMAS gift, but so worth it.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline"}, {"rating": 5.0, "review": "Love it. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The interface and tiny remote make me love this thing! ... but... it seems to not load content as quickly as some other dongles and very occasionally I have to unplug and plug it back in to get it to load anything. I've only had a Chromecast before so the interface is an upgrade but I think it could still use refinement. I don't like that I can't cast content from mobile devices(at least until I get a kindle fire). The one thing I love about Chromecast that I don't get here, is the social aspect of everyone looking for stuff to watch on their phones/tablets (that don't have to be the same brand device) and being able to share things they already have queued  on their device, from their own accounts.Prime content seems to load faster than other service(or maybe I'm paranoid). VERY MUCH WORTH THE PRICE!I love that prime content has \"others ways to watch\" options that link to Hulu or Netflix so you don't pay extra for content you're already paying for on another service.", "verified": true, "helpfulness": "0/0", "author": "Khailmik"}, {"rating": 5.0, "review": "i have all 3 (rocku stick,chromecast,and this). overall, this is the best. if you are looking for foreign television, chromecast has SBTV app, huge variety. if you are German, chromecast has 2 different  ZDF channels. fire stick has Pottsdam TV, some sports, DW news in German. Games are the best with Fire Stick, plus you can buy a game controller and you'll have decent entertainment for an age 3 to 18 yo child who is visiting you and bored! Rocku I only got since dish had a contract issue with Fox news. the rocku fox news app was very limited on live programming. chromecast only good for tech savvy since there isn't a remote. fire has a lifestyle app, lots of cool waterfall, aquarium, fireplace type apps if you like that stuff.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "would like if it could access more apps like abc and abc family and cw", "verified": true, "helpfulness": "0/0", "author": "vanessa paurus"}, {"rating": 5.0, "review": "Love it!! Simple installation & instant results. Even a non-tech person like myself could figure it out. If I could get the back off of the voice activated remote control to install the batteries, I would be even happier!!", "verified": true, "helpfulness": "0/0", "author": "Kara J"}, {"rating": 5.0, "review": "the fire stick work much better than my Sony apps for my DVD player I got hundreds and hundreds of movies that was not available but were all my fire stick I could not be more happy", "verified": true, "helpfulness": "0/0", "author": "James Tipton \"James Tipton\""}, {"rating": 5.0, "review": "Great media stickWifi could be a little better .But, compared to ROKU and chromecast, it's a winner .", "verified": true, "helpfulness": "0/0", "author": "zach"}, {"rating": 5.0, "review": "More than met expectations.  Have suggested it to friends.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]