[{"rating": 4.0, "review": "So far it is working as advertised!! NO complaints", "verified": true, "helpfulness": "0/0", "author": "Karl"}, {"rating": 5.0, "review": "Good-bye cable. With all one can access on Apple TV and Amazon, supplemented by a subscription to Sling, the cord can be cut. All you need is those three services and a good wi-fi connection.", "verified": true, "helpfulness": "0/0", "author": "John F. Barber"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Geekster \"Girl Geek\""}, {"rating": 5.0, "review": "Simply Works!  It has 2 plugs one for the wall adapter and one HDMI. I have an adaptor for my tv as I have several HDMI things plugged in and I have had no problems getting this stick to work.  The remote is very simple to learn and works perfectly. the remote is made of all plastic, no rubber parts anywhere. It is very lightweight, weighing about as much as a cigarette lighter.  The stick looks very much like a flash drive, however since it is plugged into the wall to remember who you are, it isn't exactly portable.  I dont move mine so this is not an issue for me. I bought it to replace older video game systems that were not able to keep up with my streaming Netflix and Amazon Prime tv shows, and it works perfectly. Never had a over heating issue or glitches of any kind.  It took me about 5 min to set up and watch the tutorial video, and another 5 to sign into all of subscriptions.  Super Simple.", "verified": true, "helpfulness": "0/0", "author": "Northwest"}, {"rating": 3.0, "review": "A lot like ROKU and more expensive.  Also the navigation is not anywhere to being intuitive unless you are 15.  To me it is complicated even though there are a minimum of buttons.  I do enjoy using it once in a while.  It was a gift.", "verified": true, "helpfulness": "0/1", "author": "Juliette \"angelsjoy2000\""}, {"rating": 5.0, "review": "Works great just love it!", "verified": true, "helpfulness": "0/0", "author": "BBumbolow"}, {"rating": 1.0, "review": "quit working after 4 months. Just the splash amazon screen comes up the shuts off. Starts up again with green box then shuts off again. My Chromecast that is plugged into the same tv is still going strong after 9 months, luckily i have that...didnt pay a too much for the fire stick but paid less for the Chromecast that at least still works", "verified": true, "helpfulness": "0/0", "author": "Devin"}, {"rating": 2.0, "review": "I was really excited to get this but it hasn't worked the way I thought it would.  It buffers too much and also doesn't have the Vudu app that I really want.  I should have just bought a Roku.", "verified": true, "helpfulness": "0/0", "author": "Mike Sharp"}, {"rating": 5.0, "review": "We needed it to use in a hospital where the Internet had to be refreshed. We were able to do it from the app and the Fire Stick made my wife's stay much more enjoyable!! Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Jholly1"}, {"rating": 4.0, "review": "Love this! Did seem to get a little slow when I added photos so I removed them and it seemed to go back to normal. Some things take a few seconds to load, but it's not unreasonable. Excellent for the price. We cancelled most of our cable and are suplementing with this and are very happy so far.", "verified": true, "helpfulness": "0/0", "author": "K. Mueller"}]