[{"rating": 5.0, "review": "I was using an Apple Tv, and planned to give this as a gift, but decided to try it first.  Well, I guess I will be giving away the Apple Tv instead, this Item has so much more to offer than the Apple.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Elisa Rodriguez \"elisa rodriguez\""}, {"rating": 1.0, "review": "Another botched launch.  Nintendo got roasted for sending out a new console that needed patching, somehow this stick didn't make the news.I got the $20 deal, so I'll probably keep one.  My mother is sending hers back since it requires *MY* Amazon prime account to get the 'free' streaming, so she'll have to go to the living room to use it.  The UI is very unintuitive; as far as I can tell, there is no way to do a search AND filter out the non-'free' content.  Recommendations were all weird; considering how many DVDs and Blu-Rays I bought from Amazon over the years, you'd think they'd be in tune to my likes and dislikes.I also see no way to have profiles, so I'm certain I'm going to get five thousand recommendations for cartoons after my child is using it. When I tried to set up parental protections, it says my passcode was wrong; no way to reset it on the device.Video quality was okay; at first I thought it was terrible, then I realized that they were playing at a lower resolution until it buffered, honestly, I'd prefer to wait until it's clear.I may revisit this if Amazon ever is able to work a content deal with the movie houses similar to auto-rip.  Right now, it seems like it's geared towards selling stuff.", "verified": true, "helpfulness": "0/1", "author": "Ernie \"Ernie\""}, {"rating": 4.0, "review": "Follow-up: Amazon contacted me following my review and resolved some software issues that my firestick has. Occasionally still has issues, but they are resolved with a restart. Good product, good price, great customer service. Looking forward to future software updates to improve product.Have had issues with it connecting to the Internet, issues with the apps. Software seems glitchy, the issues go away temporarily once reset. Issues mainly come up when streaming Netflix.", "verified": true, "helpfulness": "0/0", "author": "Kristine"}, {"rating": 5.0, "review": "I am impressed. Easy set-up and faultless operation. This makes the Amazon app on my TV look bad.", "verified": true, "helpfulness": "0/0", "author": "Fjr Traveler \"medio_mike\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Robert Zarinelli"}, {"rating": 3.0, "review": "Pretty fast and a lot of content, not to keen about the whole idea of being auto registered to my Amazon account. I do want to buy Prime, I have had accident by other users who have at multiple time registered me for Prime because they want to watch the content, I have been charged twice and am having to go and cancel the order several times. I use Netflix and that what I am sticking with, other then that the product is great. One more thing upgrading for Chromecast, it not very plug and play with apps on my phone, I am keeping having to use the remote which I totally hate to do (using the phone to play content is just more convenient as the phone is at you're finger tips all the time, or it's just me)!!", "verified": true, "helpfulness": "0/1", "author": "PabloPicasso"}, {"rating": 5.0, "review": "Plug and play. Nice and easy to set up and use. My only issue as a prime member I would like more film choices. How about film category's? Also vintage films and documentaries would make the Fire Stick even more valuable. Come on Amazon show us the love!", "verified": true, "helpfulness": "1/1", "author": "LarrySaunders"}, {"rating": 2.0, "review": "I just got this and it was great that it already had my account information built in (like a Kindle).  However, the remote is completely non-responsive.  When I tried to navigate through the menus, nothing would happen.  I would try and try again.  Nothing.  Eventually all of the button presses would register at once and the screen would go nuts.When it did work, it seemed to work well.  But that was only a couple of minutes.Plus, maybe there is a way to skip it that I couldn't figure out (maybe the remote wasn't working??) but the introduction video is useless and annoying and much too long.", "verified": true, "helpfulness": "0/1", "author": "Dave"}, {"rating": 5.0, "review": "Very happy to have our Fire Stick! It's very simple to set up. Thanks, Amazon, for such an affordable streaming device that works!", "verified": true, "helpfulness": "1/1", "author": "Terry Miller"}, {"rating": 5.0, "review": "My Fire TV Stick arrived today - not sure how I could buy it from BestBuy.com more than a month before it is available from Amazon, but I could. Great Apple-level elegant packaging. Beautiful interface. Almost all of the apps I cared about on Roku (this replaces my dead original Roku box - the first one Roku ever sold). It is well integrated with Amazon streaming, which I hoped/figured it would be. All of the songs I've downloaded and many of the albums I've bought from Amazon are instantly available to stream. I'm very happy with it and highly recommend it. It is the first piece of Amazon hardware I have ever bought - job well done, Amazon!", "verified": true, "helpfulness": "1/1", "author": "Lisa H"}]