[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "spring"}, {"rating": 4.0, "review": "Quick, Cheap, worth it! only downside was that i was an invitee to a Prime membership, in order to be able to view all of Amazon movies and shows you must have a full prime membership, not just an invitee.", "verified": true, "helpfulness": "0/0", "author": "jraborg86"}, {"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/0", "author": "dan s."}, {"rating": 4.0, "review": "Needs a longer cable, but otherwise this is amazing!", "verified": true, "helpfulness": "1/1", "author": "Pamelamela"}, {"rating": 4.0, "review": "Love having this Fire TV Stick on my TV.  I can do the same thing with my Kindle, but I have to have a cord attached to my Kindle.  Good bye cord.", "verified": false, "helpfulness": "0/0", "author": "pp1951"}, {"rating": 1.0, "review": "I rarely vent about anything, but regarding the Fire TV Stick, I'm going to make an exception.  I'm trying to use it right now and the message I'm getting is \"loading Prime Video…\" and it's been loading for awhile now.  I consistently get other messages such as \"check Internet connection\", or it's stuck in la-la land and does absolutely nothing.  For all of you that always have an reason/excuse as to why I'm having problems I have a Roku that works off of the internet as well.  I can turn my Fire Stick off and use my Roku and the Roku works, I have a laptop, the internet works.  I've tried turning everything off and the Fire Stick continues with whatever message its spewing at the time.I can honestly say that I'm completely disappointed in the Fire TV Stick; and regret that I paid for it with my hard-earned money.  I hope everyone else has better luck than I did.", "verified": true, "helpfulness": "2/2", "author": "Vivian Peña"}, {"rating": 4.0, "review": "Works great! Just not exactly what I thought I it would do. My fault for not researching it better. I thought it would allow to put what ever I wanted on the screen from my laptop like my Google Chrome device I have on our bedroom TV. However it works quite well and  allows me to play all of the Amazon Prime content on the TV with out using the computer to play it.", "verified": true, "helpfulness": "0/0", "author": "ceh300"}, {"rating": 1.0, "review": "I may as well review this now as I may never get to use it. I have had mine for a month. It cannot mirror my Kindle on my TV. I've complained loudly and at length and all I have are emails saying their team of technicians are working on the problem. How is it possible that this can't be resolved without an earth shaking technical advance? It will let me view Netflix and other sites, but I have a smart TV and could already do that. This was purchased solely for the ability to mirror content, a thing it does not do. I can't possibly recommend it to anyone when it doesn't do what it is advertised for.", "verified": true, "helpfulness": "2/2", "author": "Jody Higinbotham"}, {"rating": 5.0, "review": "Works well amazing amazon value at promo price.  Hooked up to the TV in my office and now I can stream shows on my dumb TV such as amazon prime which I really like and use more than my netflix account these days.", "verified": true, "helpfulness": "0/0", "author": "gregg239"}, {"rating": 4.0, "review": "I love it.  I have used my TV a lot more not that I have the Fire Stick.  I don't have to hassle with the computer to pull up app and plug into TV.", "verified": true, "helpfulness": "0/0", "author": "MontaP"}]