[{"rating": 2.0, "review": "Twitch, hbogo and Hulu apps are very slow, often lost connection, sometimes even get crashed meantime on iPad everything works fine .... Interface is not smooth, everything looks very slow. I think it costs 20$, no more. Bought it just to checkout device. If you are expecting excellent work from device for 20$ it's probably not wright choice. I like almost all Amazon products except this. It's definitely not Amazon level device.", "verified": true, "helpfulness": "0/0", "author": "Dennis"}, {"rating": 5.0, "review": "I got rid of my cable! With amazon prime, hulu, and netflix I can watch what i want when i want! Amazon fire Stick makes it so much better because I can do it all with the firestick! I love mine! It was a very wise investment!!!", "verified": true, "helpfulness": "0/0", "author": "Donovan Lewis"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Eligio Marquez"}, {"rating": 5.0, "review": "Great for college", "verified": true, "helpfulness": "0/0", "author": "Snow girl"}, {"rating": 5.0, "review": "I'm still getting use to it, but excellent so far.", "verified": true, "helpfulness": "0/0", "author": "Dennis"}, {"rating": 5.0, "review": "Let's face it, nothing is perfect. At least to me, there is always something to improve. But Amazon gets many things right with their first Fire TV Stick. From the easy to open packaging, to the easy to set up device itself, Amazon has used all the little tricks they have learned (by listening to consumers) over the years.Let me start by saying that I have 3 Chromecast devices and checked this device out after a sale at Staples. But in hindsight, it is certainly worth the full retail price. Here's why:At first, I thought that this would never replace my Chromecasts because use them so much and I'm always on my phone or tablet. But after using it for a month, I find it to be my go to streaming device. The remote does a wonderful job for having such a limited number of buttons. But that might be part of the winning recipe, using the KISS (Keep It Simple, Stupid) principle. But don't let the simplicity fool you. This device is VERY capable and compatible.I use it with my Logitech Harmony Smart Control Hub instead of the supplied remote most of the time, but the fact that you CAN use another remote is tremendous. In addition, if you just love using your phone for everything, there is are apps for both iOS and Android that will turn them into remotes (in case you lose the little bugger?).It does all the things that you would expect it to including Netflix, YouTube, Spotify, etc. It also can handle most Android apps that are available through Amazon Appstore. This is where Chromecast cannot (in its current incantation) hang with the Fire TV Stick. With the keyboard and remote I have set up, this device is more like an Android on my TV than with Chromecast. I particularly like being able to use the Tiny Cam app that I already purchased way back and view my Foscams on my TV. It’s like a DIY CC TV camera setup.Setting up the device was dead simple. Plug into HDMI (using their extension adapter if you wish), plug in power to TV USB or the supplied 5V block or your own 5V USB source, turn on the TV and go through the prompts. Amazon did a great job making it clear and simple to begin watching.Now, onto the things that aren’t so perfect:Since the apps are all made by different companies, there is no universal navigation pattern. For instance, controls while watching a video on the Smithsonian App and watching a video on the Plex app are different. And while this doesn’t usually cause issues, if you are picky, this will stand out.Text entry without a keyboard can be aggravating, especially during setup. So save yourself some headache and download the app on your smartphone. Thank me silently after you do this .TL;DRPros:* Nice looking device and remote with everything you would need in the box* Fast responsive device, I have yet to have a freeze up* Easy to set up, takes literally minutes* Can \"Cast\" including Spotify, Netflix, Youtube etc. AS WELL as control content without a smartphone* Works with Logitech Harmony Smart Hub and Keyboard* Can use regular Android Apps like Camera software and games. (Flappy Bird!!)* Beautiful screen saver photos that you can skip and review with remote.Cons:* Lots of the navigation room in the UI is geared towards Prime users (Prime videos etc)* Setup can be a pain if you don’t download the app (text entry)* Remote is small and may get lost (again, download the app as an alternative)* Occasional UI differences in apps (just the nature of different app developers)* Apps are not updated as fast as Android phone apps, but not far behind.", "verified": true, "helpfulness": "0/0", "author": "Calvin H. Phuong \"laker fan\""}, {"rating": 5.0, "review": "I am not electronics savvy, but I had NO trouble \"installing\" the fire stick,  but I had a big problem installing the batteries in the remote.It was impossible to open the back of the case.  I actually had to to call the amazon help line (I felt really stupid). The woman was so nice and helpful and made me feel like this was a common problem.  Actually it might be.  You have to put extreme pressure on the remote to slide the back off.I thought it would break.  But it didn't.  I installed the batteries, set everything up (very simple) and have been enjoying it ever since", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 4.0, "review": "Works well but sometimes jumps ahead when making a selection", "verified": true, "helpfulness": "0/0", "author": "Joseph L"}, {"rating": 5.0, "review": "What's not to love? You get all the shows & movies & interests you love. Seems it's going to be saving me money because I won't need all that high priced cable bill.", "verified": true, "helpfulness": "0/0", "author": "Cynthia A. Stanavich \"CindyBear\""}, {"rating": 1.0, "review": "It did not meet my expectations at all. I can not watch Fox News live. I can not watch NBC andCBS, and ABC live. I can not watch the Sport channels. The only show that I can watch is CBS.News live.The bulk of the system is to watch old movies and old TV shows. It has been a disappointment since I can already do that on my cable TV.I hereby  request that you do  not bill me after the free time has expired.Yours truly,Paul Cavazos", "verified": true, "helpfulness": "1/2", "author": "PAUL CAVAZOS"}]