[{"rating": 5.0, "review": "Used to use Amazon prime through my PS3 but was a bit clunky. Bought the Fire Stick and it completed the experience. So easy to use and I synced it up to my Kindle tablet and that was a plus. If you're a Prime user, it's a must. A lot of bang for the buck.", "verified": true, "helpfulness": "0/0", "author": "Pit"}, {"rating": 5.0, "review": "If you have Amazon Prime, its a must-have!!!! I can't stress this enough. Portable, easy to use, fast connection to the internet(this is where it easily beats chrome), ever growing number of apps. The super responsive remote control is a huge plus. Beware however, that it is quite tiny so can be very easily lost, then you'll have to part with over $30 (come on Amazon, how can the replacement remote be more expensive than the entire unit). I also wish it could directly draw power from the HDMI connection so you don't have to plug it to a electric source. All in all, great buy! You wont be disappointed", "verified": true, "helpfulness": "0/0", "author": "Denis Odokonyero"}, {"rating": 5.0, "review": "This is awesome for binge watching!I wish Amazon would add Audible to the list of Apps.I strongly recommend Caller-ID (Fire TV Edition) by guidology. It is cool to see who is calling when you need to have your phone charging and it is not in plain sight.", "verified": true, "helpfulness": "0/0", "author": "G G W \"Old School Sci Fi\""}, {"rating": 5.0, "review": "Kids got this for their dad.  It is easy to use, works exactly as described.  Love getting all our subscribed shows on Netflix, Hulu, Amazon prime, etc. It's great!", "verified": true, "helpfulness": "0/0", "author": "Nancy O'Connell"}, {"rating": 4.0, "review": "Worked pretty well so far. No problems till date.", "verified": true, "helpfulness": "0/0", "author": "Gopalakrishna Kesavan"}, {"rating": 5.0, "review": "Works real well thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Much better than the Roku we had purchased.", "verified": true, "helpfulness": "0/0", "author": "Kendra Thomas"}, {"rating": 5.0, "review": "was more than expected.", "verified": true, "helpfulness": "0/0", "author": "Daniel A Canada"}, {"rating": 4.0, "review": "I am so happy with this and the availabity to watch so many more shows.  I gave it a 4 star rating because the streaming gets interrupted.", "verified": true, "helpfulness": "0/1", "author": "H. Miller"}, {"rating": 5.0, "review": "Love this little device. Great quality for a little price! Amazon does it again.", "verified": true, "helpfulness": "0/0", "author": "Matt W."}]