[{"rating": 4.0, "review": "Quick, nice interface, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Viktor Nikitenko"}, {"rating": 3.0, "review": "It may be due to our ISP but we have experienced difficulty  with every program we have watch ed.  After watching about a quarter of the program, it will buffer and then an error message comes on that says they are experiencing problems with that program, try a again later or choose another program or movie.", "verified": true, "helpfulness": "0/1", "author": "Jamie A Bennett"}, {"rating": 4.0, "review": "Nifty device, compact and competitively priced. Really enjoyable menu system, especially for amazon prime content. I have a hard time complaining too much about something that would've seemed like complete magic just a few short years ago, but it does seem like there have been a few bugs that have yet to be worked out of this new product. I have had a few occasional glitches, requiring restarting the device to regain proper function. Another glitch actually requires me to power down the television (something to do with copyright protection) periodically. It also constantly gives me a seemingly nonsensical error message along the lines of \"this application requires a fire tv remote that is not connected\". This happens as I am actively using the included remote to enter an app. Fortunately,  these messages can be dismissed with no further inconvenience. The advertising I've seen for this product is slightly misleading, albeit in an inconsequential way. There is a little more involved in installing the device than just plugging it in to the tv's hdmi port, since it requires a separate power supply plugged into a standard 120v outlet. After minimal research, it seems that the roku streaming stick also uses the same advertising strategy of presenting a super-easy installation by omitting the required power cord and supply from it's advertising images.", "verified": true, "helpfulness": "0/0", "author": "Matthew B."}, {"rating": 3.0, "review": "Love it, easy to install, great for everything.  Only thing I am curious about though, it seems that it does everything the Fire box does, so I am not sure why I would buy the box.  Just saying.Came early, as advertised, no issues.Okay, I am updating a new issue.  Netflix wont run for more than 40 or so minutes before disconnecting/freezing up.  I have to wait about 5 minutes, then it will play again.  I can access everything else.  The Fire box has no issues.  There is no connectivity issues as, like I said, everything else is accessible.  Sad day....", "verified": true, "helpfulness": "0/0", "author": "Anothony"}, {"rating": 4.0, "review": "Great little device. I haven't had any issues with it, and me and my girlfriend use it frequently for Prime Video, Netflix, Plex, and Youtube. The interface is friendly and easy to navigate. The controls are fairly intuitive. Plex compatibility is great. Dual band wifi (5GHz support) is awesome.My only complaint is no easy way to cast from my phone to the screen. Miracast has not worked for me reliably at all. I got it to work once on my LG G2, and once on a Samsung Galaxy S3, but that was after countless failures. I haven't tried using it since.", "verified": true, "helpfulness": "1/1", "author": "Stephen"}, {"rating": 2.0, "review": "Amazon content is easy to find and pushed on you.  Having trouble with the device and the web site is no help.  Cannot find a support number anywhere!  Check warranty to get it replaced and it says use contact info below but there is nothing but a mail address.  REALLY???? you want me to write a letter about a device not working?  Was hoping this might replace my cable service.  It worked for a bit but not much content I wanted.  Things I searched for were not available or at a fee.  At least I am not out a bunch of money and will just go Roku like my friends.", "verified": true, "helpfulness": "0/1", "author": "Richard Martin"}, {"rating": 5.0, "review": "Waited a long time to get this but we have really enjoyed it.  Canceled Netflix and use Amazon Prime all the time.", "verified": true, "helpfulness": "1/1", "author": "Russell B. Poole"}, {"rating": 5.0, "review": "Works great, easy to use and install, remote control is much easier to use than Chromecast's smartphone interface.", "verified": true, "helpfulness": "0/0", "author": "KellyK"}, {"rating": 3.0, "review": "The Amazon Fire stick is decent, but I still use it less than the Chromecast.The pros... finally, Amazon prime natively on a an HDMI stick device. The remote's also decent, but I find the default menus and features somewhat restrictive, so you'll still want to use your phone or add things to the watchlist first.The cons... feature wise, still not as good as the Chromecast. It also features a smaller app portfolio than the Chromecast. The Amazon Fire stick also has a higher power requirement, meaning, a lot of TV USB ports will be considered insufficient.Overall... unless you love Amazon prime videos, consider other options.", "verified": true, "helpfulness": "1/2", "author": "Justin L"}, {"rating": 5.0, "review": "I love it. Easy to set up and use. Glad it came with a remote.", "verified": true, "helpfulness": "0/0", "author": "Calinda Jones"}]