[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Antonio Carneiro de Oliveira Junior"}, {"rating": 5.0, "review": "I really enjoy having all of my Amazon Prime content so easily accessible for entertainment.", "verified": true, "helpfulness": "0/0", "author": "Carl Bush"}, {"rating": 5.0, "review": "The Fire TV Stick was even more than expected.  It is amazing. The whole family loves it!", "verified": true, "helpfulness": "0/0", "author": "Jevelyn Smith"}, {"rating": 1.0, "review": "We have had nothing but disappointment with the fire stick. While all other devices connect to the internet fine in our home, this never maintains a connection for long enough to do anything. By the time we browse for a couple minutes, the connection is lost. We try and try again, get reconnected, only for the fire stick to lose connection again. We restarted everything, reset the router, tried different hdmi ports... I think the item just doesn't work. I tried contacting customer service, it a too late for me to return the item, but have yet to get a resolution. Very disappointed. Perhaps we will get an additional Apple TV or Roku.", "verified": true, "helpfulness": "1/2", "author": "BioProfNV"}, {"rating": 5.0, "review": "This is awesome. GET IT!", "verified": true, "helpfulness": "0/0", "author": "crystal l skille"}, {"rating": 4.0, "review": "I like it, however, it does not offer the same options and easy accessibility as the netflix homepage does on the computer. I have to search directly for the movie I would like to view by typing in the alphabet or the name of the movie or actor. It's too much processing just to view a movie. Other than that it's pretty good. Much better than that piece of crap chromecast streaming stick.", "verified": true, "helpfulness": "0/0", "author": "djjahski"}, {"rating": 5.0, "review": "One of the best little gadget I have used and easy to take while travelling. The only update it needs is for authenticating WIFI @ hotels and HBO GO app.", "verified": true, "helpfulness": "0/0", "author": "markey"}, {"rating": 5.0, "review": "I'm very impressed how it works compare with others that I had tried before. I'm glad with my fire TV  stick. Thanks amazon!", "verified": true, "helpfulness": "0/0", "author": "Silvania"}, {"rating": 5.0, "review": "Love it.  Better than opur Apple TV for sure.", "verified": true, "helpfulness": "0/0", "author": "John Czumalowski"}, {"rating": 5.0, "review": "Amazing i get to see shows from my childhood", "verified": true, "helpfulness": "0/0", "author": "Gerard Robinson"}]