[{"rating": 5.0, "review": "Did not know how much I would actually use this until I got it. Now use it everyday to watch both Amazon Instant video and Netflix. Love it!", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "It's all about the price! 😀😜", "verified": true, "helpfulness": "0/0", "author": "Hartwell Peebles"}, {"rating": 5.0, "review": "Very easy to set up, not complicated at all.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Hock"}, {"rating": 3.0, "review": "Good performance and I have great internet connection. Sometimes I have to disconnect and reconnect to the wifi because it loses connection. There is a serious problem with the app that makes it unwatchable because of constant buffering. Very sluggish when it comes to streaming internet movies.", "verified": false, "helpfulness": "2/2", "author": "Angelica Aldridge"}, {"rating": 4.0, "review": "Great package with Prime service.  The remote could be more user friendly", "verified": true, "helpfulness": "0/0", "author": "Stacie Hamilton"}, {"rating": 4.0, "review": "This is the best thing ever! I can use one device for all of the streaming options and use my phone or the remote! I was tired of hooking up my Mac to the TV to watch movies and stuff, and our bluray player streaming stopped working, so this was perfect for us. Small, easy to use, and works great!", "verified": true, "helpfulness": "0/0", "author": "UserFriendly"}, {"rating": 5.0, "review": "Fits right in with no sticky residue, unlike competitor brands.", "verified": true, "helpfulness": "0/0", "author": "Raymond"}, {"rating": 3.0, "review": "Too small.  I had to retype things several times because I kept hitting one of the arrows by mistake instead of the center one.", "verified": true, "helpfulness": "0/0", "author": "Raquel"}, {"rating": 4.0, "review": "Amazon hit a home run with the Fire TV Stick! This has replaced my Apple TV (besides for AirPlay display) for regular use. The Fire TV Stick is very responsive, full featured, and the apps make it a great gaming device as well.Pros: TONS of content, Instant access to the Prime videos and music library, and very responsive.Cons: Needs to be restarted every few days, sometimes freezes between TV episodes. BUT- Amazon helped and replaced my first Fire TV Stick very quickly after issues.I'd definitely recommend! Especially for Prime users.", "verified": true, "helpfulness": "0/0", "author": "Jc"}, {"rating": 4.0, "review": "This is a great product, especially if you combine it with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Robert"}]