[{"rating": 5.0, "review": "Thrilled with all the free content.", "verified": true, "helpfulness": "0/0", "author": "EO"}, {"rating": 5.0, "review": "Totally rocks!  WAY better then Chrome Cast, (thought it does have it +'s)", "verified": true, "helpfulness": "0/0", "author": "Sigma Wolf"}, {"rating": 5.0, "review": "Very good, easy to install, easy to operate. Will recommend to buy it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Ivan"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Leslie Tolliver \"Leslie Tolliver\""}, {"rating": 5.0, "review": "Great Product!Perfect for HDTV's and has games for young kids!", "verified": true, "helpfulness": "0/0", "author": "Aniya Settles"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Mindy"}, {"rating": 5.0, "review": "Amazon really did this one right!  Super solid and stable OS.  Very powerful with no lag.  I use Plex as my main media center and with the app being available on the Fire Stick it makes it an ultra portable media player.  Amazon Prime videos & music is also a huge perk!", "verified": true, "helpfulness": "0/0", "author": "S. MANNING"}, {"rating": 2.0, "review": "So far, we are not happy with the fire stick. We received it yesterday and nothing seems to work properly. My 10 yr old is having more patients than I am. I have changed the password 3 times because none of them are working. Yes, we are connected to my wifi and set up according to the instructions. If things change I may change my review. But as of right now, not impressed!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "My family loves this. I wasn't fully using my Prime privileges because we didn't have a TV that would work with the movies. Now I can. Plus, the movies that aren't free are cheaper than Uverse. Loved the (free) Amazon series, \"Catastrophe.\" The stick was easy to install and simple to work.", "verified": true, "helpfulness": "0/0", "author": "Sara L. Ornelas"}, {"rating": 4.0, "review": "As a Prime member this is a great product for the price.Program selection and ease of finding show is great.  Not so great the tiny remote.Also I have found the sound quality is low.  Have to put volume at loudest to barely hear most shows.", "verified": true, "helpfulness": "0/0", "author": "Starbritefla"}]