[{"rating": 5.0, "review": "Using Amazon's game controller remote eliminates lost remotes!!! --My kids often misplace small remotes.  Amazon's game controller remote WILL link to the Fire TV stick, and it is almost impossible to lose it in a living room!!!  The voice remote @ $29 will also link to it.I really like being able to play music through Amazon and the Fire TV stick.  For about 30 minutes of nonuse, the Fire TV Stick displays a slide show of really beautiful scenes!We have both the Fire TV stick and Amazon's regular Fire TV device --- unless you're a gamer, the less-expensive Fire TV Stick will probably work just fine for you! ---", "verified": true, "helpfulness": "0/0", "author": "craigery"}, {"rating": 5.0, "review": "For such a small device, the Fire TV Stick really delivers. If you're an Amazon Prime member, then you'll find oodles of TV and movie offerings. You'll also find many of the streaming offerings available via other devices, including Netflix, Hulu+, and Crackle. The menu system is well laid out and easy to navigate. The streaming and viewing experience is excellent. Now the only thing that would improve this device would be to marry the Apple and Amazon ecosystems so that you could access digital content from either service over this one device. Perhaps one day! In any case, the performance of this device is superb and it would be difficult to complain.", "verified": true, "helpfulness": "0/0", "author": "Mike C."}, {"rating": 5.0, "review": "Wow, It  works so much better than what I expected. So much better than Chromcast.The fire stick really allowed me to enjoy the full extend of my Amazon Prime membership.I spend the whole day figuring out everything, and it has been a lot of fun.Pros:The UI was very informative and easy to navigate.The  remote even thou it's simple, it's very functional.I love how easy it was  to browse my photos in the amazon cloud drive.Very easy access to the Amazon Prime Videos.Cons:no on/off buttonno IOS app YET?Overall I'm very happy was my purchase of the Fire TV Stick.The $20OFF for prime membership was the first reason for my purchase to try it out, but have to say if I knew how good this was, I would gladly pay at the full price.", "verified": true, "helpfulness": "0/0", "author": "X. Chen"}, {"rating": 4.0, "review": "Very easy to use.need more apps and volume  control on remote", "verified": true, "helpfulness": "0/0", "author": "Albert Saldana"}, {"rating": 3.0, "review": "Great idea, but needs refinement.I love the easy access to my Amazon watchlist and the ability to check out my favorite shows on Netflix. That's what drew me to the Fire TV Stick. It replaced an outdated HDMI wifi converter for a Samsung TV.First - this thing is loud. I watch TV at night when my partner is sleeping. The clicking noise the remote makes is unnecessarily loud - imagine trying to click through 100 episodes of your favorite show. Terrible.Second - there's no backlight on the remote and there's no tactile feedback (small nubs) on any of the buttons to help orient you.Third - the stick lost connection 3 times during the first hours of use. The only way to fix it was to unplug it from its power source and wait 3 seconds. The feedback provided by the device when this happened was unnecessarily obtuse. I resorted to online forums for help.Fourth - the browsing experience is subpar. It feels like work rather than a joy to browse for something to watch. Browsing shouldn't feel like you're looking through a spreadsheet...Again, I love Amazon. I've been a Prime member for years. For me, the Fire TV stick is a great concept and I'll be sticking around for at least a few versions to see if Amazon can nail it.", "verified": true, "helpfulness": "1/1", "author": "Cassie L. Taylor"}, {"rating": 5.0, "review": "Wonderful product for the price. It made me my tv as smart.", "verified": true, "helpfulness": "0/0", "author": "Selvakumar M."}, {"rating": 3.0, "review": "I like the control is easier to watch tv now.. The only issue is that I have to sign in every time I use Netflix..😞", "verified": false, "helpfulness": "0/0", "author": "Alfredo H"}, {"rating": 5.0, "review": "Works just as well as my tablet, or laptop.  Video is just good as if watching my Satellite tv.", "verified": true, "helpfulness": "0/0", "author": "Wickedvox \"Erin\""}, {"rating": 4.0, "review": "Two reasons this is not getting 5 stars. 1st, it tells me its not plugged into the wall when it is. 2nd, it has yet to get HBO Go! But it was much more responsive and quick than I thought it would be. Simple and easy-to-use. The latter is important because it was for my 60 year old dad. Also, the setup was incredibly easy... hookup to TV and wall, select wifi, then say yes the account I ordered it from is the one I wanted it connected to and you're done.", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 4.0, "review": "GREAT Finally working , the set up took like forever about 1 hour or more , had to put in my internet password 3 times as the update just crashed on me- the update it self is a long process -  and well the fact that amazon prime video is only for the US is a bummer as i am out of the US , but i only really wanted it for NETFLIX and FINALLLLY its working , you have to update your payment with the device through amazon on a web browser as in you need to go back and forth from the computer to the TV, unless you got a Laptop or a phone , wish it was all a bit more easy- but now its working all is good for now", "verified": true, "helpfulness": "0/0", "author": "MR O"}]