[{"rating": 5.0, "review": "It's 20939094 Times faster than running Netflix or anything else.. through anything else.  Amazing Quality and Load time.  BUY THIS!", "verified": true, "helpfulness": "0/1", "author": "Robert Smallwood"}, {"rating": 1.0, "review": "The product won't boot after the second time of using it.  I have it plugged in via mini USB to a power source and also to the HDMI 1 port.  The simplified design and force reset seem to work, but it never gets to the home screen.  A waste of money.", "verified": true, "helpfulness": "1/3", "author": "Kenny"}, {"rating": 2.0, "review": "Doesn't work in motels on wifi. Lacks ability to accept terms of use needs to be felt with. Not as advertised use anywere. In able to use very disappointed.", "verified": true, "helpfulness": "0/3", "author": "matt miller"}, {"rating": 4.0, "review": "I got the stick sooner than anticipated and it was SO WORTH IT. I was thinking about getting the Chromecast stick, but since this one was about the same price AND it supported Prime TV and Movies I gave it a shot. I don't have HBO-Go, which was the only thing Chromecast had that this didn't - so no big loss.PROS:1. Super easy setup. Everything is included: batteries, power cord, and remote. All you have to do is plug everything in and configure to your WiFi.2. Free app on Android devices. Using the app I can navigate with just the sound of my voice, which is pretty cool.3. NO BUFFERING. Using my laptop, tablet, or any other device I have a hard time with buffering speeds, but this thing is quick and I can binge watch Netflix/Prime/whatever to my heart's content.4. Amazon Prime movies and TV. Since I'm a Prime member, being able to stream their exclusive content made all the difference. There's only so much stuff on Netflix, you know?CONS:1. Not available on iOS yet. I have an iPhone and tend to use that more than my Kindle, but they're working on having it out soon so I just have to be patient.That's actually the only con I have so far.", "verified": true, "helpfulness": "0/0", "author": "DaniZombie"}, {"rating": 4.0, "review": "Easy to hook up and use.  A little counterintuitive that it does not shut off, and the interface is a little clunky for the Amazon Prime options.  I am mostly using for a direct path to Netflix at a very low cost.", "verified": true, "helpfulness": "0/0", "author": "Sopasalex"}, {"rating": 5.0, "review": "Got my amazon stick in the mail last week. Within 15 minutes I had it up and running. After the tutorial video I started to enjoy Netflix and Amazon instant video. Now I can fully enjoy my prime membership. This is a must have device. Even if you do not have Netflix or Hulu, there are lots of other apps/channels to enjoy. Games are also available. I found it faster than the Roku stick that my sister has on her TV.  I would recommend this to a anyone.", "verified": true, "helpfulness": "0/0", "author": "Altair"}, {"rating": 4.0, "review": "It is delivered on Sunday. So its a good start. Installs easy. Works faster than the smart TV I have (Visio) so that's a plus. I did not like the fact I had to use a power adapter to power it.  Did not come with the popcorn pictured on Amazon. So there is that.", "verified": true, "helpfulness": "0/0", "author": "Funda Senyuz"}, {"rating": 5.0, "review": "Very impressed with how much power that little thing has and all the features it has to offer. Simple, understated, portable and everything works as it should. Pretty quick actually, considering the hardware, but sometime it would take a bit longer to load \"Home\" screen. I'm sure more apps and updates will be coming, but as of right now it has all the essentials for content streaming and entertainment. I only play actual games on PC so I cannot comment on how well it handles any games that are available.I hope to see an internet browser in the future such as Opera or at least Chrome. I hope will soon get the ability to customize the home screen and themes. Would also really like just more andoird apps to be released and supported.", "verified": true, "helpfulness": "0/0", "author": "Alex Dubrovsky"}, {"rating": 5.0, "review": "I love my Fire TV Stick. Personally I think it's better and more user friendly than Google's Chromecast. It's cheaper and just as good as late model Roku's. I'm sure the \"channel\" or app selection will increase over time.", "verified": true, "helpfulness": "0/0", "author": "Noah Brennan"}, {"rating": 5.0, "review": "This works great.  No complaints.", "verified": true, "helpfulness": "0/1", "author": "Patrick M."}]