[{"rating": 1.0, "review": "Piece of crap", "verified": true, "helpfulness": "1/8", "author": "steve matthews"}, {"rating": 3.0, "review": "It's okay. I don't know what more elaborate statement to make than \"it's okay.\" We expected it would offer more free access to movies, shows and more. We strongly dislike that it needs to be plugged into an outlet and cannot be relied on simply when the Stick is inserted in the HDMI port. If we could go back we wouldn't have spend the money.", "verified": true, "helpfulness": "0/0", "author": "Molly"}, {"rating": 3.0, "review": "Have only used this device, a Chromecast, and AppleTV (with Plexconnect). Chromecast is too different imo to compare, so versus the AppleTV (which may also be an unfair comparison, but meh)Fire TV Stick:-Has more apps-Remote doesn't need line of siteApple TV-Has a \"snappier\" interface-Is organized better/simpler, dumbing it down for a better experience.Dislikes:-Outdated Plex client (which still works fine, except for it not loading the library all the time, but you just have to refresh the Plex App and they load)-Crowded interface... everywhere. Within Netflix, within Plex, on the right-skewed home screen. It's fugly.-This was a HUGE one for me. The device refused to connect to stay connected to Wifi because I have slashes in my password (not sure which kind really impacted, as I had both). So I had to change the password on all my devices, which sucked. This was true even after the firmware was applied.-Had to call support to try to figure out the wifi issue. Tier 1 was like talking to my mother about tech stuff. Tier 2 was like talking to old Dell support who was reading from a script, but just letting me try things without guidance. Neither were even close to being able to provide a solution, but they were nice.May, update this as time passes, as this review is only day one.Honestly, if Apple actually released something new, with an App store, I would just stick with that. But since they are making me feel like a chick waiting for her BF to propose, I have to explore other avenues. Can't wait forever.", "verified": true, "helpfulness": "1/2", "author": "Saul Villalobos"}, {"rating": 4.0, "review": "Very happy with this.  Wish it did a better job at telling me where else I can watch a show, for some shows I've noticed it'll tell me I can also watch it on Hulu but there are still a lot of shows where it doesn't give me any other options even though I know they are on Hulu or Netflix.  However other than that I thought setup was very simple (I did hate being forced to watch the Welcome video) and I just really like it, it's nice and fast.", "verified": true, "helpfulness": "0/0", "author": "STUFF"}, {"rating": 4.0, "review": "As far as a cheap way to stream netflix it was pretty awesome, but if you want the absolute best streaming experience I'd say go for the fire tv or the roku 3 instead. The only thing that upset me is it dosnt come with the voice search remote you gotta buy that one separately, but you can download the fire tv app that allows you to use the voice search (which works very very well but only for amazon instant video content) for free so I guess its an even trade off. All in all if you want a reasonably priced way to watch netflix or hulu on the big screen than this is the product for you.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Purchased it on sale for $25.Very intuitive, easy setup. The streaming is fast and seamless. Great games and apps my family loved it. I was so pleased I purchased a second one two days later for the tv in the family room . Great product!", "verified": true, "helpfulness": "0/0", "author": "Sammie Wright III"}, {"rating": 1.0, "review": "Says its miracast certified but doesn't work with Surface Pro 3 or a phone.  Oddly have to be in settings to also even attempt to connect over miracast.Dongle does not support WPA enterprise either I am not sure how when android supports WPA enterprise they can't make a dongle support a decade old tech but it doesn't.", "verified": true, "helpfulness": "4/6", "author": "West Fan"}, {"rating": 5.0, "review": "Very easy to install and set up. The interface is faster and better looking than my Roku. I like my Roku a lot, but I wanted to stream Amazon Prime on another TV, so I bought the Fire TV Stick because it was cheaper. So far I actually like it better. Only thing missing on the Fire TV Stick is the headphone jack on the remote that my Roku has, but that's not an issue for me on this TV, so I don't miss it.", "verified": true, "helpfulness": "0/0", "author": "YetiYeti"}, {"rating": 2.0, "review": "On Day 1, the Fire Stick was everything I dreamed it would be. Easy to set up and simple interface. I went on a Netflix binge for a majority of my day!  On Day 2-3.... It is about to be put in the box and shipped back to Amazon. It is poorly responsive at best. Sometimes taking up to a full minute to respond to just one click of the remote. Then it goes crazy and flips through pages like it is possessed. When I finally get to a show (which takes about 10 minutes of not so much patience and many expletives), it buffers several times. Not a wifi issue as I can stream the same content to both my phone and laptop with no issues.  Was truly excited for this product and am deeply disappointed That already I can't even use it. At least I got one day of Scandal Season 1 bliss from it, that is the only reason I gave an extra Star.", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 2.0, "review": "Cannot view movies on Netflix and Amazon Prime.  Keep getting an error code on TV screen.", "verified": true, "helpfulness": "0/0", "author": "Denise A. Wasson"}]