[{"rating": 5.0, "review": "thinking about buying a second​ one", "verified": true, "helpfulness": "0/0", "author": "Sean B."}, {"rating": 5.0, "review": "Best thing ever. Its been a long time that I just did a plug and play and enjoyed ! Found my account, loaded everything, movies, music etc. Its a must have.", "verified": true, "helpfulness": "1/1", "author": "Gerald V. Poirier"}, {"rating": 5.0, "review": "i used this on an older tv with a rc to hdmi adapter and it works great , lots of interesting programs", "verified": true, "helpfulness": "1/1", "author": "ronald dickey"}, {"rating": 5.0, "review": "Works great.  I thought I would want chrome too, but no need.  Fire stick app works great.  Only thing I wish this had is an rdio app.", "verified": true, "helpfulness": "1/1", "author": "Daniel Aaron"}, {"rating": 5.0, "review": "exceeded my expectations.  Easy to setup and delivers a clear stream quickly.  Easy to setup the phone based remote too.Thank you", "verified": true, "helpfulness": "0/0", "author": "stephen rathe"}, {"rating": 5.0, "review": "Works great I have three of them in our house.", "verified": true, "helpfulness": "0/0", "author": "Jason Tolly"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Denton Koons"}, {"rating": 5.0, "review": "I was amazed at how easy this was to set up and use. I was concerned that my 2008 Samsung HDTV wouldn't be compatible but I had absolutely no problems. My wireless is set up on the other side of the house but, again, no problems at all.Be sure and set up the Amazon music app if you've purchased any music through Amazon. Be cautious when adding \"free\" apps because most have a subscription. I do stream Netflix but I'm also using completely free apps from PBS, Smithsonian and YouTube. I am free from cable and now traditional broadcasting. It's a good thing!", "verified": true, "helpfulness": "1/1", "author": "Jean Jackson \"Jean\""}, {"rating": 5.0, "review": "I cut ties that bind, cable that is, and I love the emancipation. This Fire Stick was ridiculously simple to install, as in just plug it in.", "verified": true, "helpfulness": "1/1", "author": "slim5555 \"CAK\""}, {"rating": 5.0, "review": "This is an amazing product. I feel it worked flawlessly, and turned any regular television, that's not connected to cable, into a loaded television with all kinds of opportunities ( yes, it will work on a television that has cable as well.) The games are fun to play, it streams very well, and has a wide range of choices; both free and pay. For the price I would suggest it over any competitor.  Also, ordering is very simple to do. Just click on the item you wish to pay for and the bill goes right on your Amazon credit card, or whatever credit card you have registered. Perfect!", "verified": true, "helpfulness": "1/1", "author": "metal1121"}]