[{"rating": 4.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Peri like that everything I have ordered online for music and video is available through the stick.  Setup was very easy.  Don't care for pause in the middle of music or video waiting for download to catch up.", "verified": true, "helpfulness": "0/1", "author": "nobilar"}, {"rating": 5.0, "review": "Works fantastic!  Was able to set it up in 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "D. Albert \"glueexpert\""}, {"rating": 3.0, "review": "Still trying to figure them out.", "verified": true, "helpfulness": "0/0", "author": "Krista Rockwell"}, {"rating": 4.0, "review": "A", "verified": true, "helpfulness": "0/0", "author": "Rebecca wilshusen"}, {"rating": 4.0, "review": "I'm pretty surprised and happy with this little gizmo. I figured this was a good way to try out the fire tv experience without going all-in with the box, and so far I've been pretty impressed.  We have two smart TVs in the house, as well as other smart devices so we've been watching online content for a while, but this device makes accessing the content a lot easier.  Registration and use of the device is easy, only takes a couple minutes if you already have a prime account.  There is a bit of an amazon slant to the interface and content, but that is to be expected.  The android app for it works pretty well, though it can be a bit quirky at times.  The voice search makes life a lot easier for sure.If you are planning to use this for games, I'd suggest getting a couple of the game controllers.  This was never my intent but my 7 yr old loves using it for games so I guess I know what I'm getting him for his birthday.  Also, the fact my 7 year old can use it should tell you something.One word of advice for those with an AV receiver - plug the stick into an open hdmi port on the receiver rather than the TV.  For me it made life easier, but it will work either way.  Just a few less clicks and steps to use it when it's plugged into my receiver.All-in-all, great little device.  Good enough that I'll probably buy the fire tv box for our main movie setup and use this on our secondary setup.", "verified": true, "helpfulness": "0/0", "author": "transplant yooper"}, {"rating": 5.0, "review": "Amazing visual entertainment benefits for the price!", "verified": true, "helpfulness": "0/0", "author": "Webster54"}, {"rating": 1.0, "review": "you cant open back of remote to insert batteries. Go to web, Google- insert batteries into Fire Stick- and read how people feel. Amazon should recall product. Bezos should run his business rather than newspapers.", "verified": true, "helpfulness": "0/1", "author": "Philip Guthoff"}, {"rating": 4.0, "review": "Great value, easy to set up and navigate, compares very favorably to others I have used (Apple TV, Roku, Chromecast).  Docking it one star for the terribly designed remote- you shouldn't have to search the internet and cut yourself on an xacto knife to get the batteries in!!", "verified": true, "helpfulness": "0/0", "author": "nyshoelover"}, {"rating": 1.0, "review": "This device is so frustrating!  Too many problems with it keeping connected or pausing during streaming and it always happens at the most inopportune time.  I have a high end performance wireless router so that is not the problem.  My IPad never has any issues using the same wireless router.  I finally pulled the Fire Stick and went back to using a Wii game controller and it never loses connections.  I waited too long fiddling with the Fire Stick and can’t return it.  I wasted $39 on the Fire Stick and caused myself a lot of frustration.  Do not recommend this streaming device.", "verified": true, "helpfulness": "0/1", "author": "kevin kaiser"}]