[{"rating": 5.0, "review": "I love the Fire Stick. My question is - how often are new movies added to Prime?", "verified": true, "helpfulness": "0/0", "author": "Susan J. Sheldon \"book crazy\""}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Ronald"}, {"rating": 5.0, "review": "I cut cable and couldn't be happier!!  Amazon Fire Stick is more than enough tv for me especially with prime video and Sling app.  Seriously I saved $1,500 per year and the fire stick is seamless.  I absolutely love this set up!!!!! This is where tv is going and once again Amazon is right there. Amazon makes it so dang easy it was a no Brainerd.  I've also found some really good Amazon series such as Bosch. I've reAd all 22 Connelly books and the first series they produced is a rival for any prime time or HBO series out there! Really well done!A side note... I bought new 50\" flat screens in addition to the fire sticks and in 2 days had a brand new set up!!", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "My netflix playing machine!", "verified": true, "helpfulness": "0/0", "author": "jdelbs18"}, {"rating": 5.0, "review": "Works great. I also have an older Roku and they both work well.The only issue i run into is Netflix will wig out.The wifi signal should be strong to get the HD movies from prime.Overall very satisfied.", "verified": true, "helpfulness": "0/0", "author": "jjmoose"}, {"rating": 5.0, "review": "I tend to write overly verbose reviews so I'm gonna try to tone them back as most folks don't seem to appreciate the time and trouble I spend on them so I'm scaling back big time. Wow this is a big time improvement over my old old roku box is it's fast and responsive if I could change one thing about the stick and it really doesn't have anything to do with the stick ( well sorta don't) the phone app is not as good as roku because it doesn't have directional buttons it has a directional pad but other than that I really like the little stick I'll be buying another one as soon as I can afford it ( yes I'm that poor lol ) a def recommend and five stars and I thought I liked the roku yeah not anymore.", "verified": true, "helpfulness": "0/1", "author": "tonebone"}, {"rating": 5.0, "review": "This was easier to start using than I thought it would be. It's basically plug and play. It's very intuitive once you start playing around with it. We are using it on a non-smart TV in our bedroom and it works great. I just wish the remote control could also control the volume on the TV so that I wouldn't have to use the other remote.", "verified": true, "helpfulness": "0/0", "author": "Heather Liggett"}, {"rating": 2.0, "review": "I am disappointed with it. Sometimes what the characters say would cut off, not sure why? That's why I ordered two fire tv.", "verified": true, "helpfulness": "0/0", "author": "DW"}, {"rating": 4.0, "review": "Previous Fire stick gave out after 6(?) months, stuck in a reboot loop, but Amazon tech support was kind enough to replace it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Freakin' LOVE my firestick. If you're an amazon prime member and haven't ordered one yet you are shortchanging yourself. there are hundreds of thousands of movies to choose from for prime members, as well as youtube,  sling tvvevo, vimeo,pbs kids, hbo-go, netflix and hulu, a gajillion apps....i couldn't be happier. I got my cable turned off because this thing is so awesome- i don't need it anymore. If you're a prime member- get one. now. Even if you're not a prime member you can still enjoy the awesomeness- but the firestick makes your prime membership SO WORTH IT. i'm not one to write reviews but I am all about this. Great product, great price- get one. Now.", "verified": true, "helpfulness": "0/0", "author": "Javonne Winston"}]