[{"rating": 5.0, "review": "Works great very satisfied.", "verified": true, "helpfulness": "0/0", "author": "linda capetillo"}, {"rating": 4.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Chris Johnson"}, {"rating": 4.0, "review": "So far, I am happy with the product.  I haven't had time to watch as I wish to, I am pleased so far with how easy it was to set up and the ease with which I can find things and view my favorite shows.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "very easy to set up and use to stream prime movies, prime music, youtube,etc", "verified": true, "helpfulness": "0/0", "author": "Momma parcelli"}, {"rating": 2.0, "review": "doesn't get very good internet so it's hard to stream movies.", "verified": true, "helpfulness": "0/1", "author": "Alex Huynh \"The Baller\""}, {"rating": 5.0, "review": "It was so easy to install.  I bought this for my family to have more programs to watch and get movies easier. Now I don't have to leave my house to rent a movie .  I also bought the voice comand remote and that was so easy also to conect with the other remote . We only had it for a few days but so far we are very happy .Before we got it, I called to check into prime and everyone I talked to, were very helpful.", "verified": true, "helpfulness": "0/0", "author": "Sophie"}, {"rating": 2.0, "review": "Didn;t do what I expected it to do.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I had hoped that there would be more available apps for the device. My Roku device provides access to many more apps. I do realize that the Fire Stick has not been around as long as Roku, so I will reserve my final judgement once I see if more desirable apps become available over time.", "verified": true, "helpfulness": "0/0", "author": "jlacewell"}, {"rating": 5.0, "review": "I LOVE the Fire Stick. We have the Roku and the Fire Stick and the platform on the Fire Stick is my favorite. We no longer have cable or satellite so we use ours every day. It is a MUST buy if you want to stream to your TV and do not have cable or satellite. Prime is definitely worth it too! So much cheaper than paying a monthly bill to satellite companies!", "verified": true, "helpfulness": "0/0", "author": "Ashley Gonzalez"}, {"rating": 4.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/0", "author": "Stephen Swanson"}]