[{"rating": 5.0, "review": "I love the Fire TV. Better selection of videos and movies than NetFlix, in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Anne C Smith"}, {"rating": 4.0, "review": "Good REmote.", "verified": true, "helpfulness": "0/0", "author": "L. Cole"}, {"rating": 3.0, "review": "I really wanted to love the heck out of this, however, there are some significant problems. We bought the Fire Stick to avoid having to hook up my laptop every time we wanted to watch Amazon and other streaming movies. The set up was fine. However, it drops the network connection constantly and sometimes the buffering makes watching impossible. It happens so frequently, that every time we have rented a movie from Amazon, they have automatically refunded our rental price (without us having to ask), as they obviously detected the issues we've had. And forget about using your iPad or other wi-fi device while using the Fire Stick.Pandora is okay - Youtube is hit or miss.When I hook up my laptop, we do not experience this at all, so my only guess is that the network device in it is very weak.UPDATE: 4/14/15: Signed on to HBO stand alone service. Saw that Fire Stick had the app - downloaded the app only to discover that Fire Stick does not support HBO GO/NOW unless you have a cable subscription (which kinda defeats the whole purpose of a stand alone service). Seems HBO has an agreement with Apple, so I can watch it on my iPad, or laptop, but not FS.  Broke down and got an Apple TV receiver for HBO. Will use the FS for Amazon.", "verified": true, "helpfulness": "1/1", "author": "Laura M. Collins \"Lures Vegetables into Puff Pastry\""}, {"rating": 3.0, "review": "Had Roku for a number of years and use for streaming video from Netflix.  Bought the Firestick because it was cheaper.  Initial set up was more difficult than Roku as Firestick requires you to create an account and link a CC even when getting \"free\" apps. Once set up seems to work great.  My daughter loves the free games she can download.", "verified": true, "helpfulness": "0/0", "author": "Papichungo"}, {"rating": 5.0, "review": "Great bargain ... Easy installation ... Very pleased with purchase.", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 1.0, "review": "This thing is a great disappointment !  I bought it so my husband who retired recently could have additional options to watch on TV this winter.Even though it says the WiFi signal is good this evening and I am on the computer so it does work, we couldn't get it to bring up the show he wanted to watch.  Kept getting a message to check your connection.  The last movie he watched kept buffing or whatever you call it and he final just turned it off.  Not sure if it is the Fire Stick or Amazon Prime; but, I have nothing good to say about this experience!  May try Netflix and see if it works any better!", "verified": true, "helpfulness": "1/1", "author": "Lynn Reener"}, {"rating": 5.0, "review": "User friendly.Need more time to watch", "verified": true, "helpfulness": "0/0", "author": "Brian Shannon"}, {"rating": 5.0, "review": "Best thing ever!", "verified": true, "helpfulness": "0/0", "author": "Rachel Kelley"}, {"rating": 4.0, "review": "Works really well but could use a more friendly interface.  Not the easiest to navigate.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fast and easy works great!👍", "verified": true, "helpfulness": "0/0", "author": "Jamie sparks"}]