[{"rating": 5.0, "review": "Seems to have everything the box has (video wise) And the idea of just taking it with you sounds great.", "verified": true, "helpfulness": "1/1", "author": "Garey L Wheatley"}, {"rating": 1.0, "review": "AMAZON IS GIVING INVITES TO PURCHASE ECHOS TO THEIR CLIENTS WHO RATE THEIR PRODUCTS HIGHLY WITH 5 STARS FIRST!!!!!!!!BECAUSE THEIR FIRE STICK CANNOT COMPARE TO A ROKU 3 IS NOT MY FAULT!  BUILD A BETTER PRODUCT AMAZON!!!Worth $19 bucks I guess but that's it!I expected more!Fast response but UI needs work........Pros (NOT MANY!)* fast response from remote( processes quickly between content pages)* great for Amazon content* great for Amazon Cloud contentCons* Takes too long to scroll through bands/groups to find songs to play with cloud* poor at searching for non-prime content. (VERY POOR!)* cannot organize home page* remote is tiny and will get lost.* needs direct sight to pickup wifi signal (This wouldn't work in a bedroom that my secondary Roku 2 worked fine in)THIS IS INFERIOR TO THE ROKU 3 IN JUST ABOUT EVERY WAY!The searching capabilities on this just stinks to be honest. If you want a search engine that will search not only Amazon content BUT....Also Hulu, Netflix and others the Roku 3 is the way to go. You can also customize the home page with what apps you like on a Roku 3 and with this you cannot.Sorry Amazon but this device is fine for a bedroom TV but the family room deserves the features of a Roku 3!", "verified": true, "helpfulness": "3/5", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Keeps dropping the network connection.Very weak selection of channels,particularly news and sports.Back to Roku.", "verified": true, "helpfulness": "3/5", "author": "Kindle Customer \"wrb1947\""}, {"rating": 5.0, "review": "Video has great quality", "verified": true, "helpfulness": "1/1", "author": "regina gillenwater"}, {"rating": 5.0, "review": "I am very pleased with the quality of the Fire TV Stick. Though initially I did have trouble setting it up in terms of downloading the software (due to Time Warner Network Congestion perhaps, it took many trials), it finally downloaded the software  and it is working great! Great quality. Well pleased.", "verified": true, "helpfulness": "1/1", "author": "Mike M"}, {"rating": 5.0, "review": "This product is easy to set up and very easy to use. In very happy with this product and recommend it to anyone looking to purchase it.", "verified": true, "helpfulness": "1/1", "author": "Chris"}, {"rating": 5.0, "review": "review in advance.  will be great not to have  more wires.... already placed order", "verified": true, "helpfulness": "0/1", "author": "clark foster johnson"}, {"rating": 5.0, "review": "Now that I have enough bandwidth = or strong enough Wi-Fi signal this thing works really nicely.  I ended up putting an access point close to the TV where this was to be used which brought me from having pauses using NetFlix to getting the movies in HD with no pauses.  Easy to setup, easy to use and lots of features.  This will replace my blueray player, which was simply being used for NetFlix access.  Additionally the Prime Instant Video app is easy to use and works great!", "verified": true, "helpfulness": "1/1", "author": "RPM \"RPM\""}, {"rating": 5.0, "review": "This devise is great. I have had a Chromecast for a while but had trouble syncing with Google chrome. Alway had to have my computer to run Chome Browser to log into Netflix or amazon prime load a movie and then \"Cast\" to Cromecast.With Fire TV stick, once setup with wifi source, everything is there when I select the HDMI channel. I had to signin with Netflix, Amazon Prime new me without any action.Now no computer required like chromcast. Extremely easy to use anytime by just selecting HDMI channel.", "verified": true, "helpfulness": "1/1", "author": "Ralph M Tait"}, {"rating": 5.0, "review": "Excellent so far. Very easy to setup and configure. Glad I made this purchase.", "verified": true, "helpfulness": "0/0", "author": "freddg"}]