[{"rating": 5.0, "review": "Was everything I expected it to be.", "verified": true, "helpfulness": "0/0", "author": "Steve Krogh"}, {"rating": 2.0, "review": "The price is right, and having HD is nice, but the menu is really tough to use, even for Amazon video.  Trying to navigate through Netflix is really tough (there is a reason that Amazon sells it cheaply) and really frustrating.  It isn't hard to build an intuitive menu.", "verified": true, "helpfulness": "1/1", "author": "Pete outside the beltway"}, {"rating": 4.0, "review": "Love this product. Four stars because Netflix has some glitches with the keyboard to enter  user name and password but that is not the fault of this product. Can still get it to work. All other movie streaming programs have no problems.great product.", "verified": true, "helpfulness": "0/0", "author": "Laurie A. Jehlik \"ljr\""}, {"rating": 1.0, "review": "Still haven't gotten it to work with my smart TV", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fire stick is great, easy to install, especially for someone who is not real technically savvy.I love being able to watch movies from Prime on my TV.", "verified": true, "helpfulness": "0/0", "author": "Audrey Sansone"}, {"rating": 5.0, "review": "Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Iris"}, {"rating": 5.0, "review": "I love Amazon Fire tv! No cable or satellite tv in this house, antenna and Amazon Fire is all we need!", "verified": true, "helpfulness": "0/0", "author": "Cynthia R. Johnson"}, {"rating": 5.0, "review": "No problems to speech of at this time great product", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 1.0, "review": "I am usually in New Zealand and wanted the stick to mirror my kindle. Unfortunately it spends it time getting emotionally prepared to do it but never does it.Bye the way Netflix now works in NZ, it would be nice to have Prime here as well.", "verified": true, "helpfulness": "0/0", "author": "john fairweather"}, {"rating": 2.0, "review": "I purchased the Fire TV Stick due to online reviews.  But for me, I am compelled to give it a 2 star rating because I could never get it to reliably connect to my wi-fi router.  The user interface seems good, but without being able to connect to program content, I couldn't do a proper evaluation.  It would only connect when I was no more than 10 feet from my router and that is not acceptable.  My Roku boxes all work fine everywhere in my house.", "verified": true, "helpfulness": "0/0", "author": "JerryS"}]