[{"rating": 5.0, "review": "I saved over $100/month from cable but kept the internet.  Fire TV Stick  was very easy to install and every thing they said would work did.  It should be noted that you have to have a little patience in understanding this new format but it works great.", "verified": true, "helpfulness": "0/0", "author": "James Smith"}, {"rating": 5.0, "review": "Love it, easy to use! Love the remote", "verified": true, "helpfulness": "0/0", "author": "Stephanie T"}, {"rating": 5.0, "review": "It's the best thing Since sliced bread", "verified": true, "helpfulness": "0/0", "author": "Eugene"}, {"rating": 1.0, "review": "Duplicate serial numbers!  Amazon registered my device to someone named Milton.  After 2 hours of being transferred around and a bad Amazon rep. not even documenting our conversation, and a supposed manager calling me back and immediately hanging up after saying hello... I finally was able to call again and get transferred to better reps.  They are sending me a new stick.  Only wasted over two hours ona Saturday night to get them to replace their screw up.  Duplicate serial numbers... how very stupid is that.  And horrible customer service on top of it.  unusual for Amazon, but it happened and I'm not happy.Now I see the replacement stick being sent is refurbished!  Can this get any worse???Had to file a BBB bait and switch complaint.  :-(", "verified": true, "helpfulness": "0/0", "author": "Barb"}, {"rating": 5.0, "review": "I ordered this when the prime event was taking place. This thing is awesome and just what I needed. There was no need for me to play games on it, so I use it for videos only. The best part is that I can also access my purchased videos and TV shows. This is a big plus for me. I also watched a nice two hour movie in 1080p and this thing consumed about 10GB of bandwidth. That works out to about 10mbps internet connection required if I calculated properly. Internet speed was not really a problem for me, but it might for others.My Setup: Unifi AP-LR 300mbps, 85mbps internet connection, Polaroid 1080p TVI posted a picture of the bandwidth consumption and the device next to a tape measure for those who are space limited.", "verified": true, "helpfulness": "9/9", "author": "Derek Frohock \"Derek6711\""}, {"rating": 5.0, "review": "I love it.  Works great. Makes watching Prime Instant Video, Netflix and Hulu  Plus as simple as can be.  I ordered it a month or so ago with estimated delivery of Jan. 5.  It was delivered Dec 12.  I've used it every day. I'm considering dropping cable since I watch more Prime, Netflix and Hulu Plus since receiving my Fire Stick.  Best purchase I've ever made.", "verified": true, "helpfulness": "1/1", "author": "John M. Peck"}, {"rating": 4.0, "review": "You tube is missing,with that it would have been a great device but I really miss you tube on amazon fire tv stick.", "verified": true, "helpfulness": "1/1", "author": "Nidhi Arora"}, {"rating": 5.0, "review": "Great streaming stick with cool interface", "verified": true, "helpfulness": "0/1", "author": "onel"}, {"rating": 4.0, "review": "Do you need to purchase Netflix hulu etc monthly also or  is it covered with  the fire stick monthly fee", "verified": false, "helpfulness": "0/1", "author": "DeAnna"}, {"rating": 3.0, "review": "This device works ok.  Feels and acts like any Smart TV menu, but has a lot more options than my Sony Network options.  The primary reason I got this device is to watch ESPN on my Sony 4K TV, and after some initial lag, ESPN comes through just fine.  The free stuff (apps, games) included with Fire TV will keep you occupied for hours.I'm sitting about 10 feet from my TV, and the Fire Stick is plugged into the back of my 55\" with the included 6\" extender (to try to get better connectivity to my router and remote).There is a noticeable lag (~.3 seconds) on the remote and sometimes the cursor skips sporadically (moves 2-3 spots instead of 1 or doesn't move at all).  It's so bad, you can't play a SERIOUS game of PBA Bowling (\"I'm perfectly, calm, Dude.\").  I still can't get this device to register with my 5.8 ghz network (I register 3 of 4 bars on the network, but the Stick won't authenticate the network).  It connects to the 2.4 ghz network just fine.For $20 (Prime pre-sale), I won't raise a stink.  But now that games are off the table, I wonder if the Fire TV is any better for the extra money.  I'm nervous to try out the joystick on the Fire Stick, and likely won't now.PROSInexpensive.It makes any TV \"Smart\".Entertainment for the whole family.CONSNetwork connectivity.Remote function.Believes in nihilism.", "verified": true, "helpfulness": "2/2", "author": "J. Stockman \"MidCitySlim\""}]