[{"rating": 4.0, "review": "Internet connection can be a little spotty at times but that may be an issue with my network more than with the stick itself. It would be nice if it didn't have to be plugged in to the wall so it would be easier to move from room to room. I haven't been able to figure out how to search for apps or see all apps; I can only see the very limited list of Amazon recommended apps. Fire stick remote app for iPhone is only good for the keyboard otherwise the remote itself is easier to use.Other than the gripes listed above I am very happy with it. It works as expected and has a muchore user friendly interface than the Vizio smart tv menu.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Gomez"}, {"rating": 1.0, "review": "Too difficult to setup", "verified": true, "helpfulness": "0/0", "author": "Mehul Rupapara"}, {"rating": 4.0, "review": "Great concept but my Wi-Fi , I guess isn't strong enough. All it did was buffer. I'm keeping it so I can try it at hotels our friends house. Crossing fingers.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "works great, I just wish I had more data allowance on my internet provider", "verified": true, "helpfulness": "0/0", "author": "Tim Lefort"}, {"rating": 5.0, "review": "I love it so glad you came out with it", "verified": true, "helpfulness": "0/0", "author": "nancy herbrand"}, {"rating": 4.0, "review": "Very nice device. So far, so good!", "verified": true, "helpfulness": "0/0", "author": "Marcio F Silva"}, {"rating": 5.0, "review": "Like the independence of watching the shows as I have time.", "verified": true, "helpfulness": "0/0", "author": "Shelly \"MLFeather\""}, {"rating": 5.0, "review": "Great way to watch TV!!", "verified": true, "helpfulness": "0/0", "author": "Tomsbigtrucks"}, {"rating": 5.0, "review": "I love the fire stick. It works great and has a lot of capabilities.", "verified": true, "helpfulness": "0/0", "author": "Laura Trice"}, {"rating": 5.0, "review": "I have bought three of these over the last month, and I couldn't be happier with them. Coupled with Amazon's prime  content library, I look forward to interesting viewing each evening. Most important however, is this device will enable me finally to \"cut the cord\" with my current cable TV provider, thereby saving me  approximately $100 a month when coupled with a free airwaves HDTV indoor antenna to pick up the main four networks (which I really do not watch) and, most importantly, three PBS  channels which I do watch every day. The firestick is easy to install and set up and I've also given one as a gift to a friend.  I highly recommend this item and it's time that the public strike back at the ongoing  and accelerating centralization and monopolization of the cable and broadcast entities.", "verified": true, "helpfulness": "0/0", "author": "David Atlas"}]