[{"rating": 5.0, "review": "You will love it when you understand the full potential of the device and what its capable of.", "verified": true, "helpfulness": "0/0", "author": "Phillip A Perez"}, {"rating": 5.0, "review": "This is the HDMI add-on that everyone should have.I have watched Amazon streaming movies on my computer, usually without problems. This TV Fire Stick adds a streaming buffer that provides perfect viewing. It took less that three minutes to configure and then the thing worked flawlessly.I have to admit that it is so logical and linear ... I didn't read the instructions. As a Prime member it came pre-configured with my info (really nice)!I will purchase another one for my \"man cave\".", "verified": true, "helpfulness": "0/0", "author": "Mogambo"}, {"rating": 4.0, "review": "Easy to install, inexpensive way to make your TV smart. Would have liked the option of using wired network connection.", "verified": true, "helpfulness": "0/0", "author": "Roger Rotor \"mofo1\""}, {"rating": 5.0, "review": "It was very easy to use and works just like I hoped it would.", "verified": true, "helpfulness": "0/0", "author": "Virginia A. Haase \"Book Loaner\""}, {"rating": 5.0, "review": "I love the fire stick, it's so easy to use and install. I don't game on it but it makes watching netflix and amazon prime movies easy!!", "verified": false, "helpfulness": "0/0", "author": "John Mcknight"}, {"rating": 5.0, "review": "Fire stick lived up to it's ads- It does all it's supposed to and then some.  Good quality picture and good selection of programs, movies, and shows.  I'm happy I bought it!", "verified": true, "helpfulness": "0/0", "author": "Duffer513"}, {"rating": 5.0, "review": "Easy, simple, great.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Frias Garcia Coelho"}, {"rating": 5.0, "review": "Converted my dumb TV to a smart TV", "verified": false, "helpfulness": "0/0", "author": "Evanda Moore"}, {"rating": 5.0, "review": "BEST THING CREATED THUS FAR!", "verified": true, "helpfulness": "0/0", "author": "alvaro"}, {"rating": 5.0, "review": "We love our Fire TV. We were really surprised at how easy this was to set up and how easy to use. Great product and highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Weston"}]