[{"rating": 4.0, "review": "I like it!", "verified": true, "helpfulness": "0/0", "author": "Troy council"}, {"rating": 5.0, "review": "Love it! So easy to use and movable for traveling!", "verified": true, "helpfulness": "0/0", "author": "jacbrooke"}, {"rating": 5.0, "review": "Yes! Hello Fire TV Stick, Bye-bye Chromecast.  Slingplayer never worked well on the chromecast.  Works great on Fire Tv Stick.", "verified": true, "helpfulness": "0/0", "author": "Todd May"}, {"rating": 4.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Rajender R Katkam"}, {"rating": 3.0, "review": "Whoopee Doo!  First... Amazon is starting to charge for movies that were previously free.  This I experienced on my own as well as what a good friend has mentioned.  One weekend he started playing a movie and decided to finish it later.  A few days later he went to resume the movie and Amazon changed it from free to pay to watch.  For streaming video, Netflix is the SIMPLEST and CHEAPEST way to go.  The Firestick is great if you want to get literally bombarded with all kinds of choices and then when you find a movie you'd like to watch, all too often you HAVE TO PAY for it!  And I'm talking about a ten or fifteen year old movie.  Sometimes as much as fifteen dollars!  Amazon should break up the endless genre's and menus into more definable choices based on the owner's age group and preferences then gives us the option to block out the types of movies we have no desire to watch.  Blocking out all the kids' movies (Curious George) for example would be one step in simplifying our menus .  Yeah, maybe I'm a little old school, so all I can say is bring back Block Buster or Hollywood video rentals!Firestick is totally T-M-I.", "verified": true, "helpfulness": "0/0", "author": "Victor L. Frazee"}, {"rating": 4.0, "review": "I have been wanting one since they came out but couldn't afford it at 39.00, so when it when on sale July 15th, I finally got one and so far I'm really enjoying it.  It was very easy to install.  It took a little work to figure out how to get YouTube to play, but I finally did it.  One thing I would like to have access to is HBO Now.  I downloaded the app but can't get it to sync. Other than that, I've been quite happy with it.", "verified": true, "helpfulness": "0/0", "author": "L. Smith"}, {"rating": 3.0, "review": "We cannot use it with our current flatscreen television, the one we watch the most.  I do not think we understood what the fire tv stick could do for us.  I guess we need Fire TV Stick 101.  Disappointed in selection of shows.  We were looking for House of Cards 3 and it appeared not to be available.  We watched same 1 and 2 on Comcast.  We would never purchase this device again.", "verified": true, "helpfulness": "0/0", "author": "Sharon Totz"}, {"rating": 5.0, "review": "Basically turns the big screen TV into another Kindle.....", "verified": true, "helpfulness": "0/0", "author": "Ankeny Chiropractic"}, {"rating": 5.0, "review": "liking it so far", "verified": true, "helpfulness": "0/0", "author": "david tisue"}, {"rating": 5.0, "review": "Amazing gadget - I love it!", "verified": true, "helpfulness": "0/0", "author": "Cindy T \"smile!\""}]