[{"rating": 3.0, "review": "Did not work well/ keep losing signal and reloading / roku works better", "verified": true, "helpfulness": "1/2", "author": "dlanor"}, {"rating": 5.0, "review": "Shouldn't have waited so long after I started my prime account!  Hooks up super easy and setup was well guided and no trouble.  I'm loving all the great movies TV shows and music available.  Also like the iPhone app control option other than the included remote.  I'd highly recommend getting this if you want extra shows or dump that aweful cable! Also includes cloud space for your stuff as well.", "verified": true, "helpfulness": "0/0", "author": "Ted Rimstidt"}, {"rating": 3.0, "review": "This is a streaming device - like many other streaming devices such as Roku, Apple TV, Chromecast, etc. Like its competition, this means that it is a device that allows you to pull those streaming services (Netflix, Pandora, etc) onto your TV. As far as which is better, this is going to depend on your personal preference as they all have slightly different catalogs in the way of compatibility. For example, the Chromecast isn't compatible with Amazon Instant Video, officially. The Apple TV isn't, but it has Airplay and all other Apple devices are.Do not mistake this as some sort of cable provider. You do not get \"channels\", you get apps. All of the apps that are compatible come preinstalled onto the device and all can be found on the product page. Meaning, if you do not see a particular app listed here (above), it isn't compatible with this device.  The fire stick plugs directly into your TV so it needs an HDMI / HDCP compliant television set and a strong Wifi signal. The antenna on the stick isn't great - ideally it needs to be within 10 feet of your modem or router and things like microwaves can actually interfere with your signal. The fire TV will work further away than the Fire Stick  - usually having walls or floors in between the Fire TV and the router is okay. Also the Fire TV has the option of hardwiring into your network.Now there are some things that Amazon is not entirely truthful about in advertising these 2 devices. For example, in the comparison chart it claims that the Apple TV has 512MB of flash storage. This isn't true, the Apple TV has many times this. It also claims that the Apple TV has 8GB of storage space and this isn't accurate. The Apple TV comes standard with no storage (it isn't necessary) unless you buy the Apple TV with storage, at which time you actually select the amount of storage it comes with. This isn't an option that the Fire devices have.The fire devices also boast Miracast technology and claim to be the only ones that have it. Wrong. The Chromecast can miracast with other Android devices that have the Miracast technology. The Apple TV can Airplay with other Apple devices. As for the Fire TV and Fire TV Stick, they can mirror just fine with select Kindle models (at the time of this posting only Kindle Fire HdX's  - 2 models). It claims to be compatible with Android devices that have Miracast but - I've found this to be inconsistent as I can never actually get any Fire devices to find any other Miracast equipped devices.So if you are a member of Netflix, Hulu, HBO Go, Panadora, etc etc - any of those streaming services that are listed on this product page and you cannot already access these services on your Smart TV, Smart BluRay player or other streaming devices then this might be for you. Otherwise, you may not have much use for it. It is fine and mostly works as described, as long as you have plenty of bandwidth and take into consideration the false advertisements / statements for this product.For example, advertising that it has \"18x more apps than Apple TV\" is just completely bogus. At this time the Apple TV has, by my physical count about 6x as many apps as the Amazon Fire devices. The only major services that don't have an Apple TV compatible App are Amazon Instant Video and Amazon Music.", "verified": false, "helpfulness": "9/9", "author": "Pelican Freak"}, {"rating": 5.0, "review": "Fire Stick  - Fire me up.  Like this better then Chrome, much easier to use and the price is fair.  Anything I load on my Kindle, also appears with the Fire Stick.  Buy it.", "verified": true, "helpfulness": "0/0", "author": "Michele F Seipp"}, {"rating": 5.0, "review": "installs super easy. Does not disappoint. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Carl B. Pratt"}, {"rating": 1.0, "review": "My FireStick continues to say that it is not connected to internet and sends me to the networks available...but the network shows that I am connected with \"very good\" signal strength.  I called Amazon support and they attempted to help and even did a factory re-set but nothing helped.  Amazon told me to contact Comcast to figure out the connectivity issue.  Comcast adjusted the security settings, the channel, the port, re-set the motem/router....and nothing helps.  The firestick had been working without flaw for about 1.5 moonths and now this started. I really want to enjoy the fire stick but am not able to get any assistance that helps it work.  Please any advice is welcomed.", "verified": true, "helpfulness": "1/1", "author": "Tina Amela"}, {"rating": 3.0, "review": "Was very easy to install. Worked as described. I did return this to Amazon as it wasn't quite what I was looking for.", "verified": true, "helpfulness": "0/0", "author": "T. Lambert"}, {"rating": 5.0, "review": "I am so glad I bought this ! I'm not a techie ,so it took me several tries but in less than half an hour I had this up and running and watching Prime movies. We long ago gave up expensive Satellite and Cable TV and I've been watching Prime and Netflix on my computer ever since. I've found plenty to watch for free and sometimes I'll rent a single movie.I was skeptical about the Fire TV Stick but decided to give it a try.  I have a 5 yr old wireless N router, a Samsung TV that's 10 years old but it's an HDTV. My ISP is iffy at times because I live in a very rural location where the DSL I pay for, comes via dial up! In spite of all those possible deal breakers, my Fire TV Stick brings movies to my TV seamlessly! Zero stuttering or hiccups, the audio and visual is great. I especially like the simple remote that doesn't have a zillion buttons, just the ones you need.It's perfect for me and TY Amazon, for another wonderful product!", "verified": true, "helpfulness": "0/0", "author": "Ladybug"}, {"rating": 5.0, "review": "The fire stick is easy to set up and very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Cindi B"}, {"rating": 5.0, "review": "These things work great.  I love it.  I have two of them now.", "verified": true, "helpfulness": "0/0", "author": "Ohio Buyer"}]