[{"rating": 1.0, "review": "Tried to buy a second stick on \"Amazon Prime Day\" with over 9 hours left.  There was a join waiting list link. When pressed, it stated waiting list full. Buy for regular price, it stated product was available. On the Amazon Prime Day Web page. The offer was still prominently featured with several hours left. This does not seem appropriate.", "verified": true, "helpfulness": "6/14", "author": "G.N. Rand"}, {"rating": 4.0, "review": "It works well, however there's a pretty big flaw in that after a few days it starts lagging and performing poorly. Needs to be manually reset every so often. It seems like if this is an issue they should just have it reset every night after a few hours of no use or something.", "verified": true, "helpfulness": "0/0", "author": "Zach"}, {"rating": 2.0, "review": "I've had this stick for quite awhile now. It has great features but my main issue is the glitching. I thought it must be my internet speed. Nope because I have a roku and a chromcast. Both never glitches or has to reboot. I have reboot, cleaned it, and reconnected to wifi. Still no change. I would think twice before getting this stick.", "verified": true, "helpfulness": "1/1", "author": "Leah Chanthapanya"}, {"rating": 5.0, "review": "Versatile and fun and won't break your wallet 👍🏻", "verified": true, "helpfulness": "0/0", "author": "Jeremy Lester"}, {"rating": 5.0, "review": "Got Prime T.V. in the living room, a fire stick in the bedroom, love them both !", "verified": true, "helpfulness": "0/0", "author": "John A. Crafa Jr."}, {"rating": 2.0, "review": "Well I wouldnt know because i have been up since the big event started and one minute it would tell me available for wait list but could never get on it... Im pretty upset about t5his as well.", "verified": false, "helpfulness": "4/13", "author": "marnie griffin"}, {"rating": 1.0, "review": "The prime day sales selection was unimpressive and the only thing I actually wanted I get put on some wait list that served no purpose but to get my hopes up and torture me all day. This was a total disappointment. Up until this point I loved Amazon but now I don't know if I'll renew when my subscription is up...", "verified": false, "helpfulness": "7/14", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Still learning but so far I am loving it and so are my grandkids", "verified": true, "helpfulness": "0/0", "author": "pat"}, {"rating": 3.0, "review": "Yo what the fudge ya better make this an exclusive for all amazon prime members i had other important stuff in life to attend to but i still managed to check in so andale iya iya ya better restock and re add this for 25$", "verified": false, "helpfulness": "3/7", "author": "Sergio"}, {"rating": 4.0, "review": "kinda confusing. :(", "verified": true, "helpfulness": "0/0", "author": "adriana wilmot"}]