[{"rating": 5.0, "review": "Excellent product for the price, would recommend friends to buy!!!!", "verified": true, "helpfulness": "0/0", "author": "Abid A. Kazi"}, {"rating": 4.0, "review": "I bought an ouya last year, and was very disappointed in it, however this little device is everything my ouya should be.  It has lots of games, play movies, music, and allows screen mirroring.  The only thing it is missing is native apple airplay support, but that aside, it is a great device.Side bonus.I was able to pair my ouya controller to the fire tv stick, so now it is an absolute dream.", "verified": true, "helpfulness": "0/0", "author": "ME?"}, {"rating": 5.0, "review": "Really nice! Fire TV Stick has an abundance of content and I'm very pleased with it.", "verified": true, "helpfulness": "0/0", "author": "B Henry"}, {"rating": 4.0, "review": "Set up was easy as pie. I wish they gave me the option to get the voice remote by replacing the normal one instead of having me get both (so it would offset the price some).Once HBO GO is offered a la carte, I hope they add the app in here. If not, this will definitely be a \"no go\" for many.All in all, I think this device represents value for the money if you're an Amazon Prime member. And the specs are definitely better than the Roku stick.", "verified": true, "helpfulness": "0/0", "author": "WONREDSTICK GUY \"WONREDSTICK GUY\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "..."}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Su T. Huang \"su t huang\""}, {"rating": 1.0, "review": "What a disappointment.. it arrived today, after some trouble getting the battery compartment to open, attached the power and attached to TV. Powered up the remote, which was recognized. But then the setup says \"downloading current software\" which runs a few minutes until a screen pops up saying that it was unable to update the device, either try unplugging the power and try again, or try again later (the heck with you?), or go to www.amazon.com/firetvsupport.Tried putting the power off and retrying..same result.Went to the site as listed..Surprise!! no info on Fire TV stick at all.Guess I will wait till tomorrow and try again, and either see if it works or else return the device.", "verified": true, "helpfulness": "6/9", "author": "J. A. McJohn"}, {"rating": 2.0, "review": "Locks up, it can be very slow. It does not like to mirror my kindle fire hdx.Not at all the quality I was hoping for. I own 2 Kindle Fires and they have been great. This product is not of the same quality.", "verified": true, "helpfulness": "1/1", "author": "B. Gunsher"}, {"rating": 5.0, "review": "Rather than being a Chromestick clone, this device takes the best parts of the FireTV functionality and crams that power into quite the tiny package. It's refreshing to have a menu, and be able to store applications on the device, and the FireTV Stick has met or exceeded my expectations in every category. It is even integrated with your Amazon Prime account before it gets to your door. Well done.Only gripe, It needs a clock! Nowhere on the OS is there a time display that is easy to get to, if at all. This is more of a request though, as it hardly detracts from the experience this device has to offer. 10/10 would buy again!", "verified": true, "helpfulness": "0/0", "author": "jetset125"}, {"rating": 5.0, "review": "I have a Vizio tv, that's a little over 2 years old. When this went on sale for $19, I thought, \"What the heck! I have nothing to lose!\"This thing has made my smart tv, smart again! The apps on my Vizio were outdated, and the Amazon and Pandora apps were pretty pathetic. Now my apps work great! And I have a bunch more to chose from, and can even play games! Thank you Amazon!!Love this Fire Stick so much, I bought another two of these for my kids!!", "verified": true, "helpfulness": "0/0", "author": "lOcO \"lOcO\""}]