[{"rating": 5.0, "review": "Love the Firestick. This is my number 2. Don't have to switch from Livingroom to bedroom now!", "verified": true, "helpfulness": "0/0", "author": "STEVEVR BEAVERS"}, {"rating": 1.0, "review": "So from what if read this is just another gimic to get more money? It's been sitting around in the box almost a year now. Finally set it up. I had thought to just throw my fire stick in the garbage after reading all the reviews but can anyone tell me if it's any good for things like photos and using your iPad with it? If I block everything that will cost money will I be okay? Or should I get Apple TV? Any suggestions?", "verified": true, "helpfulness": "1/1", "author": "Bird_Lady"}, {"rating": 5.0, "review": "Just what I expected a great product and does everything I wanted it to do", "verified": true, "helpfulness": "0/0", "author": "Bruce Symons"}, {"rating": 5.0, "review": "The Fire TV Stick was recommended to us by our daughter.  The Fire TV Stick has exceeded our expectations.  We will be scaling back on our cable TV.", "verified": true, "helpfulness": "0/0", "author": "Beverley Hilton"}, {"rating": 5.0, "review": "Great value! I would recommend this product to friends.", "verified": true, "helpfulness": "0/0", "author": "Ana"}, {"rating": 5.0, "review": "Worked as advertised!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I like the concept and so far the actual stick seems like a pretty solid device.  The setup was brain dead simple which was nice. I ordered mine from Amazon directly and it came \"pre registered\" and linked to my account. I am not sure if I like that or not.  What if it had been purchased as a gift? Perhaps I missed that option.  What is a bit disappointing is the availability of movies and shows.  I signed up for the Prime trial but honestly the selection of material available is pretty lacking.  Hopefully that will improve.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "great tv toy adds a new dimension for viwing options", "verified": true, "helpfulness": "0/0", "author": "suet"}, {"rating": 1.0, "review": "WARNING!! Amazon touts this as an improved alternative to Chromecast. It is NOT. Chromecast is a way to stream videos from PC or mac to your TV. It also streams anything (i.e. Netflix) that you can get on your Chrome browser.Fire Stick does NOT stream your already owned videos from your PC. In addition, it is set up to push as much advertising as possible via \"apps\" to BUY, BUY, BUY from Amazon. Even the little blt of streaming it does requires you to use Amazon Cloud storage, which is only free for the first 5 gigs (a pittance when it comes to storing videos.) I wasted 2 hours trying to get it to stream before contacting Amazon and finding out that \"it doesn't do that.\" I also wasted time downloading firestick apps such as \"watch Disney\" which is only a workaround if you already HAVE Disney from your TV provider. Clunky, inelegant and sneaky.", "verified": true, "helpfulness": "0/0", "author": "goldenskyhook"}, {"rating": 5.0, "review": "We are enjoying our Amazon Fire Stick very much.  It was fairly easy to installeven for technology challenged.", "verified": true, "helpfulness": "0/0", "author": "Brenda C. Smith"}]