[{"rating": 5.0, "review": "I am impressed", "verified": true, "helpfulness": "0/0", "author": "william alexander"}, {"rating": 5.0, "review": "This guy is fantastic. Great for anyone who has Hulu and Netflix. Easy to use. Now I don't need my PS3 anymore. It's easy to move from room to room and TV to TV. Remote is small and compact. Just love this! Probably going to buy another one to leave at the deer lease! ❤️❤️", "verified": true, "helpfulness": "0/0", "author": "Susan Miles"}, {"rating": 5.0, "review": "Cool toy plug and play love it", "verified": true, "helpfulness": "0/0", "author": "STANLEY B."}, {"rating": 1.0, "review": "Ehh no free movies unless u have prime or netflix and the app selection isnt all that great", "verified": true, "helpfulness": "0/0", "author": "Izaac Crotwell"}, {"rating": 4.0, "review": "The entire family loves the Amazon Fire TV Stick. Apps are available at your fingertips. We mostly watch Amazon and Netflix, but there is a wide variety of other apps available to use.The Fire TV Stick lets everyone watch their favorite shows on the TV. Before we had the stick everyone would only be able to use these apps on laptops and cell phones. Now we are getting more value out of our memberships by using the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Amanda Murphy"}, {"rating": 5.0, "review": "Love Love Love. I'm too obsessed with this. And for $40?! Well worth it.", "verified": true, "helpfulness": "0/0", "author": "Paige Paxton"}, {"rating": 5.0, "review": "Easy to install!", "verified": true, "helpfulness": "0/0", "author": "Anna R Johnson"}, {"rating": 4.0, "review": "The first fire tv stick that I received overheated when I used it. However, I contacted customer service and they replaced it within two days. The new unit seems to be working just fine!", "verified": true, "helpfulness": "0/0", "author": "Teresa Millegan"}, {"rating": 5.0, "review": "I am very pleased with the tv fire stick. The installation went smoothly because the instructions were easy to follow.", "verified": true, "helpfulness": "0/0", "author": "Elaine"}, {"rating": 5.0, "review": "The firestick made getting streaming movies super fun and easy! So simple to use, I was enjoying tons of great movies with the comvient stock! Love, love, love it!!", "verified": true, "helpfulness": "0/0", "author": "Linda Finley"}]