[{"rating": 2.0, "review": "My expectations were that I would be able to go straight to Netflix instead I have to sign in on Amazon and then go to Netflix which means I have my credit Card up twice to watch a free TV show that I pay a monthly fee to watch. Every time you get on it seems as Amazon is pushing their products on you.", "verified": true, "helpfulness": "0/0", "author": "David Jackson"}, {"rating": 5.0, "review": "Is a excellent Product and funcionality.  Installation is very easy.  The best product.", "verified": true, "helpfulness": "0/0", "author": "J.Gutierrez"}, {"rating": 4.0, "review": "Fire TV stick does not work with my TV over the air channels.  It knocks the channels off and you can not view over the air TV,  Otherwise the device is fine", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Awaiting replacement. Will review again.", "verified": true, "helpfulness": "0/2", "author": "Lawrence Gray"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Rod"}, {"rating": 5.0, "review": "It was very easy to install.  Our current television is almost 8 years old which could explain the one issue, \"HDCP unauthorized. Content disabled\"  We had to call for technical help and we followed their directions below for power cycling. Hope this helps you if you are experiencing the same thing.1. Remove the Fire TV Stick from the television2. Unplug the Fire TV Stick and the television from power3. Leave both devices unplugged for two minutes4. After two minutes, plug the power back in for the television5. Plug the power cable back in to the Fire TV Stick6. Connect the Fire TV Stick to the television's HDMI port", "verified": true, "helpfulness": "0/0", "author": "J. Patterson"}, {"rating": 1.0, "review": "A piece of junk. Doesn't work for me. Won't stay connected to the Wi-Fi even though I have the fastest Wi-Fi FIOS offers. Won't mirror my Samsung phone. It will connect to the FireTV App on my phone but as soon as I switch to mirroring the connection is lost. Also, if I attempt to view one of the prime movies or tv shows, it loses connection with the internet. When I go to settings it sais it is connected and the signal strength is \"very good.\" I'm sending back.", "verified": true, "helpfulness": "1/1", "author": "J Ballard"}, {"rating": 1.0, "review": "Don't remember ordering this item ???????What's up with that???????", "verified": true, "helpfulness": "0/3", "author": "Marsha A. Ahlander \"ZMALA\""}, {"rating": 5.0, "review": "Is easy to use and works great!", "verified": true, "helpfulness": "0/0", "author": "cindy c."}, {"rating": 5.0, "review": "We have had the Fire Stick for about 1 year and have been impressed.  The menu works well for me and the interface is more responsive than any I have used on Blu Ray players or built in web TV systems.", "verified": true, "helpfulness": "0/0", "author": "Aaron Walker"}]