[{"rating": 2.0, "review": "Looks like they haven't ironed out the bugs in their new hardware yet. I've had the Fire TV stick for a few weeks now. Half the time when I watch Prime Video the audio is out of sync with the video. I occasionally have the same problem with Netflix. Netflix itself crashes from time to time. After Amazon customer service gave me the usual \"reboot\" and \"check your connection\" technical advice. I got replacement stick in the mail. Same issues.Now before you go thinking \"he must just have a bad internet connection\" I have used both Chromecast and my laptop to stream video for several months now without any issues whatsoever. The TV is about 15 feet from my router. These are issues specific to the Fire TV stick. It's too bad because in theory, I really like the interface, but half the time my video is unwatchable.", "verified": true, "helpfulness": "2/3", "author": "Ryan D Eastwick"}, {"rating": 5.0, "review": "We started as an Apple TV household, back when they were big and clunky and the remote controls ($19 each) never seemed to last us a couple of weeks. We moved on to Roku and upgraded a couple of times. As far as I can tell every Roku we have purchased and either handed over to friends or sold is still out there and working fine. Our current Roku units are one 2 LT and one 2 XS, both great.I experimented with the Chromecast, which is a neat concept, but it is at the mercy of too many variables. It doesn't have a remote control, it doesn't have a native app to stream mp4 video, so if I want to watch a video I have to drag it to a tab, cast the tab and max the screen. Not ideal. I also had consistent trouble having Netflix recognize that the Chromecast was up and running, I complained on the forums and waited months of reply after reply with more people complaining only to be told to upgrade to the newest firmware.I was getting ready to pick up a couple of Fire TVs when Amazon, out of nowhere, showed up and released the Fire stick, and at $19 each I decided to gamble on it. Worst case scenario? I wouldn't like them and I could just use the 30-day money back warranty.I guess that my pre-order was early enough that I made it through the launch shipping, I received our two units yesterday.Installation was painless but a bit slow because of firmware updates. I also noticed that after reboots during updates the devices are a bit slow picking up their wireless, so for a few seconds it looks as if you have to re-authenticate.The first unit went into a 50\" HDTV, it worked perfectly and with no drama. The second unit went into a 23\" Samsung that refused to pull the signal through either of the HDMI ports, this is a TV that works fine with a Roku and an Xbox 360 through HDMI. I moved the second unit to a different 23\" Samsung and it worked immediately. Again, setup was painless but took a while to go through the firmware updates.The devices shipped pre-activated for my account, so I was spared that step. Activating Netflix is still done through a login screen, which is idiotic (and not Amazon's fault, it is the same way it is done on the Roku, Kindle Fire HDX and iPad 2). Activating Hulu+ and Showtime Anywhere was dead simple since both used a screen code.The UI is simple, anyone that has ever used an Apple TV or a Roku should feel right at home. Some rocket scientist decided to add common email address domains to the on screen keyboard, the party responsible for this should get a raise.The Netflix, Showtime Anywhere and Amazon Prime apps work flawlessly. The Showtime Anywhere streams were almost indistinguishable from the cable box. The Hulu+ app UI is laggy but video playback is smooth.Problems? None.Value? If you are a Prime subscriber, the Fire TV stick is the new standard even at $39. If you are a Prime subscriber and you already have a Roku 2XS or better, then you won't see that much of an improvement. If your Roku ranks lower than the 2XS then the difference should be dramatic.If are worried about the Prime up-sell, it is no different than Roku shoving rentals in your face every time you load the home screen. I am seeing other reviewers complaining about ads, but I am yet to see a single ad while watching Prime content.And no, it isn't for everyone. If you have a digital sound system, you want either the full-size Fire TV or any other streaming player that has digital audio out. And if you expect to hit the games section hard you might as well go for the full-size product. If all you want is to be able to run one or more streaming accounts from one TV, $39 is really hard to turn down.", "verified": true, "helpfulness": "34/39", "author": "Pedro A. Vera"}, {"rating": 1.0, "review": "I have a brand new wifi wireless router from Xfinity (less than a month old). BRAND NEW. It is a model supported by this device. It is in close proximity to the device. It is not in a cabinet. There is nothing obstructing either device. My WIFI pw and network is set up properly. If I intentionally enter an improper password the device spins and spins before giving me an error. When I enter the correct password I see a message \"connecting\" briefly before I get an error message. I have tried everything, but the easy as 1, 2, 3, is a fantasy. And, naturally, there IS ZERO SUPPORT other than \"restart the device\". THANKS I-T GUY. Piece of garbage. Guess I need to throw away both this and the Chrome gadget and just settle for AppleTV. Not sure why I have Prime anymore. Promises, promises.", "verified": true, "helpfulness": "6/19", "author": "Creative Tornado"}, {"rating": 1.0, "review": "Let me start by stating that this rating is only due to one issue with the device that has made it un-usable for me in its current state. Based on what I have seen, I would likely give this a 5 star if it were fixed.I was excited to receive this in the mail and have been waiting for a while. When it finally arrived I rushed to set it up. Two things really annoyed me, although one can be overlooked. The first is that the getting started video cannot be skipped. I tried every button on the device, and the only option was to go back and then continue the video.The second, and most annoying (to the point where I will not use this until it is fixed) is that enabling parental controls for Apps makes it so that you CANNOT use apps without disabling parental controls. I own many Android devices (4 of them are TV sticks such as the mk808 and mk808b). On each of these I have parental control apps setup that use a PIN. The difference is that on the others (3 different apps), you can enter the PIN to bypass the restriction temporarily, on the Firestick, you cannot. I do not wish to have to disable Parental Controls so that I can watch netflix. I should be able to just enter in the PIN to get it to open. You obviously know that this product would not sell nearly as well if you had included only Amazon Prime Video, so you included netflix. That was a VERY wise decision, as in my opinion (and that of many of my friends), Prime Video kinda sucks for now. I purchased this only because I saw that it had Netflix. Now I cannot even use it for that as I would have to constantly disable the security to do so.This needs to be addressed immediately. Make it so that the PIN can be entered to access a function such as Netflix, or installing an app, or running that app. Set it so that the PIN gives you a 1 time bypass, or even as most other apps do give you a 1-5 minute window in which you do not need to re-enter the PIN again to perform a restricted function. If you leave it as it is, you will lose a lot of users on this product.I have sent the above text in a product support email to Amazon, so hopefully this will be addressed in some manner soon.", "verified": true, "helpfulness": "8/19", "author": "Justin A \"DarkriftX\""}, {"rating": 1.0, "review": "This thing crashes and restarts once a while. I own 2 chromecasts for my bed rooms and nothing like this happened with chromecast devices. I like chromecast betterUpdate: It doesnt crash when i use power supply, But i am not going to lose another power source for this. I am expecting to work without power supply", "verified": true, "helpfulness": "6/13", "author": "Pavannify"}, {"rating": 5.0, "review": "I have not used Fire TV before, but I couldn't resist buying the Fire TV Stick.  The UI and layout lend themselves to easy navigation and great functionality.  I have used Chromecast, Vizio SmartTV, Xbox 360, PS3, and a Sony Bluray player and this beats them all.  The Android app with voice searching seals the deal.  Searching for titles on the Fire TV Stick defaults to what's available on Amazon, but also shows other apps that can provide the same title.  For example, searching for South Park will show the episodes you can buy from Amazon, but also shows that it is available on Hulu Plus.  When you select Hulu Plus, the Hulu Plus app opens and the chosen episode plays automatically.The whole interface is quick and snappy.  I was surprised that it allows for screen mirroring as well.  I was able to mirror my Android phone display with Miracast.  I am sure I will find more cool things the device can do in the coming days, but even from what I have seen so far, I'd recommend it.", "verified": true, "helpfulness": "0/1", "author": "K. Bystrom"}, {"rating": 5.0, "review": "The best new device in streaming television.", "verified": true, "helpfulness": "0/1", "author": "Eric M Hardisty"}, {"rating": 5.0, "review": "This is a very good product! Compared to chrome cast and the roku streaming stick, their are a ton more features, such as a voice remote app and optional game controller. I recommend this product to anyone who has cancelled cable and needs a good option for streaming movies and TV episodes.", "verified": true, "helpfulness": "1/2", "author": "R. Goel"}, {"rating": 4.0, "review": "Had set up issues with the software download. After turning on the Fire Stick and selecting my wifi network, the system automatically began looking for a software update. After about 3 minutes, a message came on my screen saying that there was an issue with the update and to unplug the power source and try again. After doing this, the software took about 5 minutes to download and 3-4 minutes to install. I wasn't expecting this and thought it might have been another issue, as the instruction booklet doesn't mention any of this.On a positive note, once set up was complete, I had no trouble navigating the system!", "verified": true, "helpfulness": "1/2", "author": "LeeleeRae"}, {"rating": 5.0, "review": "The Fire TV stick is a great way to make your TV \"smart\" and add a wide array of entertainment options.  Setup is quick and easy, and there are plenty of streaming and gaming options.PROs+ A remote! This is the one thing I did not like about the Chromecast: it's just takes to long too unlock your phone, go back to the app, and wait for it to sync up... just to pause a video.+ The small stick is easy to install. All you need is an open HDMI port on your TV and a WiFi network.+ Plenty of streaming video options: Netflix, Hulu Plus, Crackle (free movies!), YouTube, WatchESPN, and many more.+ Streaming music is included, too: Pandora, iHeartRadio, Spotify, and Amazon Music+ Games!  Sonic, Game of Life, Flappy Birds, and over 200 more!+ Supports both 2.4Ghz and 5Ghz WiFi networks.+ Snappy processor and ample memory storage make the user interface fluid and responsive.CONs- Some of the more intensive games, such as Minecraft, are not available on the Fire TV Stick (but are available on the Fire TV Box)- A lot of the 8GB storage space is not available due to system files (only a little over 5GB is free to use)- Entering your login credentials on the remote is cumbersome.- I had some issues setting it up at first (update wouldn't download, account won't authenticate, etc), but I will blame that on overloaded servers. The issues eventually resolved a few hours later.- The iOS app was not available yet, so I didn't get to test that functionality.If you're an Amazon Prime subscriber, or have purchased content from Amazon's Instant Video or Music services, or just want an easy way to watch Netflix, the Fire TV Stick is a great, low-cost option to enjoy streaming content and cut the cord!TIP: Want to cut the cord but have a few favorite shows that are cable-only?  I'm a fan of The Walking Dead, so I purchase a season pass for less than eight bucks a month (less than two dollars an episode) on Amazon Instant Video and I can watch it the next day on this streaming stick, my iPad or my Kindle Fire.  Commercial free! And it's stored in Amazon's cloud, so I can re-watch it whenever I want.  It is like unlimited DVR!", "verified": true, "helpfulness": "0/1", "author": "Ryan"}]