[{"rating": 5.0, "review": "Works really well!", "verified": true, "helpfulness": "0/0", "author": "Cynthia"}, {"rating": 5.0, "review": "I love this tool. It is one of my best gifts that I gave myself. If you own a Amazon Fire, you need to buy the Fire TV Stick. I own a HD TV without wifi and no Ethernet connection. The HDTV is working fine with the Fire Stick. I was able to connect ESPN & FOXs Sports apps to my Verizon Fios subscription. I have instant updates on all types of sports all in one click. The miracast on my Fire Phone interface with the FIre Stick on my HDTV that is attached to the TV. The Fire Stick has Games, Instant videos, Apps and all types of things easily displayed on my HDTV.  In addition, the FIre Phone could be used as a remote like the Fire Stick too. You could bypass the HDTV smart  connection with FIre Stick on any HDTV.  My next purchase will be the games accessory.", "verified": true, "helpfulness": "0/0", "author": "Dean Fonts \"Dino Fontaine\""}, {"rating": 5.0, "review": "Works perfect! Super easy and quick to instal.", "verified": true, "helpfulness": "0/0", "author": "Mike R"}, {"rating": 2.0, "review": "I thought I was going get prime for 30 days for free but I was wrong", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it's virtually invisible and it works!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Fire Stick is the answer to make a dumb TV very smart! Hardware wise it's on the lower end compared to other devices on the market but it's adequate enough for what I need. This stick has a lot more functionality than a Google chromecast and it's only $4 more.", "verified": true, "helpfulness": "0/0", "author": "Andrea G. Guerrieri"}, {"rating": 4.0, "review": "Much better than chromecast. No need to sync up your phone/ tablet. Just grab the remote and go. There have been some connection issues with third party apps like HBO and Netflix. However, this is usually remedied by just unplugging it for 5 seconds.", "verified": true, "helpfulness": "0/0", "author": "Drew P Millitello"}, {"rating": 5.0, "review": "Fire TV Stick joins my other cable alternative devices - Chromecast and Roku - to round out my TV access suite. What I like most about the Fire Stick is the immediate access to, and promotion of, Amazon original series that are free w/ Prime. Thoroughly enjoying it. Can't wait for next seasons of Mozart in the Jungle, and Alpha House.", "verified": true, "helpfulness": "0/0", "author": "DS23"}, {"rating": 5.0, "review": "It is great totally worth the money I am always entertain now the games and the different time of streaming it's awesome", "verified": true, "helpfulness": "0/0", "author": "Marcelo gallardo"}, {"rating": 3.0, "review": "Not enough apps.", "verified": true, "helpfulness": "0/0", "author": "bcmurph"}]