[{"rating": 4.0, "review": "GOOD VALUE", "verified": true, "helpfulness": "0/0", "author": "We Have Deals For You"}, {"rating": 5.0, "review": "We purchased the Firestick because we wanted to move away from our typical TV provider and had not tried streaming video before.  It was SUPER easy to hook up and we got started with it in minutes.Our kids have taken it over the last few months.  We now stream more than we channel surf!  Drawbacks are 1) Some limitation in the programming selection and 2) Our wifi can get pretty slow when the \"stick\" is in use.  Positives are 1) It's simple to use, 2) Costs nothing if you have a prime account, 3) Settings for the pay items can be made inoperable for kids, and 4) Has a great selection of older titles and shows that you can watch at will rather than going out to find DVDs.It is a very worthwhile purchase in our opinion and would recommend it to any family with younger kids like ours.  We are still finding new things on it and we've had it for months!", "verified": true, "helpfulness": "0/0", "author": "a.latch"}, {"rating": 5.0, "review": "We love this system. Better than our roku!", "verified": true, "helpfulness": "0/0", "author": "lee marian"}, {"rating": 4.0, "review": "Works as expected.  Picture is slightly deceiving as it needs to be plugged into an electrical outlet to work.", "verified": true, "helpfulness": "0/0", "author": "Melissa and Anthony Henderson"}, {"rating": 3.0, "review": "It works well, however, whenever you see this advertised, it always leaves you with the impression that all you do is plug it in to the TV....NOT SO.  It comes with a power supply too so there is ANOTHER thing that has to be plugged in.  They say it is optional and works best plugged into the wall but I was using mine right in the city where there are a ton of digital stations with in range and was using a 45 mile radius antenna and it still would not work unless plugged in with the AC adapter.  Just sayin'!", "verified": true, "helpfulness": "0/0", "author": "Susie Hardesty"}, {"rating": 5.0, "review": "For its price, I think this is the best thing to come along. Enjoying it tremendously.", "verified": true, "helpfulness": "0/0", "author": "Jay Jamison"}, {"rating": 3.0, "review": "Works well most of the time. Interface can be laggy, navigation will skip around at times. I encounter video playback issues with Netflix/Youtube including pausing and then playing at higher speeds to catch up.", "verified": true, "helpfulness": "0/0", "author": "Bradley"}, {"rating": 4.0, "review": "The only complaint I have is that it loses Network connection for no apparent reason.  All my other devices are connected so it isn't my wifi.  One other disappointment is with the remote app for iPad.  I took the fire stick on vacation but forgot the remote.  I couldn't use the remote app to connect the device to the wifi at the beach house.", "verified": true, "helpfulness": "0/0", "author": "Merle Oliphant"}, {"rating": 5.0, "review": "Got this on prime day for 24 dollars. It replaced a Roku that got fried in a thunderstorm. Works great and the remote is very responsive. Works with all my streaming apps and gives me instant access to my prime video library as well.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 5.0, "review": "Very useful, and lots of great content (assuming you have an Amazon Prime membership).  Very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey O. Davidson"}]