[{"rating": 5.0, "review": "Love it! Works great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very simple to install and use.  I was not aware the voice command only works with Amazon programs but that is not really a problem, just something I would have liked to have been aware of when purchasing.", "verified": true, "helpfulness": "0/0", "author": "Dora"}, {"rating": 4.0, "review": "Good value.  A little time consuming to find the movies you like, using the basic stick.  But that's OK.", "verified": true, "helpfulness": "0/0", "author": "Paul E"}, {"rating": 5.0, "review": "Came pre-configured due to being a prime member.  Easy hookup and operated flawlessly right out of the box.  Excellent value and highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "This is the best purchase I've made in years.It was very easy to set up, and connected within a few minutes of opening the box. Amazon has it right with the interface compared to Roku (which I have tried but returned).  I have NOW completely cut my cable cord. It is amazing how many channels are free using the Amazon Fire Stick, with Pluto TV (several hundred), BBC News, NBC News, CBS News, PBS, Smithsonian If you subscribe to HBO GO ($14.99 a month) and Netflix ($8.99 for HD) as I do, I now have a total television bill of $23.98 compared to over $109.00 before, and with YouTube there are zillions of channels to watch for news, music, sports, etc. I love it!!", "verified": true, "helpfulness": "1/1", "author": "Joel Brown"}, {"rating": 5.0, "review": "Awesome just as good as the fire TV", "verified": true, "helpfulness": "0/0", "author": "Nyrie Paloulian"}, {"rating": 5.0, "review": "Love my fire TV stick!", "verified": true, "helpfulness": "0/0", "author": "Chris DeBoard"}, {"rating": 5.0, "review": "I've been using the Fire TV Stick for a while now and I can honestly say it kicks Google's Chromecast where the sun doesn't shine, it's fast and responsive and the UI works great. Kudos to Amazon for making an entry level product that does feel cheap and works better than similar products from the competition.", "verified": true, "helpfulness": "0/0", "author": "Reinier Martinez"}, {"rating": 5.0, "review": "testing out to see if lets me cut the cord to cable/satellite...so far so good, still lots to learn on it", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "It makes my dump TV smart!!!!", "verified": true, "helpfulness": "0/0", "author": "Manish Chokshi"}]