[{"rating": 5.0, "review": "It really is all that is advertised!  We turn movies on when there are reruns or nothing interesting on the tv.  I recommend it.  Will most likely order one as a gift for my daughter.", "verified": true, "helpfulness": "0/0", "author": "PAM SKIDMORE"}, {"rating": 5.0, "review": "I love this Fire TV Stick!! We don't have a smart TV and you don't need one if you have a Fire TV Stick. We love it!!", "verified": true, "helpfulness": "0/0", "author": "Grammy Ann"}, {"rating": 5.0, "review": "I love Roku, but after I got the Fire, it is has more features which makes it the top for now.", "verified": true, "helpfulness": "0/0", "author": "N. Rahman \"Y a m a\""}, {"rating": 1.0, "review": "Beware. This does not work unless it is less than 10 feet from your router. I verified this with Amazon customer support when I could not get it to connect with my wifi. I am very disappointed with Amazon. That should be clearly stated so you don't waste your time.", "verified": true, "helpfulness": "1/1", "author": "Daniel T. Crecca"}, {"rating": 4.0, "review": "Works as advertised.  I have to use the app on my 2013 model Kindle Fire, which is kind of clunky, but otherwise, it works fine.  I'd rather have it powered by the stick or a dongle to plug into my USB port on the TV...the power cord is messy looking and gets in the way...otherwise I would have given it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Martin Mowdy \"ScubaGod1\""}, {"rating": 5.0, "review": "Love it!!  So much better than my Samsung Smart Blue-ray.", "verified": true, "helpfulness": "0/0", "author": "Vicki"}, {"rating": 4.0, "review": "I'm still figuring things out. I love it. The only downfall is I can't type in a search or if I can, I haven't found it yet.", "verified": true, "helpfulness": "0/0", "author": "Cyndi sims"}, {"rating": 5.0, "review": "This is very easy to install and use and I can watch hulu, netflix and my prime videos!  Love it!", "verified": true, "helpfulness": "0/0", "author": "Tammie Brazell"}, {"rating": 5.0, "review": "It has provided me with \"on demand\" access to many movies and TV series as well as those produced by Amazon such as Alpha House which I love.", "verified": true, "helpfulness": "0/0", "author": "Michael Wells"}, {"rating": 5.0, "review": "arrived as scheduled and works great", "verified": true, "helpfulness": "0/0", "author": "D. Hastings \"fantasy girl\""}]