[{"rating": 5.0, "review": "Works flawlessly. Easy to set up. Changed our lives", "verified": true, "helpfulness": "0/0", "author": "J. Young \"Young Badger\""}, {"rating": 5.0, "review": "Easy install and easy to use.  Much better than watching on a tablet!", "verified": true, "helpfulness": "0/0", "author": "Tammie S. Betway"}, {"rating": 1.0, "review": "If you live in Puerto Rico DO NOT BUY THIS. I bought this specifically to view Hulu Plus. It will not download if your address is not in the 50 states.This also happened with the YouTube and Watch ESPN apps. It is ridiculous that my Wii which is almost 10 years old can play Hulu Plus and this piece of garbage won't let me download the app.", "verified": true, "helpfulness": "1/1", "author": "Gifter"}, {"rating": 5.0, "review": "Breeze to set up, loved that it was already set up with my Amazon account...Remote a little small but buttons well placed.", "verified": true, "helpfulness": "0/0", "author": "Armando Conde"}, {"rating": 5.0, "review": "The Fire TV Stick was very easy to install and set up and sync with my Fire tablet. Streaming Amazon Prime episodes to the TV worked very well. The remote is very small, and the viewing buttons take some getting used to. Also the home screen display and looking for available content is somewhat tedious having to click a button for every move. Maybe Amazon will come up with a better way to navigate the screens. Can't beat the functionality provided at this price though. I'm very pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Carol M"}, {"rating": 3.0, "review": "Having a lot of network issues for some reason.Our internet connection is good and wifi works just fine. Not sure where the underlying issue it.Could be the device, could be the contect, could be Amazon Prime content servers..(this is what we are playing).", "verified": true, "helpfulness": "0/0", "author": "Danckut's"}, {"rating": 5.0, "review": "Awesome! Highly recommend this product. Who needs cable when you have this?!", "verified": true, "helpfulness": "0/0", "author": "Grace A Jensen"}, {"rating": 5.0, "review": "Love it !!!", "verified": true, "helpfulness": "0/0", "author": "William E. Dell"}, {"rating": 4.0, "review": "I love the features and all of the apps and channels available but it loses its wifi signal a lot. Also, I hate that there is no way to tell if you have to pay for something before opening it. If you have small children you know once they are set on  movie they want to watch that movie and it is a meltdown otherwise", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I had difficulty maintaining connection and", "verified": true, "helpfulness": "1/1", "author": "Cecily"}]