[{"rating": 3.0, "review": "I will admit that the video/sound quality was good.  But in less than 12 hours after setting it up, it made a crackling noise over my tv speakers and the picture went black.  Tried unplugging and plugging it back in but it is toast.I ordered 2 of them, but I'm not sure I'm even going to bother setting the other one up.UPDATE:I did end up trying the other stick.  I kept the power cord, AC adapter, and HDMI extender from the first setup and just swapped out the actual stick.  No dice.  So I tested the HDMI port with my Roku, and the port was fine.  Next I started swapping out other components of the setup until I found the culprit.  The AC power adapter was toast, not the actual Fire Stick.So to be fair, the Fire Stick was fine.  But the fact that the AC adapter didn't last more than a few hours is still pretty weak.  I'm upgrading from 1 start to 3 stars.  If the number of channels improve, (and the 2nd AC adapter lasts) I may add more stars.  I REALLY want to like this device.", "verified": true, "helpfulness": "2/4", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Works fine as a Netflix, Hulu, Prime video streaming device. But does not work as a screen mirroring device.My Galaxy Note 2 with Android 4.4 can find the Fire Stick but not able to connect to it. My Moto G cannot find the Fire Stick. My Kindle Fire HD7 does not have screen mirroring option under Display settings. I am able to mirror my Galaxy Note 2 screen to my Roku with no problem. So the problem should be in the Fire Stick. I would get another Roku if I knew the Fire Stick has the screen mirroring problem.Update:I'm able to mirror my Galaxy Note 2 screen now. My Galaxy Note 2 was rooted and I have to re-install the original firmware from Samsung Kies. Now screen mirroring works but video is choppy.Update:Not reliable. Rebooted twice within 2 hours most likely due to overheat. Yes I use the wall adapter. Also screen mirroring disconnects frequently. Keeping at 3 stars for now giving Amazon some time to release a new firmware to fix the problems.", "verified": true, "helpfulness": "0/4", "author": "A. L."}, {"rating": 4.0, "review": "For everyone who has a hard time getting it to update, check your Internet connection. This is a great stick for the price. Picture quality is great with no lagging. Fast response time and switch of movies to games. Going to buy the control pad for my son. Wish it had microphone remote included.", "verified": true, "helpfulness": "1/2", "author": "WILLIAM A CHEN"}, {"rating": 5.0, "review": "By far the best streaming stick on the market. The speed at which apps load is shockingly fast for such a small device. The surprise feature for me is the voice search (via the separate remote or downloadable app). It is accurate and the results are instant. Currently it only searches amazon content.For the price, there is nothing that compares. It is easily in the same category as the fire TV, appleTV, nexus player, etc. at a third of the price. If you have an appleTV the speed of this device will blow you away. I cannot see a single reason to not recommend the fire stick :)", "verified": true, "helpfulness": "0/1", "author": "matt kramer"}, {"rating": 5.0, "review": "Amazing product. No buffering & very responsive than Roku & chromecast.", "verified": false, "helpfulness": "2/3", "author": "gagan"}, {"rating": 5.0, "review": "Very fast - slick interface - too bad apps are not all accesible from home screen. Mine worked with power from usb vs wall plug -> less cords!", "verified": true, "helpfulness": "0/1", "author": "Mirrie \"Mirrie\""}, {"rating": 5.0, "review": "Since the Fire TV stick was announced, I've heard a lot of people wonder if it was something worth picking up, essentially asking \"what does this thing do that my TV doesn't do already?\"  The answer is going to be different for different people, but here's an easy way to think about it; Amazon Fire TV Stick is an excellent purchase if:-Your TV is not a \"smart\" TV.  Meaning your TV or dvd player did not come pre-loaded with apps such as Netflix, Youtube, Pandora etc...-Your TV is a \"smart\" TV, but apps do not perform well.  Some smart TVs have painful performance when streaming video, apps can be difficult to update, wifi connection can be spotty etc...-You want to access Youtube, Netflix, Amazon Prime, Pandora, and other such apps on your TV-You are an Amazon Prime Member and want to access your Prime Video, Prime Music, and Prime Photo accounts-You want to participate in casual gaming on your television.-You want to listen to music on your TV-You want to have portability.  In other words, Television access to the above services while you are travelling. (Amazon says the capability to use in hotels/dorms etc... with shared wifi that requires frequent password entry is coming soon)So, the bottom line is that the Fire TV Stick allows you to access your movies, music and photos as well as games and more  via your television.  If your TV already does these things well, or you're already doing them via other devices such as a game console, then this may not be worth your while.So, how easy is it to use?  I'm telling you, you do not have to have an ounce of technological know how to have this thing up and running in a matter of minutes. There is a set of 5 very simple instructions for set-up that had me watching House of Cards less than 10 minutes after I unboxed it.  It comes with a remote that includes just 7 buttons  (your phone can also become a remote by adding an app, though this is not quite ready on the iPhone yet) and upon completion of connecting the stick, you are taken to a simple tutorial video that explains very well the use of the remote.  There is also an optional voice control remote that can be separately purchased.  It is in no way required to operate the Fire Stick.  Sidenote:  If you buy the Stick online, it comes preset to the account from which it is ordered.  If this is not the account you plan to use (I needed to use my wife's because she has the prime account) it's very easy de-register and change accounts; took me less than a minute.I have accessed Prime Video and the picture and speed is fantastic.  I've accessed Prime Music and the sound quality and speed are excellent and include nice background photos of artists and albums.  Apps are easy to browse and download as are games.  I was also able to \"fling\" to Netflix etc... from my Kindle Fire quite easily.I've been using a Chromecast since they came out, and I think the Fire TV Stick competes very well.  I like the remote (which the Chromecast doesn't have), and I love the memory and speed.  And if you are an Amazon Prime Member, this is hands down your best option. This would make a great gift, and is easy enough to use that you could give it with confidence to someone who has no technological savvy at all.If you're looking to get the most out of your HDTV, The Fire Stick is a fantastic way to go about it.  I highly recommend it, and based on how smoothly everything went on what was probably a very busy day for Amazon servers, I'm confident that you'll have the same or an even better experience.  Enjoy!", "verified": true, "helpfulness": "6/530", "author": "Mike W."}, {"rating": 5.0, "review": "best fire stick tv out there its way better than roku stick and  will recommend to many people", "verified": true, "helpfulness": "0/1", "author": "Flor Torres"}, {"rating": 5.0, "review": "I pre-ordered the fire stick as the Amazon prime customer the first day it was offered.  I didn't know what to expect although I am a true and loyal to Apple products, I want an inexpensive way for the rest of the family to have access to different apps on the television as well as something that we could travel with.  Receive the package on time & it was securely wrapped and it was a five-minute installation process.  The kids grabbed the remote and went to town... Fast download speeds (we have Verizon FIOS Internet with 75/75 speeds on best router they have to sell!  Fire Stick TV is lighting fast! For $19 ea (if you ordered in the first two days for Amazon prime customers only) it an awesome deal and high-quality product! All my kids we be happy and definitely will push this products limits & use especially my son in Army, they travel lots! THANK U AMAZON! KUDOS!", "verified": true, "helpfulness": "1/2", "author": "Luvshellokitty2"}, {"rating": 1.0, "review": "Pros:  Connects to 2.4/5.0 ghz Wi-fi, streams prime videos reasonably wellCons:  Interface is awful--clunky and slow; PBS \"app\" is virtually useless--can't select items; power supply takes up two outlets due to a poor design, Fire TV Stick goes to \"sleep\" for no apparent reason, battery door on remote takes two men and a boy to open it, very limited numbers of selections of video sources--no HBO to Go for example.  On hold to Amazon customer service for an extended period, finally gave up.  Huge waste of time.Pro/Con: I only paid $20 for this cheap contraption which is better than wasting $40 on it.  Maybe Amazon will take it back.", "verified": true, "helpfulness": "5/17", "author": "Mike D."}]