[{"rating": 2.0, "review": "Just received my firestick yesterday and no matter what I do, it will not find my network... or any other for that matter.  We have no problem with using WiFi with our phones, surface pro... everything else works just fine.  We even tried using our phone as a hotspot.  Nothing!!  We have tried everything that we read and nothing is working.  We did try it at another location first (husband's work) and it did find the network there.  Does it save this information and it is still looking for that same info??? ANY help would be greatly appreciated.", "verified": false, "helpfulness": "0/1", "author": "Tracey"}, {"rating": 5.0, "review": "Love this! I don't use it as often as I would like to, as the only TV it hooks up to is my bedroom TV, and I don't spend much time in there...but it will come in very handy when we get another TV with an HDMI port, or if we move the current TV to a more frequently trafficked area of the house.", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 3.0, "review": "Would be great. You need a strong wifi signal in your home, or your stream will drop.", "verified": true, "helpfulness": "0/0", "author": "Love it"}, {"rating": 5.0, "review": "Excelente!", "verified": true, "helpfulness": "0/0", "author": "Abel Rodriguez"}, {"rating": 5.0, "review": "Love it. Exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Vana Jones"}, {"rating": 5.0, "review": "The Fire TV stick has worked nicely for the 2+ weeks that I'be had it.  I recommend it for anyone that has a good enough Internet connection to support streaming video!", "verified": true, "helpfulness": "0/0", "author": "T. Yoksas"}, {"rating": 5.0, "review": "I got this for Christmas and really love it... it's so nice to be able to watch what I want without commercials! I am looking at getting another one for our other tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the Fire TV Stick works great and I am hooked.", "verified": true, "helpfulness": "0/0", "author": "George Vella"}, {"rating": 3.0, "review": "I am disappointed that Amazon did not explain that to see more movies, one must purchase prime.I am also disappointed that Amazon did not explain that there would be movies and aps that would also require additional cost.If I had known the above, I would not have purchased the Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "Jerry"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Dawe"}]