[{"rating": 4.0, "review": "luv it", "verified": true, "helpfulness": "0/0", "author": "T \"pain\""}, {"rating": 2.0, "review": "It is only 15' from the router, yet it constantly disconnects! Every other device in home gets great connection and great up/dn speeds! ...and yes I have tried using the hdmi extension and have the current version. Wish it would work as well as some have posted. Very frustrating!", "verified": true, "helpfulness": "1/1", "author": "MrCheerfull"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "will"}, {"rating": 5.0, "review": "LOVE LOVE LOVE Amazon Fire TV Stick! We don't have cable, we have the interwebs and then utilize Prime and other such things. We used to have our laptop hooked up via HDMI to the TV, and then have to use the laptop to find what we were to watch. I love that it comes with a remote. Setup and navigation is SO EASY, even my mom who is not tech-savvy AT ALL was able to set up hers. You plug it into your HDMI and USB charge (whether that's into the wall with the adapter provided or into TV USB). That's it. There are so many apps available AND GAMES.", "verified": true, "helpfulness": "0/0", "author": "heather elftman"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "jenny"}, {"rating": 4.0, "review": "I'm very pleased. Simple.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Much nicer to be able to watch mostly what I want. Wish that MLB and other networks didn't buffer so much. Also would like to have more networks (CBS Access, TNT, etc) added that you don't have to have a cable provider to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Yes, it was all that I expected it to be.", "verified": true, "helpfulness": "0/0", "author": "Veda M. McKinney"}, {"rating": 5.0, "review": "Great item, easy to use", "verified": true, "helpfulness": "0/0", "author": "Sue Wright"}, {"rating": 2.0, "review": "Returned it.  Nothing on it but old movies and tv shows.", "verified": true, "helpfulness": "0/2", "author": "Ron"}]