[{"rating": 1.0, "review": "Good luck trying to get the batteries into the remote!  None of my neighbors and friends could figure out how to open the remote and put in the batteries.  And the firestick has to be plugged in to an electrical socket, so it's not like just inserting a memory stick into the back of the TV.  The stick sticks out from the back of my TV, is visible when looking at the TV screen from the front, and I have an extra cord dangling from it.  Hmmpf!  I will be returning it.", "verified": true, "helpfulness": "0/0", "author": "Annette Montez \"iPod lover\""}, {"rating": 5.0, "review": "It's nice to have. Still trying it out", "verified": true, "helpfulness": "0/0", "author": "Wes"}, {"rating": 5.0, "review": "Absolutely love it! Exactly what I was looking for!", "verified": true, "helpfulness": "0/0", "author": "Melissa Dunn"}, {"rating": 1.0, "review": "No offense - but this is the most hyped waste of money since Kim Kardasian's ass shots.Unless you pay everyone on Earth user fees - there is absolutely nothing anyone would want to watch.It is really clean looking and the BOX it comes in is astounding..After it's opened the disappointment begins and never ends until you send it back& the weight of yet another money hemorrhaging scheme re-enters it's non existence &you begin to feel really good about yourself again.So as therapy it is an invaluable tool. And once you have installed it - so are you.They returned my money forthwith.So PRIME's return policy is good.", "verified": true, "helpfulness": "0/1", "author": "James Lawless"}, {"rating": 5.0, "review": "Tons of features and very responsive - feels fast when you use it which I love. Great price especially on sale, best netflix device in its price range I've seen.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 3.0, "review": "It does fine with netflicts, apps etc, but where I am not  happy is in the small print. My kids have ordered several apps by accident and I can't read the purchase info at a distance of 6 feet and I have 20/15 vision. Not cool. Bigger print please!", "verified": true, "helpfulness": "0/0", "author": "Meg C."}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Denise Dering"}, {"rating": 5.0, "review": "Fantastic product amazing value! I bought 2!", "verified": true, "helpfulness": "0/0", "author": "mikel"}, {"rating": 5.0, "review": "Excellent product. Easy setup and operation. Many app options.", "verified": true, "helpfulness": "0/0", "author": "Tim B"}, {"rating": 5.0, "review": "Love it! Very easy setup (and I'm not a techie at all) and simple to use. If highly recommend it to anyone who likes to watch movies and not have to pay big $$ every month.", "verified": true, "helpfulness": "0/0", "author": "Deborah DeLaite"}]