[{"rating": 5.0, "review": "Great!  Easy to use and set up...would recommend to anyone and everyone!", "verified": true, "helpfulness": "0/1", "author": "Capricorn"}, {"rating": 4.0, "review": "For the price, quite the piece of equipment. Still learning all the features, but so far I have been thoroughly impressed.", "verified": true, "helpfulness": "0/1", "author": "Henry"}, {"rating": 5.0, "review": "Talk about a small device that can turn your TV into a Smart TV. This is a true worth having plug and play device for anyone whom has netflix, Amazon Prime, HBO and would like to bring the world of YouTube to your living room or other bedroom tv. This device is a hub and if you already subscribe to the many movie streaming services, they all come to life on any TV with an HDMI port thru your Internet WiFi connection. it's as simple as that.", "verified": true, "helpfulness": "0/1", "author": "DebShep68"}, {"rating": 5.0, "review": "I love the how easy it is to use, was great when I had my grandson and he got to watch sponge bob as all I have is an antenna", "verified": true, "helpfulness": "0/1", "author": "cindy"}, {"rating": 2.0, "review": "I thought I could use it on other devices with HDMI but its only on a tv with HDMI. I was also unable to link my NYKO bluetooth controller eventhough the system says I can", "verified": true, "helpfulness": "0/3", "author": "CDW"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "inot70"}, {"rating": 5.0, "review": "I am loving my Fire TV Stick. Working great lots to watch. I highly recommend it.", "verified": true, "helpfulness": "0/1", "author": "Linda Korbel"}, {"rating": 4.0, "review": "Plug and play- easy. For some reason does not connect to regular, unpaid Hulu.", "verified": true, "helpfulness": "0/1", "author": "CW"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/1", "author": "Clarissa Looney"}, {"rating": 5.0, "review": "So convenient when i want to watch a move in bed.", "verified": true, "helpfulness": "0/1", "author": "N. DeMilto \"notechidea\""}]