[{"rating": 2.0, "review": "Bought this because it seemed like the easiest way top access prime music. Have it plugged into my receiver (like all my devices) and I have to have the tv on to start the music because the app is only directional not mirroring the menus. Turned the tv off and the output stopped. Which also means I won't be able to play or control the music in my second zone which doesn't have a video output. This capability was the only reason I bought it... I can do everything else this does with about 6 different devices I already own.", "verified": true, "helpfulness": "0/0", "author": "SWO"}, {"rating": 5.0, "review": "I have a Fire TV for my living room so I got 2 of these for the bedrooms. They are amazing! For the price, these are real fast and offer a lot of features, apps, and games. What I love most about this is that unlike ChromeCast, Fire TV Stick offers a remote and does not depend on your phone. At the same time you can use your phone as a remote too. It is very well built and hides behind the TV. One of the best products out there for streaming.", "verified": true, "helpfulness": "0/0", "author": "LED Maniac"}, {"rating": 5.0, "review": "So I'm a bit behind on the technology learning curve, but I ordered an Amazon Fire Stick and within 5 min., I was up and running.  EVERYONE NEEDS ONE OF THESE!  Only $39 to buy, no monthly cost; and if you have Amazon Prime, you can watch thousands of movies and shows on your TV instead of your tablet.  I recently signed up for Netflix; and for $8.99 a month, we can watch thousands of movies, premium TV shows, kids' cartoons, etc., on two TVs ($7.99 for one TV).  Best of all, it's the easiest thing in the world to install and use.  I ordered a $99 one for downstairs, and it has a voice feature--just say the name of a movie, actor, director, genre, etc., and it'll take you to it.  If you have Amazon Prime, Netflix, Hulu, etc., you have to get at least the inexpensive stick so you don't need to watch through a gaming box or--in my case--try to figure out how to watch on a TV instead of your tablet.  Would make a great Christmas gift.", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Heise"}, {"rating": 5.0, "review": "I have used two generations of Roku boxes, and Google ChromeCast. My Roku boxes were rendered unreliable when I moved a year ago. XFINITY clearly took aim at closing the competition, and I was sorely disappointed in the work arounds. I thought ChromeCast would provide an ideal replacement, but again because of rivalries in the market Chromecast does not (did not) support Amazon streaming, even from within the Chrome browser. NETFLIX worked well, but I lost capacity to use my Kindle HD when casting NETFLIX to my TV screen.I was therefore eager to try the new Fire TV stick. This $19.95 device (for Prime members) offered far more than the original Roku boxes, and I find it faster, more responsive and more reliable. You can transfer your screen contents from Kindle HDX's and Fire phones (I have neither), but the real beauty is that this device works with virtually any home cable or internet provider to give you greater capability than the old Roku boxes. Amazon streaming and Netflix work perfectly, But there are also downloadable apps for Amazon MUSIC, Pandora, and Tune-in Radio, plus access to Showtime Anywhere, CBS News, NBA Channel. NFL, and hundreds of other channels. It also offers real time browsing and play of YOUTUBE videos, which means your TV is basically transformed into a Smart TV.All of this means that you can move this device with ease to any TV and immediately access hundreds of thousands of movies and tv shows on the road, or (as in our case) on the TV in the kids' playhouse out in the back yard.", "verified": true, "helpfulness": "1/1", "author": "jb"}, {"rating": 4.0, "review": "I normally watch streaming shows on my PC a few feet away from me.  The PC provides a good picture and menus with fast access to programs.  I tried a Chromecast when they first came out but accessing shows was tedious and the voice was out of sync with the video.  I figured I would try the FireStick because it only cost $19 and had a faster processor.  The first time I tried it the ad played OK but when the show started there was sound but no video.  That only happened once.  The video and sound stream fine.  The control stick works OK.  It is straightforward but is slower to navigate to shows than on the PC.  A tablet or phone can be used instead of the remote but it only simulates the actions of the remote.  The software people should be able to come up with something better.  The FireStick seems to be a good product with good value even at a full price of $39.", "verified": true, "helpfulness": "1/1", "author": "ES"}, {"rating": 5.0, "review": "I love the picture quality, I am enjoying it.", "verified": true, "helpfulness": "0/0", "author": "p.pie"}, {"rating": 5.0, "review": "Works Great! Easy to install.", "verified": false, "helpfulness": "0/0", "author": "rebecca"}, {"rating": 4.0, "review": "As advertised so far (good thing), just needs HBO Go to be better.", "verified": true, "helpfulness": "0/0", "author": "Mike J"}, {"rating": 4.0, "review": "I was able to take advantage of the promotional offer for this new product($19.00) and wanted to compare it to my Roku 2 and the Tivo Roamio I currently stream Amazon Prime and Netflix on. First of all, I should mention that I have DSL internet and while I have a 1080p LED TV the higher resolution output caused the programming to buffer quite often. However, after setting the video output to 720p the unit streams very smoothly with excellent picture quality on HD programs. Performance of the new Fire TV stick is very close to my Roku 2 box in terms of quick navigation of the menu and loading content. So far, I really like how the unit works and would only note that the available channels is far behind Roku though I'm sure they'll be closing the gap over time. In summary, even at the everyday price of $39.00 the \"Fire TV Stick\" is a great value.", "verified": true, "helpfulness": "0/0", "author": "AzBuckeye"}, {"rating": 2.0, "review": "Overall:I'm highly disappointed with the connectivity and responsiveness of the Fire TV Stick. When I leave the Fire TV Stick plugged into the wall (as suggested per the instructions) and plugged into the HDMI port of my TV for an extended period of time, the TV Stick feels like it is over-heating (very warm to the touch). Also at this point, the TV Stick will not respond to the remote. If I'm lucky enough at this point to have the device display a picture on my TV, it will frequently stay frozen on it's current screen, or not respond for in excess of 1 minute per single request from the remote (i.e. The TV Stick will not respond to pressing the 'down arrow' button for more than 1 minute, while not providing any other inputs to the TV Stick from the remote). I wouldn't expect to need to unplug this device from my TV every time I am done using it; that kind of defeats the purpose of having the device (convenience).Pros:- I have access to my Amazon Prime Videos on Demand- When it works, it's greatCons:- Non-Responsive when continually plugged into the TV- Device heats up when plugged in for extended periods of time; This amount of heat is very bad for the internals of any electronic device and as such is likely to drastically shorten the life expectancy of the Fire TV Stick- Suggested power connection is through a wall outlet, as opposed to the USB connection on your TV- You can't skip the introduction video during setup, which for any tech-savvy person is extremely irritating- When searching for videos, \"Free\" PRIME Instant Videos should be completely segregated from Pay-for Videos. I didn't buy this device to purchase additional videos, but to simply get value out of my Prime membership and watching the Instant Videos which likely caused my Prime membership cost to increase.Final comments:My Chromecast works just fine, so I know it's not the TV (and I've tested multiple HDMI ports, so it's not that either).2 Stars simply because: When the device works, it works great. I was tempted to give 1 Star, but the device works before it heats up to point of failure.I haven't used the phone as a remote yet, but the tutorial didn't make me excited enough to use my phone as a remote. The interface seems too bulky compared to simply using the remote. Voice Search sounds like a fun feature, but I'd guess that less than 5% of users actually utilize that feature.", "verified": true, "helpfulness": "1/3", "author": "nystc23"}]