[{"rating": 5.0, "review": "Well worth the money, the interface is easy to use.", "verified": true, "helpfulness": "0/0", "author": "UN4G1VN"}, {"rating": 5.0, "review": "very easy to use", "verified": true, "helpfulness": "0/0", "author": "M26"}, {"rating": 3.0, "review": "Having a hard time with this trying to get it to work.  I thought it was going to be easy and it is not  dissappointed", "verified": true, "helpfulness": "0/0", "author": "Pat Corcoran"}, {"rating": 5.0, "review": "I got this for my daughters room. She lives it does everything she wants it to do. I also at times watch it asee I switch it from tvs. I feel the stick is best for switching TV then the fire TV is. That may just be me but I don't like to hall around a box with I can move a USB shape around. Also it's not as powerful so it does lag when a lot of things are at the same time but after everything is done and video/movie is playing it's all good.i got it free with the 3 months of sling tv. I have 2 other fire tvs. Love all 3. Fire tview is best for me when I don't have to move it around and the stick feel better to move around.  Also the apps of remote work with the stick. Everything is good.love it.", "verified": true, "helpfulness": "0/0", "author": "Ezequiel Garcia"}, {"rating": 5.0, "review": "Since I don't have a smart tv this Fire TV stick works amazing. I no longer need to use my iPad and connect to TV to watch netflix or other apps.", "verified": true, "helpfulness": "0/0", "author": "Tanya"}, {"rating": 5.0, "review": "It works so well.  I love it.", "verified": true, "helpfulness": "0/0", "author": "D in D fan"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV Stick for my husband for Christmas. It was the perfect gift for him because he likes to watch movies while exercising.  I recommend the fire stick-- especially if you are already a Amazon Prime member.", "verified": true, "helpfulness": "0/0", "author": "Camille C."}, {"rating": 5.0, "review": "Easy to install and works excellent.", "verified": true, "helpfulness": "0/0", "author": "Eileen S. Grider"}, {"rating": 5.0, "review": "It was easy to hook up and easy to use.  I am a Prime member so I'm happy to see all my shows and movies.  Picture is clear, sound is good, too.  A really good product with lots of apps to chose from.", "verified": true, "helpfulness": "0/0", "author": "carkittter"}, {"rating": 5.0, "review": "I love it. So simple and dont need anything else.", "verified": true, "helpfulness": "0/0", "author": "C. A. Craig"}]