[{"rating": 5.0, "review": "Great for HBO-Go, which has content not on-demand", "verified": true, "helpfulness": "0/0", "author": "Bart"}, {"rating": 5.0, "review": "Perfect ! Love it!", "verified": true, "helpfulness": "0/0", "author": "Renee D Heathman"}, {"rating": 5.0, "review": "I Love it great entertainment value best buy for the money.", "verified": true, "helpfulness": "0/0", "author": "James M. Pearson"}, {"rating": 5.0, "review": "It has enabled me to watch my favorite app, Neflix and is working beautifully. Love it..", "verified": true, "helpfulness": "0/0", "author": "Joan Keturakis"}, {"rating": 4.0, "review": "Overall it's terrific... but could use a \"LOCATE REMOTE\" button on the stick.  The remote is nice, small, and easy to lose.  A little locator button on the stick to set off a beeping on the remote would be nice.", "verified": true, "helpfulness": "0/0", "author": "AC"}, {"rating": 5.0, "review": "Exactly what I was looking for.  Lightning fast speed, which was my main concern considering my router is pretty far away from the family room where this is plugged in to the TV.  I have absolutely no connection problems.  Tons of apps and if you are a Prime member, there's really no reason to buy anything else.  It has ESPN3 which was important to me, as well as many kids apps that my 4 year old son loves.  Very easy to use.  Very easy to set up.  I had researched the Roku, Apple and others before buying this.  I am 100% satisfied and would recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Steven J. Fiorey, II"}, {"rating": 5.0, "review": "Love iit! Took it on vacation with me so I could binge watch my shows!", "verified": true, "helpfulness": "0/0", "author": "Kelli Miller"}, {"rating": 1.0, "review": "Thought this was wireless but it has to be plugged into TV AND electrical outlet.", "verified": true, "helpfulness": "0/0", "author": "H. Swilley"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "AUSTIN IMES"}, {"rating": 5.0, "review": "Taste good, lol", "verified": true, "helpfulness": "0/0", "author": "Nsboyz \"Duane Dias\""}]