[{"rating": 5.0, "review": "This was a birthday gift for my wife and she loves it. When Momma's happy everybody's happy!", "verified": true, "helpfulness": "0/0", "author": "billy g martin"}, {"rating": 4.0, "review": "Enjoy all of the options available. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Savena"}, {"rating": 5.0, "review": "This is the best invention!  It  took seconds to install and I am watching  everything I was watching on my kindle now on big screen", "verified": true, "helpfulness": "0/0", "author": "jasa68"}, {"rating": 3.0, "review": "the only way to go", "verified": true, "helpfulness": "0/0", "author": "steve sego"}, {"rating": 1.0, "review": "Worked great for a day. Then it wouldn't stream without stuttering, or I'd get sound and no picture, etc. Read the one-star reviews, pretty much the same story here. Tried resetting, de-registering, etc. Junk.", "verified": true, "helpfulness": "0/0", "author": "Biff Malibu \"biffmalibu\""}, {"rating": 5.0, "review": "I love it, now you can't get me alway from the TV, thank you", "verified": true, "helpfulness": "0/0", "author": "Bobby D Robertson"}, {"rating": 5.0, "review": "Excellent product! I loved it so much I bought a second one for another TV in my home.", "verified": true, "helpfulness": "0/0", "author": "M. Dickson"}, {"rating": 4.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "Tim Haynes"}, {"rating": 5.0, "review": "This was a very easy process to get Prime shows on to the TV without fuss- It came ready to go and I literally had it going in 5 minutes with the only issue being not quite enough room on the powerstrip for the plug- We've had no quality issues, no angry re-boots, and the picture quality and selection is completely worth it. I recommend this highly and I don't say that often-", "verified": true, "helpfulness": "0/0", "author": "Scott W. Northup \"Scott N\""}, {"rating": 5.0, "review": "I love this product! I will be buying another for upstairs use. Not that it's difficult to plug and unplug, it's just that nobody wants to share it!", "verified": true, "helpfulness": "0/0", "author": "Jean Campbell"}]