[{"rating": 5.0, "review": "Works well.  I like it.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 3.0, "review": "I should have gone with the box.  This thing lags a lot.  Sometimes I will press left on the controller and it won't stop. Sometimes one left press makes the cursor move like five spaces.  It's cheap.  That's what it has going for it.  Oh, and you can side load Kodi.If you can, go with the box", "verified": true, "helpfulness": "0/0", "author": "Paul Rossi"}, {"rating": 5.0, "review": "I'm new at this and have not tried everything. I'm mostly interested in decent movies. I would really like to see a Family category under movies. It would make it much easier to find movies fit for all ages.", "verified": true, "helpfulness": "0/0", "author": "Donna E Bowles"}, {"rating": 2.0, "review": "After almost a year of use I must say this product is just \"OK\". Its slow response from remote to device builds up an annoyance.Youtube: When using youtube app the response time from remote to app is extremely delayed to the point that just clicking the down button once will jump three or four categories. The delay of streaming videos is bogged down the more it is used since this little device heats up dramatically.(1 Star)Plex: Using Plex on this device gets annoying as well, constantly the movie will hiccup or pause during mid stream every few minutes, again these are minor hiccups but in the long run becomes so annoying that I constantly switch to another device. (1 Star)Netflix: This is the only app that works as it should, It still has that user lag from Remote to device and some times the Device will skip a couple of sections thinking that you clicked the remote multiple times when you only clicked it once. (3 Star)Main Menu: Very slow, that User Lag will test your patience after awhile. As this is an Amazon Product It slaps you in the face with Amazon products such as streaming and music, Apps such as FLIXSTER and XBMC Doesn't even show up on \"Recently viewed apps\" forcing you to find it out side of its main menu. Side Loading is available which is good but all apps installed this way can only be accessed through settings which is a chore. (2 star)Device: It gets hot, real hot real fast adding to user device lag issues. It does have a slick design though. (2 Star)BlueTooth: it does have Bluetooth and I was able to connect my Ouya pro to play Sonic CD and was able to control sonic normally (Game played at 1/2 speed though). (2 Star)All and all I got this product when it was first announced for $20 bucks and at that Price it is some what worth it ONLY if you want to reduce your electric bill since 24 hours of run time equals to 1 hour of the Slim PS3 run time. Other than saving your Electric bill, minor annoyances build up to the point that you will probably just use your other devices over the Amazon Stick.Minor Disappointment.", "verified": true, "helpfulness": "0/0", "author": "The Aguirre Family"}, {"rating": 2.0, "review": "Prime services not available outsinde of USA - Why? If NETFLIX is available...Only a few apps the amazon store is offering for the product - not even crackle could be loaded.Sideloading apps works very limitated.", "verified": true, "helpfulness": "0/0", "author": "Olaf S."}, {"rating": 4.0, "review": "Love it, the only complaint I have is the connection to Spotify app seems to be spotty, like it wont show up on my phone but not sure that really is an issue with the fire stick or the application itself", "verified": true, "helpfulness": "0/0", "author": "Michelle Brice"}, {"rating": 4.0, "review": "We are trying to get rid of our Direct TV. This works great but we will not be getting rid of Direct just yet. I like to watch our local news and you cannot get local news from this. I'm thinking about getting a tv antenna for the roof of our house and keeping this also. There are a lot of episodes that need to be paid for- which I refuse to pay $2-5 for an episode of SpongeBob or any other show.", "verified": true, "helpfulness": "0/0", "author": "amy cooper"}, {"rating": 5.0, "review": "really enjoy this a lot great movies", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"mayan67\""}, {"rating": 5.0, "review": "Great device and easy to use. The remote is a better alternative (for controlling basic functions) to using the phone to control especially if your phone is usually locked and you have to spend extra seconds turning on the phone, opening an app etc.", "verified": true, "helpfulness": "0/0", "author": "Sriram"}, {"rating": 5.0, "review": "always good", "verified": true, "helpfulness": "0/0", "author": "Thomas J. Lorenzini \"tomsbills\""}]