[{"rating": 5.0, "review": "Great streaming device, works right out of the box (with my prime info already loaded).  Worth every penny...", "verified": true, "helpfulness": "0/0", "author": "Christopher N"}, {"rating": 5.0, "review": "I love this item.  We do not have any cable or channels on our television.  But, with the fire stick, we can easily watch Netflix or Amazon Prime videos directly through the television.  I no longer have to have the cord connecting my tv to my kindle.  It is easy to use.  And I like that I have parental blocks on it as needed.  My 7 year old can operate it without issue.  We haven't lost the remote, but if I do, I have the fire stick remote app on my phone.  I have tried that and it works just fine.We had a few issues at the start where it was not staying connected to the internet.  but, I think that was due to my wi-fi and where I had it placed at the time.  We haven't had any issues since.", "verified": true, "helpfulness": "0/0", "author": "Kregrub"}, {"rating": 5.0, "review": "Thank you've Slenti item as requiredAnd experimented with YouTube Llosa I try to buy from Amazon himA very coolThanks Amazon", "verified": true, "helpfulness": "0/0", "author": "alghumayan"}, {"rating": 5.0, "review": "It's a grest item I recommend for anyone...", "verified": true, "helpfulness": "0/0", "author": "Brandon Bookert"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "Aurora Encinia"}, {"rating": 4.0, "review": "Very easy to use and much more convenient than other devices.", "verified": true, "helpfulness": "0/0", "author": "Cynthia B Petitt"}, {"rating": 5.0, "review": "I love the Fire TV Stick! The picture quality is great, the set up was easy and the menus make it easy to use. For the time being I use it at home through my home wireless, but I travel quite a bit during the summer and plan to use the Stick at RV Parks with good Wi-Fi or cell phone hot spot. Digital TV on antenna is not dependable and Fire TV could be the answer. If it works as well on the road as it works at home, I may never get a satellite system for my RV!", "verified": true, "helpfulness": "0/0", "author": "Roger Tetrault"}, {"rating": 5.0, "review": "I love my fire TV stick, it work well with my 29in because it a smaller TV. I will be getting the fire box for the big 50 in I have.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"NYM\""}, {"rating": 3.0, "review": ".Needed to buy other equipment in order to hook it up as I did not have enough HDMI slots on the tv. I also cannot access some of the programs listed. It will say Unavailable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So far, we love the Fire Stick.  We do experience times where the Stick is unable to connect to our wifi for no reason.  But, it's a wonderful edition to our outdoor antenna for our entertainment needs.  Tons of movies, TV shows and even games.  I highly recommend giving it a try.  Ditch your overpriced cable or satellite!!!", "verified": true, "helpfulness": "0/0", "author": "bridg47923"}]