[{"rating": 5.0, "review": "Can't say enough how much I love this! Never had streaming TV before and this was so simple to hook up and use right from the box. I would get this before any other.  If you have PRIME with amazon this is the only one you need. So much great content is free to view!", "verified": true, "helpfulness": "1/1", "author": "Julie Beveridge"}, {"rating": 2.0, "review": "Loses internet connection regularly and then shows no networks in range when trying to reconnect. Cannot watch a show without having to get up and unplug power to reset. I am glad I got this when it was only $20 because I would be upset if I had wasted any more money than that. Great concept, bad execution,", "verified": true, "helpfulness": "1/1", "author": "Sara M. Johnson \"Cheshire Cat\""}, {"rating": 2.0, "review": "I should have researched more before I bought this. I was really hoping I could mirror my laptop to my TV, but the mirroring options are currently limited to a very small number of other Fire products.", "verified": true, "helpfulness": "0/0", "author": "Brett Geissbuhler"}, {"rating": 4.0, "review": "I bought this during the pre-order promotion period when it was $19.  It arrived in time to use during the holiday get-togethers.  It's a great portal to Netflix and Amazon Prime Kids content which were heavily utilized by the kids (2 and 4 year olds).  For the grown-ups, I was disappointed that it wasn't simply to rent \"The Interview\" (available via Google Play and YouTube).  Overall, this has been a simpler and more consumer friendly release than the Google Chromecast we had been using prior.", "verified": true, "helpfulness": "0/0", "author": "DANIEL CHANG"}, {"rating": 5.0, "review": "I love this thing. It has been so much fun learning all that it can do. If you don't have one, you should order one NOW. Seriously, it is amazing. I can watch anything that I want with this and so much more.", "verified": true, "helpfulness": "1/1", "author": "Shar"}, {"rating": 5.0, "review": "Super easy to setup and works great.", "verified": true, "helpfulness": "0/0", "author": "Prime Customer"}, {"rating": 5.0, "review": "Although I paid the introductory price; Amazon Fire TV Stick is worth the full price. I am planning on getting a second one for another TV. Amazon Fire TV Stick is simply amazing! Amazon Prime Instant Video is now just that: instant! I can't say enough about how impressed I am!", "verified": true, "helpfulness": "0/0", "author": "Debra D. Trout \"faithful mom\""}, {"rating": 3.0, "review": "At times it continues to say too low band width and because I have Comcast I cannot get some apps but when it does work I get Netflix and amazon prime videos vey clearly", "verified": true, "helpfulness": "0/0", "author": "Bryant M. Wilson"}, {"rating": 5.0, "review": "This is what Chromecast should have been.Very easy to set up, and very easy to use.  Family members who are not techies are very happy with the remote, and have no difficulty with the Fire TV Stick. Seems reliable so far.  The game option is intriguing, but haven't bought the controller yet.I own two Chromecasts, and while I enjoy tinkering with them, I find them a little too flaky for other members of the family.", "verified": true, "helpfulness": "0/0", "author": "barotropic \"albedo\""}, {"rating": 2.0, "review": "ok so i got the hot new fancy fire stick. Well it's just ok. I have had to remove my wifi connection and re-add it 6 times since i received the darn thing. Its like it needs to reboot the connection often. I watch the fire stick about once to twice a week mainly on weekends and i have Time Warner cable internet but my fire stick is iffy at most times.Update:So I have looked at the other reviews on the fire stick and found that in not the only one with wifi connection problems. I too bought it for 19 bucks but I have a Insignia TV 2013. I don't think its a TV problem, its a fire stick problem. The wifi connection just drops off in mid stream of watching what ever and I have to uninstall my connection and reinstall to continue watching. Amazon needs to send out an update for this first fire stick. Down graded to 2 stars because sometimes it works.", "verified": true, "helpfulness": "1/1", "author": "Ebony Williams"}]