[{"rating": 5.0, "review": "Simple to use, works well, no lag. Great product for the price.", "verified": true, "helpfulness": "0/0", "author": "DJ Pink \"D & J Pink\""}, {"rating": 5.0, "review": "Awesome. Easy and quick to set up, I was watching movies in 5 mins.", "verified": true, "helpfulness": "0/0", "author": "amy napolin"}, {"rating": 5.0, "review": "I haven't watched regular TV since this came in a few days ago. Maybe I will burn out on it but for now I am very happy with it.If I am watching a movie and have to leave i simply turn off my TV and upon returning I simply turn the TV back on and my movie picks up where I left off. No waiting to reload any programs or splash screens telling me who amazon is.", "verified": true, "helpfulness": "0/0", "author": "Gene"}, {"rating": 4.0, "review": "Nice compact and well built, got it early for a great price.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 2.0, "review": "while the setup was simple enough. The device apps are so few that i find i usually use only netflix and occassionally amazons app. Unless u have amazon prime for the movies i am not impressed. Ive found that roku offers far more app options but most of them are useless apps as well. Whats needed is more cable tv channel apps and that would attract more buyers and watchers. I am not by any means happy with cable or satelite companies which is why i like streaming options. I just want better amazon prices, choices and for free . I have no problem paying for prime if i actually saw anything i wanted to watch. Hulu plus offers best tv options but again paying for three streaming comanies is annoying!! Why cant someone combine all three of the best at one price with massive options. Now that i would really like! One last notation.. i dont like having to have a separate router and the comcast router and the stick in order to get stick service. I love the stick itself..no cords...but hate needing two routers. I love amazons movie options.", "verified": true, "helpfulness": "0/0", "author": "Demeceus J Baccu"}, {"rating": 5.0, "review": "The Fire Stick and its remote is sleek and cool looking. Setup was very simple. Connecting the device to my Amazon, Netflix, Pandora, and Hulu accounts was very simple. Navigation of the menus is easy and intuitive. The remote is surprisingly responsive when it come to the games you can play. On the down side--I didn't look over the product close enough so when I found it came with a power cord my fantasies of mobility drained away. I know it doesn't make it impossible to move from TV to TV but its not going to be as quick and easy as I imagined it to be", "verified": false, "helpfulness": "0/0", "author": "ZugZug"}, {"rating": 5.0, "review": "So far, so good. Set-up was simple. I got this for my bedroom TV to compliment the ROKU that I have for my living room TV. For only $20 (pre-release deal Prime members were offered two months ago) this thing was a steal. Everything works as expected and the visual aspect (on-screen displays) of the Amazon Stick is pretty rad. When you're not watching TV for a while, the screensaver mode rotates breathtaking pictures of nature in HD, which is really cool for nerds like myself.This thing will serve as a great holiday gift for your friends with WiFi and a subscription to Netflix and Hulu Plus. Especially for those who use gaming devices for such activities.", "verified": true, "helpfulness": "0/0", "author": "TheNiceLifeDotCom"}, {"rating": 5.0, "review": "Excellent product for the price. Beats the Chromecast. I barely have to use my phone, the little remote is a great step-up in this product line of TV dongles. I would recommend to anyone for home or travel use.", "verified": true, "helpfulness": "0/0", "author": "Pavel Vasilev"}, {"rating": 5.0, "review": "I bought the Fire TV Stick for the promotional price of $20 last month. I have only one regret, that I didn't buy two!The unit works well, no problems so far. What was neat was, using the supplied remote to get the unit on, is that somehow this little device \"sensed\" my TV remote and I was able to use it to navigate the menu's on the Fire TV Stick.I have no issues to report on this review for Amazon's Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Sourdo \"Russ\""}, {"rating": 4.0, "review": "This was pretty awesome and simple to set up...super fast response in use, fairly simple to use interface and remote. My one complaint is more with Prime, but there needs to be more options with Parental control. we bought this primarily for our kids playroom because we are getting rid of Satellite. If I want to to activate Parental controls for Prime our 5 digit code has to be entered every time they want to watch a new show, even with Childrens programs. There doesn't seem to be a way to set it to where you only have to enter the code if the show is above PG. Even better it'd be great if you could also have the option to block certain shows even inside their allowed parameter. If that were possible this would get 5 for sure.Out of the box to play was less than 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "Laura Frederick \"Zaxmom\""}]