[{"rating": 5.0, "review": "Love being able to watch my Netflix shows on the TV instead of my ipad", "verified": true, "helpfulness": "1/1", "author": "Susan Campbell"}, {"rating": 4.0, "review": "The FIRE TV Stick is a nice compliment to our TV.", "verified": true, "helpfulness": "0/0", "author": "TD LINDSEY"}, {"rating": 5.0, "review": "Very sleek. Great performance. I'm not a big TV guy but man I use this a lot.", "verified": true, "helpfulness": "0/0", "author": "Mootube"}, {"rating": 5.0, "review": "so far so good. love the music.", "verified": true, "helpfulness": "0/0", "author": "michael"}, {"rating": 2.0, "review": "its convient in size and easily portable, but even within 25 feet of wireless router, it freezes/buffers a lot.  Would have been nice if it didn't have to be ac power, and could have been powered through cdmi...", "verified": true, "helpfulness": "0/1", "author": "Frederick 3."}, {"rating": 4.0, "review": "easy setup, fast connection.  layout of apps could be better.", "verified": true, "helpfulness": "0/0", "author": "jad"}, {"rating": 5.0, "review": "My Daughter Bought me a Fire Stick for Christmas. I have a surround sound system so I purchased a 6'-Male/Female HDMI cable to plug the fire-stick into, The Picture is Great...All the Features are Great and,......... It's Plugged into my system instead of the TV so the Sound is Great also.  Being a Amazon Prime Member has a whole new meaning now, Thank you Amazon This is awesome.And just a little tidbit to close-A Netflix account is a great add-on for the Stick.", "verified": true, "helpfulness": "0/0", "author": "J. Coleman"}, {"rating": 3.0, "review": "Price was right at $20. But when I found out I couldnt stream from the hotel wi fi to my tablet and on to the TV?  Worthless. I already have a couple Roku at home. Disappointment.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up an use, even for the non-techy.", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 4.0, "review": "you good", "verified": true, "helpfulness": "0/0", "author": "thuan le"}]