[{"rating": 3.0, "review": "Amazon fire TV stick is better than Chromecast in many ways. The wireless is fast, almost bluray quality HD videos.Though, the description says free Netflix membership for eligible customers, let me clarify, it has nothing to do with Amazon. You have to register to Netflix with an account which was never activated before. Same for Amazon prime. You won't get any promo code to be used for your existing Netflix account to get 30 days free membership.The android based voice search works as expected, android based remote works great too without any lag.", "verified": false, "helpfulness": "0/2", "author": "SdS"}, {"rating": 5.0, "review": "It slow to boot up on the initial start up, but after that it works flawlessly.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Worked right out of the box.  Somehow it already was configured with our account information (we have Amazon Prime)  or figured it out from our IP address- I am not sure how it knew.  But the access to Amazon content was immediate. The interface is a lot cleaner and faster than found in net-enabled appliances.  That was my original impetus to purchase the unit and I was pleased with the results.", "verified": true, "helpfulness": "0/0", "author": "Cory Momany"}, {"rating": 1.0, "review": "Not user friendlyYoutube app hangsPoor wireless connection", "verified": true, "helpfulness": "0/1", "author": "rc"}, {"rating": 5.0, "review": "super!", "verified": true, "helpfulness": "0/0", "author": "marie"}, {"rating": 5.0, "review": "My only disappointment,  I should have ordered more when they were on sale!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fastest streaming stick I've seen hands down.  Menus fly by as fast as you can click the remote.  I have a Roku Stick as well and it's going to be handed down to someone because the Fire TV Stick blows it out of the water.  I'm thoroughly impressed!  Plex works great, Netflix works great, haven't met any stuttering video or choppy sound.  It's amazing they have this kind of processing speed in such a small streaming stick.  Comes with a power adapter and a 2-3\" HDMI extension dongle so that the Fire TV Stick isn't sticking straight out of the back of your TV if it's wall mounted.  Near-perfect device!  Don't bother with the other streaming sticks out there, this thing will blow them away.", "verified": true, "helpfulness": "1/1", "author": "Spliner"}, {"rating": 4.0, "review": "Very Easy to set up and use! I Love it! The only reason I gave it 4 stars is because it doesn't have HBO GO yet..but hopefully soon.", "verified": true, "helpfulness": "0/0", "author": "Sara Mason"}, {"rating": 5.0, "review": "the applications are fast and works better than the apps on my smart tv...love it", "verified": true, "helpfulness": "0/0", "author": "wapiti"}, {"rating": 5.0, "review": "I already own two apple TV's but I bought a stick anyway because it was cheap and out of pure curiosity.  I have had it for less than a week and I have already been able to install XBMC and some other side apps and I can honestly say that this might take the place of my bedroom apple tv!", "verified": true, "helpfulness": "0/0", "author": "EFFZero"}]