[{"rating": 5.0, "review": "I found the Fire TV Stick to be much more user friendly and technically more advanced than Chromecast.  My only wish list is I hope you program the features with Netflix as well as you have with Amazon.", "verified": true, "helpfulness": "0/0", "author": "rjh"}, {"rating": 5.0, "review": "Love it. Simple to set up. Works like a charm. I will probably get rid of some of my cable now.", "verified": true, "helpfulness": "0/0", "author": "rckstarchk"}, {"rating": 5.0, "review": "I love the Amazon Firestick!!", "verified": true, "helpfulness": "0/0", "author": "Maureen Anne Moughalian"}, {"rating": 5.0, "review": "simple, easy, fun and affordable.", "verified": true, "helpfulness": "0/0", "author": "William S Crandell"}, {"rating": 5.0, "review": "Easy setup, remote works nicely, all screens load quickly and clarity is noticeable. Great purchase and product, way to go Amazon!", "verified": true, "helpfulness": "0/0", "author": "Chuck Long"}, {"rating": 5.0, "review": "I started by buying a Kindle fire as an e-reader.  Things developed and added Amazon Prime.  Then a Fire TV Stick. It's  terrific small piece of hardware that allows me to tie in all three products to a big screen.  Movies, music, tv, and apps like netflix.  Though somewhat tethered to the Amazon world the Stick does everything to tie the whole package together.", "verified": true, "helpfulness": "0/0", "author": "scott york"}, {"rating": 5.0, "review": "Love this!!!!", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 3.0, "review": "had trouble connecting, but I have no problem streaming Amazon Prime on my smart TV.", "verified": true, "helpfulness": "0/0", "author": "Thomas Jefferson"}, {"rating": 5.0, "review": "I bought two of these for the two TV's in our camper for when we go somewhere that doesn't have cable. Yes, it's for our camper for when it's raining or late at night so we can watch movies. The TV's come in crystal clear and when I used my hotspot on my Galaxy S4 versus the Wifi there is no streaming. Just be aware it does  eat up your GB, so keep an eye on it!  One trick I did - I used a small command strip and attached them to the back of the TV's!", "verified": true, "helpfulness": "0/0", "author": "JM"}, {"rating": 4.0, "review": "This is a great streaming stick for the price.  Good hardware compared to other brand streamers. The software is of good quality as well, but is definitely tailored towards Amazon content.  Overall I would say this beats the competition in this price range.", "verified": true, "helpfulness": "0/0", "author": "GMoon"}]