[{"rating": 5.0, "review": "Great product to simplify watching TV and Movies.", "verified": true, "helpfulness": "0/0", "author": "W. Baril \"B-squared\""}, {"rating": 5.0, "review": "I bought this when it was first offered for $19.99. I set it up in less than 10 minutes from box to streaming. If you can change a light bulb you can get this working. And to save some money for the remote with voice search download the app on your smartphone and it has the voice feature. It does everything I expected it to do and so far there are no cons. Would recommend this for anybody who likes to stream as well as anyone who is a prime member. Another Amazon winner !!!", "verified": true, "helpfulness": "0/0", "author": "LOS \"LOS\""}, {"rating": 5.0, "review": "Fire TV was easy to install and easy to use. I am really pleased with the ease of use and being able to watch Amazon Prime content on my tv.", "verified": true, "helpfulness": "0/0", "author": "Billy F"}, {"rating": 5.0, "review": "Got this for my boyfriend for Christmas.  He loves it!  Arrived earlier than estimated,  I have an Apple TV and I have to say besides the feature on my Apple TV I like this one even better.  It's compact and easily portable without cords.  Just ordered one for me to use when I travel.  Can't beat the price!  I spend that for a decent meal in one night!  Great purchase!!!", "verified": true, "helpfulness": "0/0", "author": "Auntie2five"}, {"rating": 5.0, "review": "Great stand alone streamer for those of us that dont want to have a tablet or smart phone running in the background all the time.This is the best piece of amazon tech I have purchased, have had no issues with wifi like some have said.", "verified": true, "helpfulness": "0/0", "author": "trackadjust"}, {"rating": 5.0, "review": "Awesome value! I have a Fire TV, so I use that primarily and gave this to my 65+ parents, whom really like it. Very fast and intuitive controls.", "verified": true, "helpfulness": "0/0", "author": "Michael Carroll \"Mike\""}, {"rating": 4.0, "review": "Was what I expected.  Just one note it does require a power source.", "verified": true, "helpfulness": "0/0", "author": "Angela Williams"}, {"rating": 4.0, "review": "It was an easy setup been watching movies and series in the comfort of my own living room since I hooked it up.... It's awesome and can't beat the price", "verified": true, "helpfulness": "0/0", "author": "Lori Culotta"}, {"rating": 5.0, "review": "Easy to instal and once installed easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Charles S."}, {"rating": 2.0, "review": "worked for one day and now wont lock on to wifi signal? still working on problem,but so far very disappointed!", "verified": true, "helpfulness": "2/2", "author": "jaime caudillo"}]