[{"rating": 4.0, "review": "I love the available features. But my wifi is lagging. So the Fire Stick is great if you don't experience my connection issues. I would definitely recommend it. And I'm buying it for friends!", "verified": true, "helpfulness": "0/0", "author": "nikki trento"}, {"rating": 5.0, "review": "I previously owned a Chromecast which worked well but was 100% reliant on a phone or tablet to drive it. Also, the Chromecast lacked support for Amazon Prime (which I subscribe to).So the Fire TV Stick worked perfectly straight out of the box. I downloaded a few free apps (such as youtube, netflix etc) and settled down for an evening of mixed media experience. Straight away I enjoyed the speed of the Fire Stick. It is markedly faster and more responsive than the Chromecast. Another big feature of the Fire Stick is the Search and Navigation. The Search feature seems remarkably intelligent and although I missed the keyboard on my tablet I had no problem finding the content I needed.What do I miss from the Chromecast? Frankly, not much. When I first received my Chromecast I was frequently able to cast streaming web pages to my TV. However at some point in time the streaming content would no longer appear on the TV. Very frustrating - I guess the web page owners caught on to what Chromecast Users were doing...You can download apps for android and iOS which also gives you the voice search feature on enabled apps. These work well but I'd say there is still considerable scope for future development.I haven't explored every feature of the Fire Stick fully yet, but as a general purpose media streamer - from web content to home network content (music, video and pictures) the Fire Stick seems the most rounded and capable stick on the market. I do like the simple remote controller that comes with the Stick. The on-screen menu works surprisingly well and is fast.", "verified": true, "helpfulness": "0/0", "author": "Alastair G. Stell"}, {"rating": 1.0, "review": "Disappointed!!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The device works well. The adds kind of hide the fact that HDMI does not provide power so this device needs micro USB power in and it comes with a power supply and chord. It will not work without it so you need to consider where and how you will plug it in.Once hooked up, Amazon has very limited free video on Prime. You can run Apps like Pandora. But to effectively watch video, you need to build a library, get a service, or pay on the go. So, I have not used this to extensively as it was cheap and easy to set up to use but there is not too much to watch if your cheap.  If you already pay for HULU or something like that, probably worth the effort.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Fast, easy to operate and all apps I need. Worth the money.(I got it for 19$ prime member price)", "verified": true, "helpfulness": "0/0", "author": "vjshanky"}, {"rating": 5.0, "review": "Works well. Good signal strength. Nice menu selection.", "verified": true, "helpfulness": "0/0", "author": "Robert R Scherr Jr."}, {"rating": 5.0, "review": "Easy to set-up.", "verified": true, "helpfulness": "0/0", "author": "Val G"}, {"rating": 5.0, "review": "Great device. I can now get to Amazon Prime or Netflix quickly.", "verified": true, "helpfulness": "0/0", "author": "bdl"}, {"rating": 3.0, "review": "It's nice, i like the functionality of it", "verified": true, "helpfulness": "0/0", "author": "SHARON P. HARPER"}, {"rating": 5.0, "review": "I love this device.  It was easy to hook up (just plugged right into an HDMI port) and use.  It works fast without any delays.  It makes watching movies and tv shows with Amazon Prime effortless.", "verified": true, "helpfulness": "0/0", "author": "L. Loftis"}]