[{"rating": 3.0, "review": "Works good at times, but after about an 1hr or so, it lags and starts to become unresponsive, but other than that, it is great", "verified": true, "helpfulness": "0/0", "author": "Robert Mack"}, {"rating": 4.0, "review": "I love it!  Doesn't freeze, and it's easy to use.", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 1.0, "review": "Had to keep unplugging it to turn it off.  I went to plug it in and the plug-in was broken.  Looked like the pins got bent.  Had to buy another one.", "verified": true, "helpfulness": "0/0", "author": "Gregory Brown"}, {"rating": 4.0, "review": "Good news: the tv stick helps our poor, little, special, not-so-smart tv keep up with the younger prettier ones ;)", "verified": true, "helpfulness": "0/0", "author": "daddy warbucks"}, {"rating": 5.0, "review": "So far, the Fire TV Stick has worked very well.  I run it on a TV in the garage, so it works well having music, tv, and search in one place without having to have another PC, laptop, or tablet out there also.  Good to go so far!", "verified": true, "helpfulness": "0/0", "author": "CobraXP"}, {"rating": 5.0, "review": "Easy setup and great platform for apps.", "verified": true, "helpfulness": "0/0", "author": "Mark Smith"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Matthew Young"}, {"rating": 2.0, "review": "This thing has had issues from day 1.  Just constant freezing, lagging, juttering and ends up losing connection.  Glad I bought it at the introductory price.  Sometimes it works with just a few hiccups, but overall it doesn't compare to a more reliable Chromecast.  But now it's time for this thing to go in the garbage and step up to a Chromecast unit.  I have yet to get through an entire movie 100% trouble free.  Save $10 and get a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "H. Le"}, {"rating": 5.0, "review": "Love it all I wanted", "verified": true, "helpfulness": "0/0", "author": "Reggie"}, {"rating": 5.0, "review": "Best device ever!", "verified": true, "helpfulness": "0/0", "author": "c washington"}]