[{"rating": 5.0, "review": "Works great and cheaper.", "verified": true, "helpfulness": "0/0", "author": "Rachel Johndrow"}, {"rating": 5.0, "review": "My family loves it!", "verified": true, "helpfulness": "0/0", "author": "Yolanda East \"Yoeast\""}, {"rating": 5.0, "review": "My biggest complaint with all of Amazon's video streaming services has been that the navigation system is terrible. However, once you plug in this bad boy, you can easily search for and find movies and tv shows, just like netflix and other services. Except this is better because it also had netflix and games and other services, and I don't have to turn on my computer or plug it in. It is always there, waiting to serve my lazy, lazy needs.", "verified": true, "helpfulness": "0/0", "author": "Double A \"AA\""}, {"rating": 5.0, "review": "Really works great", "verified": true, "helpfulness": "0/0", "author": "JODY T ROSE"}, {"rating": 5.0, "review": "My TV is mounted up against the wall so I was concerned I would not be able to attach the required equipment.  Had no problem whatsoever.  Setup was a breeze.  Love the additional entertainment the Fire Stick provides.", "verified": true, "helpfulness": "0/0", "author": "Barb"}, {"rating": 3.0, "review": "well i am a little disappointed because of the fact that cbs doesn't have any apps to show the show criminal minds and hulu has absolutely none of the episodes of criminal minds so i guess we are gonna put the tv with the fire stick in the bedroom and get a smart tv for the living room", "verified": true, "helpfulness": "0/0", "author": "Neil Galosich"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Ewe"}, {"rating": 5.0, "review": "Getting the battery door off was frustrating.  Unlike Apple TV, if you want Netflix, you need to download the app from Amazon.  Size of the menu font a bit small, hard to see if your TV is far away or you have a small TV. Otherwise, much cheaper than Apple TV and works quite well.  Needed if you have plans on using the Amazon Prime movies.", "verified": true, "helpfulness": "0/0", "author": "Voltaire"}, {"rating": 5.0, "review": "Fibbage from Jack Box Games is worth buying this entire thing.", "verified": true, "helpfulness": "0/0", "author": "Tommy Wheeler"}, {"rating": 4.0, "review": "It was easy to install and works like a charm!", "verified": true, "helpfulness": "0/0", "author": "Heather Molandes"}]