[{"rating": 5.0, "review": "really nice addition, now to dump the pay tv movie channels", "verified": true, "helpfulness": "0/0", "author": "J D"}, {"rating": 5.0, "review": "Works great easy setup", "verified": true, "helpfulness": "0/0", "author": "Paul W. Kase"}, {"rating": 5.0, "review": "Totally exceeded my expectations. Super responsive, not what I expected from a stick streamer. I would recommended to anyone and for $39, you can't go wrong.", "verified": true, "helpfulness": "0/1", "author": "Geovanni Mendez"}, {"rating": 5.0, "review": "WOW - sold my ROKU's! this thing is fast and easy - highly recommend. I cannot believe the speed difference. I use Netflix and Prime and this stick is much faster than another type of box I used. Don't think twice, if you use netflix or prime get this! LOVE IT!", "verified": true, "helpfulness": "0/1", "author": "hacker007 \"hacker007\""}, {"rating": 2.0, "review": "I am still holding out hope that software will be improved. As of last night when we installed the stick, we also dealt with the usb power problem, our chromecast was able to work using the usb port on the tv so we had to reconfigure plugs because it kept crashing due to not enough power I would assume. We then tried to watch a show on hulu and it constantly paused, we kept watching that episode on the fire stick but ultimately decided to switch to the roku to watch our next show.  This morning I tried to put on a show for the kids off of the watch list and when I hit play the screen goes black, like it is trying to load but cannot or something.Once all of the bugs get worked out the fire stick will be replacing the roku on our main tv, and we will also keep the chromecast for the cast a tab feature because as far as I can tell the fire stick does not have that. We really like the interface, just hope that the productivity improves!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Would be better if some of the apps worked with Time Warner Cable.", "verified": true, "helpfulness": "0/0", "author": "Jim Zelenko"}, {"rating": 5.0, "review": "I have a Fire TV and now I have 3 Fire TV sticks. The Sticks work great and I am adding one to every TV in the house. I even have one on order to go into my computer bag for when I travel. The only thing missing is the voice search and you can get that by buying the remote with that built in or using your smartphone as a remote.", "verified": true, "helpfulness": "0/0", "author": "mchipguru"}, {"rating": 5.0, "review": "Works really good! Tou can move it from tv to tv, just overall great product!!", "verified": true, "helpfulness": "0/1", "author": "vane"}, {"rating": 5.0, "review": "Awesome device, only thing missing is vudu for movies but seems to have every other streaming service I use.", "verified": true, "helpfulness": "0/1", "author": "Victor R. Noceda \"applegeek\""}, {"rating": 4.0, "review": "Very easy to install and setup.  Great picture and sound.  Prime Video and Prime Music are great. You need to have Prime to make full use of this, but it you just have Netflix and/or Hulu it’s still great. Just a few more apps until 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Loren B"}]