[{"rating": 5.0, "review": "Works great and you can take it anywhere!", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 3.0, "review": "First off, purchasing the Fire Stick was a no-brainer for me.  Have been a Prime member for years...and have purchased the Firephone, the Echo, and the HDX 8.9. In spite of already having a smart tv, I purchased the fire stick for several reasons; first and foremost was ease of navigation, and it accomplishes that flawlessly.But a big reason for purchasing this was to Miracast from my HDX and Fire phone easily. That is where my disappointment lies. For those that aren't familiar with Miracast, in my case, it is mirroring whatever is on the screen of your tablet or phone onto your tv screen. A great feature if you want to watch the news, or anything on the web, on a big screen.  Thinking all of my products were Amazon, connectivity shouldn't be an issue...and in the beginning it wasn't. Worked beautifully. But, after automatic updates, it rarely works now. Same issue, whether from my Firephone or HDX, they connect and state the mirroring will start soon, but it never does. After reading many blogs and forums, I'm obviously not the only one having issues with this.In summary, if you're purchasing the Fire Stick for navigating the Prime content, photos, etc., it can't be beat....works great. If you want or need the Miracast ability, you might want to look at other options.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "There is so much you can do with this. While we use this mostly for the streaming we have also found a few games that the entire family enjoys. I also like the freedom of being able to unplug it and take it with you.", "verified": true, "helpfulness": "0/0", "author": "Theresa Aguiar"}, {"rating": 5.0, "review": "I bought this and signed up for sling.  I was paying 150 bucks a month for DirecTV, paying for so many channels that I didnt even watch.  The better your internet connection, the better the streaming is.  This is a great product and I am saving so much money.  I will buy one for each TV so I dont have to keep moving it from TV to TV.", "verified": true, "helpfulness": "0/0", "author": "Sriracha Sue"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Vicky J Swanson"}, {"rating": 5.0, "review": "It's  a great product.  Watched  a movie from my fire tablet straight  to the t.v. no problem.", "verified": true, "helpfulness": "0/0", "author": "Jacgueline Myers"}, {"rating": 5.0, "review": "Much better than roku steaming stick", "verified": true, "helpfulness": "0/0", "author": "rana naquin"}, {"rating": 5.0, "review": "I love it. Its everything I hoped it would be", "verified": true, "helpfulness": "0/0", "author": "Rhonda Landis"}, {"rating": 5.0, "review": "This is a great investment for the money and very easy to install.  With the app that can be downloaded to your smartphone, it makes the experience even better.  Not sure yet, but it might replace the costly cable in the near future.  It will surely replace the cable box I pay extra for each month.  So many apps on the Fire Stick you will be overwhelmed at the choices. I can't speak for the other products on the market, but this one is a winner.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 3.0, "review": "I like the format. easy to use.", "verified": true, "helpfulness": "0/0", "author": "Daryl"}]