[{"rating": 5.0, "review": "I really like this device! My kids love the game feature... I'm not positive how the coins work yet but I can see us using that as some kind of good behavior incentive. It took a while for the remote app to work but it's pretty cool once we got it to connect. I love that the Netflix app on my phone recognizes it and let's me fling show up to the tv.  I had to order it through bestbuy since it's back ordered on amazon. But I'm excited to get the game controllers for it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It fell short of my expectations. I use a Roku 1 at the moment because it allows me to have Acorn TV. None of my smart TV's have that app and neither does this stick. Another problem is that unlike my roku box I can't stream seamlessly from the stick from my mobile phone wifi hotspot. It buffers constantly. My Roku box doesn't have a problem with the WIFI from my cell phone and I can stream video for hours without interruption. I will keep the sticks I purchased but only because I received them at a really low price and I can give them to people who don't know what Acorn TV is....or care.", "verified": true, "helpfulness": "0/0", "author": "A. Saul"}, {"rating": 2.0, "review": "As a DirecTV customer this product is of little value other than providing access to AmazonPrime and Netflix which most competing devices have as well, but the Apps that require a provider (ShowtimeAnytime, Disney) don't include DirectTV.  Until this changes I will stick with Roku devices.", "verified": true, "helpfulness": "0/0", "author": "J. Daniels"}, {"rating": 5.0, "review": "I'm a ROKU user for years now and just brought the new Fire TV Stick for an introductory price.  It is great as I am also an Amazon Prime member.  Everything I need to readily available on the Fire Stick.  It offers most apps that ROKU has except for music apps which I love.  The Fire Stick only has a few radio stations available compared to ROKU.  Other than that it is inexpensive and wonderful to use.", "verified": true, "helpfulness": "0/0", "author": "Leslie Light"}, {"rating": 5.0, "review": "I have a full Fire TV box for my main tv.  The Fire Stick works just as effectively as the box, on my second tv.", "verified": true, "helpfulness": "0/0", "author": "insolent cur"}, {"rating": 3.0, "review": "Quite a lot of rebuffering which does not occur on my DVDS NEFLEX APP.", "verified": true, "helpfulness": "0/0", "author": "Joseph Jewell"}, {"rating": 5.0, "review": "The Fire TV Stick is great. I love that it is hidden behind the TV and the remove has no problems.  The phone app and its voice searching works just as well as the remote for the Fire Tv.  Although not recommened, I am power from a USB port on the Tv.  The boot time of the FIre Tv is fairly quick and its ready to go within 10 seconds of the TV being usable.  That small delay is well worth the reduced cables and potential power savings.", "verified": true, "helpfulness": "0/0", "author": "Bob E."}, {"rating": 5.0, "review": "We have used this for about a week now. The apps we have tested it with are Netflix, Amazon VOD, Youtube and Twitch. It comes nicely packaged with everything you need to set it up. Note you will need an outlet handy as it must be plugged into an outlet for a power source. I did not measure the provided AC cord exactly but it is around 6-8 feet. It barely made the AC outlet as I have the TV mounted on a wall. Once plugged in and the TV is set to the correct hdmi port, set up was a breeze. It somehow knew I ordered it as it came up with my Amazon account. Keep this in mind if you send one as a gift. Mind you, I did not note this was a gift so it may behave differently if you order as a gift. I found it easily detected my 2.4  (5/5 bars)and 5 (3/5 bars) ghz wireless N networks. The signal strength shown is better than the Samsung Bluray player in the same location. Since there was 3 bars for 5 ghz, I used that to see how well it would work. Next it will install updates which took a pretty long time. I did not time it but I would estimate it was around 10 minutes. Much longer than I expected. It will reboot and then bring you to a tutorial screen. I could not find a way to skip this so you must sit through it. You are now ready to use it. I selected Netflix for the first try as this is what the family uses the most. Installed the app in a very short time. Login is the same as any other Netflix interface I have used. App worked wonderfully! Then tried Amazon VOD, Youtube and Twitch which were excellent. The main reason I got this was to use for streaming via wireless. My router is on the main floor opposite side of the house. This is located in a bedroom on the second floor. Distance is about 40-50 feet. I did not really expect 5 ghz N to work well but it has so far. Now the Samsung Bluray is for playing movies. The router is an Asus RT-N56U for those that are interested. A very good router that has served me well for years. And, my wife really likes the remote and how the Fire TV Stick works.", "verified": true, "helpfulness": "0/0", "author": "Poocher"}, {"rating": 2.0, "review": "Out of the box, it took 2+ hours to set up because it detected an update... it tried to update and failed 8 times.. contacted tech support.  After nearly an hour with tech support, the download actually worked.  Once it was upgraded, the device seems to work ok.  The lower score is because the initial experience was really really poor.  You don't expect to take an item out of the box and take so much time to get it to work.  By example, the Roku only took about 2 minutes before I could do something with it on the same TV.Side note: Because it took so long to download the update, and the screen doesn't change during download, there was a burn in problem with the text on the screen.  You probably will want to chose a different input with video or something playing that doesn't burn the screen if your TV could be burned in (like plazma tvs).", "verified": true, "helpfulness": "0/0", "author": "Vince Rohr"}, {"rating": 4.0, "review": "I'm very pleased with the Fire Stick. Easy set up and now I'm able to stream Amazon Prime videos, YouTube, Pandora, and even Vimeo. So much simpler and higher quality then streaming through my laptop. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}]