[{"rating": 5.0, "review": "Absolutely love this thing. Easy to use, Great picture.", "verified": true, "helpfulness": "0/0", "author": "jnomad68 \"phoneman\""}, {"rating": 5.0, "review": "Works as well as the fire tv", "verified": true, "helpfulness": "0/0", "author": "Victor S."}, {"rating": 5.0, "review": "Great product if you have prime, also the option of having all photos taken on the mobile phone shown on the big screen automagically is very convenient. Voice search via mobile app is very nice feature, although the android app needs refinement.", "verified": true, "helpfulness": "0/0", "author": "Vlad Kofman \"vladix\""}, {"rating": 5.0, "review": "The most cost-effective, easy to use device to add WiFi to a HDTV.  I have 3 Blue-ray with Wi Fi and a Google Chrome to add WiFi to my TVs.  The Fire TV Stick is by far the fastest response and easiest to use.  The Google Chrome is totally unsatisfactory compared to the Fire TV Stick.  I will be buying several more for my own applications and as gifts for friends.", "verified": true, "helpfulness": "0/0", "author": "CMB"}, {"rating": 5.0, "review": "Love having access to all of the movies, shows, etc.  Still trying to learn how to use everything it offers, but overall very happy!", "verified": true, "helpfulness": "0/0", "author": "Mom in CT"}, {"rating": 5.0, "review": "It exceeded our expectations. We are able to operate it without a manual or difficulty. The reception on our basement TV is perfect now!", "verified": true, "helpfulness": "0/0", "author": "Sneekypete \"Pete\""}, {"rating": 1.0, "review": "EXTREMELY DISAPPOINTED IN THIS!!!  DO NOT BUY THIS PRODUCT IF YOU DO NOT PAY FOR CABLE OR PAY A TV SUBSCRIPTION.  Despite nothing being stated about \"What You Need\" and Technical information, many of the apps that are advertised cannot be used with a cable subscription.  We purchased this item because we do not have cable.  Nothing in the requirements stated that cable was required.  In the 14 long pages of information here, only a single sentence is mentioned, under \"What's On Fire Stick\".I understand Amazon Prime membership being needed to use this product.  I understand Netflix subscription being needed.  If a cable subscription is needed to access apps that are advertised as available on this product, IT SHOULD BE STATED AS A TECHNICAL REQUIREMENT.", "verified": true, "helpfulness": "1/5", "author": "Angela Windsor \"Angela Lee Windsor\""}, {"rating": 5.0, "review": "Very easy to install.  Works seamlessly.  We love it!", "verified": true, "helpfulness": "0/1", "author": "Waterboy/Panama"}, {"rating": 5.0, "review": "Easy to set up; easy to use. So nice to be able to watch some shows when I want, and without commercials. And I can take a break (for a beer, a pit stop, a phone call, whatever) whenever I want.  [I ordinarily don't watch TV.}", "verified": true, "helpfulness": "0/1", "author": "Lawrence Bruckner"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/1", "author": "WHH"}]