[{"rating": 3.0, "review": "Pretty good once u download the good apps. Even better if u get it preloaded. All the movies from way back to the latest on DVD even some movies that are still in theaters. Also the latest poverty are usually available all for free. Only problem is sometimes it cuts off mid movie & starts all over. I wouldn't ditch cable for it because you're relying on streaming video, but I would downgrade to a basic package & watch the other TV shows & movies on here...", "verified": true, "helpfulness": "0/0", "author": "Raymond Honor"}, {"rating": 5.0, "review": "This, by far is a great investment. I no longer have to get locked into a contract for cable that costs more money and nearly not the selection!! Only negative is a lot of shows require u to purchase the episode or to just watch it.", "verified": true, "helpfulness": "0/0", "author": "holly"}, {"rating": 5.0, "review": "Love it turned old tv into a great smart tv", "verified": true, "helpfulness": "0/0", "author": "JeneralJoe"}, {"rating": 5.0, "review": "What can I say? I love it. We have Playstations but the new ones have no software for music except the option to use Spotify which I don't want. I want to access my Amazon music library, and this does the trick. It also is great for traveling so I love it.", "verified": true, "helpfulness": "0/0", "author": "HeatherL"}, {"rating": 5.0, "review": "Very nice product. Good video quality. Easy setup", "verified": true, "helpfulness": "0/0", "author": "Sandeep Meesarapu"}, {"rating": 5.0, "review": "I know it would counterproductive for amazon, but it would be sweet if it had support for Google play movies so I can watch previously bought movies on my FS.", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 5.0, "review": "Absolutely love my new Kindle Fire Stick. It is so simple to set up and works beautifully.", "verified": true, "helpfulness": "0/0", "author": "Monika Piper"}, {"rating": 5.0, "review": "Worked excellent out of the box.", "verified": true, "helpfulness": "0/0", "author": "MPete428"}, {"rating": 5.0, "review": "Birthday gift for my daughter. She was thrilled! Great transaction.", "verified": true, "helpfulness": "0/0", "author": "Tito"}, {"rating": 5.0, "review": "A great product for the price. The netflix app is flawless.", "verified": true, "helpfulness": "0/0", "author": "cliff mixon"}]