[{"rating": 2.0, "review": "Capabilites of product are good. But to fully utilize product you need a amazon prime account. If I had to buy it again, I wouldn't.", "verified": true, "helpfulness": "0/1", "author": "Ramon"}, {"rating": 5.0, "review": "So far, so good!", "verified": true, "helpfulness": "0/0", "author": "Thomas H. Weiss"}, {"rating": 4.0, "review": "Great purchase", "verified": true, "helpfulness": "0/0", "author": "vishand"}, {"rating": 4.0, "review": "Very easy and quick to set up.  I am still getting familiar with it, but definitely worth it, lots of free shows, games etc too.", "verified": true, "helpfulness": "0/0", "author": "B"}, {"rating": 5.0, "review": "Lightning fast.  The interface is intuitive, and I LOVE that I don't have a box at which I must look!  It gives a nice and clean appearance.  It has lots of viewing options also. this is a win for us.  We like it more that our apple tv.", "verified": true, "helpfulness": "0/0", "author": "S. Baker"}, {"rating": 5.0, "review": "Works amazingly well.  When you first plug it in, it took about 2 hours to finally be able to gain access to Netflix.  I use the power adapter that comes with it.  Apparently that makes it more reliable, but I haven't had any issues.  Everything streams very quickly and in HD quality.  Access to Netflix, Amazon, games, apps and PandoraThe only thing I wish it had was a lanyard and maybe a colorful button or at least the Amazon logo written on it because the remote is very small and lightweight and it's black.  So I've lost it multiple times from the kids misplacing it or slipping between the couch cushions.I don't typically take time to put in reviews, but I've been raving about this to all the people I work with and my friends.  For $40, it's definitely worth it!", "verified": true, "helpfulness": "0/0", "author": "B. Jones"}, {"rating": 5.0, "review": "Works great; easy to set  up and keeps Granddaughter happy!!!!", "verified": true, "helpfulness": "0/0", "author": "Wiltz Cutrer"}, {"rating": 1.0, "review": "Would be better if you could cast", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jerry Short"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "maria"}]