[{"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "J Hines"}, {"rating": 1.0, "review": "My have the regular Amazon TV and it works perfectThis stick kept disconnecting and it was in the room with my wifi network", "verified": true, "helpfulness": "0/0", "author": "Craig"}, {"rating": 5.0, "review": "Really enjoying the fire stick lots of great mobies and shows to choose from its awesome", "verified": true, "helpfulness": "0/0", "author": "patricia gonzalez"}, {"rating": 3.0, "review": "Thought there would be more free programming available. There are too many wasted titles available.", "verified": true, "helpfulness": "0/0", "author": "John J. Johnson"}, {"rating": 5.0, "review": "Nice alternative to have when you want to ditch cable! Easy to install!", "verified": true, "helpfulness": "0/0", "author": "David R. Ibanez"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Kateidra FIsher"}, {"rating": 4.0, "review": "I am not young any more but getting it hooked up was EASY even for me. I love the programming.  The only reason I give it 4 stars instead of 5 is because of the great trouble I had getting the back off to put the batteries in.  It is supposed to slide off but has to be pried open and I had to call for help so I didn't break it.  Otherwise it works great.", "verified": true, "helpfulness": "0/1", "author": "B. Gallion"}, {"rating": 4.0, "review": "Would be nice to plug head phones in to the remote", "verified": true, "helpfulness": "0/0", "author": "Tony Regennitter"}, {"rating": 5.0, "review": "Best thing since sex.", "verified": true, "helpfulness": "0/0", "author": "Glenn Harvey"}, {"rating": 2.0, "review": "I would have rated this 5 stars if I was able to watch HBO, Showtime, and Starz.  Since Xfinity is not listed as a TV subscriber on the fire stick, I am unable to.  This is something that needs to be fixed ASAP.  I would have not purchased it if I would have known that.", "verified": true, "helpfulness": "0/0", "author": "Cutsie"}]