[{"rating": 5.0, "review": "Easy to set up and even easier to use.  Navigating from home screen to various options was also simple and intuitive.  We have a standard DSL and have not experienced any problem in streaming to our TV.  The fire stick has met all of our expectations and the price was right.", "verified": true, "helpfulness": "0/0", "author": "Roy Thomas"}, {"rating": 1.0, "review": "Please read before you purchase this item.  I have now owned this for 6 months and honestly have given up with it.  My wireless connection reads VERY GOOD..  no issues with any other devices in my house.  My wireless router is exactly 12 feet away.  Every time I attempt to use I get a connection error.  If it does work is very briefly before it timeouts.  This is NOT worth the price.  I would recommend other options, Cromecast or Apple TV.  Don't waste your money,", "verified": true, "helpfulness": "1/1", "author": "Jeffrey G."}, {"rating": 5.0, "review": "Awesome product! When you select one of your songs on amazon music it shows the words on the tv like karaoke and  can play your music while browsing  or playing video games. My children love it. I plan to order one for every room in the house.", "verified": true, "helpfulness": "0/0", "author": "Leslie N Horan"}, {"rating": 4.0, "review": "Perfect fit for people who have limited tv channels.", "verified": true, "helpfulness": "0/0", "author": "Craig T Ryerse"}, {"rating": 4.0, "review": "I like it accept my WiFi clicks in and out. Also", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Chromecast is no where comparable to.fire stick. Excellent product from amazon.", "verified": true, "helpfulness": "0/0", "author": "VM"}, {"rating": 4.0, "review": "Overall its a good product. I would say that there have been a few buggy problems I have noticed. Sometimes the sound will stop playing and you have to reset the device for it to work properly again. It will also freeze from time to time. It is a step up from the wii that I was using for netflix! I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Lindsey Currin"}, {"rating": 5.0, "review": "Waited about a month because it was on back order, but worth the wait. So easy to install and set up. I used the adapter to make it slightly longer, I don't think I really needed to but because my TV is wall mounted I figured it would be easier. I just needed a streaming device for my bedroom and didnt want to add another unsightly box so this was perfect.Also picture quality is awesome, super easy to navigate and a great price!", "verified": true, "helpfulness": "2/2", "author": "VanessaMW"}, {"rating": 5.0, "review": "I love it so much my family thinks I need an intervention!!!!", "verified": true, "helpfulness": "0/0", "author": "Kathy Shaver"}, {"rating": 5.0, "review": "Allows me to expand my television viewing exponentially.", "verified": true, "helpfulness": "0/0", "author": "SAUL NATHAN"}]