[{"rating": 5.0, "review": "This is a swell product. Plus, it is a no brainer to hook up. I'm a 69 year old woman who isn't electronically savvy. Just find the HDMI port on your tv and plug it in. Follow the simple directions on the screen and you're all set. For a measly 39 bucks, you get huge value for that amount. Don't hesitate to get it. If you have Amazon Prime, this is a MUST BUY. It really is worth the money any way you look at it. Don't have Amazon Prime? At 99 dollars a year, it is a steal if you can't get out to shop any more regardless of reason. The two day shipping is an awesome feature and has 'saved' our necks more than once because of needing a gift for a forgotten occasion.", "verified": true, "helpfulness": "0/0", "author": "fanfic  nutcase \"xenite\""}, {"rating": 5.0, "review": "It is amazing, I love it. I love being able to watch previous seasons of my favorite tv shows that I had purchased from Amazon on my TV and be able to relax and not have to sit at my computer or use my ipad. I am a 62 year old woman with not much technical experience and I was able to hookup everything up in about 5 minutes. The hardest part was figuring out what my password was for WIFI. I also purchased the FIRE TV with voice recognition, which a previous reviewer suggested that you have both the FIRE STICK and the FIRE TV, but I have not tried the FIRE TV as of yet, since I like the FIRE STICK so well. It takes a little practice navigating the remote, but it's worth the practice. Buy it you won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Pat O."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tonya Johnson"}, {"rating": 2.0, "review": "Wouldn't really recommend it. Everything takes forever to load...it takes an hour to watch a 30 min show on Netflix 😑. Going back to my Apple TV, never had an issue with it...only the long wires.", "verified": false, "helpfulness": "0/0", "author": "Rocky"}, {"rating": 2.0, "review": "I have mixed feelings.When it works, it works very well. But there are many times it freezes and apps don't stay open. Often, I can be struggling to watch a video on the firestick and then tun it on and watch it on my laptop through the same service and have a better playback experience. The firestick is even right next to the router.I wouldn't recommend this and plan to try another brand.", "verified": true, "helpfulness": "0/0", "author": "Rachel Nye"}, {"rating": 1.0, "review": "Where do I start? Plugged into TV. Setup went fairly quick.Tried to watch a couple of movies. Got the dreaded running circle in the center - Buffering. OK, show started. Here comes the circle again. Says no internet connection. Check internet and it says (Very Good). Went back to movie and it started up and then got the circle again. Well after about 20 something times. Reset router. Changed connection on TV. Removed the adapter. All with the same results.Then tried to search for my TV shows. They have them, but you have to PAY per episode. $1.99 to $2.99 each. Almost everything you want to watch is PAY PER VIEW!This does get Really HOT.As the circle turns and turns and TURNS...", "verified": true, "helpfulness": "0/0", "author": "toobad \"toobad\""}, {"rating": 5.0, "review": "Bought it for my husband who is disabled...and he loves it. Watches the older shows to the newest releases.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Burchfiel"}, {"rating": 5.0, "review": "I was hesitant in purchasing the fire stick.  I finally bought it and wow!  No buffering,  and it's lightening fast.  I would give it 10 stars if I could", "verified": true, "helpfulness": "0/0", "author": "Ashley  Klingel"}, {"rating": 5.0, "review": "Love it! My television is not a \"smart\" TV.  Fire stick has given us freedom from our small tablets or phone.  My grandson love he can watch Minecraft videos on you tube.  Great product!", "verified": true, "helpfulness": "0/0", "author": "hugci"}, {"rating": 5.0, "review": "Not enough stars to rate accurately.I plugged this into my TV, changed the signal source, followed the easy steps and ta-da it worked.Great picture quality and amazing supply of TV and movies.  With this, I don't need cable.  I pay for Hulu and Netflix and plan to add HBO as soon as it is available to purchase in a stream only format.Will never go back to cable.....ever", "verified": true, "helpfulness": "0/0", "author": "uncommon_boston"}]