[{"rating": 5.0, "review": "Seriously cool", "verified": true, "helpfulness": "0/0", "author": "Lowell Youngblood \"Chingadero\""}, {"rating": 5.0, "review": "Work great!", "verified": true, "helpfulness": "0/0", "author": "Mike Matick"}, {"rating": 1.0, "review": "Connectivity issues regardless of distance from wireless router or router.  Consistent pauses in streaming video.  User interfaceLocks up consistently. -  we've basically stopped using it and gone back to the roku box and apple tv", "verified": true, "helpfulness": "0/0", "author": "Andrew Coppolino"}, {"rating": 5.0, "review": "Excellent! Love it!", "verified": true, "helpfulness": "0/0", "author": "Sandra Greenberg"}, {"rating": 5.0, "review": "This is a great product for those of us who don't own one of the few smart TV's that has Amazon preprogramed. I strongly recommend using your iPhone or iPad with the Fire TV Stick so you can use voice to find movies instead of scrolling through them all.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "LOVE IT,WORKS AS WELL AS MY FIRE TV BOX.USE IT ON MY LIVINGROOM TV.SIMPLE TO USE.", "verified": true, "helpfulness": "0/0", "author": "michael armstrong"}, {"rating": 5.0, "review": "Since I already have and Apple TV, I wasn't really in the market to buy another digital streaming device. But when I heard about the Sling TV deal that let you get one of these Fire TV Sticks free with a 3 month Sling subscription, and because I wanted to try out Sling anyway, I thought, \"Why not?\"I have to say that I'm more impressed than I expected to be with the Fire TV Stick. The user interface is, in my opinion, much better than the Apple TV's. Also, I like the flexibility of being able to install apps to customize what the Fire TV Stick can offer.It is, of course, very geared toward pushing Amazon digital content, but that's okay since we do watch some Prime Videos and because I have a lot of my music available through Amazon Music since much of it was purchased through Amazon. The ability to play these through the TV without using AirPlay is nice. Playback of both video and audio has been very good for me. I'm looking forward to the update that's been announced that will allow more options with Amazon Music.I haven't done anything with games on the Fire TV Stick. It seems like with gaming consoles, computers, and portable devices, we have more than enough gaming options in our house, so we haven't used the Fire TV Stick that way yet.There are some rumors about forthcoming improvements in the Apple TV (including apps and streaming TV services) that may cause me to switch back to Apple TV, but for now, the Fire TV Stick is getting some good use.", "verified": true, "helpfulness": "0/0", "author": "D. Dale"}, {"rating": 5.0, "review": "I absolutely love this.  I was skeptical at first, but it exceeded my expectations.  I think we are going to get another one.  It is as good no better than the ROKU we have.  Amazon hit the target on this little guy with big performance.  Thank you, thank you, thank you.  Take a bow Amazon you deserve it.", "verified": true, "helpfulness": "0/0", "author": "Flying Lady 76 \"N2theBlue\""}, {"rating": 5.0, "review": "Better than chrome cast", "verified": true, "helpfulness": "0/0", "author": "michael grube"}, {"rating": 5.0, "review": "I am so in love with my new Fire Stick!!!! It is beyond easy to set up and use.  Having Amazon Prime Membership gives great benefits.  So many cool apps and features!", "verified": true, "helpfulness": "0/0", "author": "KGordon"}]