[{"rating": 4.0, "review": "Works very well.", "verified": true, "helpfulness": "0/1", "author": "Betty Weber"}, {"rating": 1.0, "review": "Chromecast connect to my network. Roku connects to my network, Fire Stick WILL NOT  connect to my network. Worthless.", "verified": true, "helpfulness": "0/3", "author": "BruceT"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Jessica"}, {"rating": 5.0, "review": "Really is great for any TV that does not have smart features.  Netflix and Amazon are easy to access.  Was a breeze to set up.You do have to plug it in to a power source either to electric or USB if you have one on the television.  I should have bought more when theywere only 19 dollars", "verified": true, "helpfulness": "1/2", "author": "marian kellerman"}, {"rating": 2.0, "review": "The fire stick works well and was easy to set up but you are very limited as far as what you can access and few apps are available.  In my opinion if you aren't a huge fan of Amazon Prime the fire stick isn't for you", "verified": true, "helpfulness": "1/3", "author": "Michelle Parry"}, {"rating": 5.0, "review": "Great value and easy setup.  Amazon has a winner here!", "verified": true, "helpfulness": "1/2", "author": "RNO"}, {"rating": 5.0, "review": "After having used the Amazon Fire TV Stick for several months now, I can tell you it is one of the easiest and best ways to watch all of your favorite shows any time and almost anywhere! We have cut back on our cable channels (and bill) because there is so much available when you have a Fire stick. We watch Netflix a lot, as well as streaming Amazon videos, music, TV - just about anything you want to see is out there. We LOVE this little device and highly recommend it if you like EASY to use and lots of choices.", "verified": true, "helpfulness": "1/2", "author": "EJB \"Emily\""}, {"rating": 3.0, "review": "This TV stick is ok but it run a little slow and is not good if you have small kids because they can order movies and games without you knowing. It don't have a lock or code you can place on it to prevent this from happen.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up and use", "verified": true, "helpfulness": "0/1", "author": "Brandy Lee McNamee"}, {"rating": 1.0, "review": "In general it works well for the purpose.  However, there are two things worth considering before you buy it:1. and the more serious one: The wifi connection is buggy.  I have use it just a week, and I have met a couple of wifi connection problems.  The thing is after wake up the fire stick saw my wireless router, and connected to it but complaining connection problem, while all my other devices worked well with the same router.  The only solution is to unplug the power of the stick and plugin again, because there is no reboot setting for the stick, this can be quite inconvenient sometimes.2. The power adapter for the stick is unusually big and take up the space for two outlets.Un the upside, it is fast and the remote is quite handy.  With the purchase of Plex app, it works nicely for me.", "verified": true, "helpfulness": "1/1", "author": "penpal"}]