[{"rating": 5.0, "review": "This little stick works like a charm.  Easy to setup and use.  I can stream ESPN SportsCenter while I workout without having to pay for an additional cable box in my workout room.", "verified": true, "helpfulness": "1/1", "author": "R. Harris"}, {"rating": 1.0, "review": "Would not connect to wifi.  Airport Extreme AP with a Chromecast and Laptop connected to same Wifi, same TV, same distance from access point.  Tried all the tricks in the \"Can't connect to Wifi\"  troubleshooting doc, including resetting it, nothing worked.  Enter the Wifi password, it sits for about 15 sec, then bounces back to the password screen.  Seems to be a pretty common problem, with no real solution, so had to return it.", "verified": true, "helpfulness": "2/3", "author": "Joseph Boren"}, {"rating": 1.0, "review": "Just received the Fire TV Stick in the mail.  Immediately installed and set up.  Experiencing two troubling issues:1) Screen flickers every ten or fifteen seconds.  There is an audible click sound and a thin green line horizontally across the screen.  Then video returns to normal/expected play for ten to fifteen seconds, then flicker again. Repeat, over and over again.2) TV seems to not realize it is receiving input and goes to sleep.  Reselect HDMI input and works again, until next sleep cycle.", "verified": true, "helpfulness": "2/3", "author": "Leo5280"}, {"rating": 5.0, "review": "My son loves this! Turned his non-smart tv into a very smart tv! Lots of movies, games and apps to chose from. Excellent purchase!", "verified": true, "helpfulness": "0/1", "author": "Upstate NYer"}, {"rating": 5.0, "review": "I like this product very much. Have never owned any other streaming device, but this works as advertised. Love the simplicty of the remote, easy to navigate in the dark.", "verified": true, "helpfulness": "1/2", "author": "Tim Kish"}, {"rating": 3.0, "review": "I'd give it a higher rating IF it had YouTube.  But it works as advertised and is a sweet little package.", "verified": true, "helpfulness": "0/2", "author": "Robert F. Schoenert"}, {"rating": 5.0, "review": "Easy to set-up and works great.", "verified": true, "helpfulness": "0/1", "author": "SAH \"SAH\""}, {"rating": 5.0, "review": "Purchase of the year, I sign up for prime, Netflix and hulu plus and get rid of cable, over 200 savings a month. Best acquisition of the year.", "verified": true, "helpfulness": "0/1", "author": "viniciuslopes"}, {"rating": 5.0, "review": "Bought this for my son.  I purchased the previous version for myself so when I saw this I thought he would like it. He loves it! it works great.", "verified": true, "helpfulness": "0/0", "author": "Judy E. \"Ms Book Worm\""}, {"rating": 4.0, "review": "Was easy to setup and came already paired to my Prime account.  The reason it gets 4 stars and not 5 is that when I attached it to my TV and 100 Watt per channel receiver, I didn't know that a demo would start playing and that there is no volume control.  The movie scared my wife and 17 month old son.It is my only device attached to the TV that doesn't have its own volume control so when I switch back and forth, I will need to change the volume on the receiver.", "verified": true, "helpfulness": "1/2", "author": "Robert E."}]