[{"rating": 5.0, "review": "I have been using this for a few months and am very happy with it. In fact, I plan on purchasing a second for another television in another room. It has turned my television into a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Sammy David Hicks"}, {"rating": 3.0, "review": "I like it but it continually is buffering looking for the signal.. it claims my signal is not good --this is while I have my I pad or laptop in my hand, apparently working just fine.  I have even turned off all computers etc and it makes no difference.  If this doesn;t improve i will probably send it back.  how long can i keep it before I send it back?  Suggestions on making it work better.  My system is wireless and I have a fairly new TV bought this past Christmas.  I have been trying to watch Downton Abby.  (and it's good)  I love that it was so easy to install (I did it myself!)", "verified": true, "helpfulness": "0/0", "author": "Peggy Mead"}, {"rating": 1.0, "review": "I ordered a new firestick, and when I plugged it into my tv, it came up registered to someone else. Clearly this was not a new product, but a refurbished one, being sold to me as new. I tried it anyway, and after less than 2 weeks it randomly stopped working. I went to amazon to order a replacement, but they said they could not help me with that and I would have to contact the fire TV support team. They gave me a link to a Q&A; page for firestick, with no way to contact the merchant for help. I am returning this product now and will not be ordering another one!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "MS"}, {"rating": 1.0, "review": "Remote control is out of order.", "verified": true, "helpfulness": "0/1", "author": "Jung, Yong Joon"}, {"rating": 4.0, "review": "Nice product, but the parental controls are an annoying joke. All the cool, hard to do features are wonderful... But you can't set a rating limit... Come on amazon, pick another feature to make me want your higher priced unit.", "verified": true, "helpfulness": "0/0", "author": "Mike & Ellen"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great interface, tons of apps, ideal for cord-cutters. With the Fire TV Stick, you really don't need cable anymore. And I'd highly recommend adding Sling TV to compliment your Fire TV Stick experience since you can add premium live streaming packages for a very reasonable rate. Only problems I'm experiencing with this product are the Amazon Fire TV app which just needs minor tweaking with the search functionality and frequent disconnections from the network which may stem from problems with my ISP. Also not sure how to stream content from Amazon Prime Music from my Android device through the TV. Could be just user error, but not very intuitive. But all-in-all, this a very solid product and a great value. I have already recommended this product to friends and family.", "verified": true, "helpfulness": "0/0", "author": "e3charles"}, {"rating": 4.0, "review": "This is very cool! Had a few issues but turned out to be crummy WiFi.", "verified": true, "helpfulness": "0/0", "author": "Alan Gefvert"}, {"rating": 5.0, "review": "Best thing I ever bought!", "verified": true, "helpfulness": "0/0", "author": "Vyoncia"}]