[{"rating": 5.0, "review": "This is perhaps the best streaming device on the market at the moment. Netflix, Huku, Amazon Instant Video (which incidentally needs a one word name btw) all work flawlessly.As it runs android it means you can change the dns settings which will be a plus for users outside the United States that want to use their own Dns servers.I highly recommend this product. 5/5.", "verified": true, "helpfulness": "0/0", "author": "John K"}, {"rating": 5.0, "review": "This is one of my favorite purchases. We use it several times a week to watch favorite shows when we want to. I was surprised by the number of movies and shows available.", "verified": true, "helpfulness": "0/0", "author": "Shane Bowlin"}, {"rating": 2.0, "review": "I bought it and told a friend about it.  He told me that if I spent more than $20.00 on it, to return it.  He compared the Fire stick to the difference between beta and VHS tapes.  He said the fire stick is the beta tape.  I returned it the next day and ended up buying Apple TV.", "verified": true, "helpfulness": "1/7", "author": "Cinamon Colley"}, {"rating": 5.0, "review": "Extremely satisfied with this product.  Very easy set up and good instructions.", "verified": true, "helpfulness": "0/1", "author": "Milton D Aleshire"}, {"rating": 5.0, "review": "OMG I love this! I can stream so much, and $100 a year is so worth it to stream so many tv shows and movies. Amazon rocks!", "verified": true, "helpfulness": "1/2", "author": "Jackie Scott"}, {"rating": 5.0, "review": "Cut thew cable, this save money.", "verified": true, "helpfulness": "0/1", "author": "Scott Wyskiel"}, {"rating": 5.0, "review": "The Fire Stick is on a tv in a guest bedroom that does not have a cable box. It works very well and I am pleased to have it.", "verified": true, "helpfulness": "0/1", "author": "singnote"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "Michelle S."}, {"rating": 5.0, "review": "Great investment!! I have no cable in my bedroom and the fire stick took care of that problem.  Great price!! Easy to install!! Would highly recommend!!!", "verified": true, "helpfulness": "0/1", "author": "Cassi Martin"}, {"rating": 3.0, "review": "I have both a fire stick and a roku. So it's hard not to compare the two. The fire stick is extremely inconsistent. Often it doesn't load the show or movie and even more often it cuts in and out. Almost like the service just disconnects for awhile. I know it's not my internet because as I mentioned I also have a roku and I never have problems with it. Fire stick is definitely convienent and extremely portable but it's just not reliable.", "verified": true, "helpfulness": "1/2", "author": "JB"}]