[{"rating": 5.0, "review": "Best price,best service.", "verified": true, "helpfulness": "0/0", "author": "John Smith"}, {"rating": 5.0, "review": "My granddaughter loves the Fire Stick for her shows.  Big Time Rush, etc.  A great buy and doesn't take up any space.  It was easy to connect and works like a charm!", "verified": true, "helpfulness": "0/0", "author": "soncerat"}, {"rating": 4.0, "review": "If you're paying for Amazon Prime, THIS little doo-hicky is the cat's a--. I have two big screen TV's neither of the two are \"smart\" TV's, so, I've been watching my NetFlix and Prime Video on one of my tablets with headphones or ear buds (which is fine if you and the spouse are in the same room and just can't abide her show preference -- which is like... always... :o) ). Anyway, it's nice to have the program on all 55\" AND in 5.1 surround.Had a devil of time getting the batteries in the remote, believe it or not - something soooo basic...there comes a time in every man's life when he needs to be smarter than the piece of plastic he's holding in his hand, I guess...but, fished around and found I wasn't the only one. Aside from that irritating little debacle that probably earned me couple more eternities in hell for taking the Lord's name in vain, set-up was a piece of cake. Here is the other thing, you can download a voice command remote app for your Android or Iphone free and it too worked seemlessly.This was a gift from my son...so be advised when you're doing the minimum programming that you'll need to switch it over to your own Amazon account first. Not a biggie if you miss it the first time...you can go back.I'm not kidding, the most difficult part of this whole setup process was getting the batteries in the remote and figuring out that teenie-tiny little remote control - I swear to gawd herself, the dog is going to have that thing missing in NO time.If you're considering this product, I'd seriously recommend that you hit all of the online sites you can find while waiting for it to be delivered so that you can see what you've purchased and what it does....and by all means squeeze the sides of the remote together while sliding the battery cover down with your fingernail. Eternity in purgatory with me will surely result if you don't.", "verified": true, "helpfulness": "0/0", "author": "DQW"}, {"rating": 5.0, "review": "Great item highly reccomended", "verified": true, "helpfulness": "0/0", "author": "Mary A Paterniti"}, {"rating": 5.0, "review": "this is great", "verified": true, "helpfulness": "0/0", "author": "Robert Bulford"}, {"rating": 1.0, "review": "I bought it assuming that what was on the box was included for free or a small fee. some require you to be paying for cable which is why i bought the stick....to avoid buying cable. I really hate it, see no purpose to it, and i feel like I wasted money buying it for my family.", "verified": true, "helpfulness": "0/0", "author": "LaraFamily"}, {"rating": 5.0, "review": "Fantastic :-)", "verified": true, "helpfulness": "0/0", "author": "Nicola Zamboni"}, {"rating": 1.0, "review": "Constantly looses network. Tried two - same issue. Smart TV in another room works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Ilya S."}, {"rating": 4.0, "review": "Great device small and do the job", "verified": true, "helpfulness": "0/0", "author": "jaber"}, {"rating": 5.0, "review": "Love it. Easy to set up.", "verified": true, "helpfulness": "1/1", "author": "Sandra"}]