[{"rating": 2.0, "review": "On paper, this device should work like a champ.  In practice, not so much.Unfortunately, FIRMWARE bugs and CHEAP BUILD quality seem to be causing OVERHEATING and CONNECTIVITY issues for many users.CONS:-Screen mirroring is clunky to set up and prone to failure.-Constant connectivity issues for both WiFi and Tablets/Smartphones.-Operating temp. of over 110F seems way too hot, (while room temp. is only 75F).-Requires AC vs USB power supply (USB okay w/Chomecast).-No internet browser  (Casting and browsing okay with Chromecast extension or $99 Fire TV set-top box).-Requires Fire Stick remote for data input (Data input via phone/tablet okay w/ Chromecast).-Laggy delay while Mira-casting makes live gaming (auto racing, RPG) impossible.-UNDER-whelming media search...should include IMDB-style links for quickly finding related content, (actor, genre, etc.).-Overlap in Amazon Prime video sections makes other content cumbersome to find.PROS:TONS of free content for Prime members.Miracasting available via Kindle tablets...until Fire Stick overheats 15 min. later.Complete connectivity to all your Prime media...sort of.The \"media ecosystem\" you're using, (Apple, Amazon, etc.), will help decide which Media Stick is right for you.An abundance of bugs indicates this device was rushed to market.  So far I have additional out-of-pocket expenses for a Wi-Fi extender plus an HDMI coupler and cable.Fortunately, Tech Support team has offered a replacement stick...So, we'll see.", "verified": true, "helpfulness": "0/0", "author": "Michae! \"Michae!\""}, {"rating": 5.0, "review": "Love Fire TV Stick!  Has worked well from the moment I took it out of the box!", "verified": true, "helpfulness": "0/0", "author": "Felicia Davis"}, {"rating": 3.0, "review": "For a TV mounted on the wall, an inadequate length of extension is provided for the device to connect to the TV. It cannot pickup wifi or you will get inadequate wifi service required for the stick. I have a 65 inch VIZIO TV and it did not work well at all. I switched to another table top mounted smaller TV and it is working great on that. HOwever, I bought it for my 65-inch TV.", "verified": true, "helpfulness": "0/0", "author": "John Scott"}, {"rating": 5.0, "review": "Easy to use. I love it!", "verified": true, "helpfulness": "0/0", "author": "rowangirl2013"}, {"rating": 5.0, "review": "Love this! So easy to set up, too.", "verified": true, "helpfulness": "0/0", "author": "Madison Stone"}, {"rating": 4.0, "review": "Works right out of the box. Get a great high quality signal and have lots of options to watch. Highly recommended!!!", "verified": true, "helpfulness": "0/0", "author": "Brandon Glen Johnsons"}, {"rating": 5.0, "review": "Only used for 2 days but my husband already is the happiest man in the world.  We have finally joined the 21st century", "verified": true, "helpfulness": "0/0", "author": "Eileen"}, {"rating": 5.0, "review": "Perfect replacement for fable TV", "verified": true, "helpfulness": "0/0", "author": "Dale Young"}, {"rating": 5.0, "review": "THE FIRE STICK ROCKS!I can't even begin to explain how much I love the Fire Stick. I bought a Roku about two years ago for the tv in my bedroom and really like it, but my daughter needed something for her bedroom. I bought this since the cost was so much cheaper and I couldn't be happier. It is super super easy to install (like absolutely anyone can install this in less than 5 mins), the high def quality is great, and the variety of offerings is fabulous. In addition to movies and tv shows, there are also games (I am obsessed with the game Life, have the app on my phone, and now I can play it on Amazon Fire with the Fire Stick game controls!). Also, I have an Amazon Prime account so there are thousands of free options.The Stick is superior to anything similar on the market right now, esp for the price....If you are thinking about buying one, you won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "Works well!  No issues installing or using.", "verified": true, "helpfulness": "0/0", "author": "Oscuran"}]