[{"rating": 5.0, "review": "I didn't expect to love this device as much as I do.  I may even like it more than my Roku Streaming Stick.  It's got so many features, including games and educational content for my kids (ages 3 and 5).  My only issue is that my kids keep losing the remote!  It's pretty small, so it can get misplaced easily.  Fortunately, we always find it in the same place...under the couch!  :)", "verified": true, "helpfulness": "0/0", "author": "Kindra D. Wessel"}, {"rating": 4.0, "review": "Works well, so far so good. Seems to have occasional lag time when buffering during a movie. Maybe if it had more internal storage it could cache more content.Overall I like it however, nice and easy to access Prime movies, which is all I've used it for so far.", "verified": true, "helpfulness": "0/0", "author": "Spectraman"}, {"rating": 5.0, "review": "Love this and how versatile it is!", "verified": true, "helpfulness": "0/0", "author": "Ashley Smith"}, {"rating": 4.0, "review": "Firstly, the speed of this device is fantastic. It blows the roku stick out of the water in that respect. Amazon content is amazing and works amazing with the fire hdx. However.... All other content kind of falls short, or is the fire stick designed that way? Amazon prime tv and movies play flawlessly. Netflix, not as much. WWE Network, also does not perform well at all. It is choppy video 90% of the time. I also have a roku stick that plays everything from the same tv perfectly. Not sure what the deal is with the fire stick, but it is annoying. It is still new so they have some kinks to work out for sure. Which is why as of right now I can only give it 3 stars. The lack of content for the fire stick compared to the roku is laughable, but i am sure it will grow over time. Once they get the content that the roku has (media browser for instance) then I may come back and give it a higher rating. But as of right now in fire stick 1.0 its 3 stars at best. Speed and price are why I give it 4 stars. Now amazon, just get us more content and work out the bugs.", "verified": true, "helpfulness": "0/0", "author": "Doc"}, {"rating": 5.0, "review": "The Fire TV Stick is everything I hoped for plus more! I've been using my Wii to steam Netflix and Amazon Instant TV but its so much easier with the Fire Stick. Plus there is many more channels and ways to watch. Love that they've included Pandora as well!", "verified": true, "helpfulness": "0/0", "author": "Krysta lockard"}, {"rating": 1.0, "review": "Bought one and never  had a chance to do more than boot it and register it before it was stolen. My complaint stems from there's no apparent way to figure out if anyone else has been using it. While this hole in security and an obvious value-add for Amazon is across all Amazon devices, I was directly affected by the inability to do any detective work on where this went after it was stolen. No dice Amazon, my review is based solely on lack of security features.", "verified": true, "helpfulness": "0/3", "author": "John Marshall"}, {"rating": 3.0, "review": "Requires an insane amount of wifi bandwidth to work properly. Doesn't seem like they accounted for less than 10mps throughput. No buffer was included apparently...", "verified": true, "helpfulness": "0/0", "author": "spawn_mc \"Auditorially inclined book lover.\""}, {"rating": 5.0, "review": "There isn't a lot to be said for this little device that isn't already mentioned about the FireTV. This is a stand in replacement for anyone that uses the FireTV for media streaming, and doesn't use the Game/App features of the FireTV. Even then, several of the apps I use still work on the FireTV, but there is one noticeably missing feature: FreeTime.I ended up using this as a go to gift for Christmas this year, passing out about 6-7 of them, then advising people that Plex was available for free on Christmas Day.The FireTV stick is great at streaming media, so between Plex, Netflix, Hulu Plus, and my Tablo (Used for OTA DVR), this is an easy replacement for all other streaming devices, and potentially a Cable Cutters best friend. I've had a Boxee BOX, Roku 2, Roku 3, Roku Stick, Chromecast, X8 Meida streamer (android based), FireTV, and an Apple TV. Of all of the items, this is on the cheaper end of the spectrum but doesn't disappoint. The Boxee Box was a better interface, but went the way of the dodo when Samsung bought them out. Among the other devices, this is by far the easiest to use interface/device in the list.", "verified": true, "helpfulness": "0/0", "author": "James Erickson"}, {"rating": 5.0, "review": "Better than google chromecast yet missing a few features that would absolutely kill it. I love how you can install many apps and play games on this as well but it's missing the feature of casting videos from your phone. I know you can cast the screen but it's not the same since it leaves your device no functional if you want to watch a movie from your phone to your TV. The screen cast basically mirrors whatever is on your phone so if you exit the video, it'll exit the video on your TV. Chromecast lets you share the video to your TV and it leaves it in the back ground so you can still use your phone or device. If they implemented this feature then it will totally be much better than chromcast.", "verified": true, "helpfulness": "0/0", "author": "CuriousEggroll"}, {"rating": 4.0, "review": "Setup was extremely easy and simple. Netflix, Amazon Prime, and YouTube works great on it.  Amazon integration is great. For non-tech/non-power users, I would recommend this over the Google's chromecast because of the remote.  Also an added bonus is being able to run Apps and Games which the chromecast can't do.However, if you are a power google user and want more integration with Google products, you might want want to go with the chromecast instead.  For example, this device has trouble with casting screens from android devices and sometimes have trouble with playing youtube video sent from the android device like a smart phone.  The YouTube app works fine on the firestick.Also another caveat is that the USB port on the TV wasn't enough to power the device, so I had to use the built in power usb adapter.  However, the cord wasn't long enough to reach the power outlet.In making the choice between the Amazon Fire TV Stick and the Google Chromecast, think about where most of your media will be stored at.  For example, if your digital media and purchases/streaming will primarily be done at Amazon, the Fire TV Stick is the obvious choice.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"technomagefa\""}]