[{"rating": 5.0, "review": "We are well satisfied with the fire stick and would highly recommend it!!", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 1.0, "review": "you must enable \"1-Click Purchases\" on your account to install apps like Netflix and Hulu on your device. If you're like me, you will forget to change that setting back after installing your apps. Then, if you use the built-in search feature, you WILL be shown the paid options (if available from Amazon) FIRST instead of the free versions if available from other content providers. Example: Yo Gabba Gabba Holiday Special HD is FREE on Hulu, but $4.99 on Amazon Instant Video. I use Hulu on my iPad to play this for my daughter so I know its free, but I ALMOST paid $4.99 on the Fire Stick because of this little tactic, fortunately I noticed the wording \"Included with Amazon Prime for 0.00\" was replaced by \"Add to watchlist\" and if you click Play on this screen, the video will immediately play and your account charged, no confirmation page or anything because remember, you were forced to enable 1 click purchases. VERY shady Amazon but I caught you and am letting others know!", "verified": true, "helpfulness": "2/2", "author": "Daniel"}, {"rating": 5.0, "review": "I absolutely love this.  I didn't have Netflix in the past bc I did not have anything to stream it through.  Its so easy to set up...just plug into back of your TV and start watching videos, Netflix, play games ect.  not to mention the orig series I can now watch.I highly recommend this product and for the price it is so worth it", "verified": true, "helpfulness": "0/0", "author": "KYRA WHEELER"}, {"rating": 2.0, "review": "It needs alot of work, I don't think it is ready to be released yet,", "verified": true, "helpfulness": "0/0", "author": "James W. Jones"}, {"rating": 5.0, "review": "The set up was a little difficult because the stick wouldn't recognize the wireless the first two tries. Once I got it set up it was very easy to use.  The kids love being able to pick prime shows and movies to watch as well as listen to music.  We love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this thing. I do not know what more you could ask for.", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 5.0, "review": "Good for moving around the house or travel. It is easy to use and has a good collection of most popular entertainment apps outside of itunes.", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "Wow, A great addition", "verified": true, "helpfulness": "0/0", "author": "Scott Podella"}, {"rating": 5.0, "review": "Love it!! Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "miriam lema"}, {"rating": 4.0, "review": "It was easy to install and use.  Have only used it with Amazon prime so far.", "verified": true, "helpfulness": "0/0", "author": "Frances Davis"}]