[{"rating": 5.0, "review": "Even though it was back ordered, this was to be expected right after Christmas, it arrived earlier than the expected delivery date. Works great! My husband will look forward to his baseball games all season long.", "verified": true, "helpfulness": "0/0", "author": "Marian G."}, {"rating": 5.0, "review": "It was very easy to install and start using. So glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Unknown"}, {"rating": 5.0, "review": "Prime and the Fire TV stick were meant for each other! Love the prime movies and the access to Amazon Photos is awesome. Already thinking of buying another one.", "verified": true, "helpfulness": "0/0", "author": "mcarm"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "jose diaz"}, {"rating": 1.0, "review": "I am very disappointed in it.  I wish I had bought another Roku instead ofFirestick.  I cannot get the channels I get on Roku, which are NorthpointCommunity Church, Joyce Meyer, Greg Laurie and a few other pastors..I amhoping they will be added as time goes on.", "verified": true, "helpfulness": "1/1", "author": "LT Hall"}, {"rating": 5.0, "review": "Finally a plug and play that delivers. Set up and began viewing Amazon Prime under 15 minutes which includes connecting to our secured home Wi-Fi. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Catherine A Sampson"}, {"rating": 2.0, "review": "I really wanted to like this stick. I bought it for a secondary TV. I have owned a Roku 3 as my main streaming device for over a year now and and I love it. It works great, never has a buffering problem, and has an easy layout to navigate. In fact, before we cut the cord, it was on the secondary TV the Fire stick is on now. Never had a problem. Since I cut the cord completely a month ago, I needed a second streaming device. I tried the Roku stick but it was getting an 011 error that the company couldn't fix, so I took it back. Then I ordered the Fire TV stick. It finally showed up and while better than the Roku stick, it still has enough problems for me to return it.ProsPrice. $39. Much cheaper than a Roku 3Remote. The remote is sleek and small. Not as bulky as the Roku remotes.Portable. The size would make it easy to take on vacation or to a friend/relative's house.ConsBuffering issues. We tried on several occasion to watch shows via Hulu. The picture quality wasn't very good and very quickly the picture would stop while the sound continued. I tried both pausing the show and backing out of the app. Neither seemed to help.Lip Sync. On multiple occasions while watching Netflix, Hulu and Prime the voices and picture were off. I would have to back out of the app and try again. It usually fixed after the first try. Sometimes it would take 2 tries. If you would fast forward or reverse the problem would happen again.Picture. This is probably due to the signal strength, but I never thought the picture was as good as the Roku.I was really hoping this would be a cheap option for my needs. I bet in a month or two with a firmware update this will be a nice little streaming device. Unfortunately, for now, it's too problematic", "verified": true, "helpfulness": "1/1", "author": "Jack Burton"}, {"rating": 5.0, "review": "I freaking love this thing! The Fire stick does more than I expected and I definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "yahpunkinhead"}, {"rating": 3.0, "review": "The system may work well on a cable system, but with the satellite, it is limited...", "verified": true, "helpfulness": "0/0", "author": "Joseph M. Sousaris"}, {"rating": 1.0, "review": "Remote just about impossible to open to put batteries in. Husband had to use all his strength.  Big Google and you tube section on how.  That tells u something!  Returning it because it seems incompatible with Samsung TVs. Found this out through trouble shooting and comments from other people. It would not connect to wifi.  It sensed the network but would not recognize the password.  Amazon should make this known.  Works with bedroom TV, Visio, when I moved that TV to the living room", "verified": true, "helpfulness": "0/0", "author": "Jayne Farrell"}]