[{"rating": 2.0, "review": "Amazon has a lot of video's but not much that I want to see", "verified": true, "helpfulness": "0/0", "author": "David Anderson"}, {"rating": 5.0, "review": "Streams seamlessly, absolutely a worthy purchase!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "So simple and so powerful. Get full enjoyment of your Amazon Prime with the Fire TV stick. I live in an area where internet speeds are minimal and when using my laptop to view Prime movies and TV I experienced lots of buffering and low rez picture. With the Fire TV stick I get top quality viewing and no buffering. Can't wait til supply meets demand so I can purchase more for my other televisions.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 2.0, "review": "Constantly loses connection and complains 'internet connection is slow'. But, it also says the wifi signal is 'very good'. My blu-ray player sitting one foot away from the stick connects to Prime flawlessly, never stalls or drops a connection. I've tried both 2.5 Ghz and 5 Ghz wifi connections, same problem.  BTW, my internet connection via my 11N wireless measured from my notebook consistently clocks in at > 100 mb/sec. That's using the same wireless network as the stick. Hardly 'slow'. So far, totally useless. You get what you pay for.PS - I also have Google Chromecast. It actually works, and works well. Just doesn't have Prime.To be slightly less negative, if I reboot the stick, I can usually stay connected long enough to actually watch one movie. But, after a few hours, it will start losing connection regularly.UPDATE: I've been using this pretty regularly. Still loses connectivity. Still reports 'very good' wifi signal strength. Many people have the same issue, check the reviews or do a web search. Amazon's recommendations (reboot your router, etc) are absurd. It's not my router, it's the stick. No other device I have fails to stay connected. On the semi-plus side, if you reboot the stick using the hold-select-and-play-buttons method, after a restart the connection miraculously works. Hmm, didn't have to reboot my router, did I?The big question is, can this be fixed by a software update, or is it a hardware defect? At $20, I'll hold on to it. While this isn't an epic fail, it's certainly a fail. So, if you can get one cheap, might be worthwhile. If you can't, don't bother.", "verified": true, "helpfulness": "1/1", "author": "W. Ezell \"wezell\""}, {"rating": 4.0, "review": "I like the stock, but it is very limited in its use.  You can only access a few sites, and unless you know everything in Prime, you have to try and remember all the shows you want to watch.  It takes a long time to startup.  It's better than buying a new VCR with Internet.  I am disappointed in the quality by Amazon.  They should have set it up better before marketing it.", "verified": true, "helpfulness": "0/0", "author": "Donald B Slusher Jr"}, {"rating": 4.0, "review": "Great device, I am online from this device to watch Netflix and Hulu Plus. Unfortunately; No Vudu is on this device but that's okay still a great device for the sales price I paid for this. I wish it would play through my surround sound that is something I am still working on. But still a work in progress, this Amazon stick will work on any television so I am not restricted to just one TV in my home. Love, Love , Love this Device!!! Way to go Amazon Fire Stick", "verified": true, "helpfulness": "0/0", "author": "BatteryHappy"}, {"rating": 5.0, "review": "Love it!!  once I figured out how to get some of the additional apps on there, specifically YouTube, I was good to go.  Sleek design.  Fast speeds.  Good graphics.  Get yourself one.", "verified": true, "helpfulness": "0/0", "author": "Christopher R. Null"}, {"rating": 4.0, "review": "It's a neat little device.  I find it a great compromise between the chromecast and the roku stick.  The chromcast is hugely versatile since it's controlled via your phone and any app can control it.  It has no real common user interface.  The Roku stick has no real expandability (I haven't tried the more recent ones, I might be wrong), but that allows the user interface to be well designed and well tested.  The Firestick fits nicely in the middle.  It has a decent user interface that the chromecast lacks, but allows for app installation from the amazon app store.There is usually a two level menu and then you scroll left and right to see all the media choices similar to the netflix UI.  It will provide you with recommendations.  Most importantly, you can view the Prime library.  The UI while watching was pretty well thought out.  If you press left or right once, you get a 10s skip.  It's useful when you miss a line of dialog.  One press to the left and it skips back.  If you hold left or right you FF/Rew.All in all, I'm happy with it.At this time, I've found one small bug.  While quickly scanning through media choices, it can freeze up for a second.  It will buffer any input and catch up when it continues.  This has the effect of you pressing right and not seeing anything, so instinctively trying again and again.  Once the device unfreezes, you're three choices along.  It isn't anything huge.", "verified": true, "helpfulness": "0/0", "author": "Bhroam Mann"}, {"rating": 5.0, "review": "Being a Prime Member, I got the Fire TV Stick for  $19.99, best thing I've bought in a long time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to Set up, intuitive interface.  I was impressed with its responsiveness when entering commands onto the remote.  Great value in a small package !!!", "verified": true, "helpfulness": "0/0", "author": "James A. Smith \"Taystee\""}]