[{"rating": 5.0, "review": "Works wonderfully.  Easy to set up and a breeze to use.  Intend to buy another as a spare for other TVs in the house.", "verified": true, "helpfulness": "0/0", "author": "Mikki K"}, {"rating": 5.0, "review": "So easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Jayson M Lane"}, {"rating": 5.0, "review": "Great add on for a non smart tv. Very easy tu use. Great value for money", "verified": true, "helpfulness": "0/0", "author": "Lucila Einstoss"}, {"rating": 5.0, "review": "The Fire TV Stick is everything that I hoped it would be and more!  Since the moment I plugged it in to my TV I have been happily exploring all of the free TV shows, movies, and videos at my fingertips.  And, because I subscribe to Prime and use the cloud, I was immediately able to access all of my photos and music too!  I can't believe that I waited this long to get one.", "verified": true, "helpfulness": "0/0", "author": "Chrissy"}, {"rating": 4.0, "review": "So far so good ..Unable to get connected to my Netflix. .", "verified": true, "helpfulness": "0/0", "author": "Gloria Marshall"}, {"rating": 5.0, "review": "I love love love this product!!!!! It instantly turned my 6yr old daughters tv into a smart tv with free age appropriate apps. I would refer this product and will be buying another one soon for my room.", "verified": true, "helpfulness": "0/0", "author": "Nikesha L."}, {"rating": 2.0, "review": "When using the fire stick I could not use any other device like the computer or cell phone that also streamed from the WI-fi.", "verified": true, "helpfulness": "0/0", "author": "KBC"}, {"rating": 5.0, "review": "Love the Fire TV Stick.  It makes browsing and watching Amazon content so much easier.  The Netflix interface could be better, I like the one that ships on the Vizio TV's better than the one for Fire TV stick.  This is a great addition to any television, especially if you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Easy peasy, simple pimple to attach and setup.  My only complaint is I wish the animated introduction could have been bypassed.Navigation and use are seamless and intuitive.Thank you Amazon for another fine product!", "verified": true, "helpfulness": "0/0", "author": "Fred VonFirstenberg"}, {"rating": 5.0, "review": "If you have Amazon Prime the Fire Stick is a must buy.  Easy to set up and easy to use.  Great selection of tv, movies, music.  I wish I had purchased it sooner.", "verified": true, "helpfulness": "0/0", "author": "sealyreader"}]