[{"rating": 5.0, "review": "Since we decided to ditch expensive cable tv, we did need additional viewing choices, so, I purchased two of these for my husband an me, and I love them!!!  My husband isn't computer literate but he is doing great with them.  It truly is the answer to our quest to lower cable costs while having a viewing choice.  One suggestion, make sure you use the extension included in the box..I called tech support because the stick wasn't recognizing my internet connection,and they said you need to use the extension-type cord in order to move the firestick further away from the HDMI port because it gets too hot if direct connected and won't pick up a wifi signal.  And, you do need to plug into the wall or power strip NOT into your TV port...as some people are showing on YouTube.  You will really like this set up!  I'm going to order the voice activated remote here shortly, just to make the navigation even easier.  Happy viewing!!", "verified": true, "helpfulness": "0/0", "author": "Glenna J. Judd \"GJJ\""}, {"rating": 4.0, "review": "it seems like the roku has more movie options, but this still has plenty to choose from and has a lot of games...def worth the price.", "verified": true, "helpfulness": "0/0", "author": "Mstar"}, {"rating": 5.0, "review": "So much faster than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Mr. A \"Just a regular consumer\""}, {"rating": 5.0, "review": "I love the fire stick I can watch what I want when I want even movies in theater's", "verified": true, "helpfulness": "0/0", "author": "queacha watkins"}, {"rating": 4.0, "review": "So far I love this as much as my apple TV and my chromecast", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this. I ordered it when it was cheaper for Prime members (for like two days), and for $19 it is a true bargain. It's a bargain for the regular price of $39!!!!! We are considering breaking the cable bond and going without, and this helps our cause. We watch a lot of things streaming, with little time for a regular t.v. schedule. This is perfect.We do also have the Fire TV, and this is pretty much the same thing. No voice search (I don't know if the remote is compatible), but you can still play games with it (we are not a gamer family, with two girls, but the games available on both are fun and fine for us). With the Fire Stick, we are set. We will probably be getting another one her soon.", "verified": true, "helpfulness": "0/0", "author": "Constantly Reading Momma"}, {"rating": 5.0, "review": "Easy to install, preregistered with Amazon, if only it worked, I would have been very happy.  Defective - keeps disconnecting from the router every 2 minutes.  Strong signal, no other problems in same room on other devices.  Returning for credit.** EDIT and Upgrading review rating **  ... Although what I said is true and it was returned, it appears that this is not the fault of the product.  I now wish I would have kept the Amazon Fire Stick until my situation is resolved.  I tried installing the other chrome brand of tv stick and it does the same thing, causes my DSL router to fail after I am all done setting everything up according to directions.  Not sure what the problem is as I have read many other people having the same issue, but it is a home network issue, not a problem of the FIRE STICK.  Just beware.  I give up and will live without it but I am sad to see the Fire Stick returned - I wish it would have worked at my place and it does seem friendlier to use than the chrome version.Just confused as to why so many people are commenting on their internet getting disabled when using either brand of TV stick ... calling overseas helpline for my DSL service provider for assistance made my trip to the dentist seem completely painless.Clueless and sad it didn't work.", "verified": true, "helpfulness": "2/2", "author": "Johnny B."}, {"rating": 5.0, "review": "If you have Amazon prime, this thing is a no brainer. Netflix, Pandora, Spotify all with the one devise. Very intuitive to use too. Well done.", "verified": true, "helpfulness": "0/0", "author": "Julien"}, {"rating": 5.0, "review": "We love our fire stick.  I love that you can access the amazon prime music on it and my husband and son enjoy the games on it as well.  It is compact and small and we got it for a great price.  It was perfect for our wall mounted television in the kitchen!", "verified": true, "helpfulness": "0/0", "author": "H. Patterson"}, {"rating": 5.0, "review": "Works great. Easily installed.", "verified": true, "helpfulness": "0/0", "author": "John W."}]