[{"rating": 1.0, "review": "thats crazy! I cannot open battery cover!!!! I don't want to use remote,okay? I just want to use fire tv. What's your remote design?", "verified": true, "helpfulness": "0/0", "author": "Carven"}, {"rating": 5.0, "review": "I'm enjoying it but I wish the printing was larger on the screen where PRIME is written above the movie", "verified": true, "helpfulness": "0/0", "author": "Judy Antonelli"}, {"rating": 5.0, "review": "I wanted to get Prime access on TV and this does work for me.  Internet is lost occasionally and I just remove stick a few seconds and it returns.  I use HDMI extender sent in box and helps with staying connected.  Package intact and easy to open.  Several apps to choose from and enjoying those too.", "verified": true, "helpfulness": "0/0", "author": "KM"}, {"rating": 5.0, "review": "This is a great product.", "verified": true, "helpfulness": "0/0", "author": "Hubert Preston Davis"}, {"rating": 5.0, "review": "I love this device.  so simple to use and gives me access to Netflix and other aps on my TV through the HDMI port.  For the price it is AWESOME!!", "verified": true, "helpfulness": "0/0", "author": "Sharon Gregory"}, {"rating": 3.0, "review": "Works fine.  Wish there was a better Amazon Prime selection.", "verified": true, "helpfulness": "0/0", "author": "Sally W"}, {"rating": 2.0, "review": "I won't go into details about everything the Fire TV Stick offers as far as content as you've probably seen that elsewhere. For me the main thing was to compare the Fire TV Stick against the regular Fire TV.The quick version is: Go ahead and pay more to get the \"regular\" Fire TV instead of the Stick.Here's why:- The Fire TV Stick still requires a separate power supply to be plugged in. So even though the device is small and plugs right into the HDMI port on your TV you still have to run a power cable to it and plug it into AC power. To me that reduces the benefit down to just not having to run the actual HDMI cable from the regular Fire TV to your TV which isn't that big of a deal.- The Fire TV Stick remote does not offer the speech recognition features like the regular Fire TV does. To me this is one of the primary features that separates the Fire TV from the competition. Being able to just say what you are looking for instead of using the onscreen keyboard saves a ton of time and frustration.- The Fire TV Stick is noticeably slower when navigating through the UI and accessing applications such as the basic games and things that are available with it.So in the end the Stick is a much cheaper buy, which may be the most important factor to you, but for me it is worth it to spend a little extra and get the full Fire TV. The speed of the interface and convenience of the speech recognition remote alone make it worth it.", "verified": true, "helpfulness": "1/1", "author": "Josh"}, {"rating": 4.0, "review": "Good for what it does.  I bought it when it was first announced for less than $20.00.  And, for that price, it was a STEAL!I already owned a couple of ROKUs and Chromecasts when Amazon announced the Fire TV Stick.  Since they had a great pre-order price of about $20;00, I decided to give it a try.  I didn't need it, but couldn't pass up trying it at that price.I'm glad I bought one.It works well, and, of course, it's geared towards consuming Amazon digital content.Streaming Prime Videos and Music work well.  And, having the physical remote control and a power adapter and cable included are nice touches.I haven't really tried the games, since I don't have the gamepad, but they do look fun and since I own a number already on my Kindle Fire HD, I will probably get one and try it out eventually.  (Hopefully on sale.)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutely fantastic gadget. We dropped cable. With this, we watch and pay for only what we want--movies, movies, and more movies.", "verified": true, "helpfulness": "0/0", "author": "Pasca \"Pasca\""}, {"rating": 5.0, "review": "With the addition of Sling TV, this is perfect for cord cutters.", "verified": true, "helpfulness": "0/0", "author": "Bobby Marshall"}]