[{"rating": 5.0, "review": "I purchased this when it was discounted during Prime Day.  We have a Roku 3 hooked up in the main room, and thought that this would be nice in the guest room.  It was very easy to set up and get running.  I know that it is not as powerful and does not have the memory that the boxes have, but for the price it works great and does everything we need.  The included remote is easy to use, as is the remote app for my phone (Android based).", "verified": true, "helpfulness": "0/0", "author": "jenny8675309"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "kathy bradley"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "C. Jones"}, {"rating": 5.0, "review": "I love my Amazon Fire Stick it works great!!", "verified": true, "helpfulness": "0/0", "author": "Big Art"}, {"rating": 1.0, "review": "The fire stick was awful and is on its way back to the company. I was very disappointed, and when I called Amazon regarding the connection issue they wasn't much help. My daughter really was looking forward to us being able to watch Netflix movies on our TV instead of the smaller devices, laptop, pads or computer. Guess we'll try roku.", "verified": true, "helpfulness": "1/1", "author": "Cathy Holley"}, {"rating": 4.0, "review": "Works as advertised.  It is a great little device.  My favorite feature is the screen mirroring feature.  It is not perfect...you have to have a good wifi signal to fully enjoy the media.  I bought the Roku stick and returned it when it wouldn't let me use it without setting up a payment account.  The screen mirroring is what sold me, and it works.  I would give it 5 stars, but I always refrain from the \"perfect\" rating.  Maybe if it produced bacon or did my laundry...it would have 5 stars for sure!  Chromecast...Roku...Firestick is by far the best.", "verified": true, "helpfulness": "0/0", "author": "Kevin Simmons"}, {"rating": 5.0, "review": "Good bang for the buck!", "verified": true, "helpfulness": "0/0", "author": "francis"}, {"rating": 5.0, "review": "We absolutely love the fire stick.  Great purchase", "verified": true, "helpfulness": "0/0", "author": "Tasha"}, {"rating": 5.0, "review": "I have used multiple streaming devices... (xbox, ps, chromecast, roku) and I have to say amazon did a pretty good job!The fire TV stick is awesome, especially the controller is a big plus over the chromecast.The on screen display of the fire stick is easy to navigate and the recently watch on the top is great for quickly getting into one of my favorite shows.One negative is how heavily it pushes amazon services down your throat, most the main tabs are amazon content and you have to go into the apps to bring up something like youtube/netflix. But it makes since, it is an amazon product after all.If I can get another one on sell I will definitely replace my living room chromecast with a fire stick.", "verified": true, "helpfulness": "0/0", "author": "allennat"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Ashsriv"}]