[{"rating": 3.0, "review": "Actually it is not all that I had hoped for.  I am trying to get rid of Cable and all the unwanted channels for the outrageous prices, but I am finding that with the fire stick  I have to get all sorts of other costy programs I really don't want.", "verified": true, "helpfulness": "0/0", "author": "nanner3597"}, {"rating": 5.0, "review": "it works great for a small device!", "verified": true, "helpfulness": "0/0", "author": "Terry Howard"}, {"rating": 4.0, "review": "I'm a longtime Roku user with experience all generations of the Roku up to Roku 3 (the puck).  The Amazon Fire TV stick is an incredible value at $39, although I paid only $20 as an Amazon Prime member.  The layout is very nice and professional compared to Roku -- better than Roku with better click and scroll experience (with the Fire TV).  There are lots of extra features including my favorite -- being able to click for more details about the actors in the current scene.  I did find that this feature was somewhat buggy.Roku has more content but a lot of the content is crap.  I have yet to explore all of the content available for Fire TV but the major 3 are there:  Amazon Prime, Netflix, Hulu Plus.", "verified": true, "helpfulness": "0/0", "author": "T. Phi \"Working Momma\""}, {"rating": 5.0, "review": "VERY SATISFIED", "verified": true, "helpfulness": "0/0", "author": "MACCLINTS"}, {"rating": 5.0, "review": "Best remote ever", "verified": true, "helpfulness": "0/0", "author": "douglas p boeshaar"}, {"rating": 2.0, "review": "I have had issues with buffering and not working with my internet. I am very disheartened but it was cheap. I will try to stick it out.", "verified": false, "helpfulness": "0/0", "author": "Migdalia Vu"}, {"rating": 4.0, "review": "Works well.  I was challenged to open back of remote to install batteries and called Amazon support for help.  I was given a few tips which allowed me to remove the battery cover and install the batteries.", "verified": true, "helpfulness": "0/0", "author": "John T. Ray"}, {"rating": 5.0, "review": "Item arrived as stated.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "tony5949"}, {"rating": 5.0, "review": "Great  while traveling and at home., excellent selections...works well with WiFi systems which are top notch, on TV. Not so good if internet service quality is borderline . If you use your tablet can use it just about anywhere no problem. Our internet  service while renting in Tucson last spring was not great, the Stick wouldn't work on the TV but my Kindle Fire was just fine for viewing the programming.", "verified": true, "helpfulness": "0/0", "author": "Grammashe"}]