[{"rating": 3.0, "review": "I wanted this for 2nd TV.  It does work well for Amazon's content, but I also wanted a way to connect to my computers to stream media from them for that TV.  Plex seems to be the only choice so far but I really dislike Plex.  If Serviio ever gets working on it, I would like it much more, but not until then.  I ended up buying another Sony BD/DVD player that also streams content and that works great for the 2nd TV for everything we could want.", "verified": true, "helpfulness": "0/0", "author": "Rippler"}, {"rating": 5.0, "review": "I'm amazed that this stick is a mini computer.  It is basically plug-and-play, and very user friendly; anyone can operate this.", "verified": true, "helpfulness": "0/0", "author": "Bibliophile"}, {"rating": 5.0, "review": "Best investment we could have ever made!!! I am so glad to not be tied to the cable box anymore. I love that you add Netflix or Hulu for the ultimate in commercial free viewing. If you are thinking of walking away from the cable company.... DO IT!! You won't regret it!", "verified": true, "helpfulness": "0/0", "author": "Donovan & Sarah Wisehart"}, {"rating": 1.0, "review": "I feel totally duped by this product. I needed a vehicle for mobile HBO viewing (not my Kindle Fire), and, as a Prime member, decided to try a Fire stick. Amazon has been bragging about the HBOGo app so this should have been a no-brainer. Wrong. Silly I am to assume that since I can watch HBOGo on my Kindle, I could watch it on Fire TV. Much to my chagrin Comcast, one of the largest cable providers in the country, is woefully missing from the list of providers. I really don't understand how this omission can ever occur when there seems to be deals already in place. Oh well, shame on me for not completely researching before buying.", "verified": true, "helpfulness": "1/1", "author": "Glenn Chase"}, {"rating": 5.0, "review": "Great invention!  The only drawback is the amount of data that I use whenever I use the Fire Stick to watch Hulu and Netflix.", "verified": true, "helpfulness": "0/0", "author": "R. Dickens \"tv fanatic\""}, {"rating": 5.0, "review": "love the stick!  easy  setup.  works great", "verified": true, "helpfulness": "0/0", "author": "annie"}, {"rating": 4.0, "review": "Easy installation. Works great", "verified": true, "helpfulness": "0/0", "author": "Gabriel"}, {"rating": 1.0, "review": "Save your money. The antenna is so feeble I can't keep a connection to save my life. I spend more time rebooting the stick than I do watching anything with it.", "verified": true, "helpfulness": "0/0", "author": "L. Hamilton \"wyld4books\""}, {"rating": 3.0, "review": "The only problem I had with the Fire TV Stick was that I was unable to stream from Acorn TV.  It worked fine on Netflix and Amazon, however, I really enjoy Acorn TV and ended up exchanging my Fire Stick for a Roku device.", "verified": true, "helpfulness": "0/0", "author": "laruth"}, {"rating": 5.0, "review": "Made my smart tv smarter, worth the money if you have Prime. Disappointed with the game controler cost.", "verified": true, "helpfulness": "0/0", "author": "Anthony Drzewiecki"}]