[{"rating": 5.0, "review": "Love this! Should have bought this when it first came out!", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Son loves it. Easy for even me to use as a techno-stup!  We've had a lot of fun with all of the choices.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "It's simple and simply awesome. Could not be easier to install and the on screen instructions walk you through a few setup sets. Love it!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Hight \"novelist wannabe\""}, {"rating": 4.0, "review": "I was looking for a simple interface that my wife could use to enjoy programming. She is not comfortable with computers and tablets, but found this to be a very easy way to expand her programing choices in an easy fashion.", "verified": true, "helpfulness": "0/0", "author": "Mike Coppock"}, {"rating": 5.0, "review": "As of right now, this product is great! I have had no connection issues, connected easily with minutes, and signed into my accounts easily. It is a great product if you are a prime member.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The remote is the most horrendous thing ever. I needed to enter my wifi password and I press up to click on a letter and it goes to the right. I click down and it goes up. I click on a letter and it clicks the one next to it. Can you imagine how frustrating it was to sit there and keep clicking and not get the letter you want. After about an hour I gave up. I couldn't even use the firestick because I couldn't enter my password because the remote wouldn't work properly!", "verified": true, "helpfulness": "0/0", "author": "Ronald Swingle"}, {"rating": 5.0, "review": "Love this product, have been watching shows on Netflix, Amazon Prime etc on my TV set, easy to set up and easy to use. Would recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "C. Bonham \"Transman book demon\""}, {"rating": 5.0, "review": "Works awesome", "verified": true, "helpfulness": "0/0", "author": "Ben A."}, {"rating": 5.0, "review": "Super easy to install and use, have access to so many more.shows and movies!", "verified": true, "helpfulness": "0/0", "author": "Bonita Haines"}]