[{"rating": 5.0, "review": "Love it!! You guys have really done your homework. The app (in itself a great idea) is very quick and more responsive than I had imagined. The simplicity of the entire experience is impressive from plugging it in to downloading your first movie takes less than a minute. Recommending it to everyone who asks.", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 5.0, "review": "Amazingly easy to use for this technophobe, and at such a low price.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Kathleen McGowan"}, {"rating": 3.0, "review": "The fire stick works great as far as programs and movies, but the internet connection isn't too stable. My TV is in the same room as the router and should keep a steady connection but it loses touch with the stick. Maybe wih that being improved it will be 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Bryant D. \"Put in 100% always.\""}, {"rating": 5.0, "review": "It is great to be able to take the Fire TV Stick from room to room and continue watching a movie or TV series.", "verified": true, "helpfulness": "0/0", "author": "Mystery Reader"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Rhonda barnes"}, {"rating": 5.0, "review": "Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Kathy Powell"}, {"rating": 5.0, "review": "The Fire Stick is easy to set up and use. I'm so happy that I have one place to go for all the shows and movies I like to stream and I can now watch them on my HD TV rather than my laptop. Great product!", "verified": true, "helpfulness": "0/0", "author": "Roberto Aponte"}, {"rating": 5.0, "review": "I GOT THIS IN THE MAIL LAST NIGHT, SET IT UP IN JUST ABOUT 4 MINUTES & STAYED UP LATE LAST NIGHT WATCHING TV SHOW & I EVEN PLAYED A FEW GAMES. I AM IN LOVE WITH THIS DEVICE! IN MY OPINION IT'S BETTER THAN THE CHROME CAST. I CANNOT WAIT TO GET HOME AND HOP BACK ONTO THE FIRE TV :)", "verified": true, "helpfulness": "0/0", "author": "M. M. Jones \"MO\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Connie lambeck"}, {"rating": 2.0, "review": "First unit delivered worked for about a month then completely died. After contacting Amazon support another unit was sent to replace original. Again, after about a month it completely died. In both instances part of my own diagnostics was to reinstall older Roku unit that Fire TV Stick was meant to replace. Roku worked without a hitch.Fire TV Stick was OK as long as it was working (some limitations on channel selection options vs Roku) but seeming to have to replace every month or so while the Roku has be flawless for more that 2 years, got old real fast. Returned and will purchase another Roku when the time comes", "verified": true, "helpfulness": "0/0", "author": "NC User"}]