[{"rating": 5.0, "review": "better than apple... always works", "verified": true, "helpfulness": "0/0", "author": "Claus R. Martel \"Claus Martel\""}, {"rating": 5.0, "review": "Saves me $200 a month on my cable bill. We were only watching less than a handful of channels from our cable provider. This allows us to keep up with the few shows we follow (which we would have to DVR anyway so the one day delay doesn't make a difference) and my toddler can still have her Disney shows. I like that we can watch movies and since we are prime members there are many out there for free to watch. Glad we purchased this! Works great with no lag. Easy to use. Couldn't ask for anything better at this time. We had roku and hated it. This is much better.", "verified": true, "helpfulness": "1/1", "author": "Natasha Holcomb \"Love Great Deals\""}, {"rating": 5.0, "review": "Bought two Fire TV--nice; hesitant about getting a little stick. It surprised me!", "verified": true, "helpfulness": "1/1", "author": "Honu"}, {"rating": 5.0, "review": "I was considering purchasing a smart tv but was on the fence about replacing a tv that worked well. Instead, we decided to give the Amazon Fire stick a chance and we are glad we did.I can easily access Amazon Prime videos, listen to music, watch Hulu or Netflix. It comes with a remote so I don't have to use my computer which is nice. I use it more than my chromecast because of this.I wish it came with the voice remote but for the price, it can't be beat.", "verified": true, "helpfulness": "0/0", "author": "skydivegirl24"}, {"rating": 5.0, "review": "Pros: amazing for Netflix (Netflix on my TiVo was terrible); easy to install and operate; sets up in a few minutes; intuitiveCons: none", "verified": true, "helpfulness": "1/1", "author": "New Horizon Academy"}, {"rating": 5.0, "review": "Love it.  I'm cutting the cord (cable) and this works great in conjunction with Tablo for OTA HD broadcast.  I get over 30 channels free!", "verified": true, "helpfulness": "0/0", "author": "JAMmin"}, {"rating": 5.0, "review": "Excellent product for the money! I do wish it had the same music features as the app on my phone.", "verified": true, "helpfulness": "0/0", "author": "John H Griner"}, {"rating": 4.0, "review": "Hey, i have tested out the Amazon Fire TV Stick some period of time and it was great.Unfortunately it wasn as good as the Chromecast but both Sticks got Pros and Cons!If you whant to know what the Pros and Cons of the Amazon Fire TV Stick are check out my Video:https://www.youtube.com/watch?v=rE1mxsjkgP4In this Video i compare the google Chromecast with the Amazon Fire TV Stick!Best RegardsMachete", "verified": true, "helpfulness": "0/0", "author": "Machete"}, {"rating": 5.0, "review": "Easy setup, quickly loads Hulu Plus and Netflix. Much more reliable than the streaming blu-ray player I was using before.", "verified": true, "helpfulness": "0/0", "author": "Terri"}, {"rating": 5.0, "review": "Enjoying it so far!", "verified": true, "helpfulness": "0/0", "author": "Lici"}]