[{"rating": 5.0, "review": "We have had a 55\" Samsung Smart TV for about 3 years and this particular model didn't have the Amazon Prime app and would not let me add it. Amazon fire stick to the rescue! This beats buying a new TV, which is what my husband suggested. I got this on Amazon Prime Day for the sale price of $24 instead of the $39. If you are wondering...it is worth the $39 price. It was easy to install and saved us $$$ on a new Smart TV. We watch it all the time!", "verified": true, "helpfulness": "0/0", "author": "backer"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "nicole"}, {"rating": 3.0, "review": "It works ok", "verified": true, "helpfulness": "0/0", "author": "Melody Williamson"}, {"rating": 5.0, "review": "TL:DR - Worth the buy, would buy another/recommend.Pretty cool device. I have a chromecast as well and while both have their pros and cons I think this one fits the \"main living room\" or \"main tv\" needs in a better way. The remote/app that lets you control the interface is nice (plus have an interface..) Tons of apps inside making any TV truly feel like a smart TV.I'll say that not everything streams as seamlessly as a chromecast and by that I mean just getting it to stream - quality appears to be the same (if they aren't already technically). What I'm getting at is that one app on your phone/device may recognize the chromecast and not see the Fire stick to cast to it. Also though there isn't anything I've come across that I couldn't stream to the TV.Also I went with a firestick because I had 2 chromecasts and they would randomly piss me off, more or less. Sometimes they'd work, sometimes they wouldn't. I'd have to reconfigure them or set them up while no changes in my network or devices were made. So far with this Fire stick that hasn't been an issue at all.One thing I was slightly upset about is that I'm an avid Plex user. If you're unfamiliar a google search would prove a better explanation but in short Plex is a media server/service in which yourself or others can host video files (anything, TV/HBO/Movies) and then it is streamed to your desired device. Well on a chromecast streaming this from a phone doesn't require any form of payment or anything. On the Fire stick I had to pay $5 to enable playback to my \"device\" (fire stick) otherwise video stops after one minute. Maybe I was too impatient to find a work around but I did have 1000 amazon coins which I was able to place towards the 499 coin one time fee to enable the unlimited playback. I think the chromecast somewhat \"tricks\" plex or something and it just plays the video without that 1 min check ever coming up.I probably rambled a bit but ask questions if needed and I'll try to answer them. I think it's a great device and I really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Charge"}, {"rating": 4.0, "review": "A very good device that allows you too easily watch videos from Amazon, Netflix and Youtube.The device has gotten jumpy a few times.  I had to unplug it to make it better.But overall a very good product", "verified": true, "helpfulness": "0/0", "author": "Marty S. Wiggins \"MWiggins\""}, {"rating": 4.0, "review": "Easy to use and set up.  Sometimes when streaming it pauses", "verified": true, "helpfulness": "0/0", "author": "Lynn R. Heacock"}, {"rating": 5.0, "review": "nice to be able to watch things with this!!  I don't have cable, so with my prime account, this opened up a new library of things to watch!!", "verified": true, "helpfulness": "0/0", "author": "junkster"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "leia o'donnell"}, {"rating": 5.0, "review": "Great product and variety of programs available, especially under Prime!", "verified": true, "helpfulness": "0/0", "author": "Serg"}, {"rating": 5.0, "review": "Awesome piece of equipment to stream media. Can't beat for the price. The fact that Amazon has built their Eco system off open-source tech made this the best buy for me.", "verified": true, "helpfulness": "0/0", "author": "Vlopezev"}]