[{"rating": 5.0, "review": "Full disclosure - I purchased this for the $19 sale. It is easily worth $40.The interface is snappy, loading times are super fast, and the content is outstanding. I have Netflix/Pandora One and this has replaced the \"Smart\" TV apps I have by virtue of just being a better all around device.", "verified": true, "helpfulness": "0/0", "author": "J. West"}, {"rating": 5.0, "review": "I wasn't sure I needed this gadget, because I already had Netflix and YouTube through my blue ray player. Although I didn't have Amazon Prime or any of the other sites, I had gotten along fine without them. The picture is more clear when I use the Fire Stick. The remote really does make watching shows easier. I am very pleased with the purchase.", "verified": true, "helpfulness": "0/0", "author": "G. Robinson \"razorback\""}, {"rating": 4.0, "review": "Required additional technical support with the stuttering audio but they addressed the issue fairly rapidly.", "verified": true, "helpfulness": "0/0", "author": "A. Youngblood"}, {"rating": 5.0, "review": "I love this", "verified": true, "helpfulness": "0/0", "author": "christine nehls"}, {"rating": 5.0, "review": "Bought when we were about 8 months pregnant and tested it out, she loves it. We love it. We have a chormecast but we added this when we got amazon prime. Wish we had on all our tvs.", "verified": true, "helpfulness": "0/0", "author": "bgburk"}, {"rating": 5.0, "review": "Easy to set up and easy to use. We don't miss satellite tv one bit with this product.", "verified": true, "helpfulness": "0/0", "author": "nono"}, {"rating": 1.0, "review": "Purchased the Fire TV Stick because I travel alot for business. This was a small item I could pack in my briefcase. The only problem is the unit doesn't work in hotels where the wifI uses a portal system. If you plan on using it for travel you will need a mobile Hotspot.", "verified": false, "helpfulness": "3/3", "author": "Corbin Asbury"}, {"rating": 4.0, "review": "So far, I m liking the ease of the device, moving in and out of apps swiftly is cool. My only real issue that has occur was the loading factor the spinning circle takes a bit of time .. sometime my device drop out. ...overall its easy to move from one TV to another", "verified": true, "helpfulness": "0/0", "author": "WAYNE"}, {"rating": 4.0, "review": "I bought it strictly to access youtube for music videos and concerts.  I downloaded the app for free and have been very pleased with the product, but I don't use any of the other apps.  Don't have time for movies or games.  It did not work on my HDMI3 port on the TV but worked fine on the HDMI2 port. Don't know why.  Setup was painless and all worked fine.", "verified": true, "helpfulness": "0/0", "author": "Evert Boer"}, {"rating": 4.0, "review": "if you're in the amazon eco system such as using kindles, kindle fire etc.  this is a low cost solution.  Does appear that Amazon is intentionally providing a higher quality prime video experience as other apps not amazon related tend to buffer when I know I have absolutely no other lag on my network and computers streaming not buffering at same time.  I then switch to an amazon prime video & buffering completely stops  I'm suspicious  however over a very good product for the price", "verified": true, "helpfulness": "0/0", "author": "RonPaulrocks"}]