[{"rating": 4.0, "review": "Excellent device, but since I already had a smart tv, I did not feel it provided me the alternative that I had hoped it would.", "verified": true, "helpfulness": "0/0", "author": "Flashtek"}, {"rating": 5.0, "review": "Wow - Plug and Play within 13 minutes - really !!", "verified": true, "helpfulness": "0/1", "author": "Donboy"}, {"rating": 5.0, "review": "I bought this to use in hotel rooms. I ended up liking it WAY more than I expected to and actually use with my bedroom TV now instead of the PS4 we were using. If you need something for streaming, this is a great buy. I'll be buying one for my sister for Christmas. Even if you don't have Amazon Prime, it's great to use for Netflix. I have my Prime account, Netflix account, HBO Go account and Spotify account on all mine. I'm sure I could find more apps to add to it with more time and use. I've had a few people say to me \"but I don't have a prime account\". Although the \"main\" feature (the home screen) is for Amazon Instant Video, you don't need a prime account. The Netflix app alone makes this worth it. I was weary about this but bought it during Prime Day. If you're even remotely considering it, I think it's worth a try.The only thing that caught me off guard was that it needs to be plugged into an outlet while it's plugged into the TV. I don't know about things like that so I guess that makes sense. I just didn't understand that by the description or photos or anything. I had to move a few power strips around (or you could purchase a longer universal power cord if the supplied cord doesn't reach) but I made it work.", "verified": true, "helpfulness": "1/1", "author": "K. Gillis"}, {"rating": 5.0, "review": "This is the easiest way to get to Netflix and I can purchase movies right away! Love it!!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Ruthiejo \"roxanne reader\""}, {"rating": 5.0, "review": "We purchased the Amazon fire TV stick for a spare TV we have in the porch.  I'm not really a fan of the strange interface compared to the Apple TV we use in our living room, which has a cleaner more user friendly interface. Amazon prime video is the main reason we chose this over getting a second Apple TV, but we also like the portability of the fire stick so we can take it in the camper.", "verified": true, "helpfulness": "0/0", "author": "Heather F"}, {"rating": 3.0, "review": "It didn't work on my TV so I sent it back. I gave it three stars so I wouldn't hurt their rating.", "verified": true, "helpfulness": "0/1", "author": "Hank"}, {"rating": 5.0, "review": "very easy to use.", "verified": true, "helpfulness": "0/1", "author": "Kumar Verma"}, {"rating": 5.0, "review": "Love it so much I ordered one for each of my family", "verified": true, "helpfulness": "0/0", "author": "sandy byrne"}, {"rating": 5.0, "review": "this is great, i have used it every night without a single problem", "verified": true, "helpfulness": "0/0", "author": "Richard Collins"}]