[{"rating": 5.0, "review": "love it may buy more", "verified": true, "helpfulness": "0/0", "author": "Michael Patterson"}, {"rating": 5.0, "review": "Great item, user friendly", "verified": true, "helpfulness": "0/0", "author": "Bruce F. Walker"}, {"rating": 4.0, "review": "Its good mostly use the apps like youtube and netflix. Its awesome to have a remote and not rely on my phone like i would with a chromecast ( also a very good product for what it is) However i dont use the amazonprime video at all so im not using it to the full extent", "verified": true, "helpfulness": "0/0", "author": "yeahdudeguy"}, {"rating": 5.0, "review": "A wonderful little piece of electronic equipment.", "verified": true, "helpfulness": "0/0", "author": "Riikonen"}, {"rating": 5.0, "review": "Use it everyday, by far my best purchase", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 5.0, "review": "We are all about this...I was worried it wouldn't work with the remote from behind the television but no problems. It's wonderful...you won't regret this purchase as the whole FAMILY can control what's on television now.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "ANother great product from Amazon. I love that I don't have to stack one more appliance on my TV stand. plugs nicely into the back of the TV and works great. I bought one for our second TV and considering one for the office.", "verified": true, "helpfulness": "0/0", "author": "Mac"}, {"rating": 5.0, "review": "I DIDN'T ORDER THIS EITHER!! !!!!!", "verified": true, "helpfulness": "0/0", "author": "Bill Meeks"}, {"rating": 3.0, "review": "Not as good as the Fire TV.  The UI stutters a lot, as does content.  I notice that it seems to occur after watching for a while, and the unit itself gets quite warm.  This may be a defective unit, or common to the design itself.  In all fairness, my 2 Fire TV devices are hard-wired, while this unit is wireless.  I do have other wireless devices that do not have any issues with streaming.If you have an available Ethernet connection and can spend the extra $, spring for the full version.", "verified": true, "helpfulness": "0/0", "author": "Brent L. Bordelon"}, {"rating": 5.0, "review": "product as described shipped quickly", "verified": true, "helpfulness": "0/0", "author": "gram \"Rose L\""}]