[{"rating": 5.0, "review": "Amazing... Switched to Fire Stick from Roku and best thing I've ever done", "verified": false, "helpfulness": "0/0", "author": "Trevor Johnson"}, {"rating": 4.0, "review": "Ok so we stream with this almost 24/7 since we bought it last month, but now it is getting really frigging infuriating because the picture freezes and the sound keeps going, until briefly they sync back up for a couple of minutes then its back to screwing the pooch again instead of performing its job and providing me with television I can watch without wanting to hurl something at the screen every few minutes. ....is this crappy performance as good as it gets or is this stick a frigging lemon?", "verified": true, "helpfulness": "0/0", "author": "John Crouson"}, {"rating": 5.0, "review": "We love it so far!  Lots of shows and movies to choose from...especially if you have a Prime membership.  Very fast too!", "verified": true, "helpfulness": "0/0", "author": "ChicoMom"}, {"rating": 5.0, "review": "Awesome product and awesome shipping!!!", "verified": true, "helpfulness": "0/0", "author": "RhondaK"}, {"rating": 1.0, "review": "Weak wireless reception,  even with 100 mbps streaming download and Lynksys router. I purchased 3 for three separate tvs, all pause and hangup on every show (Netflix,  Prime and music). Very frustrating. High expectations,  low results.", "verified": true, "helpfulness": "0/0", "author": "Rich Crafton"}, {"rating": 5.0, "review": "I really like being able to take advantage of all my Prime perks.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product. No problems.  It is working well.", "verified": true, "helpfulness": "0/0", "author": "Vickery W. Flemming"}, {"rating": 5.0, "review": "Quick delivery.  Easy to set up", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Too hard to hook up and when I finally got it to work, found that everything I downloaded to watch would spiral in an internet connection loss and would have to restart the internet connection.  Got ROKU from neighbors house to try and it worked without any internet connection problems.  It may work for same room internet but not for wifi in my home.", "verified": true, "helpfulness": "0/0", "author": "Wendy J Fischer"}, {"rating": 3.0, "review": "I would of rated this 5 stars but every time I watch a movie/show it keeps interrupting the movie to reload itself.", "verified": true, "helpfulness": "0/0", "author": "Leola Barker"}]