[{"rating": 4.0, "review": "I wish it had HBO go but all around it is great!", "verified": true, "helpfulness": "0/0", "author": "Kayla Hansen"}, {"rating": 5.0, "review": "Awesome product! Easy to work.", "verified": true, "helpfulness": "0/0", "author": "charlie foster"}, {"rating": 5.0, "review": "Easy install, works great", "verified": true, "helpfulness": "0/0", "author": "the shadowman"}, {"rating": 5.0, "review": "Love these. We've purchased three now, one for each room we have a TV.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Works great for Netflix and amazon prime my daughter loves it in her room.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've researched a lot of streaming devices, for gifts and for myself.  I settled on a Roku for my roommate for Christmas, but for me I wanted something different.  The Chromecast wasn't an option, so I was down to AppleTV & Fire TV Stick.  The Fire TV won out by a long run.  You can't add apps to the AppleTV, nor play games on it, nor does it have a Prime app.  I got my Fire TV Stick today and absolutely love it!  It's faster with more storage (which helps with a lot less buffering), and is a breeze to navigate.  (I found the Roku navigation a bit jumbled.)  The remote reaction is a lot better than that of AppleTV or Roku, as well.  It's the best value for the power out there.", "verified": true, "helpfulness": "0/0", "author": "Ernest"}, {"rating": 5.0, "review": "Works perfectly for my father, who is more comfortable with a TV remote than a mouse and keyboard.", "verified": true, "helpfulness": "0/0", "author": "Adrian Orihuela"}, {"rating": 4.0, "review": "Lots of good features. Batteries difficult to install on remote. Would definitely recommend to friends.", "verified": true, "helpfulness": "0/0", "author": "stutsman"}, {"rating": 5.0, "review": "Works well right out of the box.  Easy to set up and start using.  My internet is a little slow so I am looking forward to upgrading to cable internet.", "verified": true, "helpfulness": "0/0", "author": "Dale L Marshall"}, {"rating": 5.0, "review": "Works way better than the box that it replaced, and the price is right.  Easy to setup and use.  I have only used it to watch Amazon prime, Netflix, and WatchESPN.  So far I haven't experienced any buffering and I have no complaints.", "verified": false, "helpfulness": "0/0", "author": "Andrew Duvall"}]