[{"rating": 5.0, "review": "a lot smart technologies in a small extremely affordable package. and you can jailbreak it to add more features such as live tv", "verified": true, "helpfulness": "0/0", "author": "V.K."}, {"rating": 4.0, "review": "Love Amazon prime and thus is a great addition. Only draw back is it loses connection frequently, a buffed network card in the device would be a godsend! Overall can't complain about the responsiveness and ease of use of the fire TV stick", "verified": true, "helpfulness": "0/0", "author": "Derek Treadway"}, {"rating": 4.0, "review": "So far so good! I have Neo TV and that does not give access to Amazon Prime. Now I do and that is exactly what I wanted:)", "verified": true, "helpfulness": "0/0", "author": "Debby"}, {"rating": 5.0, "review": "This is the best thing since slice bread, I'm still getting use to it. Yesterday I added a lot of free apps like yoga, Pilates, HBO Togo, but silly me I thought the HBO channel was free my daughter told me,  yes the app is free but you have to buy a subscription to HBO that right there should tell you I'm not a tech WIZ. Anyway it's easy to install (I used Quentin Moore's installation video as a guide, Moore is a top Amazon reviewer) and navigating between  menus is a no brainer once you get the hang of it. It was also great getting the complete set-up including batteries in one box meaning I did not have get up and go to the store for extra parts. If Amazon (my favorite place) is listening a free\" how to get the most from your stick manual\" should be included and the Amazon Fire Stick should be larger, but that would mean bigger boxes and more shipping costs for Amazon. In this imperfect world I'm satisfied with what I have. Ciao", "verified": true, "helpfulness": "0/0", "author": "DC"}, {"rating": 5.0, "review": "Works amazingly. I mainly use it for netflix marathons. Love it.", "verified": true, "helpfulness": "0/0", "author": "Caitlin"}, {"rating": 5.0, "review": "We love our Fire TV stick, great for kids and Great grandparents!", "verified": true, "helpfulness": "0/0", "author": "Brandi Cullipher"}, {"rating": 4.0, "review": "I do like the convenience. I have an Apple tv in the other room, and I'd have to say the Fire Stick remote and function is not as intuitive as the Apple tv. I was also a bit disappointed to find out some programming is only available to Android users. I have an HBO Go subscription but it's only accessible for those using an Android phone. I have an iPhone. Oh well. The Fire Stick is a nice bit of technology and a fun toy to have. I still give it 4 stars. Good job.", "verified": true, "helpfulness": "0/0", "author": "Planet77"}, {"rating": 5.0, "review": "Love no more cable bills", "verified": true, "helpfulness": "0/0", "author": "Barbara Davis"}, {"rating": 5.0, "review": "We bought this instead of a Smart TV.  I am so glad we did, love watching all my PRIME shows.", "verified": true, "helpfulness": "0/0", "author": "Mandy"}, {"rating": 4.0, "review": "Over all love it, but I didn't give it 5 stars because some times the screen/ picture freezes, but the sound keeps going.", "verified": true, "helpfulness": "0/0", "author": "Daniel Reinoehl"}]