[{"rating": 3.0, "review": "Useful if you plan to make accounts with all the streaming companies or have prime. Otherwise looks like more than what you actually get. Also not shown is the cable you have to plug into the stick to power it. Although it makes sense I wish I had known. Probably would have upgraded for the inconvenience.", "verified": true, "helpfulness": "0/0", "author": "naomisensei"}, {"rating": 5.0, "review": "Works great... easy to set up.", "verified": true, "helpfulness": "0/0", "author": "D. Gurley"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "detrius harris"}, {"rating": 3.0, "review": "The fire stick is great if all you want is a way to watch Amazon Prime videos or music. If you are planning to use it for Netflix or Hulu, don't bother. Runs perfectly for prime content, but if you try to use it for anything else, it lags and freezes constantly.", "verified": true, "helpfulness": "0/0", "author": "Sarra"}, {"rating": 2.0, "review": "Works fine but very small easy to lose.", "verified": true, "helpfulness": "0/0", "author": "mrdemaria \"Gabe\""}, {"rating": 5.0, "review": "This is an amazing product.  The wireless radio and remote work much better than Apple TV.  The iOS remote control app is also better than the Apple TV remote app.  Works great with Amazon Prime and Netflix.  I highly recommend this product!!  In fact, I did recommend this to my neighbor and she bought one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My second one. This one we take in the RV. Usually works with park WiFi.", "verified": false, "helpfulness": "0/0", "author": "Cindy Engelbertson"}, {"rating": 5.0, "review": "This easily replaced the chromecast in our house.  I use the remote exclusively as I don't want to be tethered to my phone.  The remote is nice, simple, and functional.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 3.0, "review": "Disappointed that even with my prime membership most things have a fee. I like that i can use it to access Netflix.", "verified": true, "helpfulness": "0/0", "author": "agatesd"}, {"rating": 5.0, "review": "I love this! I'm about to cut back on my cable bill. Quick to set up, easy to work.", "verified": true, "helpfulness": "0/0", "author": "Ritab"}]