[{"rating": 4.0, "review": "The fire stick is working out for me I use it everyday....20", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "Absolutely love this! don't need cable anymore!", "verified": true, "helpfulness": "0/0", "author": "AntoniaNicole"}, {"rating": 5.0, "review": "Best purchase I've ever made hands down. Awesome streaming for a great price! Not to mention you can take your fire stick anywhere with you! I love it and I'll be buying more for holiday gifts! Fast streaming as well as a quick and easy setup. Highly recommended if you love to stream movies, music, games, and more! So much to choose from especially if you're a prime member. Definitely a good buy.", "verified": true, "helpfulness": "0/0", "author": "Rae"}, {"rating": 5.0, "review": "Easy to setup and use. Great for Amazon Prime videos.  Remote is a so intuitive. Will get one for Mom.", "verified": true, "helpfulness": "0/0", "author": "Deetechi"}, {"rating": 1.0, "review": "Always freezes and loses connection with wifi. Have to restart it every time I use it. I am usually very happy with all things Amazon but I will be returning this and using my chromecast instead.", "verified": true, "helpfulness": "0/0", "author": "Julia Spencer"}, {"rating": 4.0, "review": "Love the fire stick, just wish there were more live streaming included with it.", "verified": true, "helpfulness": "0/0", "author": "Dan chesny"}, {"rating": 5.0, "review": "This is a very much used item.  It is great to watch or catch up shows we were unable to watch through the week.  My siblings, parent and in-laws are now all using their Amazon Fire TV sticks and/or boxes on a regular basis.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"tah565\""}, {"rating": 4.0, "review": "works very well.", "verified": true, "helpfulness": "0/0", "author": "dan peterson"}, {"rating": 5.0, "review": "This is awesome.  I use it every night, and I don't miss cable in the slightest.  I have my choice of music, TV, or movies, and have gotten subscription to apps that provide what I want to watch.  Installation is a breeze.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "GorillaChief"}, {"rating": 5.0, "review": "WORKS GREAT WITH AMAZON PRIME", "verified": true, "helpfulness": "0/0", "author": "Victor Baird \"VICTOR\""}]