[{"rating": 5.0, "review": "Works better than expected.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "I was pleasantly surprised with the Fire Stick's performance as I have a relatively slow internet connection using DSL.  The picture is clear and steady with only an occasional millisecond long stop & go.  Much of the content is free to Prime subscribers however, there are charges on some of the programs.  When and if Amazon starts broadcasting some of the news stations I might cancel my cable service!  :-)", "verified": true, "helpfulness": "0/0", "author": "John M. Fickler"}, {"rating": 5.0, "review": "Extremely easy to use and love that there is a remote to control it.", "verified": true, "helpfulness": "0/0", "author": "MrsHill08"}, {"rating": 5.0, "review": "I bought this as a gift for my mother and I cam say loves it. She loves a lot of the series that netflix and hulu and it really works well.", "verified": true, "helpfulness": "0/0", "author": "Jonathan C. Howard \"Music Lover\""}, {"rating": 1.0, "review": "Very disappointing.  It operates erratically.  It keeps cutting out and stopping.  I have not been able to watch anything successfully.  The problem is not with my connections since everything else in my homes operates fine.", "verified": true, "helpfulness": "0/0", "author": "Burton Levine"}, {"rating": 5.0, "review": "Very nice addition  to my TV experience. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "robert wagner"}, {"rating": 5.0, "review": "I give it five stars ! Works great with my my television  that did not cost much . Receives great picture.", "verified": true, "helpfulness": "0/0", "author": "Marguerite Cummins \"marguerite Cummins\""}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Tony Brackins"}, {"rating": 5.0, "review": "Fantastic item! Fire TV stick works perfectly with our flat screen at the lake cottage! It pairs flawlessly with the Sling TV app. And...it was such a deal too! Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Loretta Timer"}, {"rating": 5.0, "review": "Great accessory for Amazon Prime users....plug and play on any TV in the house via your Wi-Fi network.", "verified": true, "helpfulness": "0/0", "author": "R. Morse"}]