[{"rating": 1.0, "review": "Wasn't really worth it and I sent it to my inlaws to use.  I hooked up a mac mini to the tv and use it for my internet on the tv needs because i don't have a smart tv.  This is a good option if you are technologically inept like my inlaws but have a tv and wifi and know how to use a remote and don't have your head too far up your rear.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Netflix gets a bit glitchy and videos will time out even though my internet is streaming just fine.  Never had that problem before the firestick.  The pros outweigh the cons so far though.", "verified": true, "helpfulness": "0/0", "author": "LH"}, {"rating": 1.0, "review": "We found the Fire TV Stick to be essentially worthless as whatever it offers in programming is available via our satellite system. Unfortunately I was suckered into purchasing the Stick as a Christmas present based on the advertised attributes......with hindsight, this approaches a scam!. The system will be returned today for full credit.", "verified": false, "helpfulness": "0/0", "author": "ogmt"}, {"rating": 2.0, "review": "Worked for about a month...then stopped. Mirroring from kindle won't work at all...", "verified": true, "helpfulness": "0/0", "author": "TBG"}, {"rating": 5.0, "review": "Love this thing!  so much for only $39.", "verified": true, "helpfulness": "0/0", "author": "Jon R Aspgren"}, {"rating": 3.0, "review": "I pre-ordered the Fire Stick when it was first announced and have been using it for a couple months now. I also have an Apple TV but could only watch Prime content through my Wii which was always a hassle. I think if you're looking for a more affordable way to stream content (Prime in particular) this isn't a bad route to go, but it's not flawless.Interface - Sorry Amazon, but Apple has you beat here. The menu and navigation options are just way too clunky and I hate selecting an app from a list and then having to select \"open\" to actually launch the app. There's too much visual clutter, and little to no customization options. The settings menu is poorly laid out and you have to dig through everything to find what you actually want. It took me 5 minutes to figure out how to do a software update - Apple TV this takes less than a minute.Physical Device - No complaints here. I like the remote now that I have all of the buttons figured out and the HDMI extender was helpful. This was more of an oversight on my part but they don't make it clear in any of the images that the stick uses a power cord, so be prepared to use up another outlet and hope that it's close enough to reach since the cord is pretty short.Playback/Software - This is where they should have spent more time in dev rather than beta testing on the pre-order customers. Apps are constantly freezing and crashing (you have to go in to settings and force quit an app if it freezes - even disconnecting the power doesn't reset it) and playback has constant stopping or stuttering. I never have these issues with Apple TV so I know it's not my internet connection. Sometimes the menu will completely disappear and I can't select anything and the only fix is to power cycle until it finally resets. Worst experience so far? I was down to the last 4 minutes of a 90 minute show on Netflix and it froze. I could go back to the menu, but if I selected the episode again it stayed frozen at that spot. Force quit the app, cleared the cache and all app data (at least 4 or 5 times) and STILL it wouldn't play. I finally had to power cycle and when I selected the episode it restarted at the beginning. I tried to fast forward to that spot again and it kept skipping to the end and starting the next episode. I finally gave up and rewatched part of it but it just shouldn't have to be that frustrating to get through a TV show.If need a way to watch Prime content and have another option for Netflix/Hulu etc. then this isn't a bad companion device, but as a primary device for all streaming content I'm not sure it's worth the headache.", "verified": true, "helpfulness": "1/1", "author": "Sarah E. Williams"}, {"rating": 3.0, "review": "I was only of the lucky Prime members who scored the Fire TV Stick at half price pre-launch. We had a Chromecast on our guest room tv, but it's hard to use due to the lack of remote. I was sold on the Fire Stick because of the fact that it has a remote control.Setting it up was challenging. It is supposed to come programmed with your Prime Account attached, but this is not made clear in any of the literature. I spent over a half hour trying my login information, my husband's login, and even my parents', each time being told that the information was incorrect. Finally I called Amazon. The customer service agent was very helpful, and we were able to fix the problem in less than ten minutes.The interface on the television is clunky. It feels as though the designers didn't bother looking at the interfaces of Roku, Apple TV, or other similar products to figure out the best practices. Instead it feels like Amazon just really wanted to push Prime TV. That's totally fine and understandable. But it's even hard to search what's available through Prime! Actually it was hard to just figure out how to search at all. The easiest thing to do is add shows/movies to your watch list on a desktop rather than search through the Fire Stick.At the end of the day, I didn't pay much for something that delivers what I want - a system with a remote that allows me the ability to watch internet tv. But if I am paying full price for this and could get a Roku instead, I would absolutely choose to get a Roku.", "verified": true, "helpfulness": "1/1", "author": "bananabelle"}, {"rating": 3.0, "review": "Fire TV stick works great for streaming online content like Prime Movies, Netflix etc. However, I bought this to be able to stream videos from my own server using Plex. When I stream a video under 1GB the video works fine. Anything over 1GB will either pause and buffer or stop and say that the video cannot be played.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Amazing! Have no complaints and would recommend to everyone", "verified": true, "helpfulness": "0/0", "author": "S"}, {"rating": 5.0, "review": "I like using the Fire TV Stick better than the apps on my smart TV. The connectivity is great and I am very happy to have this product. The only negative thing I would say is that the remote is a little cheap.", "verified": true, "helpfulness": "0/0", "author": "K. Scott"}]