[{"rating": 5.0, "review": "LOVE IT!!!!", "verified": true, "helpfulness": "0/0", "author": "Austin Howell"}, {"rating": 5.0, "review": "Product functions exactly as advertised. Very satisfied with purchase.", "verified": true, "helpfulness": "0/0", "author": "Robert D. Battishill"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "padreRichard"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Lou Occhicone"}, {"rating": 5.0, "review": "easy to set up & use, my picture is clearer, love it///", "verified": true, "helpfulness": "0/0", "author": "barbara kubicina"}, {"rating": 5.0, "review": "We like it very much but have run into some trouble turning it off!", "verified": true, "helpfulness": "0/0", "author": "Gem"}, {"rating": 4.0, "review": "I got this for free, by paying for the sling subsription three months in advanced. I really like it. The interface is smooth. Netflix, Amazon Instant Video and YouTube all look crisp in 1080p. That coupled with SlingTV This is my set top box for the TV in my bedroom. I use the FireTV in the living room. Its basically the best you could buy for 40 dollars. The only place I took off a start was for the remote. The buttons were mushy and compared to the  FireTV box, the remote felt super cheap.", "verified": true, "helpfulness": "0/0", "author": "Noor K."}, {"rating": 5.0, "review": "We are loving the fire stick, sooo user friendly and easy to operate!", "verified": true, "helpfulness": "0/0", "author": "Emily"}, {"rating": 5.0, "review": "Great system to access prime tv or Netflix with.  Received as a gift and we really like it.  Would recommend to buy.", "verified": true, "helpfulness": "0/0", "author": "K. Purchase"}, {"rating": 5.0, "review": "Have had it for only a couple weeks, but it works great !  It was a snap to install, and is easy to navigate....we are enjoying Amazon Prime offerings, and Netflix as well, since we have an account with them.", "verified": true, "helpfulness": "0/0", "author": "Maureen D. Attardi"}]