[{"rating": 5.0, "review": "Simply amazing and easy to use. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Jessica Ann Puckett"}, {"rating": 5.0, "review": "I bought 2 of these when Amazon pre-released them. I added some apps to them and started watching many shows. I turned off my satellite TV because I don't need it anymore since I have the Fire TV Stick. I've used others like Google Chromecast, Raspberry Pi, and other Android boards but with the Fire TV Stick and remote, it gets the most use in our home. I highly recommend the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Brandon King"}, {"rating": 5.0, "review": "Awesome product. Easy to use", "verified": true, "helpfulness": "0/0", "author": "juanice hayslip"}, {"rating": 5.0, "review": "The fire stick is amazing! Easy to use and understanding the set up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Easy way to make a plain tv, into a smart tv!", "verified": true, "helpfulness": "0/0", "author": "sierra nichole travis"}, {"rating": 5.0, "review": "The greatest purchase ever! I let my mom check it out and now she's buying one.", "verified": true, "helpfulness": "0/0", "author": "Lindsay Patton \"~Lindsay~\""}, {"rating": 5.0, "review": "Plug it in and start streaming!  Great product!", "verified": true, "helpfulness": "0/0", "author": "Elaine Samson"}, {"rating": 5.0, "review": "Great product!  Easy to use.  It's sometimes disappointing to follow a TV series and then come to the next season when they want to charge for viewing; but we just switch to a different series.  Great value!", "verified": true, "helpfulness": "0/0", "author": "pubkings"}, {"rating": 5.0, "review": "Very good device.  I enjoyed it so much I bought a second.  Everything on it works and works fast, doesn't get much better or easier.  I have two complaints that I'm sure could be easily fixed with a software upgrade.  The first being with my 2nd device I had to sit through the intro video again.  The second complaint is that it will often hang while verifying the pin to watch a show.  Having kids with access to the TVs this is something that matters a lot to me.  Only fix I've been able to find is disable the pin security.", "verified": true, "helpfulness": "0/0", "author": "Curtis Ashcroft"}, {"rating": 4.0, "review": "I like this but it is VERY hard to get the batter cover off the back.", "verified": true, "helpfulness": "0/0", "author": "Tami Taylor"}]