[{"rating": 5.0, "review": "Love it\"", "verified": true, "helpfulness": "0/0", "author": "Paul E. White, Jr."}, {"rating": 4.0, "review": "I love that it has a remote and is easy to control.  The amount of apps/channels available are very good for what I use it for.", "verified": true, "helpfulness": "0/0", "author": "Dominique Smith"}, {"rating": 1.0, "review": "This item did not work for me. It kept buffering so I was not able to see any movies, etc. I'm not sure why this happened. I could have been my internet service but I don't know. I will get my service and router checked to see if either was the problem.", "verified": true, "helpfulness": "0/0", "author": "Joseph Andrews"}, {"rating": 5.0, "review": "So far we are enjoying our Fire TV Stick. We are watching movies and TV shows from Netflix, Hulu, and Amazon.", "verified": true, "helpfulness": "0/0", "author": "Susan Brantley"}, {"rating": 4.0, "review": "Pretty cool little device. Turns your normal flat screen into a Smart TV, which is awesome because I don't have cable. I was originally going to get a Smart TV so I could watch Netflix and stuff on it, but they were considerable more expensive than the standard HDTVs in comparable size, picture quality, and brand. So I bought a standard HDTV, and this instead. The menu format is quite different then any Smart TV I've ever used, but functionally, it's more or less the same thing.The only downside is that you do have to have an Amazon account with your 1 click settings set up a certain way, and with a valid billing address in order to download (the free) apps that allow you to use Netflix and such. That's a little ridiculous to me for a free app, but it is what it is.", "verified": true, "helpfulness": "0/0", "author": "Tonya Mosher \"forkeh\""}, {"rating": 3.0, "review": "Works very easily from my tablet.  There are pauses frequently through the movie (slow connection?) and it uses so much data I can't use it much...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It is ok so far.  I haven't seen a lot of recent movies.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am very happy with the Amazon fire stick!", "verified": true, "helpfulness": "0/0", "author": "Ralph K. Swackhammer"}, {"rating": 5.0, "review": "Love it, I'm going to buy 2 more. The hell with high priced cable.", "verified": true, "helpfulness": "0/0", "author": "Brad Tomasek"}, {"rating": 5.0, "review": "I love my Fire TV Stick! I already was a Prime member. So I can watch Amazon Prime streaming movies and TV programs. I started watching Downton Abbey and have already gotten to season 4 binge watching! There are other shows I have found to add to my watch list. The games are fun. No regrets!", "verified": true, "helpfulness": "0/0", "author": "Lisa A. Richardson"}]