[{"rating": 5.0, "review": "Works just great", "verified": true, "helpfulness": "0/0", "author": "Debbie Yingling"}, {"rating": 4.0, "review": "First and Foremost the device has met my expectations and more, that is easily worht 5 stars - I don't know about longevity and how it will hold up ive only had for a couple months now, wireless works great connected on 5ghz across my house, the reason i am docking off a star i probably should do 2 stars is the menu is so convoluted and cluttered without a way to stream line and hid stuff you dont want without rooting the device..Unless there is away and i just havent figured it out. but the device itsself and operation is great actually gonna order another one and a fire tv.", "verified": true, "helpfulness": "0/0", "author": "Corey"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Donna Jankewicz"}, {"rating": 5.0, "review": "Couldn't watch all the shows I missed. So many movies to catch up on.Just watching my FREE Prime movies saved a lot of money vs going to the movies.So easy to connect and use.", "verified": true, "helpfulness": "0/0", "author": "John J Nieves"}, {"rating": 5.0, "review": "It's great to be able to do more things since I don't have cable.", "verified": true, "helpfulness": "0/0", "author": "Edna Fitler"}, {"rating": 5.0, "review": "I purchased this for my daughter so we wouldnt have to rent yet another cable box.I was extremely impressed by this little stick.  For $39, it is such a great deal!!", "verified": true, "helpfulness": "0/0", "author": "Tammy L. Rodriguez \"Tammy\""}, {"rating": 2.0, "review": "There are far more free movies and TV shows on Netflix. Every time I find something I want to watch, and I am a Amazon Prime member, I have to pay. Disappointed!", "verified": true, "helpfulness": "0/0", "author": "Tony Juays \"Tony4x4\""}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Sally Collins"}, {"rating": 1.0, "review": "I can't broadcast content that I can only find in my browser.  Millennials consume TV through their internet/browsers.  I don't use all the other unnecessary apps that come with it.  In my opinion, it's a disappointment compared to Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Oscar Sorcia"}, {"rating": 5.0, "review": "I love it! Has everything you possibly want from a smart tv purchased from the store and much more. Definitely worth the price of converting a regular flat screen tv.", "verified": true, "helpfulness": "0/0", "author": "Lailah J. Holloman"}]