[{"rating": 1.0, "review": "Im sorry I bought it, if my friends dog didnt destroy all the packing I would have returned it.  You tube is awful to use...Bravo tv is not even supported, I dont even have the \"fling\" button on my Amazon tablet to use.  You have to pay for every single thing.  I put on Crackle and other sites, cant even watch a show, it stops and gets blurred, this is not worth it.  I am better off hooking up my table to the tv like I used to, way better.", "verified": true, "helpfulness": "0/0", "author": "Kitchen Cook \"Kitchen Cook\""}, {"rating": 2.0, "review": "Disappointed that there are commercials in movies viewed in \"Crackle.\"", "verified": true, "helpfulness": "0/1", "author": "Chris S"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Dennis Kirk"}, {"rating": 5.0, "review": "I cancelled my cable after receiving my fire tv stick. The only problem is that I cannot get Hulu without paying for the plus package.", "verified": true, "helpfulness": "1/1", "author": "Jenn"}, {"rating": 4.0, "review": "The Fire TV Stick is great in terms of value as I only got it for 19.99 during the 3 day sale. But if I were to pay for it at 39.99, I would think it is a little pricey, as it still has a lot of bugs and crashes often. I'd probably pay more to get the Fire TV instead for a better build quality.", "verified": true, "helpfulness": "0/0", "author": "SK2O"}, {"rating": 1.0, "review": "At first I loved the fire stick.  It was easy to set up and connect.  But then came the problems.  It has trouble playing anything other than Amazon Prime videos.  When I try to use Netflix it is laggy and rarely loads, same thing with Showtime Anytime.  I know it isn't my internet connection because when I use my computer or other device it works just fine.  Even episodes on prime instant video are starting to get buggy and slow down now as well.  I hope this gets fixed soon or it is going to be thrown in the trash.", "verified": true, "helpfulness": "1/1", "author": "Steve"}, {"rating": 4.0, "review": "Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 1.0, "review": "Not what I expected , you have to pay for everything not satisfied at all !!", "verified": true, "helpfulness": "0/0", "author": "Mitch Soto JR"}, {"rating": 5.0, "review": "What an excellent gadget. It works really good and one can even use it as an on and off switch for the TV.", "verified": true, "helpfulness": "1/1", "author": "Kalif Omar"}, {"rating": 4.0, "review": "Software feels a bit unstable, but not too bad (early generation).I'm disappointed at the lack of Google Play movies and tv support (though not surprised).  Until this supports Google or Google supports Amazon (or I want to bother with a Roku), I have to have two devices.My real issue is just how the interface is designed for AMAZON so heavily.  It feels like you have to go out of your way to do anything unless you focus on Amazon services.  Netflix, Hulu+, etc; they really feel more like afterthoughts.", "verified": true, "helpfulness": "0/0", "author": "Steven J."}]