[{"rating": 5.0, "review": "Do you have to have Wi Fi in your house?", "verified": false, "helpfulness": "1/1", "author": "Jeanne Olague"}, {"rating": 5.0, "review": "I picked up a Fire Stick as part of an introductory/pre-order offer from Amazon. Installed easily, including linking to my home network. Streaming speed is very acceptable in my situation (across a house and down one level). The menus are intuitive and easy to use. I actually have installed this on a TV that had built in wifi and internet apps, but with a really horrible user interface. Now I just use the stick to by pass all the prior shortcomings.", "verified": true, "helpfulness": "1/1", "author": "Rock of Ages"}, {"rating": 5.0, "review": "Goodbye cable.", "verified": true, "helpfulness": "1/1", "author": "Connie Strand"}, {"rating": 5.0, "review": "Works great.  Remote did suddenly stop working though.  Have written Amazon to see if I can return just the remote but so far no reply.", "verified": true, "helpfulness": "1/1", "author": "Mark Shadid"}, {"rating": 5.0, "review": "This is great! Our kids got us this for Christmas. It replaces the Chromecast we had. The fire stick has everything the chromecast has and more. This has too many features to name. We haven't used all of them. Our first night, we played some games with our tablets as remotes. We love watching YouTube videos, Netflix, amazon movies and TV shows. It's pretty cool. We'll be dropping our satellite service soon, but I don't think we'll miss it at all since we have this.", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer \"mish\""}, {"rating": 4.0, "review": "Loads quickly. Quality picture. I find it does sometimes easily drop my wireless connection.  Great value for the cash.", "verified": false, "helpfulness": "0/0", "author": "zach"}, {"rating": 4.0, "review": "I enjoy having this on my computer.  The only thing I have is that the buffering seems to be off at intervals, so the sound will continue, but the image freezes.  Great way to access Prime content, as well as Hulu, Netflix and other content providers.  Simple to use remote is great.", "verified": true, "helpfulness": "0/0", "author": "M. Learned"}, {"rating": 1.0, "review": "Keeps losing internet connection even though the signal is \"very strong\". When it doesn't lose connection it buffers every 2 minutes or so making viewing very aggravating - Returned it for a refundPerhaps I had received a unit that had a defect and would have been happy had I taken a chance on an exchange versus a refund ... I will never know", "verified": false, "helpfulness": "2/2", "author": "Richard F Sheehan"}, {"rating": 4.0, "review": "Handy, handy, handy", "verified": true, "helpfulness": "0/0", "author": "C. Sheffer"}, {"rating": 5.0, "review": "Awesome device!", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}]