[{"rating": 5.0, "review": "Made my media use much easier. Plug in installation; now I have multiple choices, price was right as a Prime member.", "verified": true, "helpfulness": "0/0", "author": "Buck"}, {"rating": 5.0, "review": "I needed to plug it in, let the software download fail, unplug for at least 30 minutes (multiple short disconnects didn't help), and then register. I have a Chromecast also. I think I am going to like this one more.", "verified": true, "helpfulness": "0/0", "author": "Reston, VA"}, {"rating": 5.0, "review": "Easy to navigate and add applications.  Very pleased with the device.  Like the ability to add photos and videos from other mobile devices to the Amazon cloud and then view them from the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Gregory Jackson"}, {"rating": 1.0, "review": "Slow and not enough  apps...save your money and buy a roku", "verified": true, "helpfulness": "0/2", "author": "Bob"}, {"rating": 1.0, "review": "The remote included with the stick did not function properly. It was either non-functional or would cycle through the menus at lightning speed. I replaced the batteries just in case but still having the same issues. I suspect a button may be stuck. I contacted Amazon support and they agreed to send a replacement however, I would not be able to receive it until mid January when they are expected to be back in stock. I will update my review then if anything changes.", "verified": true, "helpfulness": "3/3", "author": "James R. Stauble Jr."}, {"rating": 5.0, "review": "its quick its fast but all the app which work on Kindle i.e sho and starz don't work yet for all provider but for amazon content its best though few of my friends are complaining about netflix and youtube has issue but that's it its a solid item", "verified": true, "helpfulness": "0/0", "author": "Raghav Swami"}, {"rating": 4.0, "review": "it worked quiet well. However, I was hoping to Stick would allow me to download the Viewster App, if it does I haven't found it. Over all the Fire TV Stick was worth my purchase. I purchased two, I intend to give one to a fried as a Christmas present.", "verified": true, "helpfulness": "0/0", "author": "jlggfn"}, {"rating": 4.0, "review": "Easy to setup and use", "verified": true, "helpfulness": "0/0", "author": "Donald L Alexander"}, {"rating": 3.0, "review": "Netflix app is great.  Would have liked to use the Android apps I'm familiar with from the Play Store to take advantage of my NAS, but found a comparable app on the Amazon App store.  Instructions say to use the provided power adapter, but it seems to work with just USB power.  One of the better HDMI sticks out there, but I still find myself favoring my Chromecast.", "verified": true, "helpfulness": "0/1", "author": "BRIAN"}, {"rating": 5.0, "review": "Great job Amazon. Other than the steps to download, it's fast and crystal clear streaming. I love the phone app with speech!", "verified": true, "helpfulness": "0/0", "author": "Ihersh \"spoll\""}]