[{"rating": 3.0, "review": "I was expecting to be able to use more of the apps that i use on regular basis.  There are many apps, but only a couple that i use, such as netflix.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Flawless steaming right out of the box. Good little remote and well designed interface.", "verified": true, "helpfulness": "0/0", "author": "GG \"GG\""}, {"rating": 5.0, "review": "I like the Fire Stick and find  it easier to use than my Roku but it doesn't get as many channels. Still a good buy.", "verified": true, "helpfulness": "0/0", "author": "RoxannLincoln"}, {"rating": 3.0, "review": "works fine except from time to time in middle of streaming a movie it freezes and says no Internet connection . . . when by every measure the home wireless system is broadcasting as strongly as ever.  Very frustrating.  Makes it a difficult choice to start watching a movie since can never be sure it  will finish.  And if do start a movie, hard to enjoy since always waiting for the non-existent crisis that shuts it down.", "verified": true, "helpfulness": "1/1", "author": "ronc"}, {"rating": 5.0, "review": "Love that I can finally watch streaming movies and shows on a bigger screen.  Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Brich"}, {"rating": 5.0, "review": "Where have you been all my life? Great selection of shows and movies!", "verified": true, "helpfulness": "0/0", "author": "Lyn"}, {"rating": 5.0, "review": "Overall good but still figuring it out. Some apps and stations hard to use.", "verified": true, "helpfulness": "0/0", "author": "Linda L Dieckhoff"}, {"rating": 4.0, "review": "Not crazy about the OS. I feel that Amazon pushes prime conten in your face. It's hard to navigate around the prime content.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Riddle"}, {"rating": 5.0, "review": "Works great!!!", "verified": true, "helpfulness": "0/0", "author": "AS2003"}, {"rating": 5.0, "review": "I absolutely love the fire stick", "verified": true, "helpfulness": "0/0", "author": "maquita collins"}]