[{"rating": 1.0, "review": "It does not work properly. It keeps saying there is no internet connection. I have 40 speed in internet, everything else working great except the stick.", "verified": true, "helpfulness": "0/0", "author": "Miguel VAzquez"}, {"rating": 3.0, "review": "Haven't figured it out yet.  Working on it.", "verified": true, "helpfulness": "0/0", "author": "Diana Fuller"}, {"rating": 4.0, "review": "I haven't tried this yet but it looks easy enough & interesting", "verified": true, "helpfulness": "0/0", "author": "Judith A Matsko"}, {"rating": 5.0, "review": "I would say that the Fire Stick exceeded my expectations.  I have two Apple TV's, and while I like that I can connect with my iTunes library to view pictures, play music, etc. I do not like that the only way I can get it to connect is to unplug it each and every time.  I installed the Stick and it simply worked doing what it's supposed to do.  The definition of videos streamed seems to be clearer than the Apple TV, which surprised me given the difference in price between the units.  Thinking of buying another stick.", "verified": true, "helpfulness": "0/0", "author": "Tradervic"}, {"rating": 3.0, "review": "Amazons selection of movies and TV show could be a lot better for prime members", "verified": true, "helpfulness": "0/0", "author": "terry"}, {"rating": 4.0, "review": "This is a great product. Easy installation, easy interface, easy to download apps. The comparable fire phone app makes typing in login and password information a breeze. The most disappointing part of this has nothing to do with the stick its self but with Comcast cable company. If you were looking forward to watching showtime and HBO you are out of luck as a Comcast customer because Amazon and Comcast have yet to agree on terms.", "verified": true, "helpfulness": "0/0", "author": "Gwelling18"}, {"rating": 1.0, "review": "Not sure what the benefit is of this firestick. We have to pay for HD quality and have limited access to movies so… why did we buy this again?  Perhaps I'm not using it correctly. When I called customer support, I didn't get a lot of help.  :-(", "verified": true, "helpfulness": "0/2", "author": "Pat White"}, {"rating": 4.0, "review": "its amazing. I love it!", "verified": true, "helpfulness": "0/0", "author": "walid"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Bloom4mich"}, {"rating": 4.0, "review": "My wife is the television watcher and she likes it.", "verified": true, "helpfulness": "0/0", "author": "fishstick"}]