[{"rating": 4.0, "review": "like it very much , might get another one for old TV", "verified": true, "helpfulness": "0/0", "author": "RAUL A RIVERA"}, {"rating": 4.0, "review": "Nice to have one.", "verified": true, "helpfulness": "0/0", "author": "joeneil reyes"}, {"rating": 1.0, "review": "Very unhappy with this item, I have good to excellent wifi readings on this and it wont hold the signal.Have tried it next to the router and at distance and no difference. Spends more time buffering than it does playing.Tried contacting Amazon Cust. Service and no results. I am glad i got it for 19.99 because at 39.99 I would have been terribly upset instead of just genuinely dissatissfied. If there was a warning to be sure of it was that they picked Gary Busey to hawk this sea shell, I would have to be as crazy as he is to ever consider buying this.I will sell mine for 19.99 you can get it for half off the selling price since IT DOESN'T WORK....", "verified": true, "helpfulness": "0/1", "author": "raymond beers"}, {"rating": 3.0, "review": "I plan to update this... but it worked great until after Christmas.  I feel like an update happened and now it won't connect to my internet. I will get back to this after I talked to my provider. It seems fishy because my apple TV, Playstation and our computers,  phones, pads have no issue connecting.", "verified": true, "helpfulness": "0/1", "author": "Darla Green \"Aeon D Flux\""}, {"rating": 5.0, "review": "Absolutely love it. Replaced my AppleTV 2. Wished it implemented AirPlay.", "verified": true, "helpfulness": "0/0", "author": "David D. Campana \"Campana\""}, {"rating": 4.0, "review": "I think i expected more; however it does work and so far I am satisfied.", "verified": true, "helpfulness": "0/0", "author": "Irwin Bass"}, {"rating": 4.0, "review": "It is great.....Especially if you have Prime!  Very easy to set up!", "verified": true, "helpfulness": "0/0", "author": "BBrooks"}, {"rating": 5.0, "review": "The fire stick is amazing I love it everyone should get it and its saves me money I took off most if my movie channels on cable which now my bill is mucher lower. Thanks  Amazon for the Amazon Fire Stick", "verified": true, "helpfulness": "0/0", "author": "cynthia french"}, {"rating": 5.0, "review": "One of the best things I've ever purchased. I disconnected my cable because I don't need it anymore! Netflix, YouTube, Flixter, Pandora, games, everything I need all in one place!", "verified": true, "helpfulness": "0/0", "author": "Tiffany L. Taylor"}, {"rating": 4.0, "review": "I love the fire stick! We had been streaming tv through our Wii, but this is much faster with a much more user-friendly interface. My one and only complaint is that the font sizes aren't changeable in the Fire interface. I have  37\" tv in the bedroom that we view from about 15', and it is hard to read at times.", "verified": true, "helpfulness": "0/0", "author": "Jenjhl"}]