[{"rating": 5.0, "review": "I cannot believe how much a remote matters and makes a difference. The addition of said remote allows the FireTV Stick to function as a separate device, all on its own, independent and unchained from having to rely on any other device to supply the content. Grabbing the different apps was a bit confusing at first and doesn't really make sense in my mind as to why these apps didn't come preloaded (not a deal-breaker by any means) but once I had them up and running, the experience was fantastic. Full HD picture and sound and really quick uptake for grabbing the stream (at least from Netflix/Plex). The update process at first run was simple and worked great so I'm thankful for that. I love being able to grab my PLEX library without having to rely on my phone/tablet (and thus wasting those devices' batteries in the process). Netflix worked great. PRIME is the biggest draw to this device (as opposed to a Chromecast) and if you have it, you certainly could not pick a better device. BUT even if you don't have prime (or mooch off someone else's Free Shipping and thus don't get the Kindle and Video parts) this device still has a lot of selling points. I don't play any of the games so I can't speak to that but it's there. I did grab it for the initial $19 so that was fantastic but even at $39, this device is a great buy! I would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Skinner"}, {"rating": 4.0, "review": "This has allowed us to expand our TV viewing into other rooms, without having to pay cable or satelite companies Xtra money each month for 2nd or 3rd TV equipment.  It does not stream live television, but is a good alternative for kids rooms for movies and series off of Netflix, or Amazon.  There are parental control features you can set on the device itself, but when I activated them it caused the system to bog down and freeze up waiting for PIN Validation, that never validated.  Once I removed the Parental Controls, the system worked fine.Many of the other subscription services like Netflix, etc, have controls themselves.  So if you have Netflix, you can control kids viewing through your Netflix account and acces it over the Fire TV Stick.I love being able to expand the TV viewing to other rooms, without having to pay money each month to my satelite provider.It does require a good fast internet connection for smooth, uninterupted viewing", "verified": true, "helpfulness": "1/1", "author": "Connie Martelle"}, {"rating": 4.0, "review": "device as advertised. should have better instructions on setup", "verified": true, "helpfulness": "0/0", "author": "Jim Brannan"}, {"rating": 1.0, "review": "When I first got my Fire TV Stick, I used it a lot and LOVED it.  It worked great and I happily gave it a 5-star rating.  How things can quickly change.  Suddenly, my Fire TV Stick will not keep a network connection.  The thing is 3 feet from my router and it can't find the Wifi signal.  I have to unplug it and let it sit and then plug it back in to get it to work.  It's getting to the point where I don't even care about plugging it back it.  I've gone back to my Roku player.When I first purchased my Stick I kept saying, \"WOW!  I got this thing for $19!!!!!\"  Now my motto has become, \"Well, at least I only wasted $19.I would definitely give this device a PASS.  I've never had a bad experience through Amazon before, but I guess there's a first time for everything.  I'm so disappointed.", "verified": true, "helpfulness": "0/0", "author": "Deeter \"Dex\""}, {"rating": 4.0, "review": "Works Great!  Mirroring to my Galaxy S5 still hasn't worked and is the reason for only 4 stars.", "verified": true, "helpfulness": "0/0", "author": "T-Mac's Book Review"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Arthur S Brooks Jr"}, {"rating": 5.0, "review": "This is a great device, but to correct those who have said screen mirroring does not work with a Galaxy S5, it DOES work, as of 1/15/15. I just tried it and it is perfect. You have to go into the Fire Stick settings and select mirroring under 'display & sounds'. Then, you select screen mirroring from your S5. The first time I tried it, it had trouble connecting, but worked fine after that.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 1.0, "review": "I absolutely love the Fire TV Stick interface and find the way it navigates between titles to be swift and very pleasant.However, the one big flaw I can't seem to resolve is studdering.  When I play Netflix for instance, titles will randomly studder for maybe .5 seconds every 3-4 minutes.  This completely ruins the viewing experience.  For anyone thinking \"Oh this is probably the user's internet\" or something like that... Let me tell you I have multiple Roku devices, Smart TVs, WD HD Lives, etc that all stream Netflix (and other services) flawlessly and without issue.  Even more, I have business class internet with very high speeds and IT happens to be my profession.  I've tried moving the stick to my 2.4 GHz network and my 5 GHz network to no avail.  I've also tried bringing the stick to a friend's house on their internet and ran into the same issue.This is most definitely a hardware issue or software issue with the Fire TV Stick and unfortunately for me it is a deal-breaker.  Amazon - if you can resolve this problem I would be happy to try the stick again as I did find the interface to be much better than any of my other devices.  I'm typically very happy with Amazon but this experience has been somewhat of a nightmare.", "verified": true, "helpfulness": "6/7", "author": "Jeffrey S Simon"}, {"rating": 5.0, "review": "I am so glad I purchased this when it first came out!  The Fire TV Stick is so easy to use with shows/movies immediately viewable upon opening.  The remote is highly-functional and tiny.  I have been an Amazon Prime member for quite some time but rarely watched the movies, etc.  Since getting the Fire Stick, I use it almost daily!  My only regret so far is that I did not buy more of them when the price was more affordable.", "verified": true, "helpfulness": "0/0", "author": "Paige A. Stone"}, {"rating": 5.0, "review": "Really great unit!!! Easy setup and very user friendly", "verified": true, "helpfulness": "0/0", "author": "Roger A. N Robotham"}]