[{"rating": 5.0, "review": "Before buying the Fire TV Stick, I was using my Chromecast quite a bit and really liked what it had to offer. I decided to give Amazon's streaming HDMI stick a shot and I'm glad I did!Even though I have a PS4/Xbox One connected to the TV that the Fire TV Stick is connected to, I end up using the Fire instead (for streaming). It's very snappy for the most part. In comparison to the consoles it'll bring up pretty much anything faster. What it won't do faster is bring up a youtube video than a chromecast...but other than that, this thing is awesome.Side note, not really a big fan of the android app that you can control the fire tv stick with...but maybe that's just praise to the remote it comes with.", "verified": true, "helpfulness": "0/0", "author": "Joe Peterson"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "NVR"}, {"rating": 5.0, "review": "Everything that I expected and more. Thank you.", "verified": true, "helpfulness": "0/0", "author": "kbaybayan"}, {"rating": 3.0, "review": "Fire tv box and fire tv stick are incompatible with Mitsubishi TVs. Don't even bother! On the bright side, it works with my Samsung TV. After talking to customer Service THREE TIMES, they finally own up to the incompatibility.", "verified": true, "helpfulness": "1/1", "author": "MathCoachJulie"}, {"rating": 3.0, "review": "It works, and gives me access to all the major service providers, Hulu, Netflix, Amazon Videos. My issue is that the advertisements (TV) make it seem as if you just plug it in - and it works, which is TOTALLY FALSE - LIE LIE LIES! The first thing I noticed when unpacking the fire stick is that there is a mini usb port. You must connect this to an available usb port, or use the included usb power adapter. If you don't, the stick WONT WORK! I would have loved to have a stick that doesn't need to be powered externally, but maybe that was just a dream.Otherwise, the included remote works easily, and the app that you can download is easy to work. The first time you start everything you'll get a short video, and instructions on how to start. Once I logged in, everything was seamless and easy.", "verified": true, "helpfulness": "1/1", "author": "David"}, {"rating": 4.0, "review": "AMAZON FIRE STICK WORKS GREAT.  Only complaint is the USB power wire needs to be plugged in to a wall outlet. The USB power from the TV does not supply enough power to run direct from the TV. So if you have a TV on the Wall like I do with no wires showing . You have to run a power wire down the wall to an outlet. Other than that the product works great..", "verified": true, "helpfulness": "1/1", "author": "William H. Oconnor \"Bill\""}, {"rating": 5.0, "review": "initial setup was a bit of a pain, kept restarting and failing, worked fine after the 5th or 6th try.", "verified": true, "helpfulness": "0/0", "author": "rob chacon"}, {"rating": 3.0, "review": "Firstly, I am comparing this to the Amazon Fire TV box. Right off the bat the remote control does not have voice search features. It doesn't even have a microphone built into it. I think you have to pay around $30 extra for that. In that case you might as well get the Amazon Fire TV box. But I knew about this before I ordered it. In fact I am one of the people who bought two of them for half off during its early release. Other then that, the remote works as intended but feels much more like cheap plastic compared to its microphone version remote which looks, grips and feels better.Secondly, I can tell immediately that the Fire Stick is much slower to respond to remote button clicks then the Fire TV is. I assume because the Fire Stick has a lesser processor which is the Broadcom Capri 28155 dual-core 2xARM A9 with 1GB ram VS Amazon Fire TV which has a nice Qualcomm Krait 300 quad-core 1.7Ghz processor with 2GB ram. If you have no idea what that means, it means the Amazon Fire TV Box is much faster then the stick. However video playback on the stick doesn't seem to be bothered by the lesser processor. I do notice that if I leave the stick for several days and come back to it, its very slow starting up but after a couple minutes it starts moving fast again or is just reboots automatically because it just crashes. I believe it may be forced into an interactive governor but I haven't checked. Google Android Interactive Governor if you want to learn more about what that is.Thirdly, I had a hard time getting the Fire Stick to work with adobe digital surround sound with my receiver. When I would play any Amazon movie, the sound wouldn't come through. However, playing a video through Hulu Plus or Netflix worked fine. So I tried out my Fire Box on the same receiver and it worked fine. I got in touch with Amazon tech support and talked to a leader, which has something to do with their position with support. Her name was Jasmine. A very helpful leader. I would suggest asking for her. After a couple weeks of her calling me to check in and waiting to hear back from the back end developers, they knew of the problem and eventually down the road it would be fixed. For some reason, in the Fire Stick settings when adobe digital surround sound is selected and used in conjunction with certain receivers the sound from the Amazon library don't produce sound but Netflix and Hulu Plus work fine. I was told it would be fixed in a possible distant firmware or software upgrade. For the time being, I have to switch to the 2.1 sound setting which means I cannot enjoy my 5.1 sound system in my theatre room. I could always hook up the Amazon TV box but I got it perfectly situated in my other TV room.Lastly, there is no USB port on the stick. So for those who are rooting and taking advantage of the USB port or for those who just want to use it for a keyboard or mouse on the Amazon Fire TV, can't happen on the stick.And one more thing to add. The app that allows you to use your phone for navigating the Fire Stick and to use voice search is extremely hit and miss. You talk into your phone and it may or may not type out the words you said on the screen and if it does its 5 seconds later. The TV Stick is new and I am sure people will submit enough feedback to get these problems resolved.Honestly, I would spend the extra money and get the Amazon Fire TV box. You pay a bit more but you get a more superior product. And if you root the box and take advantage of the USB port the possibilities are endless.", "verified": true, "helpfulness": "1/1", "author": "Jay"}, {"rating": 3.0, "review": "The Good:* A great selection of media and apps, very easy to set up and use, the included remote works well.The Bad:* The Plex client isn't the greatest.  It occasionally loses connection with the server and there are a lot more anomalies and artifacts on HD video than I get using Plex on a Roku 2 from the same source.* There is almost too much emphasis on sourcing video from Amazon over any other source, though I suppose that's to be expected.* Movie Rentals are grossly overpriced, but that's not Amazon's fault.* The FireTV Stick requires more power than my TV's USB port would deliver, requiring me to use the included wall wart instead.The Ugly:* The Miracast implementation is horribly broken (no surprise being that its based on Android where Miracast is also horribly broken).  I am not sure Amazon has much interest in fixing it as it is working enough to work OK with other Fire devices.  But it will not allow for sharing a Windows display or many non-amazon phone screens, or many non-amazon tablets.  Miracast is a standard and it should be supported as such and work universally.  Breaking it for competitors devices or just not fixing it is unacceptable.  Hopefully a FireTV update is forthcoming to address this issue.", "verified": false, "helpfulness": "0/0", "author": "Jared Nelson"}, {"rating": 5.0, "review": "Works great!  Love being able to watch my amazon prime without having to get out the Wii remotes!", "verified": true, "helpfulness": "0/0", "author": "Jessica Faulkner"}]