[{"rating": 4.0, "review": "It loses one star for cutting out every now and then.  The good news is that it resumes after a second or two without losing anything.  I especially appreciate being able to see all of my photo's and videos that I have taken on my Fire phone.  They go automatically to the cloud and are easily found and played using the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Stuberg"}, {"rating": 5.0, "review": "Wish I would have gotten when Oromo came out, great item, ditching time warner asap!", "verified": true, "helpfulness": "0/0", "author": "Margaret Bond"}, {"rating": 5.0, "review": "It did exactly what the description said. It was amazingly simple to set up and is very easy to use. I am having so much fun exploring all the options.", "verified": true, "helpfulness": "0/0", "author": "J. Hogan \"J9\""}, {"rating": 4.0, "review": "Was hoping it would work like chrome cast. It is easier to search for shows on my iPad than transfer to the chrome cast.  I will give 5 stars if they can do that.", "verified": true, "helpfulness": "0/0", "author": "jamalf"}, {"rating": 5.0, "review": "Works perfectly. Side loaded kodi without a problem", "verified": true, "helpfulness": "0/0", "author": "Raine"}, {"rating": 4.0, "review": "Own 4 of them. Use them in my vacation homes. Ease of use is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this product, it's awesome quality hardware and software.  I love the free month of Amazon Prime that comes with it too!  I def think it has converted me to an Amazonian, as I find myself watching movies, shopping, watching my favorite cable channels via SlingTV.  My only wish would be that it could somehow offer local channels or have apps that could sync and do so.  If anyone knows of any do share! Other than that, No complaints my whole family loves it! And Lord Willing, I'm def signing up for Prime as soon as my free month is over!", "verified": true, "helpfulness": "0/0", "author": "Feminina"}, {"rating": 5.0, "review": "I found the Fire TV Stick to be much more user friendly and technically more advanced than Chromecast.  My only wish list is I hope you program the features with Netflix as well as you have with Amazon.", "verified": true, "helpfulness": "0/0", "author": "rjh"}, {"rating": 5.0, "review": "Love it. Simple to set up. Works like a charm. I will probably get rid of some of my cable now.", "verified": true, "helpfulness": "0/0", "author": "rckstarchk"}, {"rating": 5.0, "review": "I love the Amazon Firestick!!", "verified": true, "helpfulness": "0/0", "author": "Maureen Anne Moughalian"}]