[{"rating": 5.0, "review": "So easy even a 72 year old like me can figure it out. Now I can take my Netflix (and a bunch of other neat stuff) with me wherever I go!", "verified": true, "helpfulness": "0/0", "author": "Donald A. Smith, Jr."}, {"rating": 2.0, "review": "I decided to try this because I basically got it for free. I have 2 Roku streaming sticks and wanted to see how the Fire TV Stick compared. Overall it is a disappointment. The interface is clumsy and it is slow. One of my wife's and my biggest gripes is that to activate and deactivate the parental control, you must log in to you Amazon account via computer to enable and disable. This is absurd. The power/USB cable plugs into the side rather than the back end which gets in the way of plugging it into some TVs. Amazon provides a 3 inch HDMI adapter for such instances, but why not just design it properly in the first place. overall, I would not by one of these. You are better off with a Roku or Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Mark I."}, {"rating": 5.0, "review": "just excellant", "verified": true, "helpfulness": "0/0", "author": "James Simpson"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "shawn Beveridge"}, {"rating": 5.0, "review": "Amazing product! Was worth every penny considering what the competition was offering for their price", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "GrammyDi210"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Parnell Pass"}, {"rating": 4.0, "review": "Great hardware to have specially if you have a Prime membership. The mobile phone and tablet application as a remote control is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Ever"}, {"rating": 5.0, "review": "A friend told me \"I have to get one on these\".  I wondered if it was another pet rock, but after a financial windfall I decided to take a gamble.  For a small price tag this really packs a great value.  The build quality of the hardware and firmware, are exceptional. It would seem Amazon is trying to re-define the entertainment experience, and with such a reasonable well thought out product, they might.  It's not hard to use, even for people who are technically challenged.  Personally, I like the quality of the whole user experience.  It's hard to put in text with the little remote.  Amazon's  fireTV app turns my tablet into a remote with keyboard, and it's FREE!  This uses Bluetooth, so my remote works anywhere.  The whole setup is tiny, and if I were to travel, it would have to accompany me.  It's been over 2 weeks since my cable box has entertained me, forcing me to evaluate if I need it anymore.", "verified": true, "helpfulness": "0/0", "author": "Nausicaan"}, {"rating": 5.0, "review": "Works great....Amazon adding features is a plus!", "verified": true, "helpfulness": "0/0", "author": "Walter Rusciano"}]