[{"rating": 3.0, "review": "I love the product, and when it's working, it's fantastic. The reason I can't give it 4 or 5 stars is that it freezes far too often. About once a day everything will freeze up and it will either restart itself or I will have to unplug it and plug it back in to get it running again.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 2.0, "review": "I was not impressed that I have to use a power adapter for this.  If that was the case I would have just kept the fireTV.  I was trying to go wireless.  also because the unit is behind my TV, the remote does not work will with this at all.  I press a button once and the unit thinks I am am holding it down.  I am not impressed with this at all, I feel like I wasted my money.  The programming, however, is great.  Its just the hardware that is lackluster.", "verified": true, "helpfulness": "0/0", "author": "Kobayashi Maru"}, {"rating": 5.0, "review": "Works great, I have cut the cable cord and now use Amazon Prime and Netflix as my main sources of entertainment.", "verified": true, "helpfulness": "0/0", "author": "George B. \"georgeb944\""}, {"rating": 5.0, "review": "I'm going to write basically the same exact review that I left for the Amazon Fire TV, because the Fire Stick is just as terrific a product. This device is simply awesome - especially if you're a Prime member. The only time you will EVER not like this device is being forced to watch the 2 minute guide after the initial setup, but it's a small price to pay for such a great streaming device.The stick and remote are both sleek, and the design of the OS is terrific and smooth. The voice commands work exceptionally well, and the quality of video is outstanding. You could leave the Fire TV exactly as it comes from Amazon and be more than happy with it, but if you're looking to cut ties with cable TV, you can put this box on steroids in about 10 minutes by sideloading Kodi (formerly XBMC) onto the Fire TV Stick. Anyone can do this by following some simple instructions (Google for more info), and I'd highly recommend it myself. Wireless performance is terrific, and with the latest OS upgrades, it makes it easier to bring this with you on the road and use in hotels (you can now accept wireless disclaimer pages for accessing a network, whereas previously you could not).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The picture is darker than normal lighting such as TV from antenna.", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "I think its great that duel band is the best 👌👍👍👍👏 Gus from Bushwick Bklyn", "verified": true, "helpfulness": "0/0", "author": "Gustavo Lopez"}, {"rating": 5.0, "review": "best parches ever", "verified": true, "helpfulness": "0/0", "author": "victor barros"}, {"rating": 5.0, "review": "Love it!!!!!  Its so easy & small. I use ro use an old xtra xbox game systemto watch Netflix in my room that was big and kinda a messy pain. Now this simple little stick does the same rhong plus so much more....I LLOVE IT & PLAN TO BUY ANOTHER FOR THE GUEST ROOM & KIDS ROOMS.", "verified": true, "helpfulness": "0/0", "author": "Eliblythe"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Scott moose"}, {"rating": 5.0, "review": "I Love it", "verified": true, "helpfulness": "0/0", "author": "charles kabbash"}]