[{"rating": 5.0, "review": "A very good stick", "verified": true, "helpfulness": "0/0", "author": "ryan"}, {"rating": 5.0, "review": "Forget Hulu, Netflix and all the others...This is the BEST of the best!", "verified": true, "helpfulness": "0/0", "author": "Joseph M. Motes"}, {"rating": 4.0, "review": "Works very nice is a little tricky to learn to use. But can learn it in time.", "verified": true, "helpfulness": "0/0", "author": "William Podbreger"}, {"rating": 4.0, "review": "Like it", "verified": true, "helpfulness": "0/0", "author": "friezer"}, {"rating": 3.0, "review": "I also received this for $19 dollars as an early adopter. It works pretty well, I am overall happy with it...I guess. But there are some drawbacks.PROS:AMAZON MUSIC/PRIME MUSIC ON YOUR TV OR HOME AUDIO SYSTEM- This is the biggest perk for me. My music can be added/bought via Amazon, then played on any television's audio setup via HDMI.AMAZON INSTANT VIDEO ON YOUR TV- Many shows and movies are free from the stick, and the ones that aren't are relatively inexpensive.FREE CLOUD STORAGE WITH AMAZON PRIME- You get like 10GB a month with a basic membership, which, in all honesty, is really not enough. That's like 2 short movies. But something like an extra $60/year ($5/month) gets you unlimited.CONS:SMALL INTERNAL STORAGE- It only has 32GB internal storage. All data is STORED in the cloud, but is transferred to the stick 32GB at a time. So the first couple of days you're like, \"This is great!\" Then there starts to be lagging and juttering in your music and movies as old data is purged and new data is written ALL OF THE TIME! It DOES have an option available to clear the cache at any time, but it's very arduous to do the process all the time.GAMES ARE WACK- If you only have the remote, you can't even play most games. If you blow an extra $39.99-59.99 on a controller, your treated to dollar-store rip-offs of famous games.", "verified": true, "helpfulness": "0/0", "author": "M. Gariti"}, {"rating": 2.0, "review": "Even though it get's great connection of all apps. It's completely different when signing on to them. interference, choppiness, constant play in record when things are live. The number one complaint is FireStick/MLB. constantly doing all the above. Can hardly watch a full inning of the game without interruption.", "verified": true, "helpfulness": "0/0", "author": "Anthony J Galgano"}, {"rating": 4.0, "review": "I really like it, works well and the remote makes it easier to set up and I don't always have to have my phone on me. I took away one star because it is HBO GO....and not HBO Now. It was my fault for misreading but I am not sure I would have bought this otherwise....I was surpirsed that this little thing had games, apps and other items which is really nice. If your TV is not a smart TV this has all the bells and whistles that you would need. It was really easy to set up and probably took less then 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "Trebin \"Mark Nibert\""}, {"rating": 5.0, "review": "Best purchase ever (well, maybe note ever, but close). Alone with just the preloaded apps it is a great product that will replace my need for cable TV, and then add some custom apps for things you are interested in and it because your comprehensive entertainment provider!  For the low, one time cost, it is amazing everyone isn't using this.  Today is the day I cancel my 30+ year subscription to cable TV.  Goodbye Time Warner, hello savings!", "verified": true, "helpfulness": "0/0", "author": "Tracy L. Lafon \"Works in Progress\""}, {"rating": 3.0, "review": "It is ok, but so far I prefer to use the Roku 3.  It works well enough, although I found it choppy when watching Sling TV.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 5.0, "review": "My wife says:\"I love my Fire Stick,  a lot! \" Enough said.", "verified": true, "helpfulness": "1/1", "author": "James Hepworth"}]