[{"rating": 5.0, "review": "I love it! I bought the Fire TV Stick because I was tired of paying the high cost for premium moves through my cable provider and I'm an Amazon Prime member and have Netflix and can watch all the free movies I want with this.  Setup was super easy.  I've experienced no skipping or hanging.  I can take it with me when traveling.  I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "juleshouser"}, {"rating": 1.0, "review": "I bought this tv stick and it worked properly for less than a day the network connection always drops and it's not my wireless because I only stream two devices from it and this stick is right next to my modem. No matter how any times I unplug and plug back in I always find myself troubleshooting this thing. Not satisfied.", "verified": true, "helpfulness": "0/0", "author": "Shanice"}, {"rating": 3.0, "review": "Would it be good that it could play videos or music from any website or recorded in any other device, with Google Chromecast this is possible.", "verified": true, "helpfulness": "0/0", "author": "Jorge Eduardo Albanese"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I have issues with one of my fire sticks all the time but one of them seems ok", "verified": true, "helpfulness": "0/0", "author": "Edwina Morhardt"}, {"rating": 5.0, "review": "I have has several streaming devices before, the Fire TV Stick is outstanding  and so much easier to use.", "verified": true, "helpfulness": "0/0", "author": "pelly"}, {"rating": 1.0, "review": "Sorry.... It didn't work for me.  I do have the Amazon Fire Box which works like a charm and streams magnificently.", "verified": true, "helpfulness": "0/0", "author": "R. ANDERSON \"Admiral Rich\""}, {"rating": 5.0, "review": "I have been using Roku (1, 2 & 3) for a couple of years.  I have also tried Chromecast, which I returned within a week.  I have to say Fire TV Stick is my husband and my favorite.  I will continue to use my exisiting Roku's, but for future purchases, we will buy the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "L Winters \"looneywin31\""}, {"rating": 5.0, "review": "Have not had any issues with the stick. It is what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Charles K. Shull, Jr."}, {"rating": 5.0, "review": "Love this. My son has the Apple TV and. says this seems to work the same. Well worth the money", "verified": true, "helpfulness": "0/0", "author": "S. Champion"}]