[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "John  W Lopez"}, {"rating": 5.0, "review": "It is super simple to use, plug in and go!", "verified": true, "helpfulness": "0/0", "author": "Erin Johnson"}, {"rating": 1.0, "review": "Terrible laggy performace. Randomly shuts itself off. This thing is the worst.", "verified": true, "helpfulness": "0/0", "author": "MCB"}, {"rating": 2.0, "review": "Sound quality was not very good. Some areas I could only get static.", "verified": true, "helpfulness": "0/0", "author": "Alan Fairweather"}, {"rating": 5.0, "review": "Like to see ability to have closed caption and change font sizes.", "verified": true, "helpfulness": "0/0", "author": "funtime"}, {"rating": 5.0, "review": "We prefer to watch Amazon to regular cable or TV.  We can watch what we want when we want to.  Would recommend this for anyone.", "verified": true, "helpfulness": "0/0", "author": "Dezziegirl4"}, {"rating": 5.0, "review": "I use this for business travel in hotels.  The only thing you MUST know, you cannot access the internet if you have to open a browser to login.  I tether the internet from my phone as I still have unlimited data.  Otherwise, you would probably want to connect to wifi on your phone, and then tether it over.Super fast, great for traveling, if you have your own ways of providing it internet access.", "verified": true, "helpfulness": "0/0", "author": "Derek"}, {"rating": 5.0, "review": "The kids love it and it is great for a heavy Amazon user.  Best $19 I have spent in a long time.", "verified": true, "helpfulness": "0/0", "author": "Steve H"}, {"rating": 1.0, "review": "Worked great at first.  Liked it so much that i buoght 2 more. Then after 5 weeks it started freezing and i had to trouble shoot it and it continued to freeze and drag.  Contacted customer support.  They made me trouble shoot it and after over an hour of calls it still did not work and they said the return date had passed and maybe i should contact my cable company because its the fault of my connection not their stick.  Interesting that it only happens with the one.  My download speed is 33 mbps.  After over an hour of calls and buying 3 sticks they were only able to offer me grief for replacing it.  VERY DISAPPOINTED WITH THE CUSTOMER CARE.I only have trouble with this one, so wth?You would think that being a prime member who purchased three of their crappy product they would try to take better care with their customer service.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Got it on sale for $19.99, and it was worth it at that price, but the interface needs a remodel.  I wish that the app interfaces were more like there PC counterparts.  They have a remote with a mic so you can use your voice, but you have to buy that separate?  That is a rip-off.  They should include it to be competitive.  I don't even use mine anymore.  I just use my old PS3, which does everything that this thing does, but it is much more responsive, and has a better factory controller.", "verified": true, "helpfulness": "0/0", "author": "BigRob"}]