[{"rating": 3.0, "review": "It's a good idea, but only if you are a prime member, and the apps aren't all the great, over I say it's okay", "verified": false, "helpfulness": "0/0", "author": "sergio"}, {"rating": 5.0, "review": "Turn any tv with a HDMI port into a smart tv. I love the Fire TV stick because it allows you to stream all your music/tv accounts in one place.", "verified": true, "helpfulness": "1/1", "author": "Antonio"}, {"rating": 4.0, "review": "It's not perfect, but much more useful than the Chromecast.I love having a remote and being able to view Amazon video along with Netflix.My only gripe is that while playing Netflix video, there is an occasional stutter that makes a buzzing sound. Happens once or twice per 45 minute episode. Sometimes it is hardly noticeable, but I'm not sure what is causing it. My internet connection is over cable at almost 60mbps down. Amazon video does not do this. 3 hours and 29 minutes of Lord of the Rings: Fellowship of the Ring had absolutely no stutter. I don't know if Netflix is more taxing for this device in some way, but I will deal with the occasional stutter to have a remote.", "verified": true, "helpfulness": "1/1", "author": "C. Scott"}, {"rating": 5.0, "review": "I love my Fire TV Stick.  It is really plug and play.  Amazon walks you through the process.", "verified": true, "helpfulness": "1/1", "author": "Donanjo"}, {"rating": 5.0, "review": "This is Perfect! I cut cable about 4 years ago and have been using a home built HTPC (Home Theater PC) and then I transitioned to a Raspberry PI with XBMC installed, however these being PC's I have found they need a lot of upkeep, as well as adding a bit to the power bill as the PC used ~150Watts while fully booted.  This has effective replaced them, and the interface feels so much more responsive then the Raspberry PI / XBMC Combo.I've looked at the set top boxes before like roku and chrome cast, but I did not like that roku was closed source and chrome cast seemed to single purposed.  I feel this has a good cross section of features.Being android I am fond of the ability to side load third party apps, for example I have a full installation of XBMC side loaded which doubles the functionality. My only wish is that side loaded apps would be shown in the regular apps.", "verified": true, "helpfulness": "1/1", "author": "Scott C."}, {"rating": 5.0, "review": "This device works decidedly better when coupled with Amazon Prime.  It's really designed with Prime in mind.  I am unsure of how much I'd like it without that service.  Streaming episodes of TV shows is great.  I've had issues with Netflix where it sometimes forgets I watched an entire episode of a show when I watched it on my Playstation 3.  I haven't had that problem here.I got this within the first two days when it was available for $20.  I couldn't be happier.  I set up a Plex server on my main computer and paid 500 coins (which I somehow already had?) to buy the Plex app.  Now I can watch any media on my computer as well as anything from countless online video streaming sources.This is the only hiccup I've had.  Some of the media I stream through the Plex app can stutter.  I don't think I've watched a movie yet that doesn't have the occasional lag or even an error that says it can't read the file.  However, even with these errors, if I start the movie up again it does work.  I don't know if this a problem with the media, the Plex app, or the Fire Stick, but it's the only issue I've come across.", "verified": true, "helpfulness": "1/1", "author": "Aaron"}, {"rating": 2.0, "review": "Really disappointing that you can't mirror your Windows 8 screen to a TV with the Firestick plugged in.  The product description lead us, along with many others, to that conclusion.  Amazon clearly states the fire stick is Miracast certified so like everyone else I was lead to believe it should work with Win8.A lengthy but unsatisfying discussion going on in the support forum.  http://www.amazon.com/gp/help/customer/forums/ref=cs_hc_g_pg_prev?ie=UTF8&forumID;=Fx1SKFFP8U1B6N5&cdSort;&cdThread;=Tx38LM5485YSV8L&cdPage;=1Miracast is the standard wireless display technology. Almost all WIndows 8 laptops come preinstalled with miracast technology. This Win8 Miracast functionality was the main reason I made this purchase.  Come on Amazon get with it.", "verified": true, "helpfulness": "9/10", "author": "Bill"}, {"rating": 5.0, "review": "So much faster than the Chromecast!", "verified": true, "helpfulness": "1/1", "author": "Jeffrey Morrissey"}, {"rating": 4.0, "review": "Had issues in the beginning couple of days but now works just fine.", "verified": true, "helpfulness": "1/1", "author": "studygirl"}, {"rating": 1.0, "review": "Talk about controlled environment... no apps on the play store are allowed. Waste of 1 gb memory.", "verified": true, "helpfulness": "0/1", "author": "Oscar"}]