[{"rating": 3.0, "review": "I thought there would be more selections and more without being charged for having.", "verified": true, "helpfulness": "0/0", "author": "Rhonda Demers"}, {"rating": 4.0, "review": "Yes I love it. Now you could get ESPN and BTN I would seriously consider ditching cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Worked great the first time I installed it.  Love It!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Has eveything that I was looking for!", "verified": true, "helpfulness": "0/0", "author": "Casey Carden"}, {"rating": 4.0, "review": "Should have probably upgraded to next price range. While it performs as we hoped, Netflix, etc., the remote is fairly limited. Often skips episodes, starts without \"being told to\" and difficult to backtrack to episode we wanted. Usually have to go back and start the process over.", "verified": true, "helpfulness": "0/0", "author": "Saundra Lawson"}, {"rating": 5.0, "review": "Loved it!!!!", "verified": true, "helpfulness": "0/0", "author": "Patricia Cecchi"}, {"rating": 4.0, "review": "I think this Amazon stick is great and would have given it 5 stars but the fact that you have to unplug it for it not to get warm is the drawback. Switching channels or movies is a breeze. Good way to have access to all the movies prime has available.", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 5.0, "review": "Beats cable", "verified": true, "helpfulness": "0/0", "author": "Daniel P. Ryan"}, {"rating": 5.0, "review": "Truly a fantastic device , fast and easy to use .  Recommend to everyone that wants to stream movies and TV.  Get rid of cable or Dish, you will be very glad you did.", "verified": true, "helpfulness": "0/0", "author": "David Evans"}, {"rating": 4.0, "review": "This has been a hate/love relationship - yesterday it would have been 1 star - last night 5.  I hope that people that have cable read this because so far that seems to be my fix.  I initially had to go through a couple of tech support calls which helped somewhat but no one was able to tell me why the streaming kept cutting out.  I could not watch more than 2 minutes without it cutting out and the screen going dark - sometimes it came back, other times it said I did not have a connection.  I tried a Chromecast which was no better (I think it is worse since it doesn't have a remote).  One of the IT guys at work found an app so I could see what kind of network traffic I had.  To make a long story short, my last resort (which I didn't think would work) was to turn the cable box and the TV on and then change HDMI1 to HDMI2.  That did it - works like a charm (so far).  The point being that no one told me to turn the cable box on and a couple of my IT guys said that that should not make a difference - but it does.  I live in SE Pennsylvania and I have Comcast as my cable provider and ISP.", "verified": true, "helpfulness": "0/0", "author": "SJ"}]