[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "dalewaynemilam"}, {"rating": 3.0, "review": "I was disappointed when either it doesn't have the ability or I cannot locate the ability to lock down ALL apps except one.  I only wanted this for Netflix for a child's room.  Also I didn't understand why the extra USB power is necessary, especially when I plug it into my TV and it states it will not work properly, yet it still works...Although the children can watch Netflix easily, unsure how the remote will hold up to abuse.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Get it.", "verified": true, "helpfulness": "0/0", "author": "Kyle"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Ashley Batstone"}, {"rating": 5.0, "review": "Did everything we needed.  Great for our extra room and kids love the cartoon series on it.", "verified": true, "helpfulness": "0/0", "author": "Heather Drao"}, {"rating": 2.0, "review": "While there are a lot of options for the use of this item, it doesn't have the 'free' things I would watch or listen to.  There appears to be a small charge for many of the items I'd view (old movies etc).  I don't watch the more recent content as it usually contains subject matter that is objectionable.", "verified": true, "helpfulness": "0/0", "author": "Barry D"}, {"rating": 2.0, "review": "At first things were great. Then I kept getting the error messages saying WI FI wasn t connected. Of course it was connected. That was problem number 1.  Then it began hesitating and acting like it was buffering.I emailed Amazon straight away & they said they knew of the problem & were resolving the cause. The offered me $10 or $20. All I want ia for their product product to work as advertised..  TAKING it back & trying Chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Sandra L. Bittinger \"SLB Scorpio 3\""}, {"rating": 4.0, "review": "I think it and its companion, Fire TV Box, are great.  Easy to use and excellent performance.  I took off 1/2 star because I wish it had some other Apps that i use on my PC like DRAMAFEVER.  We Should be able to load any Android App easily on it.  I have side-loaded some other apps using Apps2Fire from the Amazon App Store.  However, most do not work correctly even though they load fine.  A suggestion to make the experience of using these devices more comfortable would be if the remote had a  limited learning capability.  That is, the ability to add some basic functions like turn TV on/off and raise/lower volume.  The voice command feature on the Fire TV Box works just great.  I am highly pleased with these products.", "verified": true, "helpfulness": "0/0", "author": "Clarke H. Ulmer Sr. \"CLARKESR\""}, {"rating": 5.0, "review": "great little gadget especially for price easy to install immediately recognized my id from other Amazon Fire box I have. very user friendly", "verified": true, "helpfulness": "0/0", "author": "Frank Pierre Calvi"}, {"rating": 5.0, "review": "Works great, easy to set up and use.  Very happy.", "verified": true, "helpfulness": "0/0", "author": "Ybor1"}]