[{"rating": 5.0, "review": "We're enjoying the Fire Stick.  Super easy to use & responsive remote.", "verified": true, "helpfulness": "0/0", "author": "Periwinkle"}, {"rating": 5.0, "review": "Very easy to setup and operate...I like it!", "verified": true, "helpfulness": "0/0", "author": "JACK WALKER"}, {"rating": 5.0, "review": "Love all of the things I can access with this device.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 3.0, "review": "I never write reviews, so you know I really want them to fix something. So most things with this remote work perfectly fine. Netflix is great, Pandora is awesome for parties, etc. But YouTube. Omg the YouTube on this thing is so painfully slow. Now, I know that YouTube sucks in general unless you're on a computer, so its not that surprising, but wow, this one is bad. Someone needs to work on it because it takes forever to load, the videos stop multiple times throughout, and it takes its sweet time responding to the remote. At first, YouTube worked pretty smoothly, but it has gotten worse over time. Maybe my WiFi is to blame, but the other apps work fine so I'm not so sure about that. Anyone else experience this?", "verified": true, "helpfulness": "0/0", "author": "Katelyn"}, {"rating": 4.0, "review": "Excellent purchase. My only issues are that the picture quality is not as good as through the traditional TV channels on HD cable. Plus navigation could be easier.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "It is a great stick  for the money. The glitches and freezes are annoying causing to need to unplug and re start. I wish it had the ability to sort your watch list, both by genre and prime.I would also like to be able to access VUDU. Netflix consistently stops and buffers (I have a 16mb DSL connection).", "verified": true, "helpfulness": "0/0", "author": "Lyle Dotson \"Pumpkin\""}, {"rating": 1.0, "review": "I ordered it to replace watching tv on my Xbox, but due to its gliching and freezing I have went back to my Xbox. Disappointed 👎", "verified": true, "helpfulness": "0/0", "author": "Jerald Bunner"}, {"rating": 1.0, "review": "I've had the Fire Stick since it was first launched. Initially I would have given it 5 stars. It was fast, responsive,  and streamed will. But for some reason, lately it keeps having connection issues, Hulu Plus doesn't work, it's just a mess. It's more of a headache than its worth. I regret not getting the Chromecast", "verified": false, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 4.0, "review": "It is doing the job. The only reason I did not give five stars is because when I first installed the Stick the default language was German. I was not able to change that until after the Stick had been registered. My German is quite limited, but I was able to muddle through. It likely took about three times longer to install than it would have, had the guidance been in English.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works very well. Easy set up. Cancelled our cable and got this for our Bedroom. There is enough shows and movies on Netflix to gets us through. Worth the money.", "verified": true, "helpfulness": "0/0", "author": "Tim"}]