[{"rating": 4.0, "review": "Great little stick! Interface could use some \"smoothness\".Also, when will it get an update? I don't think it's been updated yet at all.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "The best bang for the buck", "verified": true, "helpfulness": "0/0", "author": "Steven christensen"}, {"rating": 5.0, "review": "With our relatively old TV (but still new enough to have HDMI ports) we now have access to the various internet based video services.  With Amazon Prime we no longer need Hulu Plus, but this gives us access to both, plus Netflix and many more.  Simple install, and it starts working right away.  Download the free iPhone app and you have a voice control remote.", "verified": true, "helpfulness": "0/0", "author": "Charlie in Austin"}, {"rating": 1.0, "review": "Very poorly engineered.  The door for the batteries for the remote control doesn't open without nearly breaking the plastic.  The programs are pay on demand for shows your cable company provides for free.  A total waste of money.", "verified": true, "helpfulness": "0/0", "author": "Regis F. Burke"}, {"rating": 4.0, "review": "Loving it. Didn't get a 5 because when I start it up, I sometimes have to  disconnect it and reconnect it so it will be recognised. But otherwise, it's really worth the money, especially if you have Prime. Just wish I could see the full selection of free Prime movies more easily. But works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to operate.  Installation a simple plug in. The included controller so much better than the grief of the chrome stick. Thanks for a great product !", "verified": true, "helpfulness": "0/0", "author": "Elaine Hackett"}, {"rating": 5.0, "review": "Awesome easy to use product! We love it!", "verified": true, "helpfulness": "0/0", "author": "Natae35"}, {"rating": 4.0, "review": "This device exceeded my expectations! I can now easily access all of my subscribed apps; Amazon instant video, Netflix, hulu. I can also watch movies and videos without dealing with buffering issues. Definitely worth the purchase!", "verified": true, "helpfulness": "0/0", "author": "Keon"}, {"rating": 5.0, "review": "Easy Set up! Clear HD Picture! Great Deal!", "verified": true, "helpfulness": "0/0", "author": "Bill Copeland"}, {"rating": 5.0, "review": "Works great!  We love it.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Stewart"}]