[{"rating": 5.0, "review": "Great little item,  thanks j", "verified": true, "helpfulness": "0/0", "author": "TJune Klesath"}, {"rating": 4.0, "review": "I like this much better than the Apple TV it replaced. It is a bargain. It works well with The Firestick Android APP.There are some complaints with 'mirroring' but I have not tried with Amazon Kindle, and I suspectthat it may be more of a problem with the Android software than the Fire Stick. All in all, I would recommentd thisto all Prime customers, without reservation. I have a Google Chromestick as well and I like it too, but this unitaugments the Amazon experience seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Was quite surprised that it actually ran fine on a 5 gbps DSL connection.  My smart tv would run like crap, constantly buffering.  I’m using a 30 mbps cable conection on it and it still buffers and gets confused when paused sometimes.  On the negative side, it's pretty limited for other apps.  Roku was better.  You can get Netflix, Youtube, and Hulu Plus, and a couple useless junk apps.  Also the remote is really flimsy, freezes and has to be put to sleep and woke back up sometimes.", "verified": true, "helpfulness": "0/0", "author": "Roy A. Lay"}, {"rating": 5.0, "review": "Purchased this for my parents for Christmas.  They love it!", "verified": true, "helpfulness": "0/0", "author": "S. O. Neill"}, {"rating": 2.0, "review": "Must order additional optional services at a cost in order to receive any benefit from the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Darlene E. Wilson"}, {"rating": 1.0, "review": "I'm quite dissapointed. It doesn't work well with certain brands of wifi modems (i.e. Arris). Amazon should inform this so buyers know before buying. It would simply not connect, or sometimes connect and interrupt the connection all the time. When I called Amazon, they told me about incompatibility with certain Brands, and told me there is a way of fixing it by changing the settings on both the stick and the modem. I was hesitant to change the settings of the modem because of what may happen to cable and fixed phone line coming from the same modem. Then I decided to give it a try, but unfortunately apparently not all representatives know about this trick, so the one I spoke with the 2nd time I called had no clue about it. This stick was for my kids' TV so they were very disappointed. I was initially going to buy the Amazon TV box instead, thanks God I didn't.", "verified": true, "helpfulness": "1/1", "author": "La Reya \"La Reya\""}, {"rating": 4.0, "review": "So far so good, really cant complain", "verified": true, "helpfulness": "0/0", "author": "well from my point of view its ok"}, {"rating": 5.0, "review": "Love the Fire TV Stick! Great entertainment option at a great price. Easy install and setup, started watching right away.", "verified": true, "helpfulness": "0/0", "author": "Kathleen F. King"}, {"rating": 5.0, "review": "LOVE IT!!!! I cut cable and kept my wifi. Since I got my Fire Stick, I never have to search for something entertaining to watch - and it's on my schedule!", "verified": true, "helpfulness": "0/0", "author": "Lilmama0511 \"Lilmama\""}, {"rating": 4.0, "review": "I like what I have seen so far!  Still exploring it.  I uploaded photos from my phone which is a excellent feature!", "verified": true, "helpfulness": "0/0", "author": "Steve Sutton"}]