[{"rating": 2.0, "review": "Waste of money. It never stays connected to the wifi for more than an hour or two. Constantly unplugging it. I give up. Nothing is wrong with my wifi, no other devices have problems. The firestick is literally right beside the router.  Ugh.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am very please with the Fire Stick.  Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Bruce Hoff"}, {"rating": 5.0, "review": "I love the way it connects so fast.  It does everything. You said thanks a lot", "verified": true, "helpfulness": "0/0", "author": "Doris"}, {"rating": 2.0, "review": "Out of the box it was fantastic. I don't like having to plug it into a wall outlet, but I've moved beyond that. After a couple of weeks, I started having playback issues. I moved the device to all of my TVs, and at different distances from my wireless access point. I have 3 network connections, one being a 5 GHz connection, and I cannot get a consistent signal from any of them. It's really day to day whether or not it's going to work properly. I have a Roku 2 and Apple TV that work fine in all the same locations. I think the issue is poor performing wireless connection in the Fire TV Stick. Overall I do like the user interface better than the competitors, but I would suggest spending the money on the box version rather than the stick version. I've heard similar issues with Roku's streaming stick, so I wouldn't be afraid of the Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "R. Christie"}, {"rating": 2.0, "review": "Not enough free movies. Also, available movies to rent are available to me on demand with FIOS at the same cost. Of course there are other things available here that I have not yet investigated the might change my emediate evaluation of this purchase.", "verified": true, "helpfulness": "0/0", "author": "Edd Roberts"}, {"rating": 5.0, "review": "Great product!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I LOVE this item. I wish I would have ordered 2 more at the promotional price. We do not have smart TV's nor streaming devices in our bedrooms. This product is easy to install-plug into TV, plug into outlet. I can access both my Amazon and Netflix accounts. The remote control is small, but has easy functionality. I find this much easier to use than the playstation and have used it almost daily since I received it!!", "verified": true, "helpfulness": "0/0", "author": "Tiffini"}, {"rating": 5.0, "review": "Way better than my Chromecast. I just wish it was powered by my TVs USB instead of the AC adapter. Other than that I love it. The remote is so much more convenient than casting from my phone (which it can also do), AND I can finally watch Amazon Prime shows, a feature the Chromecast is sorely lacking. I still use the Chromecast to stream Pandora on my stereo, but for TV Fire Stick is where it's at.", "verified": true, "helpfulness": "0/0", "author": "D. Soards"}, {"rating": 5.0, "review": "I am very happy with the TV Fire Stick.  It was so easy to set up and so easy to use.  Great Purchase!!", "verified": true, "helpfulness": "0/0", "author": "sdkid"}, {"rating": 5.0, "review": "The Amazon Fire Stick is a wonderful item to have while traveling. Instructions for use are very clear. Set up is so simple, one can put it to use instantly. It gives access to all programs from home. Thanks, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Maria R. Burcroff"}]