[{"rating": 5.0, "review": "I have owned the Fire TV for over a year and I wanted the same experience on another tv in my house. I can't complain as it seems to be the same! I am even considering the game controller now!", "verified": true, "helpfulness": "0/0", "author": "Earpleaser"}, {"rating": 5.0, "review": "Money saver!  Who needs cable anymore?", "verified": true, "helpfulness": "0/0", "author": "eyezonme"}, {"rating": 4.0, "review": "Love it! Meets all my streaming needs - does freeze at times with the Hulu app, sometimes so much that I can't get through an episode. But it works with my Netflix and pandora so I'm good.", "verified": true, "helpfulness": "0/0", "author": "kvjones"}, {"rating": 5.0, "review": "Was simple to set up and use.  Would recommend highly!!!", "verified": true, "helpfulness": "0/0", "author": "Fran Cohen"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Angela Grubb"}, {"rating": 5.0, "review": "It's as advertised well worth the minimal cost.", "verified": true, "helpfulness": "0/0", "author": "Brian P LaClair"}, {"rating": 5.0, "review": "I love this. You can connect to all your apps with this device. There are a bunch available. It's easy to use and I love it!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Marquez"}, {"rating": 5.0, "review": "Great little gadget that will help usher in the new world of TV. I had a Chrome dongle but prefer the greater access to good products offered by Amazon. Good buy!", "verified": true, "helpfulness": "0/0", "author": "Skip Brooks"}, {"rating": 5.0, "review": "I've had the Chromecast for quite a while and wasn't in a hurry to buy \"another stick\" just so I could stream Prime movies.  Putting the fire stick in the same category was a mistake and I'm kicking myself for not buying this sooner!Yeah it's great that I can stream the Amazon content and all of the other streaming video services that I want to use but I had no idea how awesome it would be to have the remote (vs using a laptop or phone to control the content).  The best thing is that this device just rock solid works the way it should work.Tired of unplugging and resetting the Chromecast?  Tired of resetting the wireless connection?  I took this for granted with Chromecast - haven't done either once with the fire stick.If you're on the fence, just buy it - you won't be sorry.", "verified": true, "helpfulness": "0/0", "author": "Roger Glogowski"}, {"rating": 5.0, "review": "Love my new Amazon FireTV Stick!!!! 5 star all the way......", "verified": true, "helpfulness": "0/0", "author": "Allen Jackson"}]