[{"rating": 1.0, "review": "Why is this a 1 star?  Because it doesnt do anything nearly as well as the roku does.  roku has tons more channels, has mirroring as well, and its user interface (while not perfect) is much better and user friendly than the First TV/Stick.  Are there games on this device?  Yes.  However they are ok, nothing that will blow your mind.  I know its \"Amazon's\" version of the Google store but if I already purchased a game in google play I shouldnt have to repurchase it on Amazon.  Also, the BIGGEST drawback is no Vudu app.  Seriously.  Sure there is Flixster but they dont have the deals that Vudu has.  Do I have all 1500+ apps/channels on my roku?  No.  I have about 130, the ones that my family needs.  Another one is Popcornflix.  There are about 3-4 apps (comedy, kids, etc) and those movies are all FREE.  There are also many that ARE NOT COMPATIBLE with Fire TV/Stick.  Popcornflix, TNT Overtime, Sirius Radio, fox sports go, animal planet, dailymotion, and more.We cut the cable 2 years ago and are VERY satisfied with the Roku 3's we have.  This device is a STEP BACKWARDS from a 2 year old device.I am honestly VERY disappointed in this device, was very excited for it, and pre-ordered it.  So glad I did not waste $40. and got it at half that.", "verified": true, "helpfulness": "1/2", "author": "S. Green"}, {"rating": 5.0, "review": "This was a really nice, inexpensive, easy-to-use surprise. Glad I took the plunge to update my 9-year-old, network-with-a-box-and-antenna TV. For $19 and an Amazon Prime membership, I've just joined the rest of the universe and am catching up on programs and movies I've only gotten to hear about from other people with huge monthly cable bills that I refused to take on. Amazon has a couple of streaming TV shows with John Goodman and Jeffrey Tabor that I can't wait to watch...on my schedule, when I please, and without constant commercials!!! In this economy, I appreciate the opportunity to enjoy new technology at an excruciatingly low price!", "verified": true, "helpfulness": "0/0", "author": "Deb in Spokane"}, {"rating": 4.0, "review": "Just plug it in and watch that simple", "verified": true, "helpfulness": "0/0", "author": "ann m larsen"}, {"rating": 3.0, "review": "As a Prime member, I was excited to try this product out, as it offered a simple/easy way to play unlimited \"prime\" movies/tv shows, plus a ton of other features that already existed in the Chromecast. I love my Chromecast, and bought on for each room in my house.Pros:-Handy remote is really cool and convenient-When it comes to Prime videos, this product does extremely well. The integration, the \"Watchlist\", the continuous playing (for TV shows), etc... they're all there.-The screensaver is pretty nice. Instead of just showing nice pictures (scenery and such) it actually pans or zooms out to make it seem like the scenes are moving.-Spotify \"app\", which the Chromecast does not have integration with [yet?]. NOTE: I know you can use the web player for Spotify and \"cast\" the tab, but it's not the same as having true integration within the apps. Google Play Music looks infinitely better on the Chromecast due to the album art and info displayed on the screen.Cons:-While it integrates really well with it's own products (Prime), all the \"additional\" features such as Netflix and Hulu are \"apps\". That means you have to download them and launch the specific app to use it. This means you cannot \"add\" Netflix movies or Hulu shows to the really nice \"Watchlist\".-Although it has more \"horsepower\" than the Chromecast, I really don't see the need/purpose. The Chromecast handles all the same things at half the specs. But more \"specs\" isn't really the con here; it's that I can launch and play things like Netflix and YouTube MUCH faster with the Chromecast. This means I get to see my shows and switch between what's on the Chromecast much faster. The Fire Stick relies on \"apps\"-YouTube casting is so much easier on the Chromecast. Typically I'm browsing on my computer and want to put it on my TV, I can just cast it. With the Fire Stick, I would need to turn on the Fire Stick, use the remote to open the YouTube apps, search for the video I want, then play it. The searching is the tough part. Have you ever searched for a video and found 50 versions with the same \"preview\" pick? You now have to search through and find WHO posted the video so you can get the right one. Blagh!Conclusion:If you're a heavy Prime user (movies/TV), then you can't beat the Fire Stick; there's just no easier way to browser, add, and watch Prime content. However, if you like Netflix, YouTube, and Google Music/Movies, then the Chromecast is better. Both will continue to add more content to their respective products; however, I think Amazon needs to built-up their integration a bit more so that they don't rely on \"apps\" so much. I think if they can get all the different \"video\" content integrated into their \"browse\" and \"watchlist\" sections, they'll be in a MUCH better position.", "verified": true, "helpfulness": "0/0", "author": "Brown"}, {"rating": 2.0, "review": "I had to restart (unplug and plug it back in) the fire stick 4 times during watching a movie on Netflix. I know the problem was not with my network connection as my wife was right next to me watching Netflix on her iPad.", "verified": true, "helpfulness": "0/0", "author": "Aago"}, {"rating": 4.0, "review": "Overall this is a great. It's nice to have everything accessible. I'm looking forward to the iPhone app.Issues I'm having: a little sluggish (especially some of the apps - youtube for instance). And it's losing wifi every once and a while and I have to unplug the power and reboot.But yes, overall a great little device!", "verified": true, "helpfulness": "0/0", "author": "A. Stenz"}, {"rating": 4.0, "review": "Setup is easy, navigation is quick and responsive, picture and sound are great, and streaming video starts VERY fast.  But a couple of issues keep this from being a great device:1) The interface is clunky.  The layout isn't very convenient; it seems like it takes too many clicks to get where you want, and there's no way to customize it so only your preferred apps/features are at the front.2) Wi-fi connection is problematic.  I have a dual-band router and I've tried connecting the Fire TV stick to both the 2.4 and the 5 ghz channel.  It will work fine with each one for a while, but then it will flake out and lose connection.  Network connection status will show \"Connected with problems.\"  None of my other wi-fi devices in the same room ever lose connection, so I know it's not my router or signal strength.  Telling the Stick to forget the connection and then re-connecting has always fixed the problem so far.My only other complaint is that the Amazon Music app is a little lacking.  There doesn't seem to be a way to browse Amazon stations or playlists.  It seems you have to add music to your playlists via the web before you can access them through the Stick app.  Otherwise your only options for music playback are albums you have purchased.Fortunately each of those problems can probably be addressed by a software update, so the Stick could get better over time.  I hope it gets more apps, too.  (I'd love to have another app for watching Ultraviolet movies because the Flixster app doesn't give you access to your entire Flixster collection.)", "verified": true, "helpfulness": "1/1", "author": "P. Higginbotham \"RedZeppelin\""}, {"rating": 5.0, "review": "The Fire TV Stick is a great, cheap alternative to the Chromecast. I got this for our spare bedroom for the kids and when family visits. Amazon needs to offer packages that include either the voice remote or game controller.", "verified": true, "helpfulness": "0/1", "author": "imfishnicked"}, {"rating": 5.0, "review": "This device integrates with Amazon Prime really well - both movies and the music sevice.  It also works great with Hulu and Netflix.  I'd recommend the Fire stick over the Roku stick if you use Prime.", "verified": true, "helpfulness": "0/0", "author": "D. Gudorf \"dave-o\""}, {"rating": 3.0, "review": "I can't get it to work.  Waiting for my grandsons to comehelp me.", "verified": true, "helpfulness": "0/0", "author": "Woody"}]