[{"rating": 5.0, "review": "I had to wait a month to have it shipped. It's everything I was expecting. I'm looking forward to enjoying all the different programming it offers.", "verified": true, "helpfulness": "0/0", "author": "Craig Baader"}, {"rating": 5.0, "review": "very intuitive for older folks and something you can get as a gift for dear old mom or dad that they will not discard in frustration. All you need is active wi-fi and an open HDMI port and you are in business!", "verified": true, "helpfulness": "0/0", "author": "Scott C. Barbu"}, {"rating": 5.0, "review": "Best gift I have ever gotten!", "verified": true, "helpfulness": "0/0", "author": "Deanna V."}, {"rating": 4.0, "review": "Took a long time to receive it, but it works as advertised! Took off 1 star for the long wait.", "verified": true, "helpfulness": "0/0", "author": "teknut"}, {"rating": 2.0, "review": "Amazon's hardware is beginning to frustrate me.  This is a nice device, the price is good, but like with other Amazon hardware, like the Fire tablets and Fire Phone, Amazon is being heavy handed, yet again..  I have a Roku on another TV and I thought this Stick would be similar. Being I own a Fire Tablet owner I should have known better.  This Stick it's almost all or nothing with just Amazon Prime content. Finding and using other services isn't easy, and the Menu search function on the Stick only searches Amazon Prime for movies, TV shows, etc., not Netflick's, Hulu, etc.. If Amazon is going to stay in the hardware business I wish they would learn to play nice with other services and companies.  I do understand that they want to put their products and services up front, but to the point of excluding Google Play from their tablets and not having a menu search for all the services on the Fire isn't doing them any good and to be honest comes off as slightly childish.", "verified": true, "helpfulness": "1/2", "author": "Mr.Bill"}, {"rating": 4.0, "review": "Very seamless.", "verified": true, "helpfulness": "0/0", "author": "Erjb"}, {"rating": 5.0, "review": "Love my Fire TV Stick.  Always had trouble connecting through my DVD player.  My Fire TV makes it so much easier to enjoy my movies and Netflix!", "verified": true, "helpfulness": "0/0", "author": "Love to Read(er)"}, {"rating": 2.0, "review": "I have a fire tv and 2 fire sticks.  I tried, however, using one of the sticks on my Sony Bravia and I cannot get the tv to recognize it.  It works fine on my Samsungs.", "verified": true, "helpfulness": "1/2", "author": "cgolden"}, {"rating": 5.0, "review": "Where do I begin? I was using my XBOX 360 to watch Amazon Prime video. Saw this go on sale and figured, what's a 4th media player (2 Western Digitals and 1 Panasonic)? I've since retired my XBOX from use (the power draw between the Fire Stick and the 360 are night and day) and have been using this solely for my Prime and Netflix viewing. Apps like Pandora, Youtube, Crackle all work well. Plex runs very well, barring your device streaming the content has the processing power to do so (8-yr old Athlon computer is the bottleneck). Have only played a handful of simple games and haven't noticed any discernible \"stutter\" from the unit.Pros: small form factor; comes with additional USB power source; comes pre-programmed with your Prime Account info, which gets you up and running faster; Very easy for anyone to pick up and use.Cons: Noticed a glitch with the remote when browsing. On occasion, it seems that the navigation buttons almost \"stick\", cycling through a bunch of titles inadvertently. Isn't app related, as I've had this happen with third-party apps, as well as on the Home screen. But isn't a deal breaker. Would rather have a wired connection vs. wireless...but honestly: where would they put it?TL;DR version: solid media player; If you enjoy watching Prime Video, definitely the way to go. If you don't have a solid wi-fi connection, you may run into issues when streaming HD content", "verified": true, "helpfulness": "0/0", "author": "GinaTurtle07"}, {"rating": 3.0, "review": "Had a lot of trouble watch anything. It buffers constantly.", "verified": true, "helpfulness": "0/0", "author": "Kim"}]