[{"rating": 5.0, "review": "Easy to Navigate, comparable to the Apple TV, except it doesn't stop for no reason like the Apple TV does.", "verified": true, "helpfulness": "0/0", "author": "Donna Sims"}, {"rating": 4.0, "review": "Unfortunately, it was back ordered and then it came one day too late for me to take to my vacation home where I had planned to use it. I did try it out at a friend's house. And did get to set up my amazon prime and several other apps, as well as upload pictures to Amazon photo storage to view on the tv. Pandora and online radio stations were easy to use.  It did seem to freeze once, and did not respond to up/down or any buttons on the app. Unplugged it and turned off tv and then back on and it worked. It looks like it will be useful  at some point, as I I needed to buy a different unit (dvd with wifi) for my vacation home since the fire stick did not arrive on time. It took 4 days after they said it would ship so I was disappointed that it arrived after I left home. (was still within the time frame given for backorder). I do not have tvs at my house with the correct connections.", "verified": true, "helpfulness": "0/0", "author": "Joyce Lander"}, {"rating": 5.0, "review": "As described.  Great tool to view movies, play games, and listen to music on your tv", "verified": true, "helpfulness": "0/0", "author": "Mary R"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Ryan Barrett"}, {"rating": 5.0, "review": "For a non tech person, this was real easy to set up and use.  I am still finding apps that I did not know I had.  This sure beats the cable prices.All in all I really enjoy the variety of programs all in one area.", "verified": true, "helpfulness": "0/0", "author": "CINDY"}, {"rating": 5.0, "review": "Great easy way to get tons of movies and shows! prime includes even more. Love it!", "verified": true, "helpfulness": "0/0", "author": "Blair"}, {"rating": 5.0, "review": "User friendly, does what it's supposed to.", "verified": true, "helpfulness": "0/0", "author": "matt thomas"}, {"rating": 5.0, "review": "It was a gift from my son from my son for my birthday. I like it a lot.", "verified": true, "helpfulness": "0/0", "author": "Donna L. Eschedor"}, {"rating": 1.0, "review": "Issues installing, wouldn't read wifi signal from upstairs. Laggy or choppy video, slow response time to commands. On phone with CS for ages, very unhelpful.", "verified": true, "helpfulness": "0/0", "author": "Alicia N. Zaret"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Steve Bishop"}]