[{"rating": 5.0, "review": "It is small, easy to set up and works great. I love it.", "verified": true, "helpfulness": "1/1", "author": "A. AKOBI \"says akobi\""}, {"rating": 5.0, "review": "I love this little stick. I am able to move it easily from one TV to another. One of my TVs has a box for HBO, so I can use the Amazon Fire TV Stick to watch Netflix when I am in the room with that TV. In another room, Netflix is available on the TV; when I want to watch HBO in that room, I simply use the Amazon Fire TV Stick. Great little stick!", "verified": true, "helpfulness": "1/1", "author": "dgueno"}, {"rating": 4.0, "review": "Works very well , I wasn't tech savy enough to use it correctly. Great invention , well made - I would recommend it .", "verified": true, "helpfulness": "1/1", "author": "Peter Diaz"}, {"rating": 5.0, "review": "Love this. Still exploring it, but loved it so much, I bought another for my daughter.", "verified": true, "helpfulness": "0/0", "author": "Joe Plemons"}, {"rating": 5.0, "review": "Was everything it says to be, very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the Amazon Fire TV stick. I think it's important to note though that many of the \"free\" apps aren't free. Many like ESPN, Starz Play, etc must have valid subscriptions to use fully.", "verified": true, "helpfulness": "0/0", "author": "dannibooba"}, {"rating": 4.0, "review": "I'm still learning about it, but so far, I'm liking it!  It's my favorite new toy!", "verified": true, "helpfulness": "0/0", "author": "Lois Vella"}, {"rating": 5.0, "review": "Wow! I ask myself,why do I need cable TV!", "verified": true, "helpfulness": "0/0", "author": "GARY CARTER"}, {"rating": 1.0, "review": "This device keeps dropping WiFi connectivity while using it. Looked at all the forums and there is no solution...waste of money. Seems it needs a firmware update but no solution as of yet.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 1.0, "review": "Horrible Wi-Fi.It refuses to connect to my 5GHz wireless, regardless of the channel, only connects on the 2.4GHz channels but has playback issues. My laptop streams HD content flawlessly in the same location, and even further away, so it's not a problem on my end.", "verified": true, "helpfulness": "0/0", "author": "Amber \"Amber\""}]