[{"rating": 5.0, "review": "Could work better but that's not the Amazon fire sticks fault, our internet connection sucks at times..", "verified": true, "helpfulness": "0/0", "author": "m lars"}, {"rating": 5.0, "review": "Very good it does what Amazon claims easy to use wish it had more apps otherwise Exellent!", "verified": true, "helpfulness": "0/0", "author": "Victor V."}, {"rating": 5.0, "review": "I like it so much that I've ordered more for gifts to family", "verified": true, "helpfulness": "0/0", "author": "John P Matthews"}, {"rating": 5.0, "review": "This is the best thing since sliced bread. The program's that came on this is just unreal.👍", "verified": true, "helpfulness": "0/0", "author": "Michael McCord"}, {"rating": 4.0, "review": "The interface takes a little getting used to. Have an Apple TV too and like that everything is on the main screen and don't have to search for things so hard like in the fire stick.", "verified": true, "helpfulness": "0/0", "author": "g00se9"}, {"rating": 5.0, "review": "I got the Fire stick because I have Netflix,Hbogo,Showtime any time on my kindle fire hd 8x9. Hbo and Showtime don't put every thing they have on TWC ondemand.It is easy to set up. You do have to activate those services. There is tons of free apps.it. is realy nice to watch Youtube on the flat screen.I would suggest you put all you music up on the Amazon cloud so it will show up on the stick when you synchronize.", "verified": true, "helpfulness": "0/0", "author": "Walter R. Harrington \"Light Bringer\""}, {"rating": 4.0, "review": "You need more original content", "verified": false, "helpfulness": "0/0", "author": "Harboursidewolf"}, {"rating": 5.0, "review": "So EASY to use. So FAST to set up. Best electronic purchase we have made!", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 1.0, "review": "Gave it one star because I couldn't give it 0.  Keeps losing connection to wi-fi.  Only item in my household that does this.  Maybe I'll just return it and purchase another Apple TV because the Apple TV doesn't have this problem at all.  I searched for some solutions on the web, but what I found were band aids for a much larger issue.", "verified": true, "helpfulness": "0/0", "author": "Christopher Rardon"}, {"rating": 2.0, "review": "Did not meet expectations, but I have not used it very much.", "verified": true, "helpfulness": "0/1", "author": "marilyn turpin"}]