[{"rating": 5.0, "review": "This is great. I got these at the $20 special they ran last year. Worth every penny and I'd buy at full price. It's way better than the chromescast which is what we had before.", "verified": true, "helpfulness": "0/0", "author": "Kimberly"}, {"rating": 5.0, "review": "Oh I reaaly love the Fire stick! It works brilliantly and the price is amazing! I can't wait to receive the Echo!", "verified": true, "helpfulness": "0/0", "author": "Edie Gerbracht"}, {"rating": 3.0, "review": "It's nice to have a remote in some cases, but I've gone back to primarily using my Chromecast since the Fire Stick didn't cast Youtube and Netflix as smoothly from my phone as the Chromecast does. The Fire Stick is excellent if you want to find content through the FireTV interface, but if you're looking to cast YouTube or Netflix or other apps from your phone, I find the Chromecast gives a better user experience.", "verified": true, "helpfulness": "0/0", "author": "Joshua Dobbins"}, {"rating": 4.0, "review": "excellent! Need a strong router. but works great", "verified": true, "helpfulness": "0/0", "author": "Catherine Lane"}, {"rating": 2.0, "review": "You need incredibly fast internet for the Fire Stick to work smoothly. I already have pretty good internet speed and I couldn't enjoy watching a show without buffering every few seconds. Too bad. I'm sticking with my Roku.", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 5.0, "review": "I like it. It is perfect especially for slingpalyer. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Ali"}, {"rating": 4.0, "review": "My only issue with this is that you cannot change from streaming HD quality, to standard. I have a fixed data limit, and this runs to my limit pretty quickly.Other than that, this is a great product.", "verified": true, "helpfulness": "0/0", "author": "Ang Gem"}, {"rating": 3.0, "review": "GAMES ARE TRICKY.  I BOUGHT \"COINS\" BY MISTAKE AND MY BANK ACCOUNT WAS CHARGED.", "verified": true, "helpfulness": "0/0", "author": "MARE"}, {"rating": 5.0, "review": "The Fire Stick has turned our old TV into a new smart TV! At the tip of our fingers we have access to unlimited shows with our Prime membership! Every night after we get the kids to bed, we jump in bed and browse all the goodies and with a click start watching shows and movies. Best purchase we've made in a VERY long time!", "verified": true, "helpfulness": "0/0", "author": "Gabby"}, {"rating": 5.0, "review": "Works great.  Better than ATT Uverse for reliability.", "verified": true, "helpfulness": "0/0", "author": "John - Automotive Engineer"}]