[{"rating": 5.0, "review": "so niceyou love amazon?buy it", "verified": true, "helpfulness": "0/0", "author": "Sung joo Kim"}, {"rating": 2.0, "review": "It works just ok had the Roku before and it had a little more channels that I liked. Think I should have kept the Roku. Only good news I heard was that HBO go was coming to the fire stick this spring.", "verified": true, "helpfulness": "0/0", "author": "Curtis Sanders"}, {"rating": 5.0, "review": "EXCELLENT!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Tony Veksler"}, {"rating": 3.0, "review": "We have the fire tv and stick. I bought the stick so we could take it with us on trips. I find it frustrating because i can't watch a whole netflix movie without the wifi getting messed up. unlike the fire tv box.", "verified": true, "helpfulness": "1/1", "author": "Shiikit \"tshiiki\""}, {"rating": 5.0, "review": "Love it, verysimple to hook up and its s o compact...", "verified": true, "helpfulness": "0/0", "author": "MARC REGAN"}, {"rating": 5.0, "review": "I absolutely love it since I am a Amazon Prime Member.I think the price of some movie rentals is expensive, and we will utilize netflix also.I think more series movies should be available as a prime member, but it is still cheaper than DISH or Direct TV.  No commercials!", "verified": true, "helpfulness": "0/0", "author": "BHRN"}, {"rating": 4.0, "review": "I gave my Roku to my son, so I got this for me.  This is a little quirky compared to Roku (although I've been watching Roku for a couple years, and like most people do not embrace change all that well).  It works fine, and you can get to where you're going, and it's maybe even better for Amazon prime video (no surprise since it's an amazon fire tv stick), but slightly more difficult to get to Netflix (which is where I spend half my time when watching streaming tv). On the plus side, it goes into stand-by mode and flips thru an amazing set of photos (from amazon), really beautiful photos-sometimes we just sit and watch those for 5 minutes, and also good for my plasma tv which doesnt like to be kept on the same screen for too long or it will \"burn-in\".  Overall, quite good but a star off for a little more difficulty to get to Netflix and the other little quirks.", "verified": true, "helpfulness": "0/0", "author": "William J. Doehnert \"Bill\""}, {"rating": 5.0, "review": "Does exactly what we wanted, for just a little bit of money. Turned our \"dumb\" TV into a \"smart\" one! With Amazon Prime there are lots of movie choices.", "verified": true, "helpfulness": "0/0", "author": "Leanne"}, {"rating": 5.0, "review": "It is easy to use and stream movies, the only bade thing isit took to long to get to me.", "verified": true, "helpfulness": "0/0", "author": "emad"}, {"rating": 4.0, "review": "Was able to install and operate all by myself, hoorah!!! Loved being able to watch Bosch on my TV screen, rather that computer. Have read Mr. Connelly's work for years and Harry is one of my favorite detectives.  Thank you for this invention.", "verified": true, "helpfulness": "0/0", "author": "susiereader"}]