[{"rating": 5.0, "review": "Easy to install and use.  A gift for my non-techy husband who absolutely loves it.", "verified": true, "helpfulness": "0/0", "author": "Betty Waites"}, {"rating": 5.0, "review": "I ditched my chromecast after using the fire TV for an hour. It has all the functionality of the Chromecast and Roku 3, with faster speeds, and a lower price.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 4.0, "review": "Great, portable product. Really easy setup. My only wish is that there were more compatible apps.", "verified": true, "helpfulness": "0/0", "author": "Jan"}, {"rating": 5.0, "review": "I love it ..so easy to install and use. I had purchased a chrome cast at costco...very disappointing.  got it to work first time through my lap top. Next time couldn't get it to connect.  The fire stick was so easy and don't need other equipment to use, Highly recommend to people who are not tech savy.", "verified": true, "helpfulness": "0/0", "author": "lvlssbby"}, {"rating": 5.0, "review": "I love the Fire TV Stick. I also have a Fire TV box. I don't really see any difference in quality between the two. I use the stick in a bedroom where It is used only a few times a week. I love having easy access to my Prime benefits throughout the house. Amazon keep the great products coming.", "verified": true, "helpfulness": "0/0", "author": "Mandy"}, {"rating": 5.0, "review": "I LOVE my firestuck.  My sister got it for me for Christmas and I watch it every night.  I like the screen saver photos at the end of the programming and wish it could play behind my music.", "verified": true, "helpfulness": "0/0", "author": "Madonna M. Hood"}, {"rating": 1.0, "review": "NEW REVIEW:OK... This really frustrates me to have to update a review that was so gleaming with such negativity. So I still have my original Fire Stick and it works flawless to this day. I wanted to get a second one for the TV downstairs so I ordered one and got it all hooked up the exact same as my first one. However, the 2nd one would crash, buffer, lock up, and  that was without XBMC installed. XBMC would barely function on it. I tried numerous resets and then finally sent it back after trying for almost a month to make it work.I ordered a replacement and it was a little better but even still, it barely would function. The first one I sent back had issues with the remote not working properly but the 2nd one just had the buffering, lock up, and crashing issues. The remote issue I had was that when you would click down or up once it would respond as if I had clicked it many times.I have no clue what they did from the first batch to the most recent batch at the manufacturer but they screwed something up bad. I could remove the new ones and put the very first one I ordered in its place and all the issues were gone.My fix, was to send back all but the very first one I ordered and instead I use a Raspberry PI 2 loaded with OpenElec. No issues what so ever with that setup.Using XBMC's info while planing a movie even off of a flash drive it was easy to see that the 2 cpu's on the Fire Sticks were pagged out at 100%. This shouldn't happen. On the Raspberry PI 2 for comparison the 4 Cpu's never go over 5% each during playback.OLD REVIEW:So I am an android fan and I have several chromecast devices which work great. The one problem is that the chromecast requires that you use your phone, tablet, or computer in order to project video/audio from a set of applications that have been built to do so. The Fire Stick having the remote is very nice, and you can upgrade to a voice activated remote or even a game controller. How freaking cool is that.I thought I had completely went into nerd overload until I came across a youtube video that showed how to install XBMC onto the Fire Stick. At that point I had went into what I could only describe as a nerdgasm. Think the movie Elf when he saw Santa http://media.giphy.com/media/YZKQcGh3roDra/giphy.gif . Ya it was that bad.For those that aren't familiar with XBMC, it is an opensource app/program that can be installed on just about any operating system which then can be tied into your network shared media or any number of free online streams. I won't advise one way or the other on the free online streams as I am not a legal expert but I can say that they work, and that the person/persons sharing the media is likely assuming all the risk. Just google XBMC Fire Stick and you will see several how-to videos on Youtube.With XBMC installed I can now use my Fire Stick to watch any Movie, TV Show, and play any song in my vast music library.Of course the Amazon Prime Video playback is second to none, and so is the playback from Hulu and Netflix. I hope to have one of these installed on every TV in the house as soon as they get back in stock :)Buy one and you can experience the greatest nerdgasm of all time.", "verified": true, "helpfulness": "0/0", "author": "IndyTom"}, {"rating": 5.0, "review": "I'm a prime member and I like the free movies. It opens up loads of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Eugene Savage"}, {"rating": 5.0, "review": "I gave this to my sister and brother-in-law for Christmas.  They love it! They have been using it to stream their Netflix movies.  It was pretty simple to install.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!  Never learned to use the old VCR, but this is so easy.  I like watching what I choose when it suits instead of settling on what is broadcast. This product is brilliant!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]