[{"rating": 1.0, "review": "It malfunctiond. Perhaps the replacement will work as advertised.", "verified": true, "helpfulness": "0/0", "author": "benjamin a. smith"}, {"rating": 4.0, "review": "Easy to install doing what I wanted it to do", "verified": true, "helpfulness": "0/0", "author": "Dianna Fleetwood"}, {"rating": 1.0, "review": "I am very unhappy with this stick. I have it for about 2 months and it every time they make an update of software or something else happens to it (I am not changing anything home), I need to reload Netfilx or  reset everything from the scratch (email, passwords, applications, etc.). It happened so far 4 times already. Yesterday, it just refused to show any movies at all in my Amazon library and Netflix due to some problem with HDCP protocol??? The technical support was unable to resolve the issue immediately (after doing a lot of things via the phone), so I am waiting now o hear from them after the weekend. I would avoid it by all means if I knew about it in advance, and I would return it back if I could.", "verified": true, "helpfulness": "0/0", "author": "Alex K. \"Alec\""}, {"rating": 5.0, "review": "This is a great way to watch Netflix and Amazon prime movies. It hooks up to  Jimi port in our Sony audio, media receiver which is hooked up to the tv perfectly. It is  simple to set up and connect also. Streaming  is high quality and  it is so much better than mirroring your laptop.", "verified": true, "helpfulness": "0/0", "author": "S. Palomaki"}, {"rating": 5.0, "review": "This is the best product I have bought in a long time. It is easy to hook up & use & I'm loving getting to watch what I want on my tv now. This is the best.", "verified": true, "helpfulness": "0/0", "author": "laneyr"}, {"rating": 3.0, "review": "I like the concept but the actual thing takes a while to load in HD. It also has to be connected (I thought it would just be cordless). Mediocre.", "verified": true, "helpfulness": "0/0", "author": "Juliana Diaz"}, {"rating": 5.0, "review": "We absolutely love the Fire Stick! I have access to my Amazon Prime movies, Netflix and so much more. Love that I can take it with me when I travel.", "verified": true, "helpfulness": "0/0", "author": "Andrea McKelvey"}, {"rating": 4.0, "review": "It is the future of tv.", "verified": true, "helpfulness": "0/0", "author": "Delloco \"Eyes in the sky....\""}, {"rating": 5.0, "review": "Love it", "verified": false, "helpfulness": "0/0", "author": "Gloria Reed"}, {"rating": 5.0, "review": "If you like watching movies.  Buy this!  Once you have, do some googling and discover how to get even more movies.", "verified": true, "helpfulness": "0/0", "author": "Daniel E. Sadaka"}]