[{"rating": 4.0, "review": "Overall I like the device. The interface is easy to understand and the remote is relatively well designed. The setup process is a bit drawn out, which I found slightly annoying but has no impact on day to day use. During setup I entered my wifi information at which point the device checked for updates, thought for a good while, rebooted, and then asked me again for the wifi information. That seems unnecessary. On the other hand, having my account linked with the hardware at the point of purchase is great, a small step that Amazon replicates with the Kindle to the same positive effect.App selection is good, not great. I haven't tried any games and don't plan on doing so. The apps that I have tried all load quickly and deliver the experience I expect. I didn't find the UI as smooth at the Roku's UI, but I feel the design is better overall. I found inconsistent HD loading times on Amazon Instant streaming even with my 75Mb connection at home on an AC1300 router. I do not like that the miracast feature, which frankly I likely won't use frequently, is buried deep within the configuration menu.", "verified": true, "helpfulness": "0/0", "author": "Ted Kniazewycz"}, {"rating": 4.0, "review": "So far im loving it. Didnt realize it still had to be plugged into wall outlet but its better than having to be wired into a modem.", "verified": true, "helpfulness": "0/0", "author": "morgan hamlin"}, {"rating": 5.0, "review": "this little stick is awesome!", "verified": true, "helpfulness": "0/0", "author": "Chris Nielsen"}, {"rating": 4.0, "review": "For the $19 I paid, this is a spectacular product. However, it is not without flaws. Overall, I'd definitely recommend this as a very adequate streaming option that's just about idiotproof, but I'm going to list the things I dislike about it, just to make sure people are aware: * The remote's buttons are stiff and loud. The click on the remote is louder than the sound effect of menu navigation. I don't know why the buttons have to behave this way because most remotes have a softer touch and still come with a reassuring \"click\". * Navigation with the remote is touchy. Sometimes I'll click once and it'll react as if I pressed the button rapidly a few times. Other times it's just slow to react. This happens frequently enough that it's noticeable and annoying. Hopefully this can be fixed with a software update. * Menu navigation is the same column and row interface that's been around since the original Windows Media Center days. It's not conducive to browsing because you can only view one row at a time while you're scrolling. * Still on menu navigation, there's no room for customization. There are items I will never use (I'm looking at you, Photos), but there's no way to hide them. * Volume has to be done on a different remote. It's a bluetooth remote, so you can't easily use a universal one you probably already have instead. You can navigate on your phone, which is handy, but I'd prefer to keep my TV interactions to a dedicated remote. But, unfortunately, there's no way to control volume so I'm forced to use 2 remotes. (Since the stick has HDMI-CEC and a sleep function, there's no need to turn your TV on/off with a separate remote so volume/mute is really what requires your TV's remote.) * Search is limited to the active App. Roku is the only thing with universal search, that I'm aware of, and it's a shame it's not employed here. I'd have to manually search through multiple apps if I wanted to find something.Like I said before, I definitely recommend this just because it presents great value for price. However, I hope they provide some significant updates to allow more customization, enhance features, and fix the damn buggy remote in the near future.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Very easy to set up and works great for all my streaming needs!", "verified": true, "helpfulness": "0/0", "author": "Barbara W."}, {"rating": 4.0, "review": "Setup quickly with no problems. So far enjoying it with Amazon Prime, Netflix & Pandora.", "verified": true, "helpfulness": "0/0", "author": "Nancy Chowning"}, {"rating": 5.0, "review": "We were used to watching Netflix through the wii.  This is sooooooo much better!", "verified": true, "helpfulness": "0/0", "author": "Kimberly K. Schramm"}, {"rating": 1.0, "review": "Sucks,extremely slow. My cel downloads 100 times faster", "verified": true, "helpfulness": "0/3", "author": "Dan"}, {"rating": 5.0, "review": "Amazing speed and ease of use.  The next big thing in entertainment is likely to be the Fire TV  and Fire TV Stick.  Forget your cable and satellite companies - The Internet is the new cable/satellite...", "verified": true, "helpfulness": "0/0", "author": "Bob from Massachusetts"}, {"rating": 4.0, "review": "I ordered two when they were $20 and I received them much sooner than the expected delivery date.  After a day of use,  here are my thoughts:-I mainly stream Netflix,  hulu plus,  Amazon prime content and Pandora and before this,  I was streaming off blu ray players so I was looking for a more direct and smoother interface.-I also feel duped by the stick needing to be plugged into a power adapter since amazons description mentioned nothing about it but due to my tv/media stand/power strip setup,  it turned out to be a non issue for me.-Initial setup on the TV in my room which is furthest from the router was a bit of a pain because it took three tries to get it to update.  This may have been due in part to reception in there being unstable at times. May also be due in part to Amazon server being overloaded.Set up on the TV in the living room that is closest to the router was a breeze.-For those complaining about the battery compartment.. I had zero issues with both of mine.  Simply apply pressure to the top where the bar imprint is and slide down.  Took me 2-3 tries on each but came off easily.-After updating in the bedroom TV,  I tried playing Netflix and it rebuffered three times in 3 minutes,  then when you pressed any button on the remote,  the lag between press and something happening was a 30+ seconds.  Not a good start.  I restarted the stick and everything has been good since.  The living room TV has had zero issues so far.-Overall, I'm happy with the stick so far especially at the price I paid for it. It does what I want it to do,  streams HD smoothly and stays out of my line of sight.  I also really like that the stick doesn't require you to turn it on and off.  As long as it's plugged into a power adapter,  it will turn off after 30 minutes of no use and turn right back on to where you left off when you turn your TV on. The remote is also nice and simple and you don't have to point it at anything in particular to get it to work.I will update this review if anything changes.", "verified": true, "helpfulness": "0/0", "author": "Desirella"}]