[{"rating": 5.0, "review": "😆", "verified": true, "helpfulness": "0/0", "author": "Paul freytes"}, {"rating": 1.0, "review": "I didnt like it the only thing I like was the remote control .", "verified": true, "helpfulness": "0/2", "author": "crystal digna soto"}, {"rating": 5.0, "review": "So easy to install and use.  Love portability for travel.  Simple to access materials.", "verified": true, "helpfulness": "0/0", "author": "PhantomDrill"}, {"rating": 3.0, "review": "It works ok", "verified": true, "helpfulness": "0/0", "author": "Jijun Lin"}, {"rating": 1.0, "review": "TERRIBLE. Makes a terrible buzzing noise and skips. I apparently got a defective one and they are sending me a new one but lets see how that works out..... Everything else with amazon has been a pain so we shall see.", "verified": true, "helpfulness": "0/0", "author": "vcarp129"}, {"rating": 5.0, "review": "Love the Fire Stick.  Super easy to use, quick and easy.", "verified": true, "helpfulness": "0/0", "author": "Rochelle Aguiar \"Rochelle\""}, {"rating": 4.0, "review": "Very useful. Much faster than my old roku. I wish the remote was backlit. I also wish there was an off button- the manual states it goes to sleep by itself after 30 minutes, you can manually put it to sleep (which means flipping through the menu to get to settings), or you can turn it off by unplugging it. Its not a big deal mind you, but I'm just in the habit of turning things off when not in use.At $20 (the special price) I wish I got 2 or 3. At $40? still worth it.", "verified": true, "helpfulness": "0/0", "author": "C."}, {"rating": 3.0, "review": "OK for what it is,  not as much content as the Roku or the Blue-ray players. It's new so hopefully more content coming.  But does stream smoothly and interface is pretty good.", "verified": true, "helpfulness": "0/0", "author": "Kevin J. Post \"KJP\""}, {"rating": 1.0, "review": "The \"doggle\" or part you plug into the TV, must have a small power cord attached to a/c power.  Not very convenient if your set is wall mounted as ours is.  Web site does not show any wire going to the doggle, just insinuates you plug it into the TV and your ready to go.  Other products out there get power directly from the TV hdmi port.  In my opinion this items description is purposely misleading.", "verified": true, "helpfulness": "2/3", "author": "David L. Diller"}, {"rating": 5.0, "review": "It works just like I hoped it would.", "verified": true, "helpfulness": "0/0", "author": "Susan M. Grantham"}]