[{"rating": 5.0, "review": "I enjoy using this. I havhave 2 Chromecast aND bought this day one when it was on sale. It took forever to come in but that was expected considering.Usability is easy, easy setup and content so far is good. I use all cast with showbox and the fire stick has access to it. So I was able to stream those movies too. All around a great product. Hope it has a bright future.", "verified": true, "helpfulness": "0/0", "author": "Justin \"j-ster\""}, {"rating": 2.0, "review": "When it works I really like it.  Plays Netflix,  Prime and Plex just fine.  I like the user interface as well.  Fantastic value for the money but the problem I am having is it keeps dropping off WiFi every now and again.  The only fix is to unplug it and let it reboot.  The software has no system reset option which would make life much easier.  I have two different wireless routers and it does this with both.  If feels like a software bug rather than a defective unit and I have read many complaints about this online.  I may try and get Amazon to replace it... I am sure they would but I have been hoping for a software update to fix the issue.", "verified": true, "helpfulness": "1/2", "author": "Cognizant"}, {"rating": 5.0, "review": "I own a Roku 3 and a Fire TV stick. Dollar for dollar, the FTV is the best deal out there. Dont be swayed by Rokus thousands of channels, most are terrible. The main ones are all available to both services. The real advantage of a Roku 3 is the search options (which searches all content providers) and speed. It takes 2-3 seconds longer to boot a show with the stick than the 3. To be fair, the R3 is the top of line so it should be fast. I have seen the top of line Fire TV and it is even faster than the R3. For the price, buy it and enjoy.", "verified": true, "helpfulness": "0/0", "author": "from50613"}, {"rating": 5.0, "review": "For the price, this was an impressive buy. It works as advertised. I wish more of Amazon's content was free with my Prime membership. That detracts from the value of this little gadget. But for viewing Netflix and youtube videos, I couldn't be happier.Amazon should be showing all advertising photos with the required power adapter plugged in. I know it looks less sleek, but not showing the adapter seems kind of like false advertising.", "verified": true, "helpfulness": "0/0", "author": "David hach"}, {"rating": 4.0, "review": "Can't figure out how to search for a movie", "verified": true, "helpfulness": "0/0", "author": "linda abitz"}, {"rating": 5.0, "review": "Plugs right into an HDMI port, and is powered by an outlet. Easy to use.I'm happy with the product.Other than I have had a few issues of it freezing up, and not being able to pick up a wireless connection. Which I am sure they will address in a firmware update.The phone app is great, even though the remote does the job.", "verified": true, "helpfulness": "0/0", "author": "Wesley"}, {"rating": 5.0, "review": "I bought this at Best Buy since it's backordered on Amazon to go with a new TV in my bedroom that is not connected to a receiver. The timing was good since I found myself in a cast spending a lot of time in bed watching movies. This is my first app-based TV device so I can't compare it to others. I chose the Fire TV stick over Chromecast as I found out Chromecast doesn't deliver 1080i and Fire TV does.As always, the packaging is simple, elegant and has that cool factor. It comes with both an AC charger and USB extension cable to power with a USB port in your TV. If you use the USB connection the stick powers off when the TV is turned off. With the AC power connection the stick is always on.Setup took about 20 minutes to connect to wifi, activate and download the software update.The interface is easy to navigate to find pre-installed apps, Prime content and search for apps. I prefer browsing for apps online and having them sent to the Fire TV stick rather than searching with the remote. Searching for the apps online before you buy the stick will also give you an idea of what's available. Mainly I use Netflix, Hulu and iHeartRadio so I can listen to a Classical music station at night. There is a sleep function that turns off the display after so long but the station continues to stream.The buffering thing does happen occasionally, which I'm fairly certain is an ISP thing rather than a device flaw.Since this is still a new device I assume there will be software developments and new apps to come that will offer more content and options in the near future. For now, it has everything I need.All in all if you're a big user Amazon products and content, this is a very affordable and friendly device to bring it all together.  Also, if you should find yourself in a cast with only one usable arm like I did - the Fire TV stick is easy to set up with just one hand. It's about the only thing that is easy these days! I've also moved this between TVs in other rooms without any problems.", "verified": true, "helpfulness": "0/0", "author": "L.L."}, {"rating": 5.0, "review": "Working really great", "verified": true, "helpfulness": "0/0", "author": "Sarath"}, {"rating": 1.0, "review": "Glitchy! I thought this was going to be a good alternative to the Chromecast/Roku, but it's terribly annoying when it freezes continually, makes odd noises, and just doesn't cooperate. It may have been that this was just a defect in the specific device that I received. However, I did not order a replacement device to test this theory.", "verified": true, "helpfulness": "0/0", "author": "Bella"}, {"rating": 5.0, "review": "Surprisingly good. I am using this more then my Roku at the moment. There were some issues upgrading the firmware at the beginning but eventually it worked.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"TheMakerGuy\""}]