[{"rating": 5.0, "review": "Works great!  Attempting to view Amazon Prime Videos natively on our TV is hampered by lagging.  The Fire Stick works great - no lag at all! simple to install.", "verified": true, "helpfulness": "0/0", "author": "Lynnette B. Smith"}, {"rating": 5.0, "review": "Works great!!", "verified": true, "helpfulness": "0/0", "author": "Chad Odegaard"}, {"rating": 4.0, "review": "One of the best streaming devices I have used so far.  Only wish it was more open for side loading apps, but I knew its limitations prior to buying so no issues there.  Only downside is I have had some speed issues, where I would input a command from the remote and it would take a few to several seconds before performing the desired input.  Still better than my Roku 1 and on par with the smart features built into my LG plasma TV.", "verified": true, "helpfulness": "0/0", "author": "R W"}, {"rating": 5.0, "review": "Great and easy to use, worth the payment", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 2.0, "review": "I bought one 8 months ago and it quit working.  Decided to order another one. So far so good", "verified": true, "helpfulness": "0/0", "author": "Melissa s Rupert"}, {"rating": 4.0, "review": "Does the job for what it is.", "verified": true, "helpfulness": "0/0", "author": "Steven Park"}, {"rating": 5.0, "review": "Works great connected to my Yamaha receiver.  Running Kodi fairly smooth as well.", "verified": true, "helpfulness": "0/0", "author": "P. Christ"}, {"rating": 5.0, "review": "I never review products out of sheer laziness but I really like the Fire TV stick. We had been using a PS3 for streaming purchases and had come to accept it's flaws, delays, etc. In contrast the Fire TV UI is intuitive and easy to use, and the app selection is great. We only experienced lag in the first few minutes of use, and haven't had a problem since, on a 15mbps connection. I kinda kick myself for not looking into this earlier.", "verified": true, "helpfulness": "0/0", "author": "Damion"}, {"rating": 5.0, "review": "This device has become my new toy. I simply cannot wait to get home every night to start watching it. Great way to pass the time.", "verified": true, "helpfulness": "0/0", "author": "norberto lopez"}, {"rating": 5.0, "review": "Easy set up..... and GO", "verified": true, "helpfulness": "0/0", "author": "Lois B."}]