[{"rating": 4.0, "review": "lags on some shows .... needs a better wifi card and it isnt our side we have a 3.2 gbs wireless router", "verified": true, "helpfulness": "0/0", "author": "the Kennedy family"}, {"rating": 3.0, "review": "Tough to recommend. The UI is nice and what it offers is good but the hardware doesn't handle Wifi very well. It will drop signal and buffer more then it needs to compared to my Chromecast, PS3, and Chinese branded Android stick. If it didn't buffer as much or drop signal I would fully recommend it.", "verified": true, "helpfulness": "0/0", "author": "C. Eckeard \"Chris Eckeard\""}, {"rating": 5.0, "review": "Love being able to watch Prime Instant Video AND Netflix...the Chromecast I had before was not compatible with Amazon. Definitely plug the power supply into an outlet rather than the TV...it'll cut out.", "verified": true, "helpfulness": "0/0", "author": "Lisa Page"}, {"rating": 5.0, "review": "Can't believe how easy this was to set up.  Plug it in; connect to your WiFi,  watch the automatic tutorial, and then go!  Worked flawlessly.  It's great when something works quickly and easily, right out of the box.  Extremely happy so far...have had it for 2 hours and can't wait to see/watch more!", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 5.0, "review": "I love the firestick with all the stations is better than cable", "verified": true, "helpfulness": "0/0", "author": "Lovie"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "LOTTIE PASSMAN"}, {"rating": 3.0, "review": "Disappointed at first, applied for a return.  Played with  it a bit more and decided to keep.  Should I return and order it again, or can it be recharged to my my account and save the wear and tear on the postal service?  A week later, Great Potential, but I constantly am told that my system does not have enough band width to support continuous streaming.  How much band width is required?  I have the top end of Hughes Satellite internet, an Asus router with 130Mbps link speed showing on my Kindle Fire HD.  Still, when I try to stream a movie it only buffers a few seconds at a time.  Any Suggestions?  New post: In regard to the status of the subject order, please review the sequence of events:1) 5/31 Ordered Amazon Fire TV Stick.2)  6/01 Fire Stick price posted to my account.  Fire Stick received.3) 6/02  Requested return of Fire Stick.4) 6/03  Refund was posted to my account.4) 6/03  Decided to keep Fire Stick.  Via Customer Review, requested that return be nullified and if refund had already beenprocessed  reinstatement of charge was authorized.5) 6/04 Charge was reinstated on my account.At this point, I have received one Fire Stick, been charged for two, received refund for one.  We're even.7) 7/07  Received notice that return had not been received, and would be reinstated as a charge.  There was no provision forresponse to this notification.", "verified": true, "helpfulness": "0/0", "author": "Wendell L. Gladish \"Hap Gladish\""}, {"rating": 5.0, "review": "The Fire Stick is awesome! We pretty much only use it now. It kicks ass! Way to go Besos and whoever is getting underpaid so Besos can reap the Shizzdingle!", "verified": true, "helpfulness": "0/0", "author": "Chris R. Hatton"}, {"rating": 5.0, "review": "I love this product.  Im getting rid of my cable cause i can stream all my shows from amazon prime and youtube.  It was super easy to set up.", "verified": true, "helpfulness": "0/0", "author": "bigdchiwawa"}, {"rating": 5.0, "review": "It's awesome.  Admittedly a little bit glitchy from time to time, but rarely, and easily sorted out with restarting it....and TOTALLY worth the minimal hassle as compared to dealing with customer service from most cable TV providers, plus you can get near infinitely more shows and movies compared to TV.  Big thumbs up Amazon, you guys are awesome.", "verified": true, "helpfulness": "0/0", "author": "Gordon B."}]