[{"rating": 4.0, "review": "Product works very well, easy to install and setup... unfortunately a large number of shows require an additional subscription or a small fee... even for prime members. .", "verified": true, "helpfulness": "0/0", "author": "Jeff Arnold"}, {"rating": 4.0, "review": "Took over an hour to initalize, then failed to see any wirless networks. Finally it popped to life and I can stream netflix.Turns your \"not smart\" TV into one.", "verified": true, "helpfulness": "1/1", "author": "dcjg"}, {"rating": 4.0, "review": "Like the product. Works well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "At firstit's awesome fast and has a good menu. Easy to install and pretty user friendly.It overheats and loop reloads. It skips with poor internet (chrome cast works better)", "verified": true, "helpfulness": "2/2", "author": "Dan Quirin"}, {"rating": 4.0, "review": "I bought this so I can watch prime.  I seemed to work perfectly for me until it was being used for long periods of time.  It would freeze.  I figured out if I went directly to settings and then to system.  Go down to restart.  It would restart the firestick and at the same time resolve any issues.  Works perfectly after that.  What this needs is an on and off switch.", "verified": true, "helpfulness": "2/2", "author": "ALEXXO"}, {"rating": 1.0, "review": "It would have greatly helped if there was an asterisk beside the SLING TV app.  SLING TV which is a subsidiary of DISH satellite is not the same as the SLING built into a DISH receiver.  SLING TV is a pay per month service and not affiliated with the DISH Anywhere app.  The Fire TV devices are wonderful however Amazon needs to do a better job in explaining about their 3rd party apps and where to find out more information about them.  I have already voiced my concerns with DISH however since they are not the creator of the App they have little say in the matter.  Had I done a little more thorough research I would have been able to make a more informed buying decision.  Extremely disappointed customer.", "verified": true, "helpfulness": "0/1", "author": "David Swartz"}, {"rating": 5.0, "review": "Easy to install and simple ti use. Great Product!", "verified": true, "helpfulness": "0/0", "author": "Kenneth Webb"}, {"rating": 4.0, "review": "Works great I love it", "verified": true, "helpfulness": "0/0", "author": "ralph zavala"}, {"rating": 1.0, "review": "Horrible Streaming stick, freezes and super slow, technically speaking is nothing but driving you crazy! I thought it's my bad luck but I replaced it 3 times and all were the same crap! Very surprised with positive reviews non sense! Chrome cast is much better at least it never froze on me in a whole year of usage!", "verified": false, "helpfulness": "1/1", "author": "Samy Zachary"}, {"rating": 5.0, "review": "Worth every penny", "verified": true, "helpfulness": "0/0", "author": "Travis J. Bowe"}]