[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Lucy Macias"}, {"rating": 5.0, "review": "works great, this is my 2nd one for bedroom, I have the fancy one in living room but for bedroom or office works great, who needs to talk into it anyway. highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Expected mirroring apps like you tube and Netflix  from my phone and tablet, not just Amazon videos. Crazy!", "verified": true, "helpfulness": "0/0", "author": "Imran Khan"}, {"rating": 2.0, "review": "This would be a great product if the content wouldn't constantly stop and buffer.  It happens almost all of the time.  No, its not my internet connection...i run speed check and i am always between 16 and 25 Mbps, usually over 20.  It has to be on the content delivery side.  Problem is worse during prime time viewing.  Great idea, if they could deliver the content.  I can't seem to find any help link for support with this product either.", "verified": true, "helpfulness": "0/0", "author": "robert c. wolf"}, {"rating": 3.0, "review": "Remote stopped working after 2 wks. Started using app remote but was hard to troubleshoot since some issues required the orig remote, like when re coordinating to the wi-fi network......still not using it. Seems I have to buy another remote.", "verified": true, "helpfulness": "0/0", "author": "MzKash"}, {"rating": 5.0, "review": "Works extremely well.  I had to use this because Visio is not updating apps. Fire works and answered the problem!!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"Girl With Kaleidescope Eyes\""}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Joe jimenez"}, {"rating": 5.0, "review": "Couldn't have been any easier to set up and use. Love it!", "verified": true, "helpfulness": "1/1", "author": "Jill Valentine"}, {"rating": 5.0, "review": "Amazon Fire TV Stick The Amazon Fire TV Stick is the best thing since sliced bread. We have a Sony media player and Sony Blu-Ray w/streaming, both of those helped us to cut the cord on satellite t.v., but the Fire Stick is just so much better. I'm considering buying another so I can have one hooked to all our tvs. It's faster than the media players with much more content and apps. Watching t.v. has taken on a whole new meaning for our household.  LOVE IT!!!!", "verified": true, "helpfulness": "1/1", "author": "BSharit."}, {"rating": 5.0, "review": "Love my new Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Diana G. Solis"}]