[{"rating": 2.0, "review": "My only reason for the 3 stars is simple. Unless you purchase movies you will be watching mostly older or B rated movies. If i was not subscribed to netflix, this item would have been returned. Not impressed", "verified": true, "helpfulness": "1/2", "author": "christi"}, {"rating": 5.0, "review": "It 's easy to use and streaming is fast", "verified": true, "helpfulness": "0/0", "author": "Binh Bui"}, {"rating": 2.0, "review": "Inability to add songs to a playlist while listening sucks. It needs to be rebooted often. It gets 3 stars due to price, but it really needs improvement of the user interface and the issue with rebooting. Every time the video starts skipping or lagging, I know I need to stop it and unplug it from the TV and power source, and then plug it in again - this is annoying. The remote is too damn tiny; I like smaller remotes, but this one is SO small it gets lost too often. I end up using the app that I downloaded because I often can't find the remote, but the app is constantly losing the connection to the device because it times out if you don't keep using it so it makes you wait. Once again, it's not too bad on price, but these seem like issues that could be much better as far as I'm concerned.Update: constant freezing has gotten worse, hence the adjustment from four stars to two. I just had to unplug it three times to get the damn thing to reset and then it still was skipping during playback.", "verified": true, "helpfulness": "0/0", "author": "Douglas Dick"}, {"rating": 4.0, "review": "I was very pleased to be able to catch up on the last season of \"The Good Wife\", as well as watch all the seasons of \"Downtown Abbey\" and \"Mr. Selfridge\" on PBS.  The only downside was that I did this to try to see if I could get rid of my cable, but since it operates off my Internet WiFi and Comcast only allots you 300 GB per month data usage on the Internet account, I exceeded my monthly allowance for the first time watching all these shows.  In fact, I did it in the first two weeks of the month.  And, for every 50 GB I go over the allowance, I will be charged $10.  So, it won't really provide any savings at all.  Also, when I got to the third season of \"Mr. Selfridge,\" I had to pay $2.99 per episode to watch it.  I will be much more careful in future how much I use the service, and, since I am paying for Amazon Prime, more unwilling to pay extra to watch things. I will have to keep my cable and will watch the next seasons of these three shows on it instead.  But, I will keep the Firestick for watching occasional programming, most probably movies that come with the Prime subscription.", "verified": true, "helpfulness": "0/0", "author": "Cheri J \"Cheri\""}, {"rating": 5.0, "review": "love it. great idea", "verified": true, "helpfulness": "0/0", "author": "RUTH RIVERA"}, {"rating": 1.0, "review": "Does not work. Blue screen when go to play netflix.Update:Tried it on a different TV, still did not work....No blue screen this time, it just would not stay connected.  Wifi is fine, there are many devices hooked up including a Roku stick that works fine.  Amazon has no solution for this known problem.", "verified": true, "helpfulness": "0/2", "author": "RyanM"}, {"rating": 5.0, "review": "At first I was not pleased with the stick because Netflix wouldn't download BUT I figured it out. You have to install the app on the stick before you can utilize Netflix (and other streaming apps). I'm not familiar with any kind of streaming stick so I didn't know you had to do that. The Fire stick does not come with instructions regarding that. NOW I'm so glad I bought this stick, it is such a great deal ($24 on Prime Day!!) and everything works as advertised. The remote is small and very easy to use.  I recommend this product.", "verified": true, "helpfulness": "0/1", "author": "Butterfly SA \"LMA\""}, {"rating": 5.0, "review": "This is our second Fire Stick.  It's very easy to use.  Just plug and play.  Much easier user experience verses the WII we were using to access our Netflix account.  We do not have cable, so we use the Fire Stick for Netflix, Amazon Prime videos (Holla to Downton Abbey fans!), also, we can view all of our photos and videos we've uploaded to the Amazon cloud.  Cool.", "verified": true, "helpfulness": "0/0", "author": "Paije"}, {"rating": 3.0, "review": "While it connects to Netflix and Hulu, I was disappointed that I couldn't access my Vudu or Cinema Now accounts. I would like to see those added please.", "verified": true, "helpfulness": "0/0", "author": "Michelle D. Sullivan"}, {"rating": 5.0, "review": "Love it! Easy to use. Set up in less than 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "John T."}]