[{"rating": 5.0, "review": "would buy again", "verified": true, "helpfulness": "0/0", "author": "Mike Raymond"}, {"rating": 1.0, "review": "Most of the features don't work in South America, you can't even see Netflix!!! You should advice the customers about this because it is not cheap.  Apple TV is much better!!!!!", "verified": false, "helpfulness": "0/0", "author": "AMBG"}, {"rating": 4.0, "review": "I like the stick itself, apps like net flix and hulu on the other hand buffer, power down, works for a while, funny the adds never buffer, just the shows, imagine that.", "verified": true, "helpfulness": "0/1", "author": "Peter LeTourneau"}, {"rating": 4.0, "review": "works great.", "verified": true, "helpfulness": "0/0", "author": "richard emerson"}, {"rating": 5.0, "review": "great little streamer works very well very pleased thanks amazon", "verified": true, "helpfulness": "0/0", "author": "june"}, {"rating": 5.0, "review": "Works great. So many options!", "verified": true, "helpfulness": "0/0", "author": "Kimnlanden"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Fenusha"}, {"rating": 3.0, "review": "I have been an Amazon Prime Member for many years and never had any complaints......until now.  I gave this device 3 stars, BUT there is a lot about this device that absolutely detours me from ever wanting another one or ever getting the more expensive Amazon Fire TV set top box.  The device seems to have serious problems with lag and buffering that I haven't encountered with two other brands of streaming devices I currently have and am quite happy with.  My biggest complaints with Fire Stick are as follows:  NO BROWSER, remote SUCKS, NO Amazon Music STORE or ability to search for or view artists/albums/songs or anything else that isnt PRIME and most frustrating of ALL:  Prime Playlists!!?? Oh gee thanks Amazon for only populating playlists of genres, albums, artists and songs that you recommend based upon popularity while leaving the consumer NO ABILITY to create their own playlists or even edit the limited s***ty ones you offer.  The Amazon Fire Stick music \"library\" is completely worthless and leaves the user with zero options for finding, adding or purchasing any music AT ALL.  PISSED OFF doesn't even begin to express my frustration with the Amazon Music layout on the Fire Stick.  I'd rather have the option to use the Amazon Music App like on my Android Set-top box and phone which Ive never ever had any complaints with, but instead Amazon Music is a useless anger inducing fail on the Fire Stick because Amazon decided to exclude the app, offer no features like the app and worst of all, what is made available to you for listening is limited to what THEY think you might want and/or is \"popular\" offered in prefab \"playlists\" only.  When its time to upgrade my set-top media streaming box I WONT EVEN CONSIDER Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Grimm"}, {"rating": 4.0, "review": "Much better than my two android boxes, but still needs some refinement.  Remote is a bit complicated.  Overall fair price, it will save you money if you buy movies.", "verified": true, "helpfulness": "0/0", "author": "Donald L Rugh"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Lori Rodriguez"}]