[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Alberto"}, {"rating": 5.0, "review": "Had it for two weeks. Easy to install this very compact unit. Performs as advertised.", "verified": true, "helpfulness": "0/0", "author": "R. Bu \"rdbug\""}, {"rating": 3.0, "review": "Its a good media player and offers most of the apps you would expect as well as of course Amazons own movie service for Prime members. I preordered for the $20 and I think it was a good buy but not great. For the speed and variety of services I just think other options do it better.  I have high expectation of Amazon products and I think this still has a lot going for it and potential to be better as features and services are added, but as it stands it just doesn't stand strong enough amongst the competition.If you're an Amazon prime member then this is still a decent buy, but I think it is worth it to pay more and get something that already has all of the features this doesn't as of this review.  I will update this review should I find reason to.", "verified": true, "helpfulness": "0/0", "author": "I Like Stuff"}, {"rating": 5.0, "review": "Wasn't sure what to expect from this. I must say I am very pleased with my Fire TV Stick. My youngest grandson loves to watch videos on YouTube with his grandpa. I am now able to watch them with him on our flat screen HD tv. He gets quite animated over certain ones. I am really looking forward to watching Netflix and Huluplus from the comfort of my rocking chair instead of having to go upstairs to the spare bedroom and watch on my computer.", "verified": true, "helpfulness": "0/0", "author": "Trudi Basso"}, {"rating": 1.0, "review": "Horrible product. Wish I could get my money back. When watching videos it freezes constantly and the picture is blurry. My router sits 2 feet below it and I have the extra plug with it and its still slow. Dont buy!", "verified": true, "helpfulness": "0/2", "author": "Dan W."}, {"rating": 4.0, "review": "There are about 3 other similar competitor versions out there, but the FireTV Stick holds it's own. For the price and compactness, it's a great media device to own. The only thing that originally had concern with was the fact that it gets hot; however after research and continued positive reviews the Fire Stick is a solid little device. I have actually bought a few as gifts.", "verified": true, "helpfulness": "0/0", "author": "RAB7425"}, {"rating": 5.0, "review": "Kids love it. Great product.", "verified": true, "helpfulness": "0/0", "author": "Haley"}, {"rating": 5.0, "review": "The Firestick EXCEEDED our expectations! We have Apple tv and have been underwhelmed by its abilities,  speed, ease of use, etc. The Firestick was a breeze to install, the remote is easy to work,  there are no weird delays, it syncs up beautifully with our YouTube accounts,  and best of all,  we have a plethora of viewing options with Amazon Prime. We are delighted!!!", "verified": true, "helpfulness": "0/0", "author": "Paige Russell"}, {"rating": 5.0, "review": "I picked this up at Bestbuy... I've had it for a few days now and love it:-) I don't have cable I just have cable internet and have Amazon Prime and Netflix.. This thing streams perfectly  no lag at all.. it's definitely worth the money!!!", "verified": true, "helpfulness": "0/0", "author": "Beeman"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Bradley Hilliard"}]