[{"rating": 5.0, "review": "This was everything I expected.", "verified": true, "helpfulness": "0/0", "author": "Diane K. Mann"}, {"rating": 5.0, "review": "GREAT value for an impressive streaming device. Prime membership open up lots of content.", "verified": true, "helpfulness": "0/0", "author": "Vince E."}, {"rating": 5.0, "review": "Works great. No issues so far. Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "This was a gift for my wife. She quit watching cable since. Might let Comcast keep her box and save on the rental fee.", "verified": true, "helpfulness": "0/0", "author": "drednot"}, {"rating": 5.0, "review": "This item exceeded my expectations in entertainment and price.", "verified": true, "helpfulness": "0/0", "author": "Heath M."}, {"rating": 1.0, "review": "Not very useful, most of what is available is available with common cable and satellite services. Probably generates more money for those services, but I could easily live without it.", "verified": true, "helpfulness": "0/0", "author": "matthew d chappell"}, {"rating": 5.0, "review": "Super easy installation, I was watching movies and shows in minutes! Very responsive and the remote is uncomplicated.  Love this!", "verified": true, "helpfulness": "0/0", "author": "NC girl"}, {"rating": 5.0, "review": "I use it all of the time!  It is so nice for my older \"dumb\" TV that I had.  Super easy for anyone to just pick up and use and I have not had any issues with streaming.  I also really liked the app that you can download to your phone.  It is pretty cool to just say what you are looking for and letting the fire stick do the leg work.  It also helps find movies you may not have thought about.  Like if you like a particular actor for example, just say his name and all available movies with him in it will appear.  I also like that if for any reason I want to switch TVs it is simply unplugged from one and plugged into the other and takes up no room!  I might even buy a 2nd one to replace and old DVD player I was using for streaming.", "verified": true, "helpfulness": "0/0", "author": "Wags"}, {"rating": 3.0, "review": "Having trouble connecting to TV's to make it mobile.", "verified": true, "helpfulness": "0/0", "author": "JT"}, {"rating": 3.0, "review": "This will be a gift so I really couldn't say much about it", "verified": true, "helpfulness": "0/2", "author": "karen bierle"}]