[{"rating": 4.0, "review": "It works great. Then it is sometimes intermittent.", "verified": true, "helpfulness": "0/0", "author": "Lisa Cherry \"lchrry\""}, {"rating": 3.0, "review": "Started out great but now it constantly drops the WIFI signal when my wifi signal is strong my laptop does a better job than this stick does . When it do9es work it constantly drops Slingtv saying no signal when o0nce again my WIFI is working fine. Amazon sent me a new stick saying the other one may be defective but all this still happens so i'm not sure if its the stick or the programs but at this point i'm TIRED of dealing with the problem.", "verified": true, "helpfulness": "1/1", "author": "Dale J."}, {"rating": 3.0, "review": "remote too simple cant make easy selections.", "verified": true, "helpfulness": "0/0", "author": "michael hernandez"}, {"rating": 5.0, "review": "LIKE THIS ITEAM", "verified": true, "helpfulness": "0/0", "author": "ANTHONY MORALES"}, {"rating": 1.0, "review": "Bad, very bad resolution and very dependent on your Wi-Fi speed. I sent it back!", "verified": true, "helpfulness": "0/0", "author": "Buck Rogers"}, {"rating": 5.0, "review": "It was easy to set up, Love all the features and this is cheaper than buying a smart tv for sure...", "verified": true, "helpfulness": "0/0", "author": "topseyturv50"}, {"rating": 1.0, "review": "Faulty, piece of junk, pathetic attempt to make something like google chromecast. I've had both, I gave chromecast to my mom so my tablet Kindle Fire HD7 would be compatible.... Terrible mistake. First mistake was buying the Fire HD7, it's awful, too. But the Fire TV Stick is worse by far. The few available apps suck, they're all glitchy and they freeze frequently. Apparently Amazon needs to let each of their electronic products spend five more years in R&D; before they launch. I'll never buy Amazon electronics again.", "verified": true, "helpfulness": "0/1", "author": "Rob Stevens"}, {"rating": 5.0, "review": "This completed my life!  Easy to use.  Easy to setup.  Not sure what I did before this!!!", "verified": true, "helpfulness": "0/0", "author": "lindsay friedman \"lindsay friedman\""}, {"rating": 5.0, "review": "Great product.  Wish I had bought it sooner.", "verified": true, "helpfulness": "0/0", "author": "Jim Boatright \"Jim\""}, {"rating": 4.0, "review": "Entering your passwords with the remote is a pain, there were also a few bugs that seem to have been fixed.", "verified": true, "helpfulness": "1/1", "author": "Who's Asking?"}]