[{"rating": 5.0, "review": "Love it :)", "verified": true, "helpfulness": "0/0", "author": "Connie"}, {"rating": 1.0, "review": "Bought this for my husband's Easter basket. It worked the first 2 times we used it and then converted to a blue screen and audio only! So frustrating! And because I had purchased it in advance we are past the return date! Terrible waste of money! Spend a little more and get the roku 3 instead! Much better product!", "verified": true, "helpfulness": "0/0", "author": "Philip J Zuffoletti"}, {"rating": 1.0, "review": "Seemed fast and powerful, but failed miserably streaming Plex.", "verified": true, "helpfulness": "0/0", "author": "Tina Hepner"}, {"rating": 5.0, "review": "We've used it for a few months no and... so far, so good!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Way better product than AppleTV or Chromecast. Amazon has really engineered the interface and features to a well performing product", "verified": true, "helpfulness": "0/0", "author": "B Mac"}, {"rating": 2.0, "review": "Forced app updates that break functionality are bad.", "verified": true, "helpfulness": "0/0", "author": "Z. Krempel \"Burnsides\""}, {"rating": 5.0, "review": "Easy to use great addition to my viewing set up", "verified": true, "helpfulness": "0/0", "author": "Eli N."}, {"rating": 5.0, "review": "Awesome and easy!", "verified": true, "helpfulness": "0/0", "author": "Gonz"}, {"rating": 1.0, "review": "This sucks. Utter garbage. It heats up faster than the sun, freezes more than cold water, buffers more than a good shoe polishing. Why just why.", "verified": false, "helpfulness": "1/3", "author": "Randy"}, {"rating": 5.0, "review": "Pretty cool devise! I love how we can watch Hulu, Netflix and Amazon Prime movies on it... and most of all I like that its super easy to take with you on the go! I travel pretty often and its nice to be able to take this with me.", "verified": true, "helpfulness": "0/0", "author": "Miss. Review Em Like I See Em"}]