[{"rating": 5.0, "review": "The best yet. Plus a PRIME member where can you go wrong!", "verified": true, "helpfulness": "0/0", "author": "Leroy V George"}, {"rating": 1.0, "review": "Suck it Amazon you Mfrs!!  I bought a device that streamed your sh!tty service from Prime onto my 3D BlueRay player and you pull this crap??  Deactivating a device I bought because it allowed Prime streaming as well as 3D player is pure Bull sh*t.", "verified": false, "helpfulness": "0/1", "author": "Mitchell"}, {"rating": 5.0, "review": "this thing is awesome", "verified": true, "helpfulness": "0/0", "author": "Lawrence Brodhead"}, {"rating": 5.0, "review": "Very easy to set up. Just plug it in and it's there. Love it.", "verified": true, "helpfulness": "0/0", "author": "Marion Denney"}, {"rating": 5.0, "review": "Works great - loving the options for watching Amazon on the TV instead of the laptop", "verified": true, "helpfulness": "0/0", "author": "Green"}, {"rating": 2.0, "review": "Nothing Special", "verified": true, "helpfulness": "0/0", "author": "John N"}, {"rating": 1.0, "review": "A total POS, won't stay connected to my very strong wireless connection and it WILL NOT GET HBO NOW, did all the trouble shooting and all it does when I try to connect to HBO NOW is tell me I need a system update, that does not exist by the way.  Stay away from this device unless you want to be driven insane.", "verified": true, "helpfulness": "0/2", "author": "William Stumpe"}, {"rating": 4.0, "review": "Replaced my Apple TV with combination of the PLEX media server app. So much better than iTunes and (broken) Home Share.Only gripes:Must be connected to same WiFi as iPhone to control remotely without remote.Otherwise requires remote at all times; easy to forget when traveling.Can't change WiFi without remote; need same WiFi settings set to operate. Catch-22.Doesn't work with universal remotes that work on IR; annoying having to keep an extra remote handy.Supports BlueTooth but can't autosync with phones, mice, keyboards unless you have the remote with you.", "verified": true, "helpfulness": "0/0", "author": "Mario Kroll \"Mario\""}, {"rating": 4.0, "review": "I like it.", "verified": true, "helpfulness": "0/0", "author": "David Liford"}, {"rating": 5.0, "review": "GREAT PRODUCT", "verified": true, "helpfulness": "0/0", "author": "Jimmy Durante"}]