[{"rating": 3.0, "review": "I love the joy and the ease of using the Fire TV Stick, as apposed to viewing my movies on the internet, but it loses my network often. I bought two of these. Maybe a firmware update will cure all soon. The size is impressive too. Bulky equipment drives me crazy.", "verified": true, "helpfulness": "0/0", "author": "onlyme"}, {"rating": 3.0, "review": "The fire tv stick does everythings it suppose to do great, except one thing, mirroring!Everytime I tried to mirracast my phone or my laptop running Android Lollipop and Windows 8, the stick recorgnize correctly but drop at when both are try to connecting. I've searched around the web and many people had the same issue, and many point out that this is because amazon want it that way, the stick would work with fire phonr or fire tablets, not others.If the fire TV stick can be root to make it able to mirror my phone and laptop, I'd rate it 5 stars.!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I use the Fire TV Stick for my basement TV and have the larger Fire TV installed on my family room TV.  It appears to work identically to the larger unit, works quickly in navigating menus and costs much less.The lack of voice search on the remote was an initial let down, until I loaded the Fire TV app on my iPhone.  This free app provides voice search and works well with the Fire TV stick.  You can play games, however, the big ones (like Modern Combat 4) will take up too much memory on this unit so don't expect it to do everything the larger unit is able to do.All in all a great little streaming stick that is worth the money.", "verified": true, "helpfulness": "0/0", "author": "Keith Phillips"}, {"rating": 5.0, "review": "Love the Fire TV Stick", "verified": true, "helpfulness": "0/0", "author": "Lee"}, {"rating": 5.0, "review": "Working great for me.  Setup is quick and it runs much faster then my Sony Blu-ray player that I was using to access Amazon Prime and other internet apps. The little remote is easy to use and very intuitive.  I was thinking of getting the Google Chrome stick, but I'm glad this came out before I did. Also nice that I can upload my pictures to Amazon cloud and display them on the TV.  This up load is a bit slow, but it works fine.  Best 20 bucks I've spent.", "verified": true, "helpfulness": "1/1", "author": "Ronald Dufel"}, {"rating": 5.0, "review": "Great to watch Netflix and Amazon Prime shows!", "verified": true, "helpfulness": "0/0", "author": "It's Seany"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "My AppleTv is still my favorite since it works with my iOS devices, but I like having this device and the remote is 10x better than the AppleTV remote.", "verified": true, "helpfulness": "0/0", "author": "Shane"}, {"rating": 5.0, "review": "I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "In short, HORRIBLE!!!I love Amazon and everything they provide in/with Prime and their store.  This product brings great shame to Amazon.  This unit should be recalled and discontinued immediately.", "verified": true, "helpfulness": "1/2", "author": "90Proof"}]