[{"rating": 5.0, "review": "So easy! Plug it in, go through the setup and enjoy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Deb Silliman"}, {"rating": 4.0, "review": "Needs Vudu and CBS All Access, but I am otherwise satisfied.  Zippy for a media stick.  Replaced my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Bradley Olinger"}, {"rating": 4.0, "review": "Awesome & easy to use", "verified": true, "helpfulness": "0/0", "author": "Amy E Wallace"}, {"rating": 4.0, "review": "I like it is very good it's better than chromecast", "verified": true, "helpfulness": "0/0", "author": "Winston G Roach"}, {"rating": 5.0, "review": "Very easy to use, works great and allowed me to finally get rid of that large monthly cable bill.", "verified": true, "helpfulness": "0/0", "author": "Anna Marie Schmidtgall"}, {"rating": 1.0, "review": "Worst experience as it doesnt work outside usa , so device been threwn away .", "verified": true, "helpfulness": "0/0", "author": "Younis Shaker"}, {"rating": 3.0, "review": "it is ok, just hard to beat a good computer hooked up to a big screen tv.with slow internet, it's not as good as the computer.but after amazon stopped letting you down load the videos that i have.just about the only way to watch them. or no the computer.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just amazing product beat the Apple TV easy", "verified": true, "helpfulness": "0/0", "author": "JESUS RODRIGUEZ"}, {"rating": 5.0, "review": "I own a Roku3, an AppleTV, and a FireTV Stick. Each has their advantages.FireTV Stick:IMO the best feature on this product is its support for captive portal login and authentication.A Captive Portal is a WiFi login page that usually requires a web browser and something like your room number and your last name at the time you connect to that WiFi (at your hotel room, for example).  When you connect to wifi, FireTV automatically provides a browser that you can navigate with the arrows on your remote.  And you can enter the required info using an on screen keyboard. This is really something different from simply connecting to your home wifi using username and password. I used this FireTV feature at a hotel the first weekend I owned the device and it worked perfectly.Neither Roku nor the Apple TV will do this (except with some fancy router trickery, such as MAC address spoofing).  If you're planning to use your streaming device in hotels, the FireTV Stick or FireTV are pretty much your only choices.  The captive portal is so valuable and unique that I felt compelled to give FireTV five stars despite some other negatives. (Note however, that despite this great feature, some hotels just do not have sufficient wifi bandwidth to support video streaming.  This can be tested by streaming video via wifi using your notebook or tablet.)  Another unique FireTV plus is the completely automated connection to your amazon account during setup, assuming you purchased FireTV by use of your account on the Amazon web site. Amazon has registered the device ID with your amazon username at the time of purchase or shipping, so you don't need to type your username or amazon password during FireTV setup. Impressively quick setup.If you're planning on always leaving your media streamer set up and at home, I'd probably recommend either the Roku or (for apple users) The Apple TV .  My  complaints on the fireTV are a channel selection much more limited than Roku's,  an interface that clearly favors a single content supplier (Amazon), requiring more clicks when accessing other channels such as Netflix, and a lack of Roku's universal search.Roku3:Roku has, by far, the best channel selection, a better interface than FireTV, IMO, and an excellent UNIVERSAL search, now controllable by voice.  Roku's interface is, in my experience, the most enjoyable to use.AppleTV:Airplay streaming from ANY apple device is, of course, a big win for iphone, ipad, and Mac owners, like myself.  In my experience Apple's airplay works very well and is very easy to use for any content from any apple device, even for guests in my home.  I personally prefer Apple's interface over FIreTV's, but it's close.  Another plus for AppleTV is that it's the only device which will buffer an entire movie or TV show, even with rentals.  AppleTV DOES NOT DELAY the start of a movie in order to fill the buffer (it fills as you're watching), but once your buffer is full (which is very fast, and nicely shown), you can be sure you will not be interrupted by subsequent internet traffic.  Full buffering only happens with iTunes video, but unfortunately not with third party apps like netflix.  On the downside, like FireTV,  Apple's channel selection is more limited than Roku's.", "verified": true, "helpfulness": "0/0", "author": "PeteTechGuy"}]