[{"rating": 4.0, "review": "Make side loaded apps appear in \"my apps\" and I'll give it 5 stars.", "verified": true, "helpfulness": "0/1", "author": "James M. Green"}, {"rating": 5.0, "review": "Great device...especially for an HDTV with no apps. Plenty of choices available. Works great with the iphone app that works like an additional remote.", "verified": true, "helpfulness": "0/1", "author": "Barbh"}, {"rating": 5.0, "review": "Got it mainly for Netflix, works perfectly.", "verified": true, "helpfulness": "0/1", "author": "Laura"}, {"rating": 5.0, "review": "Amazing access to everything.", "verified": true, "helpfulness": "0/1", "author": "Hilndrwatchr"}, {"rating": 5.0, "review": "LOVE THIS!  Very user friendly and so much easier to use than the Google Chromecast!  The remote is big enough and everything works great!  AWESOME JOB AMAZON! :)", "verified": true, "helpfulness": "0/1", "author": "Shelley Hudes"}, {"rating": 5.0, "review": "Very small and hides behind my tv.  The android remote works well and can do everything the regular remote can do.  Its pretty fast. I use it for Prime, Netflix, and Plex and they all work great.", "verified": true, "helpfulness": "0/1", "author": "JE"}, {"rating": 1.0, "review": "The Fire Stick disconnects often, even though the internet is working on all other devices and the Wii is working in the living room. I will send back and purchase something else.", "verified": true, "helpfulness": "0/2", "author": "Emma Brice"}, {"rating": 5.0, "review": "Absolutely love it!", "verified": true, "helpfulness": "0/1", "author": "Melisse Lowe"}, {"rating": 5.0, "review": "Love the user friendly interface and the apps like netflix, hbo go and others... I have 2 of this little guys, one on my outdoor tv and the other in the guest room, super handy!", "verified": true, "helpfulness": "0/1", "author": "Pato Sanchez"}, {"rating": 3.0, "review": "Way to small, not enough  definition in center button. The center part is smooth, outer ring real smoothalways have trouble staying in center circle or outer circle. and make too many mistakes.", "verified": true, "helpfulness": "0/1", "author": "Maneho"}]