[{"rating": 5.0, "review": "I have roku 3 and the fire tv stick. Can not go wrong with either one but this is more than half the price.", "verified": true, "helpfulness": "0/0", "author": "Tammy Parmer"}, {"rating": 5.0, "review": "As described", "verified": true, "helpfulness": "0/0", "author": "Tracy Mills"}, {"rating": 5.0, "review": "Best purchase I have made in a long time! Very easy setup, I loved how it walked you through everything since I'm not very tech-savy. The fact that it bundles all of your accounts is even better. Great selection too!", "verified": true, "helpfulness": "0/0", "author": "Taylor"}, {"rating": 5.0, "review": "It works like I hope, the difficult thing was how to open the remote in order to insert the batteries,finally, going on Google, I saw by using a glasses mini screwdriver it was possible.i hope this will help with the remote control.Viviane", "verified": true, "helpfulness": "0/0", "author": "viviane  chriqui du levant"}, {"rating": 4.0, "review": "so far so good", "verified": true, "helpfulness": "0/0", "author": "RKE"}, {"rating": 4.0, "review": "I like the fire stick because it is very easy to install and operate.  On mine it will let me watch a few episodes and then it freezes.  I am going to call Amazon and see if this is normal.  Maybe I am not doing something correctly.  I do love it and watching shows is easy.", "verified": true, "helpfulness": "0/0", "author": "Donna Montgomery"}, {"rating": 4.0, "review": "very unclear about what is free and what is not free.", "verified": true, "helpfulness": "0/0", "author": "edith marshall"}, {"rating": 5.0, "review": "Great way to get Amazon Prime video on your TV. Easy to set up and use. I would have liked to be able to have the features of a competitor that I could get internet streamed also.", "verified": true, "helpfulness": "0/0", "author": "Kirk Kloeppel"}, {"rating": 5.0, "review": "This is so easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "loretta"}, {"rating": 2.0, "review": "Needed some printed directions with the stick.....could not get CC connected for movies.......called customer service.....they couldn't help....said that they would call back within 24 hrs....still waiting", "verified": true, "helpfulness": "0/0", "author": "Catherine Kangas"}]