[{"rating": 5.0, "review": "Very good watching lots of movies", "verified": true, "helpfulness": "0/0", "author": "Ken bush"}, {"rating": 5.0, "review": "it's worth every nickel", "verified": true, "helpfulness": "0/0", "author": "howard wilson"}, {"rating": 5.0, "review": "Best purchase ever!! It saves us a lot of money. Way better then buying a smart TV. We love it, and we highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "Dannia Nava"}, {"rating": 5.0, "review": "connected fast, works great. Amazon does it again.", "verified": true, "helpfulness": "0/0", "author": "C. Walker \"Dozrman\""}, {"rating": 1.0, "review": "Worthless, I have not even been able to listen to a song. Forget watching any streaming video.hFirst off, No Volume Control. The only TWO ways you can not blast your ear drums out. One, buy a TV which has volume control. Two buy a \"DAC\" Digital Audio Controller. Three buy a Home Theater PC. I paid $80 for a pair of computer speakers.... guess what the Amazon Fire like blasts the audio so loud that even these speakers can Not turn the volume down.Second, Even if you get the franking Volume so its not blasting your eardrums out.... unlikely, without spending 4x what the franking Fire Stick costs.... You STILL Can Not Watch Any Video..... Why? Because the franking idiots expect you to stream 1080p video over WiFi !!!!... Is there a way to knock it down to what WiFi can handle, such as 360p... NO, No you can not. It has to fracking \"Stream\" 1080p video over WiFi!!!What a worthless peace of crap. I am so Ultra Pissed off.", "verified": true, "helpfulness": "0/0", "author": "thomas dwyer"}, {"rating": 4.0, "review": "I was thinking  that is more about live tv", "verified": true, "helpfulness": "0/0", "author": "atenerp"}, {"rating": 4.0, "review": "For some reason was thinking this one had voice search but just downloaded free app to phone to use the voice search option but Liking it so far.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 4.0, "review": "A great App, but the More Like This would be good, also, sharing, like Youtube would be good.", "verified": true, "helpfulness": "0/0", "author": "Edwardegrahamgmail Com"}, {"rating": 5.0, "review": "The Fire Stick met or exceeded my expectations except one.  There is no Dish Anywhere application.  Other 5han that, great.", "verified": true, "helpfulness": "0/0", "author": "William Powell"}, {"rating": 5.0, "review": "Love the fire stick. Have satellite but sometimes nothing on worth watching. Now I can watch a lot of great old movies.", "verified": true, "helpfulness": "0/0", "author": "DEBBIE CRACCO"}]