[{"rating": 5.0, "review": "After testing and getting disappointed with a chromecast, I decided to try the Fire Stick, is a very interesting device, that works very good. I did not have WiFi signal issues, and the inclusion of a remote control is a big plus. It is definitively a gadget I could give to my parents for everyday use.", "verified": true, "helpfulness": "0/0", "author": "Jairo Lopez"}, {"rating": 1.0, "review": "I really wanted to like this but it drops the network connection constantly even though my router is less than 20 feet away.Sound stutters and makes an obnoxious noise. Unplugging and resetting fixes this for a while.Listened to some music from my Plex server on my phone and casted it to the stick. That album randomly started playing again on its own until I finally had to unplug it. I really wish I'd just have gotten one to try out before I bought two and talked my mom into buying two.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "This is an interesting device.  Out of the box it is about as long as a deck of cards and about a 3rd as wide.  It seems to be well built.  My only gripe with the outside is that it doesn't have a \"power\" light of any sort to let you know that it is working.The first time I plugged it in it only worked on 1 of my 6 HDMI capable devices.  Fortunately after I found a screen that it worked on I was able to download the firmware update which fixed that problem.  If I hadn't had a screen that it happened to work on it would have been a problem though and I would have had to send it back.  Hopefully the next batch will have the update on them already.It works quite well.  The menu navigation is fast and everything seems to be pretty easy to use.  The Prime Music functionality is really not that great.  You can only play artists and tracks you have already found previously and put into your library.  There doesn't seem to be an easy way to search tracks or play a selection of tracks based on a musician or style.The other thing that bothers me about this device (and it may not be the device it may be Amazon's video service itself) is that when I'm watching a movie or show every 5 or 6 minutes the video playback will stutter.  It comes back almost immediately but the entire screen goes black for 2 - 3 seconds.  Granted 2-3 seconds isn't that bad but it is SUPER annoying.Overall, it is a good device for consuming Amazon content but it is clearly a first generation product.  Considering I paid $19 for it I can't complain at all.", "verified": true, "helpfulness": "0/0", "author": "CaptainBasic"}, {"rating": 5.0, "review": "The installation was easy though for some reason I wasn't aware that the stick needed to be connected to power (I thought, like a USB, it would get it from the device it was attached to).  The software was automatically updated and then a nice short video introduction was presented.  I then connected to my NetFlix account and continued watching a show which I had started earlier that day on my iPad.  The control is simple and easy to use.  I intend to move the stick to a TV in the garage and will report back if there are any difficulties in doing so.", "verified": true, "helpfulness": "0/0", "author": "stevew"}, {"rating": 5.0, "review": "Great product. Better streaming and apps than the Xbone. This is also better than the chromcast.", "verified": true, "helpfulness": "0/0", "author": "Edward Nigma \"TheEnigma313\""}, {"rating": 3.0, "review": "It's worth  the risk at $19 (for Amazon Prime customers).  However the choice of apps is limited AND there is no support for the remote control app on the Apple iPhone.Why is the usb power cord placed on the top/bottom of the device instead of the end?  Be prepared to juggle some hdmi connections in order to find a socket for this device.My biggest complaint is with the marginal remote control.  It is extremely awkward to use, forcing me to enter login names and passwords multiple times before getting them right.I also own the Roku Streaming stick and prefer it to this one.  Sorry, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Robert Peters"}, {"rating": 5.0, "review": "Just got it, so this review reflects setup.Easy - plugged it in, found and signed in to my WPA2 WiFi, updated firmware, signed in to Netflix and Pandora, and tried it out - success!And, this is all through my Sony AV receiver! Whoo-hoo!I'm not going to rate the android app here, but they have more work to do there - I'm not sure they chose the right approach for the touchpad...I'll stop by in a month or two to revise based on long-term use...", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "Unless you got this at the giveaway price of $19, I would stick with the Amazon Fire tv box. I guess I'm a techie, and we tend to be frivolous with gadgets and buy redundant technology just to check them out. So I either own or have tried them all. I am biased against the stick because it performs poorly with PLEX. Even its competition, the supposed weaker Chromecast, streams flawlessly with Plex. Xbox One, Roku, and the Amazon Fire TV box all perform PLEX perfectly.If you don't know or don't use Plex, then you'll be happy with the Stick. It does everything else well. If you bought this for Plex, you might want to just buy the Fire TV. If you think about it, the stick isn't a bargain compared to the Fire TV. From $99 to $39 retail, at first glance, you may think it's a bargain, but it isn't. You don't get the Voice remote like you do with the Fire TV, that's $30 sold separately. So when there's no black Friday, no cyber Monday, and we're back to retail as usual, that's $70 total for the stick and the voice remote. Might as well pay an extra $30 to get the box where you get double the power, USB port for accessories like a keyboard. If you know what SIDE-LOADING is, you're going to want to use a keyboard when using Android apps that are not made for the Amazon interface. There is also an Ethernet port on the box.If the lesser Chromecast can do Plex nicely, then I'm thinking this isn't a hardware issue, and hopefully a software update can solve the problem. Others who are using it for Plex and are happy are making me per-PLEX-ed. LOL! I wonder if they had experience with any other gadgets to compare the quality to. But there are plenty of reviews similar to mine, with the conclusion that this is bad for Plex.BTW, if these box makers would just give us a HDMI input, they can completely wipe out the Smart TV business. Seem so easy, but only the high end Xbox One has this feature.-----------------------------------------------------Dec 4th, 2014 REVIEW UPDATE-----------------------------------------------------I have now revised my review for this product. Initially I was biased against it because I thought it performed horribly with Plex. I thought I couldn't use 1080p, so I had to set the quality to 720p which gave me so much blocky artifacts. As it turns out, I made a simple rookie mistake in 1080p mode. In my plex setting, when I would set the quality to above 8 mbps for 1080p, but to test out my movie, I would go into the RECENTLY VIEWED section and I would RESUME a movie. Well, the terrible quality and stuttering comes from the fact that I'm starting mid-stream cold, no buffering. I played around with it again today, this time I started all the movies from the beginning and it streamed perfectly and quality is outstanding!I initially rated the stick 2 stars. I still will not give it 5 stars because the value to me is deceptive. The voice remote is sold separately for $30 which brings the grand total to $70. At that point, you might as well get the Box version for $99 for all the reasons I mentioned above. If you got this for the pre-order price of $19, then it is a 5 star all the way!", "verified": true, "helpfulness": "1/2", "author": "GhostFaceReviewer"}, {"rating": 3.0, "review": "Many subscriptions are needed.", "verified": true, "helpfulness": "0/0", "author": "Corey"}, {"rating": 5.0, "review": "This thing is pretty amazing. It is worth it at twice the price.", "verified": true, "helpfulness": "0/0", "author": "telepathic monkey"}]