[{"rating": 5.0, "review": "😎😎😎😎😎", "verified": true, "helpfulness": "0/0", "author": "ricardo zuloaga sanchez"}, {"rating": 4.0, "review": "Wished it had the voice control same as the TV, it would have been even better if it self charged from the HDMI slot, other than that we love it, great alternative too cable/satelite", "verified": true, "helpfulness": "0/0", "author": "Corbyusa"}, {"rating": 5.0, "review": "LOVE THIS! We are amazed at how well this thing works and how clear the picture is. A life saver if you don't have cable!", "verified": true, "helpfulness": "0/0", "author": "Nina"}, {"rating": 4.0, "review": "It's ok, the price was good (free), and the remote works very well.  I wish it had access to some kind of browser for the internet, but it doesn't.  It works fairly well, sometimes it kicks you out to the homepage while watching a show.  I haven't had it that long and I got Sling tv with it.  It's ok as well, I had to pay for three months of service and I got the fire stick for free.  I would like to see more channels on it and some shows are blocked out, probably popular shows.  Overall the Firestick is nice and easy to use.  Nothing about it screams you have to have it.  JMO", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Moved in with my sister while our new home is being built and she does not have cable upstairs. The Fire Stick is great. Plug into any TV and wall outlet and get Tv, movies, cartoons for the kids, just about anything. Wonderful little device to have around!", "verified": true, "helpfulness": "0/0", "author": "KenWood"}, {"rating": 2.0, "review": "you advertise thousands of free movies and videos available through Fire Stick.  I find very few. Perhaps I do not know how to operate the system.", "verified": true, "helpfulness": "0/0", "author": "paul"}, {"rating": 5.0, "review": "Fantastic item. Love the shows and movies I have access to.", "verified": true, "helpfulness": "0/0", "author": "LSR \"LSR\""}, {"rating": 5.0, "review": "Loving it.", "verified": true, "helpfulness": "0/0", "author": "Fabio Cavalcante Barros"}, {"rating": 4.0, "review": "I ordered the firestick after frustrating experiences with my DVD connection and Netflix. It came quickly, was VERY simple to install and get started, and is much less frustrating to use than my dvd. I am a retired English teacher who has little tech experience, so this is easy for ANYONE. The remote is simple; one button and Amazon Prime as well as Netflix are instantly available. The fifth star is missing above because I did have a glitch which is evidently common. I got a message that connection to my WiFi had been lost. I had to do some internet sleuthing to find out the fix - which was simple. I unplugged the firestick (which felt very warm) and let it cool off. When I plugged it back ina worked we again.  I have only had that happen once in the weeks I have owned it.  It was definitely a good purchase. I really enjoy being able to watch Prime videos and tv shows on my tv. Before the firestick, I could only watch those on my Kindle Fire.", "verified": true, "helpfulness": "0/0", "author": "Parrie200"}, {"rating": 5.0, "review": "The Fire TV Stick does it all. Not only can you watch all Amazon Prime content, but Amazon does not talk about the ability to add apps enough. The ability to add apps for additional content makes this device a top notch product. The streaming is smooth and the device is awesome because it is portable from one TV to the next. Add in your smart device with the Amazon TV app and you have a very versatile system for all the content you could ever want!", "verified": true, "helpfulness": "0/0", "author": "Chris"}]