[{"rating": 5.0, "review": "I am so glad I purchased this device.  For weeks I was trying to figure out how to connect my computer to my tv, but my computer did not have an hdmi port.Well with the amazon fire stick, I don't need one. The stick makes my computer a smart tv. How awesome is that! I love this stick, my only regret is that I did not know about it sooner.", "verified": true, "helpfulness": "0/0", "author": "Latrina Briggs"}, {"rating": 4.0, "review": "Good, reliable, amazing", "verified": true, "helpfulness": "0/0", "author": "WYMS GUERRIER"}, {"rating": 5.0, "review": "Easy to use, great price, awesome product!!", "verified": true, "helpfulness": "0/0", "author": "Gilberto Jimenez"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Cathie S"}, {"rating": 2.0, "review": "It worked great for a while but now there are many times that the picture freezes and the sound continues. After 10-20 seconds the picture then runs at high speed to catch up with the sound.", "verified": true, "helpfulness": "0/0", "author": "rk"}, {"rating": 5.0, "review": "works great and has an awesome picture", "verified": true, "helpfulness": "0/0", "author": "hailly blood"}, {"rating": 5.0, "review": "It is a wonderful addition to my bedroom TV in getting Netflix as I usually cannot get as many channels there as in the living room cable TV provides.  I am somewhat disappointed that many of the Amazon shows are either rent or buy.  Not as many free things to watch bothers me a bit.  I had to purchase For Richer, For Poorer which was a movie made a decade ago.  Islands in the Stream movie two decades ago not free with prime.But the fire stick is working fine.  Not a ROKU, but it works okay for $39.00.", "verified": true, "helpfulness": "0/0", "author": "Deborah K. Vaughan"}, {"rating": 5.0, "review": "EXCEEDED my expectations!! I have 2 Fire sticks and the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 5.0, "review": "Love!!!", "verified": true, "helpfulness": "0/0", "author": "L. Matthews"}, {"rating": 2.0, "review": "This thing is a bigger pain than it is worth. More often then not I get a big blue screen on it claiming  an \"HDCP Unauthorized Content Disabled\" violation. Seriously? I have to unplug it from the tv and the power. Sometimes that works but other times I have to sign out of all my accounts and sign back in. I love my Roku though. I've never had a problem with it and it has more to offer.", "verified": true, "helpfulness": "1/2", "author": "Wanda"}]