[{"rating": 5.0, "review": "Love our Fire TV on the living room TV, thought about getting more but then Amazon came up with the Fire TV Stick and we bought these for our boys room TVs.  They are a great alternative for there use.Recommend both the Fire TV Stick and Fire TV.  Both have there strengths, so pick the right one for each of you TVs.The Fire TV sticks allow for most Fire TV games and the streaming video is great.For voice control use the Fire TV Android app on your phone or Kindle Frre.I do recommend you make sure you have good WiFI, especially when running multiple streaming devices.  My one son's room was on the edge of our old WiFi set up.  Just upgraded to a Linksys WRT-1900AC works great with Cat 7 cables to the main router.  The With all our Kindles,the Fire TV, Fire TV sticks and laptops you need the bandwidth.Thankfully, Amazon has everything needed.", "verified": true, "helpfulness": "0/0", "author": "K. Kirschke"}, {"rating": 4.0, "review": "kids very happy with it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"audie\""}, {"rating": 5.0, "review": "Especially for Amazon prime, this is a great unit.  Granted, I got it for $20, but it compares well with my Roku units in terms of picture quality, useability, and selection.  The only thing missing is HBO Go.  Setup was easy, even considering my household wireless is a non-standard, non-broadcasting SSID.  Most of the negative reviews are the result, I believe, of not using the included micro USB power supply.  If you look at the power supply, you may notice that it has a 1 amp output.  Most TVs (or computers, for that matter) output 500 mA (1/2 A), the USB standard, if they have a USB plug at all.  The Fire Stick needs more, much like an iPad or an Android tablet.  Users - don't get stupid on the power.  And if you do, don't post a negative review.  RTFM.", "verified": true, "helpfulness": "0/0", "author": "Deek"}, {"rating": 5.0, "review": "Not as fast or smooth as the FireTV, but still well worth the money!", "verified": true, "helpfulness": "0/0", "author": "CommonSense"}, {"rating": 5.0, "review": "Love it so very much I ordered two... I have uploaded all 9000 pictures to my Amazon cloud and my entire itunes play lists and now can listen to them or see pics.. oh also have Prime movies... Love it!", "verified": true, "helpfulness": "0/0", "author": "Lake House Granny"}, {"rating": 5.0, "review": "I ordered mine immediately when it came out, and I received it almost 2 weeks ahead of schedule.Simple install with everything included. Starts up to a cute intro video.Performs excellent, have never seen any lag so far.  It even does a pretty desktop pictures screensaver.I wish I could give one to everyone for Christmas but demand is just too high right now to do that before end of year. I know what everyone's getting for their birthdays this year...", "verified": true, "helpfulness": "0/0", "author": "D"}, {"rating": 5.0, "review": "Had a problem when I first started using it.  Every 5 minutes or so the screen would go black.  Pulled the power and plugged it back in, been great ever since. Everything works fine, nice picture and seems to stream well.  Is it better than my Roku, no but it's just as good.", "verified": true, "helpfulness": "0/0", "author": "BuzzFlipperFish"}, {"rating": 5.0, "review": "Very easy to use, especially love the phone app and how easy it is to work.  Very simple to install", "verified": true, "helpfulness": "0/1", "author": "Celeste Ledesma"}, {"rating": 5.0, "review": "Love this product.  Set up was a breeze and I am very techno challenged.  I cancelled my cable and have saved a bundle of money.  Thanks for such a wonderful product.", "verified": true, "helpfulness": "0/1", "author": "KLinn"}, {"rating": 1.0, "review": "If you don't find this helpful, then ask WHY DOES AMAZON HAVE SO MANY REVIEWS FOR THIS ITEM DATED BEFORE ITS RELEASE???? Been seeing alot of copy and paste reviews on here, suspicious! This is just pay per view, everything or loaded to the brim with commercials. Even You Tube.I was already a PRIME member for over 5 years when I bought this, when TRYING to use this little SCAM MACHINE, I hit the button that said, Watch at $0.00 cost for PRIME MEMBERS, my results were it charged me AGAIN for another prime account at $99 bucks INSTANTLY. Mine don't expire for 4 more months. Worst part, I only put money on the debit card I use for this account AS I USE IT to keep down chances of ID theft, so it bounced the card ( another $15 fee on me). How exactly, when i had to signed INTO THE ITEM with my account to set it up, but got hit for $99 bucks when clicking on ANYTHING in it.EVERYTHING ON THIS P.O.S. Device is $$$$$$$$$$$$$$$$$$$$$$$ and MORE $$$$$$$$$$$$$$$$$.$9 a month for Roku, and you get all the same stuff. BUT, from 99 cents to $30 per view, you get this???? WHAT!To use ANY OPTION it cost you. Even on Crackle all the movies you click on shows you commercial after commercial then the WRONG MOVIE! EVERY TIME!Thought I was getting access to what I was ALREADY PAYING FOR! NO F'n way dude, everything is pay, pay or its a joke joke.Even YOU TUBE on this is loaded to the hilt with commercials.Buy you that little Mica unit, a card, download videos and watch them yourself. This is a total waste of time and money.Unless your Cable or Satellite bill is $200 a month+ how is this cheaper after 30 days of use when its ALL pay per view?I feel lied to, and tricked.", "verified": true, "helpfulness": "2/8", "author": "Madashell"}]