[{"rating": 5.0, "review": "I pre-ordered this product and LOVE IT!!!Watching movies on our big screen, listening to my prime music while I clean (and seeing the lyrics on screen)LOVE LOVE LOVE!!!", "verified": true, "helpfulness": "0/0", "author": "Laura Lux"}, {"rating": 5.0, "review": "I just received my Fire TV stick as a gift so I've only owned it for 5 minutes but I think it's going to change my life. I have not had cable tv in years so I've been stuck watching shows on my computer or going through complicated setups to connect my computer to TV. Not to mention, the hassle of trying to find things like free news and \"over the air\" channels.I have only scratched the surface of what the Fire TV Stick has to offer but I couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "E.M.L."}, {"rating": 1.0, "review": "Giving this away- every time it drops wifi it can't reconnect. I have tried everything and am entering it in correctly but it won't reconnect unless I reset to factory settings and login and reload everything. We don't have cable and stream everything so this is a huge pain. Disappointed bc we love love love prime :( too bad", "verified": true, "helpfulness": "1/2", "author": "shandana matin berry"}, {"rating": 4.0, "review": "A little disappointing that it does not have the Fox News App... I have a Roko and it does... Maybe in the future...", "verified": true, "helpfulness": "2/2", "author": "E. Smith \"ericpenn\""}, {"rating": 5.0, "review": "First I want to dispel just a couple misunderstandings I've seen in other reviews here.(1) You CAN use the USB port on your TV to power the Fire TV Stick. But this depends on if your TV can output enough power on that port. The TV in my bedroom was not able to supply enough power via the USB port to adequately power the Fire TV Stick. However the TV in my living room was able to power the Stick just fine.(2) Related to the above, I've noticed a complaint that the device takes a moment to load up when you first turn on your TV. This is due to power no longer being supplied to the device when your turn your TV off if you have it plugged directly into the TV's USB port instead of using the wall charger. I would suggest using the wall charger provided if possible in order to get a proper power supply to the device and to avoid having to let it boot up every time you turn your TV on.I've tried now using an Apple TV, Chromecast, and setting up both XBMC and Plex on a Mac Mini all to provide some sort of media center solution where I could go to one central device and watch all my content. The Amazon Fire TV Stick is the first device that has actually allowed me to do that with ease. It connects to my Plex media server for all my locally owned content, and has built in apps to stream from the services I subscribe to, Netflix, Amazon Prime, and Hulu Plus.As for the type of device it is, the most similar produce I've tried is Google's Chromecast. My hope for the Chromecast was that it would have been an affordable way to stream my media to any TV. After actually using the Chromecast though, I was very disappointed to find that it has no user interface of its own. You must use various apps and other devices in order to \"cast\" content to the Chromecast. It felt very disjointed and decentralized which was completely the opposite of what I was looking for. I had also hoped that its small size would make it an option for portability so I could watch my favorite shows and movies while I traveled. This proved to be another point of disappointment for the Chromecast as it was incapable of connecting to most public WiFi networks such as you might find in a hotel. After receiving my Fire TV Stick, I actually decided to do a direct comparison of the performance and picture quality from the Chromecast vs the Fire TV Stick. Streaming the exact same content to both, I found that the Chromecast was dropping frames, creating a noticeable jump, or stutter, in the video, whereas the Fire TV Stick played the content smoothly. The picture produced by the Chromecast would also often become blocky or pixelated looking, especially during scenes with a lot of movement. The Fire TV Stick remained clear and crisp throughout.The Amazon Fire TV Stick brings all my media together in one place and makes it very easy to access. Streaming content has been fast with no slow downs, buffering, or stuttering. The clarity of both the user interface and the HD streaming content is fantastic. The voice search feature works incredibly well. Browsing through the Fire OS interface is very fast and fluid. The navigation is easy to understand. Setup was surprisingly easy. As soon as I took the device out of the box and plugged it in, it was already signed in to my Amazon account I was ready to start watching my shows as soon as the short intro video finished. It also works great with my Sony surround sound system.I purchased The Amazon Fire TV Stick in hopes of finding a simpler solution to watching content from Amazon Prime at home and with better picture clarity than my current devices. But it has exceeded my expectations. This device has been a joy to use and I would definitely recommend it to anyone.Despite loving how well the Amazon Fire TV Stick connects to various services I use and the overall performance of the device, I did come across one problem. I tried playing music both through the Spotify Connect app and from my Amazon Prime music library and found that the audio quality was actually pretty bad. I'm a bit confused as to why the audio quality problem is only present when playing music though as my movies and tv shows sound fine. I tried adjusting various things in my setup to find if there was another piece of equipment degrading the audio quality, but it does seem to be a problem with the Fire TV Stick itself. Of course though, your experience may vary.", "verified": true, "helpfulness": "1/1", "author": "Donavon B."}, {"rating": 5.0, "review": "Two words...LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "chenderson76"}, {"rating": 5.0, "review": "After three days this device is functioning great. Much better Netflix interface than my Sony B Ray. Droid control program ok. Really glad they included an extender for the HDMI as my Sony receiver has little space between inputs, and with the usb cable connected, just did not work. My Amazon Prime was pre-installed, worked perfectly. If I had to give up one, not sure which would go, ChromeCast or the new Stick....", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "I cut cable and this device fills the gaps.  It is smooth and quick.  Many Apps to add.  The gaming apps are a neat add on.  I have no need to use my Smart Blu-Ray players anymore for the app part of them.  This is faster than those players.  I have two of these.  A Fire TV box will be next, soon!", "verified": true, "helpfulness": "0/0", "author": "RT"}, {"rating": 1.0, "review": "I wanted to love this device and for the first day i did, but since then i can not get it to connect to nmy wireless network anymore.  Keeps saying authentication error and asks me to re-enter my PSK over and over and over...  I have many other devices from laptops to a chromecast that use the same wireless without issue.  Amazon needs to find the issue with this and resolve it quick or the Stick is going back.UPDATE:  After messing with my wireless settings it seems the FireTV stick is taking to long to finish the the wireless authentication so I upped the timeout to 500ms and since then i haven't had any issues with it (so far).  All my other devices continue to work fine. Hopefully someone will read this and it will help them.", "verified": true, "helpfulness": "2/3", "author": "Ben N."}, {"rating": 5.0, "review": "My Fire TV Stick Arrived earlier than I anticipated which was a plus! I Plugged it in to find that it works without the supplied power supply and usb cable, however it does run slightly faster with the power supply and cable that it came with. This is an amazing asset in our home! no unsightly cables hanging behind the tv and the possibilities are endless. I have put it through its paces and love every aspect of it..... if only it could control the tv volume I would never need to reach for my tv remote again! all-in-all I am fully satisfied with the Fire TV stick and all of the options it comes with! I was up and running as soon as I turned my TV on! Way to go Amazon, you have once again exceeded my expectations!", "verified": true, "helpfulness": "1/1", "author": "Michael Goulet"}]