[{"rating": 5.0, "review": "I gave the Fire TV Stick 5 stars because it works perfect. I set it up in 5 minutes. It programmed itself. It found my wireless in 10 seconds and prompted me what to do. I have an Amazon account so it arrived programmed in my name. I already have a Smart TV so it duplicates some items such as Netflix etc. but with my Amazon Prime I now get movies and TV series not offered else where. I recommend the Stick to anyone with a HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Sara \"maddog504\""}, {"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/0", "author": "Alexander"}, {"rating": 5.0, "review": "Amazon has their finger on the pulse of what customers want, the Fire Tv Stick is fantastic and at a great price, it also does Kodi/Xbmc.  it is truly outstanding!!!", "verified": true, "helpfulness": "0/0", "author": "HarryMcOne \"HarryMcOne\""}, {"rating": 1.0, "review": "Awesome. Exceeds my expectations!!!", "verified": true, "helpfulness": "0/2", "author": "Mark Reeves"}, {"rating": 5.0, "review": "I am amazed how easy this was to connect, and to use, and to watch the shows.  Excellent product.", "verified": true, "helpfulness": "0/0", "author": "E. Roberts \"make life easy\""}, {"rating": 5.0, "review": "If you have cable or satellite service without Fire Stick you're seriously missing the boat.  Start with an Amazon Prime account then DROP any additional services from you cable or satellite provider because you'll get most of that back with your new Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Desi \"Destiny K. Coleman\""}, {"rating": 5.0, "review": "Worked great. Love it.", "verified": true, "helpfulness": "0/0", "author": "2Treks"}, {"rating": 5.0, "review": "AWESOME!", "verified": true, "helpfulness": "0/0", "author": "JennMM"}, {"rating": 5.0, "review": "This product is awesome! In the words of my father, it makes a dumb TV a smart TV", "verified": true, "helpfulness": "1/1", "author": "Michael Wadsworth"}, {"rating": 4.0, "review": "The Fire Stick is a great product. Worked out fine when, I figured out to go to the HMDI 2 part on my Samsung 2009 section on my TV.\"source\" the go down to HMDI 2, and the Menu came up. It didn't come up automatically. And watching YouTube Videos of how to Install didn't help they kind of skip that part or it comes up automatically on newer TV's or not as Tech challenged as I am.Since I am a Amazon Prime member and have other Amazon Cloud etc. My Information was automatically there was no problem on setting up. Yes I have somewhat problems on getting on and some waiting but that could be mainly my Internet speed and less to do with the Fire Stick. The movies and shows work great what it gets going. I love what the stuff on the TV or trying to watch on my Kindle Fire.", "verified": true, "helpfulness": "1/1", "author": "Julie A. Requa \"grandmathora\""}]