[{"rating": 3.0, "review": "It's very good but some applications like yup tv keeps crashing", "verified": true, "helpfulness": "0/0", "author": "JSK \"Chhangani\""}, {"rating": 1.0, "review": "I am so not happy with one of my firesticks  It won't even work in my bedroom. I am a Nexflix subscriber. Have any suggestions?", "verified": true, "helpfulness": "1/2", "author": "Cindy Johnson"}, {"rating": 4.0, "review": "I like the Amazon fire stock but u do t like amazon prime it's exactly like Netflix but with older movies", "verified": true, "helpfulness": "0/0", "author": "Kollin Murray"}, {"rating": 5.0, "review": "Has replaced my Chromecast... Just too bad it can't stream YouTube videos!1/17/15: Edit: I was wrong. Found an app on the Firestick that DOES let me stream and interact with my phone for YouTube videos!  6 stars!  (if I could)", "verified": true, "helpfulness": "2/2", "author": "R. Kuipers"}, {"rating": 5.0, "review": "Bought this for my mom, she isn't tech savvy but manages to use this with ease, works well and is easy to set up.", "verified": true, "helpfulness": "1/1", "author": "Kay Jay"}, {"rating": 3.0, "review": "This device works as it should but I have trouble physically attaching it to the back of my receiver.  While I can use the included dongle to plug it in, I am having issues with the RF reception of the remote because it is buried behind the gear.  I tried getting an HDMI extension cable to move if out from the back of my equipment, but then I could not get reliable HDMI signal.Amazon Prime movies are a big plus and easy to navigate.  If this piece had IR control in addition to RF, it would be much more useful to me.", "verified": true, "helpfulness": "0/0", "author": "Strat-O-Various"}, {"rating": 1.0, "review": "Would love to give this a great review but can't. First the good, the device is small and the remote is great. Setup was easy and the interface is easy to figure out.But then you have the problems. The first was the buzzing that many have talked about. I was able to solve this by plugging the device into my UPS and not the surge protector.The second problem is the one that takes all the stars away. It freezes when watching Netflix. It's easy to tell that the problem is the device and not my connection. We have the fastest connection Verizon offers. I can easy get 75Mbps in speed test with my Airport Extreme and the device is only 10 inches from the Airport. On top of that we can stream Netflix to our PS3, Apple TV or computers with no issues. I really wanted this device to work. If it had gone well I was going to put one on every TV. Much more affordable then adding Apple TV's to every TV.", "verified": true, "helpfulness": "2/2", "author": "Francis C. Bicking"}, {"rating": 2.0, "review": "I thought it would do more, but it doesn't so I returned it. Its a chromecast by Amazon", "verified": true, "helpfulness": "0/0", "author": "AndyL"}, {"rating": 5.0, "review": "Exceeded my expectations. About 2/3 of Netflix movies are free.", "verified": true, "helpfulness": "1/2", "author": "Bernard Littman"}, {"rating": 4.0, "review": "Great device,a must have for your non-smart TV.", "verified": true, "helpfulness": "0/0", "author": "Lee"}]