[{"rating": 1.0, "review": "I wish I hadn't given away my roku. was quite satisfied with the fire tv stick at first. every since the last firmware update, it refuses to keep a wifi connection for any meaningful amount of time. Netflix won't work consistently, will stop and buffer, often times getting stuck on 25%.my phone is testing my Internet speed at over 100mbps. so it's not speed. Netflix on any other device in the room works fine.I'm running enterprise level cisco meraki switch and AP. signal strength is not an issue.I've cut the cord as far as cable tv, so when the stick refuses to cooperate...I have to watch on my tablet or phone.horrible product. stay away.", "verified": true, "helpfulness": "0/0", "author": "ti truong"}, {"rating": 1.0, "review": "Does not work", "verified": true, "helpfulness": "0/0", "author": "Irvin P."}, {"rating": 3.0, "review": "The MAIN issue I have is its repeated inability to connect to Netflix, though I'm able to connect to it via other devices, using the same high speed internet connection .. Ironically, I have NO issues connecting to  Amazon prime. This has been going on for months and would appreciate it being corrected! If it were, it would be a great streaming device.", "verified": true, "helpfulness": "0/0", "author": "Steph"}, {"rating": 5.0, "review": "It works as expected", "verified": true, "helpfulness": "0/0", "author": "LEROY KNOPP"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Set up was very easy and I had none of the connection issues that I experienced with the Roku Stick (since returned).", "verified": true, "helpfulness": "0/0", "author": "K. Rennie"}, {"rating": 1.0, "review": "The fire stick Nerflix app doesn't work very well. Buffers all the time.  This is definitely a problem with the stick.  I've run it side by side with my roku and the roku never falters while the fire stick consistently does.  Check other reviews... Everyone has the same problem.  Amazon help is worthless too, they just run you in circles telling you the issue must be on your side.  Go with roku, chromecast or Apple TV.  I can't think of one reason to go with firestick over these.", "verified": true, "helpfulness": "0/0", "author": "James Cruikshank"}, {"rating": 5.0, "review": "I Love it. It was easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "D.D."}, {"rating": 1.0, "review": "This thing was terrible.  Don't buy it.  There are numerous connectivity and software issues with this device.  Get a roku box or wire your tv to a router", "verified": true, "helpfulness": "0/0", "author": "David Helcel"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Deanna Cristine"}]