[{"rating": 4.0, "review": "The amazon fire is pretty awesome, good app variety, great streaming and it's a  perfectly portable product, fifty times better then my smart tv which was capable of instant streaming about once every two weeks. Glad I made the purchase & am now just waiting to see how the fire stick handles the test of time.", "verified": true, "helpfulness": "0/0", "author": "joyce robles"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 1.0, "review": "I am on my second replacement and it still doesn't work.  I am about ready to just send it back and get my money back.", "verified": true, "helpfulness": "0/0", "author": "Jane"}, {"rating": 5.0, "review": "Love love love it", "verified": true, "helpfulness": "0/0", "author": "Anna Gillard"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Mohamed Bah"}, {"rating": 5.0, "review": "I was surprised! About 7 months ago I ordered a Google Chromecast and spent an entire day trying to figure it out. Finally, out of total frustration; I gave it away and decided to keep my cable service. Then I saw the reviews on the Fire Stick. Reluctantly, I ordered it and to my absolute surprise, it took less than 3 minutes to hook up, sign in and start using..I love it and will be getting more for other tvs in the house. As an added bonus, eventually we are cancelling the extended cable.Now if we can figure out how to download and play games..ugh.", "verified": true, "helpfulness": "1/1", "author": "CATHI"}, {"rating": 5.0, "review": "Does just what it says it will Thanks", "verified": true, "helpfulness": "0/0", "author": "Elmer Haberman \"Elmo\""}, {"rating": 5.0, "review": "It was very easy to register and start using. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Sara"}, {"rating": 5.0, "review": "We don't have a smart TV, because my older flat screen still works great.. and this $25 (bought it during the mega-awesome prime day) bad boy turns my TV into a smart TV. We used to hook up my laptop to stream movies from prime or Netflix, but no more!Easy to setup, easy to use, and has thus far been very reliable. Some people said they've had issues with freezing/pausing during streaming, but we haven't experienced any of that.", "verified": true, "helpfulness": "1/1", "author": "AvidConsumer"}, {"rating": 1.0, "review": "EFFFING RIP OFF!Really? This is a money scam. Everything just costs a little more. WOW! you guys must be happy with this cash cow", "verified": true, "helpfulness": "0/2", "author": "Jose P."}]