[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Chris Etherington"}, {"rating": 5.0, "review": "Love my Amazon Fire TV Stick!  We use it all the time!", "verified": true, "helpfulness": "0/0", "author": "Shely"}, {"rating": 5.0, "review": "Setup was a breeze and very easy to navigate", "verified": true, "helpfulness": "0/0", "author": "rpb2775"}, {"rating": 5.0, "review": "Fire TV stick runs fast, no issues at all! Love being able to stream all my netflix and hulu from my TV without having a need for a smartTV.", "verified": true, "helpfulness": "0/0", "author": "carlson03"}, {"rating": 1.0, "review": "I rebuilt my entire home wireless network with a new broadband modem and new wireless 300gbps dual router and wireless repeater and the Firestick still sucks at streaming.Why does it suck? hard to say. Sometimes you get an awesome picture but usually you get video quality that looks like its streaming to you all the way from the 90s. OR constant rebuffering so that you get to watch about 1 seconds of show for every 20 seconds of it pausing and telling you its rebuffering.This is a constant across and app. Netflix, Youtube, Sling TV (which has its own problems) and Crackle.The unsupported netflix and youtube apps on my 4 year old smart tv run better than this.Some people say its the hardware. Probably. Some people say it amazon server side messing up every thing you watch maybe.All I can say is that you will be unhappy. Unhappy like when you bought the Kindle Fire 1.0.", "verified": true, "helpfulness": "1/1", "author": "K. Kimball"}, {"rating": 4.0, "review": "this item is very cool, but the description is misleading. I was lead to believe that once I get the stick, hook it up and sign up for amazon prime I'd be able to watch whatever I wanted to as much as I wanted to without being charged. however there are still a lot of shows that I want to watch that I have to pay for (rent or buy online). Many of my favorite shows are not available for free on prime and I wind up having to pay for them to see them.", "verified": true, "helpfulness": "0/0", "author": "jason montgomery"}, {"rating": 5.0, "review": "Much better than I thought it was going to be. Love it.", "verified": true, "helpfulness": "0/0", "author": "Page84"}, {"rating": 4.0, "review": "Excellent!!", "verified": true, "helpfulness": "0/0", "author": "michael wilson"}, {"rating": 5.0, "review": "I love my new Fire TV stick. With my Amazon prime I can listen to all the music I want, watch TV series, Movies and by down loading apps I have access to a whole lot more", "verified": true, "helpfulness": "0/0", "author": "greenelke"}, {"rating": 4.0, "review": "works very well with cable...doesn't work with dish network", "verified": true, "helpfulness": "0/0", "author": "morgan"}]