[{"rating": 5.0, "review": "Easy to use and much better viewing than old system with blue ray dvd.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 4.0, "review": "It works really well.  I have an older HD t.v. with only one HDMI port so I had to buy a splitter but no big deal.  It was VERY easy to install and so far as worked well.  I should have probably looked deeper into the free movies/tv selections from Amazon Prime as most of the selections don't fit my tastes but that's me.  For the price, I would and have recommended it to friends.", "verified": true, "helpfulness": "0/0", "author": "Richard Greer"}, {"rating": 5.0, "review": "The Fire Stick is amazing!!!  I'm stupid about computers. I needed to watch Netflix on the TV without being confused.  LAN adapters are too complicated and I'm too lazy to set up my Wii.  I bought this, I plugged it in, and then it worked!!!  Even my mom can work it and she doesn't even understand what wifi is.", "verified": true, "helpfulness": "0/0", "author": "alieshang"}, {"rating": 4.0, "review": "control is rather small.. get lost in the shuffle of the other remotes.", "verified": true, "helpfulness": "0/0", "author": "Joyce Bradley"}, {"rating": 5.0, "review": "Almost the same as the tv box. Great for second tv. Allows me to take full advantage of Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "joseph s. chizik"}, {"rating": 4.0, "review": "I love using it. I got it for the promotional price at launch.The WiFi reception is a little under my expectation compered to surrounding devices.Another issue is how it wouldn't pre download any movie.It wouldn't even download much a head when the internet is slow.Every time it looses the WiFi signal it will interrupt the movie and take you out to the home view/page.It's not possible to change the WiFi connection with out leaving the movie and home page.Prime movies suck and all good movies are for rent at high price or are on Netflix, lol.", "verified": true, "helpfulness": "0/0", "author": "Abdullah K Aldobaie"}, {"rating": 5.0, "review": "Very cool!  Especially love that I can carry it around and plug it in anywhere.Remote for it is rather annoying..in my opinion anyway.  Load the app. to control it with your phone..you'll be glad you did.", "verified": true, "helpfulness": "0/0", "author": "Nana Heather"}, {"rating": 4.0, "review": "Directions very clear to install and ready for viewing.  Opening remote to install batteries was a bit of a challenge but task was accomplished.", "verified": true, "helpfulness": "0/0", "author": "KAREN Neely"}, {"rating": 4.0, "review": "The fire stick allows us to access more than chromecast did. The ability to access Prime is why I bought this, and I am happy with that. However, we are disappointed that we cannot stream from our laptop computers like we could with the other. That is an important element that would greatly improve the device.", "verified": true, "helpfulness": "0/0", "author": "nicki"}, {"rating": 5.0, "review": "Easy to set up and even easier to use. Great product. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "matthew deboutez"}]