[{"rating": 2.0, "review": "I keep losing audio.Also,I cannot delete unwanted pictures", "verified": true, "helpfulness": "0/0", "author": "Norman Quiel"}, {"rating": 5.0, "review": "Completely satisfied with my Fire Stick purchase. Set-up was extremely fast and couldn't have been easier. I would definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Daniel Kerr - Heritage Financial Planning, LLC"}, {"rating": 2.0, "review": "No. It did not meet my expectations. I have an iPhone and the connection is pretty weak to say the least.. It doesn't seem to work well at all.", "verified": true, "helpfulness": "0/0", "author": "JR Orlando \"Starship\""}, {"rating": 5.0, "review": "Very easy to use.  Lots of movies and shows.  Great purchase.", "verified": true, "helpfulness": "0/0", "author": "rooCASE Capacitive stylus"}, {"rating": 5.0, "review": "This passed my expectations !! Wonderful !!! I have prime membership on my tablet , and when I plugged in the Fire TV Stick (all I did was plug it in) It was already greeting me. It knew exactly who I was. Is that awesome or what !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just received by Fire TV Stick over the weekend.  Install was as simple as can be and the UI is very user friendly and easy to navigate.  It basically turned my non-Smart TV in the bedroom into one that I can now access content from Netflix and Amazon Prime (as well as other options).  I would highly recommend as an easy and inexpensive alternative to upgrading your TV.", "verified": true, "helpfulness": "0/0", "author": "Karin in Atlanta"}, {"rating": 5.0, "review": "I love it.  I have been without a tv in my bedroom for years.  This way I can watch Netflix at night or when things need to get done.", "verified": true, "helpfulness": "0/0", "author": "klee2005"}, {"rating": 1.0, "review": "Had to return it it was compatible with my Visio TV which is only about 2 1/2 three years old, sorry it did not work", "verified": true, "helpfulness": "0/0", "author": "Jack  Croach"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Steven Ryan Slattery"}, {"rating": 5.0, "review": "Fantastic, love it, incredible value for the price!!  Very easy to install!!!  I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Bootist"}]