[{"rating": 5.0, "review": "This is awesome! My family loves it! I like the apps and the ability to listen to music and watch videos on demand. The music I had in my Amazon account plays as karaoke! Couldn't believe it, but we sure had some fun with it. The kids like the games too. I had a Chromecast before and this is 100 times better.", "verified": true, "helpfulness": "0/0", "author": "GJ \"3boysprmom\""}, {"rating": 5.0, "review": "Better than AppleTV.  Better than CHROMECAST!!!  BUY IT!!!", "verified": true, "helpfulness": "0/0", "author": "SMEGMOBILE"}, {"rating": 5.0, "review": "Love the product", "verified": true, "helpfulness": "0/1", "author": "Scott"}, {"rating": 3.0, "review": ".. the usb cable they give you is short... waaaay too short... it does what it says... not worth upgrading from even Roku 2 though.", "verified": true, "helpfulness": "0/0", "author": "eric crenshaw"}, {"rating": 3.0, "review": "So, this is great if all you want to watch is Prime.  Everything else is buried in the worst interface I have ever seen.  I taught interface design.  I don't know that it makes me an expert, but it does mean that I have seen a lot of designs.  This is second worst interface I've been subjected to.  I set it up and worked with it for an hour or two, marveling at the plethora of pointless channels like the Foggy Waterfall channel.  Really.  One waterfall. Not waterfalls.  Anyway, the vast amount of channels is a joke.  And lastly, the sound was mediocre.  I took it back off and plan to foist it off on someone else.  I gave it three stars because its OK.  I have all of the other media streaming devices, so if you want an enjoyable video experience, go elsewhere.", "verified": true, "helpfulness": "2/2", "author": "C. D. Zuff"}, {"rating": 5.0, "review": "It works much better than expected.  I highly recommend it!!!", "verified": true, "helpfulness": "0/1", "author": "SKH"}, {"rating": 5.0, "review": "Great device.  I had to get two for my travel and works great.  So I have the Fire TV box in one room and one fire stick in another and one fire stick to travel", "verified": true, "helpfulness": "0/0", "author": "nofearxp"}, {"rating": 5.0, "review": "great device like it better than roku simple hookup simple use", "verified": true, "helpfulness": "0/0", "author": "S. Rhodes \"swr\""}, {"rating": 5.0, "review": "I got this when it went on sale for $19 bucks.  IT'S SO COOL.  We have an apple TV, and this firestick has a lot more capability, for a better price too.  The remote even works better than the apple tv remote.  I love that iphone users can still link up their music to hear on the TV, or even download an app to use the iphone as a remote.  Very high quality!  I mostly use it for Netflix, Hulu, Prime TV, Pandora...", "verified": true, "helpfulness": "1/1", "author": "Nikki"}, {"rating": 4.0, "review": "Limited for now but good! Chromecast stomps it though!", "verified": true, "helpfulness": "0/0", "author": "JMZ \"JZ\""}]