[{"rating": 1.0, "review": "Amazon Fire TV Stick is just good if you live in USA.We live in Costa Rica, and we can't watch any movie or TV Series.Don't spend your money in it, if you live out of USA!!!!", "verified": true, "helpfulness": "0/1", "author": "Sandra Alvarado"}, {"rating": 1.0, "review": "I pre-ordered my Fire TV Stick the day they were announced on Amazon. The first couple of months I had it it was awesome. I began using it exclusively over my other streaming devices. I love it.Now that I've had it a couple of months, it's really gone downhill. It freezes and lags constantly. Every single time I try to watch something on Hulu or Netflix the video will freeze and the audio will keep going. It never unfreezes. I've tried every suggestion I can find online. Clearing the cache, moving the router closer, having it plugged into the wall, deleting apps, fastforwarding/rewinding, and more. None of it fixes the issue for more than 5 minutes.I would not suggest buying one. They really do seem great for the first couple of months, but there is something seriously wonky with mine now. And, after doing a google search of my problem, it appears that I'm not the only one.", "verified": true, "helpfulness": "0/1", "author": "Katie D."}, {"rating": 5.0, "review": "I love the Fire Stick  It is great.  Does exactly what I want it to do and I can down grade from my Fire Kindle", "verified": true, "helpfulness": "0/1", "author": "Lawrence A. Bourque"}, {"rating": 5.0, "review": "I seriously have no idea how I lived with out this for so long!! I LOVE my firestick. I'm telling everybody to buy one! lol Way better than Chromecast!", "verified": true, "helpfulness": "0/1", "author": "plumsweet"}, {"rating": 5.0, "review": "Awesome! Everything in one place! Easy to navigate.", "verified": true, "helpfulness": "0/1", "author": "Corinne Mears"}, {"rating": 4.0, "review": "Got this as a gift for Father's Day and while I haven't had a ton of time to spend exploring it, I'm pleased with what it offers me as a Prime member. I've watched a movie (playback was excellent with no pauses for buffering or noticeably image quality issues) and when my toddler wanted a specific Mickey Mouse Clubhouse episode, I was able to find it. I think my one complaint is that it can be a bit clunky to navigate through menus and searching things by name is a bit of a chore. I really like being able to use my phone or iPad as additional remotes, however.", "verified": true, "helpfulness": "0/1", "author": "S. H. Kennedy \"Reader of Words\""}, {"rating": 3.0, "review": "we got a new provider for internet and now the fire stick doesnt work.......any ideas how to fix or a number to call?", "verified": true, "helpfulness": "0/1", "author": "maria fennell"}, {"rating": 5.0, "review": "We love this!!  It's easy to install and we haven't had any issues with it.  We use this on whichever tv that does not have a device hooked up to it at that time, meaning that it's great that this is so portable!  We are Prime users so this is a great advantage to us as we Prime apps and products all the time.  There are also a variety of apps that we can use so it's not like we are \"stuck\" on using only Amazon apps or products (which we don't mind).  I would definitely buy this as a gift or even for myself if we needed it for another tv.", "verified": true, "helpfulness": "0/1", "author": "Jamie"}, {"rating": 5.0, "review": "Meaty fingers, had a hard time opening the remote. Dropped it and the door popped off. For some reason got an error that USB power was insufficient. Had it plugged into a power strip. Plugged it into a wall outlet and no error. Plugged it back into the power strip and no error. Now that it's working, I LOVE IT. Watching Netflix now, Star Trek Into Darkness, I wanted to test picture and sound. I couldn't be happier. Looking forward to downloading the APP on my smartphone so I can use it to voice search and type. Remote is just fine for now.Most importantly, the device is connected 100% to wifi, a full signal. Goodby Roku!", "verified": true, "helpfulness": "0/2", "author": "lunchmeat"}, {"rating": 2.0, "review": "Doesn't do anything that other devices don't already do and better. I was surprised that the device needs to be plugged in.  I don't know why it didn't occur to me it would need to be powered but it does, and it comes with a super short power cord making this product actually much more cumbersome than it appears.", "verified": true, "helpfulness": "0/2", "author": "@PML33T"}]