[{"rating": 5.0, "review": "Easy to install.  Easy to use.  This device is great.", "verified": false, "helpfulness": "0/0", "author": "Brian Truog"}, {"rating": 1.0, "review": "After 3 months of battling connectivity issues (20ft from my wireless router in the same room where my laptop and phones have \"Excellent\" connections), crashes, and horrible search functions, I've decided I've had enough.The Fire Stick could be a great product, but absolutely fails to live up to advertising.  It's functionally useless, and will be returned to Amazon and replaced with one of its competitors (which I already have).", "verified": true, "helpfulness": "0/0", "author": "SteveX82"}, {"rating": 5.0, "review": "Great little device", "verified": true, "helpfulness": "0/0", "author": "Ga Dive Girl"}, {"rating": 5.0, "review": "This device is the fastest movie or video loader I've ever owned leaving my bluray players in its dust! Just have to hope my cable provider gets on board so I can cast my oft used apps ( Max Go, HBO GO, etc) for even more enhanced streaming and video/music enjoyment.", "verified": true, "helpfulness": "0/0", "author": "Darth Buyer \"BigBerry\""}, {"rating": 4.0, "review": "My daughter gave me this for my 50th birthday... I love it! I am not at all tech savy but this was easy to set up and immediately start using... I use it to watch prime video and have found some great new favorite shows.  I set it up with parental controls to ask for a password before allowing any charges to my prime account which works great for my daughter, visiting kids and GRANDKIDS. I will most likely change my rating to 5 stars when I learn to use all the other features, but actually if prime video was all I could get out of the fire tv stick I'd be completely happy!", "verified": true, "helpfulness": "0/1", "author": "Denise J. Jones"}, {"rating": 5.0, "review": "I absolutely love the fire stick and recommend everyone to get one!!!", "verified": true, "helpfulness": "0/0", "author": "Ashley Nero"}, {"rating": 5.0, "review": "We love the convenience of the fire stick! We used to stream everything through gaming systems and it is so nice to be able to simply turn on the tv and have everything instantly available on the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Phoebe"}, {"rating": 5.0, "review": "so worth the wait..... thank you, thank you amazon...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Simple and effective", "verified": true, "helpfulness": "0/0", "author": "Ronald R. Ferenchak"}, {"rating": 5.0, "review": "Great piece of equipment.  Easy to use.  Good substitute for the fire TV,  which we already have in another room.  I would have bought another fire TV but they weren't available.", "verified": true, "helpfulness": "0/0", "author": "Mary Hester"}]