[{"rating": 5.0, "review": "LOVE IT!!!!!", "verified": true, "helpfulness": "0/0", "author": "Katie Litterer"}, {"rating": 5.0, "review": "I have the the chrome, roku, and now the fire stick. I will say the fire stick is the best one. Once hbo go is available on fire stick it will pretty much be perfect", "verified": true, "helpfulness": "0/0", "author": "Michael DeCarlo"}, {"rating": 3.0, "review": "Unit works fine for \"awhile\" then I have to reset to factory default.  No one seems to know what the problem is.  For $40 it is what it is!I don't think it has been totally debugged yet and will probably get better with firmware upgrades hopefully...", "verified": true, "helpfulness": "1/1", "author": "Raymann \"Silverspur\""}, {"rating": 5.0, "review": "It's Wonder!!!!!", "verified": true, "helpfulness": "0/0", "author": "LaMisha Q  Williams"}, {"rating": 5.0, "review": "Only wish it had a browser.", "verified": true, "helpfulness": "0/0", "author": "Rockin' Reader"}, {"rating": 5.0, "review": "Great device. ..easy to use. Eas you to setup. Fast and buffering free", "verified": true, "helpfulness": "0/0", "author": "barry"}, {"rating": 5.0, "review": "The Fire TV Stick makes it so easy for me to access the content on Amazon Prime. Before, I found that I was not watching much of the content that I get with my Prime Membership because I had no easy way to get to it. The Fire TV Stick makes it so simple. The interface is simple and the app makes it trivial to find what I am looking for. I am watching a lot more Amazon content and getting more value out of my Prime membership. I highly recommend this product. Well done!", "verified": true, "helpfulness": "0/0", "author": "Vince"}, {"rating": 5.0, "review": "Great Device and value for the money. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "jj"}, {"rating": 4.0, "review": "I have a Chromecast so I was hesitant to buy another streaming stick. I'm glad I did because the Fire TV Stick is so much better. I no longer have to always have my phone available to play something. In addition, if you have a little bit of tech skills you can install almost any android APK on the Fire Stick, making it much more versatile.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Easy to use so far :~)", "verified": true, "helpfulness": "0/0", "author": "Scott L Thomas"}]