[{"rating": 3.0, "review": "No web browser included so I returned it ;(  Maybe the future will bring updates and I would happily try it out again.", "verified": true, "helpfulness": "0/0", "author": "Stacy H"}, {"rating": 4.0, "review": "Easy to install and use.  Have to say I am disappointed in the number of movies and tv series available for free under prime.  Found some I would like to watch but most of what I would like to watch is either unavailable or I have to pay to watch them.  And I prefer older shows and movies, not the latest.  There is so much more to watch on Netflix. The advertising for the Fire Stick is misleading as it makes it sound like there are all these free movies etc to pick from for free viewing when the free choices are minimal.  I am retired  and on a fixed income so the lack of choices was a bit upsetting.", "verified": true, "helpfulness": "0/0", "author": "Sharyn \"swittrup1\""}, {"rating": 5.0, "review": "Super easy. We've had all of the Rokus (not wireless) except the stick.  We have a Dlink which is wireless, but timing is a bit off when using remote, delay is a real bug, but still use in other room.This new deal is great, easy to set up and so easy to use. Very customer ffriendly.", "verified": true, "helpfulness": "0/0", "author": "Bryn"}, {"rating": 1.0, "review": "Unstable wifi connection. Can't even stream Amazon Music without problems. I'll be going back to the Roku.", "verified": true, "helpfulness": "0/0", "author": "Nancy Thompson"}, {"rating": 3.0, "review": "Its great when it stays connected. Often the movie will not \"be available\" due to streaming problems", "verified": true, "helpfulness": "0/0", "author": "Alaya"}, {"rating": 5.0, "review": "this is my second stick in the house, love the device!", "verified": true, "helpfulness": "0/0", "author": "xsweetdreamx"}, {"rating": 5.0, "review": "Great little dongle. On par with the Chromecast. Still trying to decide which I like more. I think I'll be getting another one of these, so I'll have 2 TV's with Fire and one with Chromecast. Seems like a good balance.", "verified": true, "helpfulness": "0/0", "author": "Ambrosio"}, {"rating": 1.0, "review": "The Fire TV Stick is great. It helps turns my dummy TV into a \"smart TV\" but... it's flawed. I've had two Fire TV Stick.The first one was returned because the remote is broken since day one and some other issues I can't remember. The second one has overheat problem. At first, it'll shut down by itself if I watch for more than 2 hours. The stick is hot like hell; but then it gets worse and now, I can only watch for about 30 minutes before it's off. I love this stick, it's cheap, quite easy to use but it's no help if I can't watch a movie for more than 30 minutes.", "verified": true, "helpfulness": "0/0", "author": "Khoa Bui \"Kevin Bui\""}, {"rating": 4.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Jose Luis Marte"}, {"rating": 5.0, "review": "I bought this on a whim to see how it compared to a chromecast. It does lack the ease of use on a few features, but is overall more convenient. I love the fact that the remote that comes with it doesn't use line of sight. Also, there is an android app to control the fire tv stick. I have a phone that can double as a remote control, so it makes it quite easy to control my entertainment system.", "verified": true, "helpfulness": "0/0", "author": "Erdrick"}]