[{"rating": 4.0, "review": "little confusing to use but has a lot of shows we normally can't get.", "verified": true, "helpfulness": "0/0", "author": "Robert B. Shields"}, {"rating": 5.0, "review": "Love this.  Particularly the price, and all we use this for is to watch Netflix, Amazon Videos and HBOGO.  Sometimes has trouble connecting to the network, but that may also be the router.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 1.0, "review": "Which wasn't for very long. I bought this for the special $19.00 price several months ago. Plug and go - watch and loved. Now it won't work at all. It's not the TV either. I tried it on two different TV's and nothing. I put my ROKU box (which is an early generation work horse)  into the same port and it's working just fine. I'm glad I only paid $20.00 for it as it's not very dependable. Makes me not want to replace it either...I think I'll upgrade to a newer ROKU box first.", "verified": true, "helpfulness": "0/0", "author": "S. Pederson"}, {"rating": 5.0, "review": "Absolutely one of the best ways to watch movies! Gotta get some more for the kids soon!", "verified": true, "helpfulness": "0/0", "author": "Smokemmurkem"}, {"rating": 5.0, "review": "I love it and it was east to install..", "verified": true, "helpfulness": "0/0", "author": "LINDA TAYLOR"}, {"rating": 5.0, "review": "Great! Very simple to use and great content.", "verified": true, "helpfulness": "0/0", "author": "Michael Hinckley"}, {"rating": 2.0, "review": "When using Netflix, the FireTVStick doesn't have enough capacity and has to stop and load the presentation much more often than does my Blu-ray device.", "verified": true, "helpfulness": "0/0", "author": "436weaver"}, {"rating": 5.0, "review": "Highly recommended", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "melanie barbo"}, {"rating": 5.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "Gully"}]