[{"rating": 5.0, "review": "Great for my outdoor TV and the the speed is great/responsive. I use it to connect to my media center to watch live TV and movies in my library. Netflix and Amazon Prime makes this a must have if you do not have a smart TV.Very easy to install and use. Also built for the techie/power user who would like to sideload other apps for a more robust experience.", "verified": true, "helpfulness": "0/0", "author": "notap"}, {"rating": 3.0, "review": "I've ha problem after problem with these sticks. I originally bought it for $20 on pre-sale. That ones remote stopped working, so they sent me a new unit. This ones remote works but the screen is constantly freezing, and then the screen plays really fast. Other times the sound will go out. I do not have these problems playing Amazon from the TV app, or the Wii, so I am certain the issue is with the stick itself.Save your time and money and buy a different product, of a better quality. Unfortunately these are getting back-ordered regularly so they are manufacturing them so fast they lack a serious level of quality.", "verified": true, "helpfulness": "0/0", "author": "J. Roos \"JRoos\""}, {"rating": 5.0, "review": "Easy to hook up...easy to use", "verified": true, "helpfulness": "0/0", "author": "Josie"}, {"rating": 5.0, "review": "I was intrigued by its possibility. It didn't disappoint. Easy setup and enjoying the selection of shows to watch. There is a good selection with Prime, which will give us many hours of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Webmaker"}, {"rating": 5.0, "review": "The best purchase our family has made. Works exactly as promised with no issues. Highly recommend this especially for saving money if you are canceling your cable and streaming your shows!", "verified": true, "helpfulness": "0/0", "author": "Maye"}, {"rating": 5.0, "review": "I researched all the available options and found the fire stick met all my needs. It was very easy to get started basically plug and play.", "verified": true, "helpfulness": "0/0", "author": "bruce howells"}, {"rating": 4.0, "review": "It worked well on one TV but could not get it to work on the main TV.", "verified": true, "helpfulness": "0/0", "author": "Labyrinth"}, {"rating": 5.0, "review": "Excelente, i love it!!!", "verified": true, "helpfulness": "0/0", "author": "Rebeca Umana Gamboa"}, {"rating": 3.0, "review": "It is much nicer lay out then my \"smart dvd\" player.  It is fast and good quality.  You have to have REALLY good wifi otherwise it stops and buffers A LOT!", "verified": true, "helpfulness": "1/1", "author": "Cin"}, {"rating": 4.0, "review": "This is surprisingly an alright device in comparison to Apple TV. Though I did find that it seemed to pull more ban-width than an apple tv to do the same or comparable tasks, the only reason at this time to buy this product if you own an apple tv is to get access directly to your tv for your amazon prime video account and if you don't own a smart tv or smart blu-ray/dvd player which all usually have amazon instant video, so there is little reason to buy this. We bought this only because we received a 50% discount as PRIME members. It looses a star for ui that is more difficult than necessary and non-user friendly, and also for the band-width issue. If I could give a 3.5 star rating I would because I feel it is not as good as others on the market but is slightly better than a Roku which I would give a 1 star.", "verified": true, "helpfulness": "0/0", "author": "R. Wacker"}]