[{"rating": 5.0, "review": "Everything I wanted", "verified": true, "helpfulness": "0/0", "author": "Scott Holliday"}, {"rating": 5.0, "review": "I've used other media streaming devices but this has to be one of my most pleasant experience easy to set up easy to use overall great will recommend", "verified": true, "helpfulness": "0/0", "author": "rafael perez"}, {"rating": 5.0, "review": "Absolutely wonderful! It's great! I love it and it's perfect for family time. Completely erases the need of expensive, over-priced cable  bills.", "verified": true, "helpfulness": "0/0", "author": "DionneA"}, {"rating": 5.0, "review": "I have the Fire TV Stick for a little over two weeks and all works well, with one exception (so far). I have been a Prime member for a couple of years, but the Stick keeps on asking me to sign up for Prime to access the Prime features (shows, movies, music, etc.). I contacted support and was advised to uninstall the Stick and reinstall it, and that should solve the problem. I did just that and the problem was solved, until the next time I went to use the Stick and try and watch a show from Amazon. The old problem reoccurred and now it asking me to signup for Prime again. After this writing I will contact support again,,, and see what happens. I like the product and hope the issue can be resolved.Update: I contacted Amazon support and was able to resolve the problem. So far is all good. The problem was that I have two Prime logons and I didn't registered my Fire Stick under the main account.", "verified": true, "helpfulness": "0/0", "author": "RBC-RP"}, {"rating": 5.0, "review": "It's just like the Amazon Fire,", "verified": true, "helpfulness": "0/0", "author": "Anthony A Greene"}, {"rating": 4.0, "review": "Great tv stick", "verified": true, "helpfulness": "0/0", "author": "clinton"}, {"rating": 5.0, "review": "With my Amazon Prime account this is an amazing entertainment device. I even take it with me on my frequent work trips so that I am not stuck watching whatever stations the hotel offers.", "verified": true, "helpfulness": "0/0", "author": "M. J. Mosley"}, {"rating": 5.0, "review": "Great device!!!", "verified": true, "helpfulness": "0/1", "author": "sean screen"}, {"rating": 4.0, "review": "We live on a lake and don't have much indoor time right now.  That being said, what little time we have had to use the Fire TV Stick we have enjoyed it.  This rating may turn from a 4 to a 5 when we really put it to test in the fall and winter.", "verified": true, "helpfulness": "0/0", "author": "Carol Johnson"}, {"rating": 5.0, "review": "I'm speechless.  Just amazing!", "verified": true, "helpfulness": "0/0", "author": "HoppingTurtle"}]