[{"rating": 5.0, "review": "I Love this thing, All my friends love it as well, so much that they have all ordered one. I guess the only thing I wish was Amazon had better pricing on the movies and shows or at least deals of the day that have to do with newly released movies and shows. For now I still stick with redbox instead of paying $5.", "verified": true, "helpfulness": "0/0", "author": "N.JEL.KA"}, {"rating": 1.0, "review": "It consistently gets stuck.  I'm very disappointed", "verified": true, "helpfulness": "2/2", "author": "Robinsky"}, {"rating": 3.0, "review": "I'd give it a 5-star if it wouldn't require an Amazon account to download free apps such as netflix.I bought it as a gift for someone not tech saavy and send it only to realize the account issue", "verified": true, "helpfulness": "0/0", "author": "Nicolas V."}, {"rating": 5.0, "review": "GREAT deal for the money. makes your TV a smart TV", "verified": true, "helpfulness": "1/1", "author": "Ced"}, {"rating": 5.0, "review": "I'm  absolutely in love with my fire stick....completely addicted.  So far I have no issues with the wireless connection.  My internet is through At & t Uverse and its works just fine.", "verified": true, "helpfulness": "1/1", "author": "luvinmykindle"}, {"rating": 2.0, "review": "Ugh this thing. It constantly drops my network and I have to unplug and plug it back in, and this is after it's been replaced once by Amazon. Spend a little more and get a Roku-that thing streams like a champ!", "verified": true, "helpfulness": "2/2", "author": "Beanmom333"}, {"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Armando Guiller"}, {"rating": 1.0, "review": "The only reason I bought the Fire TV Stick was to watch ESPN3 on my HDMI large screen.  You need to be a subscriber to a cable or satellite provider.  The only cable that is available in my area ( LaGrange, GA) is Charter Communications.  Charter cable is not listed as a provider on ESPN3 using Fire TV Stick.  ......I can see ESPN3 on my ipad or window version 7-8 computers. Amazon advertise that Fire TV Stick works with \"Watch ESPN\" which is true but not with Charter Communications which offers their cable network to 6 million households.  Bottom line.....Amazon Fire TV Stick is worthless to me", "verified": true, "helpfulness": "0/0", "author": "John C Stewart"}, {"rating": 5.0, "review": "great little product for tv streaming pretty powerful and easy to set up.", "verified": true, "helpfulness": "1/1", "author": "Susan Kornblut \"marathon woman\""}, {"rating": 1.0, "review": "Forget it. Terrible streaming. ASAP my foot. Slow buffering. Jumpy out-of-focus picture.  Not worth the money. I have the newest smart TV and fastest internet available, didn't make a difference. This device isn't as good as my old ROKU 3. Very touchy remote sends you all over the scre", "verified": true, "helpfulness": "1/1", "author": "JIMCST"}]