[{"rating": 5.0, "review": "OMG!! So in-love!! This thing was so user friendly and idiot proof. We have a prime account and have been streaming (probably too much) like crazy. We also started a trial Netflix account and have been able to see what Prime did not have available. The only saving grace is that the weather has been horrible and we have been down with colds and bronchitis. So we are not feeling too guilty by all of our couch time. I'm thinking we will get another for the other rooms. Thank you Amazon!! You ROCK!!!", "verified": true, "helpfulness": "0/0", "author": "M. Mulvey"}, {"rating": 5.0, "review": "Another great idea from Amazon. Great got my second tv upstairs. Just as easy to setup as the fire tv that I use downstairs.", "verified": true, "helpfulness": "0/1", "author": "JR in Hawaii \"JRC808\""}, {"rating": 5.0, "review": "Love it! So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Sandra G"}, {"rating": 2.0, "review": "I was under the impresstion that there would be somr free", "verified": true, "helpfulness": "0/1", "author": "George Hertzner"}, {"rating": 1.0, "review": "It is excelent when it is working. However, the wifi dies average about once a cay. On the phone with tech support a few times for total about two hours and they have still no clue what is the problem.", "verified": true, "helpfulness": "1/1", "author": "disapointed"}, {"rating": 5.0, "review": "Purchased this for my kids!! Bought it on a special for prime members for $19. Took about 5 mins to install and to get watching. You can't go wrong with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 5.0, "review": "This is definitely as advertised, except for the fact, like others have said, you have to use the power cord enclosed.  I did notice that I was able to get more prime movies by going through my Kindle Fire tablet and putting them on my watchlist.  I don't know if there are so many categories on the stick that I miss many of them or what.  But anyway, once I figured that out, I just love it!  I would highly recommend this product - very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Cynthia E. Whitaker"}, {"rating": 4.0, "review": "Faster than roku box and no buffering but amazons ad is misleading it does not come with voice search the remote is a $40 upgrade.", "verified": true, "helpfulness": "0/0", "author": "ben"}, {"rating": 4.0, "review": "Very nice, got it on sale and wish I had ordered a ton for gifts while it was on sale.", "verified": true, "helpfulness": "0/0", "author": "Shaun Knopf"}, {"rating": 1.0, "review": "not as user friendly as you claim. Not point and go at all.  Way to many hoops and bells to navigate, and not true about how much content is easy access and free. not impressed at all.", "verified": true, "helpfulness": "1/1", "author": "denny oneil"}]