[{"rating": 4.0, "review": "As an early adopter, I expected a few bugs, and got them. The device occasionally plays sound from an unknown place (not from the currently watched show). It also has a bug where a Amazon playlist of ~25 songs shows you're listening to \"Song 0/0\", so you have to constantly manually play the next song. It will also occasionally freeze completely (tho this is pretty rare). All of these glitches are resolved with a device reboot. I suspect future software updates will continue to refine the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Gary R."}, {"rating": 5.0, "review": "Easy to use and all of what it was described as.", "verified": true, "helpfulness": "0/0", "author": "Aziz Hussin"}, {"rating": 1.0, "review": "We have Apple TV, Roku, and now the fire stick. We were initially excited about this low cost solution for streaming on our third t.v. Unfortunately, it's been almost unusable. While it was very easy to set up, it was also very unpredictable in use. We thought at first it was the distance from the router that was the problem, but our apple t.v. Worked perfectly in the same location.", "verified": true, "helpfulness": "1/2", "author": "W Terry Fritsch"}, {"rating": 5.0, "review": "Amazon has delivered an exceptional product. I'm very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "behealthy"}, {"rating": 5.0, "review": "I was able to purchase this item at half price for $20 dollars. I am as pleased with it as i am with the much more expensive ROKU in the living room.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great but if you are looking to play Showtime Anytime and have Xfinity Comcast or Dish Network you're going to have to wait until they are supported", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "Easy to use. Fast set up. Love it!", "verified": true, "helpfulness": "0/0", "author": "RASHELLE RIECKMANN"}, {"rating": 5.0, "review": "Just what I was looking for. Makes my very old TV smart and allows me to stream from all my favorite non cable networks.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "really cool, works great.  only 2 drawbacks; 1 is it sometimes does not wake up with the remote and i have to power cycle it to get it to come on.  2nd is i can not control it with my harmony remote.  other than that, been great.if they could make it where i could control it with the harmony remote all things would be grand.  just annoying having to grab a tiny remote to control it when all the my other 10 devices, including appletv, i can control from the harmony.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Cool little idea and now I have both types of devices.", "verified": true, "helpfulness": "0/0", "author": "V. V. Burns \"Ja  Mata\""}]