[{"rating": 1.0, "review": "Not up to the expectations", "verified": true, "helpfulness": "0/0", "author": "Abubakr Obeid"}, {"rating": 4.0, "review": "I can't compair this to other stick streamers because this is my first one. I also can't compare it to my other devices I use to stream because they are a ps4 and Xbox one so it wouldn't be fair. With that said I wilI tell you my experience with it. I have used this almost every night since I have had it. I originally bought this to replace a blue ray player that was not up to the task of steaming any longer. The stick it self is pretty small so which I think is cool. Though it doesn't stay cool it gets pretty warm when in use but I haven't had issues as of yet. Build qauilty is OK not great but its not shoddy. I compared the Roku and other devices online before I purchased and I feel for the price this was the best one for my needs. Plus this had more to offer in terms of specs compared to the roku stick.  I was honestly surprised how snappy the UI feels. for the size of the device I kind of expected it to have more of a lag on input commands but it is actually really a really smooth experance which is a huge bonus. Apps work great like hulu, Netflix and the YouTube app. The YouTube app is where I took a star away. It runs fine normally I connect a device like a tablet or phone and do a little multi tasking it os great but it sometimes freezes up. Now it doesn't happen often only a couple times. I kind of learned to feel what I can and can't do so it won't  freeze up on me. Other then that it streams YouTube runs fine it doesn't buffer all the time or anything strange besides the multi tasking I was doing. Like going back and fourth  kind of aggressively through the videos I qued which is why it froze. Now the last thing I did was cast my phone just to test it out. First you cannot cast say a emulator with a SNES game...well you can but it won't be enjoyable. Not a deal breaker I didn't plan on it mostly just seeing what that little dual core can do. Its fine if you want to throw a picture on the screen from your phone/tablet to show your family  or freinds I guess? Not sure if that's every ones scenario just saying. Its not the smoothest when it comes to casting your device but I personally didn't count that towards my expectations of the device when I  made the purchase. It is able to cast just not as fluid as the rest of the sticks functions feel. I fully recommend this device if you are looking for something for a bedroom or as a travel streamer. If you where to use it in your living room it would be OK too but I would personaly op for the more premium device with higher specs like the fire box or one of the current consoles even one of the last gen consoles they would all be excellent. The stick does a good job for what it is and I really enjoy it. In the  future I can see myself picking up the fire TV box now :)", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "Absolutely fabulous invention. Easy to use and GREAT price!! No complaints!!", "verified": true, "helpfulness": "0/0", "author": "Amber Pomerleau"}, {"rating": 5.0, "review": "We Love it", "verified": true, "helpfulness": "0/0", "author": "NOLACOGIRL"}, {"rating": 5.0, "review": "Amazing little thing! Works wonderfully well so far.", "verified": true, "helpfulness": "0/0", "author": "Reg"}, {"rating": 4.0, "review": "It works very well for my needs.", "verified": true, "helpfulness": "0/0", "author": "Atila"}, {"rating": 4.0, "review": "This is a great replacement for wired cable. Amazon's Fire TV Stick allows you to stream a lot of entertainment. I still have wired cable, and I also enjoy Amazon's Fire TV stick, but if you're wondering if the Fire TV stick is worth disconnecting for, then I am here to support that! Of course, it doesn't have everything, but it does enough. Also, Amazon Prime is awesome. It's a good bargain. In addition to movies, you also get 2-day shipping on all Amazon purchases. Plus, you get the benefit of having an awesome tool like the Amazon Fire TV Stick at your disposal.", "verified": true, "helpfulness": "0/0", "author": "S. Brown \"tinkkytone\""}, {"rating": 4.0, "review": "I picked up one of these when they were first released because they offered it for $20 for Prime members. There are things I dislike, like I would like to be able to access Vudu or Disney Movies Anywhere. Minor detail though as 90% of my streaming is Netflix, HBO Go, and Hulu. I have Rokus, a Chromecast, Samsung Smart TVs, Xboxes, etc and each has their merits. Chromecast I like because I was able to stream Better Call Saul from AMC better than it would stream to the TV. Roku has a great interface, the Samsung TVs see most of our streaming, but there is one area this shines.  Web authenticated internet connections. I travel a lot with my family and used to use an old Kindle Fire HD with HDMI to stream. I just got back from an RV trip with my family and was able to connect to web authenticated wireless connections at the parks we stayed at. This is the only device that allows me to do that. And for that I love it! Knowing that now, I'd easily pay full price to be able to take this when I travel.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"BigDfrom AZ\""}, {"rating": 1.0, "review": "Stick works, remote doesn't, so not very happy.  We had to download apps to use through our iPhone in order to use the Firestick.  So I cannot give something over a one star if the hardware only half works.", "verified": true, "helpfulness": "1/1", "author": "Greenies Rock"}, {"rating": 5.0, "review": "More tv channels than I thought, I will be placing another order. This stick definitely beat the price for cable, it is worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]