[{"rating": 5.0, "review": "Good device", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Nubian King\""}, {"rating": 5.0, "review": "Converts your TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Carlos J. Deuriarte \"Carlos\""}, {"rating": 4.0, "review": "It's okay.", "verified": true, "helpfulness": "0/0", "author": "Chris Garrett"}, {"rating": 5.0, "review": "Great Item and seller!  Henry, The Weedeaterman,LLC.", "verified": true, "helpfulness": "0/0", "author": "Weedeaterman"}, {"rating": 2.0, "review": "I would say it's just OK, certainly not the best media streamer out there. The UI is just way too much Amazon in your face all the time. I know Amazon is trying to sell content, but this is really over the top. If you're a Prime member you might like it. If you're not, I would shop a round.", "verified": true, "helpfulness": "0/0", "author": "Aaron Truchon"}, {"rating": 5.0, "review": "very easy to use and enjoy what it has to offer.", "verified": true, "helpfulness": "0/0", "author": "elaine m. johnson"}, {"rating": 5.0, "review": "It would be easy to simply dismiss this device as 'just another smart TV attempt', but it offers something that the others don't right now!  Sling TV!!!The Fire Stick is as dirt simple to setup as it can get.  The only way that a person couldn't get this item setup, is to leave it in the box.  I kid you not, there just isn't any way to mess up the installation.  It comes with a short extension cable, which is great, since Sony is still designing their sets like a room full of meatheads.  The range on this device is fabulous.  I had it downstairs in our theater area with the wi-fi upstairs and was still able to stream this quality of video (please see pics!).  The shots were taken from 18 feet away, with a 150\" projector image (the speakers are four feet tall, just to give you a sense of scale)Regarding Sling TV: it's absolutely fabulous!!  Amazon did a great job of making their platform open to so many apps, with this being one of the best!!  Sling TV is EXACTLY what I've been waiting for at a reasonable price point, to boot!  ESPN, ESPN2, TNT, History, H2, HGTV, CNN, Travel, and Food Network!!  Throw in TBS, A&E;, IFC and you've got the best channels (my opinion, I know) for an excellent price!!  The video quality is great!  It's not quite HD, but it's not very far off!The best part is that I got the Fire Stick free with the promo they're running right now!  3 months of Sling TV = free Fire Stick!!  You really can't get better!  Cut off your cable or satellite and get Sling TV with the free Fire Stick!  (No, I don't work for them, just really flippin' overjoyed that I'm getting my most watched channels at 1/5th the price that I was paying!!)  Woo-hoo!", "verified": false, "helpfulness": "5/5", "author": "Patrick D. Crowe \"Geek extraordinaire\""}, {"rating": 1.0, "review": "This product should really still be in beta, as it's definitely not yet ready for prime time (no pun intended). Apps often crash, the UI is confusing to navigate, and we have had to hard reboot the stick at least once a week with daily use because the software would hang.I do not recommend this to anyone. We're getting an Apple TV to replace it.", "verified": true, "helpfulness": "1/1", "author": "Brian Kichler"}, {"rating": 5.0, "review": "great stuff but needed a wifi extender", "verified": true, "helpfulness": "0/0", "author": "sal terrano"}, {"rating": 2.0, "review": "My fire tv stick is amazing give me chance to have my own privacy in my room", "verified": true, "helpfulness": "0/0", "author": "mary powell"}]