[{"rating": 5.0, "review": "I got this for my mom & sister at home and they absolutely love it.  My mom has now officially been introduced to the world of tv/movie streaming and can't get enough!  Perfect option for those without a smart tv or other device to use & super cheap considering what you get.", "verified": true, "helpfulness": "0/0", "author": "Crystal"}, {"rating": 5.0, "review": "Incredibly easy to use. A great tool for streaming. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "elisabeth kannenberg"}, {"rating": 4.0, "review": "Limited apps but it's great.", "verified": true, "helpfulness": "0/0", "author": "Tenecia Williams"}, {"rating": 5.0, "review": "I love this product! It was so easy to install and there was a cute tutorial video (don't worry - it was quick) that was extremely helpful. Overall installation took maybe 5 minutes, including downloading Netflix, Plex, & HBOGO. I recommend this for everyone!", "verified": true, "helpfulness": "0/0", "author": "Honeybee"}, {"rating": 5.0, "review": "Easy to use , fast, fun, have you watching you favorite show in minutes, we love it !", "verified": true, "helpfulness": "0/0", "author": "Gilda McCullough"}, {"rating": 5.0, "review": "We are happy with how easy it is to use. And the great selection of movies and shows.", "verified": true, "helpfulness": "0/0", "author": "Nan \"Nan\""}, {"rating": 3.0, "review": "this thing freezes several times in a day having me to have to turn it off and reset it several times in a day.  very inconvenient.  device heats up and there's no way to turn it off by remote.  i have to unplug it from the wall and back of tv.  very unhappy with the performance of the product.", "verified": true, "helpfulness": "1/1", "author": "matthew wooton"}, {"rating": 5.0, "review": "I am more than happy I purchased the Fire TV Stick! I have been comparing other products and Amazon has been the best choice for me!!", "verified": true, "helpfulness": "0/0", "author": "T. Walker"}, {"rating": 3.0, "review": "Lovely screens and menus. Remote can get a little sticky and you can't mirror your computer which is what I thought I'd be able to do. Overall good but I'm really not getting anything new other than a remote and prettier menus.", "verified": true, "helpfulness": "0/1", "author": "H4nnita"}, {"rating": 5.0, "review": "Awesome device & so sweet to cancel cable!", "verified": true, "helpfulness": "0/0", "author": "Rachael Wagner"}]