[{"rating": 5.0, "review": "Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Paul Rouse"}, {"rating": 5.0, "review": "Five stars - nuff said.", "verified": true, "helpfulness": "0/0", "author": "george l. morgan"}, {"rating": 4.0, "review": "Works like a charm!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I would give Fire TV Stick 5 stars if HBO GO was part of it as all commercials and ads state HBO GO is included.  It should be stated that Comcast subscribers will not get HBO GO.", "verified": true, "helpfulness": "0/0", "author": "Lorenzo"}, {"rating": 2.0, "review": "Slow and buffers often.  It's not my connections as I use a wii and it's fast for playing Netflix.  We wanted to move the wii into another room, so I got the fire stick.  Fire stick is less than 10' from router (same place as the wii was).  When looking at the menu it will not save what you were looking at before, so you have to scroll all the way again.  Does not offer categories for Netflix, like all my other devices, phone, tablets and computers.  The \"apps\" it offers, many of them are no longer working and have not been removed or replaced with something new.Does it work?  YesIs it up to my expectations?  No", "verified": true, "helpfulness": "0/0", "author": "Bill Franklin"}, {"rating": 1.0, "review": "technically speaking it would have been a great product unfortunately however it did not support Vudu with hundreds of movies and a couple thousand dollars invested I cannot use a product that does not support Vudu", "verified": true, "helpfulness": "0/0", "author": "marc"}, {"rating": 1.0, "review": "The Fire TV Stick itself is great, but I cannot use it because after I got it all connected and set up and even created my \"watch list\" I found I cannot use it due to not having enough bandwidth.  It's the most my internet provider can provide in my location.", "verified": true, "helpfulness": "0/0", "author": "Karen L Wahlers"}, {"rating": 5.0, "review": "Responds so quickly.  I love it.  The Prime membership and the Fire Stick are the way to go for me as I order things from Amazon frequently. I had Netflix through my cable provider service but accessing it through the Fire Stick is so very much quicker, including navigating through and rewinding etc.", "verified": true, "helpfulness": "0/0", "author": "K. Risinger"}, {"rating": 5.0, "review": "Excellent! It has all the apps that I want and need!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I pre-orderded the device as it was dirt cheap, I being a prime member, thought might be useful for me. I had originally planned to use it for my secondary device but ended up using it on my primary tv.Pros:1. Much better interface than Amazon app on say Roku or Samsung Smart TV.2. Haven't noticed any lag in streaming.I want to highlight the cons so that Amazon can improve upon it.Cons:1. Wifi range is an issue. I had attached it on my secondary TV which is in basement. My Vizio TV could capture the wifi connection but the FireTV Stick cribbed and said No wifi connection found. That compelled me to move the stick to my primary tv which is much nearer to the router.2. I have noticed bursty traffic/commands with lags flowing from the remote(which comes with the box) to the FireTV stick. I would press a key and nothing happens, I click again and suddenly two actions happen very fast in a burst.3. Sideloading is a great feature, but it is a bummer that there is no easy way to pin my sideloaded app on the main screen. How counter intuitive is that, or perhaps not well thought through feature. If I am taking pain of sideloading an app, it means I want that app and would rather want it on the main screen rather than going deep and pressing 5 buttons to reach to a point where I can LaunchApp.4. There are so many apps which are compatible with my KindleFire HDX but not with the FireTV stick which also makes me sad.", "verified": true, "helpfulness": "0/0", "author": "CapriCarpe"}]