[{"rating": 5.0, "review": "Awesome sauce", "verified": true, "helpfulness": "0/0", "author": "Shawn Clark"}, {"rating": 5.0, "review": "Fantastic!  Works great.", "verified": true, "helpfulness": "0/0", "author": "Ray Wilbur"}, {"rating": 4.0, "review": "It works just as described.  I just wish they had more free movies to chose from", "verified": true, "helpfulness": "0/0", "author": "S. Lewis"}, {"rating": 5.0, "review": "My Samsung Smart TV cost me almost $1500 only 3 years ago (to the month!) but suddenly about 1 month shy of it's 3rd birthday, it lost connection to my WiFi and the screens won't come up to allow me to select my WiFi and reconnect it. My WiFi works just fine...EVERY other device in my house is connected to it and working like champs.Since the picture is still marvelous and I'm not into spending more money to buy another Smart TV, I decided to try out this Amazon Fire TV Stick to see if I could \"educate\" my Smart TV instead of replacing it.IT WORKED!! I now have my Amazon Prime and Netflix back on the big 55 inch screen! Thank you for coming up with this! It kept my Samsung TV from going into the dumpster. :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Girlie \"Personal Buyer :)\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "rhakeim jones"}, {"rating": 5.0, "review": "This is the best thing to watch movies and TV shows without having cable or satellite.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"An Amazon Shopper\""}, {"rating": 4.0, "review": "I really like the fire stick. But in my opinion.  I think after purchasing and being a \"prime member\" you should have alot more access to free streaming tv shows and movies. I anticipated a bit more than I have.", "verified": true, "helpfulness": "0/0", "author": "Deb Miller"}, {"rating": 5.0, "review": "it's great!", "verified": true, "helpfulness": "0/0", "author": "katt"}, {"rating": 4.0, "review": "Works great and super easy to install.", "verified": true, "helpfulness": "0/0", "author": "Melissa Moore"}, {"rating": 5.0, "review": "This most user friendly streaming stick on the market.  I have the chrome stick and the fire stick far exceeds the functionality and usefulness of the chrome stick.", "verified": true, "helpfulness": "0/0", "author": "Dale Fredette"}]