[{"rating": 5.0, "review": "Love this TV stick. I have Amazon prime, my kids love to watch their favorite cartoons in the video library. This is the perfect solution. It is very easy to install. Easy to use. The remote is very convent and user friendly. We use this everyday. Highly recommend for anyone with Amazon prime membership. Great product!", "verified": true, "helpfulness": "0/0", "author": "Stevie"}, {"rating": 5.0, "review": "Everything I expected", "verified": true, "helpfulness": "0/0", "author": "lewis thomas"}, {"rating": 3.0, "review": "I have trouble with it because my internet connection is not good in the room that it is located in.", "verified": true, "helpfulness": "0/0", "author": "Christina Wickers"}, {"rating": 1.0, "review": "Doesn't work in Brazil.", "verified": true, "helpfulness": "0/0", "author": "Antonio Silva"}, {"rating": 5.0, "review": "I would highly recommend this product to everyone.I love this product.", "verified": true, "helpfulness": "0/0", "author": "Elliot"}, {"rating": 5.0, "review": "This is a wonderful product.  I now own in order of purchase Apple TV, Roku and now the Fire TV Stick and I prefer the Fire TV Stick over them both for ease of setup and ease of use.", "verified": true, "helpfulness": "2/2", "author": "Calnan R. Weech"}, {"rating": 4.0, "review": "The fire stick works well. It's easy to install and not too bad to navigate. But I wish there were more apps that I could download for sports and live tv.", "verified": true, "helpfulness": "1/1", "author": "daniel"}, {"rating": 1.0, "review": "Keeps losing internet connection with computer 15 feet away.", "verified": true, "helpfulness": "1/1", "author": "Stephen Kirchner"}, {"rating": 4.0, "review": "The fire stick has been very good and improved our TV viewing. We have very slow network connection and previously every show buffered thoughout. We have a lot more uniterupted viewing now. But I'm still waiting for it to anticipate and have something else ready to go. I find that if I select a movie, get it started and then pause it for a few minutes we have very little buffering.", "verified": true, "helpfulness": "1/1", "author": "Lori Wetzel"}, {"rating": 5.0, "review": "Very good product.", "verified": true, "helpfulness": "1/1", "author": "IVIO L PEREZ-BORROTO"}]