[{"rating": 4.0, "review": "good device. need to learn to use it. good support.", "verified": true, "helpfulness": "0/0", "author": "David Rottenberg"}, {"rating": 3.0, "review": "this would be better is you could cast same as you do with Google ChromeCast.", "verified": true, "helpfulness": "0/0", "author": "55 and alive"}, {"rating": 3.0, "review": "It's just ok. No HBO Go until Spring 2015 is a bummer, and the tv ads are deceiving...it looks like you just plug it in without a power source. That is not really the case. My older Roku works better and has more content. I was actually disappointed, but will keep the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Melissa J. Horton"}, {"rating": 5.0, "review": "I LOVE THIS. I never had Google Chromecast, but I'm glad that this works with Amazon Prime. Very easy to set up and use. Very easy to get the Netflix and Hulu apps and then navigate with the remote. Also very easy to use my Samsung Galaxy S4 as a remote (when I downloaded the fire TV app). One complaint I have is regarding searching for TV or movies. When searching with the stick, sometimes it does not come up, so I have to go to the website on a computer to find what I need and then add it to my watchlist. E.g., I searched for Torchwood using the stick and it didn't come up. So I went to my computer and found it and added it to my watchlist. I don't know why it didn't come up with I used the stick to search.", "verified": true, "helpfulness": "0/0", "author": "JBER"}, {"rating": 5.0, "review": "This little thing is bad ass!!  Soooo easy to install and very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Heather P."}, {"rating": 5.0, "review": "The best set up and working with in 10 minutes. spent 6 hours on chrome cast never got it to work.", "verified": true, "helpfulness": "0/0", "author": "Rick Christopher"}, {"rating": 4.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "christina smith"}, {"rating": 5.0, "review": "Does exactly as is advertised. Remote works well.", "verified": true, "helpfulness": "0/0", "author": "Garret Ranck"}, {"rating": 4.0, "review": "Works wonderfully.  It arrives pre-registered and ready to work within minutes.  I Love how easy the application works, but it's a little buggy and makes it FAAAR too easy to accidentily buy shows/movies.  But I hope that will be fixed in the future.Otherwise a great product that is simply waiting for Amazon Prime to enlarge it's movie selection.", "verified": true, "helpfulness": "0/0", "author": "Bob Gaughan"}, {"rating": 5.0, "review": "Pretty cool and fast, there's pretty much no loading, movies just play.", "verified": true, "helpfulness": "0/0", "author": "Steve"}]