[{"rating": 4.0, "review": "So far so good. I plan on editing this as the Amazon product matures. I have both the Roku streaming stick and (as of today) the Fire Stick. I purchased the upgrade remote for Fire Stick with voice search also.A quick eval and comparison:Both are connected to our wireless N dual band network. No difference in ease of connecting, finding network, or registering. Included Fire Stick cheapo remote is way to small, except for a baby's hand. The upgraded Amazon Fire TV voice remote is much more comfortable (although still small), compatible with both devices, and voice search is FAST and ACCURATE. If you own a Roku 3, you know already that the remote has a super cool headphone plug for silent watching, but their streaming stick remote does not, and they're not compatible, so IMO spend the $ and score with the Amazon voice remote. The BIG obvious difference in devices is speed in booting, connecting, and searching. Big pluses for Amazon device. However, interface, channels, and nav is soooooo much better on the Roku...again, in my opinion.Here's my take. How many freaking channels do you really need? We use 2 routinely, and 4 to 5 total. Amazon has them. As compared to the Roku streaming stick, Amazon (with the upgraded remote) wins the day...so far.BIG BUMMER: Functionality (as advertised \"coming soon\") is still a big NO.  How long Amazon???Next , long term reliability...we shall see", "verified": true, "helpfulness": "0/1", "author": "USERBOSCO"}, {"rating": 4.0, "review": "Solid out of the box. Beats it's biggest rival from the big \"G\" hands down. Initial update of software took some time, but smooth interface and good selection of apps that I'm sure will grow. The dual band wireless is killer feature for those in dense wifi areas.", "verified": true, "helpfulness": "1/2", "author": "LarryR"}, {"rating": 4.0, "review": "I have been using a Roku 2, PS3, and Chromecast for my streaming.  This is by far the fastest at loading media.  My only complaint is the remote.  The remote buttons make a very audible click when depressed.  Very annoying when searching on the fire stick.  If not for that, I would have given 5 stars.", "verified": true, "helpfulness": "0/1", "author": "Q \"Todd\""}, {"rating": 3.0, "review": "Forced to watch 10min video of CRAP before you can even use it.  This is soooooooo frustrating, all I want to do is use the damn thing!Update-I finally finished watching the video.  Why someone felt that every must be forced to watch such a basic and looooong video for a simple and intuitive product is beyond me.  Amazon does great with frustration-free packaging but this is just terrible and annoying.What made it worse was before I was forced to watch the video, the device had to update.  Look, I realize this is common with devices, but why cant companies figure a way to put the latest software on the devices as they go out the door?  The update took a while, 15+min.  So I had to wait 30min to even attempt to use it.Once I did use it, it's quite easy, but I wish for browsing they would use the entire screen with tiles of movie titles instead of one row-it takes forever to shuffle thru them.  Anyway, after 15min of browsing Prime videos and TV, the only thing I found to watch was Dora for my 2.5yr-old.  And that wasn't even in HD so of course it will burn in those black lines on the sides of the screen.Looks like I spent $20 for my kids to watch cartoons.  Meh.", "verified": true, "helpfulness": "3/15", "author": "tech worker"}, {"rating": 2.0, "review": "I had hopes that it would replace my Roku and Chromecast but it doesn't...The good: - it's fast/responsive - nice form factor - it could replace your Roku...The bad: - it doesn't stream content from my browser (like Chromecast) - Plex costs $5 but is free for Roku/website - Geared toward Amazon fanboys (which might be good for you)Ultimately, if you are an Amazon fanboy (they'll be the ones commenting/hating on my review), or don't own a Roku or Chromecast, you might like the Fire TV Stick. Otherwise, don't bother.", "verified": true, "helpfulness": "1/11", "author": "Dasspunk \"Overlord\""}, {"rating": 5.0, "review": "I own a lot of streaming media devices; Roku 3, Apple TV, Chromecast, Blu-ray player with Wifi and apps, and a Sharp LC-60EQ10U  60-inch Aquos Q 1080p 240Hz  Smart LED TV, but the Fire TV Stick really stands out as a freakishly great streaming device with its speedy ASAP launching of streaming content in HD, mirroring capabilities, game selection and a rock bottom price.The fact that it allows users to enjoy 7.1 surround sound is a huge perk too! Especially when using this device on a TV hooked up to a 7.1 AV receiver with compatible speakers. Enjoying music services like Amazon Prime Music and Pandora becomes a true pleasure using this device.The Fire TV Stick is a super easy way to add Amazon Instant Video services, Netflix, and Hulu Plus to any HDTV or PC monitor with a HDMI port via a WiFi connection.The bottom line: The Fire TV Stick is simple to setup and operate, and it's swift performance packs an entertaining punch. I'd recommend it to anyone who desires 'easy' in their streaming device.PERFECT FOR CUTTING THE CORD OR NOTI ordered the Fire TV Stick during a special promo for Prime members that offered the device for less than twenty bucks.  I jumped at the chance to be one of the first Amazon customers to give this one a go, receiving the Fire TV Stick in mid-November.I bought two. One is attached to a bedroom HDTV and the other is connected to my a monitor in my home office.  Both devices are connected to my home network that is powered by a TP-LINK Archer C8 AC1750 Dual Band Wireless AC Gigabit Router, 2.4GHz 450Mbps+5Ghz 1350Mbps, 1 USB 2.0 Port & 1 USB 3.0 Port, IPv6, Guest Network connected to Charter high speed internet at 60 Mbps.I'm a cord cutter. That means I don't have cable or satellite TV, I use the internet and over-the-air TV via a Mohu Leaf 50 Amplified Indoor Antenna for my entertainment. (I actually wrote a book about how to cut the cord called Simple Guide to Over-the-Air Free TV. ) The Fire TV Stick is perfect for cord cutters and since Sling Television rolled out, I'm in Heaven using this device! I loved Sling TV so much, I wrote a book about it too: Simple Guide to Sling TV.I have used many streaming devices with mixed success, but none have had ASAP (Advanced Streaming And Prediction) as this one does. Whatever it is, Amazon has a winning bit of technology. It makes a tremendous difference on the speed with which videos start to play, particularly Amazon Instant Videos. No buffering or waiting for video to load with the Fire TV Stick. It's a great perk!IT'S NOT COMPLICATEDThe Amazon Fire TV Stick is built with high tech hardware inside, but it has a simple user interface that isn't complicated to setup and use. Take it out of the box, plug it into an available HDMI port on a HDTV or monitor and get started.You need to know your wireless network password and if you're a subscriber to Netflix, Hulu Plus, Amazon or other subscription service you'll want to have those passwords handy too when you get started.From unboxing to setup it should take less than 15 minutes to plug it in, setup your network connection, update the device software, watch the intro video and start picking out your apps.READY TO HIT THE ROADThe Fire TV Stick is highly portable and once your apps have been loaded into the memory on the device, you can unplug it and take it with you to a friend's house, on vacation or off to college. You'll just have to enter the wireless password for any new networks you want to hook up to at your new location.  Your subscription service information and apps will be retained by the device.Paired with an Amazon Prime subscription the Fire TV Stick is incredible in terms of the amount of content that's available and readily available at any location in the US.Throw in a Netflix subscription ($8 a month after 1 month free trial) and a Hulu Plus ($8 a month after a free 7 day trial) and you've got a plethora of entertainment for very little money.NOT THE SAME AS THE FIRE TVThe Fire TV Stick doesn't have the voice activation feature installed on the included remote that the Fire TV does, but you can get an iOS or Android app to gain that feature through your smartphone or buy the Voice remote for Amazon Fire TV and Fire TV Stick.It's also limited in that it has 8GB of storage space, that is actually 5. 57GB when you consider the operating system takes up some of it.When you start downloading apps and games, that storage space is reduced without a way to gain more without removing installed apps.In future Stick versions I'd expect Amazon to offer different storage size or options.  Although the use of Cloud storage for Amazon Music and Photos is integrated and readily accessible on the device, so maybe not? The device does not have the ability to add more storage space via a microSD card or similar.The dual core processor isn't as fast as the Fire TV, but for this low price point and features, who really cares?  It's definitely faster than Google Chromecast HDMI Streaming Media Player and the Roku 3500R Streaming Stick (HDMI).--------------------------------------------------------------------PROS:+ Low Price+ Easy to Use+ Highly Portable+ Large Number of Apps+ Several Types of Apps: Streaming Video (Netflix, Amazon Instant Video), Music & Games+ Android Remote Apps Available for Voice Input+ Fast, ASAP Launching of Content+ 7.1 Dolby Digital Surround Sound (when streaming media supports it).+ 1 GB Memory with 8 GB Storage+ Dual Core Processor+ With Fire Phone or Tablet you can `Fling' Content to HDTV.+ Mirroring of Android Tablet or Phone via Fire TV Stick; in Settings. *Miracast certified.+ View Photo Slideshows on HDTV via Device.+ Prime Music (for Prime members) Can Be Streamed as can Pandora.+ Similar functionality to Amazon Fire TV without the big price tag!+ Ability to use Bluetooth controllers.+ Parental Controls+ Amazon Fire Game Controller is available+ Cool screensaver feature.+ Connects to laptops, monitors and HDTVs via HDMI for viewing on the go.+ No need for PlexPass to use the Plex app on this device to share media.CONS:- Remote, if lost, costs $15 to replace.- Slide to insert batteries into the remote is very difficult to get open.- You cannot thwart the opening video upon setup.- Device automatically registered to purchaser; can be changed at setup.- Applications are automatically setup to send App Usage Data to Amazon; can be turned off in Settings.- 8 GB Storage is actually a little over 5 GB.- Software updates may be slow.- Downloading apps takes up space on the device, versus most used apps like Netflix and Amazon Instant being installed prior to shipment.- The remote is small and easy to lose.- Fire TV Stick gets warm to the touch when in use.- Game play is not great with the included TV remote; get the game pad (not included).- Uses Wifi, no wired internet option. (Not a real `Con' to me, but it's worth a mention.)- No HBO GO app; not an issue for those without HBO.NOTE:  The device has its Pros and Cons, but none of the Cons are significant enough;  considering this device's low price, to make me drop a star from my high rating of this product.-----------------------------------------------------------------------FAVORITE APPSHere are 10 of my favorite apps on the device that will be downloaded and installed when you click on them.1. Netflix - 1 month free is awesome, and at only $8 per month it's totally worth it.2. Hulu Plus - 7 days free, and only $8 per month; great option to those who don't have a DVR.3. Pluto.TV - It's free online and with the app. Gives you tons of fantastic content both for music videos and programming. If you like HGTV programming, comedy programming, cooking shows and sports - get this one.4. TuneIn Radio - worldwide radio stations are so fun!5. Chicchild Fish Aquarium - turns your TV or monitor into an aquarium, complete with gentle filter and bubble sounds.6. Red Bull TV - if you like extreme sports, check it out.7. Docurama - Documentaries of all kinds; very educational.8. CBS News - Get the highlights of the evening broadcast without commercials.9. tubi tv - Fraggle Rock episodes. Need I say more?10. All Recipes - It's food porn.CONCLUSIONThe Amazon Fire TV Stick is so much more than the Chromecast (which lacks the Amazon App and access to both Amazon Music and Instant Video) and Roku Stick (only 256MB of flash memory compared to 1GB with the Firet TV Stick) devices which are sold at close to the same price point.The simple user interface, guided setup and fast performance are a pleasure to use, and I'm still shaking my head at how inexpensive this thing is!The Fire TV Stick comes with a 1 year warranty, and a 30-Day Money Back Guarantee. If you don't `love it', you can return it in new condition for a full refund.  (Trust me. You're gonna love it!)If you want to, you can buy a Fire TV voice remote and pair it with the device in settings. Alternatively, you can get the FREE Android or iOS apps to use voice commands via your phone or tablet.Assuming its durability is good, it's going to please many, many consumers.  I'm very impressed with this device and happy to recommend it to cord cutters and non-cord cutters alike.It's just too bad Amazon didn't launch it earlier in the year as I know a lot of folks will be wishing they could get them to give as Christmas gifts this year.--------------------------------------------------------------------------SPECIAL NOTE REGARDING TRAVEL PER AMAZON:\"If you're traveling with Fire TV Stick, you can access apps and games you've downloaded to your device.With a U.S. address and credit card, you'll also be able to purchase new apps and games for Fire TV Stick while you are abroad.To access Amazon Instant Video movies and TV shows, you must be physically present in the U.S. and have a U.S. billing address. Many third-party services and media apps are not available outside the U.S.\"--------------------------------------------------------------------------", "verified": true, "helpfulness": "9/14", "author": "Andrea Polk"}, {"rating": 3.0, "review": "This product is great at streaming Amazon videos, but I took away two stars for two problems I thought were serious. The first for me is the lag. While using the product, it was often unresponsive and laggy, as if it was lacking processing power - which seemed odd and hurt the experience. The second is what I feel is misleading marketing. The technology is pitched as if it were a self-powered USB stick, but in reality it needs an external power source, which for me sort of defeats the perceived purpose of a product like this. Might as well stick with the box-type units.", "verified": true, "helpfulness": "2/4", "author": "Thomas Aquinas \"Augustus\""}, {"rating": 4.0, "review": "**** Update:  December 3rd, 2014 ****Here are a set of new observations:- Forgot to mention earlier, but remote is *not* IR, so it doesn't have to be oriented in any particular direction to work.- Screen saver doesn't seem to kick in when using Netflix, possibly other apps as well (haven't tried Hulu Plus yet).  Removing a star for this, as this can be a huge disadvantage for folks with plasma displays.- If you FF or RWD at the highest speed, the frame preview cannot keep up.  Not a huge deal, and there could be multiple factors at play (e.g. broadband speed, Fire TV Stick performance, etc.).- Stable.  When I'd first received my Chromecast, it would lose network connection, or restart at least once a week.- Graphical interface is optimized for larger TVs.  I have a 27\" 720p LCD in a bedroom, and I noticed that the video artwork is hard to see.  This was not an issue on our 42\" 720p plasma.  Definitely something to consider when using the Fire TV Stick on smaller screens.  For reference, the Chromecast and old Roku XD were fine to use on screens sized 23\", 27\", and 42\".  I even had the Roku on a tiny 15\" screen, and it wasn't too difficult to make out the video artwork.**** Update:  November 24th, 2014 ****A few more observations:- Unlike Chromecast, the screen eventually goes from screensaver to blank.  That is a HUGE positive.- Fast forward and rewind during viewing available at multiple speeds:  1x, 2x, 3x.- Fast forward and rewind during pause only when forward or rewind buttons are depressed.- Fast forward and rewind in all modes operate at 10 second intervals and boundaries (e.g. pauae at 15:24, push forward, next step would stop at 15:30).- Pause is fast, precise (no frame jitter), and picks up virtually instantaneously.  Note that audio and subtitles can be easily controlled during pause.  Very nice!- Scrubbing is seamless in either direction.- Remote is intuitive, easy to operate buttons without looking.I'm really enjoying finding all the subtle details.  This seems to have been thought out very nicely so far.I've bumped my rating to 5 stars based on the latest findings.  I continue to be impressed with the ease of use and intuitive design so far.**** Update:  November 21st, 2014 ****I streamed a show from Amazon Video.  It took about 10 seconds for the stream to go to a HD resolution (or at least less compression).  There were no hiccups during streaming, and the Fire HDX stayed synchronized with the Fire TV stick.  I liked having the option of having the remote available for quick operations, like pausing, rewind, etc.  The Fire HDX was great for when I wanted to use X-ray or browse for other content.I think the Amazon ecosystem is shaping up nicely.  I wasn't a huge fan of the Fire HDX when I purchased it a few months ago, but now that it plays nice with the Fire TV stick, I have new appreciation for it.  I'm really looking forward to getting the Echo (if I ever get an invite!) and seeing how it integrates with the Fire HDX and Fire TV Stick.There are definitely more features I have not explored, so I'll be updating the review with even more interesting details.**** Original Initial Impression ****I'm in the same boat as other reviews:  Have a few streaming devices already (Roku, chromecast), trying Fire TV Stick because of the low $19 introductory price for prime members.I'm only 30 minutes into using the Fire TV Stick.  As some people have mentioned already, I had to wait about 15 minutes for it to update.  After the update, it was ready to go.  A cure introductory video played once we were past a few screens.Observations do far:- Fire HDX sees the Fire TV Stick immediately, allows you to control it.  X-Ray is available on the tablet while the content is streamed to the TV.- App installs happen in the background.- Initiating streaming was almost instant (non-HD).- Setup was a bit easier than chromecast.- Integration with Amazon video was expectedly smooth.- Remote is a definite plus over chromecast.I'm going to update this review some more once I've spent some quality time with it.", "verified": true, "helpfulness": "14/18", "author": "masterhankshake"}, {"rating": 4.0, "review": "The setup was ok. It was annoying that I had to enter my wifi password over and over again. However, the device was set up with my Amazon account from the start, which is a nice touch. Also, they should really make the stupid intro video to be skippable. I've had dozens of devices in the past. I don't need instruction on how to use another one.", "verified": true, "helpfulness": "0/1", "author": "Paul R. Chitoiu"}, {"rating": 5.0, "review": "UPDATE: 03/14/2015 I have two now and as happy as ever.Wow.. I am very pleased with this product. Very easy to install with simple guided instruction. The unit is very compact and comes with a HDMI leader to make installing a breeze. The wi-fi connection is great and steams beautifully. The included remote is intuitive and easy to use. As well the Amazon Fire TV remote app for android works great and I got giddy upon getting to use it to control my streaming video. I bought this unit on pre-order for a reduced price. Having received it I can say whole heatedly would pay regular price for this device in a heart beat and plan on purchasing another in short order.", "verified": true, "helpfulness": "0/1", "author": "Jonzzen \"S Jones\""}]