[{"rating": 5.0, "review": "Obsessed", "verified": true, "helpfulness": "1/1", "author": "Liz"}, {"rating": 3.0, "review": "not too much choices", "verified": true, "helpfulness": "1/2", "author": "Tulsawater"}, {"rating": 2.0, "review": "Product has been more frustrating than worth it. Plex App sucks on Amazon. Audio rarely works. Even streaming Amazon prime videos often causes it to crash. And by often I mean everytime I start watching something. I have to restart every single time in order to watch content. I thought I didn't really like the regular fire TV. I like the TV stick even less.", "verified": true, "helpfulness": "0/1", "author": "Chris Patin"}, {"rating": 5.0, "review": "Love it love it, even without being a prime member you can still stream your favorite shows and apps.. package  arrived as stated", "verified": true, "helpfulness": "0/0", "author": "Tuezday"}, {"rating": 5.0, "review": "Awesome!  Very easy to install. Works perfectly!!!!", "verified": true, "helpfulness": "0/1", "author": "jane holcomb"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Bodo Zimmermann"}, {"rating": 5.0, "review": "The Fire TV stick has a great interface that is responsive. The selection of content is comprehensive, Vudu is the only gross omission. Amazon get on that!The best feature is that the device is small enough to travel with very easily. I have used it in several hotel rooms and it has worked well. Now, I will never be without my video content as long as I have Internet connectivity when I travel.", "verified": true, "helpfulness": "0/0", "author": "Michael McGarry"}, {"rating": 3.0, "review": "Started out great but recently has been EXTREMELY slow and the video is choppy. Internet on all my other devices is lightning fast. Not sure what's wrong.", "verified": true, "helpfulness": "1/1", "author": "Jon"}, {"rating": 5.0, "review": "The best streaming stick for the money! Does everything you want and more.", "verified": true, "helpfulness": "0/0", "author": "Zachary Tithof"}, {"rating": 3.0, "review": "had it for 2 weeks still having problems with this wifi works but keep saying no network availabe", "verified": true, "helpfulness": "0/0", "author": "William W."}]