[{"rating": 5.0, "review": "Great inexpensive gifts for the family! !", "verified": true, "helpfulness": "0/0", "author": "pablo machuca"}, {"rating": 5.0, "review": "This is the best buy I have ever purchased.", "verified": true, "helpfulness": "0/0", "author": "AYackStar \"April Yacksyzn\""}, {"rating": 5.0, "review": "We are so pleased with the quantity and quality of the movies, and shows we can download. Also it was easy to install, and very east to use. Love it!Amazon Fire TV Stick", "verified": true, "helpfulness": "0/0", "author": "DeeGee Whitney"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "sammm"}, {"rating": 4.0, "review": "Would be a perfect score if it had vudu support. Its understandable that they don't offer Google play, but vudu would have been nice as they have flixster. Flixster is pretty slow though. Quality and performance of the device however is pretty good. The ability to cast to this device would be nice too.", "verified": true, "helpfulness": "0/0", "author": "Pete L."}, {"rating": 5.0, "review": "So convenient, I typically use my game system to use apps but with the stick its much simpler. 2 things that are a concern are the remote which is very small and easy to misplace/use. There is an App for smartphones that lets you use you're phone as a remote but it's not as easy to use as the remote and gets some getting used to.  2nd is that I would not recommend keeping the firestick plugged in all the time. It requires to be plugged into a power source to be in use and it gets pretty hot for such a small device. I always unplug it after use, but it's very inconvenient for daily use. Heat kills electronics so if you let it stay plugged as you would any other TV piece it will slow down over time or break sooner than expected.", "verified": true, "helpfulness": "0/0", "author": "Rick Vasquez"}, {"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "andy"}, {"rating": 5.0, "review": "My TV was not smart enough to stream Amazon Prime without a hassle. Fire TV stick made all the difference - instantly!", "verified": true, "helpfulness": "0/0", "author": "Richard T. Betz \"rosy50\""}, {"rating": 4.0, "review": "Great, still updating I guess", "verified": true, "helpfulness": "0/0", "author": "Francisco Reyes Alonso"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Nicolle Frisone"}]