[{"rating": 3.0, "review": "with limited use as yet I have found that I cannot comfortably watch videos because they begin and stop to \"buffer\" and then start again.  I am not pleased with this method", "verified": true, "helpfulness": "0/0", "author": "Lynette Whetstine"}, {"rating": 5.0, "review": "Works great and is incredibly easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Chelsey"}, {"rating": 1.0, "review": "Worked for a little less than 3 months, then started dropping from my network every few minutes. Tried everything I've seen online for troubleshooting and no luck. Bought this for SlingTV and Netflix, don't use any other apps. I wouldn't recommend this product to anyone, so frustrating!", "verified": true, "helpfulness": "0/0", "author": "Jose Cuellar"}, {"rating": 4.0, "review": "If you have amazon prime (instant video) this is great.If your someone who tends to use Netflix more often then go with a roku.", "verified": true, "helpfulness": "0/0", "author": "Cool Breeze"}, {"rating": 5.0, "review": "love it, very easy to use.", "verified": true, "helpfulness": "0/0", "author": "steven brown"}, {"rating": 5.0, "review": "This is the best! With wifi it's strong streaming. Just unplug it, it gets hot it is a fire stick not Fire tv so it's convenient on the go! Or if you want to watch tv in different rooms. It's great everything it say it's is.", "verified": true, "helpfulness": "0/0", "author": "Nicole & Joanna"}, {"rating": 5.0, "review": "Surpassed my.expectation.", "verified": true, "helpfulness": "0/0", "author": "roger perreault"}, {"rating": 2.0, "review": "had a Netflix account. that and the fire stick, were not the same", "verified": true, "helpfulness": "0/0", "author": "robert summerfield"}, {"rating": 4.0, "review": "Great device, Helps access Prime content and others.", "verified": true, "helpfulness": "0/0", "author": "Pablo Guzman"}, {"rating": 5.0, "review": "Love how easy this was to install and set up. Lots of great shows and movies to watch without the hassle of going to the rental box! I only wish I had got one earlier!", "verified": true, "helpfulness": "0/0", "author": "Ludie E. Childrey \"Ludie E. Childrey\""}]