[{"rating": 4.0, "review": "I spend way more time on my couch now!", "verified": true, "helpfulness": "0/2", "author": "Kadi Ann Spencer \"kadith\""}, {"rating": 2.0, "review": "Find it very slow, even though I have high speed internet.", "verified": true, "helpfulness": "0/2", "author": "P. Trujillo"}, {"rating": 5.0, "review": "Love this product. Exactly what I expected and more! Fabulous price!", "verified": true, "helpfulness": "0/1", "author": "Mary Adams"}, {"rating": 5.0, "review": "Loving it so far!", "verified": true, "helpfulness": "0/1", "author": "Deborah Bunton"}, {"rating": 3.0, "review": "So I bought this thinking I would try out Sling tv. So amazon offered a 14 day free trial on the fire stick, I signed up and immediately after spent over an hour on tech support because it wouldn't work. Eventually sling support told me to just cancel the service from amazon and sign up directly with them of course then I only got a 7 day trial. The menu of the Fire Stick is not that great it shows way to many \"advertisements\" basically for amazon video and amazon games and amazon everything. I would prefer to just see what I want to use on the menu system instead of all that junk. Other then that it does work pretty well. I mostly use it for Netflix and Emby.", "verified": true, "helpfulness": "0/2", "author": "Jake"}, {"rating": 5.0, "review": "It works great, so easy to set up and use. Very excited.", "verified": true, "helpfulness": "0/1", "author": "michelle"}, {"rating": 5.0, "review": "Love it! 👌🏽", "verified": true, "helpfulness": "0/1", "author": "Harmony33"}, {"rating": 5.0, "review": "a great purchase.  Really enjoying watching a variety of shows", "verified": true, "helpfulness": "0/1", "author": "Susan Daily"}, {"rating": 5.0, "review": "I'm now canceling my cable. I bought 2.", "verified": true, "helpfulness": "0/1", "author": "Matt"}, {"rating": 5.0, "review": "Lots of free content and Prime is awesome with the Amazon Fire Stick!", "verified": true, "helpfulness": "0/1", "author": "J. CASTONGUAY \"Jonny C\""}]