[{"rating": 3.0, "review": "There are few \"good\" apps, all the decent movies cost over $6 to rent and the remote sticks when you use it. If more apps are added and the price of the movies go down it will be wonderful. By the statement of thousands of movies leaves us to believe free movies and not expensive movies. With the stick being fairly new it's good for what it is, time will make it better. I'm very optimistic. We didn't get the free trial promised either.", "verified": true, "helpfulness": "1/1", "author": "David DeWitt"}, {"rating": 5.0, "review": "Excellent media device. I have already owned the Amazon Fire TV for a while, and once this came out, it was a no brainer to get the Fire stick. This allows me to view Amazon content, Netflix, etc on other TVs in my house, and is also portable if I ever decide to use it somewhere else. I think this is great for anybody, but if you're a prime use,r it's even better. You instantly have all of your Amazon content, music, photos, all connected to your media system.", "verified": true, "helpfulness": "0/0", "author": "Digitalmaster"}, {"rating": 3.0, "review": "Easy enough to set up.  However, in first 24 hours, it lost connectivity twice and had to be reset.  We watch a lot of IFC films (European, etc.) and often these are subtitled.  At least as far as the Netflix app on this goes, the subtitles are in black type which disappears almost entirely on any film which is not brightly lit.  The regular Netflix app on my Blue Ray DVD player and smart TV have subtitles whose type is bright white/yellow and visible under all circumstances.  I do not know if the type color can be corrected on this device or not.  This is one of two items which I am going to contact customer service about.  The second issue is that the volume from the device appears low.  For one movie we had to turn our TV volume to max in order to adequately hear the dialogue.  I am not sure if this was related again to a connectivity issue or not.  It should be noted that when the device was having connectivity issues, none of the other WiFi devices in our house had any issues.  The connectivity issue was strictly a Fire TV Stick issue.It does make using some apps easier, but the above problems make it a bit underwhelming at this point.  I will be interested to see what Customer Service has to offer.", "verified": true, "helpfulness": "2/2", "author": "Gen. Contractor \"Uppset fan installer\""}, {"rating": 5.0, "review": "Got it with the special order for Prime members for under $20. Package is beautiful and it's easy to set up. Works great ! Access to all of Prime and lot's of apps.", "verified": true, "helpfulness": "0/0", "author": "EVNJ"}, {"rating": 4.0, "review": "Falls way short of the full fire TV box, which we love.Second Thoughts Update: bumping up by a starIn the early days, we had trouble streaming Amazon prime with many pauses (annoying!).  But over the last three nights, we gave it another try and Amazon streaming has since started to work perfectly.I may come back after a few more weeks and go to full 5 stars (for a streaming stick) but still like the full Fire TV box better.", "verified": true, "helpfulness": "0/1", "author": "L. McCarter"}, {"rating": 2.0, "review": "My peeve is if you accidentally hit buy. You bought it. Before I had the stick I always had to enter a code assuring that I want to buy. Also it would as you \"OK\" then you can proceed to buy or not. Now you click it. You bought it.", "verified": true, "helpfulness": "1/1", "author": "Amazonian"}, {"rating": 2.0, "review": "This product is not that great. I was really excited about it, but it is not that great. The install is very easy.", "verified": true, "helpfulness": "1/1", "author": "Richie"}, {"rating": 2.0, "review": "CAUTION:  THERE IS AN OVERHEATING ISSUE.  IF THIS SHOULD OCCUR, UNPLUG, ALLOW TO COOL, AND PLUG BACK IN.  IF THE PROBLEM PERSISTS, IMMEDIATELY UNPLUG AND RETURN TO AMAZON. This means hot and not warm.  The device will be warm because it is carrying a continual current, which isn't well insulated.Review for amazon fire TV and 2 amazon fire TV sticks.I recommend the Roku 3 over these units any day.I was attracted to these units due to its voice feature, but it can only be used in the search mode, and it only works to search in amazon.  For the fire TV stick, I purchased the voice remotes at an additional cost.Yes, I know this is an amazon product, but they made it difficult to use the other apps.You will need to create an amazon account if you do not have oneFirst, you automatically open up in amazon. That is fine if you don't want to use other apps; it also wouldn't be bad if your apps went into the app library, but for some reason they don't always go there. I also had a lot of difficulty with getting Netflix to download on the Amazon Fire TV. We had to do a factory reset, and after some searching I was able to find and download Netflix, which never went into the app library. (It was suppose to be in the app library from the very start, but it has NEVER appeared there, not even after being downloaded.). Netflix also keeps disappearing, so I continually have to find it download it again and enter my account information. I have contacted customer service, but they feel like the problem is fixed, since I can download Netflix again and again and again.The Roku appears to search all or MOST of my apps for the movies or shows I want. It tells me the prices or where I can get it for free. The amazon doesn't have this feature. (I know it searches VUDU, Amazon, Netflix and Hulu Plus all at one time.)Ok, I can imagine everyone shaking their heads and thinking I got a dud. In that case, I got three duds, because I also ordered two amazon fire TV sticks, and they each were flawed in different ways. On one, it wouldn't download the software at first. Then it took two hours to download. On the other, it wouldn't download the software at first, but then I got it to work quickly (no slow download issues). The second one had the same problem as the amazon fire TV had with the Netflix, but this time it was with Hulu Plus. So there are definite quality issues. (I also set them all up on the same TV, so it wasn't related to my hardware.). All of the flaws were due to poor quality issues with the amazon products.Also, the Fire Sticks, while plugged directly into the TV, still require a power cord be attached to them to work.As for the search features on the amazon fires, it doesn't allow you to search genres in just prime.  You get everything, both the pay TV and prime (as far as I can tell).Overall, I would recommend the Roku 3 over amazon, net gear, chromecast, Sony (or other DVDs based media), or apple. While this is a great device if you only want to use amazon, it has many irritating flaws that still need debugging. However, for overall all performance and selection, I would suggest the Roku 3.", "verified": true, "helpfulness": "2/3", "author": "Kelli"}, {"rating": 4.0, "review": "Haven't had the opportunity to use it fully yet.. but so far, it has been awesome!", "verified": true, "helpfulness": "0/0", "author": "Jon Williams"}, {"rating": 1.0, "review": "FAIL!!! I was seriously hopeful for the fire stick to replace my roku boxes but it fails on the very basic level of not having access to my local NAS drives where all of my movies, tv shows, music, et al live. how on earth does amazon expect to compete with all the other streaming sticks yet omit this most basic necessity?! if they don't announce an update including local nas access, both fire sticks are going back!!!", "verified": true, "helpfulness": "0/0", "author": "friede \"über geek\""}]