[{"rating": 5.0, "review": "Great product. Some 3rd party apps need improvement, namely Sling TV and History.", "verified": true, "helpfulness": "0/0", "author": "Emmett Melendez"}, {"rating": 5.0, "review": "Love it! I just wish I could stream from my iPhone!", "verified": true, "helpfulness": "0/0", "author": "Lauren Wingfield"}, {"rating": 5.0, "review": "Awesome I love it!!!", "verified": true, "helpfulness": "0/0", "author": "vanesa castillo"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 5.0, "review": "It's truly genius", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 1.0, "review": "stick gets very hot t.v.  shuts down", "verified": true, "helpfulness": "0/0", "author": "carlos isaac"}, {"rating": 5.0, "review": "I love this thing. Work in desert where there is no TV. Wish stick would get upgrade like Fire TV for headphones.", "verified": true, "helpfulness": "0/0", "author": "Dennis Spiegel"}, {"rating": 2.0, "review": "It worked for about 4 months but in the last month or so it refuses to play Netflix, giving a constant \"We're having trouble playing this title right now...\" type error (see picture).  I used to back out and start from a previous episode to 'trick' it into playing what we want.  At first I figured it was Netflix but after getting in another Roku 3 and hooking it up to the same TV (last weekend) the Roku had no problem with Netflix or any other channel.  Yes, I have expanded my allowed number of streaming devices on Netflix to include every TV that has a Roku or Fire TV so I am not trying to stream to too many devices at once.  Since we have dropped cable TV devices like this are our link to TV entertainment.  If someone has a fix or reason for the Fire TV to act congested when trying to play Netflix I would like to learn how to fix this since it is as of right now a product I can not recommend.", "verified": true, "helpfulness": "2/2", "author": "J. C. \"tfd0103\""}, {"rating": 5.0, "review": "Good stuff works great!", "verified": true, "helpfulness": "0/0", "author": "Robex74 \"Robex74\""}, {"rating": 5.0, "review": "Great price, small and can be hidden. Easy to use --- Apple you have some serious competition!", "verified": true, "helpfulness": "0/0", "author": "soniboy80"}]