[{"rating": 5.0, "review": "A great device you can do a lot with it", "verified": true, "helpfulness": "0/1", "author": "YOUNES LARAJ"}, {"rating": 5.0, "review": "Very cool gadget. I plugged it in and have had no problems. I have Netflix and Sling and am very happy with the quick response it gives when switching from place to place.. Also love the way I can view all of my photos and play a few games that I like. I actually ditched my satellite company! Yay!", "verified": true, "helpfulness": "0/1", "author": "arizonavegan"}, {"rating": 5.0, "review": "Absolutely LOVE it! My husband and I are so happy with this purchase that I've already gotten my mom looking in to getting her one too! It was super easy to install & register. It's SOOO user friendly and is the best thing we've gotten in a really long time!Thanks for the great product!", "verified": true, "helpfulness": "0/1", "author": "Angela"}, {"rating": 5.0, "review": "I love it...works great", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": ":)", "verified": true, "helpfulness": "0/1", "author": "Courti101"}, {"rating": 5.0, "review": "I have a Fire TV box and love it as well, but wanted Fire TV in my bedroom, so I got this. I ended up getting the 'voice' remote just so they'd match - the quality of the 'Stick' remote seemed fine.", "verified": true, "helpfulness": "0/1", "author": "Robert G. Smith"}, {"rating": 4.0, "review": "I like this very much but now wish I had purchased the Fire TV box instead.  I did for my sons and they love the feature that lets you verbally search.", "verified": true, "helpfulness": "0/1", "author": "jkk"}, {"rating": 5.0, "review": "Great device. Quick set up. Love it so far.", "verified": true, "helpfulness": "0/1", "author": "Rachel N Knuppel"}, {"rating": 5.0, "review": "I like this, another option for television viewing.. I know prime is new to the market, so waiting for them to get more t.v. shows as cable \"on demand\" is rather spotty here of late.", "verified": true, "helpfulness": "0/1", "author": "Kim Neske"}, {"rating": 5.0, "review": "I've the Fire TV Stick for about a month now and it has been awesome.  Set up was very easy and was watching my Netflix movies within 30 minutes (takes time to enter usernames/passwords for the different accounts).  I would recommend using the phone app (I have the android version) as an alternative remote when you are searching for items within Youtube, Netflix, etc as it is easier to type on the keyboard.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]