[{"rating": 5.0, "review": "Bought this hoping it would handle Netflix better than our Wii u system.  We pretty much replaced the Wii u (with probably a thousand dollars worth of accessories and games) with just this little thing.  The free games are great for a 5 year old, and Netflix supports profiles (unlike the horrible Wii u app that somehow does not).", "verified": true, "helpfulness": "2/2", "author": "Davebrah"}, {"rating": 5.0, "review": "Easy set up, works great so far.", "verified": true, "helpfulness": "0/0", "author": "kansasmike"}, {"rating": 4.0, "review": "I like it. It was easy to install and get up and running and is easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Richard Sackerson"}, {"rating": 5.0, "review": "So far this unit has been working fine and I have been very pleased with it !! Thank you.", "verified": true, "helpfulness": "0/0", "author": "Stotz44Jackie#"}, {"rating": 5.0, "review": "Love it! I'm having so much fun with it! So much I want to watch.", "verified": true, "helpfulness": "0/0", "author": "Linda VandenBergh"}, {"rating": 4.0, "review": "It works as expected. 3 minutes from box to hooked up and connected, seems very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Shadowluck"}, {"rating": 5.0, "review": "I love the fire tv stick,its so much easier than the Chromecast. after I learned how to get the apps I wanted ,(NEXFLIX of course) everything else was easy.", "verified": true, "helpfulness": "0/0", "author": "lynn bennett"}, {"rating": 3.0, "review": "My Flat screen is mounted on the wall.  The cord is not long enough to make the device stick out in the open to reach my WiFi.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I didn't do the actual set up but was told it was very simple.  I have used for a week now and find the remote and menu very user friendly and easy to navigate.Very glad I made the purchase and highly recommend to maximize benefits of Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "SoCal"}, {"rating": 5.0, "review": "Not thrilled I had to renew my Netflix to get Breaking Bad for \"free\" but some things are worth paying for!  VERY happy!! Like that I can take advantage of all Prime has to offer.  Well rounded offering.", "verified": true, "helpfulness": "0/0", "author": "Nannette"}]