[{"rating": 4.0, "review": "Nice that it's already set up with your prime account!  Only downfall is no vudu :(", "verified": true, "helpfulness": "0/0", "author": "S. Keiling \"bosox fan\""}, {"rating": 4.0, "review": "Having to hey used to it. .. can't find NCIS one of my fav programs", "verified": true, "helpfulness": "0/0", "author": "Pamela Fein"}, {"rating": 5.0, "review": "It's better than I thought it could be.  It comes already to go, plug and play.  It accesses Amazon music, apps, Netflix, Amazon Prime, Hulu, Youtube... They seem to be severely back ordered (or were when I ordered it) as it took over a month to be delivered, but it was worth the wait.", "verified": true, "helpfulness": "0/0", "author": "Dan Powers"}, {"rating": 5.0, "review": "Works perfectly.  Can swap TV's and no issues.  Better than the app built into my new Samsung TV.", "verified": true, "helpfulness": "0/0", "author": "Myles Baczynski \"Myles\""}, {"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Coinquistador"}, {"rating": 5.0, "review": "Better than expected", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "never worked could not connect to my wifi.The most i got to watch was 20 seconds of pbs.will not buy again have move over to roku and love it", "verified": true, "helpfulness": "0/0", "author": "Gabriel Palacios"}, {"rating": 5.0, "review": "We love this thing.  We use it at the campground in our rv.  It uses the Wi Fi at the campground and I can watch my shows on hulu, play music from Spotify.  The kids love the games when they want something new to do at the campground.  The menu moves quick and it doesn't freeze up at all.  We love it!!", "verified": true, "helpfulness": "0/0", "author": "Sabrina"}, {"rating": 3.0, "review": "I've had my fire stick for a over 7 months and was initially very impressed by its performance and content. Lately however, I have been watching long videos on YouTube, and noticed considerable lag and heating on the device. Videos would stop playing and I have to stop for a few minutes to let it cool down. It has been an inconvenience, but it works well for Netflix and other streams.", "verified": true, "helpfulness": "0/0", "author": "s.p"}, {"rating": 4.0, "review": "Recommended by my nephew, I do love the Fire TV Stick and the programs it offers.  I do not like the fact I cannot get sound through my receiver.  I will be purchasing Fire TV within the next month or so because I believe it comes with a port that connects to the receiver for sound.", "verified": true, "helpfulness": "0/0", "author": "Jim Maosn"}]