[{"rating": 5.0, "review": "I really do like this,  It is really fast, I can watch Netflix, Hulu, Amazon prime and all the movies and such with out being hooked up to my modem with wires running everywhere", "verified": true, "helpfulness": "0/0", "author": "James Lloyd"}, {"rating": 5.0, "review": "Awesome and not complicated.  Thank goodness it has no cables.", "verified": true, "helpfulness": "0/0", "author": "book maven \"book maven\""}, {"rating": 5.0, "review": "I love, love, love my Firestick with its' baby remote. Had Chromecast...boo.  Had Roku and it was just ok.  With my Firestick I am staying up half the night watching tv series and movies. Btw, Alpha House is sooooo good!", "verified": true, "helpfulness": "0/0", "author": "Constance"}, {"rating": 4.0, "review": "I am please with the firestick, and installing it was not too difficult either. However, I am disappointed with the Amazon prime moving selections. The movies I was interested in were all at a rental or purchase fee, that was actually higher than what is available through other movie rental options. When \"Amazon prime\" advertised over 4000 movies available, the implication was they were included in the cost of the \"Prime\" membership, but that is not the case. The one nice thing is that with the fire stick, at least I can access both \"Amazon Prime\" as well as the other movie rental system such as \"Netflex\" and \"Hulu\", so I don't have to change devices for those companies.", "verified": true, "helpfulness": "1/1", "author": "Sandra Robertson"}, {"rating": 5.0, "review": "When the daily programming is so yucky, the fire stick has been a really nice change, allowing us to select movies and tv programs we liked.", "verified": true, "helpfulness": "0/0", "author": "Diana Price"}, {"rating": 5.0, "review": "Absolutely fantastic!!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Peter Thompson"}, {"rating": 1.0, "review": "It was a gift or we would have returned it.  It did not work at all.  All we got was five minutes of buffering followed by two seconds of program, over and over again.  And, the problem is not with our internet provider.", "verified": true, "helpfulness": "2/2", "author": "Kathy D."}, {"rating": 1.0, "review": "Very poor instructions both with the set up as well as the operation. I admit that my technical skills are limitted but even with qualified help it was difficult.", "verified": true, "helpfulness": "1/1", "author": "joseph davis"}, {"rating": 4.0, "review": "Works just as advertised! Easy set up and easy to link to wireless modem. I plugged into HDMI in my amplifier and have great sound and picture.", "verified": true, "helpfulness": "0/0", "author": "Tim Lydon"}, {"rating": 5.0, "review": "I love the Fire TV Stick. Your original Prime programming is excellent. The selection of movies is very good. It is easy to set-up and use out of the box.  Thank you!", "verified": true, "helpfulness": "0/0", "author": "Dan McGuire"}]