[{"rating": 5.0, "review": "A +++", "verified": true, "helpfulness": "0/0", "author": "Gerald boutte jr"}, {"rating": 5.0, "review": "Love it. Don't need cable!", "verified": true, "helpfulness": "0/0", "author": "Lisa Scorpio"}, {"rating": 5.0, "review": "Great product. Wish all my household televisions could be connected. Would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Ed McElhenney"}, {"rating": 2.0, "review": "The fire stick is fine but has issues connecting with our 2006 samsung flat screen. And if/when it does connect it will cause static when we use our DVD player so we can't just leave it plugged in. It's kind of inconvenient and therefor we don't use it as much as I'd hoped.", "verified": true, "helpfulness": "0/0", "author": "courtney smartt"}, {"rating": 5.0, "review": "Great item and very affordable alternative to paying a cable provider. The voice command option isn't really necessary so save your cash. Not that it doesn't work; you just don't need it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "super easy to use. Basically a plug and play.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "MARY ROBBINS"}, {"rating": 3.0, "review": "It's okay.  They advertise that it's a stick you plug into your HMDI plug but they don't tell you, nor show, that there is also a cumbersome power cord that sticks out of the fire stick and then you have to find yet another power outlet to plug it into and try to hide yet another chord with the maze of chords and wire behind your TV.  Also, the Fire Stick dominates my sound system that is hooked up to my TV in that as soon as I turn on my TV the Fire Stick powers up and takes over even if I don't want to watch Fire stick TV.  So then I have to use my TV remote to change the input in order to watch regular TV.  The third annoying thing is the DAMN remote.  No directions on how to open it to put the batteries in.  You have to go on-line to look for directions or a video to figure it out.  Even Amazon (on their video) tells you to use a sharp knife in order to coax the DAMN thing open.  POORLY DESIGNED remote if that's what it takes to open the DAMN thing!!!!!", "verified": true, "helpfulness": "0/0", "author": "Frederick DeNorscia"}, {"rating": 3.0, "review": "I am disappointed that I cannot easily cast internet sites from my i pad to my TV using Fire Stick.  I have tried to find some apps that will work with fire stick to make this happen but I have not been able to find one.  The instructions sent with Fire Stick should have listed some apps and applications to make this happen.  I have found apps to project photos but not websites.", "verified": true, "helpfulness": "0/0", "author": "David B. Lamb"}, {"rating": 1.0, "review": "This claims Miracast certification and it apparently is, but don't assume that it will work with just any Miracast-capable device. It does not at present work with ANY Windows device, though they are Miracast-capable and apparently work with a bunch of other Miracast devices. So don't assume your Windows tablet, laptop, or phone will work with this. It will not.The product page says (in small type) that Windows 8.1 support is \"coming soon\" whatever that means. It doesn't mean now.", "verified": true, "helpfulness": "0/1", "author": "Julie Miller"}]