[{"rating": 3.0, "review": "Until now there are some apps I often use that appear unavailable on the stick, like YouTube. And there are others feature apps unavailable also (ESPN for example). It also lacks a good DNLA app to play my collection of movies.So far I've been able to play only movies from Netflix, those from amazon prime always show a \"license error\".", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As expected. Thank you", "verified": true, "helpfulness": "0/0", "author": "Richard L Eide"}, {"rating": 4.0, "review": "i'm having a problem with streaming/buffering taking too long. other than that it was simple to set up and once I get this problem taken care of I plan to order a coule more", "verified": true, "helpfulness": "0/1", "author": "carol anne smith"}, {"rating": 4.0, "review": "Bought Fire TV Stick as an alternative to Apple TV in the guest room. We have Amazon Prime so it is great that we get Netflix and Prime video in one device. Can't beat it for the value...... but if you have all your music on iTune then it is not ideal.", "verified": true, "helpfulness": "0/0", "author": "M. Ho \"First Time Mom\""}, {"rating": 3.0, "review": "Purchased twoOne works and the other defective.  Tried the stick on other tvs but still will not connect to wifi.  bummer!!!  For the one that works my daughter loves it.", "verified": true, "helpfulness": "0/0", "author": "mocha"}, {"rating": 5.0, "review": "Love it, picks up the wifi perfectly (we have trouble with other devices, but not this)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great, no issues and very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Donna R"}, {"rating": 5.0, "review": "We love Fire Stick.  It was super easy to set up and to navigate and I like all the apps and options available.  Can't wait to see what else is added.", "verified": true, "helpfulness": "0/0", "author": "Robin"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Gary Paraschak"}, {"rating": 4.0, "review": "Just now learning to use so far pretty good. One mistake, I have Netflix but not knowing I ordered a movie and was charged. Did not realize I needed to be on  logged into Netflix to get it free. Was charged. Learn by our mistakes.", "verified": true, "helpfulness": "0/0", "author": "Theresa O'Donnell"}]