[{"rating": 4.0, "review": "Works pretty well. Previously, I had used my blue ray player with Wi-Fi to get connected to my favorite movies & TV shows online.  However, most of the time I would repeatedly experience interruptions when the program paused to buffer (FYI, I use Verizon Fios).  It was very annoying.  The Fire TV stick cut back on these interruptions by 90 to 95 percent.  The only slight negative discovered to date is when I plug in the Fire TV stick, I must unplug my TV antenna's electrical booster.  This is not a serious problem because I only need the TV antenna to receive digital signals from the air to watch TV and when I am finished watching online I simply unplug the Fire TV stick and plug in the TV antenna booster.", "verified": true, "helpfulness": "0/0", "author": "Michael S. \"Michael S.\""}, {"rating": 5.0, "review": "This is perfect if you have no cable. You can see all of the current tv shows as well as movies and it has Netflix. The UI is very smooth too. The Voice function is a bit hanky but I'm sure Amazon will refine that with time. I don't use the voice feature anyway.", "verified": true, "helpfulness": "0/0", "author": "J. GODFREY"}, {"rating": 4.0, "review": "The Fire TV stick is really neat, I like that i can listen to my amazon music through my TV and they have it set up to where you can read the lyrics to the song as well. It is really easy to use too. The only downside is it doesn't load the movies/tv shows very fast. some days it's great, and some days it buffers every few seconds. This could be because of my internet connection but then I use my laptop and it has better connection. So unless your internet connection is perfect, maybe go for the Fire TV box instead.", "verified": true, "helpfulness": "0/0", "author": "Lia"}, {"rating": 3.0, "review": "At times when it's been on for awhile it seems to cut out or pause.  I have the fire box as well and it doesn't do that at all.", "verified": true, "helpfulness": "0/0", "author": "Heather Ricketts"}, {"rating": 5.0, "review": "The fire stick is great. It is very easy to use with the remote control and makes watching Amazon Videos a breeze.", "verified": true, "helpfulness": "0/0", "author": "canonphotos"}, {"rating": 3.0, "review": "I have no idea why this seeminly simple device is so poorly developed. Ostensibly this is a competitor to the Chromecast. It's just amazing how much more horrible a product it is. The remote control", "verified": true, "helpfulness": "0/1", "author": "Rob Dillon"}, {"rating": 3.0, "review": "The first flaw is that it doesn't work with the USB port in the TV to power the unit, so you need to manage the long cable and connect it to a power outlet - which can be messy if you have a wall mounted TV. Second flaw is that the sound quality is very poor. I tried various settings but still the sound levels are very low on my SONY 720p LCD TV.", "verified": true, "helpfulness": "0/0", "author": "Harold Finch \"Lots2Doo\""}, {"rating": 5.0, "review": "Amazing product", "verified": true, "helpfulness": "0/0", "author": "Daniel Pinkstock"}, {"rating": 2.0, "review": "Upon additional use of the TV Stick, I occasionally have to re enter account data to access Netflex. This is very inconvenient.", "verified": true, "helpfulness": "0/0", "author": "scott h jordan"}, {"rating": 5.0, "review": "Easy set up. Loads of content. intuitive controls with built in tutorial.", "verified": true, "helpfulness": "0/0", "author": "Michael Southern"}]