[{"rating": 5.0, "review": "works like a charm - very pleased!", "verified": true, "helpfulness": "0/0", "author": "Linda O'brien \"Burnt Offerings Studio\""}, {"rating": 5.0, "review": "I liked it so much I got one for the kitchen.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "best purchase in a long while  i love to use it with my phone and youtube is awesome no ads!", "verified": true, "helpfulness": "0/0", "author": "Jose A. Prado \"high water jump suits and a raped ape\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "dalton kennett"}, {"rating": 5.0, "review": "Love it. Works very well. Very user friendly", "verified": true, "helpfulness": "0/0", "author": "Andrew Hardin"}, {"rating": 5.0, "review": "Live it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It's ok but I wish there were more older movies available most of the new movies stink but that's not Amazon's fault.", "verified": true, "helpfulness": "0/0", "author": "george major"}, {"rating": 5.0, "review": "Awesome! Love it!", "verified": true, "helpfulness": "0/0", "author": "Lynnette Anderson"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "YOU CHANG MIN"}, {"rating": 5.0, "review": "I love this little stick, at first had issues with my HDMI port, it was locked on my Sony Bravia but after buying a sony remote and being able to unlock the port properly, all is working and all is good!!! This little stick is wonderful and my whole family just loves it. At first I had it hooked in my dining room because of the locked port on my living room t.v. so when I bought a sony remote and was able to unlock the HDMI port I was able to move it to the living room. You can move this little stick from room to room without interruption. I could cancel my cable now because it is so much to watch on the firestick and my cable bill is pretty high. Whoever is not sure about buying this, I say go for it, very easy to hook up and I should know because I did it and I even got past the locked HDMI port. It is a wonderful product!!!", "verified": true, "helpfulness": "0/0", "author": "Allyson M. Trionfo"}]