[{"rating": 5.0, "review": "Does exactly what I needed it to.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "We love it!!", "verified": true, "helpfulness": "0/0", "author": "Beth B."}, {"rating": 4.0, "review": "I just wish some of the apps on the regular Fire TV worked on the Stick as well.  Hopefully more apps will be available soon.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 2.0, "review": "Was compared to chromecast and that is why I purchased your Fire TV Stick, but it doesn't come close.  Now I have to get chromecast.", "verified": true, "helpfulness": "0/0", "author": "lashan king"}, {"rating": 5.0, "review": "Great gadget for the price! Very easy to set up also!! Works very well with my wifi internet! The compartment on the remote control for the batteries was hard to open, but other than that nothing bad to say!! I would recommend this product to buy especially anyone who has Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Marie Wilhelm"}, {"rating": 5.0, "review": "Wish I would of got this a long time ago", "verified": true, "helpfulness": "0/0", "author": "Jeff \"bergue04\""}, {"rating": 4.0, "review": "I love this thing! it auto powers (and switches input is necessary)on my tv when i hit the HOME key. The Apps Work great, and it has no speed issues that i can tell.my only 2 complaints are:no universal search. I understand Amazon wants to push their PRIME service, but i got used to it on my mothers ROKU, and miss it very much.It really should come with the voice remote. I have a android phone, and the Fire TV app is great, but it really shouldn't need to be a extra.", "verified": true, "helpfulness": "0/0", "author": "Justin Phillips"}, {"rating": 5.0, "review": "Best thing i ever bought!!!", "verified": true, "helpfulness": "0/0", "author": "samuel padilla"}, {"rating": 4.0, "review": "I am so happy with my Fire stick I don't think I'll ever go back to cable. It allows me to watch my Netflix, Hulu on HD TV . Use my kindle apps and listen to pandora. 👍👌", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "The choices of music RE awesome. The choices of movies are older. The problem I have is with streaming the products. On the IPAD there is no problem however on any other device it takes forever to stream and them continues to buffer every 1:45. This is the same issue with trying to get onto the Amazon home page. Tried at different times of day and still had the same issue... Wish I could stream and not buffer so often.", "verified": true, "helpfulness": "0/0", "author": "sue cavin"}]