[{"rating": 5.0, "review": "Great product.  I stopped using my chromecast because this does so much more.", "verified": true, "helpfulness": "1/1", "author": "greg"}, {"rating": 4.0, "review": "The fire stick is easy to use and has lots of movies and shows.  We just miss our local news stations.  Maybe they will be offered at some point???", "verified": true, "helpfulness": "1/1", "author": "Kathryn E. Roth"}, {"rating": 5.0, "review": "I love it, i mean it's a little bit laggy sometimes but i love it. would recommend to my friends, if i had not already.", "verified": true, "helpfulness": "0/0", "author": "William akerfeldt"}, {"rating": 5.0, "review": "It is pretty easy to set up...although I had guidance and once I had it connected to my wifi....and set up my Netflix account....I have started already enjoying it. I can't wait to explore whatelse it does. I may never leave the house again!!!", "verified": true, "helpfulness": "0/0", "author": "DouglasLeland"}, {"rating": 2.0, "review": "I have been having a terrible time with the remote for this device.  I was able to get a new remote from Amazon, but this remote didn't work either.  I am ready to send it back.", "verified": true, "helpfulness": "0/0", "author": "M. Wakely \"sci-fi fan reader\""}, {"rating": 4.0, "review": "I tell all my friend about fire TV stick this device is exelent. Thanks Oli. In", "verified": true, "helpfulness": "0/0", "author": "Orlino Capili"}, {"rating": 1.0, "review": "Big mistake!! I love my chromecast better as it's easier to use with iPad/iPhone.  Who cares about fire stick remote when it's not even easy to use fro browsing", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 5.0, "review": "Just what I needed for the bedroom tv...use the blu ray in the living to stream, but my other dvd player doesn't have many streaming options...took about 5 minutes to hook up and the streaming is quick and the picture quality excellent", "verified": true, "helpfulness": "1/1", "author": "GraceW \"marmee54\""}, {"rating": 5.0, "review": "thinking about buying a second​ one", "verified": true, "helpfulness": "0/0", "author": "Sean B."}, {"rating": 5.0, "review": "Best thing ever. Its been a long time that I just did a plug and play and enjoyed ! Found my account, loaded everything, movies, music etc. Its a must have.", "verified": true, "helpfulness": "1/1", "author": "Gerald V. Poirier"}]