[{"rating": 5.0, "review": "nice product easy to use and works well so far", "verified": true, "helpfulness": "0/0", "author": "D biker"}, {"rating": 5.0, "review": "WORKS GREAT", "verified": true, "helpfulness": "0/0", "author": "HUTCHINSON"}, {"rating": 5.0, "review": "Love, love love this.  We do not how we did with out it before.  We are catching on series we didn't get see from the beginning or old ones like Star Trek we want to watch all episodes again.  Movies also.  Super easy to use.  I can't say enough about how much easier it is to access what we want to watch.", "verified": true, "helpfulness": "0/0", "author": "Denise R. Mack"}, {"rating": 5.0, "review": "Hands down one of the best things I've bought in awhile. I also got it for $19.99 during that 2 day deal Amazon was offering. I like it as much as my Apple TV. It's way better than my Roku. If you are an Amazon Prime member you get so much free media (movies, music, TV shows). Also, every vinyl or CD I bought through Amazon shows up as a purchased item in my music files. The stick took me literally 2 minutes to plug in a set up.....it was already hooked up to my Prime account. I already told my friends and family to purchase this, I believe it is already back ordered. It is definitely a must have and is worth the $39.99 price tag it now is.", "verified": true, "helpfulness": "0/0", "author": "Slupo"}, {"rating": 3.0, "review": "It does not connect to the internet well.  Slow loading.  Cannot watch videos because not connecting to the internet well.", "verified": true, "helpfulness": "0/0", "author": "carmen 8"}, {"rating": 4.0, "review": "I really like the fire stick.  I love being able to play my prime music through the TV, so I don't have to waste my phone battery, or leave my laptop sitting out inconveniently.  I am still getting to  know all the features, but am enjoying it a lot so far.  I just need another fire device, so I can swipe from the tablet to the tv to watch some streaming shows, since I don't have hulu plus.", "verified": true, "helpfulness": "0/0", "author": "Valerie Schrott"}, {"rating": 5.0, "review": "Cant complain much since I got this pre-order for $19!!! It works as expected. Nothing groundbreaking but I like it much better than the Google Chromecast. Will like it more when they release the iOS app!", "verified": true, "helpfulness": "0/0", "author": "Chet Pope"}, {"rating": 5.0, "review": "This is awesome!  Love it", "verified": true, "helpfulness": "0/0", "author": "tracmorboom"}, {"rating": 1.0, "review": "This thing just flat out sucks.  It claims to have a 'better WIFI performance.'  Better than what? A rock?  I've had Chrome cast since it came out on the same TV for over a year and it never disconnects.  This thing has to re-connect every 8-10 seconds.  Just terrible!", "verified": true, "helpfulness": "2/2", "author": "Brian"}, {"rating": 4.0, "review": "Just got mine in 12-11-14 and loving it for the price it's everything I need. I did a youtube unboxing and review.https://www.youtube.com/watch?v=6jIKxmsE7CY", "verified": true, "helpfulness": "0/0", "author": "IT Guy"}]