[{"rating": 1.0, "review": "my first venture into streaming media devices. I was completely dissatisfied in the Amazon Fire TV Stick. I immediately realized I did not care for the \"way too small remote\". also, I immediately realized I did not care for the on screen menu nor its functions. and it seemed everything offered revolved around Amazon Prime!to further my disappointment, as I moved thru the on screen menu, in several cases, the screen froze up on me. also the Fire TV Stick got very \"hot\" while plugged in to my HDMI port...........now there is nothing wrong with my TV or my Wi-Fi cable connection.very simply....I did not like it!I returned this Amazon TV Fire Stick back to Best Buy where I had bought it. now i have done a lot of research or investigation on streaming media devices...rather than exchange for another Fire TV Stick to see if it might work better. I decided to go for the ROKU 3!the ROKU 3 works perfectly. as of now I am very happy with the ROKU 3 in every way. to me there is no comparison what so ever between the two. the ROKU 3 blows away the TV Stick in every way!", "verified": true, "helpfulness": "0/0", "author": "john f. clifford \"clark case\""}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Ashani C. Motisola"}, {"rating": 4.0, "review": "I like it but movies and shows keep pausing and the remote is dinky.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "One great piece of technology for those of us that do not yet have a smart tv.  Installs easily and so simple to understand and use it to navigate the many selections you now have.  For the price, it is a great must have is you love tv and gaming.", "verified": true, "helpfulness": "0/0", "author": "Judson Thompson"}, {"rating": 1.0, "review": "Didn't work for us...we weren't able to connect to our TV...:-0(", "verified": true, "helpfulness": "0/0", "author": "maritza torres"}, {"rating": 5.0, "review": "Works 100 times better than the Google Chromecast that's on my other tv", "verified": true, "helpfulness": "0/0", "author": "SWH"}, {"rating": 5.0, "review": "Makes any TV a SMART TV... very nice product for very little money - extremely easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Donna M Iacoviello"}, {"rating": 1.0, "review": "This products gets super hot and runs apps really slow when compared to other devices that run apps.", "verified": true, "helpfulness": "0/0", "author": "brown3009"}, {"rating": 5.0, "review": "LOVE, LOVE, LOVE the Amazon Fire Stick!!!  ALL of your data can be viewed on your TV - awesome!  And it's half the price of Apple TV (which we bought for my in-laws for Christmas).", "verified": true, "helpfulness": "0/0", "author": "Vicki B."}, {"rating": 2.0, "review": "I'm from Paraguay and I bought  the Fire TV Stick, I'm a little disappointed because many apps (such as movies (amazon app), etc.) are disabled for access  from Paraguay", "verified": true, "helpfulness": "0/0", "author": "Oscar"}]