[{"rating": 5.0, "review": "Pretty awesome. Love my fire tv stick. It worked as expected. I just wish there was an app for a search engine like Google.", "verified": true, "helpfulness": "0/1", "author": "BREY W"}, {"rating": 5.0, "review": "I love my new amazon fire tv stick! i can't wait to get an amazon prime subscription so I can watch some of the free episodes and movies that they offer. I love to stream and  I love this little usb drive because it doesn't have to have so many wires and cords plugged all the time. I also like it because I can take it with me. Especially if I am waiting at the hospital is nice...", "verified": true, "helpfulness": "0/1", "author": "jennifer bales"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/1", "author": "StephanieT"}, {"rating": 4.0, "review": "Great midrange product, remote that comes with the unit is terrible, recommend ordering the replacement, though more expensive voice remote.", "verified": true, "helpfulness": "0/1", "author": "James P RePass"}, {"rating": 5.0, "review": "Amazing product - L - O - V - E it.  Good call Amazon.", "verified": true, "helpfulness": "0/1", "author": "nwpioneer"}, {"rating": 5.0, "review": "This has been great for playing Netflix or Amazon Prime videos on TV.  That's all I use it for, and it hasn't let me down.  I had Google Chromecast, and it never worked well for me.", "verified": true, "helpfulness": "0/1", "author": "BarryG"}, {"rating": 3.0, "review": "Works great, but many shows/movies do not show full-screen on my tv.  So it takes my 29\" tv and provides a 24\" screen.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's perfect for if you don't have a smart tv to go on Netflix and stuff like that and also if you jailbreak it you can watch hd movies free like new ones that just came out and this is so much better than an Apple TV it's the same thing but the size of a flash drive it's perfect for movie nights at people's houses and it's a fair price too 😃", "verified": false, "helpfulness": "0/1", "author": "Tom"}, {"rating": 4.0, "review": "The best streaming stick hardware out there... but Plex for FireTV is lacking, not because Plex is lacking, but the FireTV is lacking codecs", "verified": true, "helpfulness": "0/1", "author": "J. S. Monkey"}, {"rating": 5.0, "review": "Incredibly easy to install and use.  Great portability and fast streaming.  I'd like to have the capability to play local content on USB flash drives or USB portable hard drives via a USB port of the Fire TV Stick.  Hopefully, that feature will be added in the near future.", "verified": true, "helpfulness": "0/1", "author": "Jeffrey A. Loos"}]