[{"rating": 5.0, "review": "Works GREAT!!! I absolutely LOVE mine. I was using my laptop connected to my tv and my mouse to watch netflix. Now I just use a remote control like a person is suppose to when they're watching TV. Works so well & I LOVED IT so much I bought a second one for my bedroom!", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": ",!!!!  I love,  !!!  I love", "verified": true, "helpfulness": "0/0", "author": "domingo"}, {"rating": 1.0, "review": "Very poor. Connectivity issues and it it very slow when it does connect.", "verified": true, "helpfulness": "1/1", "author": "Eric"}, {"rating": 1.0, "review": "Couldn't get it to work out of the box. I was with customer support for an hour or so. Finally got it to work, but doesn't work anymore. Says that it's not connected to the interent and when I go into settings, it says that I am. Piece of crap. Good thing that I only paid $20 for this garbage.", "verified": true, "helpfulness": "0/1", "author": "Jacque Michael"}, {"rating": 5.0, "review": "This is fabulous! Having a movie marathon weekend of whatever we want to watch...ordering more for the rest of the house so I don't have to move them.", "verified": true, "helpfulness": "0/0", "author": "Eleanor Triolo"}, {"rating": 5.0, "review": "This works great.  I was able to hook it up quickly and start watching movies.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Maureen P. Monahan \"maureen\""}, {"rating": 5.0, "review": "I was skeptical at first but for $34 I thought I would give it a ry.  I am actually amazed on how well it works, the streaming has been without a flaw, downloads are quick and viewing is seamless.  Great viewing choices, makes this areal bargain, and absolutely great compliment to AT&T; Uverse subscription,", "verified": true, "helpfulness": "0/0", "author": "James T Thannum"}, {"rating": 1.0, "review": "Power adapter broke", "verified": true, "helpfulness": "0/0", "author": "Linda Ellen"}, {"rating": 5.0, "review": "Great devic for streaming", "verified": true, "helpfulness": "0/0", "author": "phyllis tarallo"}, {"rating": 1.0, "review": "Doesn't work well for me. It keeps dropping the wi fi every few seconds. Also the stick gets very hot. I'm not impressed with it. I'll probably try the Google chromecast like my kids recommended.", "verified": true, "helpfulness": "0/0", "author": "cherylemf"}]