[{"rating": 5.0, "review": "The Fire TV Stick is very easy to install--just plug it into the HDMI port of your TV & the included adapter( via the included usb cable) into the wall socket next to your TV. You then view a short tutorial on how to use the Fire Stick & then start watching the shows you want. If you're a Prime member, you have tons of movies & TV shows that you can stream for free (listed under the Prime Video tab). If not, you can pay a nominal fee to watch them. The Home tab lists recently used apps & movies and TV shows you've watched. The tab after that lists recommendations for movies & TV shows based on what you've watched. You can also listen to all of the music you've bought from Amazon (under the Music tab) as it (along w/anything else you buy from Amazon) is stored in the cloud. I'm not a gamer, but I understand you can also play games with this, and use several apps. The Fire Stick has been fast in streaming movies, with one exception. I was recently watching a movie that continually buffered. Right from the Fire TV Stick there was a means of asking an Amazon rep to contact me. Seconds after entering my cell phone number, a very courteous, helpful Amazon rep called & walked me though a \"hard re-start\" of my Amazon Fire TV stick. Afterwards, buffering wasn't an issue. (And, this wasn't a long process.) I couldn't believe how fast Amazon contacted me & how helpful the rep was!! I only wish more companies had such great customer service!! For the price, the Fire TV stick is a terrific deal, and being a Prime customer gives you even \"more bang for your buck!\" I'm so happy with mine, that I recently bought one for my son.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The voice recognition software in the Fire TV works better than Siri on my iPhone 6.I love my Apple TV, but this out performs it hands down.  Even the Fire TV Stick I purchased for my daughter makes the Roku and the Chromecast look bad!I understand now why they both keep selling out on Amazon. Get yourself one and you won't regret spending the money.", "verified": true, "helpfulness": "0/0", "author": "Smith R. Poston II"}, {"rating": 5.0, "review": "Absolutely love this stick. It's fast and easy to operate. I don't know how I ever lived without it. Totally worth more than I paid for it.", "verified": true, "helpfulness": "0/0", "author": "Nya S."}, {"rating": 5.0, "review": "Awesome piece of equipment.  No need for a smart TV as this connects to the HDMI input and streams through your wifi. Love it", "verified": true, "helpfulness": "0/0", "author": "Tim say 22"}, {"rating": 5.0, "review": "It works very well. My son loves it.", "verified": true, "helpfulness": "0/0", "author": "S. Scott \"HH\""}, {"rating": 5.0, "review": "Love it.  We use it at home and on trips.  A great little device!", "verified": true, "helpfulness": "0/0", "author": "Donna Davis"}, {"rating": 5.0, "review": "Love this gadget!  Easy to use, friendly, and plenty of great movies, shows, etc.  Definitely recommend purchasing it.", "verified": true, "helpfulness": "0/0", "author": "Maria R."}, {"rating": 5.0, "review": "A cool little item. Easy to use. I recommend it for Prime users.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey A. Johnson"}, {"rating": 3.0, "review": "I've had Fire TV Stick for about 2 months or so. Generally, I'm very pleased with it. I have Prime so there is a good amount of viewing byway of that. The TV used with Fire Stick is in our downstairs basement rec room. Recently, I've been getting a lot messages on Fire Stick saying there is a problem with connection to wi-fi etc. It's rather annoying and have to fiddle with things. Disconnect Fire Stick reconnect or just keep going back to content as I go through process of scanning network etc. Probably, if I was closer to router (is located on main floor of our home) I wouldn't be having problem. As a side note, I have a Kindle Fire tablet that I alway keep in the downstairs rec room to use when I'm on my treadmill etc. I don't really have any problems with wi-fi connection with tablet. So, I'm thinking probably the Fire TV (not the stick) is better able to maintain wi-fi. But for $39 for Stick I'm fairly happy.Adding to this review a month or so later ... this is more about Prime selection and Fire Stick ... when I use my Macbook to view Prime selection of movies and TV shows there are many more selections (44,000 is what I believe is indicated) than shown when I'm looking via Fire Stick for something to watch ... so I guess the deal is I'll use my laptop to add selections to my watch list and see if that works better. But would rather see same amount of selections when I use Fire Stick.  And, I still have connection issues as stated above ... pretty much every time I try to use Fire Stick. For that reason, I'm less likely to use it. Just don't want the hassle of unplugging rebooting etc. Again, I'm only complaining mildly because of the relatively low price.", "verified": true, "helpfulness": "0/0", "author": "mkobrien3"}, {"rating": 5.0, "review": "Works exactly as described.  No problem setting up with wireless router and establishing account.  Streams media well without interruption.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]