[{"rating": 3.0, "review": "This is the second fire stick I've had, as the first stopped working and Amazon replaced it. Now this one can't connect to my wifi, although it had been working perfectly. I called Amazon and it worked again after I unplugged it and plugged it back in.", "verified": true, "helpfulness": "0/0", "author": "Quantum Natalie"}, {"rating": 4.0, "review": "I like the idea behind Fire TV Stick better than the actual product. I wasted hours troubleshooting. Sometimes even the support people could not help me. Sometimes the cable company and Amazon support threw the ball at each others and I was on my own dealing with delays and settings and unable to load video when the connection was supposedly very good.", "verified": true, "helpfulness": "0/0", "author": "Jenny"}, {"rating": 5.0, "review": "Works great, easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Mrs. Warren E. Reed"}, {"rating": 5.0, "review": "I love this. Really good selection of apps and games. The UI is easy to use.", "verified": true, "helpfulness": "0/0", "author": "S.Munoz"}, {"rating": 1.0, "review": "This product does not work.  It will not show videos streaming on my iPad or laptop on the video screen.  All I get is a few pixels and no audio.  Somewhere in the documentation it says \"experimental,\" which means they aren't sure if it will work or not.  It will not hold an internet connection.  It will show that I am connected, then when I play it says not connected.  This is worthless.  Either send me a new one that works, or give me my money back.  My wife bought the apple device and it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Steve Earley"}, {"rating": 5.0, "review": "was a gift my Daughter loves this.", "verified": true, "helpfulness": "0/1", "author": "George"}, {"rating": 5.0, "review": "So easy to set up......plug in and follow onscreen prompts.....took me 2 mins and response with remote fast and better then blu ray response. I love it", "verified": true, "helpfulness": "0/0", "author": "Katie burris"}, {"rating": 5.0, "review": "So far I love it. I have a Chromecast, Roku, and PlayStation 3 and the Fire is my favorite. There needs to be more apps like ABC, NBC, FOX and CBS.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up only took a few minutes! Love it", "verified": true, "helpfulness": "0/0", "author": "Jessica Davenport"}, {"rating": 5.0, "review": "AWESOME MEDIA DEVICE. I LOVE THE PORTABILITY AND FUNCTION OF IT", "verified": true, "helpfulness": "0/0", "author": "Terrance Wilson"}]