[{"rating": 5.0, "review": "awesome! keep it in my sons room so he can watch his favorite you tube videos- love that its portable.", "verified": true, "helpfulness": "0/0", "author": "kristen thress"}, {"rating": 5.0, "review": "it's a marvel.  so easy to install, and to use.  was having a lot of problems with connections to Netflix with my Blu-Ray, but this is amazing. A great product, very reasonable priced.", "verified": true, "helpfulness": "0/0", "author": "Mary Cilia"}, {"rating": 2.0, "review": "The idea is nice, but it's simply not powerful enough to do what they are trying to accomplish. I have consistent issues with performance -- HD video will hiccup, stuttering when changing screens, etc. Problem I just don't have with my Chromecast - admittedly they are very different devices, but I prefer it. If you really want a Amazon TV, buy the full Fire TV not just the stick, it just isn't good enough.", "verified": true, "helpfulness": "0/0", "author": "Peckles"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jeff L Hunter"}, {"rating": 5.0, "review": "Great Product!!!", "verified": true, "helpfulness": "0/0", "author": "Balamurugan Muthiah"}, {"rating": 3.0, "review": "The ads indicate access to many movies at no additional charge.  We have found even very old movies, including children movies, have a charge to view.  Very disappointed - Net Flix offers more movies with no charge.", "verified": true, "helpfulness": "1/1", "author": "Joanshaw"}, {"rating": 5.0, "review": "Wanted something to turn my dumb tv into HAL. This came very close.", "verified": true, "helpfulness": "0/0", "author": "kj"}, {"rating": 5.0, "review": "Love, love, love!!! Would definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Angela \"Angela M Brandon\""}, {"rating": 1.0, "review": "Wasn't able to get any of the channels I thought I was going to get.  I needed to already have some kind of cable tv or satellite, just having my internet didn't get me anything.  I was hoping that was the whole point of this thing.  Returning it.", "verified": true, "helpfulness": "2/3", "author": "Jean Landry"}, {"rating": 5.0, "review": "I'll be honest, I had no idea what the Fire Stick was before I bought it. I was simply looking for something that let me stream my new Kindle to the TV like my first generation Kindle could- with a mini USB to HDMI. I had no idea the Stick would replace that, (I am in my 20's and not tech savvy at all). The FireStick is amazing! I use it almost daily to listen to Pandora or watch Netflix and HBOGo and it still gives me full use of my Kindle at the same time. I would have paid double for the ease and convenience, it is another great Amazon product.", "verified": true, "helpfulness": "1/1", "author": "Sarah Gorman"}]