[{"rating": 5.0, "review": "All I can say is wow!  This thing is fantastic.  I have the Amazon Fire TV (bigger version) - the microphone on that unit is great and a killer feature, but if you can get this for under $40 picking this one up is really a no brainer.  I don't game so I'm not sure if it chokes on games, everything else is zippy on the Fire TV Stick.  The initial setup sort of stunk though, you plug it in and it has to do some sort of update, it took forever and I wasn't sure if the update was working.  I walked away and came back an hour later and it completed doing the update.  I'm not going to remove a star for a hour long update, just prepare yourself if you run into the same issue.", "verified": true, "helpfulness": "0/0", "author": "zbooks"}, {"rating": 5.0, "review": "I have a Fire TV system and the stick does it all without the box! I bought 2 so all 3 TVs have access to Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Matt T."}, {"rating": 1.0, "review": "We have tried this device on 3 televisions so far and it doesn't work - it appears to work fine but then we get an error message and a blue screen and you can hear the show but no picture.  There is a message that appears that it is unable to download- we spent over an hour on the phone Saturday trying to troubleshoot the problem and we were told it was because our television was too old but my son took it back to college and tried on a newer television and it still does not work.  I am returning it for my money back.  Very disappointed because it seemed like it would be great and better than the chromecast we bought last year.  So frustrated.", "verified": true, "helpfulness": "1/2", "author": "Mary K. Megyeri"}, {"rating": 4.0, "review": "Faster than Roku Stick, but with an almost identical interface (once you get past the top level menu). Definitely loads videos faster and video quality is excellent.Missing Acorn TV in their library. Finding apps is not as easy as on the Roku.", "verified": true, "helpfulness": "0/0", "author": "Dee N \"tonipaw\""}, {"rating": 5.0, "review": "Great little device.  Easy installation and navigation of apps, zippy interface.  Remote feels cheap but some of that is due to how lightweight it is.  I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Suzette D."}, {"rating": 3.0, "review": "The NBA Gametime App is not working at all.  The UI is based on the Webrowser view not a custom native application UI that would be in a Setbox like Apple TV or ROKU.  Essentially I am unable to access the application at all", "verified": true, "helpfulness": "0/0", "author": "Jonathan Tran"}, {"rating": 5.0, "review": "Great device for watching Prime Instant Video and Hulu. It's small and doesn't need a shelf to sit on. Super compact and convenient. Plugs into the HDMI for great quality.", "verified": true, "helpfulness": "0/0", "author": "Sgutz"}, {"rating": 5.0, "review": "This is the best media device I have ever purchased.  It works great for streaming services and I have also sideloaded XBMC to play movies from my NAS.  Amazon nailed it this time.", "verified": true, "helpfulness": "0/0", "author": "mr_malina"}, {"rating": 5.0, "review": "I love the fire stick. Got it for $19. What a deal. Works great. It loads the shows much quicker than my apple TV and my Chrome stick.", "verified": true, "helpfulness": "0/0", "author": "pguttery"}, {"rating": 1.0, "review": "will not find a network//waiting for replacement:(", "verified": true, "helpfulness": "1/1", "author": "maggie chicoine"}]