[{"rating": 5.0, "review": "Really easy to install.  Relatively easy to find what I want to watch!", "verified": true, "helpfulness": "0/0", "author": "Janel G."}, {"rating": 4.0, "review": "I purchased this due to the apps that it had.  I do not have a smart TV.  I was impressed right after the install.  The device was programmed with my account information and jumped right into a tutorial when it booted up.The only effort I had was signing into my Netflix account.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As a Prime member it seemed a shame to 'waste' the Prime video component that comes with the Prime membership. I chose the Stick over the more expensive console Fire TV strictly as a matter of cost, and I have not been disappointed. I literally plugged it into my HDTV and in the time it took to change input lines on the remote, the Fire Stick was up and running. Video and audio quality are excellent (as is the system its hooked into). With lots of free content from Amazon, its already paid for itself in saved purchasing costs. Getting this is a no-brainer.", "verified": true, "helpfulness": "0/0", "author": "BearPup"}, {"rating": 5.0, "review": "A couple of months and I am happy with the Fire TV stick. There are a ton of apps and games. Most apps work great. I have an occasional problem with Sling TV but 95% of the time it functions properly.Apps that I've downloaded and watch regularly: Netflix, HuluPlus, Amazon Prime TV and Movies, Twitch.TV (cool!), IGNSetup was a breeze. It took me about 5 minutes.  My reason for buying the Fire TV stick was price, app availability (Some competitors are missing Apps that I want), and portability (you can move it to different rooms in the house if you want to. It's also impressive that there is 8GB of storage and a fast processor on this device. Space is good for downloading apps and games. Processor speed is good for switching and loading apps. The remote is pretty simple but simple is sometimes better. I am pleased so far!", "verified": true, "helpfulness": "0/0", "author": "Amazing Ethan"}, {"rating": 5.0, "review": "Amazon Fire TV is the greatest thing since sliced bread.  I am a tech savvy kind of guy and this is the most used device I have.  Amazon Fire HDX tablets wireless screen mirroring is swwweeeeet!  Love gaming with the Amazon game controller too!  Amazing bang for your bucks.  I don't know what I would do without my Fire TV.  I use it every single day.", "verified": true, "helpfulness": "0/0", "author": "dynamicdivinedude"}, {"rating": 5.0, "review": "Love this product!", "verified": true, "helpfulness": "0/0", "author": "Lee Martinez"}, {"rating": 5.0, "review": "Yes, love it", "verified": true, "helpfulness": "0/0", "author": "mary wanda perry"}, {"rating": 5.0, "review": "Very easy to install.  Took less than 5 minutes. The speed is very fast. I love the cell phone app with the voice search. Makes finding a movie faster and easier than typing the name.  Don't delay ... and purchase it!", "verified": true, "helpfulness": "0/0", "author": "TW"}, {"rating": 1.0, "review": "Tv stick the fire must have been pre-registered when send it to me as happened to other customers who acquired and are outside the United States and it is not .... I lost my money AMAZON neglect.", "verified": true, "helpfulness": "0/0", "author": "Reniel Cabrera"}, {"rating": 5.0, "review": "I'm a fan. So much so we are dropping Direct TV when our contract expires and using Amazon exclusively.", "verified": true, "helpfulness": "0/0", "author": "Bonita S."}]