[{"rating": 5.0, "review": "Easy to connect and use...even for the tech-challenged.", "verified": true, "helpfulness": "0/0", "author": "Donna Maness"}, {"rating": 5.0, "review": "yes... it was so easy to hook up to my TV and use ...It couldnot be any simpler...", "verified": true, "helpfulness": "0/0", "author": "barbxcats"}, {"rating": 5.0, "review": "I was skeptical of this at first, but decided to purchase when there was a good sale going on.  Once received, I hooked it up (which was very easy) and got everything setup.  I love this product and use it all the time.", "verified": true, "helpfulness": "0/0", "author": "Todd Thompson"}, {"rating": 5.0, "review": "Easy to set up.  So far enjoying the movies", "verified": true, "helpfulness": "0/0", "author": "kristy"}, {"rating": 5.0, "review": "It's been a really great thing to have!!", "verified": true, "helpfulness": "0/0", "author": "Kyle balding"}, {"rating": 1.0, "review": "U still have to pay for HBO, Netflix, Hulu? or does it come free with this product", "verified": false, "helpfulness": "0/0", "author": "John Dewitt"}, {"rating": 5.0, "review": "It the best !!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Paul Z."}, {"rating": 5.0, "review": "Set it up at home first.  Download the latest software. We like the Menu system better than Roku 2 that we had.Hotel Experience: FIRST, we set it up at home, then we updated the software from home. Only after the update will it allow you to use it at a hotel.  At the hotel, at first it didn't work. After re-seating the 120V plug and plugging back into the physical HDMI 1 port on the hotel TV, the hotel TV menu finally came up as it recognized a new device. We selected INPUT, then HDMI1 using the *TV remote* (not the Fire TV remote.) For a few seconds it said something like it could not contact it's servers. Don't exactly know what that meant, but 2 seconds later it flipped to the hotel login screen that you normally see on your laptop. We used the Fire TV remote to login using the on screen \"keyboard\" and the hotel login information that they gave us at the front desk. Viola! it worked beautifully as we got a Fire TV splash screen and then the menu we saw at home came up. Everything was as we experienced it from home from that point.", "verified": false, "helpfulness": "0/0", "author": "a0188279 \"Engineering Mom\""}, {"rating": 5.0, "review": "Easy to use. I have the Apple TV but it doesn't support Amazon Prime so I purchased this stick, affordable, easy to use and perfect for our family.", "verified": true, "helpfulness": "0/0", "author": "Samm"}, {"rating": 5.0, "review": "Worked like a charm!", "verified": true, "helpfulness": "0/0", "author": "Mark Morris"}]