[{"rating": 1.0, "review": "I have the fire stick at first it started off working really good but now its not working I thought it was my wifi but my wifi is working on my laptop and kindle fire but its the fire stick I give it a half star", "verified": true, "helpfulness": "0/0", "author": "octavia latimore"}, {"rating": 5.0, "review": "Great product,  not as many choices as on Roku  but the ease of navigation and layout is much better.  Like most things amazon,  it will only improve.  Better long term choice.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great and the family is really enjoying it.  My seven year old grandson has no problem operating.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Purchased for my bedroom tv. Worked great, very easy set up. I have taken it on vacation.", "verified": true, "helpfulness": "0/0", "author": "tede60 \"tede60\""}, {"rating": 5.0, "review": "I really like the Fire TV stick, pretty fast and has most of the apps we used with the Roku. The only problem we have is it seems to \"crash\" or restart every once and a while. Definitely worth the money!", "verified": true, "helpfulness": "0/0", "author": "Alan Poole"}, {"rating": 4.0, "review": "Good product. I was hoping for a little more variety of shows.", "verified": true, "helpfulness": "0/0", "author": "Allison Garcia"}, {"rating": 5.0, "review": "works great and easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Renee Gordon"}, {"rating": 1.0, "review": "I returned the Fire Stick to the store and replaced it with a Roku stick. The Fire stick plug made a poor,  loose connection with the TV. Only by delicate repositioning at each attempt to use it, was I able to register the device and watch one show (Netflix), one time. Although present in the list of contents, there was no HDMI extender in the box. I think the extender would have helped.  The power cable, hanging off the top, tended to tilt and disconnect the fire stick. When I tried to exchange the Fire Stick, Best Buy was temporarily out them. I would have had to upgrade to Fire TV. I opted instead to return the Fire Stick and purchase a Roku stick. The Roku stick made and has continued to make a much better connection with the TV.", "verified": true, "helpfulness": "0/0", "author": "Horatio S. Wildman"}, {"rating": 5.0, "review": "It quck, I use the Android app and if you have amazon prime or one of the other streaming services you can't go wrong. As a prime member I got in at the discount price of around 19.00 dollars. It now twice that but still worth it. I do wish we prime members could buy again for the 19 then I would use it on the TV in the Treadmill room.", "verified": true, "helpfulness": "0/0", "author": "J. Lynch"}, {"rating": 5.0, "review": "It does everything I expected it to do and more! It has Netflix and Amazon Prime Video and Music, which are the apps I use the most but I only wish they had Vudu as well.The gaming is also a plus for this tiny but incredible device! I also bought the Amazon Fire Stick controller to play games on and my kids love it!For the price and the size, absolutely worth it!", "verified": true, "helpfulness": "0/0", "author": "Flipdawg"}]