[{"rating": 1.0, "review": "When trying to access movies or anything other title using fire stick, I get \"currently unavailable\".If this continues, you can expect a fast return.", "verified": true, "helpfulness": "0/1", "author": "JACK GARNER"}, {"rating": 5.0, "review": "Amazing product -SO EASY to use ... Start up took under 10 minutes - service is fantastic - no hiccups at ALL so far ... AmaZon prime selection is great for TV and movies , also runs Netflix and YouTube app with no troubles at all ... AMAZING ! LOVE renting movies on Amazon prime - same day as theater Oprion on some movies is GREAT - and cheaper than our cable \"On Demand \" rentals ...", "verified": true, "helpfulness": "0/0", "author": "Pookie \"Love\""}, {"rating": 5.0, "review": "Great product with a great price for the availability of programming options. Easy to set up and works very dependably so far. Very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Steve Ellis"}, {"rating": 5.0, "review": "Just what I wanted.  Works great.  Super easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like it fine but I would like it even more if ABC and CBS apps were on it...", "verified": true, "helpfulness": "0/0", "author": "Kelsi Lancaster"}, {"rating": 5.0, "review": "It's the best devise ever.", "verified": true, "helpfulness": "0/0", "author": "Bonnia"}, {"rating": 1.0, "review": "I hate it. It is useless. Haven't been able to view anything with since I got it. What a rip off.", "verified": true, "helpfulness": "1/4", "author": "JUDY MEYERS"}, {"rating": 5.0, "review": "Even though I am technically challenged, it was easy to set up. My only problem was getting the remote open to install the batteries. My son had to open it for me and he had a difficult time. It was designed badly.I am really enjoying the many things I can get with my Fire Stick. It's a sinner.", "verified": false, "helpfulness": "0/0", "author": "Amy Janikas"}, {"rating": 5.0, "review": "This thing is awesome! Just wish it had HBO Go app", "verified": true, "helpfulness": "0/0", "author": "Matthew S. Simpson \"Simpson\""}, {"rating": 1.0, "review": "It kept turning off. I could not see the movie I ordered. I don't want to be charged the $2.99", "verified": true, "helpfulness": "0/1", "author": "kenanwie"}]