[{"rating": 1.0, "review": "you cant open back of remote to insert batteries. Go to web, Google- insert batteries into Fire Stick- and read how people feel. Amazon should recall product. Bezos should run his business rather than newspapers.", "verified": true, "helpfulness": "0/1", "author": "Philip Guthoff"}, {"rating": 4.0, "review": "Great value, easy to set up and navigate, compares very favorably to others I have used (Apple TV, Roku, Chromecast).  Docking it one star for the terribly designed remote- you shouldn't have to search the internet and cut yourself on an xacto knife to get the batteries in!!", "verified": true, "helpfulness": "0/0", "author": "nyshoelover"}, {"rating": 1.0, "review": "This device is so frustrating!  Too many problems with it keeping connected or pausing during streaming and it always happens at the most inopportune time.  I have a high end performance wireless router so that is not the problem.  My IPad never has any issues using the same wireless router.  I finally pulled the Fire Stick and went back to using a Wii game controller and it never loses connections.  I waited too long fiddling with the Fire Stick and can’t return it.  I wasted $39 on the Fire Stick and caused myself a lot of frustration.  Do not recommend this streaming device.", "verified": true, "helpfulness": "0/1", "author": "kevin kaiser"}, {"rating": 5.0, "review": "Love how it saves your favorite shows and knows right where you left off watching them. Also enjoy the extra features like Pandora and the radio stations since we live in an area where it is hard to get good reception.", "verified": true, "helpfulness": "0/0", "author": "Shellane Chandler"}, {"rating": 5.0, "review": "The stick works well.  I have not had any trouble with it needing to stop and reload any shows or movies that I have watched....I have another streamer that does not work as well at all stops every 15 minutes during a movie to reload.", "verified": true, "helpfulness": "0/0", "author": "Georgia"}, {"rating": 5.0, "review": "Easy to install and very versatile!", "verified": true, "helpfulness": "0/0", "author": "Amber L. Cabrera"}, {"rating": 4.0, "review": "Very easy to use. Only issue is that the USB for power isn't always able to be plugged in - not enough power for the Fire stick. So the regular cord has to be used at times.", "verified": true, "helpfulness": "0/0", "author": "Beth R."}, {"rating": 1.0, "review": "I needed the closed captioning I got on HBO and showtime. I also liked being able to browse on my iPad and projecting the program on TV. I'm not able to do this with fire stick. Can someone tell me if this is even possible with fire stick ?", "verified": true, "helpfulness": "0/0", "author": "hendrik smit"}, {"rating": 5.0, "review": "Works great!  Love the free TV series & movies.", "verified": true, "helpfulness": "0/0", "author": "Stephen Goettler"}, {"rating": 5.0, "review": "Couldn't be any easier to set up or operate!", "verified": true, "helpfulness": "0/0", "author": "Sue Johnson"}]