[{"rating": 3.0, "review": "I bought the box version of this when it first came out and we've had NO issues with it.  We love this option because we got rid of cable (best decision we ever made).  We got the Fire Stick for free when we signed up for Sling for a few months and we have a lot of issues with it.  I have to reset our Wi-Fi password at least once a week because it looses connection, and HULU constantly freezes up.  We don't have any of these issues with the box.  I would suggest going with the box and skipping the stick until they can work out some kinks.", "verified": true, "helpfulness": "1/1", "author": "Jody M. Taylor"}, {"rating": 5.0, "review": "I am not getting much done since I got my firestick!!! Love it!! Came the next day....couldn't ask for better service!!!", "verified": true, "helpfulness": "0/0", "author": "Kate Burke"}, {"rating": 5.0, "review": "LOVE It!!!!!", "verified": true, "helpfulness": "0/0", "author": "Pamkayks"}, {"rating": 5.0, "review": "Works great with my Viewsonic 3D HD projector.  I needed a way to wirelessly cast my laptop screen to my projector.  Using windows 8 and the Firestick, it was easly.", "verified": true, "helpfulness": "0/0", "author": "abassham"}, {"rating": 5.0, "review": "It works very  well.", "verified": true, "helpfulness": "0/0", "author": "Arthur M Jenkins"}, {"rating": 5.0, "review": "Great for my outdoor TV and the the speed is great/responsive. I use it to connect to my media center to watch live TV and movies in my library. Netflix and Amazon Prime makes this a must have if you do not have a smart TV.Very easy to install and use. Also built for the techie/power user who would like to sideload other apps for a more robust experience.", "verified": true, "helpfulness": "0/0", "author": "notap"}, {"rating": 3.0, "review": "I've ha problem after problem with these sticks. I originally bought it for $20 on pre-sale. That ones remote stopped working, so they sent me a new unit. This ones remote works but the screen is constantly freezing, and then the screen plays really fast. Other times the sound will go out. I do not have these problems playing Amazon from the TV app, or the Wii, so I am certain the issue is with the stick itself.Save your time and money and buy a different product, of a better quality. Unfortunately these are getting back-ordered regularly so they are manufacturing them so fast they lack a serious level of quality.", "verified": true, "helpfulness": "0/0", "author": "J. Roos \"JRoos\""}, {"rating": 5.0, "review": "Easy to hook up...easy to use", "verified": true, "helpfulness": "0/0", "author": "Josie"}, {"rating": 5.0, "review": "I was intrigued by its possibility. It didn't disappoint. Easy setup and enjoying the selection of shows to watch. There is a good selection with Prime, which will give us many hours of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Webmaker"}, {"rating": 5.0, "review": "The best purchase our family has made. Works exactly as promised with no issues. Highly recommend this especially for saving money if you are canceling your cable and streaming your shows!", "verified": true, "helpfulness": "0/0", "author": "Maye"}]