[{"rating": 5.0, "review": "maybe the best money I've ever spent on Amazon!", "verified": true, "helpfulness": "0/0", "author": "Former Pilotj"}, {"rating": 5.0, "review": "Awesome product! I travel for work and it's great to be able to bring with and plug into hotel tv's for immediate access. Haven't had an issues with it in almost a year!", "verified": true, "helpfulness": "0/0", "author": "Steve C."}, {"rating": 2.0, "review": "I have my entire home set up with Fire TV products and the box is an absolute 5 star product worth much more than the $100 price point.  I thought for the playroom and my 4 year old twin sons' bedroom the stick would be a better option.  They are familiar with the remote, the unit is hidden behind the TV in the HDMI port and I don't need as much storage as their programming is much more limited that the other TVs.  In all we have a total of five Fire TV units....originally 3 sticks and 2 boxes.....we are now at 4 boxes and one stick.  The one stick we still have has its share of issues dropping wifi signal, under performance and freezing but for the playroom we're making due for now.  The stick we originally had in our master bedroom and in our twins room were problems from the word go.  The unit in the kids room took (and this is no exaggeration) 26 attempts just to run the initial set up.....this was a lot of fun with two four year olds watching me attempt the set up.  I have a very high capacity internet service and other products such as my Fire TV box, Kindles, smart TVs, etc.... were working with no issues what so ever as have the boxes I replaced the sticks with.  I assumed we may have just received two glitchy ones so i exchanged them for two other units and had the exact same issues before returning them outright.  As always Amazon customer care was awesome through the process and I am very pleased with our current collection of four boxes and one stick that usually works.  I have read many similar issues with the stick product and it certainly seems to be the trend.  So as I said in the title.....if you are able, drop the extra $60 and invest in the box and save yourself the frustration.", "verified": true, "helpfulness": "0/0", "author": "J. Milbrandt"}, {"rating": 5.0, "review": "I love the fire stick! We have a Apple TV, in another room, bought this because of its cheaper price, and I love the features and how it's set up much better. I recommend this!", "verified": true, "helpfulness": "0/0", "author": "Christopher shaw"}, {"rating": 5.0, "review": "Very easy to use. Love it!", "verified": true, "helpfulness": "0/0", "author": "Litebrown"}, {"rating": 5.0, "review": "My kids especially love watching their shows without interruption!!  I love that I can use my existing apps on the TV using my fire TV stick and not a computer.  This is my second one for my house, but I am sure it won't be my last.  Cable TV is history in my house!!", "verified": true, "helpfulness": "0/0", "author": "Monique Weeden"}, {"rating": 5.0, "review": "it is wonderful, we really enjoy it very much. easy to use.", "verified": true, "helpfulness": "0/0", "author": "josefine hepp"}, {"rating": 1.0, "review": "wasnt great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Extremely portable, much more responsive than my smart tv apps.  1 star taken away for the occasional lag, still wouldn't hesitate to buy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Have had the Fire TV Stick for less than a month...so far, so good!", "verified": true, "helpfulness": "0/0", "author": "Julie A."}]