[{"rating": 5.0, "review": "Kids enjoyed watch old movies!", "verified": true, "helpfulness": "0/0", "author": "christine"}, {"rating": 4.0, "review": "Installed easy - online instructions difficult to follow for all features. Still it performs well and when you learn all it's features should be valuable addition to your video enjoyment.", "verified": true, "helpfulness": "0/0", "author": "GPR"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "slmn"}, {"rating": 4.0, "review": "Love it just wish it had HBO go and I wish you could connect to direct TV with showtime anytime !", "verified": true, "helpfulness": "0/0", "author": "jordyn cogdill"}, {"rating": 2.0, "review": "I never got this device to play because apparently it requires your TV meet an HDMI specification which wasn't clearly described in the product. After attempting all the solutions in the help forums, I returned it.I also don't like how the product can't be turned off and is yet another electricity \"vampire.\"Finally, I ordered this thing in November and it went into backorder until late December. Clearly Amazon was rushing something to market that was only half-baked.", "verified": true, "helpfulness": "1/1", "author": "Gene Koo"}, {"rating": 5.0, "review": "I love the firestick!  All the great apps in just one lil gadget!  And it comes with a remote so you don't have to try to connect your phone.  Best gift ever!  Thanks mom :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Outstanding performance.Other reviews have gone into great detail about this gadget  I'll focus on a couple of things.My home theater is part of a larger stereo system.  This plugs into the preamp and works absolutely fine as a source device.  I wasn't sure if it would come up properly, but it's been as solid as plugging it directly into a TV would have been.I was further impressed when I began using it.  The theater room doesn't have an ideal WiFi connection, however the Fire Stick is able to immediately start streaming shows with HD far faster than my PC or iOS devices can do it.  It's really something to see.The menus are intelligently laid out and everything just works.", "verified": true, "helpfulness": "0/0", "author": "J. M. Grant"}, {"rating": 5.0, "review": "Great product!  We really love it as it is so easy to use!", "verified": true, "helpfulness": "0/0", "author": "sadams"}, {"rating": 3.0, "review": "It works great and fast but cannot use it here in Dominican Republic.Any suggestions?????", "verified": true, "helpfulness": "0/0", "author": "Oscar"}, {"rating": 5.0, "review": "This is amazing, especially if you already love using Amazon Prime. The only complaint I have is the parental control settings force you to enter your pin each and every time you use the stick. I wish there was some way to be more specific, like block adult content or rated R and above, use allow prime or free content to be viewed/played without entering the pin each time.", "verified": true, "helpfulness": "1/1", "author": "stabs"}]