[{"rating": 4.0, "review": "Easy to set up and use. Great purchase when I don't have cable!", "verified": true, "helpfulness": "0/0", "author": "Carrie McLain"}, {"rating": 1.0, "review": "Freezes at 25% buffering all the time. Have to unplug from the wall for a couple minutes,  plug it back in, then start all over.Should have got Hulu", "verified": true, "helpfulness": "0/1", "author": "Travis"}, {"rating": 5.0, "review": "Love it. Amazing, much better pic than I would have thought", "verified": true, "helpfulness": "0/0", "author": "Ms. April"}, {"rating": 5.0, "review": "I waited until they added HBO Go to get this.  I wish I hadn't waited!  I LOVE this.  I tried the Google Chromecast first and it was a nightmare to use.  In comparison, the Fire Stick is a breeze!", "verified": true, "helpfulness": "0/0", "author": "vacation4mom"}, {"rating": 5.0, "review": "A+++", "verified": true, "helpfulness": "0/0", "author": "Mike R."}, {"rating": 3.0, "review": "Great stick for the price but would be nice if wireless casting of video through miracast was higher definition and that it worked universally with websites.  I am still debating between thus or chromecast as this isnt universal.", "verified": true, "helpfulness": "0/0", "author": "Brett S. Lorenzen"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Tom Mayfield"}, {"rating": 5.0, "review": "I love it! I use it on the tv we watch mostand we watch great movies etc. We love it and are saving tons of money.", "verified": true, "helpfulness": "0/0", "author": "Debbe Noonan"}, {"rating": 4.0, "review": "Great unit.", "verified": true, "helpfulness": "0/0", "author": "Jclay"}, {"rating": 5.0, "review": "In addition to Amazon Prime, I'm using my Fire Stick for Netflix and Hulu Plus - one really great thing about it is that it travels so well.  I do a lot of business travel, and the Fire Stick plugs into the TVs in most hotel rooms and works seamlessly on the Hotel internet!", "verified": true, "helpfulness": "0/0", "author": "Russ Lowenthal"}]