[{"rating": 5.0, "review": "Friends with Rokus and Chromecast have discussed the problems they had with their devices (the Chromecast in particular was disappointing), so I thought I'd stick with Amazon (already a Kindle owner and Prime member) and try out their wifi connector. Couldn't be happier, it's fast, easy, and operates flawlessly. I'm hoping there will be upgrades to keep offering new apps, but I'm delighted with the product so far.  And the HD is flawless....", "verified": true, "helpfulness": "0/0", "author": "Emmett R. Furrow"}, {"rating": 4.0, "review": "Best purchase of 2015 so far...", "verified": true, "helpfulness": "0/0", "author": "Dennis S."}, {"rating": 3.0, "review": "When it works, it works great.  I have Comcast with a speed test confirmed download speed of 70Mbps.  Frequently the screen says poor connection or check network.  None of my other internet devices (laptop, phone, Xbox...etc) have issus and my modem is fine.  I have to reset the device to recognize the connection again and sometimes disconnect it and reconnect it.  I have three of these currently after canceling with my satellite provider.", "verified": true, "helpfulness": "0/0", "author": "E. Davis"}, {"rating": 4.0, "review": "Very nice. The games are fun and there are lots of content possibilities. I would rate this 5 stars but Chromecast is still better for handling YouTube, remote or not.", "verified": true, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 1.0, "review": "I was on the fence with this and I made the plunge... wish i had not of. It buffers all the time. Really terrible.", "verified": false, "helpfulness": "0/0", "author": "Jennifer Barber"}, {"rating": 5.0, "review": "Exactly as described.  Great to have to supplement viewing.", "verified": true, "helpfulness": "0/0", "author": "Ronald J. Menousek"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Levon Atterberry"}, {"rating": 5.0, "review": "So far I really like my Amazon Fire Stick it was very simple to set up and is extremely easy to use!", "verified": true, "helpfulness": "0/0", "author": "Sandra J Moore"}, {"rating": 5.0, "review": "Love", "verified": true, "helpfulness": "0/0", "author": "charles miner"}, {"rating": 5.0, "review": "I had roku for a decade, and my tivo, xbox and dvd have streaming ability as well, so I have a lot of versions of streaming devices to compare, and in my experience, the early roku I had was the best of the rokus. This was a decade ago, one of if not the first streaming device. I found it far superior to my second and last roku that the fire stick has replaced. So far the fire stick is superior to all gor many reasons. Being dedicated to the task it is designed for seems to make it superior to all others with my sony dvd streaming coming in as a tie or close second. The streamlined design and cost make it an excellent deal if you need or want a streaming device that will deliver consistent quality as I can not say that my xbox, last roku or even my TiVo have been quite as good with issues of their own. If streaming comes as a secondary feature I have found it to be somewhat less reliable in getting solid and consistent streaming without buffering issues among other things. I am not sure why.Fire stick has a vast game selection as well as a very relaxing photo stream if you are not currently streaming. Both these put it miles ahead of the competition and frankly I love to just keep it on for the beautiful images in the background.For the price, this simply is the best deal around as you get great quality for it and some great extras too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]