[{"rating": 3.0, "review": "I've been using a Roku for a couple years now...I expected the Fire TV Stick to be more \"impressive\".  Not sure why, I just did.  But really...it's just a Roku, only a little smaller...not much to croon over.  But...it works, so I can't really say I don't like it.  It does seem to freeze up a little more often than the Roku did...jury is still out on whether or not that'll get better.", "verified": true, "helpfulness": "0/0", "author": "Matt \"Boxless\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "stephen cameron"}, {"rating": 3.0, "review": "But it's limited on onscreen apps via remote control, and other Android app(s) are not integrated - far behind Apple and Google apps. Hope Amazon Prime makes an integrated app to view video and music, and allow the user to transfer content to TV in one app!", "verified": true, "helpfulness": "0/0", "author": "New Kid"}, {"rating": 1.0, "review": "First let me start off by saying that we LOVE our Amazon Fire TV (the $99 box).  We've had very little issues with it, and the issues we did have were most likely due to our older router.  We've since upgraded to the Netgear AC1900, and have had no issues with that box.That being said, I was excited to get the same basic functionality out of a $20 (got this during the 2-day sale) box.  I was sadly mistaken.  I'm having many connection issues (Won't connect to Netflix, Can't Connect to the Home Screen, etc.).  The Stick is in the same room as the box. The remote won't work most of the time, and when it does it is horribly sluggish.  Button presses don't register, or when they do they register as multiple button presses.  It took me more than 5 minutes to exit from Netflix back into the main page.In reading the reviews here, I see that there's a patch/firmware upgrade coming in the near future, so I'll hold out to see if that fixes the issues.  If it doesn't, I'm sad to say that it's going back home to Amazon.  Perhaps I'll find a Roku on a Deal of the Day before Christmas.", "verified": true, "helpfulness": "0/0", "author": "Charles Coverly"}, {"rating": 5.0, "review": "If you are looking to get your TV online to watch Amazon content or YouTube then this is the right device for you. I found this product comparable to the Chromecast or even better. The only missing feature is the ability to cast a browser or video from your computer. The fire stick does support the Plex app and helps alleviate some the casting shortcomings.", "verified": true, "helpfulness": "0/0", "author": "akumar"}, {"rating": 4.0, "review": "Setup was a pain, I had to enter wifi setups multiple times, it kept reboot, finally it did a software upgrade and after that it finally worked. It still cannot connect to my 5Ghz wifi though, only 2.4Ghz,However, now that it works it is great. It does everything I want it to do and it is very fast. I would recommend it to anyone who wants an easy way to watch Amazon instant video (havent tried any of the apps yet). Also, looking at my pictures in the amazon cloud works great too.", "verified": true, "helpfulness": "0/0", "author": "L&M;"}, {"rating": 5.0, "review": "The firfire stick is great.  I like the compact size.  It was very easy to install and works great.", "verified": true, "helpfulness": "0/0", "author": "Mary Dowrick"}, {"rating": 5.0, "review": "Works like a charm. Glad to have amazon media library available on my TV w/o needing to connect a computer.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love our new stick.  Much easier to access our digital movies than trying to go through our Wii.", "verified": true, "helpfulness": "0/0", "author": "Kristy Spence"}, {"rating": 1.0, "review": "Not long enough cord to reach where the TV is to an available outlet. Not easy navigate. I much rather perfer my Apple TV", "verified": true, "helpfulness": "0/0", "author": "Laura"}]