[{"rating": 1.0, "review": "I have had this for about 10 months now and it is rarely ever used. It constantly loses WiFi connection even though it says it has good signal strength and good connection. Hulu and Netflix never want to load. It is very laggy and freezes. Switching back over to my Roku. Very disappointed in this amazon product.", "verified": true, "helpfulness": "0/0", "author": "J. A."}, {"rating": 5.0, "review": "Awesome! No buffering, no problems opening remote, simple set up! Can't wait for my cable contract to run out!!", "verified": true, "helpfulness": "0/0", "author": "Cathy Faulk"}, {"rating": 4.0, "review": "some movies have to buffer alot", "verified": true, "helpfulness": "0/0", "author": "tater2005"}, {"rating": 1.0, "review": "I have never written a negative complain but the signal on theAmazon fire stick is horrible, it work fine for 1 month after the signal it would be interrupted but now it's telling me the device is connected to WiFi but there is no Internet connection, my tablets are working fine, my roku device is working perfectly  fine...", "verified": true, "helpfulness": "0/0", "author": "erika"}, {"rating": 4.0, "review": "Don't understand when can't get a movie that was removed due to licensing and then could go to another link to see it, but can't click on that link as directed.  When can you get more movies older movies that are popular that have major stars.", "verified": true, "helpfulness": "0/0", "author": "Patricia Parris"}, {"rating": 3.0, "review": "It's nice to be able to watch movies and shows on the big screen, but it's super glitchy. Sound goes out if you don't use it for a few days and you have to unplug the TV to reset it. Picture also randomly gets bigger for no reason. Glad it was a gift!", "verified": false, "helpfulness": "0/0", "author": "Hiking_Breeze12"}, {"rating": 3.0, "review": "has trouble with streaming.. Amazon needs to work on prime streaming.. I can go to another unit in my home and stream hulu etc just fine.. Prime skips everywhere. Even hulu skips on the tv stick. No, its not my router or connection . I am a Cisco Network engineer..", "verified": true, "helpfulness": "0/0", "author": "Paulva214 \"PVA\""}, {"rating": 5.0, "review": "I like it, but I cannot use everything the stick offers because I live in Uruguay andmost of the items cannot be used here.", "verified": true, "helpfulness": "0/0", "author": "Sara Rosenkranz \"Sara Rosenkranz\""}, {"rating": 1.0, "review": "very upset, very difficult to set up and no instructions on how to install apps", "verified": true, "helpfulness": "0/0", "author": "Aysia Lloyd"}, {"rating": 3.0, "review": "It's cheap and convenient, but it's also glitchy.  Works for about two weeks then I have to unplug it to force a reboot.  Also every couple days it loses connection and you have to start the program over (okay for most apps but sucks for sling TV).  This being said it's 40$ and works most of the time.  It turns an old TV into a smart TV, but I prefer my actual smart TV or my Xbox.", "verified": true, "helpfulness": "0/0", "author": "Ralph Knowlden"}]