[{"rating": 5.0, "review": "I love my new fire stick!  You have so so much to choose from. The Amazon prime is amazing. If you can't find. Something go to search nine times out of ten you will find it. :-)", "verified": true, "helpfulness": "0/0", "author": "Sweet pea"}, {"rating": 5.0, "review": "Thanks", "verified": false, "helpfulness": "0/1", "author": "Houssam"}, {"rating": 4.0, "review": "Works as expected, but think it could use with a bit better way of organizing as well as access to more online video, like vudu, flixster, etc.", "verified": true, "helpfulness": "0/0", "author": "Joseph Muselevichus"}, {"rating": 3.0, "review": "I was looking at Fire TV as a potential way to disconnect my PC from my TV. So far it's inferior in every way. For $20 it's not a loss at all but it's turning me off to the idea of using a Fire TV (box or stick), Roku, Chromecast, etc...Setup 5/5The Fire TV Stick came with my Prime account setup already. The only other step I needed to do was simply inputting my wifi information. After that it just works.Aesthetics 4/5Not too much to say here. the stick will never be seen aside from the power cable you should use. I'm not sure if it can be used without it. But having a cable coming from behind your TV is standard. Can't dock anything for that. The Stick itself feels solid and high quality. The remote control feels pretty good for such a minimal setup. It has a ring control reminiscent of an iPod, as well as 6 other buttons for home, back, menu, and media controls.Subtle black styling and feels good to hold and easy to use. Nothing here really adds much or takes away from the experience. But nothing to \"wow\" you either. Standard and functional.Software Ease of Use / MenusThe menus are easy enough to use but not really amazing. This is my first media device of its kind. Generally I just use my PC connected via hdmi. I'm accustomed to mouse/keyboard controls so this is a big of a departure for me. Navigation is fairly simple but still doesn't feel too amazing. I had a few weird bugs with trying to install some apps (Plex and Twitch) where they'd start downloading and stop and start and stop, etc... I couldn't really tell what was going on though. A little more feedback aside from a small progress bar that wasn't apparent at first would have been nice.Getting around channels and apps is not bad but the design isn't breaking any ground here. You scroll up/down and left/right. I feel things could be organized better and more intuitively.Performance ~3/5This is where it loses most of its missing 2 stars. The two biggest reasons I got this (aside from the $20 pre-order sale) was to use my Prime video more and to stream from my Plex media server. Prime video works great actually. I've never had any issues streaming from Prime. Plex has been almost unusable and I can't tell if it's the server itself or something with the Fire Stick. Video randomly just stops playing. Repeatedly. Consistently.  This could be a Plex thing but I haven't experienced this on my phone, tablets, or their web player.The other thing I tried was watching Twitch streams. What a horrible disaster. Basically unusable. Way too often I would try to open a stream, watch a 30 second ad, and then get a message saying the stream couldn't open or didn't exist - the stream I could open on my PC no problem. Other problems include trying to open a game channel (ie: League of Legends, Starcraft, etc..) and being told there were no streams for those games. Obviously this is wrong. So far my Twitch experience has been completely unusable.Maybe the worst aspect of my performance problems are that things either work or crash. When they work it's great. Video streams over my 802.11n network without a stutter. Videos start up fast (if they do at all). But then things just stop. Or they don't start at all. I'd take some stuttering over complete failure.Menu performance is actually fairly solid. No delays or anything when navigating around. A few bugs but in downloading apps.Options 2/5There's no option to stream from networked libraries (NAS storage, just a hard drive on your Pc, etc..) so you have to use something like Plex (which barely works for me on the Fire Stick). Your options are fairly limited. This may be the case for most media players of this type but I have no basis for comparison. I have to find a Plex alternative to see if other media servers work better.So if you're mostly interested in Prime video, this thing works great. Other functionality is fairly sketchy for me right now. For $20 I'm not upset at all. But what I was hoping in the back of my mind would be a $20 miracle of media streaming is not going to be a reality.SpotifyThis one's really annoying. I was excited when I saw Spotify was an option. But it's just \"Spotify connect\". So you can play spotify off a tablet/phone to your Fire Tv. You can't just open a spotify app in the Fire TV menu. Spotify Connect is pretty nice. But if you're coming from having a PC hooked up to your TV it's no change at best.", "verified": true, "helpfulness": "0/0", "author": "Jared Dicioccio \"JMD\""}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "ray-w"}, {"rating": 4.0, "review": "Does the job.  It takes a little getting used to but once done things are just ducky.  Don't compare it to the ROKU devices.  You are not limited to Amazon Prime services as some seem to think.  I use Netflix, and Hulu apps and they work just fine.  Also, many more to select from.", "verified": true, "helpfulness": "0/0", "author": "H. Goeller"}, {"rating": 5.0, "review": "Love it so much to watch so easy to use", "verified": true, "helpfulness": "0/0", "author": "Marisa Vozella"}, {"rating": 1.0, "review": "Expected better from Amazon not impressed its just like the game stick which you can buy from gamestop for $15", "verified": true, "helpfulness": "1/2", "author": "ASIM"}, {"rating": 4.0, "review": "Great device, i just wish it didn't need to be powered from the outlet and took power directly from the tv instead,  that's why 4 stars instead of 5.", "verified": false, "helpfulness": "0/0", "author": "John Wood"}, {"rating": 5.0, "review": "Love it....", "verified": true, "helpfulness": "0/0", "author": "patricia truitt"}]