[{"rating": 5.0, "review": "Works great for me, faster than wired, didn't expect that it would, I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Hollis Clark"}, {"rating": 2.0, "review": "This is a heads up/warning for anyone considering buying the Stick. The design or firmware is seriously flawed. As of today there are 224 posts on the customer discussions page (http://www.amazon.com/gp/r.html?http://www.amazon.com/forum/kindle/ref=cm_cd_pg_pg1?_encoding=UTF8&cdForum;=Fx1D7SY3BVSESG&cdPage;=1&cdThread;=Tx2CDOG0K31UBSB), all complaining about the Stick's inability to maintain a network connection. Amazon may fix the problems and soon, because if they don't, they will have a failed product on their hands. I suggest that if you're interested in getting one, WAIT until you hear that the problems have been fixed.BTW, when it works right, it's glorious and the content is enormous (200,000+ movies/videos/etc.), much of it free to Prime members.****************Update 7/2/15: I became so frustrated with the Stick's inability to maintain a network connection (despite System/Settings saying the connection was \"VERY GOOD\" and \"Connected\"... not \"Connected with problems\". . . \"Connected\") that I e-mailed Jeff Bezos about the Stick's problems. This eventually led to Amazon sending 4 tech support engineers from Sunnyvale to my home in Delaware on May 1. They spent 4.5 hours taking spectrum measurements and trying numerous things. When they left, they had made only 2 changes: (1) Moved the Stick to HDMI 1 and my DVR to HDMI 4, thereby separating the 2 connections by the maximum distance, presumably to minimize electronic \"noise\" close to the Stick. (2) They left me with a new Netgear 802.11ac router (thank you!) and put the Stick on its 5GHz signal (the D-Link N router I had only provided a 2.4GHz signal). Since May 1, the Stick has worked FLAWLESSLY.The question is, which of those 2 changes had the most to do with the Stick's now perfect performance? IMO, it is the 5GHz signal. The Stick remains subject to interference from other devices in and around my home. Most of them...probably all of them...send out 2.4GHz signals. By moving the Stick to a 5GHz signal, most if not all of the interference is of no concern. THAT DOES NOT SOLVE THE STICK'S PROBLEM; it's just a workaround to avoid its inability to reject stray signals. Amazon still needs to redesign it so it performs like Google's Chromecast, ROKU sticks, etc. Until that's done, many people will have problems with it.", "verified": true, "helpfulness": "0/0", "author": "DKT \"Don\""}, {"rating": 5.0, "review": "Awesome device. More than I expected for the price. Easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "nomad"}, {"rating": 5.0, "review": "The best buy far love it", "verified": true, "helpfulness": "0/0", "author": "William J Myers"}, {"rating": 5.0, "review": "This was a Christmas gift to my sister and nephew. My nephew adores video games and solemnly informed me, \"This present has changed my life!\" My sister is catching up on all the HBO shows. The remote works fine for easy games, nephew says, but you'll need the game controller (already ordered) to play the more interesting ones. I totally scored with this gift.", "verified": true, "helpfulness": "0/0", "author": "NYC Nurse"}, {"rating": 5.0, "review": "Love this stick! It came a full month earlier than expected and I use it daily! Very user friendly,", "verified": true, "helpfulness": "0/0", "author": "Jacque \"ken\""}, {"rating": 5.0, "review": "Perfect for the older HDMI TV's", "verified": true, "helpfulness": "0/0", "author": "Fernando Garcia"}, {"rating": 5.0, "review": "Received much earlier than expected.  I am not at all tech savvy but this was very easy to hook up and get running.  Lots of movies to watch with amazon prime for free, which I already had. Great so far.", "verified": true, "helpfulness": "0/0", "author": "Grammy Cathy"}, {"rating": 3.0, "review": "I am enjoying the Fire TV Stick but there are 2 significant drawbacks to this product.  First the good points:  it is easy to install and start up and fairly easy to navigate. The compatible phone apps make voice searching possible if not always easy.  I did not realize the Stick needs to be plugged into to a household outlet to operate so make sure you have a spare outlet near your TV.I did not rate the Fire TV Stick 5 stars and changed my original 4-star rating to 3 stars  because of issues related to searching, convenience and equity.These are:(1) it is not at all easy to identify \"Prime Instant\" content, that is, content for which Prime members do not pay an additional charge; and(2) my Fire Stick \"Video Library\" does NOT include digital versions of the many, many movies on DVD I have purchased from Amazon over the years.As to (1), searching for Prime content -- it would be a much more user friendly software if you could search EASILY for ONLY Prime Instant content.  As a Prime member, you would then have in one place all content for which there is not an additional charge because the cost is included in your Prime membership. I contacted Amazon about this and was advised to use voice searching for this purpose but that requires adding an app and it is not a user friendly method.As to (2), absence of purchased items from video library -- if I want to watch  a movie which is NOT included in the Prime Instant Video catalog available to me as a Prime member, that is, for which there is not an additional charge, I have to pay for the movie EVEN IF just last week I purchased the movie on DVD from Amazon.  I know I can always dig out and pop in the DVD (if the other family members returned it to its case) but wouldn't it be nice to chuck the DVD player and access ALL your content through Fire TV?  When I have purchased software on CDs from Amazon in the past I believe I have subsequently been able to access a digital version of that same software.So, Fire TV Stick does not really address all my content consolidation needs unless I want to pay twice for the same movie.  Fix this and the Prime Instant search capability and Fire TV Stick easily becomes a 5 star purchase.", "verified": true, "helpfulness": "0/1", "author": "BJS"}, {"rating": 5.0, "review": "I have multiple products for streaming and this is by far the easiest to use. Seems to speed up downloads from multiple streaming services.", "verified": true, "helpfulness": "0/0", "author": "M Gardner"}]