[{"rating": 4.0, "review": "I won't go into too much detail here since most of it has already been covered in other reviews. Suffice to say that this a fun 'toy' for the serious viewer of TV and obscure, old, or indie films and video.  If you are thinking of buying this and cutting the cord my advice is, 'not yet'. The stick still works best with cable as many apps (HBO, Starz History, Disney, et. al.) require verification of service or monthly plan setups. The combined cost of all of the individual apps plus the fact that in my area I only have a single provider for my internet service means that (for now) I have to keep cable.  That being said I don't doubt that many reviewers here would disagree with me  and have successfully eliminated cable TV from their homes with these apps.  But I would liken it to someone who spends hours and hours cutting coupons for the grocery store in order to save $50.00.  You may have plenty of time for this endeavor but if you are raising two kids, working 60 hours a week and running a house your time might be worth more than the potential savings.  I give it four stars because the sheer number of choices to someone who is pressed for time is a bit overwhelming.  A common refrain is that you might spend more time trying to find something to watch than the time it takes to watch the show itself.", "verified": true, "helpfulness": "1/1", "author": "harborlights96"}, {"rating": 5.0, "review": "Easy to use product", "verified": true, "helpfulness": "0/0", "author": "Nathaniel Stimpson"}, {"rating": 5.0, "review": "took a little time to set up and had to call for assistance and the number wasn't easy to find but after 20 minutes it was all set up", "verified": true, "helpfulness": "0/0", "author": "Heather Morello"}, {"rating": 5.0, "review": "great would buy this over the box", "verified": true, "helpfulness": "0/0", "author": "john withrow"}, {"rating": 5.0, "review": "I love this amazon stick I have had it for a few months now and it still works great. I'm planning to get one for my home gym and maybe even my bedroom and return my cable box I find myself using this more then my cable. I would totally recommend this to others", "verified": true, "helpfulness": "0/0", "author": "M.J"}, {"rating": 5.0, "review": "Totally cool we are well on our way to dumping cable!!! Hooray! Get one if you have Prime, amazing product came all set up with my account details. We are looking to get the Fire TV Box too but wanted to get this as a baby step.", "verified": true, "helpfulness": "0/0", "author": "Benjamin C."}, {"rating": 5.0, "review": "Love love love my Amazon Fire Stick! I have recommended it to so many people...who have in turn bought one! I never watch cable anymore! I bought one for my bedroom and one for the living room...and am considering buying one for other TV's in the house!Only issue is that sometimes when internet is slow, it causes \"updating\" (as it does if you are online and it's \"thinking\"). But it's not very often.", "verified": true, "helpfulness": "0/0", "author": "Judi Walker"}, {"rating": 2.0, "review": "One thing that majorly disappointed with this item was the remote control.My unit will frequently read a simple button push as though I have held down the button. That means instead of scrolling one item to the right, it bolts ahead half a dozen items, then does the same in the opposite direction when I try to correct by scrolling backwards. Frequently the scrolling is out of control, but worst of all is how this appears to drain the battery. Within two months of arrival, I already began getting 'Low Battery' warnings. Either they sent me remarkably un-juiced batteries, or this glitch means that throughout each day - even when I'm not home - the button issue on my remote is continually draining the battery.", "verified": true, "helpfulness": "0/0", "author": "Al King"}, {"rating": 3.0, "review": "not much I want to see on it", "verified": true, "helpfulness": "0/0", "author": "sandhog"}, {"rating": 5.0, "review": "Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Melaine Guyote"}]