[{"rating": 2.0, "review": "It would be great if the movie selection choice for prime was much better. In addition to a better selection, the advertised price to rent a movie is different than what is actually charged.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "THE FIRE TV STICK WAS SO EASY TO INSTALL IT TOOK LESS THAN FIVE MINUTES.I WOULD RECOMMEND IT TO ANYONE. THANKS", "verified": true, "helpfulness": "0/0", "author": "MIKE FUHRER"}, {"rating": 4.0, "review": "It is better than it competition, Google Stick and such.  I was surprised that after paying for the stick, then a years subscription to Amazon Prime that I still have to pay a rental fee for movies or even tv shows.  That wasn't mentioned.  Also seems that certain channels offered still are dependent on your cable carrier and some aren't available through Fire....  So its ok, better than the others but I wonder if I would be in the same place if with just my prime subscription and my smart tv....  maybe more will be offered in the coming months via Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Thomas L."}, {"rating": 5.0, "review": "I bought this to replace my Google Chromecast and I am very satisfied with the decision. The remote is easy to use, the on-screen interaction is simple and easy to navigate. This stick is also very fast; seems like the movies start almost right away. My only two concerns are the video I am forced to watch after installing each device (I bought two) and the lack of an app to operate the stick on my iPad. Both of these are minor because the app is on the way and I hope to never see the video again. I highly recommend this item; it is a big hit in our house", "verified": true, "helpfulness": "0/0", "author": "MDSasquatch \"MDSasquatch\""}, {"rating": 2.0, "review": "This item is very inconsistent when connecting to my home network. Does not seem to connect as well the further away from the modem. For example, it connects right away with my TV in the same room as the modem, but gives me problems on the TV that is one floor up, and even more problems with the TV two floors up.", "verified": false, "helpfulness": "0/0", "author": "Patrick J. Ricci"}, {"rating": 2.0, "review": "awesome for the kids TV.loses account info at least once a week.I keep having to reenter Netflix and wifi info", "verified": true, "helpfulness": "0/0", "author": "sonicwilson"}, {"rating": 5.0, "review": "So far so good. Video is TV quality. Love that you can add apps from a PC or tablet and they get sent to the Fire Stick over the air.", "verified": true, "helpfulness": "0/0", "author": "Stevebowl"}, {"rating": 5.0, "review": "Absolutely great! Takes up a fraction of the space compared to other devices. Always ready to go, and if you can't find something to watch with all those options, you can't be pleased.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "I have been very nervous about buying one of these items.  The Fire TV stick is great - it was easy to install and everything has been great since.  Love streaming Amazon Prime movies on the TV now.", "verified": true, "helpfulness": "0/0", "author": "K. Johnson \"kayakkris\""}, {"rating": 4.0, "review": "Very nice device.  My only complaint is that it is not possible to rearrange the Home screen to my preferences.", "verified": true, "helpfulness": "0/0", "author": "Christopher Milito"}]