[{"rating": 4.0, "review": "A little cumbersome with the scrolling and selections, but overall it's working great so far.", "verified": true, "helpfulness": "0/0", "author": "Robert Barton"}, {"rating": 5.0, "review": "I am loving it!", "verified": false, "helpfulness": "0/0", "author": "ethan"}, {"rating": 4.0, "review": "Works good.  Easy to figure out.  Easy start instructions.", "verified": true, "helpfulness": "0/0", "author": "John Blecha Sr. \"John\""}, {"rating": 4.0, "review": "Works as expected", "verified": true, "helpfulness": "0/0", "author": "Alejandro Spamer"}, {"rating": 5.0, "review": "Arrived quick, instructions well written, easy to install", "verified": true, "helpfulness": "0/0", "author": "Larry Hukriede"}, {"rating": 5.0, "review": "can i just say, i love this! i also have an apple TV but this makes a great addition and its so portable and with the new iOS app i can do voice search which is surprisingly accurate. i got this at the prime promotion price when it was in pre-release (only $19 as i recall). great value for money.. best addition?? the You Don't Know Jack Party Pack.. already have had hours of fun with that.. family friendly and \"friend friendly\" if you get my drift.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey \"Devoted101\""}, {"rating": 5.0, "review": "It met my expectations beyond what I that it would do.  I should have gotten the fire tv.  Grandkids love it.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Better then I could of thought this would of been. Being an Amazon prime member is a huge plus and can really get more use of this", "verified": true, "helpfulness": "0/0", "author": "Brian K Hill"}, {"rating": 4.0, "review": "It worked great at first but after 2 days everyhting froze up.  Finally went to Best Buy and they said it needed updates. UPDATES! It was brand new and since I could not find any detailed instructions how was I to know this???  Now it works but can't find any instructions that let me know how to work the controller.  Other than the above, I am very happy with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "kitz"}, {"rating": 5.0, "review": "Great product.the best on the market today.", "verified": true, "helpfulness": "0/0", "author": "Richard"}]