[{"rating": 5.0, "review": "We love it! It is easy to use. I use the voice remote which I downloaded on my phone. I recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "jetrider"}, {"rating": 5.0, "review": "Great product, all media apps work great including the plex app with media server.  It's portable, brought with on vacation and plugged into hotel TV, worked like a charm.", "verified": true, "helpfulness": "0/0", "author": "Nathan R. Hudson"}, {"rating": 3.0, "review": "Great, but sometimes takes too long to awake, lost connection. Remote control out of control, repeat key press by itself too often.Plays Music without TV on with my AV Receiver, that's great.", "verified": true, "helpfulness": "0/0", "author": "Kerstin  O."}, {"rating": 5.0, "review": "Wireless function is better than expected. Remote is comfy and easy to use.", "verified": true, "helpfulness": "0/0", "author": "R. D. Grimes"}, {"rating": 5.0, "review": "Easy, easy, easy. Love it!", "verified": true, "helpfulness": "0/0", "author": "Carol S. Paasch"}, {"rating": 1.0, "review": "Doesn't stream well. A lot of loading and freezing.", "verified": true, "helpfulness": "0/1", "author": "Brenton Powers"}, {"rating": 4.0, "review": "I was amazed at how easy it is to use.  I thought it had to be hooked into my computer or kindle to stream but when I set it up everything just came right onto the tv screen.  It really is a great item and I have been telling everyone that they should get one.", "verified": true, "helpfulness": "0/0", "author": "Raymond Richard"}, {"rating": 4.0, "review": "The only thing missing is voice search. Otherwise, it is the whole Amazon Fire experience in miniature.", "verified": true, "helpfulness": "0/0", "author": "Louise Richardson"}, {"rating": 5.0, "review": "Great product!  Love it, I was lucky to order it during the 2 day sale and it was worth waiting for. It is great,  works with my android phone as well as wits prime. I don't have Netflix but think I will soon.", "verified": true, "helpfulness": "0/0", "author": "Leah Cinman aka booklover \"Book Lover\""}, {"rating": 4.0, "review": "Works pretty well.The one app that doesn't work is flixster. I have 1,200 films in the account and I cannot get the app to work. It just keeps spinning, then times out for an error.I also would have liked more game controllers to be able to be used, but I suppose that is not Amazon's fault.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Hernandez \"Jon Birdman Attorney at DVD\""}]