[{"rating": 5.0, "review": "Fully enjoying", "verified": true, "helpfulness": "0/0", "author": "TRenee"}, {"rating": 3.0, "review": "AllCast would not work. It is great for Amazon Prime video but I think I will stick to Chromecast. Chromecast will operate fine with USB power from the TV the Fire TV Stick gives errors when plugged into the TV and wants to be plugged into wall outlet.", "verified": true, "helpfulness": "0/0", "author": "Jeremy S. Stevens"}, {"rating": 5.0, "review": "Great buy! Love the remote! Easy to install!", "verified": true, "helpfulness": "0/0", "author": "Nikki Torres"}, {"rating": 5.0, "review": "Oh my gosh--why did we wait so long to purchase the Fire TV stick?!  We kept on having problems staying connected to our wireless shows.  This improved our connection 1,000%  No kidding!  We are older and retired, and kept on putting off this purchase thinking it would be difficult. Instead, just opened the box, let it do it's thing with a couple of prompts, and were watching Netflix in minutes.  Next up is Bosch on Amazon Prime TV.  We are excited knowing we can take this on vacation with us.  We cut the cord and do not have any cable or dish.  Can you tell we are extremely pleased?", "verified": true, "helpfulness": "0/0", "author": "Carol L. Pigg \"piglet\""}, {"rating": 5.0, "review": "Greatest purchase in a long time", "verified": true, "helpfulness": "0/0", "author": "Emily"}, {"rating": 5.0, "review": "Very good streamer", "verified": true, "helpfulness": "0/0", "author": "Oded"}, {"rating": 5.0, "review": "Love my Fire Stick! I have not missed cable at all. I downloaded the Sling TV App and with that and Amazon, I have not missed watching anything I enjoy.", "verified": true, "helpfulness": "0/0", "author": "Tam2dogs"}, {"rating": 4.0, "review": "Took me a while to fit on my 5 year old led tv.Worked out after setting up on another newer TV.Pro:cheap, streaming quality okaycon:sometimes slow down and have to restart the device.overall this is a cheap solution to upgrade an old TV with Hdmi input to a smart TV with WiFi connection.", "verified": true, "helpfulness": "0/0", "author": "Peng Chen"}, {"rating": 5.0, "review": "I am surprised by how much I like this. My wifi router is just below, and so I have not experienced any connection problems that others have reported. The interface is easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "T. Meu"}, {"rating": 5.0, "review": "Easy set-up.  Works great with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "jya"}]