[{"rating": 2.0, "review": "This would be a great product except for the fact it continually drops the WiFi network.  My laptop, Ipad, HTC one, and wife's PC have no issues running on the network.  There are a lot of blog comments regarding this issue so it seems like a problem on all Fire Sticks not just mine.  Hopefully Amazon can fix what is wrong with the Fire Stick and connectivity issues.", "verified": true, "helpfulness": "2/2", "author": "Brandon M."}, {"rating": 5.0, "review": "I have been a advocate of ROKU for several years.  But as a Prime member, I decided to try the Fire Stick and I couldn't be happier!  The remote s super light and easy to use.  We needed to get used to the way the screen looked (after viewing the ROKU for so long) but we quickly adapted.  The best feature is the screen saver!! LOVE to watch the beautiful landscapes!", "verified": true, "helpfulness": "0/0", "author": "Debra L. Jensen"}, {"rating": 5.0, "review": "Easy to install and we were very happy with how easy it was to watch movies.", "verified": true, "helpfulness": "0/0", "author": "Maryann"}, {"rating": 1.0, "review": "Changing my review. Unless you are next to your router you get next to no service. Running 30 mbps through a Linksys 1200+ there is no reason I should have such poor service one room away. Worked decently when the router was next to the TV but decided to move some furniture around and the one room difference stopped my fire stick from being able to run anything. Have been able to connect with my phone, tablet, and PS4 from the same location as the fire stick but still absolutely nothing. Not worth the money.", "verified": true, "helpfulness": "0/0", "author": "Jason Chapple"}, {"rating": 4.0, "review": "Just got this little thing and I'm so amazed at the features and how fast it performs but the real gem is side loading feature. I use the apps2fire app on my tablet to sideload feature onto it instead of the PC companion because to me its easier and faster. Just being able to add my android apps such as chrome, kodi, youtube,etc makes this the ultimate media streaming device. I just ordered the set top box because I was so impressed with the fire stick, I CANT WAIT!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Alan Parrish"}, {"rating": 2.0, "review": "I purchased the Fire Stick to mirror my Kindle Fire HD to a television screen.  It is not able to do this.  It will mirror my Android smart phone but does not support this for Amazon's own Kindle Fire HD.", "verified": true, "helpfulness": "3/3", "author": "Terri Fletcher"}, {"rating": 5.0, "review": "This is great. I do not even use the built in amazon app on my tv because this has better connection.The controller that came with it seemed to have issues so I suggest ordering the upgraded controller with the speech capability.Otherwise very cool.", "verified": true, "helpfulness": "0/0", "author": "G. Wolff \"Shadow\""}, {"rating": 4.0, "review": "Easy to install & use.", "verified": true, "helpfulness": "1/1", "author": "Sharon Stearns"}, {"rating": 5.0, "review": "I got on the waiting list when word came out about this tool, and was pleased to see that it would be arriving at my home earlier than expected.  It gives me a chance for my \"non intelligent\" tv to receive movies etc.  It is compact and I can move it around the house with little effort if I am going to be in a different room for a while.  What and smart thing technology has become!", "verified": true, "helpfulness": "0/0", "author": "Creative 1 \"Claymud\""}, {"rating": 4.0, "review": "WE HAVE ONLY HAD LIMITED USE ( due to travel ) BUT THE EXPERIENCE SO FAR HAS BEEN VERY GOOD. THERE ARE MANY FEATURES THAT WE HAVE NOT BEEN ABLE TO TRY . THE STICK WILL ALLOW US GREAT ENTERTAINMENT WITHOUT A BIG CABLE BILL WHILE STAYING IN OUR WINTER GETAWAY", "verified": true, "helpfulness": "1/1", "author": "Danny Lloyd"}]