[{"rating": 5.0, "review": "I am very pleased.  It is really cool that I can watch my Netflex on the living tv if I want to!", "verified": true, "helpfulness": "0/0", "author": "Jan Morris Harrod"}, {"rating": 4.0, "review": "Really easy to set up and use. Looking forward to getting into some more movies and TV before the fall season starts!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Bennet \"thoughtful gifter\""}, {"rating": 5.0, "review": "Goodbye chromecast, speed and quality Exceeded my expectations in fact I also purchased the fire TV console and got rid of chromecast in bedroom and home theater. The Voice search has been impeccable and a true pleasure to use. The Netflix app is seamless and also very fast, no need for other applications to stream from any other sources.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I got this recently and I am very happy with it.  It does everything it says it does.  Perfect little thing for entertainment at home.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Marooned \"Marooned\""}, {"rating": 5.0, "review": "Works great out of the box. There are so many alternate ways to stream stuff to your TV, but the fire stick for $39 is a no brainer! The remote control ALONE is worth that much.", "verified": true, "helpfulness": "0/0", "author": "S the Sark \"Sarkmonster\""}, {"rating": 3.0, "review": "slow processor. influence using experience", "verified": true, "helpfulness": "0/0", "author": "Ming Yue"}, {"rating": 3.0, "review": "The stick gets warm to hot if you don't unplug it from the tv when not in use.", "verified": true, "helpfulness": "0/0", "author": "Brandan"}, {"rating": 5.0, "review": "Awesome value for $", "verified": true, "helpfulness": "0/0", "author": "Dmitry Svetlov"}, {"rating": 5.0, "review": "Works great it's awesome... fast shippingthanks", "verified": true, "helpfulness": "0/0", "author": "Carlos G."}, {"rating": 1.0, "review": "Worked great!!  For a month.  Then burnt out!  Now it doesn't work at all.  Have a Roku for another sort which is working just fine still...looks like in replacing this junk with a other Roku", "verified": true, "helpfulness": "0/0", "author": "StarBrite"}]