[{"rating": 5.0, "review": "It's amazing, so many features. Free downloads as a prime subscriber etc.", "verified": true, "helpfulness": "1/1", "author": "Saxman"}, {"rating": 5.0, "review": "This device offers the best bang for the buck at $40.  As the owner of two of the more expensive Fire TV's, I was impressed with the performance of the Fire TV Stick.  It installed, upgraded and configured itself flawlessly.  I noticed no difference in responsiveness or viewing quality when viewing movies despite it having 2gb less RAM than the Fire TV.  Not being a gamer, I have no comments regarding its gaming performance.  I was fortunate to have the opportunity to pre-order two of these devices at half price.  I have 3 different Roku models and 1 Apple TV2.  None of these other streaming devices come close to the Fire TV or Fire TV Stick in performance or value. The only downside to the Fire TV & Fire TV Stick is that it does not place an icon on the home screen for user added applications.", "verified": true, "helpfulness": "1/1", "author": "BobbyRed"}, {"rating": 5.0, "review": "Great. Much easier to get the value of prime video", "verified": true, "helpfulness": "1/1", "author": "Xiaochen Xu"}, {"rating": 5.0, "review": "Seems to be working just as promised -- waiting for the HBO Go app to complete the picture. I understand it's due to come out in early 2015. I jumped on the Amazon Prime two day $20 offer  so I know I got a great deal!", "verified": true, "helpfulness": "1/1", "author": "S. Lewis"}, {"rating": 5.0, "review": "Simple setup, easy to use.....love it!", "verified": true, "helpfulness": "1/1", "author": "Neale"}, {"rating": 5.0, "review": "My wife and I love the fire TV stick now my son can watch is favorite shows in the living room and we can watch our shows in the room. Updating on the stick took a while but after that everything is running smoothly. No lose of signal (signal has to travel throug two walls and works well). Setting up was easy my info was pre installed. We got all the apps we need. The remote make life much easier, the way the stick has been programmed makes it easy for any one to use it.", "verified": true, "helpfulness": "1/1", "author": "J10Futbol"}, {"rating": 3.0, "review": "The Amazon Fire Stick is relatively easy to install and works as advertised.  It is easy to access.  But the UI takes a little getting used to and doesn't seem too well thought out.  Or maybe I just haven't learned the UI well enough which would then suggest that it is not intuitive enough.  I wind up running the same searches through multiple services or \"apps\".  I want to find and watch a movie but I don't know if it's on Amazon Prime, Netflix or ShowTime.  Maybe there's a universal search but it doesn't jump out at you.I like the access to my music, too, but I wish Amazon would allow me to sync through OneDrive and my home network rather than through Amazon Cloud Player.", "verified": true, "helpfulness": "0/0", "author": "Mark \"Esoth\""}, {"rating": 5.0, "review": "I have Amazon Fire TV on my 60 inch TV.  Decided to get this to put on my 27 inch TV in the den so I can access everything there that I can on the main TV.", "verified": true, "helpfulness": "1/1", "author": "Patricia B \"historical bookster\""}, {"rating": 1.0, "review": "It does not work very well at all.  Very disappointed", "verified": true, "helpfulness": "2/4", "author": "m.peery"}, {"rating": 5.0, "review": "Super easy to install. Awesome addition to my tv movie experience. Already preloaded with my Amazon Prime account makes it super easy to rent and purchase movies. I spent my first Saturday watching movies all day. The only negative is the flash drive that connects to your tv needs to b plugged in also vs using tv as a power source. But other than that...worth it.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}]