[{"rating": 4.0, "review": "Works great. Get to watch lots of things on the TV that needed the computer before. Lots of free movies to watch. Not as many as I'd like, but what do you want for free? There would be more to watch, but they cost money.", "verified": true, "helpfulness": "0/0", "author": "Ruth Spies \"nee: Madorma\""}, {"rating": 5.0, "review": "Came loaded with my account information for incredibly easy setup.Only suggestion would be to make the power cable longer.", "verified": true, "helpfulness": "0/0", "author": "Chelsea"}, {"rating": 5.0, "review": "Very satisfied.  Works nice and fast and worked perfectly the first time.  Much faster menu speed and more reliable applications than my Western Digital Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Charles Faris"}, {"rating": 5.0, "review": "Excellent product, easy to use", "verified": true, "helpfulness": "0/0", "author": "JMWolfe"}, {"rating": 4.0, "review": "It is nice not having to use my lap top to watch Netflix.", "verified": true, "helpfulness": "0/0", "author": "L. Kirby  .."}, {"rating": 3.0, "review": "I was so excited when this was announced! Finally I could stream Amazon Prime to my second TV...I have an Amazon Prime Subscription and used to stream a lot of movies and TV shows but lately Amazon has been a little laggy on  Prime Subscription content.  So much so that it's almost unwatchable compared to Netflix.  I thought I'd give the Fire TV Stick a try anyway since it has a pretty sweet RF remote and I'm always looking for the next big thing (and it streams Netflix).The good:Pretty simple setupStreams NetflixNetflix works with the Netflix iPhone appThe bad:Prime Content LackingNetflix streaming is jerkyNetflix bufferingKeeps losing my Netflix loginRF remote is tiny and easily lostRF remote too sensitivenavigation somewhat confusing; I often end up exiting out of netflix when I just want to get out of some mode that I've gotten in toDoesn't have an iPhone appStreaming Amazon content seems to be fairly smooth but they've taken some of the greatest TV shows out of their prime catalog like The Larry Sanders Show and The West Wing... There is new content but I'm really not into Downton Abbey and Dr. Who.My biggest complaint, however, is that it seems to forget my Netflix login information about every other week.  That's seriously annoying. So much so that I've switched back to Chromecast for streaming Netflix. Not only is Chromecast more reliable but It's smoother and rarely buffers.", "verified": true, "helpfulness": "0/0", "author": "Jeff Booher"}, {"rating": 5.0, "review": "Great product.  I use it in my office on one of my computer monitors that has an HDMI input.  Allows me to watch my media stuff like netflix, tv, stream pandora, etc. without having to obstruct my work displays or consume sorely needed resources on my computer.And unlike the ChromeCast, it doesn't create a wide open access point on my wifi network.", "verified": true, "helpfulness": "1/1", "author": "Kyle S. Chrisman"}, {"rating": 5.0, "review": "I bought this when it was on sale for Prime users. I wanted it to see if it would be easier to watch Prime shows than on my blue ray. I'm very happy. If anything, it is continuous play on series! I have been waiting forever for this! Of course, like Netflix, it will stop after a few, but I'm ok with that. I enjoy not having to keep going back to click on the next episode.I also like using my fire HDX as a remote.It was worth 20 bucks for me.", "verified": true, "helpfulness": "1/1", "author": "donella m."}, {"rating": 5.0, "review": "Pretty awesome. Best out right now. I bought mine through staples online since Amazon has none in Stock.", "verified": true, "helpfulness": "0/0", "author": "J. Rorrer \"philiprr\""}, {"rating": 4.0, "review": "I own 2 and I will be buying another.  The remote works great and the Fire stick is very easy to use.  The only thing I don't like is that it occasionally drops the internet connection so you have to unplug the USB from the wall charger, then everything works great again.  I wish that the search function also searched Netflix, but I get that this is an Amazon product so I understand why it doesn't.", "verified": true, "helpfulness": "0/0", "author": "Shawn"}]