[{"rating": 5.0, "review": "This thing is great! worked right out of the box as expected and I can even use the usb adapter on my particular TV. It does run faster with the plugged in adapter though. Less buffering with the adapter so it must provide more power.", "verified": true, "helpfulness": "0/0", "author": "rlbrobst"}, {"rating": 5.0, "review": "Love it easy to use, many options available, plain and simple, you need to buy one if you like TV, Movies, Odds and Ends and no commercials!!!", "verified": true, "helpfulness": "0/0", "author": "MARY"}, {"rating": 5.0, "review": "works well plus easy set up", "verified": true, "helpfulness": "0/0", "author": "Peter gray"}, {"rating": 5.0, "review": "I have to say I'm very impressed with this little Fire TV Stick.  I like the interface and its up and working on my wireless network in a matter of minutes.  I got a good deal when I pre-ordered this.  If you have Amazon Prime this is a no brainer and very easy to add to your LCD TV on one of the open HDMI inputs.  I would recommend this product!", "verified": true, "helpfulness": "0/1", "author": "klm"}, {"rating": 5.0, "review": "The Fire stick is AWESOME and for the price during Christmas was worth it. I like that it comes with the remote, unlike, the other stick lol, when used with the kindle you open a lot more features. It is a must have if you have Prime.", "verified": true, "helpfulness": "0/0", "author": "Floyd"}, {"rating": 1.0, "review": "This stick is not easy to manipulate.  Everything offered COSTS MONEY...I have had a subscription to Hulu Plus and Netflix for two years and to use with Amazon I am asked to buy again. Most importantly there are minimal movies with women leads.  PRIME does not offer ANY movies or series with FEMALE LEADS.  This Amazon Prime has been set up by men and offers nothing for women,  I cancelled/asked for refund and ordered ROKU.", "verified": true, "helpfulness": "0/3", "author": "Cheryl Miller"}, {"rating": 5.0, "review": "GREAT BUY!", "verified": true, "helpfulness": "0/0", "author": "pahrumpn"}, {"rating": 5.0, "review": "Works as advertised!  Clear instructions and very easy to set up.  Now, all I need is enough time to watch all the back episodes and movies!!", "verified": true, "helpfulness": "0/0", "author": "Kenneth J."}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Denise M. Johnston \"justdea\""}, {"rating": 5.0, "review": "We have had this for a week and so far it was very easy to set up and install. We did use the included extender to make it easier to install into our TV's. The only draw back was trying to get the new remotes open to get the included batteries in. This took a few minutes. We also have an older (5-6 year old) flat screen as our main TV and it took a few tries to get every thing working correctly. On newer HD TV's the fire stick just plugs in, and literately walk you through the steps to start up. We also figured out that there really was no \"off\" switch and after a set amount of time you get a nice screen saver and the device shuts itself off. The remote is easy to use and menu easy to navigate. It may take a few time of trial and error but was definitely worth the purchase and wait. We don't have satellite or cable so this was a good alternative to watch netflix, huluplus, and amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Heidi C. Loomis"}]