[{"rating": 3.0, "review": "It depends on your situation whether the fire stick is right for you.I have come to view this fire stick as basically a wireless hdmi cable. I say this because all the firestick will do for you is stream stuff like huluplus, netflix, amazon prime movies/shows, etc. However, you have to pay individually for all those programs.Overall, if you want to save money, then your computer with an hdmi cable can do everything on your tv and more compared to the fire stick. But, if you find it a hassle to connect your hdmi cable into your computer and tv everytime then the Fire stick is an elegant solution.For me its useful because I have a small tv for gaming, and a projector. I use my computer and connect it to my projector in my living room, but now with firestick I can move the projector into my bedroom and just plug in my fire stick and stream all my movies/shows. Before, I would have to lug my computer around and it's a gaming computer weighing almost 20lbs. I have a laptop but it won't play large file movies that are 1080p, or at least it won't play them smoothly, which is why the fire stick is an adept replacement for my computers in this one situation. Is it worth the money? For me I really only use it in this one situation, in my bedroom, so I consider coming out even (since it was only $40). If you stream movies/shows a lot and don't have a computer near your tv then I would consider this worth it.", "verified": true, "helpfulness": "0/0", "author": "mayhew"}, {"rating": 1.0, "review": "not many thing to watch.", "verified": true, "helpfulness": "0/1", "author": "thach"}, {"rating": 1.0, "review": "I would have had to re-configure my Verizon Fios router for this to work.  No go!", "verified": true, "helpfulness": "0/1", "author": "Glory2God!"}, {"rating": 5.0, "review": "Amazing! So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kon Artista"}, {"rating": 1.0, "review": "To start this off I would say that I am a huge fan of Amazon. But that doesn't mean that they get everything right. This device is incredibly slow and full of glitches.  Chromecast sprints circles around this device. Doesn't even compare. I thought I \"upgraded\" from it but it's clear that I took about 175 steps back. Right now I have waited over 10 minutes for the device to do what Chromecast used to do in seconds. Until they fix everything this is the biggest scam on the streaming market. As of now Roku sprints circles around this device and that should be embarrassing.", "verified": true, "helpfulness": "0/0", "author": "Cullen Mauritzen"}, {"rating": 5.0, "review": "I love love love this little thing! It's easy to use and I love the portability of it. I can use it on any TV in the house! I love all the apps that I can purchase and use and I LOVE being able to link my amazon to it. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Sunshine"}, {"rating": 5.0, "review": "Love it....I have great internet speeds so my stick works perfect.", "verified": true, "helpfulness": "0/0", "author": "Joel Kaneaiakala"}, {"rating": 3.0, "review": "I had Chromecasts on all my tv's and decided to \"upgrade\" to fire sticks since we have  a ton of purchased Amazon digital movies. The quality casting from the chromecast to the tv from Amazon wasn't great and I figured these would fix that. Wrong. While they are neat and have great features, I cannot get them to play videos without buffering a million times. I pay a lot of money for the fastest internet my provider has. NO other device has this problem. After two weeks I couldn't stand the constantly loading and buffering. Unhooked it, hooked the chromecast back up and we've had zero issues with videos buffering. The only thing I needed this for that my chromecasts couldn't do for me was play my Amazon videos. Guess I will look into a Roku.", "verified": true, "helpfulness": "0/0", "author": "A. Sylvester"}, {"rating": 1.0, "review": "On my second stick as a replacement and the replacement is also failing. First stick simply died, second stick constantly freezes, loses connection when everything else in the home is working fine. The stick does not appear to be a robust product and will be switching to roku which just always works. Would not suggest purchasing this until maybe an upgraded model is available.", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 5.0, "review": "I like it, I have 1 TV without cable and it is perfect. Thinking about getting rid of cable altogether and but one for every TV in the house (3).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]