[{"rating": 4.0, "review": "Really great when working.  Have had to reboot a couple of times when it gets stuck or can't find Wi-Fi connection.  Otherwise, love it when functioning.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Benecke"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Anthony E Presley"}, {"rating": 5.0, "review": "Absolutely awesome am really enjoying all the selections, my only problem is the remote, it sticks sometimes and is so small I lose it easily!!", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 2.0, "review": "After giving this over a month of regular use.  We don't like it.  It really doesn't do Hulu plus.  Hulu plays well on other devices but freezes frequently on the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Rebelflame"}, {"rating": 5.0, "review": "This has been a fantastic improvement for streaming. Before this we had trouble (we had to use our DVD player to access it and it never seemed to work) watching online content and now it couldn't be easier! Definitely recommend :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My son and daughter-in-law bought me the Fire TV Stick for my birthday. He installed it easily and we had it set up in no time. I love it! Simple to use and lots of choices from TV shows, good movie selections and children's shows for my grandson. There is much more that I still need to explore! Its a good bargain that offers a variety of entertainment in the convenience of your own home!", "verified": true, "helpfulness": "0/0", "author": "Amy Athey"}, {"rating": 4.0, "review": "Works great right out of the box, but it is a little hard to get to the search screen.", "verified": true, "helpfulness": "0/0", "author": "Sally Dix"}, {"rating": 5.0, "review": "It's good I just use it for netflix", "verified": true, "helpfulness": "0/0", "author": "Aracely garcia"}, {"rating": 5.0, "review": "I like this much better than my Roku or the apps on my Bluray player. Very quick remote response and haven't had the buffering issues I've experienced with my previous streaming methods.", "verified": true, "helpfulness": "0/0", "author": "Brian Fitzgerald"}, {"rating": 4.0, "review": "Nice unit easy to set up and use.  Same as fire tv without voice search", "verified": true, "helpfulness": "0/0", "author": "Jerry D Bales"}]