[{"rating": 4.0, "review": "I love my fire TV stick!  The only thing that would make it better is if I could mirror my surface through it to the TV", "verified": true, "helpfulness": "0/0", "author": "Rose Marie Smith"}, {"rating": 3.0, "review": "The product itself works fairly well.  The problems I have found are that (1) the stick can see my 5G wifi, but it won't connect to it (only wants to connect to the 2.4GHz band), and (2) the picture quality and lag while mirroring is terrible.  I tried mirroring movies from my Galaxy Note 4 and my Kindle Fire HDX.  Both failed horribly.", "verified": true, "helpfulness": "0/0", "author": "Budge"}, {"rating": 1.0, "review": "Disappointed the product did not work with Apple products.Recommend a Apple TV instead, costs more $99 and less portable.Amazon lied, this product is only for Android products and probably works very well with those.The remote has limited features and Amazon sells a better remote, but did not ship with product..We waited months and months for the initial shipment at $20 a piece.Best to wait for the market or Amazon to come out with a better version if you want to use Apple products.", "verified": true, "helpfulness": "0/3", "author": "Lincoln Rhoads"}, {"rating": 3.0, "review": "Update: It works just fine plugged into my new TV in my office, the aforementioned 10 feet from my router. Also worked at another house. So it's main problem is that its antenna is not as good as Google's Chromecast, which works just fine everywhere in my house.Verdict: If you want a convenient way to stream Amazon video, and have a strong wireless connection, get this. Otherwise, Chromecast, which will stream Amazon videos from your phone's screen up to the TV with little degradation (although your phone will run hot).Original (1*) Review:My new Fire Stick just informed me that \"an Internet connection is required.\" No kidding. Before that, it took about 20 minutes to watch the first ten minutes of Alpha House because of the buffering. Getting my WiFi password entered was ... an adventure. There's a screed around here somewhere about that.I have a Chromecast, which I love. Let me repeat, I have a Chromecast, which works on the same HDMI port on the same TV I've plugged the Fire Stick in to, using the same WiFi Signal. The only reason I bought the Fire Stick was to stream Amazon Prime videos, because, as we all know, Amazon has not issued a Chromecast compatible app. I wouldn't have paid full price, but I got the $19.95 deal.With the HDMI extension the Chromecast has never lost the Internet feed. A computer plugged into the same port (my alternative for watch Prime Video) has never lost the feed. The Fire Stick can't hold on to the Internet for more than 5 minutes.Yes, I've plugged it into the HDMI extender. I've plugged it in to the HDMI extender and the Chromecast HDMI extender, in series. I get the same behavior in both cases.If anyone (including Amazon) has a suggestion, I'd love to hear it.Otherwise, my phone has the Cast Screen option for Chromecast, and right now it's streaming Alpha House pretty well. It's not quite as sharp a picture, but it beats having to wait for the Fire Stick to find my WiFi.I'll give it few more shots over the next couple of days, but I suspect the Fire Stick is going back.", "verified": true, "helpfulness": "0/1", "author": "R. C. J. Hawk \"rcjhawk\""}, {"rating": 1.0, "review": "The audio stopped working after just a couple weeks of use.I enjoyed it until then.  I tried on multiple devices and multiple HDMI ports.", "verified": true, "helpfulness": "0/1", "author": "S Hatch \"S Hatch\""}, {"rating": 5.0, "review": "This thing kicks ass! I ordered it when it was on sale for $19. My only regret is that I didn't order a few of them at that price. If you have prime, this is the device for you (other than the fire tv). It works flawlessly with prime instant video along with prime music. it navigates extremely fast and fluently. I also have a Roku 2, and this thing completely stomps it out.", "verified": true, "helpfulness": "0/0", "author": "Joe Nelson"}, {"rating": 5.0, "review": "Awesome device! I use it everyday with plex flawlessly and it's loaded with apps. I would definitely purchase another. I love the remote it works the way you expect.", "verified": true, "helpfulness": "0/0", "author": "Aaron S Lewis"}, {"rating": 1.0, "review": "I can't even plug it in to the HDMI port on my TV because the Fire Stick is too long - it doesn't fit within the constraints of my TV.", "verified": true, "helpfulness": "0/5", "author": "Cynthia Young"}, {"rating": 4.0, "review": "So we got this in the intro deal, excited to get amazon on our tv without using a computer. Once we installed it, we have used it for many activities. we also have discovered that it works with our SONY remotes, which is a plus. however we also learned that our kindle fire would turn on the television in the morning when the alarm came on from the other room.  In spite of these issues, we enjoy using the fire stick and the additional services we can access.", "verified": true, "helpfulness": "0/0", "author": "Grace"}, {"rating": 5.0, "review": "Works really well, I purchased two of them one for the living room and one for the bedroom. I purchased the voice remotes rather than use the remote that comes with the unit. The unit works great, great quality for my subscription services. While the Stick is a gimmick it's a heck of a lot better and cheaper then the Fire TV. The unit does everything that Fire TV does for a lot less money. Save the $99 on the TV and buy the stick with the voice remote..you will be happy you did!", "verified": true, "helpfulness": "0/0", "author": "Roy A. Teel Jr."}]