[{"rating": 5.0, "review": "Easy to install and so easy to navigate!!!  Love it!!!!!", "verified": true, "helpfulness": "0/1", "author": "Janett Burns \"Steve R.\""}, {"rating": 4.0, "review": "It is great! Easy to install & use!Highly recommend it", "verified": true, "helpfulness": "0/1", "author": "Edy Ny"}, {"rating": 3.0, "review": "Had trouble reading instructions which were in German.  Finally figured out how to change it to English.  Disappointed that ,although a prime member, I have to pay for some picks in order to stream them.  Thought if I purchased Fire Stick, I could have no problem streaming anything offered on Amazon Instant Video.", "verified": true, "helpfulness": "1/1", "author": "marlene Bolante"}, {"rating": 5.0, "review": "This one of the greatest inventions of the decade!  I can do some many things, and \"go\" to so many places with the Fire Stick.  Best way to spend not an awful amount of money.  The Fire Stick has definatley exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Kheidi"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/1", "author": "Iulia"}, {"rating": 5.0, "review": "Easy to set up, easy to use. Perfect for what I needed!", "verified": true, "helpfulness": "1/2", "author": "Lynda Siry"}, {"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/1", "author": "eric gray"}, {"rating": 1.0, "review": "I can't stream any shows or videos lately. I can hear the show, but I have a blue screen of death which says, \"HDCP unauthorised. Content disabled\". Unauthorised isn't even a word! The only way we can watch anything is through an app.", "verified": true, "helpfulness": "4/5", "author": "Brittany"}, {"rating": 4.0, "review": "I was using another \"Stick\" and it was not very usefully.  I plugged in the Firestick.  Easy to setup and the video audio is great.  I am so pleased with it.  I going to buy another for my second TV.", "verified": true, "helpfulness": "0/1", "author": "Arnold Arenas"}, {"rating": 1.0, "review": "tried two sticks the Dolby Digital 5.1 keeps cutting out on both of them, and that's the main reason that I purchased the product.", "verified": true, "helpfulness": "1/1", "author": "Pete A."}]