[{"rating": 5.0, "review": "I really am enjoying the shows we get and being able to watch them on my big screen tv.", "verified": true, "helpfulness": "0/0", "author": "Sheila K Humphreys"}, {"rating": 5.0, "review": "So great, this is by far better than any streaming device currently offered. Absolutely better than the Chromecast, Roku, Apple TV, etc...Extra points for the smartphone app remote. Amazon really did a great job when creating this. The menu layout is also top notch. I will never use any other type of streaming device now.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Thomas"}, {"rating": 5.0, "review": "Got this as a gift for my son and its great!", "verified": false, "helpfulness": "0/0", "author": "Mary"}, {"rating": 1.0, "review": "Complete piece of garbage.", "verified": true, "helpfulness": "0/1", "author": "Joe Mileto"}, {"rating": 4.0, "review": "Fire TV is great for people who buys, rent movies, episodes on Amazon Instant and have Prime Subscription. Setting it up was quick, it was already register to my account when it was powered on for the first time. Unfortunately there's no way to listen privately via headphones and the remote is a bit uncomfortable to use compare to Roku remote. The Mirror cast option, has not work for me, my htc one m8 will connect then disconnect for a little bit and my windows 8 laptop can't connect. Perhaps investing in $99 version of Fire TV will fix this issue and able to listen privately via Bluetooth headphones. But for now, watching videos, accessing popular apps, Youtube, Netflex, HBO Go, Hulu, Vevo, etc...is all I need.", "verified": true, "helpfulness": "1/1", "author": "Michael P"}, {"rating": 3.0, "review": "I have to reset it often because it freezes up, has problems, or won't turn on.  Sling TV also does not play as well as playing it on your smart device or computer.  I think they need to still work the kinks out.", "verified": true, "helpfulness": "1/1", "author": "Rocky"}, {"rating": 5.0, "review": "This is fantastic in my opinion. I have been enjoying series, working out videos, and loving the huge selection of music I can listen to. I would highly recommend this if you enjoy the aforementioned.", "verified": true, "helpfulness": "0/0", "author": "lovinglife"}, {"rating": 5.0, "review": "I love it. I have a big back TV in my bedroom so I could not connect Fire TV. I connected fire tv to the HD TV in my living room. I have been sleeping in the livingroom since it came in the mail. It is very simple to connect. IT IS GREAT. I just need to find out if it can be connected to a non HD TV.", "verified": false, "helpfulness": "0/0", "author": "lili"}, {"rating": 5.0, "review": "awesome must get", "verified": true, "helpfulness": "0/0", "author": "LIA M ALMANZA"}, {"rating": 5.0, "review": "Enjoy Fire TV very much. Works beautifully!!!", "verified": true, "helpfulness": "0/0", "author": "Bruno LoPresti"}]