[{"rating": 1.0, "review": "I think it sucks! It needs to refresh every other minute. It took me 1.45hr to watch a 45m show.", "verified": true, "helpfulness": "0/1", "author": "Michael J Leyk"}, {"rating": 5.0, "review": "I got the Fire Stick as a birthday gift from my son and family! I am really enjoying it . It is easy to hook and easy to use!", "verified": true, "helpfulness": "1/1", "author": "Debra Phelps"}, {"rating": 5.0, "review": "This is an amazing device....if you have Prime you should have this.When our cable contract is up we will be replacing it with this device. For the price of Prime we can watch all the movies we want for a fraction of the cost for 300+ channels we don't watch.The kids already love and use Prime more than watching their TV's so this will just make a great addition especially for when we travel out of town to use in hotels.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Wish it had more tv shows", "verified": true, "helpfulness": "0/0", "author": "cory sagnella"}, {"rating": 5.0, "review": "Love it.  We just got rid of cable and there is so much to see.  And I don't watch a lot of tv", "verified": true, "helpfulness": "1/1", "author": "deanna farrand"}, {"rating": 5.0, "review": "Great prduct.  No streaming issus like I get with google", "verified": false, "helpfulness": "1/1", "author": "Casey Whitelaw"}, {"rating": 5.0, "review": "Wow, what a great little device.  Installed easily and now I have Prime and Netflix in addition to my other sites on my Internet TV.  Bravo Amazon!", "verified": true, "helpfulness": "1/1", "author": "C. A. \"Cathy\""}, {"rating": 5.0, "review": "This product is great even if your tv has some of the same apps.  It comes on instantly and the navigation is wonderful.  It is short a few apps but maybe I don't need them anyway.  I have downloaded the app for my phone to control the Fire Stick and it works great.", "verified": true, "helpfulness": "1/1", "author": "Dale Fossen"}, {"rating": 1.0, "review": "I have to Roku's already, they are much better period. Biggest difference is with Amazon Fire you are limited to 1 pay/rental movie option.....Amazon. No Vudu or RedBox etc.Fire frequently disconnects me from Hulu and my Wifi. My wifi is 5 feet away. Have none of these issues with any Roku even the 6yr old one.", "verified": true, "helpfulness": "0/1", "author": "40squirm"}, {"rating": 5.0, "review": "We can't imagine not having it!!!!", "verified": true, "helpfulness": "1/1", "author": "Jean"}]