[{"rating": 5.0, "review": "Awesome. Simply awesome. Easy to set up, and easy to use. Perfect for me. There are several excellent streaming systems out there, but this one is the best for me. I'm not a huge TV watcher or game player, but I do like the option to watch a show or a movie, and the choice (rather than paying for everything, most of which I don't use, a la the major cable companies) and to occasionally download and play a game on the TV, rather than my phone or Kindle. (not that that isn't fun, too.) Thank you, amazon. I have cut the cord. You have saved me 100 bucks a month...and more!", "verified": true, "helpfulness": "0/0", "author": "Kevin M. King"}, {"rating": 5.0, "review": "I have Roku on my living room also, but I love the Fire TV stick. It is very easy to connect and portable so I can move it to my bedroom TV if I want to very easily and not have to purchase an extra streaming stick. It seems faster than the Roku but it seems like the Roku has more channels. However, it has all the channels that I want to watch and a few that Roku does not have. Great product.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/1", "author": "edward leddin"}, {"rating": 1.0, "review": "If I could give it zero stars I would. Constant connection issues even when our Wi-Fi is screaming. Wouldn't recognize my account info. Just ordered Roku 3. Hope it performs better than the stick.", "verified": true, "helpfulness": "0/0", "author": "warren hunt"}, {"rating": 4.0, "review": "All ok but last night either you were doing something but was not working right however, now it's just fine thanks glad I got it have recommended it to others.", "verified": true, "helpfulness": "0/1", "author": "Jan Hinson"}, {"rating": 1.0, "review": "Won't stop buffering. Slingtv doesn't work great with this item. Still waiting for HBO Go.I have Comcast, and this won't work with HBO Go. I wish they would have told me that before I bought it.", "verified": true, "helpfulness": "0/0", "author": "James K."}, {"rating": 5.0, "review": "Arrived as expected. Connected to my wifi without issues and the kids were able to use it with very little instruction. So much content on demand. Love it.", "verified": true, "helpfulness": "0/0", "author": "R. Earl \"R. Earl\""}, {"rating": 3.0, "review": "I purchased this at the time of launch and SOLELY for the use of PLEX. It had a few bugs which rendered it useless for using plex. It wouldn't not play any movies after 5 secs of click play. Yes, I setup everything correctly. I have the chrome, roku, HTPC, and tablets all setup and PLEX works great on them but not on the Fire stick. As of today, it's working fine but not perfect. Still a buffering and lag issue. Waiting for a patch fix of some sort.", "verified": true, "helpfulness": "0/0", "author": "chick3ndude"}, {"rating": 4.0, "review": "I love my fire stick. Love getting all the channels I miss.", "verified": true, "helpfulness": "0/0", "author": "Grammy"}, {"rating": 5.0, "review": "Works great. Just plug it into any HDMI on TV, install batteries in remote and you are set up. No  need to find a place to set a player, no wires. Love the stick. Fast download, streams great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]