[{"rating": 5.0, "review": "It's better than a seashell. It is very easy to use. We like that we do not have to go through our blue-ray player to watch Amazon Prime TV since the new TV we bought (although it said it was a smart TV) does not connect to Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"mountain reader\""}, {"rating": 5.0, "review": "I love, love, love the Fire TV stick.  I love being able to easily access Netflix and Amazon Prime content.  Plus, they have a bunch of other cool free channels you can subscribe to like a workout channel.  My favorite thing about this is I can start watching something on my Kindle in bed and then move to the couch and immediately have the show play from the same place.  We have a Roku too, and I don't notice much difference between them.  The reason I like the Fire better is simply because of the way it works with my Kindle.", "verified": true, "helpfulness": "0/0", "author": "Kris10"}, {"rating": 5.0, "review": "Love the device . Easy to setup and use.", "verified": false, "helpfulness": "0/0", "author": "David H. Skyers"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Diane Potter"}, {"rating": 5.0, "review": "works just fine.", "verified": true, "helpfulness": "0/0", "author": "K. Henry"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "robdady"}, {"rating": 5.0, "review": "Works great and easy to use. If you don't have a SMART TV and your current TV is equipped with a HDMI connection then this is certainly a great alternative to buying a new TV.  For the price you really can't beat it.", "verified": true, "helpfulness": "0/0", "author": "Lisa Combs"}, {"rating": 5.0, "review": "I am so happy with my purchase and will definitely recommend it to my friends.- With the 5 dollar app Airplay/DLNA, you can also use the airplay feature on your iphone/macbooks to get connected to your firetv", "verified": true, "helpfulness": "0/0", "author": "Reza Arastoo"}, {"rating": 5.0, "review": "Works perfect! I absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Jeri Thomas"}, {"rating": 4.0, "review": "Even a dinosaur fumbling my way through the 21st Century can make it work.", "verified": true, "helpfulness": "0/0", "author": "Randy Cyrus"}]