[{"rating": 1.0, "review": "I have enjoyed my fire-stick for 6 months WITH Google Gigabit (Overkill) WiFi with the occasional dropped connection But tonight was the last straw. MY girlfriend and I have been waiting for 6 months to watch a program that is only on AMC which is why we chose the fire-stick It has AMC programing. We watched AMC for 45 min no problem prior to the pilot. When our program finally came on, the pilot of a heavily advertised new program  we got excited for SIX minutes before it dropped the connection. For those of you who don't know it takes at least 10 minutes to unplug reboot and get back to the place it just cut off. To be fair The 99.00$ model has a ethernet port that might rectify all this but I did give them hard earned money to have a product that works 100% of the time. IT DIDN\"T!!!! You wouldn't by a car that only worked 70% of the time.Signed Bridezilla", "verified": true, "helpfulness": "1/2", "author": "David L. Gordon"}, {"rating": 5.0, "review": "Easy instructions to follow", "verified": true, "helpfulness": "0/0", "author": "Margaret Ortiz"}, {"rating": 5.0, "review": "Installs easy, quick setup & works great", "verified": true, "helpfulness": "0/0", "author": "Lynne Rushing"}, {"rating": 5.0, "review": "Love it so much I had to get another.", "verified": true, "helpfulness": "0/0", "author": "S. Sigurdsson"}, {"rating": 1.0, "review": "If I had known the fire stick would rarely connect to wifi I definitely would not have purchased it. It's basically useless even though I have high speed internet connectivity.", "verified": true, "helpfulness": "0/0", "author": "Shanyone"}, {"rating": 5.0, "review": "LOVE LOVE LOVE THIS DEVICE! ITS CAN BE HIDDEN IN THE BACK OF UR TV AND THERE R NOT HARDLY ANY WIRES SHOWING1 U GET IT ALL AND U CAN TAKE IT WITH ON THE GO!", "verified": true, "helpfulness": "0/0", "author": "scout"}, {"rating": 5.0, "review": "1st class, easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Sam Mahler"}, {"rating": 5.0, "review": "Workes perfect", "verified": true, "helpfulness": "0/0", "author": "Philip Olthof"}, {"rating": 5.0, "review": "Just awesome", "verified": true, "helpfulness": "0/0", "author": "Kevin Ishikawa"}, {"rating": 5.0, "review": "Seriously. If you have Prime, get yourself a gawd damn Fire TV Stick! This thing rocks! Much better and easier to use than Chromecast and full screen mirroring capabilities. Watch videos on demand through Prime and then watch your home movies and then some through your phone or tablet with screen mirroring.", "verified": true, "helpfulness": "0/0", "author": "Josh E. Taylor"}]