[{"rating": 5.0, "review": "Love it. Worked as described.", "verified": true, "helpfulness": "0/0", "author": "Hitz \"Master Chief\""}, {"rating": 3.0, "review": "NOt as many movies as advertised, and what are there are older then dirt.", "verified": true, "helpfulness": "0/0", "author": "Frumpy864"}, {"rating": 5.0, "review": "Since receiving the Firestick, don't use the Chromecast much anymore. Does seem to stream better than the other stick, might buy another one for one of the other tv's.", "verified": true, "helpfulness": "0/0", "author": "Dewey Rhoades"}, {"rating": 5.0, "review": "Everything I always wanted in TV viewing without the huge monthly bill.", "verified": true, "helpfulness": "0/0", "author": "Kathleen McCoy"}, {"rating": 5.0, "review": "It is awsome!!!", "verified": true, "helpfulness": "0/0", "author": "iliana"}, {"rating": 5.0, "review": "Great device. Love all the options.", "verified": true, "helpfulness": "0/0", "author": "michael pla"}, {"rating": 1.0, "review": "I'm not satisfied with this product. More than one time it developed trouble with the wireless service. The result was to require identifying the wireless network, reissuing the encryption password and reestablishing the connection. On Amazon service advice I installed the short HDMI adapter which helped  but did not completely eliminate the problem.", "verified": true, "helpfulness": "0/0", "author": "George R. Ahearn"}, {"rating": 4.0, "review": "Easy to use, perfect", "verified": true, "helpfulness": "0/0", "author": "Jodie Allen"}, {"rating": 5.0, "review": "I ordered this because I like to try all kinds of new tech.  I already owned an Apple TV and a Chromecast so I was skeptical of my need for another gadget of this type and figured if I wasn't wowed, I'd simply return it.  I was INCREDIBLY impressed.  So much easier to use than my Chromecast and I hardly use my AppleTV anymore.  Definitely worth $40.", "verified": true, "helpfulness": "0/0", "author": "R. W. Foutty \"RW\""}, {"rating": 1.0, "review": "charges for watching dated films is a rip off.  I am sorry I bought Amazon's Firestick.  Netflix is much prefered.  jb", "verified": true, "helpfulness": "0/0", "author": "John M Buckholz DPM"}]