[{"rating": 5.0, "review": "Replaced cable and it works great.", "verified": true, "helpfulness": "0/0", "author": "Andy Palovich"}, {"rating": 5.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "aptao"}, {"rating": 5.0, "review": "We love it!!", "verified": true, "helpfulness": "0/1", "author": "ppfield"}, {"rating": 4.0, "review": "Excellent watch movies whenever...", "verified": true, "helpfulness": "0/0", "author": "craig collins"}, {"rating": 5.0, "review": "Easy to set up and works perfectly....I have been loving every minute of it!", "verified": true, "helpfulness": "0/0", "author": "William Horrell"}, {"rating": 4.0, "review": "Mine was one of the original orders,  so it took a few months.  I'll go over the good and bad.Bad first...I don't like that you need a power cord hooked up to it. If that's the case,  the pics should show that.I don't like the shape of the power cord's end. It is oversized and is difficult to fit in a power strip unless it's on the end.If you don't have Prime, there isn't a point really.  This is the big selling point of this over its competitor.The shape and size of it can make it difficult to fit into a hdmi spot on your TV depending on space between your openings.  I, luckily,  have a side slot,  so it works well there.  However, if it's wedged between two others,  it may not work.The good. ..I love the small remote.  It's simple and comfortable.The phone app for it works ok, no complaints.The channels work well. I don't have cable,  and this is enough for me. Hulu should have a trial offer with Amazon on this thing,  but that's no biggie.I like that there is room for additions. I added XBMC to mine,  so I'll never need anything more.The wrapup... it's a great streamer.  I don't like the people's review of the $19 price.  That was a one time deal.  My opinions are based on it as if it was purchased today.  I have a Roku and that does just as good a job.  The Roku I have has a spot for my USB, but this doesn't.  However,  this was a third of the price.  It offers the same apps as the Roku at a better price.  If you get a Chromecast,  you get lag times and have to use another device to actually stream it. For the money,  this thing rocks! For $40, it's a great deal.", "verified": true, "helpfulness": "2/2", "author": "Robert L. Amos III"}, {"rating": 5.0, "review": "Works so well easy set-up & so much to pick from !!!", "verified": true, "helpfulness": "0/0", "author": "Dennis Anderson"}, {"rating": 5.0, "review": "After purchasing a Google chromestick that would not work even after repeated attempts. I purchased the fire stick and it works wonderfully. Very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "W Madsen"}, {"rating": 5.0, "review": "Great item!", "verified": true, "helpfulness": "0/0", "author": "Bryce Craig"}, {"rating": 2.0, "review": "It is alright. I have Roku and like it much better because of the channels offered. While fire TV is not hard to use it is not very user friendly and will be returning the product this week.", "verified": true, "helpfulness": "0/0", "author": "Karine"}]