[{"rating": 4.0, "review": "Software feels a bit unstable, but not too bad (early generation).I'm disappointed at the lack of Google Play movies and tv support (though not surprised).  Until this supports Google or Google supports Amazon (or I want to bother with a Roku), I have to have two devices.My real issue is just how the interface is designed for AMAZON so heavily.  It feels like you have to go out of your way to do anything unless you focus on Amazon services.  Netflix, Hulu+, etc; they really feel more like afterthoughts.", "verified": true, "helpfulness": "0/0", "author": "Steven J."}, {"rating": 5.0, "review": "This has performed better then I expected. Super easy to install. Great picture. Fast.", "verified": true, "helpfulness": "0/0", "author": "Douglas W. Jones"}, {"rating": 4.0, "review": "Nice product for good promo price.", "verified": true, "helpfulness": "0/0", "author": "Mr. Nicolas M. Degiovine"}, {"rating": 5.0, "review": "Oh so easy to install and so much better than using the Wii or blue ray players.  I think I've died and gone to heaven!", "verified": true, "helpfulness": "1/1", "author": "sfeifer"}, {"rating": 3.0, "review": "I was a little disappointed. We don't have high speed internet and some movies/ shows constantly are buffering. A lot of time internet connection is a problem. I have to reinstall several times a week. However, if we had high speed internet, the fire stick would be awesome.", "verified": true, "helpfulness": "0/0", "author": "Wendy Clark"}, {"rating": 5.0, "review": "Met my expectations. Have been enjoying it daily.", "verified": true, "helpfulness": "0/0", "author": "Dave Wannemacher"}, {"rating": 5.0, "review": "I love it!  It's easy to use and presents lots of programming opportunities.", "verified": true, "helpfulness": "0/0", "author": "John J. Rozzi"}, {"rating": 5.0, "review": "Talk about easy peasy! Even I, a technoloogical idiot, was able to have this up and running in a matter of minutes. Love the wealth of material I can delve into at the touch of a remote. The best!!", "verified": true, "helpfulness": "0/0", "author": "Ellen A."}, {"rating": 4.0, "review": "Amazon Fire stick is a great addition to anyone especially current Prime Members.  It turns any TV into a smart TV and allows you to watch great shows on the go.", "verified": true, "helpfulness": "0/0", "author": "Cornell Menafee"}, {"rating": 3.0, "review": "Great interface.  I wish this worked better for me but it is having issues with my wireless network.  I do not have issues with my PC hooked up to the same TV.  I have always had issues with Prime vs Netflix.  I am not sure but would guess how they buffer data.  I will continue to play with this in my house.  I have a Chromecast with no issues but would prefer the Fire TV Stick because of the interface.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}]