[{"rating": 3.0, "review": "I was hoping for an app or program for Laptop to broadcast screen using Fire Stick....only from phone......bummer", "verified": true, "helpfulness": "1/1", "author": "J. Young"}, {"rating": 5.0, "review": "A very good product, but I would have to suggest that you get the owners manual.", "verified": true, "helpfulness": "0/0", "author": "Terry Terrell"}, {"rating": 5.0, "review": "Was easy to setup and worked great.  We have a smart tv with the Amazon app on it as well as a Blu-Ray player with the Amazon app.  Both work slowly and are a little clumsy, but the Fire TV Stick is very responsive.  Very happy so far", "verified": true, "helpfulness": "0/0", "author": "John Selby"}, {"rating": 4.0, "review": "Great device for the price I got it. Snappy performance. Great selection of services and apps. Remote works well as it does the Android phone app. I removed one star, because during setup the stick would not connect to the remote. I followed the troubleshooting steps and was eventually able to set it up. The other shortcoming is that streaming video thru the amazon cloud is only up to 20 minutes. Streamming videos longer than that need the use of third party apps like allcast which is not that great. I whish amazon comes up with a better way to stream video from a phone or pc into the fire tv stick. All in all the fire tv stick is way better than chromecast and some what better than roku stick. For the $19.99 I payed this is the best streaming device. Buy it. Even for the current 39.99 is a deal.", "verified": true, "helpfulness": "1/1", "author": "G.V."}, {"rating": 4.0, "review": "Over all I'm very impressed with the Fire TV Stick. The only issue that I've run into is with the wifi connection. It connected very easily on initial setup, but 48 hours later, it wouldn't connect to the Internet. A quick power cycle of the device cleared the issue, and it's connecting correctly again.", "verified": true, "helpfulness": "0/0", "author": "Greg Hampton"}, {"rating": 5.0, "review": "very easy set up! got it when they had prime member offer for $19.99 totally worth $40 defiantly should have bought two!", "verified": true, "helpfulness": "0/0", "author": "Bryan P."}, {"rating": 3.0, "review": "Please advise if I can watch Netflix, hulu and other channels in eastern European countries like Ukraine and Moldova", "verified": false, "helpfulness": "1/2", "author": "Ravi"}, {"rating": 4.0, "review": "As an Amazon Prime member, I got an offer for early access to the new Amazon Fire TV “stick”, which is a small device which plug into an HDMI port on your HDTV. Since I’ve never been happy about my Apple TV, I decided it was worth a try.Here’s my experience.Unboxing was nice. Simple, clean packaging. Couple devices, cable, batteries.The Fire TV device doesn’t get power via HDMI, so it requires an external cable. The cabling is too short, and connector has the cable at the wrong angle. The cable is 4-5′ long and should be more like 7′. And the power plug looks like a AC/USB type connector, but the mini-USB portion is on the side, not the top, so it’s a hassle to plug into any power strip that has a bunch of existing plugs.Initial setup was simple. Plug it in, Fire TV tries to find the WiFi SSID, then enter the WiFI password.Fire TV initially tried upgrading software – this failed, and then told me to unplug/power-off.Another software upgrade attempt. Completed, rebooted.Another software upgrade; required another WiFi password with different keyboard. It seems that they changed the keyboard layout between versions of software. Of note, they changed how capital letters were entered.Fire TV was able to communicate with Amazon.com and it knew that this device was registered to my Amazon Prime account. Nice job by Amazon. Will be interesting to see what happens if I need to return/exchange the physical device to see if it updates the registration.The device is now working after 3 software updates.Introduction Video. Nicely done. Simple, easy to understand. Basically a walk-through of the remote, plus an ad to buy Amazon Prime.Fire TV includes integration with 5Gb of Google Drive. Was sort of surprised it wasn’t liked to an AWS S3 services, but I suppose this is because S3 isn’t really an en-user consumer service (eg. Google Drive, Dropbox, One Drive, etc.)FireTV comes with a simple remote. There is also a remote app for Android and Amazon Fire Phone (not yet available on iOS). This include the voice-activated features, which replace search. It may also have some cool console-level functionality for games.2nd Screen capable with Fire Tablet or FireTV app. I don’t have one of these devices, so I couldn’t test this.Have to “download” certain apps, such as NetFlix, Hulu Plus. Not sure how big the device is in terms of capacity and how many apps can be downloaded. After downloading a few, I suspect this is just a small chunk of code and most of it runs in the AWS cloud.Had to adjust the TV sizing for NetFlix – not auto-detecting the screen size or screen display settings. Was fairly simple – they gave you arrows on the screen and you just made sure they fit within the screen display.NetFlix login uses QWERTY keypad – yet another keypad for account entry (others were alphabetical). Sort of odd that Amazon doesn’t mandate any user-experience consistency.NetFlix navigation is different than on AppleTV – no concept of a “home” button – home button on FireTV (within NetFlix app) takes you all the way back to FireTV home screen.The games are decent. They aren’t high-end console quality, but most are free and seem to be of the quality of the early Wii games, which is good enough for young kids. And no extra consoles or controllers to buy.I’ve been playing with it for a couple days. After some of the initial setup hickups, it seems like a nice device. The responsiveness is better than an Apple TV, and the UI (while still clunky from the native remote), is still better than an Apple TV. Buying things off Amazon Prime, such as HD movies, is very simple and it’s great that they play immediately – vs the long download times from Apple. Makes the kids happy, especially during holiday breaks and bad weather.Overall I’d give it a thumbs up and a good value for under $40. Hopefully they release the iOS remote soon and I’ll be a much happier user.Nicely done Amazon.", "verified": true, "helpfulness": "0/0", "author": "Brian R. Gracely"}, {"rating": 4.0, "review": "The number of apps available are limited. Need to add religious apps. With the exception of the fore mentioned it met my expectations. A great device. I expect that new apps/channels will be added in the near future.", "verified": true, "helpfulness": "0/0", "author": "Ellsworth Hackshaw"}, {"rating": 4.0, "review": "Pros: - Faster than chromecast - remote - Good initial price for Prime members - Good Specs than chromecastCons:  - No tab casting or mirroring of any browser to see videos from other websitesI can say this is faster than the chromecast for watching Youtube or Netflix, i can see one issue where it will not stream the youtube videos as cast from the App sometimes.It would be great if they add the browser casting like the chromecast as an update from software.Over all good one.", "verified": true, "helpfulness": "0/0", "author": "Vijay Chaganti"}]