[{"rating": 4.0, "review": "The fire stick is awesome", "verified": true, "helpfulness": "0/0", "author": "lavaughn lewis"}, {"rating": 5.0, "review": "Totally great.  I use the USB power from the TV, and it sufficiently powers the stick.  No wires, just great content.", "verified": true, "helpfulness": "0/0", "author": "Naval Aviator Instructor"}, {"rating": 5.0, "review": "Easy to use - plug it in and start watching shows.  Did have a small probably trying to figure out how to use closed caption on Netflix - but turns out it was a Netflix setting and not the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Glenda L Funk"}, {"rating": 1.0, "review": "If zero stars were an option, that's exactly what this product would've/should've received. After 3 Fire sticks, we're sticking/stuck with cable as the sticks just don't want to work for more than 1 week, 2 days and 2 hours respectively. Maybe version 2.0 will actually allow me to \"cut the cord\", but the Fire stick simply isn't ready to be sold to anyone not willing to be Beta testers and that's not me.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It works great !  Lots of things to watch for free . I recommend this to any one who travels or spends time away from home.", "verified": true, "helpfulness": "0/0", "author": "John N."}, {"rating": 4.0, "review": "It's good but it needs a full size remote. The little itty bitty remote keeps getting lost. Also, it seems to suck up a lot of bandwidth. ESPN3 keeps disconnecting time and again.", "verified": true, "helpfulness": "0/0", "author": "RawKing"}, {"rating": 5.0, "review": "Easy to use. Great programming.  Also got the remote app for my phone.  Amazon Prime really makes it perfect.Thanks!", "verified": true, "helpfulness": "0/0", "author": "Carter M. McKaughan"}, {"rating": 4.0, "review": "We love the fire stick!  Easy to use", "verified": true, "helpfulness": "0/0", "author": "Noel Bahri"}, {"rating": 5.0, "review": "Simple to hook up, easy to use....awesome!", "verified": true, "helpfulness": "0/0", "author": "Joseph C. Federici"}, {"rating": 2.0, "review": "Not enough new stuff, mostly more than 3 years old, also tends to \"buffer\" several times during each show, sometimes stopping all together , many \"errors\" saying cannot access at this time, and very tiring much of the time. Whereas on the same internet access, the appletv adapter has none of htese issues.. We tried them both on several systems, and sorry firestick, you are not even a close second.", "verified": true, "helpfulness": "0/0", "author": "Karen A. Poore \"reada-holic\""}]