[{"rating": 1.0, "review": "This product could be great if I could log onto my network. It tells me it can't log onto my network. then it tells me it can't contact Amazon....Wish there was a telephone # i could call for support. I've done everything it says to do on the amazon.com/devicesupport web site. No luck. If I don't get hooked up soon. I will be returning this item. :-(", "verified": true, "helpfulness": "0/1", "author": "Dara Poche"}, {"rating": 4.0, "review": "Works perfectly", "verified": true, "helpfulness": "0/0", "author": "Michael Walker"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Angela Dorf \"Angela\""}, {"rating": 5.0, "review": "Cutting the cord from cable left us with few options for entertaining our kids in their room. ChromeCast was OK but it did require us to constantly beam content from our desktop, tablet, or smartphone. The FireStick has an app store, a dual core processor, and a remote! My 7 year old wrote a poem about it, that's how you know it's good!", "verified": true, "helpfulness": "0/0", "author": "Patrice"}, {"rating": 5.0, "review": "Love this product. Much more efficient than Google chrome cast which worked well for a while then the contraption started to get disconnected with the weight of the wire. This stick is easy to connect, no tugging under the weight of the wire, lots of free movies through prime and works beautifully.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"ss\""}, {"rating": 5.0, "review": "I love it! It is so awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Lasonja Brown"}, {"rating": 4.0, "review": "I would have given it  4 1/12 stars if possible. The only complaint is the response to the remote. The TV doesn't always respond to the key that's pressed. There weren't instructions where to point it . I've aimed it in the direction of the fire stick, at the LED strip and all over the screen. It doesn't make a difference. It takes a looooong time to navigate because of this. Other than that, it's great!!!!", "verified": true, "helpfulness": "0/0", "author": "original shopoholic"}, {"rating": 5.0, "review": "So easy to set up only few steps no problem wit charger or stick lots of  room for stick even without extender ( thanks tho) doesn't not block other cords or slots like other reviewers mentioned", "verified": true, "helpfulness": "0/0", "author": "chevze sherwood"}, {"rating": 5.0, "review": "Love it! The only complaint that I could possibly have is that the black part of the stick made it slightly difficult to plug it into my tv because the port on my TV is recessed slightly. But other than that, I love all of the features, and that it works so seamlessly with the aps! Perfect, and I would say its better than the Google Chromecast (which I have one of, and have loved so much!). The remote is great, and I appreciate that I have the option to use my phone as a remote in case I lose mine. :). Very happy with my purchase!", "verified": true, "helpfulness": "0/0", "author": "Tina"}, {"rating": 1.0, "review": "HBO go is slow and barley works w wifi at 15. Yet prime TV works just fine. Funny how that works.", "verified": true, "helpfulness": "0/0", "author": "Doug"}]