[{"rating": 5.0, "review": "Awesome tool for tv, it's very small and it works great, I just wished I would have bought more because it was on sale! Price is not bad at regular price. It's also good to give as a gift.", "verified": true, "helpfulness": "0/0", "author": "Mosita"}, {"rating": 1.0, "review": "The TV Stick works fine. It's Amazon Prime Whats a ripoff. Received Prime as a gift. Amazon would not refund the cost buyer of the gift or to me. I could ndodt Use my streaming player I had so I had to buy a Fire Stick. Amazon Prime is a mess and when you find something you want t watch you find it's not free and You have to Pay for It. I have Amazon gift cards but I will trade them for Walmart gift cards.", "verified": true, "helpfulness": "0/0", "author": "James Conrad"}, {"rating": 3.0, "review": "Works good, was disappointed that it had to be plugged into an outlet also. It did not mention or show the cord when I purchased it.", "verified": true, "helpfulness": "0/0", "author": "BBQ Guy"}, {"rating": 2.0, "review": "The firestick only works if it is connected to my TV.  It set up properly and looks nice.  It will not work when connected to the HDMI port on my Onkyo surround sound amplifier.  I plugged it into a known working port just to be sure it wasn't a setup issue, but the amp still does not recognize a signal.  If anyone has a solution I would appreciate it.", "verified": true, "helpfulness": "1/1", "author": "Pat Dougan \"Pat Dougan\""}, {"rating": 5.0, "review": "Preparing to cancel my Netflix, This is so handy and easy to use, love it!", "verified": false, "helpfulness": "0/0", "author": "Kimberley Mundil"}, {"rating": 5.0, "review": "Very nice device. I have a Roku (for more than 2 years), and bought the fire TV stick so I can have Internet TV on another set. I like it more than my roku, it is faster, and the streaming seems to not have the occasional buffering that my roku does, although it was minor. I really like that I can view my Amazon cloud photos through the device.", "verified": true, "helpfulness": "0/0", "author": "amzbuy"}, {"rating": 4.0, "review": "I really do like the Fire TV Stick. We were streaming pretty much everything we watched through the computer so having the ability to use the remote is very nice. The shows and movies load fast. Reception is great. We are very much novices and this system is very user friendly.  i also purchased the Fire TV box for our main TV. That has voice search capability but I can use my smart phone for voice search on the Fire Stick via a free app. I gave it only 4 stars because it would be nice if there was a specific category to search free videos Prime and/or others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Well, I like amazon prime, but I thought this would be \"wireless\" in more ways than one.The unit  needs to be plugged in so creates a problem when the TV is  wall mounted.I imagined that the remote would need to be plugged in , but not the TV receiver unit itself.", "verified": true, "helpfulness": "0/2", "author": "carole lee"}, {"rating": 5.0, "review": "Best thing since bubblegum or white bread...absolutely love it", "verified": true, "helpfulness": "0/0", "author": "Bayonne Biatch \"Sexy Grandma\""}, {"rating": 5.0, "review": "I have had this about a week.  I am an Amazon Prime member and I have only watched movies or TV on my iPad.  I love this fire stick.  I don't need all the bells and whistles of the whole fire tv $100 box.  This is perfect.  I can move it to my kitchen tv or living room tv and watch wherever I am.  Just plug it in and start watching.  I pick movies on my computer and save them to the watch list, then the watch list shows up no matter which TV it is plugged into.  I just pick a movie and start watching.  Also, the remote is very basic so it is easy.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Huston"}]