[{"rating": 5.0, "review": "This is probably the best product we have ever received! We got it as a housewarming gift, and have cancelled all cable and satellite services to use this. Amazing. HUGE fan!", "verified": true, "helpfulness": "0/0", "author": "Kristin"}, {"rating": 5.0, "review": "I love this thing!  There is always something to watch.  And it's simple to use- even my 6year old figured it out!  With Amazon Prime it's just perfect for us!", "verified": true, "helpfulness": "0/0", "author": "R. Ruskey"}, {"rating": 4.0, "review": "Only one thing is denying this product 5 Stars - it lacks NHL Game Center.Other than that, it is a marvelous device that we use quite often.  My only other gripe is that you can not combine music with the photos slideshow.Still, my two peeves are a simple operating system update away, and I have every expectation that Amazon will continue working to make this device the best in class.", "verified": true, "helpfulness": "0/0", "author": "Ed Mann \"Ed\""}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was a piece of cake to set up.  I already have a smart TV in the family room, so getting the TV stick for the bedroom was a no brained.  Great job Amazon.", "verified": true, "helpfulness": "0/0", "author": "luline"}, {"rating": 5.0, "review": "Simply to connect and use.  Totally worth the investiment", "verified": true, "helpfulness": "0/0", "author": "Janet Lee Guzman \"Jan\""}, {"rating": 5.0, "review": "A Must have. Amazon Prime is great. I love Flappy Birds Family, Toy Story: Smash It!, Monsters University.Great games", "verified": false, "helpfulness": "0/0", "author": "M. Styles"}, {"rating": 3.0, "review": "When it connects, it is great! It has an easy to navigate menu system, good app selection, however, getting and maintaining that WiFi connection is a bit of an issue. Using a wireless repeater in the same room as the TV and FireTV Stick, the device reports only a \"good\" signal where other devices have excellent signal. I have only installed 1 game, and after every play session the FireTV Stick looses connectivity and has to be rebooted. If the TV is off for over 12 hours, there are difficulties getting it to reconnect to WiFi. Streaming video is great quality, really shows the benefit of having the additional memory and faster processor from my older media center, which is seriously being reconsidered due to the connectivity issues", "verified": true, "helpfulness": "0/0", "author": "bookewyrmm"}, {"rating": 5.0, "review": "I Loce this Fire TV Stick", "verified": true, "helpfulness": "0/0", "author": "barbara kelly"}, {"rating": 5.0, "review": "Excellent product, works great!", "verified": true, "helpfulness": "0/0", "author": "J. kerson \"Coffee Breath\""}, {"rating": 5.0, "review": "This is fantastic.  Currently I just have Netflix and Amazon Prime but that's more than enough and it works wonderfully.  It was very easy to set up, too.  I highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Joanie"}]