[{"rating": 5.0, "review": "I already have the Roku, which I love , but got tired of in unhooking and hooking up to carry with me.  Was going to order the Roku Stick, but after reading I decide to purchase the Fire TV Stick.  Loving it, like the children Apps, for my nephew.  Probably will order the controller for him.  I ordered the mini extender, so I don't have to worry about the adapter at hotel.  So now I can leave the Roku in it place and carry the Fire TV Stick with me.  Win, Win.", "verified": true, "helpfulness": "0/0", "author": "Cynq1"}, {"rating": 5.0, "review": "I'm loving my Amazon Fire Stick! I stopped using cable tv about 8 months ago, and have been watching online shows on my MacBook Pro computer with the 15\" screen. I waited on buying the Roku and other sticks because I didn't want to spend the $100 for them, so when I saw the Fire Stick available for like $40, I thought I'd try it. It works great- reception and streaming is good- You don't have to wait awhile for shows to stream or download. It's what I was hoping for and got!", "verified": true, "helpfulness": "0/0", "author": "paige c"}, {"rating": 5.0, "review": "Fast shipping.....very happy with product.", "verified": true, "helpfulness": "0/0", "author": "Dana Winkey"}, {"rating": 5.0, "review": "Easy set up. Love having access to both Netflix and Amazon Prime instant video! I got a bit confused connecting to a home theater system, but once it was set up correctly, it worked great and still does after several weeks. It really needs more documentation especially on the proper set up when using a sound receiver instead of the TV.", "verified": true, "helpfulness": "0/0", "author": "BluiizCA"}, {"rating": 5.0, "review": "Loved it !", "verified": true, "helpfulness": "0/0", "author": "Tani"}, {"rating": 4.0, "review": "works great, easy setup", "verified": true, "helpfulness": "0/0", "author": "bruce hardy"}, {"rating": 5.0, "review": "Love this! I was still kicking it old school and connecting to Netflix and other apps using my Wii. This provided the solution I needed and so far it works like a gem. I was a little bummed because a few days after I purchased mine, Amazon had the sale day for Prime customers and this was $15 off the price I paid. Almost bought another because of the sale, but didn't for now...", "verified": true, "helpfulness": "0/0", "author": "Michele T"}, {"rating": 4.0, "review": "Good Streaming stick. Interface is a little crowded, but overall I am pleased with the performance so far", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "Fire TV Stick is great! The only possible issue is it sometimes will drop the signal. I found that if you change your router channel to a more clear one, the issue is almost nonexistent. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "SR"}, {"rating": 1.0, "review": "bogus. You need WiFi and I was nor told that.", "verified": true, "helpfulness": "0/2", "author": "Kenney Slatten"}]