[{"rating": 5.0, "review": "It was easy to use. I had a few minor problems but nothing serious.I had a hard time fitting the stick into my HDMI port but I just switched my cable and the stick (with the extender) and it went in fine.I ended up returning the FireStick but ONLY because my wifi kinda sucks and I just ended up buying a MHL Micro USB to HDMI adapter cable for my phone so I can still watch Hulu and other programs with my phone.i LOVE the idea of the Firestick but it just didn't work for me.", "verified": true, "helpfulness": "0/0", "author": "E. Araujo"}, {"rating": 5.0, "review": "Love it. Amazon prime movies and since I have a Netflix subscription it handles that too.", "verified": true, "helpfulness": "0/0", "author": "Clinton Larue"}, {"rating": 5.0, "review": "It's been great.", "verified": true, "helpfulness": "0/0", "author": "Casey P. Ontiveros"}, {"rating": 5.0, "review": "The easiest thing I ever had to install and best options. Far better than Apple TV", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 5.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "Kathy Lockard"}, {"rating": 5.0, "review": "I have a slow internet connection, but with this, I can still watch all my favorite programs. I just add them to my wish list, and they are pre-buffered before I start.  Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Nancy G"}, {"rating": 2.0, "review": "The reviews stating that you don't need anything other than the stick to access free TV & Movies are completely false. You must either be a Prime member and/or have a subscription to Netflix, etc. THERE ARE NO FREE TV SHOWS OR MOVIES.", "verified": true, "helpfulness": "0/2", "author": "Lana's Nana"}, {"rating": 1.0, "review": "I can't get a signal.  So it's useless to me.", "verified": true, "helpfulness": "0/0", "author": "PATRICIA"}, {"rating": 3.0, "review": "I have a love hate relationship with this device. It works. If you can get the battery cover off to put the batteries in. I'll hate having to replace them. The battery cover does not slide off easily! It took me longer to put batteries in than to set it up.", "verified": true, "helpfulness": "0/0", "author": "jlehr"}, {"rating": 4.0, "review": "Really liked the Fire TV Stick. Easy to use and took only minutes to install. I wish it would turn off without me having to unplug each time after use.  I also gave it 4 stars because it freezes from time to time. Only way to make it work again is to unplug and plug.", "verified": true, "helpfulness": "0/0", "author": "amazonjunkie \"amazonjunkie\""}]