[{"rating": 5.0, "review": "Can't be beat for the money! No problems to date and good performance after a month of use.", "verified": true, "helpfulness": "0/0", "author": "James Yarbough"}, {"rating": 5.0, "review": "One of the best things I have purchased in a long time!", "verified": true, "helpfulness": "0/0", "author": "Theresa Lovette"}, {"rating": 5.0, "review": "Better than Chromecast because of remote.  If you have a Prime account, it's a must have.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super fast WiFi connection puts my Blu Ray Smart TV connection to shame.", "verified": true, "helpfulness": "0/0", "author": "Michael Kelter"}, {"rating": 5.0, "review": "Now that they have captive portal support, it's a great travel device.  I normally use this at home to watch Netflix, PBS, Smithsonian channel, and Amazon prime.  Not as fast as my Fire TV, but sufficient for my needs.I recently used this at a hotel while traveling, and it allowed me to watch all my shows without needing to lug around a laptop or tablet.I don't use the voice feature on my Fire TV, so don't miss that feature.", "verified": true, "helpfulness": "0/0", "author": "fuzzy"}, {"rating": 3.0, "review": "It's waaaaaay too slow.", "verified": true, "helpfulness": "0/0", "author": "Thomas Hays"}, {"rating": 5.0, "review": "Wish I had tried it before. Simple, Quick and works great on my wireless system. Best buy.", "verified": true, "helpfulness": "0/0", "author": "Debra R.. Fulton"}, {"rating": 5.0, "review": "My daughter loves it!  Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Christian P. Pocock"}, {"rating": 5.0, "review": "Great product. Love how it syncs with desktop and how you can put pictures and music in the cloud and use the stick to show or hear it on big TV.Very satisfied with this product and Amazon in general.", "verified": true, "helpfulness": "0/0", "author": "R. A. Romero"}, {"rating": 5.0, "review": "LOVE IT!!!! I use this in my studio which is separate from our home. No cables, just wifi. I'm able to listen to Pandora, watch a movie from Amazon and Netflix, TV and more, so many options. Perfect for an artist to work and be carried away from the world.", "verified": false, "helpfulness": "0/0", "author": "RedMolly \"Artist: Painter and Clay Sculpture\""}]