[{"rating": 5.0, "review": "Can't say enough, buy it.Good selection of free and pay movies & TV.Take it on the road when you travel.I've never messed with the games and I still love it", "verified": true, "helpfulness": "0/0", "author": "T. Tyler"}, {"rating": 2.0, "review": "Spectacularly awful Hulu and Youtube apps.  The former studders & reboots constantly, the later just breaks a few minutes in.  I've had the stick since it came out and I'm sick of it being so terrible.  No apps should be in their store that don't work, but I find plenty that are broken out the box.", "verified": true, "helpfulness": "0/0", "author": "Tanisha Hamiter"}, {"rating": 3.0, "review": "I've only had it for a couple of weeks but I'm not super impressed.  It is basically a suped up Netflix. It doesn't stay connected to my Wi-Fi very well either.", "verified": true, "helpfulness": "1/1", "author": "AMANDA COLE"}, {"rating": 5.0, "review": "Easy to install and setup.  Works great.", "verified": true, "helpfulness": "0/0", "author": "Gustavo Gomez"}, {"rating": 1.0, "review": "I plugged it in and tried to watch amazon instant video but the streaming was poor. The movie would play for 20 seconds and then the screan would go black for 3 seconds over and over.", "verified": true, "helpfulness": "0/0", "author": "Pattie Shreiber"}, {"rating": 1.0, "review": "If I could rate it lower than one star I would. What a pile of garbage! I got on Friday set up Saturday haven't been as be to watch show yet. I can watch movies on my tablet sitting right next to TV yet it keeps losing connection. Turd turd turd DO NOT BUY!!!!!! Thanks for the worst product ever amazon", "verified": true, "helpfulness": "2/2", "author": "W.B.Bacon"}, {"rating": 5.0, "review": "Loving the ease of use", "verified": true, "helpfulness": "0/0", "author": "Tammie P. Wray"}, {"rating": 5.0, "review": "Excellent  product", "verified": true, "helpfulness": "0/0", "author": "edgar livingstone"}, {"rating": 5.0, "review": "Perfect for our upstairs bedroom tv. No cable and it is excellent!  UI is extremely easy to navigate, my 1yr old has no issue! It does require an HDMI port, I originally thought it required a USB port.", "verified": true, "helpfulness": "1/1", "author": "Jeremy"}, {"rating": 1.0, "review": "I dislike the device and especially the accompanying advertisement.As a prime member, in Costa Rica, no where in advertising this item did they say that videos etc are not available outside U.S., making the device useless.", "verified": true, "helpfulness": "0/0", "author": "KC4Y \"Jack N. Whipkey\""}]