[{"rating": 5.0, "review": "what an inexpensive, efficient, beautiful way to stream my amazon prime movies to my big screen tv.set up was easy as plug in stick, connect. watch!Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "melanie armstrong"}, {"rating": 5.0, "review": "Awesome!  This blows away chrome cast!", "verified": true, "helpfulness": "0/0", "author": "R. Chris Parrish"}, {"rating": 5.0, "review": "I'm amazed at the quality of picture and channels from this little device.  I am using it in a space critical area and it is outperforming my expectations. It almost never needs to buffer and has as a good a picture as my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Grey"}, {"rating": 4.0, "review": "The stick is a good start for a new version of TV entertainment. The only difference with other remote is, it does not have an ON or OFF button to turn it. I'm still pushing all the buttons to find out what it does and maybe get the knowledge soon. The other question I want to find out is, Will there be a monthly charge on this Stick? It was not mentioned on any of the ads that you posted so, I or maybe some of us who purchased this merch do not expect any other charge.", "verified": true, "helpfulness": "0/0", "author": "tito villamarin"}, {"rating": 5.0, "review": "Simple to install, easy to use, love it.", "verified": true, "helpfulness": "0/0", "author": "Janine Bertone"}, {"rating": 4.0, "review": "The item is good, but the remote freezes sometimes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install and setup.  Lots of options to choose from.", "verified": true, "helpfulness": "0/0", "author": "Craig Haley"}, {"rating": 5.0, "review": "This product is the best. While I loved watching movies on my Kindle Fire, it is even better watching them on my television. This is great!", "verified": true, "helpfulness": "0/0", "author": "Jeanette Roberts"}, {"rating": 4.0, "review": "Arrived BEFORE promised..  setup wasn't \"quite\" as easy as I thought, and I'm computer/network experienced, however after only 20 minutes of working through connecting Fire Stick to home wi-fi network, all went well and the gift for xmas has been used several times since !", "verified": true, "helpfulness": "0/0", "author": "Michael K. Kennedy"}, {"rating": 5.0, "review": "Received it as a Christmas gift. Easy to set up -- nearly automatic, except for having to choose HDMI 1 or 2 on TV set. Great access to a variety of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Chav"}]