[{"rating": 4.0, "review": "I would be most pleased if I could listen via bluetooth. With Bluetooth, it would be \"The Bomb.\" I think Chromebit will connect with Bluetooth.", "verified": true, "helpfulness": "0/0", "author": "frleo"}, {"rating": 4.0, "review": "The only issue I had was that the Fire TV Stick was taking up a lot of bandwidth when streaming video. I found out that I needed to use the HDMI extender included with the product and I had to turn off Wallpaper settings in order to prevent this. Works great now.", "verified": true, "helpfulness": "0/0", "author": "Trevor"}, {"rating": 5.0, "review": "Works great! After our Sony Blu-Ray player (that I bought specifically because it had internet) stopped connecting to the internet I bought the Roku 1.  Upon getting the Roku 1, I discovered that it didn't support Netflix profiles! SO, upon further research, I decided on the Amazon Fire Stick and returned the Roku! Couldn't be happier!", "verified": true, "helpfulness": "0/0", "author": "Rachel Beers"}, {"rating": 5.0, "review": "For the price this thing is great! It works very smoothly and gets the job done right. We love playing games on it and Netflix works nicely as well. Between the Apple TV and this, they are the best streaming boxes on the market!", "verified": true, "helpfulness": "0/0", "author": "matt butler"}, {"rating": 5.0, "review": "Fire TV Stick is easy to install and operate. Navigation is easy and streaming is flawless. The selection of movies, TV shows and music from Amazon Prime is wonderful. I have an 11 year old daughter and we use this instead of cable. This will save you a lot of money annually if you use it to watch TV, movies, download music and listen to music in your home. Great product!", "verified": true, "helpfulness": "0/0", "author": "altheanicole"}, {"rating": 5.0, "review": "great to use this..  no problem to hook up on flat tv... ty for quick deliver", "verified": true, "helpfulness": "0/0", "author": "patricia little"}, {"rating": 4.0, "review": "i like it alot.... it freezes sometimes... but overall, we're glad we bought it", "verified": false, "helpfulness": "0/0", "author": "karen j boyce"}, {"rating": 5.0, "review": "Works good. Inexpensive  good for prime", "verified": true, "helpfulness": "0/0", "author": "H Davidson \"Dave Davidson\""}, {"rating": 5.0, "review": "I own two Fire TVs and two Fire TV sticks.  I honestly can't tell the difference in functionality.  I could be upset having spent $180 on two FireTVs, but honestly I think that's still a good value.  These sticks are simply unbeatable for the price.  I got mine for $19.99, but would still recommend them to anyone at full price.  These have honestly changed the way I watch TV.", "verified": true, "helpfulness": "0/0", "author": "lpeters82"}, {"rating": 1.0, "review": "I am very disappointed as there is not a way to set parental controls.  With Netflix or other services a lock can be placed by movie rating (such as no R rated movies.) With the fire stick the only way to monitor this is to set up having a parent enter a passcode for EVERY movie viewed.  This is just not practical.", "verified": true, "helpfulness": "1/1", "author": "Pam"}]