[{"rating": 3.0, "review": "As a small device it's great with a lot of content. At times it's a little slow loading screens and running other apps. For watching Amazon stuff, and listening to Amazon Prime Music it's awesome.Recommend: If you need a portable device to stream content, definitely get this. If you can sacrifice portability, get the Amazon Fire TV box (not the stick). The extra speed and horsepower helps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's my daily thing!", "verified": true, "helpfulness": "0/0", "author": "Federico Romero"}, {"rating": 5.0, "review": "Nice product, would purchase from this vendor again", "verified": true, "helpfulness": "0/0", "author": "Ronnie Amazon Customer"}, {"rating": 5.0, "review": "I really like the Fire TV Stick. Much better than Apple TV, unless you depend on Apple Air. But for Netflix and Amazon Prime, it works great and the picture is wonderful! I like the fact that you can go into the settings and change the picture quality. That helps if you have slower Internet. I like it better than Chromecast, too. I downloaded some apps that have relaxing music and waterfalls and stuff. Even an aquarium! Pretty cool!", "verified": true, "helpfulness": "0/0", "author": "Cranky Greg"}, {"rating": 5.0, "review": "All I can say is It's Amazing! Installing and using is very quick and easy.  I'm still exploring all of the entertainment options.  I am very happy with the Fire TV Stick.  I have reccomended it to all of my friends.", "verified": true, "helpfulness": "0/0", "author": "Larry L. Brumfield"}, {"rating": 3.0, "review": "i give Fire TV Stick three stars because it was registered to me, connected easily and works.  the quick guide could have pointed out the Options selection for closed captioning.  i removed stars for a few reasons. As widely noted on forums, the removal of the battery cover for the remote, which is the first thing we have to do, is too tight and has no grip to it, too slippery. you can't get started with your new Fire Stick without this frustrating struggle. In the end a sharp knife or nail file, (one person used a screwdriver) is needed to slip in and click open the cover.  Second, i did use the adapter so I could fit the stick in the port in the back of the TV. even that just fit in the area for plugging in cables. It was hard to manipulate to click it in. Third, the menu on the left is too grayed out. That is, you can see what you've landed on and highlighted but it's very hard to see what the other choices are unless you sit close. and i have a large screen tv.  Fourth, i don't find it easy for browsing or shopping or searching, so to speak. i still go back to the app on my iPad to find new programs of interest. I only use it for my Amazon Prime membership, to play what i already own or anything I find by clicking around on the home screen. I do not subscribe to Netflix or Hulu so i can't comment on those services or others. i looked at Games but am not interested in paying. .I did download the Fire TV Stick app to my phone. It works but seems unnecessary unless i lose the remote or don't have batteries. Overall I am happy to have this device so i don't have to stream videos through the internet using my mobile devices. the connection to the tv with Apple devices used the power port so we are limited in how long we can watch. Fire TV Stick takes care of that. I wish there was a low cost portable device with a screen associated with the Fire Stick so I could easily store shows  and travel on an airplane with, so as not to have to download to my phone or ipad.", "verified": true, "helpfulness": "2/2", "author": "Booklady1 \"booklady1\""}, {"rating": 5.0, "review": "Haven't had any problems.  It does what they say it does.", "verified": true, "helpfulness": "0/0", "author": "Ben Swonke"}, {"rating": 5.0, "review": "Love it, Thank you Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Sylvia Rivera"}, {"rating": 1.0, "review": "Chrome cast still wins", "verified": true, "helpfulness": "1/6", "author": "jake"}, {"rating": 5.0, "review": "I ordered this when Amazon offered the $19.99. I planned on using this in my bedroom but for some reason it would not work with my bedroom television (maybe because it is a 2008 Model). I also have a Fire TV I had planned on using in the living room. Long story short I tried the stick in the living room plugged into my home theater receiver and it works perfectly. I moved the Fire TV to the bedroom and I really cannot tell a difference it the two. My Fire TV stick has been very fast, smooth and responsive. I use it mostly for Amazon instant video, Netflix, watchespn, and I have set up a plex server and use the plex app to access it and all have worked smoothly with very good picture and sound. I thought there may be a noticeable difference in performance between the Fire TV and the Stick but I have not noticed any. I am very satisfied with both and would recommend either to anyone interested.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]