[{"rating": 5.0, "review": "I recieved my item on date promised", "verified": true, "helpfulness": "0/0", "author": "Harjeet Singh"}, {"rating": 4.0, "review": "Ok! 100%", "verified": true, "helpfulness": "0/0", "author": "Samuel J Orro Silva"}, {"rating": 5.0, "review": "It works just like I thought it would.", "verified": true, "helpfulness": "0/0", "author": "Brian Polehonka"}, {"rating": 2.0, "review": "the firetv stick  was recieved shortly after it was ordered. has numerous glitches we have had to deal with. it is constantly losing the wyfy connection  when accessed . Usually after a day or more of rest. we must re start each time . otherwise my wife loves the netflicks", "verified": true, "helpfulness": "0/0", "author": "dennis w hendrickson"}, {"rating": 3.0, "review": "I bought this so I wouldn't have to move my Roku 3 from the living room 39\" living room tv,  to the bedroom 32\" tv. It streams great, but the text size and display in every navigation screen is impossible to read when laying in bed, about 16' from the screen. I've tried using the maximum enlargement on my camera phone, or a cheap pair of binoculars, but the text display on my 32\" HDTV is so small and hard to read with magnification. The text on the Roku screen is fine.It's like trying to read the print on a rebate coupon anymore. I've had to photograph \"legalese\" on so many lables/coupons/receipts lately, I think there should be a minimum readability standard that at least equals the equivalent standard for passing a DMV vision test. This wouldn't. It functionally works great. I am a long-term and expressive proponent of Amazon, and my Prime membership. This product lacks, unless it's a setting on my TV that makes the screens too small to see.", "verified": true, "helpfulness": "0/0", "author": "John J. Elert"}, {"rating": 5.0, "review": "I haven't been using my Google Chromecast since my purchase.  Well set up.", "verified": true, "helpfulness": "0/1", "author": "Jerome"}, {"rating": 5.0, "review": "It works great. So much easier to use than the Google chromecast I have in the other room. After reading all the other reviews. I went with the Amazon fire stick over the fire tv because I only planned on using it for a few apps like Netflix and hulu plus.", "verified": true, "helpfulness": "0/0", "author": "Jake Sylvis"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "licensedbylaw@hotmail.com"}, {"rating": 4.0, "review": "Being an avid chromecast user, I was a bit skeptical about the Fire TV Stick. However, after a month of use, I have found myself pleasantly surprised. Watching Netflix and Prime Instant Video on this device are great. The remote is top notch and I find myself using it much more than I expected. The only reason I'm docking this product a star is I have had some issues with the youtube app apparently crashing and/or freezing up my Fire TV Stick, which I have never had happen on my Chromecast. This is definitely a worthwhile purchase if you're looking for a streaming stick and a must-have for watching Prime Instant Video, but if you prefer controlling a streaming stick with your phone I would probably go with the chromecast.", "verified": true, "helpfulness": "0/0", "author": "michael fochs"}, {"rating": 4.0, "review": "Had some difficulty setting it up and getting it to work...", "verified": true, "helpfulness": "0/0", "author": "W. Bjorklund \"wendall\""}]