[{"rating": 4.0, "review": "Nice device, easy set up and clean picture.", "verified": true, "helpfulness": "0/0", "author": "Reginald Alston"}, {"rating": 5.0, "review": "Best this money can buy, small but very powerful, you can customize it as you can.One thing I want to recommend if they can come up with IOS remote it's very hard to type anything with original remote,Everything else good", "verified": true, "helpfulness": "0/0", "author": "BA"}, {"rating": 5.0, "review": "Easy quick set up. Fast movie loads from Netflix and Amazon Prime. Great picture and sound and if you were lucky enough to purchase it before it came out at half price an excellent deal. The only thing I'd knock it on is you do have to plug a mini usb connector to the stick that connects to your tv and plug it into the power line. So you still have a wire running around. I had hoped it would get all the power it needed from the tv. Interesting that they don't show that in the picture when advertising which I think is very intentionally misleading. Nevertheless, an awesome device that runs perfectly with features even Roku doesn't have.", "verified": true, "helpfulness": "0/0", "author": "D.J."}, {"rating": 5.0, "review": "Super easy to set up, easy to navigate.  Connected to our Amazon Prime and Netflix accounts quick and easy.  Good buy.", "verified": true, "helpfulness": "0/0", "author": "tarad21"}, {"rating": 5.0, "review": "Love it, great little version of the Amazon Fire TV.  Small footprint and much easier to setup Out Of the Box than Google Chromecast.  Works great with the remote that it came with or the gamepad controller.  Streams Netflix, Amazon Prime and Youtube w/o issues.", "verified": true, "helpfulness": "0/0", "author": "John Grey \"AV98\""}, {"rating": 5.0, "review": "Purchased for use on second TV. Connects to Amazon Fire TV via Wi-Fi so all the services, apps and $99.00 yearly service fee areonly charged once on the Amazon Fire TV. Netflix and Hulu have monthly fees but they are charged on the Fire account. TheFire TV Stick is included in these fees. Our goal is to be free of cable TV. I believe we will reach this goal.", "verified": false, "helpfulness": "0/0", "author": "William E. Krell"}, {"rating": 5.0, "review": "It depends on your needs, but the stick should satisfy most users. I also bought the Fire TV box and I returned that one mainly because of software issues. I gave that one 2 stars. I will be able to compare the 2 though.I was impressed to see that for the stick they fixed the interface for Amazon Video and that now they have a separate section for Amazon Prime movies. This might be the case for the box also, as it might just be a new software update.The interface does feel a tad slower as compared to the box and the gaming would be more limited. If you don't care about gaming I think you would be golden with the stick, especially given the price difference.You don't need a separate HDMI cable with the stick. It's cheap to get an AmazonBasics one, but better not to have to.The remote while not quite as nice as the one for the box it is small and the Fire TV stick responds quite nice to it.Now if only Spotify would work as standalone, without the need of a phone or a tablet to play from, this would be the perfect streaming device for me. For the price paid it's a 5 stars keeper though", "verified": true, "helpfulness": "0/0", "author": "the savvy shopper"}, {"rating": 4.0, "review": "Works great fast and quick. Plus you can side load many Android apps. More reliable than chromcast. I have A roku and a chromcast and the chrome cast would lose wifi connection and stopped working after a year. The roku and fire tv are both reliable but the amazon fire tv stick and Firetv are the better choice since you can side load Android apps. If you want the best and most reliable streamer I would buy a Fire TV and connect it via an ethernet cable.", "verified": true, "helpfulness": "0/0", "author": "Pishkari5"}, {"rating": 3.0, "review": "I had a chromecast before this and mostly use google services, however I was disappointed with the reliability of streaming WatchESPN with chromecast. Fire TV stick advertised as more reliable wifi and better processor so I bit during the prime promo. Watching ESPN on the Fire Tv stick is much better, almost no hiccups, than using the chromecast, so it works well for that. However, I think I prefer the chromecast as a platform in general. It works more seamlessly with my android devices and even my laptop. The content available for Fire TV is also less than Chromecast (aside from amazon prime video). Prime music on fire tv is basically non existent, you have to manually add albums and playlists, and I never otherwise use it. Google Play music on chromecast works as expected. Lots of tv apps (watch abc, nbc, cbs, etc) aren't available on Fire TV and either have chromecast support and can be screen casted from my Nexus 7. I have two tvs so will use both as needed but would likely recommend chromecast based on content alone, unless you wanna to use it mostly for ESPN or don't have another way to watch prime videos.", "verified": true, "helpfulness": "0/0", "author": "Eheaps"}, {"rating": 4.0, "review": "I have a Roku on another tv and wanted something for a new tv I just purchased.  I mainly watch Netflix, and this includes that and was a good deal on Black Friday, so I decided to try it.  I don't see the higher speed I had read about - about the same as the Roku for me.  I miss the dedicated buttons on the remote for Netflix and a few other sites.  Not a big deal though.", "verified": false, "helpfulness": "0/0", "author": "Sharon W."}]