[{"rating": 1.0, "review": "Basically useless. It was easy to install, comes preloaded with my Amazon account and found my WiFi network, then the troubles started. I started to watch an episode of of a TV show. After five minutes the Fire Stick lost my network and I had to reboot. After that happened a few times, I checked rebooted my router, Fire Stick and TV. Got the same result: within a few minutes the Fire Stick loses the network and I need to reboot. I had a Roku 3 installed before but wanted to try the Fire Stick. After all of the failures of the Fire Stick,  I reinstalled the Roku 3 box and it works great. The Amazon Fire Stick is going back to Amazon.", "verified": true, "helpfulness": "3/4", "author": "G. Anderson \"Cheap shopper\""}, {"rating": 5.0, "review": "An inexpensive entertainment device that provides HD-quality picture and sound, the Fire TV is one of the cheapest ways to add entertainment options to your TV, to enjoy your Prime subscription, and perhaps even to stop paying for cable.The Fire TV Stick is an android device, like most smartphones, which means that to get all the use out of it you can, you'll have to supplement its native abilities by downloading apps onto it.  You can do this by going to Amazon's site and finding them(google play is not available), or by getting them right from your Fire TV stick's interface.  You can buy them using the payment options you already have registered, or use Amazon \"coins\" to buy them, which you get 500 of for free with the stick.  They work out to a penny a coin for app purchases -- that is, if an app is offered for 99 cents, it's also offered for 99 coins.  You can always buy more coins,and they come at a discount from cash from Amazon.The stick doesn't have most of the channels you're used to watching with even a modest cable package, so for some it will be no substitute at all.  It does, however, provide so much entertainment and learning value of its own that for other people, it may be as good as or better than cable -- especially since using it is free!  And because you can get so many cable shows on it anyway -- sometimes only episodes, but sometimes a season at a time.  You don't need Prime to enjoy it, either..As examples, the Smithsonian, A&E; and the History channel provide documentaries and some of their usual series shows; PBS does the same with many of their excellent series (Frontline, Nature, etc.) and daily updates the PBS News Hour, the best news hour on the air; there's Showtime, Netflix,, Bloomberg TV, and music, movie, cooking, kids, and educational channels with varying levels of materials from first grade through college.  Then there are apps that provide dozens of channels covering everything from yoga and exercise to comedy,dog,cat, science, business, dance, MMA, kids, gamer, and fashion channels.  There's youtube, Twitch, and the ability to see and hear all your purchased movies and music content that you have stored in the cloud.  Amazon's cloud, anyway.  There is even an endless variety of free and cheap screensavers and relaxing background channels to have on when you just want a little relaxing scenery and music.  Plus, of course, there's Prime if you want it.Warning:  Some channels, and apps that let you play channels, come with commercials.  Most of the ones I've tried, though, do not.  Your mileage my vary.And there are games, but this is not much of a gaming device.  Even the games recommended for the Fire TV Stick turn almost always turn out to have the warning that they're not compatible.  The remote, for one thing, is just too simple for most games.  Only the very simplest games with the very simplest controls will either work or be any fun to play.  This stick won't replace an X-Box or PS3/4 or even a full Amazon Fire TV box.  But it is very strong at what it does do right.Moving the Stick from one TV to another is easy; all you need is an HDMI outlet.  That means the Stick won't work on some old TV's.  It is recommended that you let the unit draw power from its own separate regular power plug, included in the box.  And it can be stuck in any HDMI outlet because the remote doesn't need line-of-sight to activate.So then, the Fire TV Stick is for some a substitute and for some a supplement.  If you're a fan of shows like Dancing with the Stars that you can't get on the stick (at least not for now!), then this device will just be a supplement.  But what a great and inexpensive supplement it is!  For me, it's good enough to be a substitute for cable because it lets me see almost all the shows I like from providers I'm already familiar with.  Unless I decide to devote my entire life to watching TV, that's more than enough already.  And it's free.  Plus ... it's a lot easier way to see Prime on your TV than hooking up your laptop.It's easy enough to use to give to someone of any age, and after a few downloads to update the device on initial installation and register the stick, you'll have one heck of an easy to use, portable entertainment option that you won't have to spend a penny on again and that may make you consider dumping your cable bill entirely.", "verified": true, "helpfulness": "2/2", "author": "Dingfelder"}, {"rating": 4.0, "review": "Good but It seems to disconnect from the internet quite often... If I unplug the power to the device it seems to work.", "verified": true, "helpfulness": "0/0", "author": "Rickymare"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lavonda"}, {"rating": 4.0, "review": "Plugs in nicely to my TV, but I must of missed reading where it also has to be connected to a wall outlet.  I've never used a streaming device before so probably just something I didn't understand, but it works great, and does what its suppose to.", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 2.0, "review": "The best thing that it has going for it is the price, but might as well get a Chromecast instead. I bought this when it was half off to be able to stream, PBS and Showtime. Well, the selection on the PBS app through amazon in highly limited and Showtime won't stream with the cable company I have access to. So, once you collect all of these silly things and fill up your Hdmi ports then you might be able to avoid cable, but it is difficult. and by doing a test, netfliz comes in a little clearer through the Fire stick over the chromecast but it is jumpy between frames. So, make your choice.", "verified": true, "helpfulness": "0/2", "author": "Jeremy Farmer \"Jeremy Farmer Photog\""}, {"rating": 2.0, "review": "just got this. easy to connect, set up. a bit cranky with my 5G network, but works fine on the 2.4G one. works well. my roku box ALWAYS takes a full minute to 'unblur' netflix, the fire tv stick is in focus instantly.the menu is a bit busy, but sleeker, more modern than the roku menu. and i will be happy to never see the roku 1992 animation when i reboot that device (which i needed to do regularly).so far extremely stable (but it's only day 2). plex was easy to setup ($5. thru amazon, i think it was free on the roku). wish i could customize the menu...maybe later? i don't need games, music. would like it simpler...looking forward to the ios app, but really, pretty easy to use. and a great price! def worthwhile.EDIT: couple of days later....sometimes, when we power on the tv, the stick has lost it's network connection. today, had to unplug then replug the AC to get it back. would like to be able to disable sleep, so it's always on (and our tv is off). this works with the roku box, but not the fire tv (yet). might help that issue...EDIT2: so, plex has issues, and all the movies i've converted (with handbrake) to store on my computer do NOT play in surround thru the fire stick (this works with my roku box). this is a HUGE disappointment, and am hoping amazon fixes this. thought this would replace my roku, but glad i kept it. ugh!EDIT3: june 30, 2015...and no fix for the plex surround issue. so am replacing the stick with a roku box...which does not have this problem.for most people, the fire stick should be sufficient, and...it's great at what it does well. so it goes...", "verified": true, "helpfulness": "0/0", "author": "fff3k"}, {"rating": 4.0, "review": "Little kludgy and needs to unplugged and replugged to activate if I don't use it for a couple of days but overall I like it.  Nice replacement for watching web content after the Samsung Blu-Ray firmware upgrade rendered it useless for anything but playing discs.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 2.0, "review": "Wish there was an option to broadcast from my computer to the TV", "verified": true, "helpfulness": "0/3", "author": "Jeff Thompson"}, {"rating": 5.0, "review": "It's a nice device, fits exactly in the back of my TV. It give me access to my amazon prime account. The quality of the movies and it resolution is very good. I have free access to The History Channel programs and another places like Crackle, Hulu and Netflix. The remote control is easy to use. I recomend this device", "verified": true, "helpfulness": "0/0", "author": "Oncologo"}]