[{"rating": 5.0, "review": "Opens right up to Amaon instant video. Little remote is easy to hold and has just the buttons you need. Navigating during the movie is fluid and respondsive with no lag. Haven't used it for anything other than movies yet but definitely been my go to movie player. Also love how portable it is! Only downfall is that it must be powered by an outlet rather that TV USB like the chrome cast", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "I have a TV mounted to my treadmill and plugged in the stick.  It works perfect.  Streaming is very fast (though I have no point of reference since I've never used Chromecast or Roku) and I never have an issue with buffering nor do I have issues with it losing connection to my WiFi.  I'm really happy with this purchase and would absolutely recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Ethan D."}, {"rating": 1.0, "review": "I have had problems with the fire tv stick.  When I first used it I was able to enjoy a movie I had not seen.  But I find that more often than not I either contend with constant buffering or failure to connect.  It is possibly the fault of my cable system router but I have not been able to enjoy this much.", "verified": true, "helpfulness": "0/0", "author": "rayna brown"}, {"rating": 5.0, "review": "This has to be the best thing I have bought from Amazon in the last 2 years. It is as easy to set up as the directions state and over the last two weeks has worked very well.", "verified": true, "helpfulness": "0/0", "author": "Missey"}, {"rating": 5.0, "review": "So far, I love this thing. I was replacing a Chromecast and I really like the way this works much better!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It works great, and I love Amazon", "verified": true, "helpfulness": "0/0", "author": "steve"}, {"rating": 5.0, "review": "This stick makes almost perfect media center. I don't care much about amazon's content and just needed a media center for my not-so-smart TV capable of running xbmc (kodi), plex, netflix and dish anywhere. Fire stick can do all of this. I have tried several android TV boxes and sticks before, but this stick is much better, faster, more reliable and has a decent remote.", "verified": true, "helpfulness": "0/0", "author": "Eugene"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Ritadele Rone"}, {"rating": 2.0, "review": "The remote sucks", "verified": true, "helpfulness": "0/0", "author": "Candice Graves"}, {"rating": 4.0, "review": "The Firestick is great.  But, there is an irritating high pitched loud click whenever you pause using the remote.", "verified": true, "helpfulness": "0/0", "author": "STEPHEN D MARCUM"}]