[{"rating": 5.0, "review": "I freaking love this thing! The Fire stick does more than I expected and I definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The system may work well on a cable system, but with the satellite, it is limited...", "verified": true, "helpfulness": "0/0", "author": "Joseph M. Sousaris"}, {"rating": 1.0, "review": "Remote just about impossible to open to put batteries in. Husband had to use all his strength.  Big Google and you tube section on how.  That tells u something!  Returning it because it seems incompatible with Samsung TVs. Found this out through trouble shooting and comments from other people. It would not connect to wifi.  It sensed the network but would not recognize the password.  Amazon should make this known.  Works with bedroom TV, Visio, when I moved that TV to the living room", "verified": true, "helpfulness": "0/0", "author": "Jayne Farrell"}, {"rating": 5.0, "review": "We love it.  Works like a charm and so easy to set up.  Now I can watch my favorite shows on the big screen instead of the Kindle Fire HD.  Only negative is the remote which is extremely difficult to open for battery changes.", "verified": true, "helpfulness": "0/0", "author": "Tracey A. Nettell"}, {"rating": 5.0, "review": "Great product!!!", "verified": false, "helpfulness": "0/0", "author": "woz"}, {"rating": 4.0, "review": "I really like the Fire TV Stick,  It works great, I'm using it as suggested with the included power cord adapter which I think should not be necessary.", "verified": true, "helpfulness": "0/0", "author": "Trina Stephenson"}, {"rating": 4.0, "review": "So far so good!Everything's going well.", "verified": true, "helpfulness": "0/0", "author": "Raul R. Ballesteros"}, {"rating": 5.0, "review": "Awesome alternative for my family. Love it. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Teri Williams Valentine"}, {"rating": 5.0, "review": "Love it , definitely glad I decided to buy one", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Fire TV Stick is easy to install and easy to use. It brings me pretty much whatever I want to see. I really love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Mystery book lover\""}]