[{"rating": 5.0, "review": "Have it on two TV's and works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This has many really good features- my only complaint is it does not fast forward very well- very hard to gage how far you have gone forward on a show- also seems to freeze a lot- frozen picture while sound goes on.", "verified": true, "helpfulness": "0/0", "author": "susie roberts"}, {"rating": 5.0, "review": "Easy to installIntuitive to use.", "verified": true, "helpfulness": "0/0", "author": "MLM"}, {"rating": 5.0, "review": "I am amazed of all the new shows that I can watch on the fire tv stick.  It has opened up a new world for me. Very pleased", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Pecoraro \"Pat Pecoraro\""}, {"rating": 5.0, "review": "Loving my fire stick. Tried the roku first but froze up multiple times daily and had to keep resetting. Was so frustrating we quit using it. Fire stick hasnt froze once and theres already so much on it to start we all use it.", "verified": true, "helpfulness": "0/0", "author": "michelle robbins"}, {"rating": 5.0, "review": "Very responsive to the remote, easy to use and a great bang for the buck", "verified": true, "helpfulness": "0/0", "author": "Johnny Bravo"}, {"rating": 2.0, "review": "the video continued to buffer and I gave up trying to watch.", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 5.0, "review": "This worked slick, no more need to run to the Red Box!", "verified": true, "helpfulness": "0/0", "author": "Fish-Hunt Guy"}, {"rating": 5.0, "review": "I love it.  It is easy to use and I am catching up on Downton Abbey, from the beginning...finally!", "verified": true, "helpfulness": "0/0", "author": "Barbara Gazdik"}, {"rating": 2.0, "review": "I like the idea of this. Super user friendly and the remote is an upgrade to normal blu ray players when trying to stream content. However, I constantly have issues with it randomly shutting off or not starting at all. When streaming content it sometimes just says it can't connect to the internet but there are no connectivity issues. Never had any problems like this with my blu ray player. Frustrating, wait until an updated version of this comes out with some more bugs fixed.", "verified": true, "helpfulness": "0/0", "author": "brittany mann"}]