[{"rating": 4.0, "review": "Husband is playing games on it. He likes it.", "verified": true, "helpfulness": "0/0", "author": "Golden wolf"}, {"rating": 5.0, "review": "Tremendous!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works awesome!love watching netflix in bed :)", "verified": true, "helpfulness": "0/0", "author": "Dina"}, {"rating": 1.0, "review": "This was advertised as an easy to travel stick Well I had it shipped to me so that I could use it in my motel room to free up my laptop well you cant do that in any motel room that has a user agreement which 100% of the places I've stayed at so basically a waste of my money and time Called customer service explained that I couldn't use the fire stick cause I couldn't get to the user agreement he has me do all these stupid things and making excuses like my internet isn't strong enough but the whole time my phone and laptop are connected to same internet . An hour later after a lot of please hold he tells me that the fire tv doesn't support user agreement pages.", "verified": true, "helpfulness": "1/1", "author": "Rick"}, {"rating": 5.0, "review": "Easy to install and set up. The picture is super sharp and clear.", "verified": true, "helpfulness": "0/0", "author": "Joey Aguayo"}, {"rating": 5.0, "review": "My children bought me a 40 in tv for my bedroom for Christmas, I ordered the Fire Stick to use there. This is the best investment I've made so far this year (2015). I. Was so impressed with it I ordered a second one for the big screen in the basement.  This little stick out performs my wireless Blu ray player that cost 4 times what I paid for the Fire Stick. I was actually so impressed with its performance that I downloaded the Sling tv app, so between that Netflix and my Amazon Prime instant videos I cut the cord to the very expensive satellite tv. With the available apps such as PBS and Smithsonian channel (which is free tv) and my over air antenna this $40.00 investment is saving me over $1200 a year in tv programming.  I would recommend it to anyone who is looking to \"cut the cord\" to expensive cable and satellite bills. It definitely been worth it to me.", "verified": true, "helpfulness": "0/0", "author": "Blackberry mom"}, {"rating": 4.0, "review": "Pretty good device. I switch between this and my Chrome cast.The Fire Stick is good replacement to my Apple TV, its easy to use with the remote and menu as compared to a Chrome Cast where you need to explain to users how to push video from a tablet/phone.I do notice it gets overloaded at times and crashes with some of my favorite apps like Plex so I have to fail back to ChromeCast sometimes.", "verified": true, "helpfulness": "0/0", "author": "Chris Hansen"}, {"rating": 5.0, "review": "Love it ... Great product .. Great price .. Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Kim Roy"}, {"rating": 4.0, "review": "It's a great solution and very straight forward to operate.  The only thing that kept it from being 5 stars is that Netflix is an application like any other and now and then, you need to re-enter your user name and password.  Makes sense I guess since it's the \"competition\", but in general, it was well worth the $20 I paid when introduced.  Even at the current price, it's well worth it.  It was easy to pair my laptop and phone and like the fact that you can send any youtube video from your laptop to your TV and that your phone can be a remote with voice.I was also pleasantly surprised that you can operate it easily with the remote even though the stick is behind your TV.  The remote navigation is a bit tricky to get the hang of, but you get it fairly quickly.  It was also easy to \"pair\" my phone with it so that it too can operate as a remote.  That is also nice because it also allows you to speak to a search just like the more expensive remote.", "verified": true, "helpfulness": "0/0", "author": "D. J."}, {"rating": 5.0, "review": "This is better than cable, dish and direct TV!! Love it!", "verified": true, "helpfulness": "0/1", "author": "Chriss"}]