[{"rating": 5.0, "review": "Works great! The remote is easy to use and the set up was even easier. Just plug into the wall and into the HDMI and its ready to go!", "verified": true, "helpfulness": "0/0", "author": "Morgan"}, {"rating": 4.0, "review": "After some tweaking and a couple of telcons with the help desk the FTVS is working pretty good.  I am disappointed that it doesn't support Netflix.  I guess amazon sees Netflix as a competitor.", "verified": true, "helpfulness": "0/0", "author": "Richard W McGaughey"}, {"rating": 5.0, "review": "Easy to set up and use. Best invention ever.", "verified": true, "helpfulness": "0/0", "author": "kelly doud"}, {"rating": 5.0, "review": "Love it, get to watch,  shows , movies and sports anytime (:", "verified": true, "helpfulness": "0/0", "author": "Veronica S.Rodriguez"}, {"rating": 5.0, "review": "The Fire TV Stick is easy is easy to set up, use and is economical. I enjoy watching movies I want to see at the time I want to watch them without interruption.  The Fire TV Stick makes that possible.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "I like to much", "verified": true, "helpfulness": "0/0", "author": "walter randelli"}, {"rating": 4.0, "review": "Noticed the fire stick will have difficulty processing or dowloading videos when heated. Disconnect from outlet when not in use.", "verified": true, "helpfulness": "0/0", "author": "Mark Guerrero"}, {"rating": 5.0, "review": "The Fire Stick exceeded all of my expectations and it is simply the best.", "verified": true, "helpfulness": "0/0", "author": "Roger S."}, {"rating": 2.0, "review": "I find that the fire tv stack does more than I first expeded. The thing is that it does too much.  All I wanted to do was watch movies . It does too many things and is hard for me to use", "verified": true, "helpfulness": "0/0", "author": "ALVIN WILSON"}, {"rating": 5.0, "review": "This product is wonderful and has changed our viewing habits. I can always find an interesting event to watch and enjoy on my own time. I am no longer tethered to TV schedules and faced with choices of dull and uninteresting programs. We have \"cut the cord\" to cable TV, saving us more than $120 per month.  We get our news and weather from the computer without having to watch dozens of car commercials and furniture ads.And I can find movies and favorite TV shows whenever I wish, any time of day or night.This device is so simple and easy to use that there is no need for a manual.  When our children and grandchildren visit, they always find programs that they can enjoy together and are not stuck face down into a cell phone.The price is extremely inexpensive and worth its weight in gold. As a long time Prime Member, not only do we get free shipping from Amazon, we  get access to the best programming available. Get this and you will not be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Don in South Carolina"}]