[{"rating": 2.0, "review": "Right now I am pretty disappointed. Stuttering audio makes shows un-watchable.  I tried Prime Video and Netflix.  On both the audio stuttered every few seconds. I then used my Chromecast to watch the same show on Netflix and it worked perfectly. I'm assuming I got a lemon. I've contacted Amazon and am waiting on a resolution.Comparison to AppleTV:I tend to think of gadgets in terms of \"Can my mom do this without calling me?\"Based on that I think the Apple TV interface is easier to use. Its a lot easier to explain to your mother over the phone to navigate the big Netflix button on the screen(AppleTV) than it is to say \"I haven't watched Netflix in a while so navigate down to the app's section and click to the right then find the Netflix app\"(Fire Stick). Using Netflix is much harder on the Fire TV. Prime content is not really an option (unless you Airplay it from the app) on an Apple TV.With regards to how easy it is to find prime content, intermingled in is paid content. I put a pin code on my mom's because it seems like its really easy to think something is on Prime when it isn't. I was nervous about her buying shows and not really realizing it. With the AppleTV you wouldn't have to worry with that as much.The Fire TV stick does have an RF remote. Apple TV has an IR remote. Its really nice that I don't have to have a line of sight.Set up was really easy for the Fire Stick. Pretty close to plug and play. The video at the beginning was a really nice touch.Chromecast: I prefer the Fire Stick to the Chromecast. You'll never explain how to use a Chromecast to your mother over the phone. Don't even attempt to explain how to set one up initially. Chromecast are better if you enjoy gadgets and want to watch a show on ABC.com or something when its not on anther streaming site or you want to project your desktop onto your TV.", "verified": true, "helpfulness": "0/1", "author": "Rusty T."}, {"rating": 3.0, "review": "I had difficulty getting it set up as it froze frequently and the remote randomly drops out.  When it works fine, it's pretty great.", "verified": true, "helpfulness": "0/1", "author": "Andrew"}, {"rating": 4.0, "review": "It was works great, I wish it came with the voice recognition control", "verified": true, "helpfulness": "0/0", "author": "Joshua Erazo"}, {"rating": 3.0, "review": "It works fine for what it does. I was hoping it would work through my AV receiver (a Denon 3311) but no such luck. I have to attach it to the only other HDMI port on my TV, and then run a separate digital coaxial cable from the TV to the receiver to get surround sound. Then it needs to get power from a micro USB cable. Would it really have killed them to make it a tiny bit bigger so it could hold a couple of watch batteries? The purpose of having a device that small is sort of defeated if you still have to plug it in.The only streaming service I use, other than Amazon Prime, is Vudu, and this does not support that at the present time. I have not had it very long, so haven't played with it much, but I have noticed several movies did not have any audio. This might be a result of the settings in the TV or receiver due to the way I had to install it above. I got in at the beginning when they were offering it to Prime member for only $20, so I can't complain, I guess, but I don't think I would have paid $40 for it. Compare to similar products from Roku and Chromecast for something that fits your needs before buying one.", "verified": true, "helpfulness": "0/0", "author": "Christopher Mark"}, {"rating": 5.0, "review": "Amazing!", "verified": false, "helpfulness": "0/0", "author": "Texico"}, {"rating": 2.0, "review": "The UI was pretty disappointing. The fact that you have to go download other 3rd party apps and get emails confirming that you downloaded them is really lame.I had pretty high hopes off of this but failed to deliver.", "verified": true, "helpfulness": "0/0", "author": "Todd J. White"}, {"rating": 5.0, "review": "The Fire Stick is quick and easy to use. Has everything I need for my kids.  The only improvement would be allowing the device to piggyback off of the power from the TV rather than plugging it in.  Otherwise I love it..", "verified": true, "helpfulness": "0/0", "author": "Doc"}, {"rating": 4.0, "review": "Great lil brother to the fire tv. Out does its competitor by far, packs a big punch for its size. I have to say I was pleased with its performance and from here I can only see great things to come from the Fire TV family.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Honestly, i was skeptic about this. I had heard some bad things about fire TV and of course everyone knows the fire phone. But! We got our fire stick last night, plugged it into our TV and got it running smoothly. It has a great youtube application so that i can watch Lets plays from the Achievement hunters, Of course it has netflix, and since im a prime member i got the prime library plus all the tv shows and movies ive bought in the past. Whats not to love about this? Even better since it was announced i got it for 20 bucks with my prime membership!!! I finally have something i can play on my TV without alot of connections and crap. it runs smoothly, easy to navigate. + i can turn my kindles and phone into a remote!!!! I downloaded the fire TV stick application and its as simple as pressing a button to connect to it!!!to be quite honest this is a great product and i highly recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "Arsenio M."}, {"rating": 3.0, "review": "I'm not writing a review, just wanna know if this stick work in my region, I live in El Salvador (Central America) and I already had a Chromecast and works great, but this seems to be a better choice if I can use it in my country and without having Amazon Prime (just for Netflix, Youtube, Twitch and Spotify).So, will this stick work in my country?", "verified": false, "helpfulness": "0/1", "author": "Roberto Carlos Campos Lopez"}]