[{"rating": 4.0, "review": "Have had the Fire Stick for a couple of weeks and I am extreemely happy with it!The reason why I bought this over others like roku or Google chromecast, etc. was because I am an Amazon Prime member and I wanted to guarantee that I would have access to Amazon Prime video content.The device has all of the apps that I was interested in: Pandora, Amazon Prime, Netflix, Hulu, HBO Go.", "verified": true, "helpfulness": "0/0", "author": "Furious Pacifist"}, {"rating": 4.0, "review": "Works great, easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Jim Cole"}, {"rating": 5.0, "review": "Easy to use, especially with TVs that don't have USB ports.  I love this product!", "verified": true, "helpfulness": "0/0", "author": "Krissy"}, {"rating": 5.0, "review": "very very easy to set up.  Works well", "verified": true, "helpfulness": "0/0", "author": "bobbym"}, {"rating": 5.0, "review": "Almost perfect! To be perfect Amazon Instant Video, Hulu and HBO GO needs to work in Brasil", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Well worth the money. Extremely easy set up. Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Lance Mitchell"}, {"rating": 5.0, "review": "Easy to set up and works great.  Unfortunately for me I was a consumer that bought two of the fire boxes at $99 each so now being able to purchase a stick at $40 I feel a little ripped off!!!  All work great though and set up is very easy.  Would recommend any of them for streaming shows since we don't have a lot to watch on regular TV these days.", "verified": true, "helpfulness": "0/0", "author": "SouthernGal820 \"Bailey\""}, {"rating": 5.0, "review": "It was easy to set up and does what it is supposed to do.  Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "vju"}, {"rating": 5.0, "review": "I like the interface and the variety of channel's. Good first step for cable cutting.", "verified": true, "helpfulness": "0/0", "author": "ProFss"}, {"rating": 5.0, "review": "Just got the new stick and so far love it.  Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Chuck Petty"}]