[{"rating": 5.0, "review": "Love Love Love it", "verified": true, "helpfulness": "0/0", "author": "Edmund Faroun"}, {"rating": 1.0, "review": "The quality of the picture isn't the greatest. Regardless which app we are using through the Fire Stick, the picture will go cloudy. We often have to watch through our Apple TV. We also went back to watching Amazon Prime through our iPhone via Apple TV.", "verified": true, "helpfulness": "0/0", "author": "MC"}, {"rating": 5.0, "review": "It works very well.It is easy to navigate", "verified": true, "helpfulness": "0/0", "author": "Why"}, {"rating": 1.0, "review": "Worked well for about a week, then started having issues no matter what app (HuluPlus, HBOGo, etc.) I would use. Each time I tried to watch a show or movie on my TV using the Fire Stick, it would begin to load (slowly), then kick me back to the main Amazon Prime screen. I tried several times to reset my router, reset the connections and wifi used, various HDMI ports, etc to no avail. Unfortunately, the issue was definitely the fire stick and not the connection as my computer/cell phone/tablet were all connected to the same wifi and running fast as normal. I was also able to use HuluPlus/HBOGo/other apps on my tablet and phone perfectly fine still. I returned this and ended up buying an Apple TV streamer, which has been working without any issues whatsoever now. I suppose it's true, you get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "Nicole W"}, {"rating": 5.0, "review": "it works great.", "verified": true, "helpfulness": "0/0", "author": "Margaret O. Tsao"}, {"rating": 5.0, "review": "Bought this for my parents, and they love it!!  In fact, they haven't watched Netflix for months.  =)  They just plugged it into the back of their TV, configured it up to connect to their Wi-Fi, and they are enjoying all the shows.", "verified": true, "helpfulness": "0/0", "author": "Micah Kautter"}, {"rating": 1.0, "review": "Disappointed in the reception strength. The iPad has better signal strength.", "verified": true, "helpfulness": "0/0", "author": "rebecca mennig"}, {"rating": 4.0, "review": "It's nice that it doesn't buffer, but it does this speed up thing that's kind of funny. And I wish I could get YouTube.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "I ordered it for the bedroom because my partner often falls asleep before a movie is finished.  Now I can watch while he snoozes.  I actually like it better than the one on the Smart TV.", "verified": true, "helpfulness": "0/0", "author": "David Lee Hedrick \"Cardinals Fan\""}, {"rating": 5.0, "review": "Works amazing", "verified": true, "helpfulness": "0/0", "author": "ANTHONY GARCIA"}]