[{"rating": 4.0, "review": "It works pretty good.  The downside is that even when it's receiving a strong signal.  Four to five bars it's ability to send back ( it's radio) is not very strong.  Placement is critical. You do not want to be far from the router, and you want the stick unobstructed. An hdmi extender is almost a given.  However its functionality is great overall.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Ian Coan"}, {"rating": 5.0, "review": "Loving my Firestick. Used to watch stuff on computer. Oh so much better.  Easy to install and use. Also connects to start phone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Fast, and nice. Not a huge fan of the menu look, and it has some oddness with wireless. Plus, mirroring from a Kindle doesn't run very smooth. It's choppy....which I don't get, I have a wireless router that pushes 30+ down, and 300+ networked, not that it's a factor. If I stream directly, it seems fine. Just the mirroring seems to be an issue. But still a nice product.  I'v found it easier to hook up my 2nd gen Kindle directly to the TV with a HDMI cable. Picture is much better. Just sucks, because you have to get up and go to the TV to pick the next item to show. If the mirroring was smoother, it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Christopher Bishop"}, {"rating": 5.0, "review": "This is the best media streaming device I have ever owned. Before this I went through 2 Boxees (they stopped supporting them now), and a Vizio media player. This was a cinch to set up, takes up no space, has a great easy to use remote, and has every app I need. The Plex app is the most used one, and the interface looks similar to what it looks like on my computer. I will probably get another one with the Sling deal they have going on.", "verified": true, "helpfulness": "0/0", "author": "M. Ivey"}, {"rating": 4.0, "review": "Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Carol White"}, {"rating": 4.0, "review": "Easy to install and works fast.  Hate the fact the remote is small.  My young kids lose it too easily.", "verified": true, "helpfulness": "0/0", "author": "suzi"}, {"rating": 4.0, "review": "Love it - easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Cherrill L. Anderson"}, {"rating": 3.0, "review": "Works pretty well.", "verified": true, "helpfulness": "0/0", "author": "tham"}, {"rating": 5.0, "review": "So easy to use and set up", "verified": true, "helpfulness": "0/0", "author": "Sarah&Rico"}]