[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Tommy"}, {"rating": 4.0, "review": "It is a really good device. For the price and what you get I am happy. It was hard to connect and stay connected. I know it's not my router because everything else works fine. With that, I'm looking to get another one.", "verified": true, "helpfulness": "0/0", "author": "The Tyut \"Tyut2\""}, {"rating": 3.0, "review": "This device is in serious need of software updates.  It lags pretty severely in navigating the interface, issuing commands - basic daily use.  Price is good, and I think the potential is here, but the device UI / OS is S L O W.  Hoping for improvements soon.", "verified": true, "helpfulness": "0/0", "author": "T. Shaw"}, {"rating": 5.0, "review": "Easy to setup and works great!", "verified": true, "helpfulness": "0/0", "author": "Blake Scrivner"}, {"rating": 5.0, "review": "I love my Fire TV Stick!  I can watch movies, listen to my music, watch tv series and so much more at just one click!  I LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Susan McQuillen"}, {"rating": 2.0, "review": "It could be a decent product if it would actually pick up the home Wi-Fi. I have to connect to a phone hotspot and waste cell data. All website troubleshooting suggestions didn't work. Help please!", "verified": true, "helpfulness": "0/0", "author": "Falicia Taffi"}, {"rating": 4.0, "review": "The only reason I didn't give it 5 stars is because it doesn't have HBO go.", "verified": true, "helpfulness": "0/0", "author": "Renata Murdock"}, {"rating": 5.0, "review": "We are very happy with this product.  It is faster than the other Amazon Apps you will find in other devices (blu-ray players, etc.).  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Juan O."}, {"rating": 3.0, "review": "Stick would not work directly behind tv, had to extend to side for wifi reception", "verified": true, "helpfulness": "0/0", "author": "Dennis Hubbard"}, {"rating": 5.0, "review": "I love it!  I wish it maintained my user sign in for Netflix, but everything else is easy.  SO nice to be able to purchase an instant video from within the \"stick\" instead of having to find another device to complete the purchase.  The only downside is its complete ease of use and its success at allowing me to binge watch programs.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth L. Clark"}]