[{"rating": 4.0, "review": "Great I like it ,I ordered 3 more to give as gifts Keep up the Good Stuff", "verified": true, "helpfulness": "0/0", "author": "foolishfisherman"}, {"rating": 5.0, "review": "Connection was easy and the user video that automatically came on first was helpful.  Now I can stream movies and television series on one more location in my home.", "verified": true, "helpfulness": "0/0", "author": "Suzanne Colvn"}, {"rating": 3.0, "review": "You need to put. More up date movie's", "verified": true, "helpfulness": "0/0", "author": "Keith Klemm"}, {"rating": 1.0, "review": "miracast doesn't work if you have a windows phone. So be warned if you have a WPand don't buy.", "verified": true, "helpfulness": "1/1", "author": "Spoo"}, {"rating": 5.0, "review": "Took a few seconds to set up! Love it!!!!", "verified": true, "helpfulness": "1/1", "author": "Victoria"}, {"rating": 4.0, "review": "Most of my experience is covered in other reviews and the Fire TV Stick is very nice as a streaming media device. I got mine because Apple TV does not have any Amazon services and I use Amazon Music a LOT.My main knock on the Fire TV Stick is the volume difference between music and video playback. This is because sound for music and television/movies are produced at different reference levels. Music is always produced to be as \"loud\" as possible while television/movies are designed for consistent listening at reasonable levels. This is the same reason why DVDs are always \"quieter\" than CDs.Anywho, switching from using Amazon Prime Video to Amazon Music is a most jarring experience. I've had to apologize to my neighbor more than once -it blasted so loud... My Apple TV doesn't have this particular problem. It's not really a hard fix, lower the output volume in the Amazon Music app on the Fire TV Stick and everything's good.Edit - I've installed the YouTube App and it is very sluggish. I'm not sure if that's because the program is poorly coded (likely) or what. I just wanted to leave that as an FYI in case anyone really, really loves watching YouTube videos.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 1.0, "review": "We keep having connection issues. All other televisions work with ps3.", "verified": true, "helpfulness": "1/1", "author": "Helen"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I bought this at the intro price of 19.95.  I was pleased to find that it supports Netflix as well as Amazon Prime and so it is now my primary streaming device.  The interface is easy to use and the stick performs very reliably on my Comcast Wifi-N wireless network.The one down side I have found so far is that there appears to be a memory leak such that, after a few days of continuously on use, the networking will hang.  But doing a power reset quickly fixes that problem and then its fine for another few days.If they fixed the leak, I'd give it a full 5 stars.  Here's hoping.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey P. Kesselman"}, {"rating": 5.0, "review": "OMGosh, I love my Fire TV Stick!!! I have never had so much fun with my TV... now I barely watch TV proper, I'm always using my Fire Stick!I had company, and we were exploring the different things, apps, games.. types of games, music, movies, TV shows, Netflix, HuluPlus, and so much more that I had.  They were very impressed.I set it up in less than 2 minutes, and that included taking it out of its box! You get a HDMI extender, if you need it, the Fire TV Stick, and an electrical plug that goes into the Stick and an outlet.Plug the Stick into a free HDMI port on your TV, plug the electrical cord into a socket -- have the remote that comes in the box loaded with the batteries and next to the TV.I pre-ordered mine thru Prime Amazon, so it was preregistered. The Fire Stick sought out channels to connect to, registered itself, and all I had to do was put in my Wi Fi information... then I was up and running.  So sweet!Well, I hope you get one, I really like mine, and it is a great addition to my Amazon Prime account. I trust Amazon, I know that I am in good hands.  If you need something like this, I think this is really great.  Have Fun!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth J Pierro"}]