[{"rating": 2.0, "review": "awesome for the kids TV.loses account info at least once a week.I keep having to reenter Netflix and wifi info", "verified": true, "helpfulness": "0/0", "author": "sonicwilson"}, {"rating": 5.0, "review": "So far so good. Video is TV quality. Love that you can add apps from a PC or tablet and they get sent to the Fire Stick over the air.", "verified": true, "helpfulness": "0/0", "author": "Stevebowl"}, {"rating": 5.0, "review": "Absolutely great! Takes up a fraction of the space compared to other devices. Always ready to go, and if you can't find something to watch with all those options, you can't be pleased.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "I have been very nervous about buying one of these items.  The Fire TV stick is great - it was easy to install and everything has been great since.  Love streaming Amazon Prime movies on the TV now.", "verified": true, "helpfulness": "0/0", "author": "K. Johnson \"kayakkris\""}, {"rating": 4.0, "review": "Very nice device.  My only complaint is that it is not possible to rearrange the Home screen to my preferences.", "verified": true, "helpfulness": "0/0", "author": "Christopher Milito"}, {"rating": 4.0, "review": "Generally really pleased with this purchase! And a great price! It would be nice if there was a feature where you could somehow sync your laptop up to the stick through wifi (equivalent of using an hdmi cable to your computer to mirror the computer with the tv), but still a great toy!", "verified": true, "helpfulness": "0/0", "author": "Kelsey Graham"}, {"rating": 5.0, "review": "Great dongle!", "verified": true, "helpfulness": "0/0", "author": "scott a hardwick"}, {"rating": 2.0, "review": "TV shows and movies seem very expensive with the exception of a teaser here or there. Not a lot of content to offer on Amazon prime. I did not try netflix or any of the other applications.Very disappointingly the Miracast feature did not work as promised, and promised to be a lot of work to get working. I wanted to like this product. For desktop mirroring, it is definitely NOT plug and play.", "verified": true, "helpfulness": "0/1", "author": "Harry A. Hartley \"itvguy2000\""}, {"rating": 5.0, "review": "Very easy to use. Preloaded with my Amazon Prime information [you can log in as another prime member if needed] and very smooth streaming. Literally plug it in and use it. Have your passwords handy for Hulu, Netflix etc. and Bob's your uncle!", "verified": true, "helpfulness": "0/0", "author": "Oisian"}, {"rating": 5.0, "review": "Tis a good stick", "verified": true, "helpfulness": "0/0", "author": "Bryson"}]