[{"rating": 5.0, "review": "We've had the Amazon Fire TV Stick for about 2 months now. So easy to get set up. It took maybe 10 minutes tops. It walks you through the process. We use it for SlingTV, Netflix and games apps. We have only had one issue and that was that recently it was not picking up the wifi signal.  All our other devices were working properly so we unplugged the Fire Stick for 30 seconds, pugged it back in and problem solved. We love it!", "verified": true, "helpfulness": "0/0", "author": "Seth's mom"}, {"rating": 5.0, "review": "Works great , easy to connect and use ......... I thought there would be more free items available , but overall pleased .", "verified": true, "helpfulness": "0/0", "author": "Foxman"}, {"rating": 5.0, "review": "Very happy with the fire stick!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Loving This !!", "verified": true, "helpfulness": "0/0", "author": "Del'Jean54"}, {"rating": 5.0, "review": "I picked up the fire stick because it was $39. Figured we really couldn't lose. Or return it if it didn't work. We have a complicated home network set up – and use Apple TV with our family room smart TV.  Picked up the fire stick for an HDTV in a bedroom that doesn't have Apple TV.  I was able to set this up in no time, including downloading and activating apps HBOGO, etc.,  not to mention accessing all the stuff from our Amazon prime account. Sweet.  So often promises of \"easy installation\" are patently false. Not so with the Fire Stick,  which is why I took the time to write this review.", "verified": true, "helpfulness": "0/0", "author": "jill"}, {"rating": 5.0, "review": "Does a great job with a very nice price.", "verified": true, "helpfulness": "0/0", "author": "Silvia"}, {"rating": 5.0, "review": "This works great! I don't even miss cable TV.", "verified": true, "helpfulness": "0/0", "author": "Patrick Willis"}, {"rating": 4.0, "review": "I don't watch too much TV but this fire stick is pretty neat. Easy to use with lots of options. I just wish there was an option to type in requests. I downloaded the app, but it was pretty much useless. Hoping they will update the iPhone and iPad app with more options- then I will give full stars.", "verified": true, "helpfulness": "0/0", "author": "Misty Lynn"}, {"rating": 5.0, "review": "Love it and the children love it, Not sure yet on how to make fit the tv screen, Over all a great by Amazon!", "verified": true, "helpfulness": "0/0", "author": "JD1021"}, {"rating": 5.0, "review": "Love this. Already have a different brand streaming stick and didn't know if Fire Stick was also necessary but the app and program offerings are great with lots of variety. Very user friendly and the remote included is very convenient.", "verified": true, "helpfulness": "0/0", "author": "Anna McConnell"}]