[{"rating": 5.0, "review": "I have an Apple TV but I love all things Amazon and I wanted to watch Prime Instant Video on my television. I flip flopped between the Fire TV Stick and the more expensive Fire TV. I eventually landed on the stick thinking it would be portable enough to move from room to room.It's not *as* portable as I'd hoped. I was expecting simply a stick plugged into the USB (like Chromecast). If I had just read the description prior to ordering, I'd have known that it also needs to be plugged into an outlet. Still, this is not an issue. I can still take it from room to room with only a little annoyance. (Seriously? These are the things I can find to complain about?)I have only had a connectivity issue once and it was easily resolved with a reboot. The interface is super easy to use and finding what I'm looking for can be done quickly. As an odd aside, I'll add that I like the little chubby remote much better than Apple's slick silver \"always lost\" remote.All in all, I think this is a must have ESPECIALLY for Prime subscribers.", "verified": true, "helpfulness": "0/0", "author": "Kimberley Littleton"}, {"rating": 3.0, "review": "Seems the fire stick freezes up frequently. I don't know if I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Mr. Michael S. Blaszak"}, {"rating": 5.0, "review": "5 Minute setup and worked great from the start! I can't wait to try more of the apps. I have used it with Netflix and Youtube. For the price, you can't beat it!", "verified": true, "helpfulness": "0/0", "author": "jessesgirl1212"}, {"rating": 5.0, "review": "So awesome you can easily travel with it and you just plug it right in and go. Very easy to understand!", "verified": true, "helpfulness": "0/0", "author": "luv2bcaitlin"}, {"rating": 2.0, "review": "I was really waiting for the fire stick so I could mirror from my kindle like I did w/ my Apple TV. What they fail to mention is that is will only mirror with the Kindle HDX and hire. I have a Kindle Fire HD 8.9 and cannot mirror from my device. There should at the VERY LEAST be an app available or a device update that will allow mirroring capabilities. HUGE MISS for Amazon. I'm EXTREMELY disappointed.", "verified": true, "helpfulness": "0/0", "author": "Kori Adams"}, {"rating": 4.0, "review": "WatchEspn doesn't stream well for me, so I use my Chromecast instead for watching games.  Other content seems to stream pretty well.", "verified": true, "helpfulness": "0/0", "author": "Matthew H. Walker"}, {"rating": 3.0, "review": "I just wanted to get a small, affordable \"smart TV\" box for the TV in my bedroom and didn't want to drop $100 on another Apple TV (the best TV box on the market). This is just okay. It's slow, and I find myself having to unplug it and replug it back in every single time I want to watch it because none of the apps function unless I do so (despite my network connection being \"very good\"). It also takes about a minute or so for the picture to come into full HD. For the price it's a pretty acceptable device, but if you can afford the Apple TV, I recommend getting that instead.", "verified": true, "helpfulness": "0/0", "author": "aud"}, {"rating": 4.0, "review": "It's really easy to use and I like some of the apps. Some of the apps have way to liberal movies for us and I wish that as a whole, those apps were a little more family friendly. But no biggie, we just won't watch those apps! We like it a lot and have used it a lot already!", "verified": true, "helpfulness": "0/0", "author": "Rochele Ambo"}, {"rating": 5.0, "review": "I have not had any problems with the fire stick so far. I thought it was going to be difficult to set up it wasn't,  make sure that you program the fire stick correctly, not so hard just try each til the instructions pop up and that's it.", "verified": true, "helpfulness": "0/0", "author": "Laura R."}, {"rating": 5.0, "review": "The fire stick order was originally backlogged but arrived sooner than the stated date.  The product installed quick and easy and was operating  within 15 minutes.  The fires stick is great product offering  all kinds of viewing.  This is our first experience with this type of product and we were originally hesitant to try it as we are somewhat technology poor but this item is so easy to install and use and ranks very high on our list.", "verified": true, "helpfulness": "0/0", "author": "Jim P."}]