[{"rating": 4.0, "review": "Great. I'm cutting way back on cable bill.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Ann Duffy"}, {"rating": 5.0, "review": "It perfect five star that is affordable for every one .", "verified": true, "helpfulness": "0/0", "author": "TT"}, {"rating": 5.0, "review": "amazing functionality for such an small and inexpensive device.. we will definitely buy again for some of our other tv's", "verified": true, "helpfulness": "0/0", "author": "elliott cordo"}, {"rating": 4.0, "review": "The WIFI has froze up a couple of times. Other than that, everything has been great.", "verified": true, "helpfulness": "0/0", "author": "Rich C."}, {"rating": 5.0, "review": "The fire stick is great!!!!", "verified": true, "helpfulness": "0/0", "author": "KR"}, {"rating": 5.0, "review": "Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Ellen robbins"}, {"rating": 5.0, "review": "Just recently purchased my Amazon Fire TV Stick a couple days ago. I wish it was cheaper, but the Fire TV stick is the best $40.00 I have ever spent to improve my electronic experience. It allowed me to integrate all the technology together whether it was through mirroring or playing Spotify from my phone. Not only that but connect to Netflix or HBO to watch Game of Thrones or many of the other great movies and T.V. shows out today. Trust me, I went back and forth for 6 months debating whether I wanted to buy this. Well worth it.", "verified": true, "helpfulness": "0/0", "author": "Noah"}, {"rating": 2.0, "review": "Netflix not working at all. Everything else, works fine. Connection is fine. Please fix the netflix issue! Otherwise, I will look for something else.", "verified": true, "helpfulness": "0/0", "author": "Tegan McNeal"}, {"rating": 2.0, "review": "You do not own this device. You're merely licensing it from Amazon. If you try to do anything with it they don't approve, they will not only brick your device but block the ability to go back to stock making it garbage. Just do a search for 'techdirt amazon bricks fire tv devices'. Their ads are ever increasing and getting more sly and deceiving. How many ads are on Chromecast? Zero. Perhaps they should add that to their comparison. I gave it a second star for the apps it does support.", "verified": false, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm in love, everything I wanted and MORE!!!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}]