[{"rating": 5.0, "review": "So simple to install and put to work.", "verified": true, "helpfulness": "0/0", "author": "Chuck Lofty"}, {"rating": 5.0, "review": "Works well!", "verified": true, "helpfulness": "0/0", "author": "Robert Kulstad"}, {"rating": 5.0, "review": "I am enjoying the movies and music from Amazon Prime. The Fire stick is agreat buy!", "verified": true, "helpfulness": "0/0", "author": "p nemo"}, {"rating": 5.0, "review": "I am very happy with the Fire TV stick.  It is easy to use, easy to figure out how to hook up.  One of our older BluRay players would not stream Amazon prime movies so this was the perfect match.  It took a lot longer to arrive after ordering, which surprised me, and I did not receive good communication during this time.  I have never had that experience before.  I usually receive Prime orders in 2 days.  Still happy with the product", "verified": true, "helpfulness": "1/1", "author": "Gram"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Trent Rhonehouse"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Henry P Gregor \"HenryG\""}, {"rating": 5.0, "review": "Setup was easy and streaming video is seamless. I have only had it for four days but I'm very satisfied at this point.", "verified": true, "helpfulness": "0/0", "author": "Kent Flewelling"}, {"rating": 5.0, "review": "I had Chrome cast and Samsung before.  Fire stick is WAY BETTER.  I can actually watch a movie without buffering now.  There are several aps like Hulu plus, but you have to pay extra for those.", "verified": true, "helpfulness": "0/0", "author": "Erin Lakin"}, {"rating": 4.0, "review": "Quick and easy to set up. The Netflix functionality is different than it is on my Apple TV connected to another TV, but I guess I'll get used to it.", "verified": true, "helpfulness": "0/0", "author": "Dan G"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Christinabookworm"}]