[{"rating": 5.0, "review": "Installed in minutes and I am discovering new content every day.", "verified": true, "helpfulness": "0/0", "author": "Richard H."}, {"rating": 1.0, "review": "Expected a Lot, Highly disappointed, Firestick app is cumbersome and unable to use and without a good app, This stick is uselessI would not recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "Ashguy"}, {"rating": 5.0, "review": "super easy to install and get logged in, works much better than my Ruku for Amazon prime veiwing although oddly I haven't figured out how to watch Netflix on it, I should be able to watch Netflix on both the Ruku and the Fire stick. I'll post more once I get it all worked out but so far so good.", "verified": true, "helpfulness": "0/0", "author": "Aberjoe"}, {"rating": 5.0, "review": "Even though the Prime sale was kinda lame, I was able to get this for $24.99. I was probably too excited, but this purchase didn't let me down at all. The interface, ease of use, and content have made me move it up on this year's goto gift for the family member that thinks they have it all. I love it.", "verified": true, "helpfulness": "0/0", "author": "rodney"}, {"rating": 1.0, "review": "We usually watch Netflix and amazing prime thru the Wii. I thought we would have a bigger selection with this, but it really isn't any great deal if you have another means to play them. The unit gets extremely hot. I have to unplug it because it scares me. Not thrilled. Plus it buffers more than playing shows thru the Wii or on a laptop. A marketing ploy by Amazon to give discounts on their July black Friday that I fell for. Won't buy anything on their black Friday next time.", "verified": true, "helpfulness": "0/0", "author": "Tracie L McDougall \"traciemcd\""}, {"rating": 5.0, "review": "Aweaome", "verified": true, "helpfulness": "0/0", "author": "Tedd Johnston"}, {"rating": 5.0, "review": "I love the fire stick.  It's so easy to use and toy can access so much.  I ask myself why I didn't get it sooner!", "verified": true, "helpfulness": "0/0", "author": "Valerie"}, {"rating": 5.0, "review": "This thing is sick. Much slicker than my AppleTV IMO.", "verified": true, "helpfulness": "0/0", "author": "Matt Spikings"}, {"rating": 5.0, "review": "It works fantastic and I've been able to use it both at home and at the hotel when traveling.  It's nice to have the same entertainment options no matter where I am.  I subscribe to both Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "John Ryan Steffen"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]