[{"rating": 4.0, "review": "Fairly easy setup.  Great device for the money!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Everything i needed thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "penman"}, {"rating": 4.0, "review": "Good for.it use.", "verified": true, "helpfulness": "0/0", "author": "Terina Davis"}, {"rating": 3.0, "review": "Heavy on the Amazon content, so if you are deep into Amazon, this is great. Menus aren't always clear and I don't love that I can't really customize the arrangement (seems to be ordered by use). Interface looks nice and responds quickly. Don't know if will use it more than my Roku or Apple TV, but thought I would give it a try nonetheless. Based on initial experience, my preference goes: 1. Apple TV, 2. Roku, then 3. Fire TV Stick", "verified": true, "helpfulness": "0/0", "author": "Kevin K."}, {"rating": 5.0, "review": "Loads content very quickly.  Prime oriented but easy to install Netflix on it if you have it.  Use it primarily for Prime video, Netflix and WatchESPN.  All work great on the device.  Great product.", "verified": true, "helpfulness": "0/0", "author": "Jeff Castro"}, {"rating": 5.0, "review": "As a Prime customer this was offered for a two day \"special\" for $19.00 instead of the current $39.00 price. Amazon told me it'd be December 17th before I could expect delivery. I got it on December 6th ! UP and FULLY FUNCTIONAL IN LESS THAN AN HOUR ! And I'm NO TECHIE ! OUTSTANDING !I really like it allot. It took a \"little\" time till I figured out how to \"IT\" to my account; and a \"little\" time to figure out how to tie my  6 inch Fire HD to the Fire Stick / TV. My wife was ASTOUNDED and thrilled....My grandson, well, he put down \"his\" Fire HD and played the game apps on my Sony HD TV via Fire Stick...he loves.I highly recommend it. Easy set up; easy account synchronization; east sync with Fire HD tablets. (Our house now has [3] three.) Even at $39.00, what a nice easy way to enjoy one of the best Prime Account benefits.", "verified": true, "helpfulness": "0/0", "author": "Col. Stevens"}, {"rating": 1.0, "review": "Just got it today, and spent 30 min trying to set it tp.  It always stopped at the \"Connect to your network\" screen with nothing to choose from.  Called technical support, and learned that I wasn't the only one having this issue.  Quite disappointed.", "verified": true, "helpfulness": "1/2", "author": "LarZhou"}, {"rating": 5.0, "review": "Just a great product!", "verified": true, "helpfulness": "0/0", "author": "Cavalry06"}, {"rating": 4.0, "review": "Good product.dual core allows it to navigate quickly and playbook is smooth.only problems are occasionally when you unplug it you have to re-sign into everything.it it gets alarmingly hot after playing  blue rays over the network. Excellent product other then that.", "verified": true, "helpfulness": "0/0", "author": "Michael G."}, {"rating": 3.0, "review": "I really like being able to watch everything I want, but there are some functionality issues that keep cropping up. The input is super annoying when you're trying to put in passwords. The remote is kinda crappy and mine already has a button stuck. Navigating is awkward with the remote and sometimes I get signed out of Netflix, prompting more wrestling with the remote. But once you stop and just watch, I really like the streaming quality. Overall, I still like it but I think there are issues that need to be addressed. Also, I use campus housing and I cannot use my username/password WiFi directly, I had to get a router and set up a secondary WiFi system just for my room. Just FYI. Also, you can't sign in on networks that you have to accept terms for (open public things like hotels etc)", "verified": true, "helpfulness": "0/0", "author": "ehousehay"}]