[{"rating": 4.0, "review": "Awesome product, works great. Just doesn't have all the apps I would like to watch my favorite shows.", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 5.0, "review": "Great i have 3 FTVS in my home love it", "verified": true, "helpfulness": "0/0", "author": "Roberto G. Perez Irizarry \"ropeti2010\""}, {"rating": 5.0, "review": "Easy to use, great to have!", "verified": true, "helpfulness": "0/0", "author": "Elliot Rubin"}, {"rating": 4.0, "review": "First one I got wouldn't pair with remote. Tried putting remote 2 inches from Fire TV Stick, using the HDMI extender, not using the HDMI extender. putting fresh batteries in, NOTHING.Edit:Amazon was going to send me a replacement, but at the last minute, I decided to try it out on the living room TV. It worked! Not sure if it was Bluetooth interference in the bedroom, but it works great in the living room. I have upgraded the rating to 4 stars. The interface works, if a little cluttered and the loading speeds are faster than loading similar apps on my PS3 or Xbox 360, plus it uses less electricity to just have the Fire TV Stick plugged in. Audio and Video quality are the same as those consoles. The ability to play basic android games is neat. Some games work on the Fire TV Stick Remote, but obviously you would get benefit (better controls) if you buy the Amazon BT Gaming Controller, or just use a BT one you have laying around.I haven't tested if a PS3 or Xbox 360 controller would sync to the Fire TV Stick.The stick does get hot after a while, and despite what the message said about not supplying enough power from the TV's USB, it has been working just fine the last 4 hours of testing. I haven't experienced any wifi connectivity issues either.This device has essentially turned my dumb TV into a SMART one!", "verified": true, "helpfulness": "0/0", "author": "Cool Spot"}, {"rating": 4.0, "review": "Was received as a gift.  Simple to setup and everything I would expect. Great gift and recommend it as a gift to yourself or another.", "verified": true, "helpfulness": "0/0", "author": "Douglas bridges"}, {"rating": 2.0, "review": "I had high hopes for the Fire Stick when the price came down. I had been using Chromecast and had been happywith it but wanted to stream Amazon Instant Videos. Unlike the Chromecast, the Fire Stick took some effort toinstall and it has frequent streaming disruptions which almost never happened on Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jonathan G Heller"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Janice D."}, {"rating": 5.0, "review": "Perfecto!", "verified": true, "helpfulness": "0/0", "author": "Hedda Lettus"}, {"rating": 3.0, "review": "The Product is Great all around.  However, I was very Disappointed to find out I CANNOT Mirror my iPAD or iPHONE to the TV.That is a Critical Feature that I hope it becomes available soon....", "verified": true, "helpfulness": "0/0", "author": "Samuel Antoun \"AlliGator\""}, {"rating": 4.0, "review": "I really love this little thing!  It's super easy to set up and use.  I watch a lot of videos from Prime Video and the interface with Fire TV is better than any other platform.  We have had almost no issues with the streaming and the picture quality is gorgeous.  I'm totally spoiled now and hate to go back to another device to catch up on Game of Thrones!2 minor items keep me from giving it the 5th star-It's super easy to order and pay for new videos, which I love for me, but my daughter has rented Annie 3 times now!  I'm sure there is a setting I can change, and maybe I should just buy the movie, but I haven't yet.Also, there's tons of options for other apps to enable watching video from other sources, but I still need to have an account with a cable/satellite provider to use them (including for a channel like ABC).  I'm looking forward to the day that I don't need a month cable account and can just pay for the TV I want to watch.  I think Fire TV is getting close to the a la carte approach, but not everyone else is there yet.", "verified": true, "helpfulness": "0/0", "author": "Kim"}]