[{"rating": 5.0, "review": "EASY to use even for someone who can't run the DVD player!", "verified": true, "helpfulness": "0/0", "author": "Lisa Lafreniere \"SweepstakesEdge\""}, {"rating": 5.0, "review": "love love love it!", "verified": true, "helpfulness": "0/0", "author": "Darlene C. Franklin"}, {"rating": 3.0, "review": "Programming and the GUI looks and feels like it was done by committee it isn't logical and does flow with what you are trying to do. The programming also abens.", "verified": true, "helpfulness": "0/0", "author": "Jerry Reutlinger"}, {"rating": 5.0, "review": "Great tool", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a great product. I ordered this after the Prime special, but this is still dirt cheap. For $40.00 directly from Amazon, this is an absolute bargain. I had a Chromecast before this, but I wanted to side-load apps onto my TV. This is great, for $40.00 you are getting a dual core processor and 1 GB of RAM. Those are great specs for a device in this price range. I got the stick because I liked the form factor better. The lack of a voice remote is sad, but makes sense. Now, for Prime content this is great. Movies and TV shows load up instantaneously. Another thing, this device is snappy. Not fast, but snappy. It does everything well, but sometimes when going in and out of apps and then going home, or another section it will have to reload. Not a big issue, but it is still an issue, but is understandable. The Wi-Fi signal sometimes doesn't work. I have to reboot to get it to work again, but when it's connected there is no problem. Apps work well, and there is a descent selection of them. The main feature I got it for is the side-loading. Side-loaded apps work great, but the ones that have touch-only interfaces and can't work with a controller either require a Bluetooth mouse of an app on you phone called Wu-Kong remote. I use Wu-Kong remote because it is free. Both work well though. In conclusion, this is great product at a great price-point that blows all other \"sticks\" out of the water. I would recommend this to anyone that has Prime and wants to put their movies or music on the TV.", "verified": true, "helpfulness": "0/0", "author": "Slezak Home"}, {"rating": 5.0, "review": "Have only had it a week but I am absolutely thrilled with this purchase.  I discovered tv shows I'm fully enjoying on amazon prime and connect easily to Netflix for my account there.  The tv I bought this Fire Stick for has no connectivity--though it is an HDTV--so the Fire Stick does exactly what it's intended to do and provides me plentiful programming for the one-time purchase price of this item.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works like a dream!", "verified": true, "helpfulness": "0/0", "author": "Tina M Stewart"}, {"rating": 5.0, "review": "I Love this device. The TV in my Hobby room is not fancy but with this device I can watch regular TV or  enjoy a Movie on Amazon Prime or watch Netflix plus other things too.  To me this was the best thing to come along in a long while, thank you", "verified": true, "helpfulness": "0/0", "author": "Baty724"}, {"rating": 3.0, "review": "Won't hold mirroring.", "verified": true, "helpfulness": "0/0", "author": "Rafa"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "higdon37327"}]