[{"rating": 4.0, "review": "I like the fire stick and it's selections. I am disappointed that I have to to plug it into a power source. Tried  using the additionally purchased adaptor which was a waste of money.", "verified": true, "helpfulness": "0/0", "author": "chris baer arter"}, {"rating": 5.0, "review": "This is the best little gadget ever.  Easy to install and I actually use my TV now.", "verified": true, "helpfulness": "0/0", "author": "Mrs. Sharon A. Tobar"}, {"rating": 5.0, "review": "Fantastic", "verified": true, "helpfulness": "0/0", "author": "Erinn O'Doughda"}, {"rating": 4.0, "review": "Price drop", "verified": true, "helpfulness": "0/1", "author": "Mia"}, {"rating": 5.0, "review": "Super easy to install and navigate. I use this ALL the time now. I didn't have cable before but I could see this being a great replacement for cable. I love it!!", "verified": true, "helpfulness": "0/0", "author": "WendyInMotion"}, {"rating": 1.0, "review": "I can NOT connect the netflix, and can NOT buy a movie, don't work", "verified": true, "helpfulness": "0/1", "author": "Claudio Ribeiro Ruiz"}, {"rating": 4.0, "review": "Its ok.", "verified": true, "helpfulness": "0/1", "author": "Leslie A."}, {"rating": 5.0, "review": "This has been the best thing we purchased on Amazon. I love the ability of watching Netflix in our bedroom and all the options on Amazon Prime. This has been a great alternative to buying a smart TV. Works great. Easy to use and set up. WIFI connectivity has been working fine. Also paired the App on my iPhone to it. Works well. Only had an issue once with it not connecting. I still have Comcast XFINITY box in my room. You can have both on the TV, each on its own HDMI.My mom also bought one after seeing mine. We have two in the house, the next floor up and no problems with connectivity with two in the house.", "verified": true, "helpfulness": "0/0", "author": "lmmercurio"}, {"rating": 5.0, "review": "Works great!  Gotta love this.  Everyone should get one.", "verified": true, "helpfulness": "0/0", "author": "clairebear694"}, {"rating": 5.0, "review": "I love this! It is everything that they say you're getting. I also love the app you can download to use your phone as the remote.", "verified": true, "helpfulness": "0/0", "author": "Laren"}]