[{"rating": 5.0, "review": "This streaming stick went way above my expectations. Especially if you have prime then you have access to tons of new and original AND good series plus games, apps, movies and much more. Completely blows apple tv out of the water in my opinion.", "verified": true, "helpfulness": "0/0", "author": "thrifTmama"}, {"rating": 3.0, "review": "Disappointed that DirecTV isn't supported by many of the apps, Showtime, A&E;, Disney, ABC....  Also many fewer apps than Apple TV", "verified": true, "helpfulness": "0/0", "author": "Kevin Brown"}, {"rating": 5.0, "review": "VERY easy to install and use.  Great product!", "verified": true, "helpfulness": "0/0", "author": "James B."}, {"rating": 5.0, "review": "I luv my firestick. Gives a very clear picture and easy to use", "verified": true, "helpfulness": "0/0", "author": "Chesny L.Vargas"}, {"rating": 5.0, "review": "Love this device! Everything about it!", "verified": true, "helpfulness": "0/0", "author": "Krista"}, {"rating": 5.0, "review": "Very reasonable way to turn an older TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Thomas H. Whitt"}, {"rating": 4.0, "review": "Very good product except it is very difficult to open case to put in new battery.  That is why onlygave 4 stars", "verified": true, "helpfulness": "0/0", "author": "Barbara A., Mintz \"Babsie\""}, {"rating": 5.0, "review": "Love the fire stick. Very glad I got it.", "verified": true, "helpfulness": "0/0", "author": "kevin"}, {"rating": 4.0, "review": "Love it!  I did struggle a bit to find a FAQ section on Amazon as the Fire TV Stick was not finding my WiFi.  Once I found it - and my question was at the top of the FAQs - it was easy going.  I do not like that it has to be plugged in to get good performance, I was hoping for more flexible plug and play.  Also, I did struggle a bit with getting access to some apps as the log-in is my husbands email and not mine.  Not sure if this is a Fire TV issue or those apps - but there seemed to be a linkage since through my computer I could get access just fine.  Finally I would love to see Amazon get a better movie selection - especially for their prime users.  All in all great product.", "verified": true, "helpfulness": "0/0", "author": "Jenna S."}, {"rating": 5.0, "review": "Was definitely worth the wait. We got 2 of them. Easy to install and have worked very well. Amazon prime is a must with these. Lots of great movies and tv shows on demand.", "verified": true, "helpfulness": "0/0", "author": "gary"}]