[{"rating": 5.0, "review": "Love all the options for my grandchildren.  I babysit a 5 & 2 year old and they have found lots of fun things to watch on these many rainy days.  They especially liked the Amazon program Tumble Leaf.", "verified": true, "helpfulness": "0/0", "author": "David Cygnor"}, {"rating": 5.0, "review": "This does exactly what it is advertised to do.  It is very easy to install - I did it in 5 minutes.  I am using the stick on a small TV.  I love the idea that I can move the TV easily to any room and still have access to Netflix and Amazon Prime.  I think it is an excellent value!", "verified": true, "helpfulness": "0/0", "author": "dacster"}, {"rating": 5.0, "review": "Love this!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Item works great and was easy to set up. But be aware that if you have ATT Uverse and you are looking to watch shows on A&E; or The History channel this won't work. ATT Uverse is not an option when you go to log in to your cable provider, that should have been mentioned in the description since it is one of the top service providers.  That was the primary reason I purchased this product, if you have ATT Uverse you might want to explore other options.  Works great with Netflix and Amazon Prime movies.", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 5.0, "review": "I was very happy with firestick. It actually worked better than the WiFi on my blue ray. Love it", "verified": true, "helpfulness": "0/0", "author": "LaTashia Johnson"}, {"rating": 1.0, "review": "Had issues getting device working with my firewall which was providing DHCP, FortiGate 60D.  Seemed to get an IP address but could not talk to the network.  Opened a ticket with their support, not able to resolve so RMA'd.  Their support was great to work with from a customer support perspective.  I bought the Fire TV instead, it works from a network perspective but from a usability stand point it does not work well with my ISP.", "verified": true, "helpfulness": "0/0", "author": "Michael L Thompson"}, {"rating": 2.0, "review": "still not able to access anything.  I think detailed instructions need to be included rather than cursory one on box.  Also a customer service number to call would be nice,  This Stick may be intuitive for some, but not for Senior Citizens.", "verified": true, "helpfulness": "0/0", "author": "margaret large"}, {"rating": 5.0, "review": "Bought for my 78 year old father.  Wasn't sure if he'd understand it but he loves it.  I left written instructions on how to use and he said it has been very easy to work.", "verified": true, "helpfulness": "0/0", "author": "sandy shelton"}, {"rating": 2.0, "review": "Too much reliance on being an Amazon Prime member.  Not user friendly.  Too easy to inadvertently buy something, and not easy to cancel.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "We have been using it for just about a week on our bedroom TV. It was easy to install and get started.  We noticed quickly that it buffered a little less than the WII did but it still buffered.  The picture quality is good, the apps and connections are many more than we need and had before. It would have been a 4 star review but, yesterday it just lost it's connection to the internet and wouldn't reconnect.  I was willing to work with the little bit of buffering but not reconnecting to the WIFI is a big deal.  I can't buy one for the kids TV because I can't trust it will put up with the demands they would put on it.", "verified": true, "helpfulness": "0/0", "author": "MattRomney"}]