[{"rating": 5.0, "review": "I absolutely love it! The picture is really clear too. I just wish it had HBO go", "verified": true, "helpfulness": "0/0", "author": "Kelsey Chalmers"}, {"rating": 2.0, "review": "Did not allow many apps.  Bluetooth mirroring was bad or cut out and would not reconnect.  Used power cord and was mirroring from a kindle fire so I give it some stars for ease of use.  Would never recommend this product.  Will not stream comcast content", "verified": true, "helpfulness": "0/0", "author": "Active Ennui"}, {"rating": 5.0, "review": "Love! Love! Love! Easy to install! Easy to use! All my prime instant video on my big screen!", "verified": true, "helpfulness": "0/0", "author": "Chrishelle"}, {"rating": 5.0, "review": "Easy to Install", "verified": true, "helpfulness": "0/0", "author": "Martha J. Callahan"}, {"rating": 5.0, "review": "My family like it all the apps , but i cant download Vudu please update that appI will gonna buy another one", "verified": true, "helpfulness": "0/0", "author": "ricardo  gomez"}, {"rating": 5.0, "review": "Very user friendly, great selection of apps. Really like that it does not require a device to mirror for use. Only complaints are that the keyboard is inconsistently QWERTY or alphanumeric, text is a little small on my 32in flatscreen, and would LOVE the ability to have a multi app search option for movies and tv shows. Overall, Very satisfied!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "Best invention since sliced bread. Just ordered the second one. After 25 years of satellite tv, my Dish just might get broken. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Russell English"}, {"rating": 5.0, "review": "The Fire stick is working very well...the picture is good and the format is very easy to use.  I highly recommend it.  We travel for the winter and it's very easy to take back and forth.  Just plug it in!", "verified": true, "helpfulness": "0/0", "author": "Judith I Piland and Kenneth M. Piland"}, {"rating": 4.0, "review": "A good tool.  The movies occasionall get stuck in downloading but that may be my internet connection.", "verified": true, "helpfulness": "0/0", "author": "John S. Marr MD \"tgkameron\""}, {"rating": 5.0, "review": "I absolutely love it. So easy to connect. Once connected very easy to navigatr.", "verified": true, "helpfulness": "0/0", "author": "Linccow"}]