[{"rating": 5.0, "review": "Love it!!!!!!", "verified": true, "helpfulness": "0/0", "author": "DJ Campbell"}, {"rating": 5.0, "review": "Wonderful for any TV in the house without cable.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Protheroe"}, {"rating": 4.0, "review": "It's a very awesome device. The only thing  left to give a .perfect score to this device will be to add more and apps like other similar device have like chromecast and roku.", "verified": false, "helpfulness": "0/0", "author": "Carlos73"}, {"rating": 5.0, "review": "Plug and play it is so simple to use & the animated welcome is a treat.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Nice, works better then chromecast", "verified": true, "helpfulness": "0/0", "author": "eazizian"}, {"rating": 5.0, "review": "Really great product. Would definitely recommend to a friend.", "verified": true, "helpfulness": "0/0", "author": "Amanda Powell"}, {"rating": 3.0, "review": "Works well, very good picture.  Extremely small number of channels compared to Roku.", "verified": true, "helpfulness": "0/0", "author": "Joseph Buchanan"}, {"rating": 5.0, "review": "Awesomeness!!!! If you do not have a smart TV buy this fire stick. It's faster than my blu Ray player with WiFi", "verified": true, "helpfulness": "0/0", "author": "Thomas Pannullo"}, {"rating": 5.0, "review": "Love this thing.  So much better than my chromecast, my smart blu-ray, and my smart tv.  I bought another for the bedroom.  Best money I spent this christmas", "verified": true, "helpfulness": "0/0", "author": "T. Clark"}, {"rating": 1.0, "review": "Pretty disappointed, buy it to see my shows while I'm working away from home (overseas) and as a user of Amazon Prime I can not see the free content outside the United States. According to the description of the article: \" Perfectly Portable. Take it with you on the go.Take Fire TV Stick with you and never miss an episode while you’re away from home visiting family or friends.\"As usual, Amazon does not explain the exact description of what can or can not do with the product...", "verified": true, "helpfulness": "1/4", "author": "Cilian"}]