[{"rating": 5.0, "review": "I am amazed by this little device. I am able to do and watch more than I could with satellite TV's reruns.  For live channels I just use my antenna and other apps like sling TV.The best think about the fire stick is the fact that it puts everything (Netflix, SlingTV, Crackle, etc.) in one place. This is very convenient for me.", "verified": true, "helpfulness": "0/0", "author": "Roan Brown"}, {"rating": 5.0, "review": "Great product, very easy setup", "verified": true, "helpfulness": "0/0", "author": "Margaret Jean Steele"}, {"rating": 5.0, "review": "Like it so far although every now and then connection is lost. We have a Panasonic smart tv that turned dumb - couldn't connect to my network, Comcast said it's a TV problem, Panasonic said it's an ISP problem. Thought I'd try the Fire Stick as I have Amazon Prime and no connection or download problems at all. A little confusing having to download apps to watch YouTube, see my photos, etc on the tv but Website has helpful information.  The remote is far better than the remote with the Boxee streaming device I tried a couple years ago.", "verified": true, "helpfulness": "0/0", "author": "Grandma of 8"}, {"rating": 4.0, "review": "A better choice for the extra channels. We had been using a game box to get Netflix and Amazon because it was better than the smart TV's wifi reception. So much simpler to switch to and reception is great. Only drawback is that not all my games and apps from my Kindle were able to switch as advertised. We really wanted to play Mindcraft but not available. Customer Service informed me that it is only available on Fire TV not the Stick. Please.", "verified": true, "helpfulness": "0/0", "author": "R. Gordon \"\"A smile brings a smile.\"\""}, {"rating": 5.0, "review": "I love it. Perfect for movies, videos, music and different apps with full enterteinment. The only bad thing is that I live outside the US so some apps I can not use it because of the area restriction but besides that is just what I want it.", "verified": true, "helpfulness": "0/0", "author": "Jhonathan C."}, {"rating": 4.0, "review": "The fire stick works quite well, but seems limited in the web sites that it can access.  I had hoped that it would feature full access to PBS, and the BBC, but selections on those sites are limited.", "verified": true, "helpfulness": "0/0", "author": "Michael Jablow \"lover of tales\""}, {"rating": 4.0, "review": "I do like the fire stick, but wish I would have gotten the other one, it was thirty dollars more, and I do have it on another tv, but this one just takes a little more time.  But sure worth the time.", "verified": true, "helpfulness": "0/0", "author": "Joy Allen \"Joy\""}, {"rating": 5.0, "review": "One of the best values in entertainment delivery.", "verified": true, "helpfulness": "0/0", "author": "VinceHollaway"}, {"rating": 5.0, "review": "Love the Fire TV Stick.  I have Apple TV, which I really like, but this is such a reasonable price to add this capability for some great programming at Amazon!", "verified": true, "helpfulness": "0/0", "author": "CCReader"}, {"rating": 5.0, "review": "This is the second one I order. Love the firestick can watch what I want when I want", "verified": true, "helpfulness": "0/0", "author": "Annette Ridl"}]