[{"rating": 5.0, "review": "I recommend this Fire TV Stick to everyone.  I have both Hulu and Netflix and both are absolutely awesome and have given me so much viewing pleasure.  Please make sure to purchase this tool.  So much worth it!!", "verified": true, "helpfulness": "0/0", "author": "Awilda Vega"}, {"rating": 1.0, "review": "I was truly expecting to have a better view of the movies but it has me to spend more money to watch more movie.", "verified": true, "helpfulness": "0/0", "author": "Ezekiel"}, {"rating": 5.0, "review": "I do love my fire stick very easy to setup. I just don't have the time to sit back & watch tv", "verified": true, "helpfulness": "0/0", "author": "doris day \"doris day\""}, {"rating": 4.0, "review": "I took a chance on getting this Firestick as knowing what to do with it was a little beyond my age group's experience. Perhaps I didn't need it as my televisions are Smart TV's which means they have built in WireLess capabilites with Amazon, Netflicks, Hulu, HBOgo etc. But, whether I needed it or not, it is a joy to have an alternative to the dredges we usually have to chose from on cable.  We are not reality show fans, hate the shock shows (marriage at first glance, Big Brother etc.) and definitely are not into makeing show biz gossip equal to genuine journalism.  This Firestick has opened many more possibilities for us whenever we wish to escape our normal cable experience.", "verified": true, "helpfulness": "0/0", "author": "LegalBeagle"}, {"rating": 5.0, "review": "Easy to set up and operate.", "verified": true, "helpfulness": "0/0", "author": "Peggy J. Miller"}, {"rating": 5.0, "review": "Definitely worth it if you get Amazon Prime, Netflix or any other internet based service.", "verified": true, "helpfulness": "0/0", "author": "David Speight"}, {"rating": 5.0, "review": "Totally met our expectations.  Amazing device!", "verified": true, "helpfulness": "0/0", "author": "Kathleen A. Raut"}, {"rating": 1.0, "review": "I've never gotten this product to work in my home on any television.  I tried finding product support information and tried contacting Amazon with no success.  I buy from Amazon all the time, but this product has not made me happy!", "verified": true, "helpfulness": "0/0", "author": "Christina Price"}, {"rating": 5.0, "review": "Unbelievable.  This product is a stellar addition to my home entertainment system. I highly recommend this to anyone.  An easy addition to improve your social setting and home system!", "verified": true, "helpfulness": "0/0", "author": "Koolkat"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Jane L Aikens786630578"}]