[{"rating": 5.0, "review": "Very nice, access to Prime is nice, I enjoy using the iHart radio app on my TV.", "verified": true, "helpfulness": "0/0", "author": "Coach_A"}, {"rating": 4.0, "review": "The only way this product could get better was if the maker's had included a way the buy a season of the show you want to watch instead of having to buy individually when purchasing via TV.", "verified": true, "helpfulness": "0/0", "author": "Emily York"}, {"rating": 4.0, "review": "After each week or so of use, I have to clear the cache to stop the picture from lagging behind the sound.  Doing this causes you to have to sign in to subscriptions all over again.  Other that that, its a handy device that doesn't take up any space on the TV cabinet.", "verified": true, "helpfulness": "0/0", "author": "Susan Briggs"}, {"rating": 4.0, "review": "Needs a major twitch update,  which is owned by Amazon FYI.", "verified": true, "helpfulness": "0/0", "author": "kevin bishop"}, {"rating": 1.0, "review": "Does not work. They said it was programmed before it arrived. I have been with Amazon since 2004. The firestick says my account doesnt exist. Was on the phone with customer support for hours and they could not fix the issue. I will be sending this device back. It was a complete waste of my time. Do not, Do not under any circumstances by this device. You will be sorely disappointed!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Dose all it promises. Only complete is it links to your prim account and they don't make you use a password before ordering media. Its in my kids room (we don't have cable) and it has already cost me two movies. Other then that great easy set up. powerful connectivity to remote. More app then you ever use.", "verified": true, "helpfulness": "0/0", "author": "aaron"}, {"rating": 5.0, "review": "Awesome! Love our fire stick, so much so that we tossed out our chrome tv as soon as we set up the stick.It's very user friendly and syncs with our hulu and netflix account perfectly.", "verified": true, "helpfulness": "0/0", "author": "Jessica Abbott"}, {"rating": 5.0, "review": "So user friendly. This item is better than I expected, Netflix is such a think of the past... Amazon Prime is it for me.", "verified": true, "helpfulness": "0/0", "author": "Tracie L. Rusk"}, {"rating": 5.0, "review": "Using my Fire stick for netflix movies, it works great!", "verified": true, "helpfulness": "0/0", "author": "kerrigac"}, {"rating": 5.0, "review": "Perfect.  I already have Apple TV and Roku - but this is now my streaming device of choice.  Quick and easy to install.  Remote is always available on my IPhone, iPad and Kindle.", "verified": true, "helpfulness": "0/0", "author": "A2Z in NYC"}]