[{"rating": 5.0, "review": "The fire stick works very well.  I am pleased that my tv is now a smart tv without the expense of purchasing one.I also enjoy being a Prime member and having so much access to free movies.", "verified": true, "helpfulness": "0/0", "author": "Patsy \"Helen Charles\""}, {"rating": 5.0, "review": "Amazing! Easiest plug and play setup. Don't overthink it, just order it.", "verified": true, "helpfulness": "0/0", "author": "keezy"}, {"rating": 1.0, "review": "Connection issues forever and ever. Despite having strong signal and other devices streaming quickly, the fire stick always has to buffer of say that the signal is poor. I seriously just wanted it so I can watch Amazon Instant Videos on bigger screens than that of my laptop, but at least my laptop never has to rebuffer after each minute.", "verified": true, "helpfulness": "0/1", "author": "Sherry Flores"}, {"rating": 5.0, "review": "I love this fire stick", "verified": true, "helpfulness": "0/0", "author": "Mark Dennis"}, {"rating": 4.0, "review": "What great item. I love that I can watch an endless supply of movies, TV shoes and documentories. I also, added my flixster account and can now watch those movies. Thanks amazon for easy to use and timely product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Lanetia"}, {"rating": 5.0, "review": "This is the best thing since sliced bread.  It is so easy to setup and use.  Absolutely awesome.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I had a small problem when I started, with Netfilx not being able to play. The first time I called the person, was not english, and thoguht it was a bigger problem then it was.I got an email that did not make any sense. How do you even find the old the Netfilx app, the red one, not the white one? Does not even make any sense?The second time I called, the day after I got it. I got in english person that helped me, to fix by just cleaning out the cache, and it was working again.Now a week later, I love it,", "verified": true, "helpfulness": "0/0", "author": "s.Shimkus"}, {"rating": 5.0, "review": "I picked this Amazon Fire Stick up at a really good price on Prime Day. I was shocked to see it arrived the next day, which happened to be my birthday too. We are enjoying the features of Hulu, Netflix, Prime movies and TV shows, along with games and other apps such as radio apps. I have an iPad Air 2, so I intend to take my Fire Stick with me when I travel too! It is great to watch movies on while at hospital or doctors office too! I look forward to many years of enjoyment out of my fire stick. I don't have a cell phone, but I added the fire stick app to my iPad Air 2 and can talk into mic to pick shows to watch by voice too. We just love this!", "verified": true, "helpfulness": "0/0", "author": "Terri Berg"}, {"rating": 5.0, "review": "Better than Dish!!! More with prime, plenty movies, I love the music! Very streamlined, and super fast!", "verified": true, "helpfulness": "0/0", "author": "Yvette Hall"}]