[{"rating": 3.0, "review": "How much does this charge a month? Cause money seems to be token out my card every month. A lot at that so someone please tell me", "verified": true, "helpfulness": "0/0", "author": "Dayzha"}, {"rating": 5.0, "review": "worth every penny", "verified": true, "helpfulness": "0/0", "author": "Good Granny"}, {"rating": 5.0, "review": "Already had a fire on one TV bought the stick for the bedroom TV, they work well together.", "verified": true, "helpfulness": "0/0", "author": "Happy reader"}, {"rating": 5.0, "review": "Very frustrated. Can't get it to work", "verified": true, "helpfulness": "0/0", "author": "Diane Glass"}, {"rating": 5.0, "review": "This little device is awesome, it has thousand of movies I.m thinking of throwing away my direct TV!", "verified": true, "helpfulness": "0/0", "author": "Guillermo Marranzini \"Guillermo\""}, {"rating": 1.0, "review": "the fire stick was a big let down because it would not allow me to watch netflix movies and it does not assk for Netflix account no type of instructions is the biggest flaw", "verified": true, "helpfulness": "1/1", "author": "art huntley"}, {"rating": 5.0, "review": "It work perfect", "verified": false, "helpfulness": "0/0", "author": "Meleck"}, {"rating": 2.0, "review": "This product does not compare at all to Apple TV. While Im a prime member, I find that every movie I want to watch requires a rental fee. The platform for searching is not nearly as user friendly as Apple TV. The music does have a kareokee feature which is cool. All the words on the screen. My wife loves that. The movies we have watched doen't seem to show in high resolution on my plasma tv which i find frustrating.", "verified": true, "helpfulness": "1/1", "author": "Randell S. Southland"}, {"rating": 5.0, "review": "I LOVE my Firestick!  It was everything I had hoped for. It exceeded expectations. Very easy and simple setup. I'll be buying more as gifts!", "verified": true, "helpfulness": "1/1", "author": "Nona"}, {"rating": 1.0, "review": "what a disappointment....I love amazon but this stick does not work...blue screen, no picture...HDCP signal....I sent it back...hope Roku is better.Lee", "verified": true, "helpfulness": "0/0", "author": "D.J."}]