[{"rating": 5.0, "review": "I love my Fire stick! I replaced my Roku and the buggy apps on my smart tv.", "verified": true, "helpfulness": "0/0", "author": "K. Wong \"superkat\""}, {"rating": 5.0, "review": "Have only had this a couple weeks but so far ..LOVE! More than worth the money.", "verified": true, "helpfulness": "0/0", "author": "hoffysgirl"}, {"rating": 1.0, "review": "Bought it as a prime video streamer for the secondary TV....regret the purchase citing bad wireless performance....I have an older Logitech revue on the same TV and the wireless connectivity is a charm.....wish amazon would sdo something about it....", "verified": true, "helpfulness": "0/0", "author": "Immanuel Samuel"}, {"rating": 4.0, "review": "I regret buying this device!  It does not consistently work with Netflix.  When it does work it is great but most of the time it will not load Netflix selections.  We have given up using it and went back to our old Roku.  We tried the various \"fixes\" and even replaced the unit.  A waste of time and money - if you want to access your Netflix account.UPDATE:  The unit was upgraded on 4//10/15 to version 54.1.1.0 and appears to work with Netflix - so far.  Hopefully the upgrade took care of the issue.  I like to use it when it is working correctly.UPDATE #2:  The upgrade did not fix the problem.  Can't consistently load Netflix.  Back to the Roku..", "verified": true, "helpfulness": "0/0", "author": "Kent Smith"}, {"rating": 1.0, "review": "technically it works as advertised; but, and this is a big but, it only serves any use if you have a paid subscription service--like amazon prime, hulu, nexflix, etc...... without those it dont work any better than a sea shell", "verified": true, "helpfulness": "2/6", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to set-up and use. Love it so far. Only 4 stars because we've only had it for two weeks.", "verified": true, "helpfulness": "0/0", "author": "James \"James\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Dori"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Nnhunter"}, {"rating": 5.0, "review": "I bought this for my mom and sister to use on a television in my house that doesn't have a cable box. I wish I knew about this months ago as I would have gotten one for myself instead of purchasing my smart TV... Its great... You can't go wrong with this", "verified": true, "helpfulness": "1/1", "author": "Seekret's Corner LLC \"Esty\""}, {"rating": 1.0, "review": "I have yet to be able to view any video- TV show or movie?When I select a video- it loses its connection to my WiFi.Even though it claims the connection is strong.I am totally disenchanted.", "verified": true, "helpfulness": "2/4", "author": "Eric Shepler"}]