[{"rating": 5.0, "review": "After running into so many technical problems with the ROKU, this is a breath of fresh air!  Fire TV stick doesn't have some of the apps or channels that ROKU does, but having the improved performance more than makes up for it.  Also appreciate that this is \"hidden\" behind the TV and doesn't require additional shelf space.", "verified": true, "helpfulness": "0/0", "author": "KJL"}, {"rating": 3.0, "review": "not that great. bought as a gift and was told it doesn't stream very well.", "verified": true, "helpfulness": "0/0", "author": "Casebear"}, {"rating": 3.0, "review": "This works great for Amazon's Prime Video service which I use 99% of the time.  I just wish it had an SD mode when the weather is bad and my service goes way down in performance.  It's HD all the time so make sure you have the bandwidth for it. No buffering, so if your internet has speed issues you will see the white circle a lot. Don't buy the SD version of any video. It will not play on the fire TV.", "verified": true, "helpfulness": "0/0", "author": "bondo \"bondo\""}, {"rating": 5.0, "review": "I do love this product however it is a little misleading in the commercials.  You cannot just plug it in to your TV usb port without having the power cord attached.  You do have to use the power cord and adapter that is provided in the kit so I don't like having the power cord hanging to the side of the TV.  But non the less it is great for the cost and is portable to any TV that has usb ports.", "verified": true, "helpfulness": "0/0", "author": "Looking for Great Deals"}, {"rating": 5.0, "review": "Great little device.  Slim, low profile, but it does need a power cord (which is included) but not showing on the actual images.", "verified": true, "helpfulness": "0/0", "author": "chicago esquire"}, {"rating": 2.0, "review": "Doesn't offer a lot of content beyond what is available through other boxes...", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "I love the Amazon Fire TV stick.  It has a simple and slick interface.  During playback, you can fast-forward or rewind 10 seconds at a time.  Very convenient if you want to skip tv show or movie intros.  I own the chromecast and Roku 3 and this feature is not available.  The Fire TV Stick is so portable that I can bring this with me when visiting friends and family or during vacations.", "verified": true, "helpfulness": "1/1", "author": "BL \"book addict\""}, {"rating": 5.0, "review": "haven't used yet. I'm sure I will love it.", "verified": true, "helpfulness": "0/1", "author": "Kona"}, {"rating": 5.0, "review": "So far I like it, i just installed and works just fine, downloaded Hulu Plus and was trouble free, Amazon Prime pictures also perfect, easy to navigate , image quality is perfect, looks like a winner for Amazon", "verified": true, "helpfulness": "0/0", "author": "Boris Milan \"borism\""}, {"rating": 5.0, "review": "great device, very pleased", "verified": true, "helpfulness": "0/0", "author": "Rm"}]