[{"rating": 4.0, "review": "I only subscribe to Netflix so that's all I can watch. You have to pay for HBO, prime, and ESPN. I love it for my children's room", "verified": true, "helpfulness": "0/0", "author": "Ty"}, {"rating": 5.0, "review": "The stick is seamless while streaming.  My grandchildren enjoy youtube and games the most and the stick is up to the challenge.", "verified": true, "helpfulness": "0/0", "author": "Jerry Godfrey"}, {"rating": 5.0, "review": "About the best thing since sliced bread. Really easy to setup. Just plug in and connect to WiFi.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Too slow, I can't sync with YouTube using my iPhone and I can\"t use my Prime subscription to see movies and series, show me a \"license error\" message each time that I try to use.", "verified": true, "helpfulness": "0/0", "author": "Pedro G."}, {"rating": 5.0, "review": "Easy to use.  Kind of small.  Worried it might get lost in chair or couch.  I worry it will break easily since it is so small and light.  I need to keep it away from my cats because they will carry it away.", "verified": true, "helpfulness": "0/0", "author": "Lina M. Passi"}, {"rating": 4.0, "review": "Amazing little device with a great price.  I'll probably be purchasing another one soon.", "verified": true, "helpfulness": "0/0", "author": "Daisy Rich \"educated reader\""}, {"rating": 5.0, "review": "Love this stick to watch NetFlex and other movies. Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Christine A. Mosley"}, {"rating": 5.0, "review": "Very Easy to use..", "verified": true, "helpfulness": "0/0", "author": "Lush"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Pay Points"}, {"rating": 5.0, "review": "I am so happy with my New fire Stick.  i was hesitant about ordering it at first,  I read all of the reviews and then made the decision to order it.  It has surpassed all my expectations.  Simple to install can't wait to order another one for my den.", "verified": true, "helpfulness": "0/0", "author": "Ida Mcgarity"}]