[{"rating": 5.0, "review": "Works great. .easy to setup. .great price.", "verified": true, "helpfulness": "0/0", "author": "JAMES MONTANO"}, {"rating": 5.0, "review": "I am loving the Fire TV Stick, my only wish is that I could stream a webpage if I wanted to", "verified": true, "helpfulness": "0/0", "author": "Austin Richards"}, {"rating": 1.0, "review": "Don't buy this without calling a Amazon support engineer to make sure it will even work with your tv. How can you sell a product and not at least disclose whitch tv's it is or isn't compatible with. Feel like I got duped. Last Amazon product I'm ordering. Not compatible with Hisense 1 yr old tv fyi.", "verified": false, "helpfulness": "0/0", "author": "david andrews"}, {"rating": 5.0, "review": "I enjoy my fire tv stick will get away with cable because u can watch same as on cable and b a lot cheapter", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fire TV stick is a great alternative to cable. You can watch all your Prime member content, plus Netflix and Hulu and other apps. Install is simple and fast, plug in the power cord, and insert the stick into an HDMI port on your TV. The stick comes programmed to your Prime account when it ships from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Dave \"i <3 books\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Betsy H. Bailey"}, {"rating": 5.0, "review": "Works great!Fantastic value!Can see canceling my cable subscription in the future!Streaming video is here to stay baby and Fire Stick/Fire TV is one of the best, especially if you are an Amazon Prime member.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "This works great. Wish the power cord was longer....but they have an adapter that can be bought for use in a smart TV with a USB connector. That would be suggested if your TV is mounted on wall and outlet is not near TV. Plan on buying that soon and another stick also. :-)", "verified": true, "helpfulness": "0/0", "author": "Peter M. Merola"}, {"rating": 5.0, "review": "Wow Amazon! From the box to watching in less than ten minutes!Plug it in to the wall. Plug it in to the TV. So simple!Fantastic!", "verified": true, "helpfulness": "0/0", "author": "K. Schratz"}, {"rating": 5.0, "review": "excellent item what expected...", "verified": true, "helpfulness": "0/0", "author": "Fernando Guerrero Salazar"}]