[{"rating": 5.0, "review": "Awesome Value!!!", "verified": true, "helpfulness": "0/0", "author": "webber"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "rhed one"}, {"rating": 1.0, "review": "Had to return, was incompatible with my Insignia tv, sound on tv shows but no sound on movies.", "verified": true, "helpfulness": "0/0", "author": "ken bowersox"}, {"rating": 5.0, "review": "Im am very happy with this product", "verified": true, "helpfulness": "0/0", "author": "SANDRA BENAVIDES"}, {"rating": 5.0, "review": "Oustanding product!!!!", "verified": true, "helpfulness": "0/0", "author": "Jefferson Nyborg"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "my toy"}, {"rating": 5.0, "review": "As a quick background: I'm an IT guy that already owns Google Chromecast, a Raspberry Pi, a Nexus tablet, a couple phones, a laptop, and a desktop PC.  In other words, I'm into tech.Pros:- Dead-simple setup for anyone with basic understanding of usernames and passwords.  For the truly tech-compromised, get them logged into WiFi and their Amazon account, and video demos go on to explain nearly everything else.- Radio remote.  This means Line-of-Sight is not needed.  No hunting for the sensor or needing anything visible at all.  This is truly a nice improvement on IR remotes for that reason.- Simplified remote.  Again, I could trust my parents to handle this just fine.  It has only needed buttons and no fluff.- Very speedy for the intended uses.  This is primarily for viewing digital content, so  Hulu, YouTube, Amazon Instant, Netflix, all of these are easy to find and operate at the  same rate as my full laptop.  I don't play games on it, although I'm sure simple ones will run solidly.- Price.  This is a lot of bang for the buck, on sale or otherwise.- Independent usable device.  Compared to the Chromecast specifically, this is nice to not have to use a tablet or phone.  For me, my Chromecast is also just fine, but using the comparison to my parents again, this is much easier for them.Cons:- Separate power requirement.  Unless you have a TV with a 1A power to it's USB port (unlikely in most TV's), you need a second power plug.  It's a small gripe.- Not all Android  apps are available, since they lock you into Amazon play store.If you are already invested in the Amazon circle, this is a very worthy addition.", "verified": true, "helpfulness": "0/0", "author": "Fenix8452"}, {"rating": 5.0, "review": "Super easy plug it in and start watching. I have prime service and everything was already pre programmed for me.", "verified": true, "helpfulness": "0/0", "author": "scott  williams"}, {"rating": 5.0, "review": "This is the best product I have ever purchased.  It does everything as advertised and much more.  It is wonderful with my Prime account and I feel like I have really got my money's worth.  Downside is there are not enough hours in the day to enjoy all of this entertainment one gets with this item.", "verified": true, "helpfulness": "0/0", "author": "Harold J Frazier"}, {"rating": 5.0, "review": "LOVE this! Definitely worth the money!", "verified": true, "helpfulness": "0/0", "author": "Amazingrace152"}]