[{"rating": 4.0, "review": "Easy to set up and works better than Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Steve Aspacher"}, {"rating": 5.0, "review": "Best product ever, easy to install, easy to use, easy to enjoy", "verified": true, "helpfulness": "0/0", "author": "ab7337"}, {"rating": 4.0, "review": "The fire stick is pretty easy to install and very easy to use with my LCD T.V  I like the fact that you can add addtl apps too.", "verified": true, "helpfulness": "0/0", "author": "ohYouFancy"}, {"rating": 5.0, "review": "Nice product.  1080p quality", "verified": true, "helpfulness": "0/0", "author": "jeremya972"}, {"rating": 5.0, "review": "I think my wife is becoming jealous, since every time we watch a show through the Fire Stick I say how much I love it. But in all sincerity, it is a great product for our needs. We love watching the NWSL (National Women's Soccer League) games and it is super easy to do through their YouTube Channel. Also, we have a Prime membership, so any TV shows, Movies, Music that are included in Prime are free to watch. Also, the quality of the images & content is excellent; shows and movies for purchase are usually offered in crisp HD format. Additionally, I have a Hulu and Sling account, so after activating both products to sync with the Fire Stick, streaming any TV or movies from those sites is easy. It is almost a complete package enough to get rid of cable. The only missing aspect is Fox Sports! Purchased through Amazon Prime when Sling and Amazon were offering it for free if three months of Sling was purchased upfront.", "verified": true, "helpfulness": "0/0", "author": "Lindsay Ryan"}, {"rating": 1.0, "review": "Horrible. I have the highest amount of internet you can get and my fire stick would freeze and load every 30 seconds. I couldn't watch anything so I took it back and got a chrome cast and it works 100%.", "verified": true, "helpfulness": "0/0", "author": "Ashley Horn"}, {"rating": 4.0, "review": "As an early adopter, I had Apple TV back in 2010 before streaming was on most peoples radar. In 2012 I bought a ROKO as well followed by chromecast in 2013. Bought the Firestick in 2014 when it launched, being an amazon prime customer it made sense to have it to access all that prime content. The interface is simply brilliant and blows away the competition, the voice search is simply incredible and seals the deal.What I DO NOT like about it is that Netflix is very choppy when viewing via the firestick, I also have a SONY smart TV with built in netflix app so I'm able to do a side by side comparison. When viewing Amazon video content, or showtime anytime or HBO GO or History Channel content the firestick performs relatively flawless....start viewing netflix and it stutters ALOT to the point of annoyance that I have to switch to my TV based app. It would be great if they could get the bugs out so that the performance is comparable to the other content providers in which case I would give it a 5 star review. Also many are unaware that there is an app for your IOS device which gives you the voice search ability without having to cough up the extra bucks for the remote with that feature", "verified": true, "helpfulness": "0/0", "author": "The New Guy In Town...."}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "lesbio c"}, {"rating": 5.0, "review": "We are very pleased with this product.  We were on the search for a Smart TV to replace our main TV, which is almost 10 years old, but still works perfectly.  We aren't techies by any means, so got some input from someone who is.  This worked great right out of the box, and we are enjoying a \"new\" Smart TV for probably 1/10 the price.  And, it's portable!  So, when we travel, we can take it with us & plug it in wherever there is a compatible TV and WiFi.", "verified": true, "helpfulness": "1/1", "author": "WandaH \"Ginger in SC\""}, {"rating": 2.0, "review": "I have problems with saying it's unavailable/ wi if connection lost. But in settings it shows wo do signal strong. Not sure if it's the stick or something else. All other wireless works during these issues. It'll drop what ur watching every couple minutes", "verified": true, "helpfulness": "0/0", "author": "Julie Winters"}]