[{"rating": 5.0, "review": "Absolutely love this. As long as I have Amazon Prime and Wifi, I can watch a gazillion shows, movies, etc. It's great.", "verified": true, "helpfulness": "0/0", "author": "Carol Bernat"}, {"rating": 5.0, "review": "I couldn't live without this little guy... Love it!", "verified": true, "helpfulness": "0/0", "author": "lindsay"}, {"rating": 4.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "bhebishan achaibar"}, {"rating": 3.0, "review": "...Meh... Although Amazon boasts ASAP technology that buffers streaming, all the shows we watch via fire stick get hung up and are constantly \"loading\". When using our Blue Ray player we don't have this issue.  I got it free bc we'd subscribed to 3 months of Sling TV, otherwise I would have returned it.3 stars because it shipped quickly, was super easy to install and understand how to use, and because it's a great concept.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jaime Tudor"}, {"rating": 5.0, "review": "The Fire TV stick has easy to follow installation instructions, great for a technically challenged grandma.", "verified": true, "helpfulness": "0/0", "author": "Karen McGregor"}, {"rating": 5.0, "review": "I pre-ordered this in October 2014.  It was not expected to be much.  But, after I got it, installed XBMC (now KODI), man, I'd like to say how great this TV stick really is.First, it is suprisingly fast, and it out performs many other tv boxes.Second, the things you can do with this stick is pretty much endless, after installing XBMC.I bought an HDTV Antenna for $6.99 on Amazon.I bought a Silicon Dust HD HomeRun dual channel which turns the ATSC HD Antenna signal into IP.Use XBMC with HD HomeRun Live video add-on, now I am able to watch all the TV's from Antenna, all the Amazon Prime Video, all the netflix, all the Youtubes, all from just one stick, for $19.99.  Even for $39.99 at regular price, it is still a much more integrated, easier to use device, than something like a . . . .  Raspberry Pi?I'm usually not a fan of Amazon devices, but this one really rocks.", "verified": true, "helpfulness": "1/1", "author": "Michael C."}, {"rating": 5.0, "review": "Everyone owning an Amazon Fire TV device greatly needs to speak out on the following statements. After a couple months of owning an Amazon Fire TV device, I have devised an extremely useful idea.  An idea that would be easily integrated into any Amazon Fire TV device. That same idea I have voiced with Amazon Fire TV device department a couple of times now. However, unless more people than me speak out to the Amazon Fire TV department, they won't change the current Amazon Fire TV device operations. My important idea consists of potential diverse opportunities for all of the Amazon Fire TV device users.1.  When the Amazon Fire TV device user initially starts up the Amazon Fire TV device, the Amazon Fire TV device user has the option to choose to be asked by Amazon Fire TV device a series of questions. The questions would be geared around questions such as \"what type of genre the Amazon Fire TV device user likes, what directors and or actors the Amazon Fire TV device user likes, etc..\"  The series of questions would aid the Amazon Fire TV device user in getting the chosen particular movies and or TV shows brought to them instead of having to search for the shows manually. It would pull the shows and or movies from Netflix, Pandora, Hulu plus and so on. The Amazon Fire TV device user wouldn't have to search each and every app for the movies and or shows of choice. This idea could be set up by the user at startup or at a later time. If the user don't want to spend the time at the initial startup, they can do it at a later time.2.  The Amazon Fire TV device unit would store usage of the Amazon Fire TV device user for about a week or two at a time. During that time, the Amazon Fire TV device unit would be paying attention to what the Amazon Fire TV device user watches. For example, if the Amazon Fire TV device user only watches horror movies and or TV shows then the unit would only display horror movies and or TV  shows. If the user only prefers to watch drama and comedy movies and or TV shows, that is only what the Amazon Fire TV device would display. It would be easily changed by the Amazon Fire TV device user. It would be a setting the Amazon Fire TV device user could choose to have the device do that.3.  The device would display a clock on the TV screen. In the settings of the Amazon Fire TV device the user could have the clock setting chosen. It would have the ability to be seen if the person uses the pause button on the Amazon Fire TV remote. Or, it could be setup to appear on the screen at a periodic session (every five minutes or ten minutes and so on).4.  Amazon Fire TV device users would be able to get an emailed summary of what they watched for the past week or two if they wanted the settings set that way on the device. When a Amazon Fire TV user rents a movie, they are emailed with the title of the movie. So why not?5.  If when the Amazon Fire TV device user gets a movie or show displayed to watch by the device, and the movie or show is on a paid app, then it would show to the user that the movie or show is on a paid app requiring membership. Then if the user wants to still continue to see the movie and or show, they would be able to.6.  If the Amazon Fire TV device user wants only a one star rated movie or show then the device only displays those to the Amazon Fire TV device user.7.  If the person only wants free movies or shows then that is all the device displays. Vice versa if the Amazon Fire TV user only wants paid movies or shows.8. If the Amazon Fire TV user only wants a certain director or actor then that is all that the device displays.9.  The speech recognition search button would allow the Amazon Fire TV device user to answer a series of questions that the device would need in order to have certain types of shows and directors and so on to be displayed. The search button has the potential to do vast multi tasks as well.10.  All apps are preinstalled. The Amazon Fire TV device user wouldn't have to install all apps. Except for if the app was a paid membership. Then if that is the case, then the Amazon Fire TV device user would have to manually install that app themselves.", "verified": false, "helpfulness": "0/1", "author": "------------------"}, {"rating": 1.0, "review": "try twonot working", "verified": true, "helpfulness": "1/3", "author": "Yuanqiong Tang"}, {"rating": 2.0, "review": "The Amazon firestick seems to work well for watching things like Netflix or Amazon Prime. If you're a charter communication customer you're out of luck for HBO Go or Showtime anytime. I've also found that the miracast doesn't work very well. trying to cast a movie to the fire stick is frustrating the picture is jittery and the sound fades in and out. I've read some other reviews of the fire stick ability to miracast and I have found that that is a common problem. I was hoping that there might be a fix for the picture quality but have been unable to find one. Unfortunately its past the 15 days that Best Buy will accept a return so I'm stuck with it.", "verified": true, "helpfulness": "1/1", "author": "Edward Collins"}]