[{"rating": 5.0, "review": "easy to use...great movies and TV shows...many choices would recommend it!!!", "verified": true, "helpfulness": "0/0", "author": "E. wuescher \"cool\""}, {"rating": 3.0, "review": "Ok-can't get all our pics to load", "verified": true, "helpfulness": "0/0", "author": "Lauren C."}, {"rating": 3.0, "review": "I like the streaming platform and all of the other services available on this device. The fire stick is super responsive in terms of moving thru the menu. This device does however lag way more than my roku or my smart blu ray player. Not sure what the deal is, but when it streams hulu or netflix, it buffers constantly. Amazon videos seem to play fine tho", "verified": true, "helpfulness": "2/2", "author": "Calvin Brown"}, {"rating": 3.0, "review": "It cuts out and freezes up. But it has a good picture and sound.", "verified": true, "helpfulness": "1/1", "author": "mark hanawalt"}, {"rating": 3.0, "review": "It seems like a good device.  Does not work with Charter cable to receive HBOGO or ESPN Watch.", "verified": true, "helpfulness": "0/0", "author": "Phillip Lawson"}, {"rating": 2.0, "review": "Could not do load, movies constantly freeze.  Not real good.", "verified": true, "helpfulness": "0/0", "author": "Frank R. Lima"}, {"rating": 4.0, "review": "Would be nice if it also had a web browser app. And overall would like to see more apps. But, it is easy to set up and you can access content from many of the top providers including Netflix and Hulu as well as obviously Amazon. Also happy to see an NBA app on there. I wouldn't mind seeing more and better games as well.", "verified": true, "helpfulness": "0/0", "author": "John DesJardins"}, {"rating": 3.0, "review": "Honestly love the Netflix, Ted, and Youtube. The only down side is the search from the home screen o my searches amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Isaac Dorton"}, {"rating": 5.0, "review": "Awesome! Just wished I would have done this sooner.  Signed up with Sling TV and received the fire stick at no cost.  I wish I had just ordered the fire stick and saved myself some money.  I don't care for Sling TV at all!  You have to pay $3.99 and up to watch a movie and the TV channels are sparse.  It also screwed up my video settings on my HULU and Netflix accounts.  Would not recommend Sling TV to anyone. The fire stick is a MUST HAVE :)", "verified": true, "helpfulness": "1/1", "author": "ManMed"}, {"rating": 3.0, "review": "I can't get it set up. I would love to see what it does. somebody help!", "verified": true, "helpfulness": "0/0", "author": "rebbecca pahinui"}]