[{"rating": 5.0, "review": "This was very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Patricia M Thatcher"}, {"rating": 5.0, "review": "Amazing device.  Highly recommend it if you have a good internet connection.", "verified": true, "helpfulness": "0/0", "author": "Kathy Macon"}, {"rating": 2.0, "review": "Having trouble staying connected to the WIFI.", "verified": true, "helpfulness": "0/0", "author": "jjjojoppppppppppppjhjhii"}, {"rating": 1.0, "review": "I tried this because of the price but took it back the next day...videos constantly buffered. At times the audio would play, but the video itself would be frozen. Just not good at all. Returned for another Roku, which has always been reliable.", "verified": true, "helpfulness": "1/1", "author": "Andrea Pildis"}, {"rating": 5.0, "review": "The fire stick for our money is heads above the competition.  The simplicity of installation and the ease of operation with a very well thought out remote control is just amazing.  The host of the pariferauls available through the fire stick  again simply amazing.", "verified": true, "helpfulness": "0/0", "author": "Joseph P Cottman"}, {"rating": 5.0, "review": "The fire stick works well streaming my favorite tv shows and movies. Great invention by Amazon and great price too.", "verified": true, "helpfulness": "0/0", "author": "LaMara Hicks"}, {"rating": 5.0, "review": "A pleasure to view programs without advertisements!", "verified": true, "helpfulness": "0/0", "author": "Ben Hayes"}, {"rating": 1.0, "review": "Did not work very good. Connection kept getting interrupted. Had to unplug it several times for it to work but then after 15 minutes would cut out again. Had to return as I feel it was a waste of money", "verified": true, "helpfulness": "0/0", "author": "Shannon LeBlanc"}, {"rating": 5.0, "review": "Great product.  It's simple, cheap and provides me with everything I need for my secondary (non-smart) TV in my bedroom.  The easy to use remote works great and doesn't require me to point it directly at my TV in order for it to work.  I am able to view Amazon Prime, Netflix, ESPN and videos stored on my local network storage (via a free app).  Does everything I need and I have no problems with lag/performance switching apps or with streaming video (local or from the internet).  Couldn't be happier!", "verified": true, "helpfulness": "0/0", "author": "W. Todd"}, {"rating": 5.0, "review": "love it ... works very well ... not hard to set up and comes with your acct info set in ..was great >>>>>", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]