[{"rating": 2.0, "review": "While it offered more entertainment, the fact that you can only access those apps that are \"stand alone\" is a disappointment to me.  While I know that this is not on you, I feel that the advertisement on the packaging is misleading.  Honestly if I had done the research I could have discovered this, so some of the blame falls on me.  However we have enjoyed the programming we now have.  Just feel you should be more \"up front\" with packaging.  (You asked and this is my answer.)  P. Reedy", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Disappointed that this needs a power source and plugs into the HDMI on your TV. It's kind of pointless to design a small sleek stick that plugs into the back of your TV when you have a cord hanging from it.", "verified": true, "helpfulness": "0/1", "author": "Smokey"}, {"rating": 5.0, "review": "The Fire TV Stick is great for the way that I watch television.  I never watch a lot of TV where I am keeping up with some series.  I do not care for commercials.  Cable service would be a waste of my money.  With the Fire TV Stick, there is plenty for me to choose.  I can watch what I want, when I want, commercial free...via Amazon Prime or Netflix.", "verified": true, "helpfulness": "0/0", "author": "fiveofsix \"fiveofsix\""}, {"rating": 5.0, "review": "This combined with netflix is awesome! We no longer need dish. We just find a series on netflix and start watching from the first episode and watch them all when we find time till they are all gone, sometimes it takes us a month or better to watch a series.", "verified": true, "helpfulness": "0/0", "author": "Mud-and-Guts"}, {"rating": 5.0, "review": "Very happy with the features and design! I enjoy Sling TV also!", "verified": true, "helpfulness": "0/0", "author": "Mike Spratt"}, {"rating": 5.0, "review": "I'm very happy with it", "verified": true, "helpfulness": "0/0", "author": "Al Bartz"}, {"rating": 4.0, "review": "Was unable to get consistent picture using a small tablet as the interface to play Amazon Prime movies on the furthest tv from our router. The Fire stick works like a champ, problem solved.", "verified": true, "helpfulness": "0/0", "author": "E. Turschmann \"FL Golfer\""}, {"rating": 5.0, "review": "works great after you figure out how to do it.  i recommend it for any one that doesn't have a smart tv.  you'll have fun with it. but you do need to have turbo speed on your internet.", "verified": true, "helpfulness": "0/0", "author": "Pauline"}, {"rating": 3.0, "review": "It streams slowly sometimes and then catches up. Some apps don't work.", "verified": true, "helpfulness": "0/0", "author": "Wshadow"}, {"rating": 5.0, "review": "Purchased as a gift, recipient is very happy with it.", "verified": true, "helpfulness": "0/0", "author": "J. Francisco"}]