[{"rating": 5.0, "review": "This device is ideal for someone who doesn't have a game system through which to access Netflix and Pandora. I'm really impressed by its ease of use and compact size so it doesn't interfere with all of the cables that we already have plugged in to our television. I have already recommended this to all of my family, as well as  my in-laws.", "verified": true, "helpfulness": "1/2", "author": "Mrs. Rose Taylor"}, {"rating": 5.0, "review": "Works as it says it will. No complaints.", "verified": true, "helpfulness": "0/1", "author": "Erin Draper"}, {"rating": 5.0, "review": "Love the ease of use....", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Its the best deal I have ever had in a very long time. I got rid of comcast and there reruns because of it.I mean they show movies from 20 years ago for months at a time. The bill is just sicking goodbye forever.  Than you fire stick", "verified": true, "helpfulness": "0/1", "author": "Michael Lehman"}, {"rating": 5.0, "review": "Amazon has outdone themselves. I'm a big fan of streaming media boxes. I mainly use the android Minix box but when Amazon had a sale I couldn't help but try the fire stick out for a streaming solution for the bedroom tv. I'm very glad I did. This is an excellent streamer. It's very fast. I've been able to side load applications that I like to use as well as Netflix and others. Everything I throw at it works perfectly. Even the remote control feels well build and quality. Amazon has earned my respect as a solution for quality streaming boxes. If this stick is this good I can't imagine how awesome the fire tv box is!", "verified": true, "helpfulness": "1/2", "author": "Travis"}, {"rating": 5.0, "review": "It's great, does everything as expected and worth the price. Was a bit disappointed it needed to be within a range of about 3 metres from my modem to properly work. That said, connecting to my Netflix and HBO GO account with ease and now I can flip my TV's input over to it and in mere seconds I'm watching my favourite shows.", "verified": true, "helpfulness": "0/1", "author": "Sarkames"}, {"rating": 4.0, "review": "works good but still a lot of dumb movies !!!", "verified": true, "helpfulness": "0/1", "author": "Daniel A. Bruno"}, {"rating": 5.0, "review": "good product, I use it to watch Netflix. very satisfied with the product", "verified": true, "helpfulness": "0/1", "author": "Juan"}, {"rating": 2.0, "review": "It does great with amazon prime but it does horribly when trying to send video to the tv from phone or tablet", "verified": true, "helpfulness": "0/1", "author": "Jason B."}, {"rating": 4.0, "review": "I am happy with the Amazon fire stick, the only reason I give it 4 out of 5 is due to it needing to be plugged into an outlet.  They fail to mention it isn't as pictured like a zip drive that can be plugged in to a T.V., thus avoiding a long cord like the HDMI plug.  I can stream shows easier and there is a better connection.", "verified": true, "helpfulness": "0/1", "author": "Mark Drake"}]