[{"rating": 5.0, "review": "No complaints, works great and the idea of saving money on cable and accessing other viewing options is wonderful.", "verified": true, "helpfulness": "0/0", "author": "JenRN"}, {"rating": 2.0, "review": "It comes with a few other pieces not featured in the picture of product. I couldn't put the drive into my TV without the other pieces (complicating it) and in the end, it still could not pick up my WiFi signal. I basically couldn't use it at all.", "verified": true, "helpfulness": "0/0", "author": "J. Maia \"mayling\""}, {"rating": 1.0, "review": "I am returning this fire stick and will try another one. Maybe this is just a defective one. It freezes, either both audio and picture, or just the picture.", "verified": true, "helpfulness": "1/2", "author": "Myrtle Mainor"}, {"rating": 5.0, "review": "The best thing ever.  I travel a lot and all I need is an internet connection and I can watch Netflix, Hulu, and any other station they have an app for and I have an account with. (of course your hotel room TV must have a an HDMI socket)  I'm currently using it while visiting my Granddaughter.  One con is I could not find an app for VUDU.", "verified": true, "helpfulness": "0/0", "author": "J. E. Howse"}, {"rating": 4.0, "review": "Pretty simple setup, this is used more than our Chromecast because of the handy remote.", "verified": true, "helpfulness": "0/0", "author": "E.L."}, {"rating": 3.0, "review": "It is user friendly and has Netflix and Hulu, but it lacks HBO Go or any way to sync or \"mirror\" your Kindle Fire (their product) or an iPhone or computer to the screen to watch anything.  Not sure why they don't have the same app compatibility as their other products like the Kindle Fire.  I am contemplating switching it out for the Roku or Chromecast, which have those options.", "verified": true, "helpfulness": "0/0", "author": "Mallory"}, {"rating": 5.0, "review": "I like it, my kids love it!", "verified": true, "helpfulness": "0/0", "author": "cynthia ccarrillo"}, {"rating": 2.0, "review": "I bought the Fire TV Stick.  Had trouble setting it up because it doesn't tell you where your password can be found.  I had to call my tv company.  Once I had it set up.  Then I scrolled through and found out that the shows and movies cost you money to watch.  I can watch these things on my laptop for free.  I'm returning the stick.  The advertisement needs to tell you about that and so should the packaging.", "verified": true, "helpfulness": "0/1", "author": "tulip"}, {"rating": 2.0, "review": "This was great at first, Now it freezes ALL THE TIME!!!! It started freezing primarily with HULU and on certain networks, but now it doesn't seem to matter if it is amazon, hulu, or whatever... its super frustrating! I want to love it but I'm back to watching shows on my computer for now.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "I absolutely LOVE the Amazon Fire TV Stick. It has great graphics and is easy to use. It's also great that all of my music is available on my tv now.", "verified": true, "helpfulness": "0/0", "author": "Aishah Bilal"}]