[{"rating": 4.0, "review": "Quick shipping. Easy setup. Lots of content, especially with the prime service. premium channels will require payment per episode/season or will require cable provider of some sort already. Does exactly what I expected and love the portability of the stick. Will recommend to others.", "verified": true, "helpfulness": "0/0", "author": "vp"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "Donna Caudillo"}, {"rating": 4.0, "review": "Works great.  Only internet is satellite and I can't afford the streaming cost for data", "verified": true, "helpfulness": "0/0", "author": "Nooker-Doo little Roo"}, {"rating": 5.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "steve"}, {"rating": 5.0, "review": "I love Fire TV!!! I  is the most affordable  product I bought!  It does and has everything mivies, TV and games! I  have so much fun with my daughter,nieces and newphews.  They is something for everybody.", "verified": true, "helpfulness": "0/0", "author": "Jessica Pirozzi"}, {"rating": 1.0, "review": "DO NOT BUY! The fire stick has a lot of problems.  It is always buffering during a game or show.  My wife and I like to watch baseball on ESPN.  The Fire Stick would always freeze when the game got exciting.  I would have to reboot it and miss part of the game. If you are watching a long game, the device gets hot and will shut down.  I went to Best Buy and purchased the Fire TV.  Hooked it up in place of the Fire Stick and have not had any of the problems I had with the stick.", "verified": true, "helpfulness": "1/1", "author": "David Ouwenga"}, {"rating": 5.0, "review": "I used it for my old style TV with HDMI plug, then my TV becomes smart TV (I can log in wifi and see movie direct on TV, and I can share movie from my phone to TV)", "verified": false, "helpfulness": "0/0", "author": "amidaphat"}, {"rating": 5.0, "review": "This little stick is one of the best purchases I have ever made!!! It has transformed  a room with out cable into the most used space now!!!", "verified": true, "helpfulness": "0/0", "author": "BEJEAN"}, {"rating": 5.0, "review": "I am not a tv watcher, but love the idea that I am only paying for wifi and can watch movies when the mood hits with my prime membership. It was so easy to set up!! Enjoying  it greatly.", "verified": true, "helpfulness": "0/0", "author": "Brenda"}, {"rating": 5.0, "review": "I love the fire stick.  It was simple to set up and use.", "verified": true, "helpfulness": "0/0", "author": "athom"}]