[{"rating": 2.0, "review": "I wanted this to mirror my phone or PC. After many failed attempts I finally got it to work with the PC enough to watch a movie, it would not connect again the next day. After reset and reboot etc. I got it to mirror the phone once.I have Amazon prime and have yet to find an included movie/show that I want to watch, everything is $3 and up. It is packed with a lot of apps like Netflix, IHeartRadio, Hulu and others but I also have those apps on my Blu-Ray player and my Tivo.The stick it so slow to connect to anything, It would take a full minute or two transition from the home screen to the app.  I only got it to connect to iHeartRadio once.", "verified": true, "helpfulness": "1/3", "author": "Ronald Ragan \"Ron\""}, {"rating": 5.0, "review": "When we received the Amazon fire tv stick it was packaged nicely.  We opened it and found that it did include all the connections we needed for it to work with our tv. The applications on it are all easy to find and use. We would highly recommend this product because it is easy to use, is small in size, and allows us to get more use from our Amazon prime membership.", "verified": true, "helpfulness": "0/1", "author": "Breanna"}, {"rating": 5.0, "review": "small yet packs a great many option,easy to install.", "verified": true, "helpfulness": "0/1", "author": "tc"}, {"rating": 5.0, "review": "Easy and we love it", "verified": true, "helpfulness": "0/1", "author": "feverpitch"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "H. G. forwarding  Maca Romo"}, {"rating": 5.0, "review": "This is the perfect companion to every traveler!It works on Amazon, Hulu, Netflics, and hundreds more.And it works with the hotels captive portals. So you can go right online and watch whatever you want without cloning your IP, standing on one leg, or waiting for the wind to blow from the South.A couple of issues to be aware of though.One:The product looks like you can plug it into the back of the TV and it just works. You have to plug it into a power source. So, either carry and extension cord or a long USB micro-B style cable. Many hotels have power easily accessible but, you will find many that do not. I was at a Holiday Inn Express recently that bolted the TV stand to the floor. Not the TV, just the stand! LOL I do not know why. I could not reach the outlet behind the TV.**** Two: Some hotel employees are not aware of the captive portal and have no idea that it can be turned on and off. So, if the captive portal does not pop up on your other devices, it may not show up on the Fire Stick either. On your tablet, you would simply try going to a web site and it generally appears but, you can't do that on the Fire Stick. In those cases you will have to call the front desk and ask them to contact their provider and turn the captive portal on. Be prepared to hear a long blank pause on the other end in some cases. LOL", "verified": true, "helpfulness": "0/1", "author": "Soundaround"}, {"rating": 4.0, "review": "Very handy for vacation with grandkids. Games and online video equals happy campers.", "verified": true, "helpfulness": "0/1", "author": "Tim"}, {"rating": 2.0, "review": "Was great at first. Then slowly things started to go sideways. Now every single time I start any video there is 2 mins of video, a lock up of the video while the audio keeps rolling and then the video catches up 30 seconds later. This is just an annoyance, but it means that this product wasn't ready for prime time when it was released. Also I get lock ups that kick me home fairly regularly and an inability to connect to the network occasionally when other devices are ok. I restart both and it works, but just another little annoyance to handle.I would think that the bigger Fire TV would handle the heat being generated better but maybe this is a software issue. I haven't found the perfect solution for streaming only, but my game consoles work flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Paula"}, {"rating": 5.0, "review": "great product great price", "verified": true, "helpfulness": "0/1", "author": "William Dennison"}, {"rating": 4.0, "review": "Having some  trouble learning to use it, Do you have to be attached to a cable company to use completely? Wish there were more instructions .", "verified": true, "helpfulness": "0/1", "author": "JEWELL HALLA"}]