[{"rating": 5.0, "review": "Excellent ... Surpassed my expectations. All my prime videos stream seamlessly. I love the fire stick. I was skeptical when I started off, I was confused whether to buy fire TV or fire stick.I wanted to try fire stick so got one from best buy, so far I didn't have any problem at all.", "verified": true, "helpfulness": "0/0", "author": "Rajeevan D"}, {"rating": 5.0, "review": "Great price, great selection of entertainment.", "verified": true, "helpfulness": "0/0", "author": "William St. John"}, {"rating": 5.0, "review": "Great device! Works right out of the box. Newly released software updates are applied automatically without having to do anything.", "verified": true, "helpfulness": "0/0", "author": "Erik"}, {"rating": 5.0, "review": "Love my kindle fire stick. So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Ezell"}, {"rating": 5.0, "review": "Best purchase I've made all year", "verified": true, "helpfulness": "0/0", "author": "L. Isaacs \"insomniac\""}, {"rating": 5.0, "review": "Like it so far!", "verified": true, "helpfulness": "0/0", "author": "Janet dotson"}, {"rating": 4.0, "review": "Very satisfied with this product.", "verified": true, "helpfulness": "0/0", "author": "Yvette Gomez"}, {"rating": 2.0, "review": "Mine seems to restart mid movie sometimes. Not a huge deal, but not ideal.", "verified": true, "helpfulness": "0/0", "author": "Jjwpg"}, {"rating": 5.0, "review": "I can't same anything bad about this thing. I'm mostly using for Streaming Sling TV through the TV and Netflix, but seriously a great device! No issues and love pairing it with the app.*** UPDATED 6/12/15: This device is still up and ticking. I cannot imagine a more user friendly device. As much as ever, I still love pairing this device with my phone and being able to pull up things on the screen from my phone or tablet. I recently got a Lenovo Yoga laptop and have been excited to give it a whirl as well. As I just attempted to try it live, it failed horribly, but there is still hope.The Amazon Fire saves the things I like and use frequently on the immediate menu when it's own. It's like Netflix... it shows everything you recently watched/used and makes recommendations for you. Now whose cable company does that?PROS: Cost effective, especially if done as a promo with Sling TVWorks well for live streaming, games and other thingsEasy to use from remote included or cell phoneSmallOut of sight, out of mind, but WORKS GREAT out of sight!CONS: I really wish it didn't have to be plugged in. It adds to the many other cords  I already have plugged in.And currently, figuring out how to connect my laptop wirelessly to it!", "verified": true, "helpfulness": "0/0", "author": "JV Marketing"}, {"rating": 5.0, "review": "great value", "verified": true, "helpfulness": "0/0", "author": "Lee Family Perdido"}]