[{"rating": 5.0, "review": "Works as expected", "verified": true, "helpfulness": "0/0", "author": "clint landon"}, {"rating": 5.0, "review": "Great device, lots of programs/movies!", "verified": true, "helpfulness": "0/0", "author": "James M. Dearras"}, {"rating": 5.0, "review": "Best Thing working", "verified": true, "helpfulness": "0/0", "author": "Brightseat Rd"}, {"rating": 5.0, "review": "I just got my fire TV stick & it is great.  I am still trying to get to know if I can see all my shows that I have been watching on tv.", "verified": true, "helpfulness": "0/0", "author": "Jackie"}, {"rating": 5.0, "review": "Very convenient!", "verified": true, "helpfulness": "0/0", "author": "Brian Tower"}, {"rating": 3.0, "review": "Worked great with our TV and AV receiver for 5 days and we watched programs on HD with surround sound.  Then on day 6 it gave us a 'problem with buffering' message and our coach turned into a pumpkin, advising us it couldn't find Home and we should check our network status.  Our network status was just fine, thank you. Unplugging the stick from the power source and then turning it back on corrected the problem.  We will see if this is a common problem or an anomaly.  My rating is actually based on the controller.  We had to go to Google to find out how to open the case to put in the batteries.  I figured we were just inept, but a friend who also just purchased the stick had the same problem.  Since we found the answer on Google, we are not alone!  Amazon needs to address this.", "verified": true, "helpfulness": "0/0", "author": "krprescott"}, {"rating": 2.0, "review": "received a defective unit and it is taking over a week to replace it a second time after the first replacement was sent to the incorrect address.  The original unit had a defective remote that would sometimes have a mind of it's own and scroll through selections all on its own.", "verified": true, "helpfulness": "0/1", "author": "Samantha L. Montague"}, {"rating": 2.0, "review": "It is working great for me. I have Apple TV, but it took for ever to buffer anything I wanted to watch. Having fire stick i have non of that problem.", "verified": true, "helpfulness": "0/0", "author": "FAISAL SHALWANI"}, {"rating": 5.0, "review": "Worked like a charm, easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Ronny R. Shipley"}, {"rating": 5.0, "review": "I'm ready to ditch the dish! So, I wanted to give the Fire TV a try.  The Fire Stick was easy to setup, and has a clear picture!  I didn't have a problem with buffering, although your ISP plan has a lot to do with that. I plan on ordering Amazon Prime for more movie choices. Although, I wish Amazon offered live tv with the Prime, that would be awesome!  Though, I have no complaints because I can select what I want to watch. I don't have to worry about paying for programs I don't like or multiple channels of the same thing!  Amazon continues to deliver!!!", "verified": true, "helpfulness": "0/0", "author": "Debra L. Gomez"}]