[{"rating": 5.0, "review": "I think this is great!  I just plugged it in and I was ready to go.", "verified": true, "helpfulness": "0/0", "author": "Megan Sheeley"}, {"rating": 5.0, "review": "very good easy to installed", "verified": true, "helpfulness": "0/0", "author": "L.J."}, {"rating": 5.0, "review": "Very easy to setup. Works great so far. I had ordered optional USB outlet but did not need it.", "verified": true, "helpfulness": "0/0", "author": "Janet Wright"}, {"rating": 5.0, "review": "wonderful, awesome, magnifique!", "verified": true, "helpfulness": "0/0", "author": "Hazel M. Mack"}, {"rating": 5.0, "review": "works well with my internet connection.", "verified": true, "helpfulness": "0/0", "author": "lawrence cerverizzo"}, {"rating": 4.0, "review": "I like the fire stick very much. Everything is in one place and its easy to navigate", "verified": true, "helpfulness": "0/0", "author": "NYC GUY"}, {"rating": 3.0, "review": "Middle of the road review because it depends upon how you look at it. If I rate it on my mistaken expectation of what was available with this device it is a single star or if I rate it upon what is evidentially is supposed to do it is 4 stars. The setup of the equipment was as easy as they claim, however from that point on, determining what it offers and how the app system works take a bit of fiddling around. I thought there would be much more content available that was free to watch. I found there is very little that isn't already available through other mechanisms. So as a Wi-Fi device that allows you to hook-up to subscription services it seems to work just fine, but as for the advertisement that you have access to thousands of hours of content, it comes with a price.", "verified": true, "helpfulness": "1/1", "author": "Ronald J Erickson"}, {"rating": 5.0, "review": "So easy to setup and use!", "verified": true, "helpfulness": "0/0", "author": "Lauren N Johnson"}, {"rating": 5.0, "review": "Very easy to install.....the content is great!", "verified": true, "helpfulness": "0/0", "author": "sean flynn"}, {"rating": 4.0, "review": "My first time using the stick was a little bumpy -- in fact, I was frustrated and angry because it kept dropping our wifi signal (which is very strong in the room).  I read a help forum and found out if you push the home and play button at the same time it will do a hard restart of the device and after that it worked well.  We've used it twice and I hope the wifi problem doesn't reappear.Aside from the wifi, the ability to view photos (I have most of our photo on the Clouddrive) and view tons of TV shows and movies is fantastic. This could be the future of cable-less TV.", "verified": true, "helpfulness": "0/0", "author": "R. Williams"}]