[{"rating": 5.0, "review": "Good product that Amazon took out for the customers to have Good entertainment in tvs.", "verified": true, "helpfulness": "0/0", "author": "Edwin Narváez"}, {"rating": 5.0, "review": "great, make sure you buy from \"best buy \" seller", "verified": true, "helpfulness": "0/0", "author": "rick cuny"}, {"rating": 3.0, "review": "Little confusing to get set up in my account...wish there was more free content with full episodes.", "verified": true, "helpfulness": "0/0", "author": "Sara Lynn Butterfield"}, {"rating": 5.0, "review": "What a great idea!! It was easy to hook up and start enjoying some movies. it is better to pick you list of favorites from your computer instead of from the fire stick itself. so many to choose from it takes some time.  love, love, love it!", "verified": true, "helpfulness": "0/0", "author": "Peanut100"}, {"rating": 5.0, "review": "Great simple product.  Compact.  One MAJOR advantage over products like Chromcast is this comes with a remote.  Chromcast is annoying since it requires another device (phone/pad/computer); doing something simple like pausing, rewind, etc requires you to wake up your mobile, activate the app, wait for it to load the netflix data- THEN you can control it... It takes 1-2 minutes, Very annoying!  Contrary, Amazon Fire is ready to control the moment you want it.  😄👍🏼", "verified": true, "helpfulness": "0/0", "author": "D. siegel"}, {"rating": 4.0, "review": "Excellent reception & hd", "verified": true, "helpfulness": "0/0", "author": "John Echeverry"}, {"rating": 3.0, "review": "Average. Doesn't respond sometimes. Slow. But okay.", "verified": true, "helpfulness": "0/0", "author": "Matthew Cole"}, {"rating": 3.0, "review": "Does not work well on our internet service.", "verified": true, "helpfulness": "0/0", "author": "Wendy L Terrell"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Nininha \"World Wanderer\""}, {"rating": 5.0, "review": "This is a great product I didn't purchase it from Amazon thou so I'm a little curios why I'm being Asked for a review.", "verified": true, "helpfulness": "0/0", "author": "Myra A. Brown \"Blondie\""}]