[{"rating": 4.0, "review": "So far, so good. I've played with this now for a couple days, and it's very easy to set up and use. I bought this for my bedroom TV for which it works very well.  I primarily use Netflix and Plex (for local files), but the availability of other sources is good.  The only negative so far is I couldn't power the device from the TV's USB port - it required the power adapter to work properly. But it comes with a pretty long USB cable, so it wasn't a huge issue.", "verified": true, "helpfulness": "0/0", "author": "D. Hawes \"A Wolverine in Chicago\""}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Ralph Moreno"}, {"rating": 5.0, "review": "Other than it having to check for latest update before you can use it... Works flawlessly.  I streamed an action movie in HD with no problem.  I have recommend this to everyone and plan to purchase another as a gift.", "verified": true, "helpfulness": "0/0", "author": "Robsmyclone \"Icuwoot\""}, {"rating": 4.0, "review": "Easy to install and very quick response. Great value for the price !!!!!", "verified": true, "helpfulness": "0/0", "author": "Dennis L Williams"}, {"rating": 5.0, "review": "I really liked the Fire TV Stick interface and I think physical remote helps me a lot to control the device. I have Chromecast as well when compared both performance little better on Fire TV stick because it has more memory. I like Chromecast as well, HBO GO is not there on Fire TV Stick yet. Not sure they get it or not. Overall I liked the product.", "verified": true, "helpfulness": "0/0", "author": "Kishore"}, {"rating": 5.0, "review": "The best $19.00 spent this holiday season. Set up is so easy my 73 year old hubby, whom this was bought and is not one bit tech savvy had it up and running in less than 10 minutes. He LOVES that it will only show those movies and tv shows that are included in prime cutting the frustration level of finding prime included items to zero. He had the apps that matter the most to him ( netflix, and history channel ) loaded in less than five minutes. I loved that it was so easy to find all the photographs and home movies with just a few clicks I was watching the home movies from Thanksgiving day. Set up our fire tablet with the fire tv app so hubby could use it as an additional remote that he can liked that he can use it to do a voice search for his favorite programs. For him the best thing about the entire fire stick package is the simplicity of the remote and how responsive it is. My only regret is not ordering the limit during the special sell to give to our kids as family gifts for them this year.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm extremely happy with it, I do hope there are more apps coming down the pipeline for digital content streaming but all in all I'm very happy with the device. The FireTV UI is very clean and the hardware in the TV Stick has (so far anyways) been plenty to keep the UI from becoming laggy when navigating around. As a Prime member I'm very happy with the purchase and the streaming content available, would recommend to others.", "verified": true, "helpfulness": "0/0", "author": "Adam J Miller"}, {"rating": 5.0, "review": "This little device is amazing, super fast!! so much better than the google chromecast and I have both so I have compared. the remote very useful and intuitive.", "verified": true, "helpfulness": "0/0", "author": "Rob A"}, {"rating": 5.0, "review": "Tremendous value and features.  I can't believe what this little thing can do for such a small price. If you have Prime, just get one.", "verified": true, "helpfulness": "0/0", "author": "Aaron Grenz"}, {"rating": 5.0, "review": "LOVE, LOVE, LOVE...I simply love my Fire TV Stick.  not only was it delivered two weeks before it was supposed to get here, it was very easy to set and connect.  It took 3 tries yo get the update to download so I could use it but it want a hassel and it probably was my internet connection and not the stick.  I read all the negative reviews and I don't agree that the remote is cheap.  It's very easy to use and i love the way the home page is set up.  This little sick is just what I was looking for.  I almost purchased the Fire Tv Box.  In fact, I had gone online to do so the day the stick came out and was able to purchase it for $19.  Now I can listen to all my prime music and watch prime movies on my TV without having to plug in my Kindel Fire tablet.  Ohhhh, and I absolutely LOVE the photo display that come on if you have the stick on idle.  I would personally Thank the person that added that feature if I could.  The photo collection on that feature is amazing.  I sat and watched just that last evening for at last 15 minutes.  It was very calming.  Thank you Amazon for another great produce!Update!  It got even better!!!!  If you are listening to prime music and go to the home page (just click the home button), the stick will go into idle mood and you will then have great music and beautiful nature photos all at the same time.  LOVE this feature!", "verified": true, "helpfulness": "0/0", "author": "Priscella Guerra"}]