[{"rating": 5.0, "review": "This is pretty cool. I am able to get Netflix and amazon and wwe network all without running Ethernet to the bedroom. I was using the original Wii to get Netflix in the bedroom but since the Wii isn't in HD I was watching Netflix like a poor person. Now I can watch Netflix in HD like God intended. Plus I can watch the WWE network. The original Wii didn't have that.", "verified": true, "helpfulness": "0/1", "author": "ELRhodes"}, {"rating": 4.0, "review": "Works well and as advertised, but coming from a Roku stick, the Amazon interface feels like a maze to navigate.Not unhappy, just not thrilled.", "verified": true, "helpfulness": "0/1", "author": "S Powell"}, {"rating": 1.0, "review": "Makes my Vizio tv shutdown randomly and slow", "verified": true, "helpfulness": "1/2", "author": "shashank"}, {"rating": 5.0, "review": "whats cool about it is you can move it from TV to TV pretty easy. If you watched it daily I would say buy one for each TV. But we don't. Maybe a few times a week.", "verified": true, "helpfulness": "0/1", "author": "Susan \"Pinkaboolilly\""}, {"rating": 4.0, "review": "I purchased Fire Stick a week ago. It's been great so far. The HD content is really HD. Sound is good. Good so far.I will post another one after I've used it some more.", "verified": true, "helpfulness": "0/1", "author": "MSD"}, {"rating": 5.0, "review": "worked right out of the box", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I was hoping to watch network television shows for free but that's not the case.  Everything requires a subscription which means paying out of pocket to watch just about anything, even hulu.com content I can stream on my laptop for free.", "verified": true, "helpfulness": "1/2", "author": "Stephen Smith"}, {"rating": 5.0, "review": "This is our second Fire TV Stick. We loved the first one so much that we decided to purchase one for our smart TV as well. The Fire Stick is faster and easier to use than the smart TV.", "verified": true, "helpfulness": "1/2", "author": "ReginaP"}, {"rating": 2.0, "review": "Easy set-up, but now when I change a channel (DISH Network) I get \"lost signal\" and have to move around on channels to get it to work right. Never had this issue prior to the Fire stick install.", "verified": true, "helpfulness": "0/1", "author": "Amazon Regular"}, {"rating": 5.0, "review": "We were using Roku for years before we got this.  We lost the remote to the Roku and couldn't use it anymore.  I love that I can use my ipad as a remote for this. Our Roku was an older model, I'm sure the new ones offer many of the same features now, but I'm glad we got this.  So far it works great!", "verified": true, "helpfulness": "0/1", "author": "Ferg"}]