[{"rating": 5.0, "review": "I own roku lt, roku 2, apple tv3, and this fire stick is great compared to those others. Great ui and good assortment of content. Honestly haven't tried games on it, but that is not my thing.", "verified": true, "helpfulness": "0/0", "author": "SGH"}, {"rating": 5.0, "review": "This is so good, I recommend it big time.To me, as an Amazon subscriber, is a bless.  Amazed about an application that almost convince me I do not need an Apple TV!  I can even mirror my apple devices to my tv using the  Fire TV stick!", "verified": true, "helpfulness": "0/0", "author": "POLANCOJ"}, {"rating": 5.0, "review": "Excellent design and function.  Every Prime member should have this.  Setup took less than 5 minutes.  No problem streaming 1080p using Plex and Prime Videos from my wireless N router two floors up.  It can stream our photos from Amazon Cloud while playing Pandora music.  Parental controls were easy to setup, allowing us to block content and in app purchases.  I also have Roku 3, Chromecast, and Fire TV.  Roku 3 has a lot of channels, most of them I never use.  Chromecast is good for streaming content from another device but, you really need that device in the same room as the TV because Chromecast doesn't come with a remote.  Amazon's Fire TV is truly a marvel.  My family loves it.  I decided to try the Fire TV Stick for a TV in a different room.  Great decision.  The interface is the same.  It has the same apps.  It streams beautifully.", "verified": true, "helpfulness": "0/0", "author": "Jack Christensen"}, {"rating": 3.0, "review": "When it works, it works great. However, it will drop network after some random duration of using.", "verified": true, "helpfulness": "0/0", "author": "rex"}, {"rating": 3.0, "review": "As a Apple TV user my expectations may be a bit higher than they should have been for the Fire Stick.  I received this for $19 which probably should have been my first clue but being a Amazon item I had high expectations.  When the Fire Stick works, it works great, but it continues to freeze up while using Netflix and losing it's internet connection.  This would work wonderfully for someone who is on a budget and doesn't mind the quirks, but if i had it to do all over I would have saved my $19 and bought a higher end device.", "verified": true, "helpfulness": "0/1", "author": "Kelly B."}, {"rating": 5.0, "review": "Very nice media streaming device.  It was super easy to setup.  It's fast and plays everything well.  Content is very good, but not as good as Roku.  For the price I paid ($19), it's 5 stars.  If side by side with Roku stick at the same price, I'd give this 4 stars and the Roku 4 1/2 stars.", "verified": true, "helpfulness": "1/1", "author": "GP \"Golfer393\""}, {"rating": 5.0, "review": "I love this stick!!! If you have and android phone do not get the remote with the mic because you can use the app for voice search. Now that that is out of the way, this ting is pretty awesome. I have replace my Roku stick with this. I only had roku for prime anyway.The interface is pretty good but not excellent. The remote seems to lag periodically but not a ton. The OS is lighting fast compared to the Roku and the picture quality is excellent with a string WiFi connection. Searching for content is a breeze if you have the app and can use voice search, but is a bit painful with the remote. One of the bad things is that the power source plugs into the side of the device and it makes it difficult to for it into tight spots without the extender that comes with it. I can't for the life of me understand how this got missed it testing quality and performance testing. You will have to place it on the top or bottom input if you have 3 or more HDMI inputs unless you use the extender.When you 1st set it up it takes about 15 minutes before you can get to play with it due to updates setup screens and stupid tutorial that you can't skip Arrgh!! After that you can start searching for apps or content to watch. Most of the cable apps are on the device but your cable provider (Direct TV) my not support viewing (showtime) on the device. This won't replace my Chromecast because of the play store access and the simplicity of Chromecast, it is my GOTO for Prime now! I got two during the Prime $19 pricing special but I recommend it to anyone even at full price.", "verified": true, "helpfulness": "0/0", "author": "Derrick hampton"}, {"rating": 3.0, "review": "The Fire TV Stick is well-designed and sells at a great price, but lacks a broad selection of Channels.  I cannot compare it to the Chromecast, but it certainly doesn't stack up against my Roku in terms of available channels.  It's a toss-up between the Fire TV Stick and my AppleTV.  The latter has a slightly broader channel selection but also sells at a premium price.Hopefully, more channels will be available soon.", "verified": true, "helpfulness": "0/0", "author": "Hal \"Hal\""}, {"rating": 4.0, "review": "Pre-ordered it when it was announced. I've had it for about a week and it's doing its job nicely. I only wish there were a solid way to cast from my Android device to it. The apps that are available either don't load all the way or are paid apps that have \"okay\" reviews. Plex is the only one of note, really, but I just don't feel that I should spend money to stream content that I can do for free otherwise.Kudos to Amazon having a successful product, although streaming from a mobile device is shaky at the moment. Still a good product overall.", "verified": true, "helpfulness": "0/0", "author": "M. Nobel"}, {"rating": 3.0, "review": "My fire stick worked great for 2 weeks but now it won't connect to my internet.  Says I have a poor signal.  I've tried it for 4 days now and just can't get it to work again :(  we haven't changed anything or added anything additional to my wifi.  Looks like it is back to watching tv through my wii which picks up my wifi with no problem.  I'm bummed I spoke so highly of the fire stick to so many people when I first got it.  I hope they don't have the same problems I am.", "verified": true, "helpfulness": "1/1", "author": "J. Terwilliger"}]