[{"rating": 4.0, "review": "It worked great. The only disappointment was the way the music is handled I wish it was handed the war the Kindle does it. Maybe there will be an update too make the two similar.", "verified": true, "helpfulness": "0/0", "author": "H.P. Tampa"}, {"rating": 5.0, "review": "Love it! I have the Roku and Chromecast sticks which are good products but I find the FireTV Stick a much better product.It is a lot smoother than all the others I have tried and I assume that is because of the processor + memory.The remote is easy to use and even fits larger \"man\" hands.Still getting use to the stick but have not found anything that would prevent me from recommending over others.For the price would tell everyone to pick it over Roku without hesitation.", "verified": true, "helpfulness": "0/0", "author": "Woody \"I love 1 and 0's...\""}, {"rating": 3.0, "review": "I was very happy to get this...but quickly I began to have problems when it's streaming: constant stopping to buffer then going on. I can sometimes \"cure\" this by unplugging and replugging and starting again...a pain. Usually I just turn to Roku for my Amazon streaming...no problem with that device. Too bad. I really prefer the look and features of the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "NM Res \"kindle fan\""}, {"rating": 3.0, "review": "There really is nothing wrong with this if you are invested in the Amazon ecosystem or want to be. I bought this for the Prime price of $20 and didn't really need it. It didn't like my one TV and wouldn't proceed past the boot up but did on another TV, same brand too.3 things that I require in a streaming stick:1. NHL Gamecenter Live2. PLEX3. Prime TV#1 doesn't appear available so no for me.#2 is available if you buy it from Amazon app store but I'm a lifetime member to PLEX and have already bought the apps from Google so i'm not going to buy it again. This stick must be running Amazon fork Android and is using their app store so no for me. No charge for the Roku PLEX app.#3 Prime isn't on my account in the household so I need the better half to sign in. This is normal procedure but Amazon let me buy it at $20 with a linked prime account so come on Amazon.Can't say in a head to head with the Roku stick who would win but i like the Roku boxes. Chromecast is different so i wouldn't compare it either.  It's okay but i'm not into the whole Fire thing so i'll stick with Roku and Chromecast.", "verified": true, "helpfulness": "0/0", "author": "M. Bujak"}, {"rating": 5.0, "review": "This device is great!  Easy to setup and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Judson Kuehling"}, {"rating": 5.0, "review": "FireTV stick is awesome, I have a ROKU, ROKU stick, as we as a SONY streaming device and so far the Fire stick beats them all, the speed at which the Fire stick operates puts the others to shame.  Most of the channels I want are on the Fire TV stick and I'm hoping the few that aren't soon will be.  The only problem I've encountered is that for some reason when using the HDMI extender and having it plugged into the HDMI port one I would get the message \"HDCP unauthorized, content disabled\" , but plugging into HDMI port two removed this issue.  Also removing the adapter allowed me to stay plugged in port one, thou it was a tight fit between the wall and TV.", "verified": true, "helpfulness": "1/1", "author": "Timmy D. Crain"}, {"rating": 5.0, "review": "Took some time to set up as the website was down when I 1st tried. When the updated software did down load took about 30 minutes. Once downloaded and installed it works great. Takes a little while to learn to navigate the screen but am totally satisfied with the system.", "verified": true, "helpfulness": "0/0", "author": "Robert Gray"}, {"rating": 5.0, "review": "I love the Fire TV Stick!  It was so easy to install and took just a few minutes for the software to update.  There are no streaming issues.  I have been binge-watching my FREE TV shows as an Amazon Prime member.  I also use it to stream ESPN college basketball games I would have normally watched on my computer.  I will probably be ordering another one of these for an additional TV in my home.", "verified": true, "helpfulness": "0/0", "author": "Rae A. Umlah"}, {"rating": 3.0, "review": "works fine just very disappointed with the amount of content available on Amazon Prime video", "verified": true, "helpfulness": "0/1", "author": "Robert R. Rooks"}, {"rating": 5.0, "review": "I love the Fire TV Stick. It worked right out of the box, and has access to everything at the touch of a button! The kids love it too, it's a great buy.", "verified": true, "helpfulness": "0/0", "author": "Queen Erzulie Dantor \"Light Love Life\""}]