[{"rating": 1.0, "review": "Unfortunately, the Fire TV stick constantly drops the network connection. We even exchanged it for a different one, hoping it was a faulty unit. It's even sitting directly next to our router. If you look at this Amazon page (http://www.amazon.com/forum/kindle?cdForum=Fx1D7SY3BVSESG&cdThread;=Tx2CDOG0K31UBSB), there are 733 (!) posts about this problem. Huge bummer.", "verified": true, "helpfulness": "1/1", "author": "Joseph"}, {"rating": 5.0, "review": "Awesome for our second TV in our bedroom. Interface is better than Ruku but not as good as Apple TV. Better than chromocast!", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "great  easy set up everyone loves it", "verified": true, "helpfulness": "0/0", "author": "alfred bouvier"}, {"rating": 3.0, "review": "I GOT A BOX WHICH IS AMAZING, BUT THE STICK ISN'T GREAT FOR THOSE WHO HAVE A MOUNTED TV AND THE MOUNT IS AT THE BOTTOM OF THE TV, SO GRAVITY PULLS IT OUT OF THE TV. IT ALSO FREEZES ALOT! IF YOU WANT FIRE TV, GET A BOX!", "verified": true, "helpfulness": "1/1", "author": "Ukraine86"}, {"rating": 5.0, "review": "This product does a great job.  It is priced right and well constructed.  I would recommend heartily. A real buy!", "verified": true, "helpfulness": "0/1", "author": "Bartoomann"}, {"rating": 1.0, "review": "I don't see what the big deal is?  I had to order Netflix to see anything on my tv anyway.", "verified": true, "helpfulness": "0/1", "author": "Lori B. Nicholson"}, {"rating": 2.0, "review": "Works fine till it loses connection to WiFi. Then have to restart and setup again and again. Check the questions and see all the problems people have been having with this issue.", "verified": true, "helpfulness": "1/1", "author": "M. Bretzke \"Mike\""}, {"rating": 3.0, "review": "I was really disappointed when I realized the more thank half of my list was going to cost me rental fees.  The ultimate was a very OLD movie with John Wayne called Hondo the you wanted me to pay to rent.  I am very sorry I spent the money for the Fire Stick when I had Netflix.", "verified": true, "helpfulness": "0/2", "author": "Lynn"}, {"rating": 5.0, "review": "Love the Firestick! It does all the things we wanted it to! Just as good as my Apple TV but for less than half the price!", "verified": true, "helpfulness": "1/2", "author": "Chico"}, {"rating": 5.0, "review": "EZ 2 install and works like a dream.", "verified": true, "helpfulness": "0/1", "author": "Susan McEleney"}]