[{"rating": 2.0, "review": "No sound for local files (through Plex) that have 5.1 sound in MP4 containers. Netflix and other stuff works ok, not super fast as claimed due to quad-core and what not. Ability to side-load Android apps saved its return else it was going back.", "verified": true, "helpfulness": "0/0", "author": "Average fountain pen user"}, {"rating": 5.0, "review": "It's amazing, waiting for the HBOGO to be added and it will be outta this world", "verified": true, "helpfulness": "0/0", "author": "Jennifer cadena"}, {"rating": 5.0, "review": "This is so cool!!! So glad!!!! Thanks Amazon!!!!", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 1.0, "review": "Could not get help in setting up so that sound came thru. Background sounds from program played. Return ed stick.", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 5.0, "review": "Very happy with purchase, got a second one", "verified": true, "helpfulness": "0/0", "author": "Scott willadsen"}, {"rating": 5.0, "review": "It was great", "verified": true, "helpfulness": "0/0", "author": "marvin"}, {"rating": 4.0, "review": "Easy to install Tv stick & App for it.Features that work well: voice search for shows & movies, control from TV Stick App, concurrent TV showing & Kindle use for other things. Access to Hulu Plus. Don't have Netflex to t r yFeatures not work as documented:  cannot show photos or videos from Cloud Drive;  Cannot install App for Cloud Photo or Cloud Video & Photo.Compared to ChromecastMore expensiveTake a little more steps to installCannot be used with other devices via Chrome Browser - much more restrictive scope - very Amazon-centric", "verified": true, "helpfulness": "0/0", "author": "Sam (McGyver) T."}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "IK HYUN KIM"}, {"rating": 1.0, "review": "Bought it for one reason, to miracast from my Galaxy S5 to my TV. It does not work. I have had multiple call to amazon tech support and they have no idea when and if the problem will get fixed. Calls were never returned despite repeated promises to do so. I finally gave up and am  returning it. Great idea but not ready for prime time.As a separate note,  I pre-ordered this the day it went on sale and was disappointed that amazon shipped to retailers like best buy before shipping to long time prime members.", "verified": true, "helpfulness": "0/0", "author": "EHLovesBooks"}, {"rating": 1.0, "review": "The Fire TV Stick is a total waste of time & money if you already have an internet compatible tv, blu-ray player, apple tv, roku, or any other streaming device for your tv.  If you can watch Netflix or Amazon Prime on your tv somehow already, then this device just duplicates that ability.  It does not offer anything at all new unless you want to mirror from your kindle (which is why I bought it), but the fine print does not make it clear that it will mirror ONLY three specific versions of ONLY Kindle Fire HDX.  There is still marketing material out there that says it will work with Kindle Fire HD 7, but I was specifically informed today by 3 separate customer service reps (none of whom really seemed to know what they were doing) that this is not so, that only the 3 specific versions of the HDX will work.  The support rep informed me that it is only really designed to work with 2015 Kindle HDX, so my 6 month old Kindle is now obsolete.  In other words, Amazon markets this as the latest greatest thing to be able to watch all your streaming media on the big screen, but in actuality it offers nothing that my 3 year old blu-ray player doesn't already give me, UNLESS I want to buy a brand new Kindle HDX for mirroring.  I had hoped this would allow me to watch XfinityTVGo on a large screen, but though that streaming app works on just about all phones and computers made in the last five years, there is no app for using that service with the shiny new Fire TV Stick.  The Fire TV Stick also will not work with any Apple products such as an iPhone, iMac, iPad, etc.  All in all, the Fire TV Stick is nothing new - just old capabilities wrapped up in shiny new packaging - like putting lipstick on a pig.", "verified": true, "helpfulness": "2/2", "author": "Biblio Phile \"forever learning\""}]