[{"rating": 4.0, "review": "Works great and easy to setup,great value", "verified": true, "helpfulness": "0/0", "author": "David Gallegos"}, {"rating": 5.0, "review": "Works great.  Got the because the TC in the bedroom had a weak wireless (2.4) signal.  This has a better wireless interface (5.0) and connects better.  Content with Prime is awesome.  Netflix and everything else I would need!", "verified": true, "helpfulness": "0/0", "author": "J. Schimansky"}, {"rating": 5.0, "review": "So pleased with my purchase ~ Thanks AMAZON!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Turned my tv into a smart tv!", "verified": true, "helpfulness": "0/0", "author": "Koushal Patel"}, {"rating": 5.0, "review": "excellent, I enjoy it very much", "verified": true, "helpfulness": "0/0", "author": "Eileen Kilian"}, {"rating": 5.0, "review": "it is so easy to install and to use, it's great!", "verified": true, "helpfulness": "0/0", "author": "mark marek"}, {"rating": 4.0, "review": "I love it to pieces! It runs so much faster than my Wi-Fi-enabled Blu-ray player, and I'm so glad I can use Netflix, HuluPlus, AND Amazon Instant video. I wish there were a power-off option, though. I keep going to settings and putting it to sleep, but that's a bit of a chore. Also, if the text were a bit larger as videos are loading, that would make it easier to see the episode titles when watching TV shows. I hope this stays running quickly for a long, long time. :)", "verified": true, "helpfulness": "0/0", "author": "fishdye \"Erin\""}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "J. S. Hughes \"Jackie\""}, {"rating": 2.0, "review": "It worked for a few days, and then, it stopped.It would say I wasn't connected to the Internet or Wi-Fi or something.  It found my router, connection shows up as FAIR even though the router is right next to the TV.  But it also shows as disconnected.  So, it sees the router but won't connect to it.  I enter the password to the router but the Firestick never connects.  Is there a trick to this?  Why would it work one day, and stop working the next?Usually happy with Amazon offerings, whether it's cables or some other Amazon brand item.  When it worked, this item was okay.  Easy setup, easy interface, and served it's purpose of watching Amazon Prime offerings.  But then it stopped.  Very disappointed, Amazon.", "verified": true, "helpfulness": "1/2", "author": "robk64"}, {"rating": 4.0, "review": "Really love it. Each time I use it I love it more. Everything in one place and a lot of choices in media. (movies, TV, music etc.) Some of the rentals are a bit pricey but still a lot of choices with my extra prime.", "verified": true, "helpfulness": "0/0", "author": "M. Markward"}]