[{"rating": 5.0, "review": "It was easy to set up, we were watching it in about 15 minutes. It streams well. It arrived sooner than I expected. I'd recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "Tonya G"}, {"rating": 5.0, "review": "Love it when it works!! We have really bad wifi apparently, so that makes it infuriating when I'm in the middle of a show. But that's not Amazon's fault. The best part is that I can watch almost everything with captions! I couldn't figure out how to do that on my tablet or phone.", "verified": true, "helpfulness": "0/0", "author": "Ariel Dolinar"}, {"rating": 1.0, "review": "Worked great at first, now it won't even connect! Have fastest cable WiFi available, 100m + so I know it's not connection problems. This is a horrible purchase.", "verified": true, "helpfulness": "1/1", "author": "Yukon Fukov"}, {"rating": 5.0, "review": "Easily connected. Excellent little device. So many uses. We feel that it is a tremendous bargain.", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "awsome", "verified": true, "helpfulness": "0/0", "author": "Michael Montelongo"}, {"rating": 3.0, "review": "Excellent streaming device, works perfect with Netflix, Hulu, Amazon Prime and in my case more importantly Plex. Only downside is it doesn't work well with TV on and off features (Vizio). TV will remain on all day, won't power off unless I unplug the Amazon TV Fire Stick. Other then that I love this video streaming unit!", "verified": true, "helpfulness": "1/1", "author": "Brad Stickler"}, {"rating": 5.0, "review": "Love, love, love it. This is all i do all day. Watch shows and movies", "verified": true, "helpfulness": "1/1", "author": "Mara H. Montano \"Jesuslove\""}, {"rating": 1.0, "review": "Even the Amazon movies won't play. They play better with Roku or online.", "verified": true, "helpfulness": "1/2", "author": "Rene Gonzalez \"René G.\""}, {"rating": 4.0, "review": "This is much easier and more user friendly than my Chromecast.  I'm giving it 4 stars because casting things from my phone to the unit is a little tricky.  If you like using the apps like netflix, hulu etc I'd say BUY IT.  It's a quick and cheap way to turn a dumb TV into a smart TV.", "verified": true, "helpfulness": "1/1", "author": "Shannon D"}, {"rating": 5.0, "review": "A good value is you're a Amazon Prime member. Instantly turns a simple projector into a \"smart\" projector.", "verified": true, "helpfulness": "0/0", "author": "Ryan Chen \"Ryan\""}]