[{"rating": 5.0, "review": "This is a fantastic device.  The price is great and the functionality is awesome.  Lots of features, lots of apps and even some decent games although it wont replace a game console.  Well worth the money. Best of all, it is simple and easy to use an it just plain works.", "verified": true, "helpfulness": "0/0", "author": "Eric in CT"}, {"rating": 5.0, "review": "Excellent. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Val D."}, {"rating": 5.0, "review": "Very easy to set up and use. Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "B. Moore"}, {"rating": 4.0, "review": "Works well--easy to use", "verified": true, "helpfulness": "0/0", "author": "pat quinn"}, {"rating": 5.0, "review": "I love the Amazon firestick it is amazing.  We have been able to open up a whole new world of tv shows and movies.", "verified": true, "helpfulness": "0/0", "author": "Jessica Howard"}, {"rating": 5.0, "review": "This blows away my android stick and my raspberry pi as a media player..My fire TV is Wayyyy better and faster, side loading for both is a plus.The Fire tv is in the living room and the fire stick is in the bedroom...Do yourself a favor,spend the money for the fire TV,you can hard wire it to the internet,it is quad core (makes a difference),has a better remote,and is faster.I Love my fire stick,it has it's place and was cheap.but there is a difference.It's good for the kids or the tight budget,but if you had both you would definitely notice the difference", "verified": true, "helpfulness": "0/0", "author": "Lewis"}, {"rating": 5.0, "review": "Absolutely awesome and so easy to set up and work.  There's even an app to work it from your phone!", "verified": true, "helpfulness": "0/0", "author": "Douglas Kelly"}, {"rating": 5.0, "review": "I love my Fire stick. I can access my favorite apps anywhere I want. No need to bring DVD player. I can use it on any room in the house. Instead of my daughter taking the wii upstairs to watch Netflix or AMAZON instant video, she can just take a little fire stick and power cord,so easy and so convenient. Great buy!!!", "verified": false, "helpfulness": "0/0", "author": "Bargainstore123 \"Owner InfernoX\""}, {"rating": 5.0, "review": "Works great. .easy to setup. .great price.", "verified": true, "helpfulness": "0/0", "author": "JAMES MONTANO"}, {"rating": 5.0, "review": "I am loving the Fire TV Stick, my only wish is that I could stream a webpage if I wanted to", "verified": true, "helpfulness": "0/0", "author": "Austin Richards"}]