[{"rating": 5.0, "review": "I wanted to be able to watch Netflix and Amazon Prime on my television. This device allows me to do that. It also allows me to listen to my local NPR station which I have trouble picking up inside my house with a radio.", "verified": true, "helpfulness": "0/0", "author": "Wendy Ross"}, {"rating": 2.0, "review": "Some shows skip and pause too much!", "verified": true, "helpfulness": "0/0", "author": "richard maldonado"}, {"rating": 5.0, "review": "I have a Roku, Apple TV and a Seagate FreeAgent Theater+ HD so I'm familiar with this category of entertainment appliance.I only picked this up because I got it for $20 when it rolled out. After using it daily for several months, I believe even at full price, the Stick is an amazing deal vs the competition. I love the design...the remote...the interface...the ability to play games...plus, it works very well.For $39 the Stick is a truly great product for streaming. Paired with Prime, and you've got a great little entertainment combo.I use it so much that I almost wish I'd bought the beefier Fire TV over the Stick simply because I'm using some side-load apps (Kodi) and games that could benefit from a faster processor, etc. But, for 95% of what I want, the Stick is perfect.", "verified": true, "helpfulness": "0/0", "author": "Bryan Starmer"}, {"rating": 5.0, "review": "nice lil gadget", "verified": true, "helpfulness": "0/0", "author": "saul"}, {"rating": 2.0, "review": "Processor is slow. I recommend the fire tv box.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product. No issues with ordering or shipping. Great!", "verified": true, "helpfulness": "0/0", "author": "Jensen"}, {"rating": 5.0, "review": "I purchased a second Fire Stick to use in my vacation home.  When I first tried to set it up I was unable to access the Xfinity hotspot.  Getting on line support and then requesting a phone call for support was super easy.  We even got disconnected once and they called me right back. And, though the representatives I spoke with had not encountered this problem before, they stuck with it until we were able to connect  to the hotspot.  Seems the fire stick was not \"happy\" about connecting to an unsecure wifi.  By using the hotspot and the fire stick, we are saving a bundle....no internet or cable TV fees.  Occasionally, the buffering can be annoying, depending on the time of day and number of users, but well worth it, overall.  The fire stick is so easy to use and I find it much simpler and more responsive than my Roku. Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "ClaireD"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Mike Wright"}, {"rating": 2.0, "review": "Netflixs wont work on the pos...better off with chromecast!", "verified": true, "helpfulness": "0/0", "author": "Mark Kotelnicki"}, {"rating": 5.0, "review": "Beyond my expectations!!!!! I am an Apple fanatic, but this beats Apple TV by far!!!! So glad I purchased it!", "verified": true, "helpfulness": "0/0", "author": "Tanya A. Williams"}]