[{"rating": 5.0, "review": "Arrived on time and was incredibly easy to install and start using!", "verified": true, "helpfulness": "0/1", "author": "Daniel Johns Chair Fan"}, {"rating": 5.0, "review": "We cancelled our satellite service within 2 days of receiving our Fire stick.  This plus netfliks will keep us busy for a very long time.", "verified": true, "helpfulness": "0/1", "author": "SDmom"}, {"rating": 5.0, "review": "awesome so far!!", "verified": true, "helpfulness": "0/1", "author": "M. Boone"}, {"rating": 5.0, "review": "I bought this on a whim when it was on sale, and I'm so glad I did.  I'm by no means a pro when it comes to tech-y stuff, but it was easy to install and set up by myself (plugs into the HDMI port on the TV and into a wall outlet).  It arrived already connected to my Amazon Prime account, so I could go right to the Amazon Instant Video section and see my Watch list.  I mostly use it to watch Netflix and listen to Spotify, but there are so many other apps you can download, like games, YouTube, Hulu, Pandora, etc.  It comes with a slim little remote, and you can also download a free app on your phone, so you can use your phone as a remote, which is awesome if you misplace the remote itself and are too lazy to look for it, haha.  I use the Fire Stick every single day and have never had any problems with connectivity, lagging, etc.  It's definitely my most-used Amazon purchase, and I love it!", "verified": true, "helpfulness": "0/0", "author": "HD"}, {"rating": 1.0, "review": "This thing locked up and just would not work.  I tried it on several tvs and nothing.  I was about to let the dog chew it to pieces.  Returned it instead.", "verified": true, "helpfulness": "0/2", "author": "Mark Dement"}, {"rating": 5.0, "review": "Simply awesome!", "verified": true, "helpfulness": "0/1", "author": "Pinaki Bhattacharya"}, {"rating": 5.0, "review": "Very simple to install and works wonderful.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have both the Chromcast and the Fire TV stick and I totally enjoy having the remote with the Fire TV Stick", "verified": true, "helpfulness": "0/1", "author": "Jan Kelly"}, {"rating": 5.0, "review": "I am tremendously pleased with the FireStick; both the quality of features and shows offered are exceptional.  Have been catching up on some missed episodes, and enjoying my Amazon Prime music.  Thank you, thank you, thank you.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It looks nice but merely moving your computer to your TV. You still need to pay for Netflix and other TV services. Nothing is free.", "verified": true, "helpfulness": "2/4", "author": "Jun Lei"}]