[{"rating": 5.0, "review": "Works perfectly", "verified": true, "helpfulness": "0/0", "author": "badger smith"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "mnlsprz"}, {"rating": 4.0, "review": "Fire stick is everything advertised to be. I really like it and bought a 2nd one for our bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "sunnyday"}, {"rating": 5.0, "review": "I love it.Doesn't have a lot of free apps that I'd enjoy. But if you're a big binge watcher then this is great. Don't have to worry about a box or anything just a little thing that sticks in in your HDMI spot on the tv.I love NETFLIX & HULU PLUS, so this was definitely the device for me :) & plus I love pandora on my tv and having access to YouTube and things like that!!", "verified": true, "helpfulness": "0/0", "author": "Hanna Gaston"}, {"rating": 5.0, "review": "I had some trouble downloading Sling. But the Amazon customer service gave excellent help. My wife and I are enjoying the channels we normally watched on Directv, Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "James Ruppel"}, {"rating": 5.0, "review": "Works. I have watched a couple of Prime movies and I had no pauses or trouble watching.  It is easy to use and am glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "web feet"}, {"rating": 5.0, "review": "Love the fire stick and it is so easy to set up. I am definitely purchasing another one!", "verified": true, "helpfulness": "0/0", "author": "Kathleen T. DiMauro"}, {"rating": 5.0, "review": "Fire TV stick works pretty much as well as Fire TV for me. The only drawback is that the remote does not have a voice activated search.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "Much better performance than other low-cast video streamers. might be the additional memory for extra buffering.", "verified": true, "helpfulness": "0/0", "author": "GrogMeister"}, {"rating": 5.0, "review": "I was a little skeptical of sticks but now that I've owned this Fire Stick for a month or so now, I'm in love! As soon as my Directv contract is up, I'm cutting cable/satellite for good!", "verified": true, "helpfulness": "0/0", "author": "Jeska Blevins \"jeskabelieves\""}]