[{"rating": 4.0, "review": "Cool!", "verified": false, "helpfulness": "0/0", "author": "supershopper"}, {"rating": 5.0, "review": "So easy to install, easy to work, ( admit my son did it for me), But to escape watching my choices which are many and an opportunity to watch other media.  Great buy.", "verified": true, "helpfulness": "0/0", "author": "Donna Roberson \"readermarie\""}, {"rating": 5.0, "review": "Love the fire stick, have purchased 2, better choices that regular TV, great value, great service, great product", "verified": true, "helpfulness": "0/0", "author": "kristib"}, {"rating": 5.0, "review": "This fire stick is fantastic it is much more than I expected and I highly recommend it it is so much better than the competition offers and the price is less and the quality is beyond compare", "verified": true, "helpfulness": "0/0", "author": "Michael J. Granic"}, {"rating": 5.0, "review": "Easy to set up and easy to use. Lots of games and apps. Highly recommend the Amazon Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Archie"}, {"rating": 5.0, "review": "Nice streaming product can get a bit warm but easy setup.", "verified": true, "helpfulness": "0/0", "author": "Jeremy J Bothe"}, {"rating": 5.0, "review": "This unit was very easy to hookup.  On screen directions easy to follow and picture quality very clear.  My daughter loves the app games.  I have had no trouble at this time with the unit.", "verified": true, "helpfulness": "0/0", "author": "GraceS"}, {"rating": 5.0, "review": "It is great.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "I a surely love it and would recommend to everyone if you don't have a fire TV stick get one now", "verified": true, "helpfulness": "0/0", "author": "sc"}, {"rating": 4.0, "review": "The included controller makes this a clear upgrade over the Chromecast, especially for Prime members.  However, the controller does sometimes \"double-back\", taking you out of your app instead of to the previous menu.  Some control functions are not as intuitive as they could be but this seems to change from app to app.  These seem to be very minor issues though and overall this is a great way to stream your video apps wirelessly on a budget.", "verified": true, "helpfulness": "0/0", "author": "William P. Blume"}]