[{"rating": 5.0, "review": "Great little gadget, totally worth it!  Love this Fire Stick.  Very easy to install, just plug and go.  Thousands of movies to choose from.  Tons of music channels from all over the country!  Great apps and games.  I'm so glad I purchased!  Video quality is really good.", "verified": true, "helpfulness": "0/0", "author": "Imma 21"}, {"rating": 1.0, "review": "Update from 3 to 1 star due to 2nd one has now been having problems and technical support is a nightmare to deal with. So if you get one that works wonderful but if you have problems that's another thing.Previous review:Makes a vibrating noise and does a quick freeze intermittently. Thought it might be just with Netflix, but also happened while playing music. Noticed a few glitches like movie started with black screen but could hear the volume, had to stop and restart. A few time when watching a Netflix series, it started the next one and skipped over the opening credits, that would be good if the show did not start prior to credits. This is only after 2 days of use, hope it doesn't get worse. I was so happy to get this so I would not have to hook my phone up to the TV and lose my phone for hours at a time in order to stream my Netflix and Prime Videos. Overall it is bearable if it does not get worse, but is not, by any means, as good as I was hoping.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have had it lockup twice in the one week since I bought it. But otherwise it has been good.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this thing. Seriously. I didn't have a single issue setting it up, linking into my Pandora, Hulu Plus, Netflix (etc) accounts. Took a whole 5 minute to set it up, link my accounts in and go.", "verified": true, "helpfulness": "0/0", "author": "dorothy"}, {"rating": 2.0, "review": "I'll give it 3 StarsPros: Fast, nice UI.  Faster then it's competitors (I have both the other 'stick' style devices).  Best experience for accessing Prime content by far.  Get's fully booted fast.Cons: Missing some useful apps, such as NHL game center (hopefully that will change).  I have MASSIVE problem with the wifi. Every hour or so, the wifi completely drops.  No wifi networks show.  Requires a manual power cycle to get it back online.  Also been having a reoccuring issue with Hulu+ that I do not have on my other 2 streaming sticks.  In this situation the video stream freezes but the audio continues.  Reloading the video gets it working (NOT a pause/play, but actually backing out of the video playback).  This happens enough to almost make Hulu+ unusable (some episodes playback fine, others this happens every minute or so. No rhyme, no reason).Overall:  It's 90% the way to a useful device.  MAybe I got a lemon.  If  I didn't have the wifi and hulu+ issues, I'd give 4 starts, if it had NHL, 5.", "verified": true, "helpfulness": "1/1", "author": "Jameson Jendreas"}, {"rating": 5.0, "review": "Really like the ease of use with the firestick.  I purchased two of them and will be using one as a stocking stuffer.  One thing that others have failed to mention is if you are a business traveler, regular vacationer etc...this is an easy take along in your handbag etc.", "verified": true, "helpfulness": "0/0", "author": "Sfrost"}, {"rating": 3.0, "review": "I got the Fire Stick for the Prime introductory price of $19 so had to give it a try. I have the Chromecast and a Roku 1 & 2. I had some interference on the remote in my TV stand and had to move it to the back of my TV, which stinks because I can't make use of my home theater. I'll get an HDMI extension cable and hopefully get past that issue.I will say that the interface is not nearly as nice as the Roku. Getting to Netflix or HuluPlus is just not as easy, not that it's a huge deal just not beating Roku. I am not seeing any speed advantage of the Fire Stick over the Roku either, I think there is just too much going on in the UI for it to be really snappy. I guess the app is ok, but I'm not a huge fan, the search is meh, notincluding Netflix is annoying as well as the interface requiring you toclick select after the search even if you only get one result.On the positives, it is kinda nice having my Amazon Music I have readily available. The Amazon Cloud picture screensaver is awesome, I just have my phone and my wife's phone auto-backup all pictures to Amazon, if only video storage didn't cost so much. The games are kinda neat on the Firestick if they run with it, especially the board game Fibbage. The Firestick device acts as the \"console\" and each player's phone is the \"controller\" for the game. Really neat, I could see this being a big selling point, but at the moment the library is quite small. More 2-8 player interactive games using the Firestick Amazon!Over the Roku, the only solid advantages are the picture screensaver (Roku still doesn't have a good one), and the games. Although, to be fair, I've never tried to play games on the Roku. Over the Chromecast, there is no ground made by the Firestick. We use the Chromecast all the time. When you have young kids you can go outside, work on something, the kids can yell out they want to watch something, and you can put it on remotely. Often times it's some Youtube how-to draw video, a bunch of music videos they want to dance to, or could be a Netflix show or whatever. Chromecast is indispensable in our house and the Firestick has done nothing to unseat it. So on my TV, the Roku and Chromecast still rein supreme, Firestick might end up on a basement TV at the moment, but certainly not counting it out.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I had difficulty opening the battery compartment to install the batteries. Downloading the updates took about 30 minutes. I have had some difficulty discovering how to obtain some of the promised apps, and am still somewhat bewildered about what all I can do with this stick. Otherwise, I am pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Sandra"}, {"rating": 5.0, "review": "Great product and easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "ToddB"}, {"rating": 5.0, "review": "Its Amazing way better than Chrome cast in every way......", "verified": true, "helpfulness": "0/0", "author": "Alan"}]