[{"rating": 5.0, "review": "By far the best stick device i have used when compared to others in the market. It might actually give apple a tough fight.", "verified": true, "helpfulness": "0/0", "author": "Purshotam V Ikkurti"}, {"rating": 5.0, "review": "This is an upgrade from Google Chromecast and it is really an improvement.  So easy to plug and play.", "verified": true, "helpfulness": "0/0", "author": "sandy4golf"}, {"rating": 5.0, "review": "Bought this for my mom for mother's day and she absolutely adores it. It has taken the place of a cable box for her and knocked $50 off the cable bill. Works like a dream.", "verified": true, "helpfulness": "0/0", "author": "Shortykinz"}, {"rating": 3.0, "review": "Hard to use if your use to Apple TV", "verified": true, "helpfulness": "0/2", "author": "Gressy"}, {"rating": 5.0, "review": "Very happy with this purchase.  No set up really just plugged it into the USB port on the back of the TV and it did the rest. We did have to sign up for Netflix and HULU (which was way cheaper than our cable bill) and with those two we watch all kinds of stuff. Been trying out the amazon prime for a month for free and we have really liked that too. Overall we bought this to replace our cable bill and it has really paid off.", "verified": true, "helpfulness": "0/0", "author": "Candice Rue"}, {"rating": 5.0, "review": "Love Fire TV", "verified": true, "helpfulness": "0/0", "author": "Mel"}, {"rating": 5.0, "review": "We don't have the best internet, but streams perfectly. Also love all the shows you have access and if you have Prime you get them free.", "verified": true, "helpfulness": "0/0", "author": "Faithnofear"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 5.0, "review": "All I can say is I love it very good price didn't take long to ship good product", "verified": true, "helpfulness": "0/0", "author": "Lisa Wilkerson"}, {"rating": 3.0, "review": "So far I've found the contents below my expectations.  I have not found a movie that I would want to watch.", "verified": true, "helpfulness": "0/1", "author": "Paul Sorensen"}]