[{"rating": 5.0, "review": "Performed much better then I thought it would for a stick based on everything I read. My Internet isn't even the best but it worked awesome. Forget all the reviews that go on about roku, I have amazon prime and I was really shocked how good the stick was , the quality, even the packaging and ease of use. Felt like they ripped off apple look and feel and packaging but I felt like I opened and installed an apple product. Based on the reviews, I was thinking that because it's a stick the performance wouldn't  be as good as the regular streamer but I had no problems...", "verified": true, "helpfulness": "1/1", "author": "Porschguynyc"}, {"rating": 5.0, "review": "We've only used it a couple of weeks, but so far, we are very pleased with our Fire TV Stick! Easy to setup and use, with significantly better performance (faster streaming, no hangups) than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Judith L. Parks"}, {"rating": 5.0, "review": "Easy set up and the quality of pecture is great.", "verified": true, "helpfulness": "0/0", "author": "Walter Ray Swinea"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Constance Wilder"}, {"rating": 5.0, "review": "We love it. Super easy to use.", "verified": true, "helpfulness": "0/0", "author": "Carrie G. Fenwick"}, {"rating": 5.0, "review": "Awesome wrapped with great.", "verified": true, "helpfulness": "0/0", "author": "Ernesto Dardon"}, {"rating": 5.0, "review": "I bought this when Amazon introduced them for $19 so I've had it for a little while. It has never crashed, which is more than I can say for my Roku box which crashes several times a week. The Fire Stick  buffers occasionally but i figure that's just the Internet watching porn and slowing things down. It was cheap and I bought it as a backup for my Roku but I'm using the Fire TV Stick more than Roku these days.When browsing movies the fast forward button does nothing. It should shift a screen at a time with FF. I hope they fix this in a future update.The Fire Stick's interface isn't as good as the Roku but they haven't had as much time to work on it. I'm pretty confident that they'll improve it.", "verified": true, "helpfulness": "0/0", "author": "Redox"}, {"rating": 4.0, "review": "Operation of stick works great.  The reason for four stars rather than five is that many items in Prime have a charge after one viewing.  Once you have seen your favorite free shows, there is no where to go unless you pay for it.  Would like to see more free old tv shows.  Otherwise, the stick itself works very well", "verified": true, "helpfulness": "0/0", "author": "MSM"}, {"rating": 5.0, "review": "We love it! Best Christmas gift to ourselves!!!!", "verified": true, "helpfulness": "0/0", "author": "mellemel"}, {"rating": 5.0, "review": "Works great , easy to hook up and operate , very pleased with it", "verified": true, "helpfulness": "0/0", "author": "danny v."}]