[{"rating": 5.0, "review": "Amazon’s FireTV Stick serves up a host of benefits for those who invest in its closed-off universe.Roku may have blazed the trail for streaming HDMI sticks, but when Amazon unleashed its Fire TV Stick to an overwhelmingly receptive customer base earlier this year, the new device category made a quantum leap forward, transforming from a novelty into a powerful industry force in a matter of hours.One of the many things that the Fire TV Stick does not lack is competitors. The two most obvious are the Roku Streaming Stick and the Chromecast. If your primary concern is having the most sources of content at your disposal, then Roku is the clear winner. It's the only one of the three with access to both Google Play's library of video and Amazon's. And that's in addition to other major players, like Hulu, Netflix, Watch ESPN, HBO Go and Spotify, plus the countless independent niche channels like horror film-specific Screambox or the aptly named Kung-Fu Theater. The only serious mark against it is price, which, at $50, is notably more expensive than either the Chromecast or Fire TV Stick.Google's offering is certainly the simplest of the three. And, whether that's a benefit or a hindrance depends on your perspective. There's no remote and no menu to navigate. Instead, you have to send content directly from your phone to your TV. The other devices support this to varying degrees, but it's the heart and soul of the Chromecast. This feature isn't limited to your Netflix or Hulu app, however. It also supports simple games, even multiplayer ones, like Wheel of Fortune and Big Web Quiz. Also, you can mirror the screen on your Android phone or tablet, or even a tab from the Chrome browser. Plus, at $35, it's the cheapest of the bunch.------------------PROS------------------- Very Fast- Huge selection of quality content front and center (for Amazon Prime subscribers, at least)- Chromecast-like beaming of Netflix and YouTube from phones and tablets works well- Very inexpensive------------------CONS------------------- Overlap in Amazon Prime video sections makes other content harder to find- An abundance of bugs indicates this device was rushed to market- Screen mirroring is clunky to set up and prone to failure", "verified": true, "helpfulness": "2/2", "author": "Orlando"}, {"rating": 5.0, "review": "Every once in a while you find a technology gadget that just blows you away, and changes your expectations.  This is one of those devices.For the price and functionality, this is a steal.  The size and performance make it incredible.  90% of the time I accessed Amazon Video through my PlayStation 3, that has just been replaced, and this is faster, more reliable, and offers quicker time to access the service.Highly recommended, even if you have to pay 2x the $19 into price at which it was initially offered to Prime members.", "verified": true, "helpfulness": "0/0", "author": "Tucker Goodrich"}, {"rating": 3.0, "review": "It's a very cheap alternative to a set-top box. I picked up one of these from Best Buy for $25 and a second one from Ebay since they sold out everywhere. It's great if you just want to watch Prime Videos or Netflix.I side-loaded XBMC onto mine and it's a bit under powered for that use. It will take a solid 5 minutes to load up videos and get everything going on XBMC. If you wanted your libraries to update when XBMC starts up, forget about it. The stick will freeze up and become unusable for a time. I've had to force close the app and restart it multiple times. Rooting the stick to only run XBMC would likely free up more resources and make the experience better, however it's nice to the Amazon interface for Prime/Netflix/etc. content.After a couple weeks of very light use, the remote control that came with the stick also stopped fully functioning. The circular clicker has up/right/down/left directional navigation. Unfortunately Amazon's interface doesn't have circular navigation, meaning when it gets to the end of a menu, you can't continue to go down or right and be sent back to the beginning.This is particularly bad when the \"Up\" button stopped working on my remote. I am unable to return to other menus without restarting the stick and can only go \"Down\" / \"Left\" / \"Right\".Unfortunately they as of yet also do not have an iOS app.Amazon agreed to replace my remote for free -- not surprised because it feels like it costs about $1 to manufacture.The Amazon operating system also has some annoying software/hardware bugs:Button presses aren't always registered by the systemStick can get stuck in a mode where 2.4Ghz wireless will either not connect or \"Connect with Issues\" and render the stick useless. I had to rename my 5Ghz and 2.4Ghz wireless networks differently so that I could connect without issue to the 5Ghz wifi.Prime music playlists don't always sync up properlyVerdict: 3/5 stars. If they can make the hardware more reliable and fix the software issues this is a solid platform for a low-cost entry to turn any TV into a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "CVO"}, {"rating": 3.0, "review": "On the plus side, quick and simple setup, and a snappier interface then Roku or Apple TV. However, one of the main reasons I opted to get the Fire TV Stick, when I already owned other streaming options, was the Miracast support. Unfortunately, it doesn't work with my Surface Pro 3, and other Windows users have reported the same problem (it's not just isolated to the Surface).", "verified": true, "helpfulness": "1/1", "author": "dcJohn \"jwind\""}, {"rating": 2.0, "review": "Not exactly what I thought it was going to be. You still have to pay for programs (Showtime, Netflix, etc.....) you want to watch.", "verified": true, "helpfulness": "0/1", "author": "Robert Hudson"}, {"rating": 5.0, "review": "This thing is so cool and handy, I use it all the time.", "verified": true, "helpfulness": "0/0", "author": "brubenstein92"}, {"rating": 2.0, "review": "1 star -8 Dec 2015, afternoonhttp://www.amazon.com/forum/kindle/ref=cm_cd_fp_ef_tft_tp?_encoding=UTF8&cdForum;=Fx1D7SY3BVSESG&cdThread;=Tx2CDOG0K31UBSBThis thing is GARBAGE.  Guess this is what I get for being an early adopter.  Nice in theory, executed poorly.  I can't believe they shipped these out.  It will not stay on the network, disrupts my wireless network, then forgets how to connect to my wireless network.  The remote will sometimes stop responding (or the unit stops responding to the remote), and then it stacks up all the \"commands\" the remote was issued and executes them once it does start responding.You will likely be forced to use the HDMI extension, if you don't it gets even worse. I have an LG 46\" LED TV and without the extension, my network basically blew up and puked on itself because of the Stick.  I think it should be called Amazon Fire STUCK.Update - 2 Stars, 8 Dec 2015, 930pm: called tech support.  Was transferred to a second tech person.  I could barely understand anything they said.  It wasn't the light accent they had, but the really poor audio quality.  I tried to ask them to speak up and clearly but I always got a \"Uh huh, okay\" to that request.  She had me move the device from my port 4 on the TV to port 2 and remove the extender cable.  I still didn't have an internet connection (and I had powered it off at least three times).  Next, she had me go into Settings, System and check for a software update.  Checking for software update is not there, I told her this and she sounded confused - obviously reading from a script.  It was under settings-->system--> about.  I had no updates available and told her this. I told her the \"last checked\" was todays date.  She said \"well, I guess that solved our problem\".  Wait...what? No, I told her the last update date was Nov 10 and would be happy to read her my version number. This fell on deaf ears.  The unit did start to work though.  I don't have an answer as to what was going on or why it wasn't working for the last two days.  She did have me press the back+right movement button (She didn't tell me if it was supposed to be at the same time or one after another even after asking).  I pressed them at the same time and held it.  I'll call it the Amazon Two Finger Salute because after doing that, it started to work.My ping times are not super, but definitely not as bad as they were when I first started this out.  I will continue to update as I use the device.", "verified": true, "helpfulness": "1/3", "author": "P. Cahill"}, {"rating": 5.0, "review": "Will be ordering 2 more. Still love the Chromecast, but this is slowly becoming #1.", "verified": true, "helpfulness": "0/0", "author": "Scott Graves"}, {"rating": 4.0, "review": "good product...no power off feature...if u overuse it and it freezes...u have to unplug device...a power off button would be nicer...............also controls are too senistive", "verified": false, "helpfulness": "0/0", "author": "shanti dewan"}, {"rating": 3.0, "review": "Reasonable for my needs.", "verified": false, "helpfulness": "0/0", "author": "kaly   karusala"}]