[{"rating": 5.0, "review": "Easy setup...", "verified": true, "helpfulness": "0/0", "author": "Saadi Hamid"}, {"rating": 5.0, "review": "so far awesome, soooo much better than chromecast!", "verified": true, "helpfulness": "0/0", "author": "S. Page"}, {"rating": 1.0, "review": "Started out great, connected to my A/V receiver.  Great picture and plays all the musi I've purchased from Amazon.  However, after a few minutes my tv screen flashes green with whatever I'm viewing flashing in the background. Then the screen goes solid green while I still get audio.I called customer service and was told by Matt that it has to be plugged in directly to my tv.  All the receiver does is act like an hdmi switcher.  It directs what comes in to the output you select to your tv and speakers.  Amazon needs to send their customer service reps for some electronics training.  I am returning it!!!", "verified": true, "helpfulness": "0/1", "author": "Stuart D. Saull"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Stephen Wilson"}, {"rating": 5.0, "review": "Outstanding!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "elaine Erenstein"}, {"rating": 1.0, "review": "Device no longer works, after less than 2 months. Got with reward points so I cant return it.", "verified": true, "helpfulness": "0/0", "author": "Lucy Pugliese"}, {"rating": 1.0, "review": "What a disappointment.  This can't receive our internet speed at a high enough bandwidth and therefore, can't actually stream any shows.  We have an Apple TV set up on the same TV and don't have issues with it.  I have tried this three nights in a row and have just resorted to watching Amazon Prime on my iPad and computer or switching to the Apple TV.  I wish I could blame this on our internet speed, but we have premium internet and a brand-new Apple wireless router.The Firestick was easy to set up and the layout is great.  I really want to like this product, but since it doesn't actually stream, I can't...", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "I love watching movies with the family and this gives us so many choices to choose from", "verified": true, "helpfulness": "0/1", "author": "robin"}, {"rating": 4.0, "review": "Easy to use, lots of free good movies.", "verified": true, "helpfulness": "0/0", "author": "Margaret A Tigan"}]