[{"rating": 5.0, "review": "Fire TV Box is out of production and there is no availability + no option for being added to a wait list. Separate Voice Activated Remote for Fire TV Stick has had a price reduction of $10 August 2015. Red flags that new generations will be released. Anyone know release date for new Fire TV Stick? And whether it inclues the voice activation in the remote that comes with the \"boxed set\"?", "verified": true, "helpfulness": "0/0", "author": "MaryMaryDallasMary \"CrazyMary\""}, {"rating": 5.0, "review": "Works a lot better and faster than what was built into my TV.", "verified": true, "helpfulness": "0/0", "author": "J. Tasca"}, {"rating": 5.0, "review": "Love my Amazon Fire Stick! It's easy to get started to watch great TV shows and movies.", "verified": true, "helpfulness": "0/0", "author": "Saida"}, {"rating": 5.0, "review": "Easy to install", "verified": true, "helpfulness": "0/0", "author": "Mary Youngblood"}, {"rating": 5.0, "review": "Love this!!!! Transfers easy from room to room. Kids love it!! I love Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Petra"}, {"rating": 5.0, "review": "Work wonderful!!!", "verified": true, "helpfulness": "0/0", "author": "amy71405"}, {"rating": 5.0, "review": "Love this device.  I have bought 3 of them now.  I mostly use them to monitor home security cams at each tv location.  You just switch hdmi inputs and what there are all your cameras running on an android ip camera program.  so simple", "verified": true, "helpfulness": "0/0", "author": "John Beeson"}, {"rating": 5.0, "review": "Love everything about this!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Lisa Johnson"}, {"rating": 5.0, "review": "This is an upgrade from the original Fire TV. It works very well, and is compact. Further, it plugs into the HDMI port, thus saving a lot of hassles. I have tried Netflix and it works very well. I had a Samsung blue dvd player which can also perform many functions like this one, but it does not have Amazon prime built in (it was an older model with many streaming channels missing). So must say I am very happy about it.My Fire TV broke down just after one year.  I hope this one will last.", "verified": true, "helpfulness": "0/0", "author": "Math Twain HY \"gij\""}, {"rating": 5.0, "review": "Works great and provides us with options. Love it!", "verified": true, "helpfulness": "0/0", "author": "Kimberly A Slater"}]