[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "willfredo matos"}, {"rating": 5.0, "review": "I have been very pleasantly surprised by the simplicity and quality of this device.  I recently moved to a new location that was not equipped with LAN capability for a direct feed into my TV. I took a chance that the fire tv stick would be a low cost solution to my problem.  It literally took 5 minutes to set everything up, automatically associated with my Amazon Prime account, and was streaming Netflix in hiqh quality HD.  This device works so well, that i intend to purchase additional devices for use on my other TVs.  Very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "TomP"}, {"rating": 5.0, "review": "I like it easy to remove and move from TV to TV... Not big and bulky...", "verified": true, "helpfulness": "0/0", "author": "kuulei tangonan"}, {"rating": 5.0, "review": "I like my apple TV, but I love my Fire Stick!!!", "verified": true, "helpfulness": "0/0", "author": "Michael DuSaules"}, {"rating": 5.0, "review": "Very good ... lots of things to see ... with the Amazon way ...", "verified": true, "helpfulness": "0/0", "author": "Ruben Farias Garcia \"Bill\""}, {"rating": 5.0, "review": "Works great so far we love it.", "verified": true, "helpfulness": "0/0", "author": "jennifer taylor"}, {"rating": 5.0, "review": "Amazing!  Why did I wait so long?  Super easy set up........can't keep my kids off of it!  Great addition to my prime membership.", "verified": true, "helpfulness": "0/0", "author": "Deb Ward"}, {"rating": 5.0, "review": "Love it! Our family uses this for so many things, we don't even watch normal tv anymore.", "verified": true, "helpfulness": "0/0", "author": "lucabella"}, {"rating": 1.0, "review": "I own several streaming devices, including Roku, AppleTV, and a smart TV.  My Fire TV Stick is by far the least reliable of all these devices.  In all the time I've owned it, I have never once managed to make it through an entire movie without several lagging or buffering issues.  I'd blame my connection if it weren't for the fact that my other streaming devices do not demonstrate these problems.  I've tried troubleshooting these issues, but nothing seems to correct the problem.  I will say that the interface looks really sleek, but the functionality of the device is just too riddle with difficulties.", "verified": true, "helpfulness": "1/1", "author": "Kenneth Broadway \"StTolkien\""}, {"rating": 5.0, "review": "Love it!!  Way better than our Chrome cast!", "verified": true, "helpfulness": "0/0", "author": "Trish"}]