[{"rating": 4.0, "review": "Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Y.A.C"}, {"rating": 4.0, "review": "Good product - easy to install even for a Luddite", "verified": true, "helpfulness": "0/0", "author": "Silver Traveler"}, {"rating": 5.0, "review": "Pretty incredible that something so sleek can do so much. I'm overly impressed. Hooked it up to an older lg lcd tv hanging on bedroom wall that is NOT a smart tv. Didn't want to mess with adding a shelf for blue ray player. This offers a world of apps as well as high quality streaming video through Amazon. Seriously underpriced for what it is.", "verified": true, "helpfulness": "0/0", "author": "Travis Mettenbrink"}, {"rating": 3.0, "review": "It's okay. I would love it if with my Prime Membership I was able to get more shows free, i.e. the TV show Once Upon a Time is a pay per view. I am already paying for a yearly subscription for Prime. I would have to get HULU plus at $7.99 a month to not pay a per view fee. I thought that getting the Fire Stick would be less expensive than my cable subscriber. Not the case. In order to view the shows that I usually watch I would end up having to get so many different subscriptions it would cost me more in the long run. My fiancee found a show he liked, he thought it was included with Prime, it was, the first episode only, if he wanted to see the rest it would cost him +$100.00....nuts!!! I like that I can load albums and listen via the fire stick. The remote is easy to operate once you can finally get the battery compartment open to load the batteries (really Amazon?, that design is insane!) we had to go to YouTube.com to see if there was a 'trick' to opening the compartment....and there was, a few, that tells you something. After waiting the longest time I have ever waited for an order, over 2 weeks, I am under-impressed overall.", "verified": true, "helpfulness": "0/1", "author": "Christine Riemer"}, {"rating": 5.0, "review": "It's the best piece of equipment of this type I have ever used. Far surpasses Roku. Very well thought out. Love it.", "verified": true, "helpfulness": "0/0", "author": "Danny Boy"}, {"rating": 4.0, "review": "I'm impressed by the fire stick. The picture quality and sound are impressive, when compared to another product which is essentially the same, but the price is almost 2x the price of fire stick.", "verified": true, "helpfulness": "0/0", "author": "steven"}, {"rating": 5.0, "review": "Love it so far.  Very easy to install.  We were watching a show within 10 minutes of plugging it in.  Super user friendly even for people who aren't tech savvy. We only use it for streaming from Prime and Netflix so I haven't tried to play any games.", "verified": true, "helpfulness": "0/0", "author": "Heather Austin"}, {"rating": 1.0, "review": "The fire stick causes movies on Netflix to buffer too much.", "verified": true, "helpfulness": "0/0", "author": "Angie Hoskins"}, {"rating": 1.0, "review": "No ability to add files to watch on television", "verified": true, "helpfulness": "0/1", "author": "Dana Sheedy"}, {"rating": 4.0, "review": "Loads content quickly.  Interface a little clunky.", "verified": true, "helpfulness": "0/0", "author": "Timothy L Braunbeck"}]