[{"rating": 1.0, "review": "It is constantly dropping wifi. I have followed all the recommendations to fix this problem. When you try and reconnect it will pick up the network but stay at saved and but try to reconnect. Unplugging it works half the time at best. I've had it right next to the router and it will say out of range.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "Perfect for using at a hotel. Only streaming media device that will allow you to accept the hotel security screen.", "verified": true, "helpfulness": "0/0", "author": "J. Mccullough \"SoonerJim\""}, {"rating": 5.0, "review": "wow this has changed my life and I am now enjoyed all the programs I am interested in on my big tv screen", "verified": true, "helpfulness": "0/0", "author": "J. S."}, {"rating": 5.0, "review": "best ever", "verified": true, "helpfulness": "0/0", "author": "Wilma  Odell"}, {"rating": 5.0, "review": "Awesome, and fast! Lots of third-party apps that you can use on it. The remote makes it so much easier to use!", "verified": true, "helpfulness": "0/0", "author": "Rendiggity"}, {"rating": 5.0, "review": "I bought this for my youngest daughter as alternative to buying a smart TV very easy to install and use and I love the parental control system and if you're traveling this summer and you're going to hotel rooms bring it with you it's very easy to use works well with Amazon Prime Netflix and Ytube App are very easy to use will save a lot of money on pay per view stuff with hotels.I give the fire sticks thumbs up great for everyone to use.I like it so much I'm going to buy 1more .Regards KJ", "verified": true, "helpfulness": "0/0", "author": "kurt johnson"}, {"rating": 4.0, "review": "Love it so far...much better than the Roku stick that I sent back.", "verified": true, "helpfulness": "0/0", "author": "charles morgan"}, {"rating": 2.0, "review": "Did not like selecting menu. Switch  my Roku unit,", "verified": true, "helpfulness": "0/2", "author": "gene"}, {"rating": 5.0, "review": "Super fast delivery with Amazon Prime, as usual.  Amazon has done it again. Always striving to give us alternatives and options and not afraid to choose the road less traveled. I have been searching for an alternative to the overpriced and repetitive programming offered by cable companies.Installation of the Fire TV Stick could not be easier. You don't have to be an electronic guru. If you are a prime member, the Stick comes pre-registered to you.  Everything you need for installation and operation is included in the kit--yes even the right batteries for the remote.I signed up for the Sling TV package and got my Fire Stick free. I can access everything--all my applications, my Kindle libraries, even the mirroring option on 2 devices. TV, music, videos, games-it's beyond impressive. If you are debating on whether to try this, don't. Unless of course you are committed to supporting your local cable company.  Way to go Amazon!", "verified": true, "helpfulness": "0/0", "author": "SeaQ"}, {"rating": 5.0, "review": "Amazing!  What a wonderful replacement for the connection cable I've been using for years.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Kimberly A. Mcferren \"Kimikazi\""}]