[{"rating": 4.0, "review": "For the price, this is an exceptional device, but there are several problems. Let's start with the good:1. You can sideload virtually any app you want -- use a tool to download whatever APK you want (non-premium apps only, I believe) off the google play store and use ADB to install it to the Fire TV Stick. That includes XBMC, which works very well.2. Its fas and plays everything you throw at it.3. The remote works without line of site.4. It integrates with Prime instant video.Downsides:1. The interface is not intuitive.2. Its hard to figure out how to find apps from the Amazon App Store. In fact, its never clear that you're searching the AppStore. I wish there was a simple icon named \"App Store\" that made it clear that that's where you were.3. Its impossible to use many apps, including some that are officially listed as compatible with this device on the Amazon App Store because movement and selection of \"buttons\" using the remote is not easy. I can't tell what option or button I've selected -- its a guessing game, and that sucks.4. The onscreen keyboard stinks. Often it won't go away even after completing text entry and clicking next.5. Sideloaded apps don't show up in the installed app list -- you have to go through a kludgy process in the settings menu to get to them. That sucks. Totally sucks.6. No Google Play store. Why am I forced to rebuy apps that I already own on Google Play on the Amazon App Store? It makes no sense to me. What is Amazon afraid of? The number of users installing the Google Play store will be few and far between.7. No out of the box Airplay support. Now that would be killer.8. Miracast isn't supported by all Android devices.9. Difficult to add bluetooth accessories (mouse, keyboard). Have to install a settings app to enable that.", "verified": true, "helpfulness": "0/1", "author": "Kamran S."}, {"rating": 5.0, "review": "I purchased this in the pre-sale period and just received it today.  I have a roku3 and the speed and features are great from this little stick.  I think i'm going to use it as my travel set top box.  When I go to relatives house they rarely have a decent set up so this nice small stick will travel well.", "verified": true, "helpfulness": "0/0", "author": "Jeffery Durand \"Jeff\""}, {"rating": 5.0, "review": "Have been using PS3 and Rocku to stream Amazon Prime or Netflix movies. Decided to give Fire TV stick a try (purchased while it was on special for $19.99). Glad I got it. Very small in size and good back up for my other streaming devices. Also planning to take with me when traveling.", "verified": true, "helpfulness": "1/2", "author": "Grigori"}, {"rating": 4.0, "review": "This device is pretty cool!  Everything about it is AWESOME!  It works great.  Takes about 3 minutes to setup, however, Amazon does make you watch a 5-minute introductory video which you cannot bypass.  It is fast and quick to download new apps.  I'm sure more apps will be added later (such as HBO Go, unless licensing fees are the issue).I love the remote, but knowing me, I will lose it somewhere.With that being said, here is the only ConWHERE THE HECK IS THE iOS app?  C'mon Amazon, Apple has sold over 800 Million iOS devices since it has launched iOS and you still only have an app for Android?  Whats going on here?  Yes, I know, Apple TV, but is it as portable or space saving as the Fire Stick?  ABSOLUTELY NOT!How can you launch a new product without an App for iOS?  This is a very rare case of saying, \"There IS NOT an app for that!\"One you have iOS app, i'll increase this to a 5-star rating!Overall, BRAVO!  Love this thing and was glad to be able to get it for $19 when you had the 2-day special!  Had I known it was going to be this good, I would have probably bought 5-more as gifts!", "verified": true, "helpfulness": "3/5", "author": "JoshT"}, {"rating": 1.0, "review": "Unit keeps freezing and can't find my internet connection. It also makes me cycle my router. I use chromecast and roku with no problem. I stopped using fire stick and my router is functioning 100%. I have a high end linkys router that never had any issues. I hope Amazon fixes this or I will have to return two units.", "verified": true, "helpfulness": "3/5", "author": "Theman610"}, {"rating": 2.0, "review": "Garbage loading times. I have 3 chromecasts that work great. No loading issues or buffering problems at all. I have this hooked up to my main TV which is next to my router and the thing won't play a full episode of any Netflix show without buffering constantly and stopping at least once to load. I can't blame poor internet cause all other wireless devices in my house work great in all locations. This thing is awesome when it is working and not loading constantly but that is not very often. I stand by the chromecast.", "verified": true, "helpfulness": "1/1", "author": "Rube90"}, {"rating": 5.0, "review": "This little stick saved me a TON of money. I use this in my bedroom and it's made it easy to get programming upstairs without having to get another cable box or upgrade my TV to a smart TV. Simple to use and set up.", "verified": true, "helpfulness": "1/1", "author": "J.M."}, {"rating": 4.0, "review": "Great product at a great price", "verified": true, "helpfulness": "0/0", "author": "Charles S. Probert"}, {"rating": 4.0, "review": "Plenty of options for TV viewing which will allow me to reduce my Uverse planm", "verified": true, "helpfulness": "0/0", "author": "John W. Thomas Jr."}, {"rating": 5.0, "review": "Had the Fire TV Stick up and running within minutes! Works great. Great price, too.", "verified": true, "helpfulness": "1/1", "author": "Seashores"}]