[{"rating": 4.0, "review": "Got this for my dad and he likes it. I think it works great. Would've received five stars if inner circle could act as an actual mouse to navigate more efficiently.", "verified": true, "helpfulness": "0/0", "author": "superxlinaah"}, {"rating": 5.0, "review": "Easy to setup and easier to use.", "verified": true, "helpfulness": "0/0", "author": "hmason"}, {"rating": 5.0, "review": "with phone app, easy to use. hubby loves it!", "verified": true, "helpfulness": "0/0", "author": "J. Campbell"}, {"rating": 5.0, "review": "Love how easy it is to use and it gives me access to my favorites, Netflix, YouTube, etc", "verified": true, "helpfulness": "0/0", "author": "dance lover"}, {"rating": 1.0, "review": "What a Rip-Off... if you already have a NetFlix account you don't need this... you have to pay Amazon to use NetFlix, and since it was a gift I didn't know the person receiving the gift couldn't make it work.  OK probably not Amazon's fault but they won't allow me to return it.  It's just another case where if you don't read the tiny tiny print they got you.", "verified": true, "helpfulness": "0/0", "author": "Richard Oregon"}, {"rating": 4.0, "review": "So far, so good.  The biggest problem I have is bandwidth from my internet provider -- not a problem with the Fire Stick.  It is doing all that I need it to do; just have to figure out how to get better internet reception without incurring HUGE bills.", "verified": true, "helpfulness": "0/0", "author": "needler \"mcardlekm\""}, {"rating": 4.0, "review": "I love the selections on Netflix .....  not sure how to use Hulu, etc. need more detailed instructions.", "verified": true, "helpfulness": "0/0", "author": "wanda west"}, {"rating": 5.0, "review": "5 mins from opening the box to watching Netflix", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 3.0, "review": "I bought this to reduce constant use of ps3. Disappointed that I cannot use the remote for many of the games. Price of game controller ridiculous. Also purchased a remote control app for third party apps that is not compatible with kindle fire, so wasted $1.99 I will never get back. Also had to buy a WiFi remote for third party apps. Still better than paying for cable, but really if you have a game system that allows you to access Netflix, Hulu, etc...save your money.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Easy to install, works great!", "verified": true, "helpfulness": "0/0", "author": "Rita M LHerault"}]