[{"rating": 4.0, "review": "I really like using this product. It's so much easier than trying to stream Netflix, YouTube, etc. from my computer through the HDMI cables. It's a nifty little gadget. Makes my life easier. The streaming quailty is comparable to using a computer (just make sure your internet connnection is up to speed). Can't beat the price too. I would reccomend for anyone that wants to stream movies, tv shows, music, etc. for a resonable price.", "verified": true, "helpfulness": "0/0", "author": "Annisha Bell"}, {"rating": 5.0, "review": "It was exactly what was promised worth the price and some and the seller was very helpful providing his contact info if I had questions or help overall great buy!!", "verified": true, "helpfulness": "0/0", "author": "mounir belrhitri"}, {"rating": 3.0, "review": "Not a great product if you have a smart tv or blue ray that is internet capable. Bought one, liked it and bought another a few months later.  Second one failed after a few hours.  Stick was very hot to the touch.  Disconnected, let cool and tried again...still cut out and got hot.  Returning stick#2.Happy with functionality of first stick.  Interface is easier to navigate than our wifi blue ray player.  Easy to set up, Prime, hulu, netflix, and pandora function fine.  Will update if first stick fails.  Due to failure of second stick can only give this three stars.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutely love it", "verified": true, "helpfulness": "0/0", "author": "A S."}, {"rating": 5.0, "review": "Came on time, works great!!", "verified": true, "helpfulness": "0/0", "author": "Stephanie and Chris Pratt"}, {"rating": 2.0, "review": "It only allows you to cast Kindle tablets. It does NOT allow you cast ANY other device's screen. It only supports mirroring IF your device already has mirroring capabilities built in. Seriously?! Amazon didn't forget to list the smallest detail in the comparison chart AND YOU JUST HAPPEN TO LEAVE THIS PARTICULAR ONE OUT?!!!? Amazon's biggest competition is Chromecast. Chromecast allows you to CAST from ANY device including Apple! And it's cheaper. Have some decency and simply list the limitations of your device up front. Similar to OTHER sellers on YOUR website.", "verified": true, "helpfulness": "0/0", "author": "HiddenInherentPen"}, {"rating": 5.0, "review": "This device is significantly better than I had expected. I have had it for 1 week, and I wish I had bought it when it first hit the market.", "verified": true, "helpfulness": "0/0", "author": "N8vTxn"}, {"rating": 5.0, "review": "Love It", "verified": true, "helpfulness": "0/0", "author": "MsFroggy"}, {"rating": 5.0, "review": "Amazing easy to install and operate.  Much easier than my Roku.  Very nice product and wonderfully packaged.", "verified": true, "helpfulness": "0/0", "author": "Supreme Shopper"}, {"rating": 5.0, "review": "Excellent seller. Fast delivery. very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Rita Hakopian"}]