[{"rating": 5.0, "review": "good stuff, fast shipping", "verified": true, "helpfulness": "0/0", "author": "doug walker"}, {"rating": 5.0, "review": "Great for seniors!", "verified": true, "helpfulness": "0/0", "author": "eileen ullrich"}, {"rating": 5.0, "review": "Really great product! Haven't had any issues with it and can't wait to explore it more!!", "verified": true, "helpfulness": "0/0", "author": "TJ Lang"}, {"rating": 1.0, "review": "Fire Tv Stick: After reading about this little gadget and hearing Gary Busey scream about it on tv, I finally ordered it intending to access Netflix with it on the tv in my bedroom. When opening the box, there is a manual, a remote, a power cord and the HDMI 'stick'. Powering it on for the first time brings a bit of excitement as many of the Best Movies for 2014 flash across the screen. Being an Amazon Prime member I believed I could watch any movie and when I selected the Disney movie 'FROZEN', I saw that I would have PAY $9.99. Further investigation showed there are movies I can watch for free but they are all on Netflix, so why bother.Getting back to this little gadget, I plugged it into the bedroom tv, got in bed ready to watch a good movie. Buffering.... grrrh! Although I have high speed internet and my tv is a mere 45' away from the router, the little gadget is not strong enough to play anything.It does come with Cloud Storage for photo's and you can view them on your tv screen. It says you have access to millions of tunes, I am not even going to try. And of course if you find a movie you really want to watch, you have the option to buy or rent it. That is one perk over Netflix.I will be staying with Netflix (gag me with a fork), and getting rid of the Amazon Prime membership.", "verified": true, "helpfulness": "3/3", "author": "C. Hodges"}, {"rating": 5.0, "review": "this was the easiest thing to hook-up. and i like that there was that extension piece cause without that i would have needed extension cord , (it was about 1 inch short of outlet).", "verified": true, "helpfulness": "0/0", "author": "Jacqueline C. Bigger"}, {"rating": 5.0, "review": "this thing is so COOL and i'm excited about it. i got it because it was only $20 one weekend on a whim and i love it. i use it for youtube and netflix. its also cool to watch a slideshow of all my cloud stored photos and listen to my prime music. i would like it more if it had more child options like the roku does but for $20 it was definitely worth it", "verified": true, "helpfulness": "0/0", "author": "stephen"}, {"rating": 3.0, "review": "While the access speed is great, I had no idea of the limited amount of free shows to watch.  And when you do find something free to watch the commercial are the same ones over and over again.  Right now I do not see the benefit of having the \"stick\" any movie I find to watch is already months old and I have been out on red box for some time.  With Amazon Prime costing $100/yr and Netflix about the same, I'm thinking red box may be a better deal after all.", "verified": true, "helpfulness": "0/0", "author": "Larry W Myers"}, {"rating": 1.0, "review": "This came as very easy to charge, plug into tv and go.....NO...the.hardest part is getting that stinkin' back off the remote to get the batteries (that I might add, both go in the same direction).Am sure there is something I'm not doing but it Cant be this tough to use!Very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Dawn"}, {"rating": 5.0, "review": "I received my Amazon Fire TV Stick from a co-worker for our Christmas gift exchange.  It does everything I wanted and more.  I would highly recommend this.  Easy to register and set up.  Nice thing about it is once it is set up take it to any TV plug and play.  Thanks Dave Love my gift", "verified": true, "helpfulness": "1/1", "author": "Karen Maranto"}, {"rating": 5.0, "review": "This works great and was very easy toconnect", "verified": true, "helpfulness": "1/1", "author": "Susan Welch"}]