[{"rating": 5.0, "review": "I am so glad I bought this.  I got sick of being overcharged by my cable company. So, I went with AT&T; just to have some internet access.  (AT&T; sucks royally, but doesn't overcharge and doesn't pretend they are doing you a favor like Comcast/Xfinity--our only 2 choices.)  I have an over-the-air receiver which provides more choice than X-finity for WAY less $$.  In fact, the receiver cost less than one month of cable.  I also have Amazon Prime and Netflix.  I figured our internet would be too slow, but was REALLY REALLY surprised and pleased that it worked.  Super easy to use.  I wasn't clear on how to get Netflix to work. It seems as though it's installed, but you have to sort of download an app.  I did an online chat & it took about 5 minutes to get it working.  Easy breezy.  I highly recommend the Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "MadamL"}, {"rating": 5.0, "review": "AWESOME!!", "verified": true, "helpfulness": "0/0", "author": "ALMO"}, {"rating": 5.0, "review": "It worked as advertized!", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "My son loves it  !!!", "verified": true, "helpfulness": "0/0", "author": "Wendy roberts"}, {"rating": 5.0, "review": "Love our Fire Stick! Great compliment to Prime subscription. Some much better than running a cable from out laptop to the TV.", "verified": true, "helpfulness": "0/0", "author": "nateysmom"}, {"rating": 5.0, "review": "Excellent device simple to use", "verified": true, "helpfulness": "0/0", "author": "ashok kapoor"}, {"rating": 5.0, "review": "I love using this compared to the Roku we have on a couple of tv's.  The Roku doesn't let one turn off the unit when not in use...I checked their website too!  This Fire stick I can let it sleep and save energy.  I like the smaller format and controller also.", "verified": true, "helpfulness": "0/0", "author": "Momma Long"}, {"rating": 5.0, "review": "Was everything it said it would be. Very satisfied with the item. Easy to install, easy to use. May purchase more later.", "verified": true, "helpfulness": "0/1", "author": "Rodney Burris"}, {"rating": 1.0, "review": "This is the only device in the house that drops its internet connection repeatedly. It will work fine for a couple hours and then drop the connection. I have to restart the stick or forget the wifi network and reconnect. Even then, half of the time it simply will not connect to the internet, even though it connects to the router. It seems to have a mind of its own. I use other devices in the same place as the TV and they never have this kind of problem. Very frustrating and dissapointing, especially considering this comes from a company like Amazon.", "verified": true, "helpfulness": "2/2", "author": "donny"}, {"rating": 5.0, "review": "I love my Amazon Stick! Best device ever! I would highly recommend over Apple TV and Roku.", "verified": true, "helpfulness": "0/0", "author": "mildryne noze"}]