[{"rating": 2.0, "review": "would be nice if it were a value, seems there isnt much included, most shows have to be paid for, cheaper to get hulu or netflix or both", "verified": true, "helpfulness": "0/1", "author": "Tim A. Alvesteffer"}, {"rating": 4.0, "review": "I have both the Fire TV and the Fire TV Stick.Take my advice...Spend a little more and get the regular Fire TV... You will be much happier with it.Fire TV Stick requires power source from either the TV's USB port or with the included AC adapter.Some TVs do not put out enough continuous juice on their USB ports to power the stick.The stick tends to buffer more often.Amazon did a great job with Fire TV (and the stick as well). Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Vazz44"}, {"rating": 5.0, "review": "love it. watching netflix on my tv versus my laptop is so much more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "LLTanaka"}, {"rating": 5.0, "review": "Love the fire stick! Just can't get over the great picture and how easy it is to install! Great selection of movies and tv series! All around very pleased with the purchase, and would highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "becky"}, {"rating": 5.0, "review": "I am very happy with the device. I set it up in minutes and have used it daily since.", "verified": true, "helpfulness": "0/0", "author": "PHILG"}, {"rating": 2.0, "review": "I only have antenna. Some things more I get but something's I wanted like History Channel I apparently cannot access without cable. Thought fire stick would give me more than what I have accessed thus far. Glad to have news channels but disappointed I cannot get especially History Channel", "verified": true, "helpfulness": "0/0", "author": "Suzy"}, {"rating": 3.0, "review": "I am using the Fire TV Stick to watch nearly everything I would watch at home on my Dish and it works pretty well, except for one VERY annoying issue (more later).On the positives:The interface is great. Very easy to navigate, very snappy; no issues at all - Well done.Great selection of Apps available, Entertainment, Games, Educational, etc. Not including a full android stick, I'd say it is second only to Roku in terms of the number and quality of apps available; and more seem to be available on all the time.Great build quality. The plastic body it very sturdy and feels about as high quality as plastic can. The included power adapter and super long USB cable are very high quality and beautifully built also.Now the Negatives - well really only one, but it's big:I live in the Midwest and stay in a lot of Motel rooms with my job. This is important to the problem as it pertains to the types of internet access I am stuck with here in the Heartland. Mostly its DSL. I have the fastest tier of DSL I can get at my house (15 Mb/s) which in reality amounts to about 4 or 5 Mb/s) and the Motels are a mixed bag; mostly the same or worse. I've had issues with my Playstation 3, Apple TV (Gen2), Roku 2 HD, and a couple of Android media sticks (MK808 plus and Equisno). They all buffer a lot. I've learned to live with it. However, the Fire TV stick does something completely different. Instead of just pausing while buffering it will freeze the image and continue playing the sound track! So now my \"Multi-media\" experience has become and old time radio drama which doesn't work well with a medium that suppose to be visual. Other times it will do this with just a blank scene, but continue the audio track. Very annoying. I've had this occur while using Hulu Plus and Amazon Prime Instant videos (Bosh and a couple of their pilots). When it does this, I ave switched over to another device (usually my PS3) and it works fine - not image freezes on it.Please, Please Amazon fix this. My only solution when this happens is to hit the back button and resume the episode which may or may not work or may work for a minute or two then freeze the image again.I'm not asking for the impossible (not for you to stream perfectly on the crappiest bandwidth in the world), just to pause the audio when the video pauses while it buffers. I'm used to this, I don't like having to guess who's winning a fight in Arrow based on the sound effects.This would easily be a five star product if this were fixed.", "verified": true, "helpfulness": "0/0", "author": "jjjtech"}, {"rating": 5.0, "review": "Very please with this product.  Simple to set up and worked instantly.  There are a lot of choices for watching movies, playing games, listening to music...etc.  Very happy with this!  I just bought two more for my kids' rooms.", "verified": true, "helpfulness": "0/0", "author": "K. Hayes \"K Hayes\""}, {"rating": 1.0, "review": "Don't work for all tvs... Beware", "verified": true, "helpfulness": "0/0", "author": "Jason Michalski"}, {"rating": 3.0, "review": "Horrible battery design compartment on the remote.Obnoxious Intro that I can't skipEdit: As far as use the actual remote functions nicely.  The circle arrow control is intuitive and easy to use.", "verified": true, "helpfulness": "0/0", "author": "jake"}]