[{"rating": 5.0, "review": "Love them", "verified": true, "helpfulness": "0/0", "author": "Pam milburn"}, {"rating": 5.0, "review": "I love it!!!! :)", "verified": true, "helpfulness": "0/0", "author": "Denjenks"}, {"rating": 4.0, "review": "I really like this, went from spending $200 on cable a month to this with sling tv, hulu, and Netflix for less than 35 a month and I'm not missing any of my favorite shows between the 3 and an antenna for local channels. So glad I found it! I do wish the remotes would work with all fire sticks because we have two (bought one and got one free for signing up with sling tv) and when I can't find one it would be nice to use the other but it's not too big of a deal. Overall I am very happy with it and I am saving a ton. Also we just went to the coast and brought it along so we could watch all of our shows at the hotel and it was great!", "verified": true, "helpfulness": "1/1", "author": "Crystal"}, {"rating": 5.0, "review": "This was one of the best buys I ever bought! Great idea and so easy to use. Love it in everyway!", "verified": true, "helpfulness": "0/0", "author": "Lisa Emry"}, {"rating": 1.0, "review": "Don't waste your money. It constantly loses connection. I haven't been able to watch a single show. My wireless router is two feet away from the TV.", "verified": true, "helpfulness": "0/0", "author": "James Garnhart"}, {"rating": 3.0, "review": "This stick with remote works wonderfully. The only problem is the buyer has to purchase every listed icon to watch anything (like Hulu, Amazon Prime, Netflics, etc.). Tried the Amazon prime trial and found most of the movies worth watching had to be rented for a 4 dollar fee anyway. Such a waste!", "verified": true, "helpfulness": "1/1", "author": "Jenny Huang"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Wayne T Gardiner jr \"Wayne\""}, {"rating": 5.0, "review": "we love it, it was as gift and we use it at the office. Everybody is happy with the way it works.", "verified": true, "helpfulness": "0/0", "author": "San Diego reviewer"}, {"rating": 4.0, "review": "Good device if you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Paul F. Bruce Jr."}]