[{"rating": 3.0, "review": "Some days it works fine, some days I have to remove the hdmi extender to make it work and then other days I have to put it back to make it work.", "verified": true, "helpfulness": "0/0", "author": "Dale Patrick"}, {"rating": 1.0, "review": "very upset, i purchased this because i travel work work, it doesnt work in hotels, would have been nice if this was pointed out before ordering !!!!!", "verified": true, "helpfulness": "1/1", "author": "T Dowie"}, {"rating": 1.0, "review": "They work for a few days then they quit working.  I've ordered 2 of these and both of them have had connectivity problems.  Fortunately, Amazon provides free return shipping.  Amazon needs to fix their quality control issues.  This would be a great device if it worked as it should.  For me, a Blu Ray player is my next solution.", "verified": true, "helpfulness": "3/3", "author": "Mark in CO"}, {"rating": 1.0, "review": "I had such a bad experience! I purchased the fire tv for my living room and the fire tv stick for my kitchen televisions. The fire tv stick would not work on my toshiba hdtv at all - it just displayed the splash screen and stopped working. I called the problem into Amazon and they said they would another out. When it arrived, they had sent a replacement remote by accident so I had to request the replacement unit again. When the replacement arrived, I plugged it in and had the exact same problem -splash screen, then dead. I researched online and found that many others had the same problem. Since I had a Fire tv in my living room, I tried using it on my kitchen tv to see if it would work. It did not; I didn't even get a splash screen with it, just a black screen. I would up returning the two firesticks and erroneous remote to Amazon, but kept the regular fire tv for the living room as it worked fine on that tv. I then purchased a Chromecast from best buy, plugged it into my kitchen hdtv, and surprise surprise, it worked right away without problem. The most annoying thing about the experience was that Amazon said they has no reported problems with the fire stick. I told them that I found numerous reports of customer problems just like mine online. They seemed uninterested. If they aren't going to acknowledge the problem that the stick conflicts with some hdtv sets, there tech team is never going to problem shot and resolve it. Amazon should do better.", "verified": true, "helpfulness": "2/2", "author": "T. M. Kovacik"}, {"rating": 5.0, "review": "This thing is great. I've been a member of Prime for about 8  months. Every time I'd try to watch a movie from instant video through my PS3, it would constantly buffer or tell me I was disconnected from the network.  When we would try to watch a movie, I'd make everyone turn off all their devices so there was no other traffic on our internet connection. That didn't help either. It was very frustrating.  Finally out of my frustration I started looking at streaming sticks.  I went for the Fire Stick because I've always been pleased with Amazon. When I would have issues watching videos they would sometimes refund the money I spent renting and thinking a huge company like Amazon still cared about customer service made me feel good about them. When it arrived it was very easy to set up. Just plug it in, connect to the internet and go. That's it. We've had it for a couple months and it's awesome.  No buffering at all. Last night we watched a movie. I was on my Fire. My wife was on her device downloading music and my daughter was on youtube all at the same time (doesn't say much for the movie, I'm talking to you Maze Runner), but we had no issues at all with buffering of the movie. All in all the Fire Stick is one of the best home entertainment purchases I've made since my PS3 years ago. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "E"}, {"rating": 5.0, "review": "Highly recommend over chromecast!", "verified": true, "helpfulness": "0/0", "author": "William Brian Clay"}, {"rating": 5.0, "review": "Great product!!! I have the box also and both are excellent. I plan on buying another stick for my kids bedroom. Don't even bother looking at all the other options on the market. Especially the Fire Box blows them all away!!!!!", "verified": true, "helpfulness": "0/0", "author": "Mitchell  radell"}, {"rating": 5.0, "review": "Easy to set up! Easy to use! Perfect! So happy I invested in this!", "verified": true, "helpfulness": "0/0", "author": "Chelsea"}, {"rating": 5.0, "review": "Love  that I will recommend  to all my friends. Now  I can  watch  all the movies  I want", "verified": true, "helpfulness": "0/0", "author": "Ewa Grance"}, {"rating": 5.0, "review": "I have to say.... I love it - when I can't find something to watch on 'regular' tv, I flip to the Fire Stick and start browsing.  Easy to use, piece of cake to set up and for the price it has been worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Elle Gardner"}]