[{"rating": 5.0, "review": "really good.", "verified": true, "helpfulness": "0/0", "author": "stan wojciechowski"}, {"rating": 4.0, "review": "It is a great device for watching anything you need to after you get rid of cable/satellite TV.  It is a bit choppy at times, but for the price it cannot be beat.", "verified": true, "helpfulness": "0/0", "author": "jonathan white"}, {"rating": 4.0, "review": "Cute little stick. I had to use the extender because it was a little big for my TV's HDMI slot. I enjoy the device, it picked up my wireless network rather quickly and I haven't had any problems as of yet. I would like to see a few more apps get added to the stick but I'm sure that will come in due time.", "verified": true, "helpfulness": "0/0", "author": "Alexis Timmons \"Aitimme2\""}, {"rating": 5.0, "review": "I love this product.  I enjoy watching movies and TV on the big TV screen and this product makes it possible.  It was easy to set up except for getting the battery cover open - gggrrrrr!  I almost gave up on the product in the beginning, though, because my cable service provider's router was finicky and wouldn't play nice with the Fire Stick.  After getting some advice from Comcast, I reset the channel on the router and then the Fire Stick TV worked most of the time.  It still occasionally sticks, but an Amazon tech rep advised me to reset the router if that happens, and it will usually be fine.  So far, that's true, and it doesn't seem to stall very often now.  The other confounding problem in the beginning was that it refused to play Prime Instant Video content because it didn't recognize me as a Prime member for some reason.  Again, with some advice from Amazon's tech guy, who was friendly, patient, and helpful, I emptied the saved settings and re-entered my account information (and yes, I did it right the first time), then everything went forward smoothly.  I have been enjoying an amazing number of shows for free that I never knew were available, and I have made purchases of movies as well that I can stream whenever I like.  I briefly tried a Chrome Cast, but I like this much better as the small stick operates as a remote control and it is so convenient to use.  (I placed an app on my tablet that lets me put the shows on the TV, too, but I much prefer using the Fire Stick.)  In summary, if you are like me and not a tech wizard, you can still use this product easily, but you may (or may not) need to be patient until you get your internet settings running smoothly.  I was happy I kept at it until I got it right, because I use it a lot and really like the technology.", "verified": true, "helpfulness": "0/0", "author": "Florida Lady"}, {"rating": 5.0, "review": "luv it", "verified": true, "helpfulness": "0/0", "author": "Joseph S. Sells"}, {"rating": 5.0, "review": "I highly recommend this product!  Easy to use, my husband loves it..buying two more asap!", "verified": true, "helpfulness": "0/0", "author": "Stacey Sherman"}, {"rating": 4.0, "review": "Easy to configure and get up and running.  Some buffering when used with sling tv.", "verified": true, "helpfulness": "0/0", "author": "JFK"}, {"rating": 3.0, "review": "I bought the Fire Stick as an attempt to have access to material I couldn't get through my regular cable provider. So far, the feed is choppy, channels that were promised are not visible or available, and you can't turn the thing off when you are done. I wanted streaming but not 24/7 as I have some other things to do with my life besides watching TV. We couldn't even get the instructional video to play completely. I may be returning it.", "verified": true, "helpfulness": "0/0", "author": "jkpscrap"}, {"rating": 5.0, "review": "Product arrived on time and was easy to set up just plug it in and follow the on screen directions. Very easy to move from screen to screen no problems so far.", "verified": true, "helpfulness": "0/0", "author": "Tom C"}, {"rating": 2.0, "review": "Amazon prime content is interesting however only available if you are in the US... there are many free apps however content for those that do not require a subscription is not interesting and outdated.", "verified": false, "helpfulness": "0/0", "author": "EP"}]