[{"rating": 5.0, "review": "I'm impressed with the fire tv from amazon.... the set up is easy and I'm very please with product the delivery and please with everything. ..thumb up....", "verified": true, "helpfulness": "0/0", "author": "Pamela"}, {"rating": 4.0, "review": "s starsvery intuitive", "verified": true, "helpfulness": "0/0", "author": "Clayton M. Hill III"}, {"rating": 5.0, "review": "minor issues with a freeze here or there but work better than my samsung smart tv.", "verified": true, "helpfulness": "0/0", "author": "jt"}, {"rating": 5.0, "review": "I love this thing! It works great!", "verified": true, "helpfulness": "0/0", "author": "De"}, {"rating": 5.0, "review": "This was well worth the purchase price! I really had no idea what to expect as this was a gift my husband wanted. He loves it and I have to say that I do to. I ordered Amazon Prime to go along with it and it appears that many of the movies and TV shows are included only with Prime, so I'm happy I went ahead and purchased it. We are still exploring all the Fire Stick has to offer, but so far are very happy with the purchase and the product. We are actually going to order one for my in-laws.", "verified": true, "helpfulness": "0/0", "author": "Robin"}, {"rating": 5.0, "review": "This device is amazing. Far exceeds my expectations. Extremely easy to install & very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Sky-Mike"}, {"rating": 5.0, "review": "This not only met my expectations, but exceeded them. It was easy to set up, and has way more features than I realized, such as YouTube support and my favorite local radio stations. If I could just find a way to watch live TV broadcasts using it, I'd abandon my digital antenna and TiVo.The user interface for navigating my watchlist is a bit clunky, and the Fire TV Stick has lost its network connection a few times (when our WiFi and internet connection are just fine). But I'll chalk those up to \"new product\" issues, and assume things will improve over time.", "verified": true, "helpfulness": "0/0", "author": "Todd Bradley"}, {"rating": 5.0, "review": "Very cool . So far works flawlessly. Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "DaveW"}, {"rating": 5.0, "review": "Very happy with the Fire Stick!  It was super easy to install, and was up and running in minutes!", "verified": true, "helpfulness": "0/0", "author": "K. Dolan"}, {"rating": 5.0, "review": "This was a great gift as I could not watch prime with my chrome cast. This unit is responsive and streams extremely well. I have chromecast, roku stick and now fire stick. Fire stick over all best quality. Roku menu is easier to use but that is the only negative.", "verified": true, "helpfulness": "0/0", "author": "Tommie R. Scheible"}]