[{"rating": 5.0, "review": "Better than having cable", "verified": true, "helpfulness": "0/0", "author": "Pete Maggio"}, {"rating": 5.0, "review": "Great Purchase.  Loads of old movies and television programs.", "verified": true, "helpfulness": "0/0", "author": "Corey R."}, {"rating": 2.0, "review": "Too difficult for me to use and took too much time to load up (Netflix).I gave it away to a friend. ($40) cost.", "verified": true, "helpfulness": "0/0", "author": "Ann"}, {"rating": 4.0, "review": "easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "John Gettys"}, {"rating": 5.0, "review": "I love my fire stick. Set up was easy. The format is easy to find movie or shows. I was surprised that I still have to rent some movies. And I would not recommend it for children. The parental controls are very limited.", "verified": true, "helpfulness": "0/0", "author": "Dorothy Gordon"}, {"rating": 5.0, "review": "Amazon did again with their products...I have an older tv but it works pretty good...love it", "verified": true, "helpfulness": "0/0", "author": "Raj Singh"}, {"rating": 5.0, "review": "I caught the $25 deal and couldn't be happier!I think the key is already having the Prime Membership to make this an awesome change to my TV viewing!I won't go into much detail, but rather point you to any review you can find on the latest \"streaming\" options (Chromecast, Apple TV, etc). They all rate Amazon tv fairly and always very high.Ease of use - yes, lots of viewing options - yes (with Prime), affordable - yesIt also if very flexible in being able to add other streaming services like Hulu, Netflix, etc. Provides point of access to whatever streaming services you haveOne step closer to cutting the Uverse cord", "verified": true, "helpfulness": "0/0", "author": "Scott Casey \"WeSingBarbershop.com\""}, {"rating": 5.0, "review": "What can I say. You like prime?This is the best way to access your prime content.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "Very good...easy to use...love it!", "verified": true, "helpfulness": "0/0", "author": "Thomas O'Hare"}, {"rating": 5.0, "review": "Works very well, especially with the voice control using the phone app. Have had to unplug it to reset it twice in several months, but it generally works great and was money well spent.", "verified": true, "helpfulness": "0/0", "author": "Dan"}]