[{"rating": 4.0, "review": "I really like how compact it is and how simple the remote is. Good value for the money. Very little hardware makes set up really easy. Could use a more detailed instruction manual though. I'm sure the fire stick does a lot more than I know.", "verified": true, "helpfulness": "0/0", "author": "hudsoncobra"}, {"rating": 5.0, "review": "I received this as a gift. It has been a great addition to my media experience. I have also been able to view my older movies that I had only on tapes.", "verified": true, "helpfulness": "0/0", "author": "James A Rainwater"}, {"rating": 5.0, "review": "Easy to install and use once you get used to the buttons.", "verified": true, "helpfulness": "0/0", "author": "M. L. Sherman \"Joeys Nana 99\""}, {"rating": 5.0, "review": "Fantastic item, I am almost considering cancelling my Comcast because of this. Lots of shows and movies to choose from, easy to use and easy to set up. Five stars all the way.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 3.0, "review": "Love it but can't find HBO go! How can I watch HBO programming on the fire stick without paying again? The App Store only has a HBO app for android.", "verified": true, "helpfulness": "1/1", "author": "Donna Shackelford"}, {"rating": 3.0, "review": "Used it for a while, then went back to my Roku 3.Display is very busy.  Remote buttons are a bit stiff.", "verified": true, "helpfulness": "0/0", "author": "Magoo"}, {"rating": 2.0, "review": "I'm returning this item because it is awkward using in on my 2008 Toshiba TV with only 2 HDMI plugs on the back.  After 3 uses, I'm unable to get a signal even when I plug the device directly into the TV Port.  It worked very well when I get it to work but it takes several off/on attempts to get the device to kick in.", "verified": true, "helpfulness": "0/0", "author": "W R Allen"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV Stick to stream Amazon Prime and Netflix content after discovering that my 2011 Samsung Blu-ray player could not stream Amazon Prime (too old, I guess?).  The Fire TV Stick is so easy to set up, the remote is simple, and the on-screen menu is easy to navigate.  It has worked flawlessly and the content loads so much faster than my old Blu-ray player.  This is a great option to stream content inexpensively, without needing a gaming system or any other more expensive device.", "verified": true, "helpfulness": "0/0", "author": "Jean"}, {"rating": 3.0, "review": "Some days it works fine, some days I have to remove the hdmi extender to make it work and then other days I have to put it back to make it work.", "verified": true, "helpfulness": "0/0", "author": "Dale Patrick"}, {"rating": 1.0, "review": "very upset, i purchased this because i travel work work, it doesnt work in hotels, would have been nice if this was pointed out before ordering !!!!!", "verified": true, "helpfulness": "1/1", "author": "T Dowie"}]