[{"rating": 5.0, "review": "The wife and I finally cut the chord from cable/satellite, and are happy we did.  After buying the Amazon Fire TV for the downstairs TV and being very pleased with it, I bought the Amazon Fire TV Stick for my man-cave TV.  It allows me to watch the shows I wan't to watch with HULU, Netflix, and Amazon Prime.  I may have to wait longer to catch up on the shows, but its worth it not having to be a slave to cable providers.  The Amazon Fire TV Stick was stupid simple to set up, and very easy to use.  The device comes pre-loaded with most apps you'll use, and it is easy to download and install others.  It is also a gaming system, although I haven't used this feature.  I look forward to buying the gaming controller so I can try out the games.  I also like that the remote is Bluetooth so you don't have to point the remote at the USB Stick; a great feature for lazy bums like me who can't be bothered with lifting my arms off the couch.  The Stick doesn't have the voice search feature like the Amazon Fire TV box, but that's okay...I don't use it that much anyway.  It also comes with an extension dongle in case the USB port on the TV is too tight to fit the Stick like on my TV.  I am very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "FilbertBobstop"}, {"rating": 5.0, "review": "Fantastic little device. It's very fast and responsive, unlike a lot of internet TV devices I've tried. The remote is really functional; the Fire TV Stick is easy to control.", "verified": true, "helpfulness": "0/0", "author": "C. Bisanar \"VidRoth\""}, {"rating": 2.0, "review": "As far as getting things like Netflix and Pandora, it works great.  However, it has messed up all of the other channels on my TV.  I can only get one and that is the last channel I was watching before I installed the Fire Stick.  I have tried everything I and my son can think of and I only can receive one channel.  I am still looking for a solution to this problem.  If anyone can think of a way to receive my other cable channels, please let me know.", "verified": true, "helpfulness": "0/1", "author": "Shirley Jensen"}, {"rating": 5.0, "review": "Easy to set up and easy to use.  I like that I can unplug it and use on another TV.  Would definitely buy again!", "verified": true, "helpfulness": "0/0", "author": "Paula S. St Julien \"pstjulien\""}, {"rating": 5.0, "review": "So easy to install. The instruction video was great, a no brainer, what could be better. I will be buying more for the rest of my house!", "verified": true, "helpfulness": "0/0", "author": "Barbara Saulters"}, {"rating": 3.0, "review": "The device lost the internet connection. The rest of the features works good", "verified": true, "helpfulness": "0/1", "author": "Melany Ramirez A"}, {"rating": 5.0, "review": "I love the Fire TV Stick.  I was'nt able to get Amazon Prime on my Smart TV.  And, now I can as well as other APPS.  The streaming is great never stops playing.  But you know the really best thing I like about it?  When I put it on pause...after a few minutes it begins streaming the most amazing photography of mountains, beautiful wildflower meadows, etc.  It's just beautiful on a 46 inch flat screen.  Sometimes it takes me bit to get back to the show I was watching.  Just love it!", "verified": true, "helpfulness": "0/0", "author": "Littlebits \"happygolucky\""}, {"rating": 5.0, "review": "Works great with SlingTV!  We also love the Amazon Prime Videos!  Goodbye Cable!", "verified": true, "helpfulness": "0/0", "author": "K. O'Brien"}, {"rating": 5.0, "review": "love my fire stick! since I cut my cable cord I have not thought twice about cable since getting the fire stick. Thank You Amazon!", "verified": true, "helpfulness": "0/0", "author": "Sang H. Lee"}, {"rating": 5.0, "review": "Awesome product, works as it should.  Easy to connect to TV and is a great price!", "verified": true, "helpfulness": "0/0", "author": "carol l schmal"}]