[{"rating": 4.0, "review": "It was easy to install and works like a charm!", "verified": true, "helpfulness": "0/0", "author": "Heather Molandes"}, {"rating": 3.0, "review": "Needs iOS AirPlay support", "verified": true, "helpfulness": "0/1", "author": "David Fehr"}, {"rating": 5.0, "review": "I was a little skeptical at first, but it really works great.  I was geared up to buy a smart tv, but now I don't have to. This firestick turned my tv into a smart tv, and it's easy to use.", "verified": true, "helpfulness": "0/0", "author": "Keesha Cooper"}, {"rating": 5.0, "review": "Great device, excellent service.", "verified": true, "helpfulness": "0/0", "author": "Suffolk"}, {"rating": 4.0, "review": "I have both Chrome Cast and Fire TV stick.  I like both but the remote on Fire TV stick definitely makes it the main entertainment device", "verified": true, "helpfulness": "0/0", "author": "Shake and BAKE!"}, {"rating": 2.0, "review": "I own and love a FireTV box for my home. I purchased the FireStick for my TV at work so I could stream MLB games while working. Great idea turned into a bad idea by a bad device released to the public too soon. I wanted to like it, I wanted to use it, but it is far too frustrating. Do not waste your money on this until they figure out a way to let it stream continuously. It is constantly freezing and buffering to the point it is worthless. It is always telling me I do not have the bandwidth to stream HD. You don't know me but trust me I do have the bandwidth (Small office staff, few wifi devices running, fiber optic cable internet, etc.). A coworker has the Roku stick for his TV and streams MLB games just fine with no issues with the wifi conection. Looks like I'll be getting a Roku.", "verified": true, "helpfulness": "0/1", "author": "D. J. Leonard"}, {"rating": 5.0, "review": "I absolutely love the Fire TV Stick.  After getting and using my first one, I went back and ordered two more for the other TV's in my house.", "verified": true, "helpfulness": "0/0", "author": "Jerry W. Grayson"}, {"rating": 4.0, "review": "Like the flexibility of loading apps", "verified": true, "helpfulness": "0/0", "author": "Maya T. Cox"}, {"rating": 5.0, "review": "For the price, this is really the way to go these days if you want to access smart TV options and still have more available to you than Google's device.", "verified": true, "helpfulness": "0/0", "author": "Travis Nave"}, {"rating": 4.0, "review": "Kind of hard to navigate at first but it works great. Haven't had a problem with it until my dog at the remote.", "verified": true, "helpfulness": "0/0", "author": "Deborah Kowalski"}]