[{"rating": 4.0, "review": "It did not have last season of sons of anarchy", "verified": true, "helpfulness": "0/0", "author": "Rick Osban"}, {"rating": 5.0, "review": "Exactly as advertised.  Immediately bought two more for my daughters.", "verified": true, "helpfulness": "0/0", "author": "Lew Gach"}, {"rating": 4.0, "review": "Extremely easy to set up and use, especially with Amazon Prime.  I tried watching other shows that were listed with the device, but my Internet speed wasn't sufficient to stream them.", "verified": true, "helpfulness": "0/0", "author": "Rob and Sue"}, {"rating": 5.0, "review": "Greatest thing ever", "verified": true, "helpfulness": "0/0", "author": "Rex Hawkins"}, {"rating": 2.0, "review": "After connecting my Fire Stick to my AVR on my down stairs TV it worked for about two hours before cutting out,unable to download any movies on any channel, Amazon prime, Net Flix etc.Screen just said down loading and unable to connect to internet. I moved the Fire Stick upstairs closer to the router and it seems to be working ok for now. The frustrating thing is my Apple TV and a Samsung dvd player that are plugged in down stairs,work fine for all movies and music. I know I hooked the Fire Stick up right because it did work the first day before crapping out.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "The user interface is clean, smooth and responsive. Adequate app selection with room to grow.  Overall, a solid product of which I'm excited to see its future.", "verified": true, "helpfulness": "0/0", "author": "Terry S."}, {"rating": 5.0, "review": "Absolutely love the Amazon fire tv stick.  It was everything I was expecting and more!  Would definitely recommend to friends!", "verified": true, "helpfulness": "0/0", "author": "Leslie S Galloway"}, {"rating": 5.0, "review": "Love love love it", "verified": true, "helpfulness": "0/0", "author": "Katrina Sparta"}, {"rating": 5.0, "review": "all good", "verified": true, "helpfulness": "0/0", "author": "Gerald"}, {"rating": 5.0, "review": "Very enjoyable but haven't figured out how to get Hula Programs which I am subscribed to", "verified": true, "helpfulness": "0/0", "author": "Marianne"}]