[{"rating": 2.0, "review": "I thought I would see more films available that were free to Prime Members.  Maybe I'm doing something wrong but most films I search for don't seem to be able to be watched at the current time.  I only have the option of putting them on a watch list.  Seeing current films was the prime purpose of getting the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Bette Renaud"}, {"rating": 5.0, "review": "Love this thing", "verified": true, "helpfulness": "0/0", "author": "Jansen henley"}, {"rating": 5.0, "review": "We replaced our WII with the Fire Stick and we're very happy!  The WII remote was very awkward. Fire Stick is smooth and we love that it includes Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Olive"}, {"rating": 5.0, "review": "I got this on Prime Day for $25. For watching Amazon videos it works fine. I also am using Plex to stream video from my PC. That seems to work. Great value at $25 and would be at normal price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I put one in each bedroom on the second floor. They work flawless. Amazon builds an amazing product.", "verified": true, "helpfulness": "0/0", "author": "Frank Schindler"}, {"rating": 5.0, "review": "Works Great!", "verified": true, "helpfulness": "0/0", "author": "Alaina Burroughs"}, {"rating": 5.0, "review": "cool little product... specially for the price !!", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Nice...  Works great.", "verified": true, "helpfulness": "0/0", "author": "Javier Ramirez"}, {"rating": 5.0, "review": "nice works perfect took 5 min to hook up", "verified": true, "helpfulness": "0/0", "author": "gary koch"}, {"rating": 2.0, "review": "I purchased this for youtube access on mt tv. It skips and starts constantly... and when it gets hot it stops working and completely freezes. On the plus side it seems to stream amazon prime with very little skipping and Netflix does just slightly worse than streaming prime. If you want smooth uninterupted viewing, you will not be content with this purchase.", "verified": true, "helpfulness": "0/0", "author": "siva aiken"}]