[{"rating": 4.0, "review": "Bought this during the promotion for Prime members for less than $20 just to try it out. I have a Chromecast already, but it's in the box and being unused because I was ultimately disappointed that the Chromecast could not function by itself - it's basically just a \"mirror\". The Amazon Fire TV Stick is different - and it comes with a dedicated remote controller too, which is one of the reasons why I decided to try it out. That said, there's no turning back - the Fire TV Stick is (almost) exactly what I've been looking for in a set-top box. The interface is nice to look at and easy to use, the remote controller is also easy to use (and Bluetooth - meaning you don't have to point it anywhere specific), and it had the apps/channels I was looking for specifically (RedBullTV, Spotify Connect, Plex). The only gripe is that I don't like how it requires a USB cable to power it (not shown in most of the product photos, although the Chromecast was exactly the same way).After one day with the Fire TV Stick I ended up... disconnecting it from my HDTV - because I went ahead and purchased the Fire TV for the voice search, the added performance, and the built-in ethernet (the Fire TV Stick is WiFi only). however - the Fire TV Stick did not go back into its box (like the Chromecast), but it went into my travel backpack so that when I'm out of town I can just plug in the Fire TV Stick into the hotel TV and I'm good to go.I'm giving the Fire TV Stick 4 stars total because I've tried Chromecast, I've tried Roku, I've tried Apple TV, and I even built my own HTPC, and all of those are now pointless because the Fire TV Stick does what I wanted all those other machines to do in one small and very capable package. The only gripe (the power cable requirement) to me is enough to subtract one star from the overall score.", "verified": true, "helpfulness": "0/0", "author": "James R."}, {"rating": 3.0, "review": "Here are the two issues I observed with the FireTV Stick.1) After firmware/software upgrade, device would no longer connect to my 2.4GHz SSID.  FireTV displayed authentication error, and access point showed similar error in log.  Contacted customer support and we were unable to resolve, so they sent out a replacement device.  Replacement device exhibited the exact same issue once it upgraded to current version.  Performed a quick Google search and found an option for my wireless AP to increase the WPA handshake timeout.  Set this variable to 500ms and device now connects successfully.2) Device would not see my 5GHz SSID.  Found that I needed to manually set 5GHz to a lower channel (was using DFS) and now SSID is visible and connects properly.I must say that the customer service and support representatives were very helpful and made every effort to assist with issues, so 5 stars for them.  It seems new firmware version may have introduced some unexpected issues that effected my home wireless network.", "verified": true, "helpfulness": "1/2", "author": "S Korell"}, {"rating": 1.0, "review": "No stars. What a frustrating experience. Only connects every 20th try, never remembers the password, will quit in the middle of streaming and refuse to connect. Signal strength always ranked very good. I thought Roku was bad, but this thing is just unusable. You know that thing where you just get so fed up you want to smash it but instead just keep trying, over and over. And how do you get support?  I keep reading \"it's so easy to set up\". In our house, AppleTV always works, Roku sometimes works, and the Stick is just a piece of crap. Awful.", "verified": true, "helpfulness": "3/3", "author": "Jean Curry"}, {"rating": 3.0, "review": "It does what it is supposed to do, but navigating the menus with just the remote that comes with it is a chore. It is also hard to figure out what stuff you get for free by having prime and what stuff you have to pay for (just by looking at the menus). It is cool to pair it with my kid's kindle tablet though, makes it an easy way to just move what we are watching up to the bigger screen.", "verified": true, "helpfulness": "0/0", "author": "Shane Yancey"}, {"rating": 4.0, "review": "I finally was able to get this to work after getting a replacement which didn't work. It turned out this unit has I be plugged directly into the HDMI port. Once that was done it worked well. I would have given it five stars if I didn't have go through tech support and a nonfunctional replacement.", "verified": true, "helpfulness": "0/0", "author": "Edward B. Stevenson \"Monsignor\""}, {"rating": 3.0, "review": "Came preloaded and streams hd flawlessly. Plex and some other streaming apps cost money to download. Android app only has remote, while amazon fire tablet and phone support screen mirror and additional features. Left me wanting more.", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 4.0, "review": "I use this a lot. It's great and so much easier than the PS3 I used for streaming content before. My only reason for not giving it a 5 star is that it seems to have some issues where it freezes and skips from time to time. Not a huge deal but something I never noticed with the PS3. It is faster on start up and overall it was a good buy for the money when paired with Prime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I was very happy to recieve my Fire TV stick before Christmas. However, that faded after I hooked it up to my TV and it did not work. I plugged it into my TV the using the AC plug that they do not show in the image they advertise... I wish they had of, I still would have purchased it, but getting the unit and discovering there was a wire that needed to run from the unit to a plug was disappointing.  It is not shown in that way on either the Amazon Product page you are looking at... or the box the product came in.  I probably would have lived with that, but the darn thing just didn't work! I see a very brief scrambled tv image ... then it loses signal. Tried repeatedly on 3 different TVs, but it just doesn't work.  I was stoked to see a cheap alternative to my AppleTV, but I'm worried in this case you get what you pay for..**UPDATE - Dec 26th, 2014**  Stick working, remote not.Amazon sent me a replacement stick (only the stick), which came in 2 days. That was great. The replacement FireTV works as opposed to original which was DOA, it boots up and goes to the start screen that says: \"FireTVstick  Press >|| to start\". Pressing that button on the remote does not do anything.  Pressing any button on the remote doesn't do anything. I've tried new batteries in the remote.  I've tried unplugging and replugging in the Stick from the TV.  I'm using the AC adapter.  I'm hoping they will send me out a new remote and that might fix this issue.", "verified": true, "helpfulness": "2/4", "author": "Rob Foote"}, {"rating": 1.0, "review": "Most channels that are attractive to kids on Netflix would be charged here... I mean... I am already a prime member...and also I pay for Netflix... why do I have to keep both? I returned this after I figured out the peppa pig and the pingu were not free to prime.", "verified": true, "helpfulness": "0/2", "author": "Ringr"}, {"rating": 2.0, "review": "I bought this and was quite excited about using it. Unfortunately I kept getting an error message telling me that it couldn't connect with the Amazon servers. Back it went!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]