[{"rating": 3.0, "review": "This is very good product but I use it mainly for viewing baseball on MLB. The issue is the MLB app buffers every 10 seconds or so making the games impossible to watch. I don't have those issues with viewing MLB on my iPad, the laptop or PC. If this issue were ever to be dealt with and resolved the Fire Stick would be 5-star for me. Everything else works fine.", "verified": true, "helpfulness": "0/0", "author": "James B. Cowan"}, {"rating": 3.0, "review": "good device.  Not happy with the price for current TV episodes though, and some tv episodes advertised as free do not work at all, they play the opening credits, then stop and prompt you to pay for something else.", "verified": true, "helpfulness": "0/0", "author": "Kevin G Holt"}, {"rating": 5.0, "review": "I LOVE this! It is easy to use. The menu is very user friendly and uncomplicated. The apps that are available on the fire TV stick are really all you would need.", "verified": true, "helpfulness": "0/0", "author": "SweetLena"}, {"rating": 2.0, "review": "I'm really sad that I am not pleased with this. Truth is, it just doesn't work very well. I'm sure if I had the best wifi coverage, it would be faster. As is, I have yet to be able to watch anything. It keeps connecting and disconnecting from the wifi and any time click on Netflix it just goes around and around and never loads, and eventually just completely goes back to the home screen. I checked the wifi strength, and it says that it is \"good\" or \"very good\" and yet, nothing. I use my kindle on my wifi and it is perfect. My laptop also picks up coverage perfectly on the same network. This stick is advertized as picking up wifi better than other devices. It simply isn't working for me.I'm sad.", "verified": true, "helpfulness": "0/0", "author": "Amelia Hollingsworth"}, {"rating": 4.0, "review": "Nice little remote, stick works flawlessly.  Using it for Prime, Netflix, and SlingTV.  Only drawback is not having the voice search, but if you get the app for you phone, you can use voice search that way, plus use your phone as another remote.  Wish you could sync it with more than one Prime account, but maybe that'll come later.  Pretty happy with our sticks - we have two.", "verified": true, "helpfulness": "0/0", "author": "Mopo"}, {"rating": 5.0, "review": "its fun.", "verified": true, "helpfulness": "0/0", "author": "Robert Christes"}, {"rating": 5.0, "review": "Love it! just what I was looking for.", "verified": true, "helpfulness": "0/0", "author": "Maria \"Maria Lopez\""}, {"rating": 5.0, "review": "wonderful! exceeded my expectations! like it better than my apple tv", "verified": true, "helpfulness": "0/0", "author": "Phyllis A. Petty"}, {"rating": 5.0, "review": "Awesome product, I love it!", "verified": true, "helpfulness": "0/0", "author": "josh"}, {"rating": 1.0, "review": "Constantly loses connection and has to rebuffer. I am ordering a chromecast to replace it.", "verified": true, "helpfulness": "0/0", "author": "Andrew Heim"}]