[{"rating": 4.0, "review": "Even a dinosaur fumbling my way through the 21st Century can make it work.", "verified": true, "helpfulness": "0/0", "author": "Randy Cyrus"}, {"rating": 1.0, "review": "Bought this and it only worked a couple of times. Then took it out and try to get it to work again and it failed. Doesn't seem very reliable. I am returning mine.", "verified": true, "helpfulness": "0/0", "author": "Christopher Wasden"}, {"rating": 5.0, "review": "Love this !!!", "verified": true, "helpfulness": "0/0", "author": "Kelly Pearn"}, {"rating": 4.0, "review": "It does freeze up from time to time. There are  not as many  apps as on roku. The interface could be improved.Having said all this, it does work quite well. I am looking to get rid of my satellite, but i can't get local channels in my area. The integration with prime is very nice.", "verified": true, "helpfulness": "0/0", "author": "David Shupe"}, {"rating": 4.0, "review": "I am not that tech savvy, but know enough to be dangerous to myself.  I was very impressed with the Fire Stick and let me say, very little impresses me.  I received it in the mail within the time frame Amazon stated.  I opened it up and read the directions---very little to do, that's good because if I have to spend to much time figuring it out, it is a bye-bye item,  installed it as directed, found my router, typed in password, and there ya go!!  I browsed all the choices Amazon provided and was not disappointed.  I believe this is a great alternative to those who don't have the money for the bells and whistles, don't want the bells and whistles, your area doesn't have cable, or you want to minimize your monthly bills. Parents can put parental locks on to keep the kids safe but still be able to play games and watch their movies.  Of course, you need a higher speed internet.  Become a prime member and it is a \"cheap date\".  Games, music, TV, movies, and rental movies, it's all there to try on your prime membership.  It's a good way to maximize your prime membership, too. The \"Stick\" was 39.00 plus tax and the prime for a year, $99.00.The brag was you can take your \"Stick\" on a trip, to another location, and still use it.  So I decided to try that.  Sure enough, I hooked up with the wireless at another location and guess what, it knew me.  It works the way they said.  Good brag!!!  Think vacation or business trips, primes!! I will be selling the pros of this \"cheap date\" again this weekend.  The only con is I am a movie nut.  The movies that they have in prime need to have a little bit more of an upgrade to newer movies for prime members thus the 4 stars instead of 5.  Hey, you have room for improvement!!  The selection is good, but just a thought!!This little darling was a pleasant surprise to me.  For $39.00 + you got your own little honey.", "verified": true, "helpfulness": "0/0", "author": "CC"}, {"rating": 5.0, "review": "What a fantastic device, I can watch Netflix, Hulu Plus, and Amazon Prime Videos, without a hassle, lag or pixelation. I just wish they added Crunchyroll, but other than that what a amazing device.and thanks to the Fire TV I finally decided to cut the cord, now i am saving more than 100 dollars a month.", "verified": true, "helpfulness": "0/0", "author": "Mig R"}, {"rating": 3.0, "review": "It works pretty well for Amazon Instant Video (which locks up periodically on my 2014 Samsung smart TV and PS3, amongst other issues), but Netflix playback is jittery/jerky, and when I tried HBO Go last night the audio did not sync up with the video.  It's possible these are app issues that aren't the fault of the device but instead the fault of the app, but that still limits the utility of this device.By jittery/jerky for Netflix, I refer to a phenomenon similar to what 120Hz+ TV's do by default where they try and do some type of motion correction that is noticeable and disconcerting to some people.  (Like me!).  This is in contrast to the Netflix app on PS3 which was passed via the same HDMI path (through the receiver) to the TV on the same input and with the same video settings.For HBO Go, this was during the big game of thrones season 5 premiere night (albeit much later at night), and the PS4 app experienced no such problems with audio/video or the weird menu jerkiness I experienced with the Fire Stick.I do intend to keep using the device as a dedicated Amazon Instant Video device and will try the things that it's having trouble with in the future.  Hopefully the issues are addressed by whoever the responsible parties are and I can increase the number of stars.", "verified": true, "helpfulness": "0/0", "author": "Andrew Sutherland"}, {"rating": 5.0, "review": "Fresh quick easy to use don't know what took me so long to get it.", "verified": true, "helpfulness": "0/0", "author": "PATRICIA HARRIELL"}, {"rating": 5.0, "review": "BEWARE!!!!!!!No seriously.....beware if you have Charter or Comcast and getting this for the HBO Go app. It will NOT work. I ended up having to return it, but it wasnt because of any issue with the stick or amazon.The stick itself was awesome and very easy to set up and use.Charter just sucks.", "verified": true, "helpfulness": "0/0", "author": "Derek A Wagner"}, {"rating": 5.0, "review": "One of the best purchases we've made, and they keep adding apps.", "verified": true, "helpfulness": "0/0", "author": "thezaphoid \"thezaphoid\""}]