[{"rating": 2.0, "review": "If it wasn't only $20, the fire tv stick would be on the way back to amazon; I hope they release an update soon that would fix the mirroring issues it's the reason why I bought it. In the meantime I'll let my son enjoy watching his Shawn the sheep on it (stunning video quality) until I get a chromecast on black Friday!", "verified": true, "helpfulness": "0/7", "author": "amin gotti"}, {"rating": 4.0, "review": "Hello all, I will continue to update this review as time goes by but I have played with this for several hours now and can give some decent impressions for those that are interested.I purchased two of these to replace two older Roku HD devices in my bedrooms, I still have a Roku 2 XS in my living room.  I am a total cord cutter and we watch all television streaming on three televisions.  No antenna as there are no stations to pick up, 10k to get cable ran to the house, and satellite does now work either, so since moving here a few years back I've been a cord cutter by necessity. That said, I'm glad and now we cannot imagine going back so I guess it was good.Installation of the devices could not be any simpler really, I decided to use the supplied power adapter and not power via the TV as we will use these every single time we turn on the TV so why wait for start up?  You can power via a USB port on the TV if needed but then the power on takes about 45 seconds or so.  Not horrible, but seeing as I can bypass that why not do so?  Once connected they had to update after connecting to my WiFi in the house.  I chose my 5ghz network over the 2.4 for speed and they both are working great with amazing signal strength. (5ghz is faster than 2.4 but shorter range. If you can try to use 5ghz if your router has it; if not normal 2.4ghz will be fine) One updated fine and had no issues, the second one gave an error and needed to be power cycled.  I did so by removing the power cord and after coming back up it updated and worked fine.  Servers could be overloaded with lots of devices updating right now is my guess.The update took about 10 minutes, then it plays an intro video going over the basics. Little long, but informative enough to not be annoying.  After that you are ready to go, and you are already logged into Amazon right off the bat if you purchased this from Amazon.  The speed of searching through content and general menus blows away my Rokus, literally no contest.  I then set about installing my other needed apps, Netflix, Hulu Plus, Plex, Crackle, YouTube, Pandora, VEVO and a few games.  After getting sucessfully logged into all my services I started playing around with them all.Streaming from all my apps is absolutely faster than any of my Roku devices, and many of my apps look totally different.  Netflix and Hulu are my most used apps and they are much improved versions from what I'm coming from on my Rokus though I have seen the interface on other devices like my old PlayStation 3.  It was still neat to see the improvements.  Plex looks better too, and my newfound speed is still my favorite thing about these.  Streaming is so fast to start, and they start at a higher quality than I'm used to, I'm used to the first minute or more being lower definition but these start off much better. Overall every single app I tried worked better than on my Rokus form a speed, usability, and picture quality standpoint. Maybe newer Rokus would fare better but in my testing it really was night and day better.I also tried a few games, like Ski Safari and they worked very well, I will not use this feature much but it did work fine and I set quite the high score in Ski Safari for my daughter to try and beat on her TV.Negatives?  Well, it really does push Prime first and foremost in searching but I can understand why.  Still, no search results form Netflix seems like a glaring miss, and that needs to be added ASAP.  Some apps people want are not available, but in my case none are missing so that does not apply to me.  Overall app selection needs to improve as I'm sure it will given time, Roku as a big lead here.  Then again, it has every app I personally use so this will vary by user.Overall, I really like this and it smokes my old Rokus so I did very well getting these.  I might get one more for the living room now and totally switch over.  This was a great purchase for me anyway, and I'm glad I got them.UPDATE 11/23/14 - Okay, I have used this for a few more days now and I like it so well I just ordered a third one for my living room TV.  Again, as I get TV no other way I have used these extensively and really like how big an improvement this is over my existing devices.  We have also done more gaming than expected, Ski Safari and Badland run great and are easy to play with the included remote. I am now in the top 3% of scores in Ski Safari, I don't know weather to be proud or ashamed, but still it is fun!  :)  So far we have not had a single issue trying to play anything video wise either, no glitches or troubles of any kind after that first update issue on the one I mentioned above.  I was going to wait for a 4k streaming device for the living room as I plan to eventually (at least in my dreams) upgrade to 4k there, but the deal is too good to pass up and the improvements too nice so I'll get another one now.  My internet speed will not support 4k anyway. I'll update more in the future as needed.UPDATE 1/12/15 - Devices are still working very well, I have had no issues yet.  My devices have updated to new software/firmware a couple of times now and there have been no ill effects from doing so, nor do I personally see any improvements. The biggest thing to report is that there is finally an iPad/iPhone app to control the Fire TV Stick and I have been using that app and the Android app a lot and really like it.  The app is responsive and works very well in testing.  It is a native app for tablets (Roku is not, uses the x2 screen doubling on the iPad) and looks good.  Currently the Android app seems nicer, but it is in very minor animation type areas, like when accessing voice control, that you can really se any difference. Works well, the app is now on two iPhones, two android tablets, and one iPad and works great on them all!", "verified": true, "helpfulness": "90/107", "author": "Razer"}, {"rating": 3.0, "review": "Send it to me already!!! I want and I want to test!!!", "verified": true, "helpfulness": "0/22", "author": "Ben Wolff"}, {"rating": 2.0, "review": "Getting stuttering using Hulu, sound isn't effected but image keeps freezing for a moment, also see pauses going through the normal menus, back to using my Chromecast.", "verified": true, "helpfulness": "2/5", "author": "Gregory Jackson"}, {"rating": 4.0, "review": "My HTC One M7 and Windows Laptop with Miracast capability could not connect Fire TV stick. I also found Paul Thurrott from SuperSite for Windows has reported similar issue with his Surface Pro 3. At this early stage I am not sure how many of customers have tried mirroring function but if you have a Windows device that is capable, please try and comment below", "verified": true, "helpfulness": "2/3", "author": "Jingmin's pen name"}, {"rating": 2.0, "review": "Disappointed in how the parental control feature is implemented. With parental control turned on, have to enter the pin to watch each episode. Should have the option to only block purchases.", "verified": true, "helpfulness": "5/11", "author": "Justin Harris"}, {"rating": 4.0, "review": "Amazon got it perfect with the Fire TV Stick except for a few minor glitchesThe product was beautifully packaged and connecting it to the TV was done in a breeze. However installing batteries in the remote was the most difficult part. The  cover for the battery compartment was very tight and there is no indication on the remote itself to indicate the direction that it needs to slide. This made me nervous about breaking it by applying too much pressure . Finally after a long time the batteries were installed and I was able to start the Fire TV stick.Once started, it prompted me to connect to the wireless network and immediately after connecting, it started to search for updates and started downloading the update without giving me any other option. I have a high speed internet connection but the download of the update was quite slow.  After the update was downloaded, it restarted multiple times to install the update and once everything was done, its prompting me to enter the password for the wireless network again. This can be time consuming if you have a long and complex password. I dont think its very difficult to store wireless password on the device in between updates.After the initial setup is done the device boots and Amazon has already configured it for your account which is good. Then starts the help video that I cannot quit and forced to watch. After watching the long intro video we can actually get to use the device the way it was meant to.Pros:* Absolutely no buffering: I tried youtube and netflix and the videos play almost instantly. Amazon nailed this as it can be quite frustrating to watch youtube videos on Android devices.* The general layout of the content looks good and it can be easily navigated using the remote.Cons:* The biggest problem I had was using the Fire TV remote app. I have an Nexus 5 Android phone and the App just did not detect the Fire TV stick on the network. This meant that I had to very tediously login to all the other accounts such as Netflix, Hulu, etc. I use the same phone on the same network to control my chromecast without any problems.* i tried it on my friends wireless  router and this time my phone was able to detect the device. I tried the voice search and was really disappointed with it. Its just too slow and cannot recognize the words spoken. Although I am not a native english speaker, google's voice recognition is able to recognize what I say perfectly. So a big thumbs down for this.* Installed Tunein to listen to the radio. It does not play all the stations. So I tried iHeart radio app and even this could not play the stations I wanted to listen while the Tunein app installed on my phone was able to play those stations.* Finally after installing the apps, the whole system became a bit slow and laggy. It does not respond immediately when the remote is pressed and takes some time to go back or to the home screen.Since most of these are a software problem, Hoping that there's a new update soon that fixes these minor problems.Overall: Great device with minor problems that can be fixed", "verified": true, "helpfulness": "2/4", "author": "anand"}, {"rating": 4.0, "review": "I currently own 3 Chromecast devices which I use for Netflix, Pandora and Plex.When the Fire TV Stick came out with support for Amazon Instant Video and Spotify, along with with Netfix, Pandora and Plex, at an initial cost of $20 I thought lets give this a shot!When my Fire TV Stick showed up today, I got it unboxed to find the Stick, Remote, Charger, USB cable, HDMI extension and 2 AAA batteries.I took it right over to my TV to plug in where the Chromecast is and the first thing I noticed was the USB charging location is on the side vs the back like the Chromecast. This causes conflict with other HDMI cables on the back of my TV. CONMoving on, I get the device booted and it was waiting for my input. Using the remote, I connected to the WIFI and it started to update which took about 15 minutes.As soon as it finished installing the updates, I was greeted with an on screen video tutorial of how to operate the device. During the updating, I went and downloaded the Android Fire TV controller app.The on screen menu is fairly easy to navigate, very Amazon Fire like.The app is, different. I really haven't figured out how to properly control some things yet but we'll get there.The first thing I noticed was that I had to \"download\" the Netflix application onto the Fire TV Stick. Uh, ok? I went and opened Netflix on my phone and it instantly located the device, just like the Chromecast. I selected the device and selected a show to watch. I sent it to start playing, Fire TV launched the Netflix app but that's where it stopped. At this point, it wanted me to log in to Netflix. This certainly is different than the Chromecast. There I just send my content and it must just pass my credentials some how to just start playing. Once I got logged in, I could send content from Netflix on my phone just like the Chromecast.After launching Spotify on my phone, I had the option to send my music to the Fire TV. Once I got some tunes playing, I noticed I had zero audio control over the content via my phone. I went back to Netflix and noticed the same thing. Well that sucks, major CON right there.When I went to plug in my second device, I learned that my TV will not power the Fire TV stick as it does my Chromecast. This may be due to the fact that this device is more powerful thus requires more power.At this time, I'm still testing but at this point, I'd stick with the Chromecast, I just really wish Spotify and Amazon Instant Video were supported there.", "verified": true, "helpfulness": "11/16", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little device is really great! I currently own an Apple TV, so I will compare a little to that. So, why did I buy this if I already had an Apple TV? Well, as a Prime member, I couldn't pass up the deal the day it was announced. But, the primary reason I purchased it was because of portability. I like having the option of having it in the guest room at home, or bringing it with me on a trip. Anyways, on to my initial observations:Pros:-Size: This is the main reason why I purchased this product. Don't get me wrong, I like my Apple TV, but it won't ever leave the place it is. The Fire TV Stick on the other hand, I plan on taking it with me on trips.-Performance: This thing is really fast! Response is fantastic.-Apps: I am stoked to have the ability to downloads apps.-Included HDMI extender is handy.-It came registered to my Prime account, which was great. All my Prime music playlists were all there.-8GB of storage-Size of the remote. I actually like the size of the Fire TV Stick remote more than the Apple TV remote. The layout of the buttons is also an improvement of the Apple TV remote. It seems that Amazon targeted utility over design on the remote which is very much okay with me.Cons:-Not a huge deal, but the remote feels a little on the cheap \"plasticy\" side, but for $20 I won't complain. Even at full price, I wouldn't complain too much but I thought I should mention in.-I wish the USB cable was a little longer. Since I plan to use it for travel mostly, a longer USB cable would be useful. EDIT: a user commented on a being able to purchase a longer cable, which is a very good point and I actually already had one. The con about the length of the USB cable is strictly just what came in the box.Overall I am very pleased with the Fire TV Stick and even at $40, you should not hesitate to purchase one especially if you are an Amazon Prime member.", "verified": true, "helpfulness": "2/4", "author": "tfedward"}, {"rating": 5.0, "review": "Just got my Fire TV and its an amazing little device. A few years ago I became aware of android mini pc's from China and loved the capability and power those little devices bought to the table. There are two drawbacks to those devices. 1)If it wasn't for the developer community those things would be just about unusable. 2) Some apps simply will not work.  Fire TV simply works. Easy to use and quick interface. All the apps work great. I ordered two when they first came out and if Amazon would have not set a limit on the purchase quantity i would have ordered a lot more.", "verified": true, "helpfulness": "0/1", "author": "Benjamin Lilly"}]