[{"rating": 5.0, "review": "easy set up. works well", "verified": true, "helpfulness": "1/1", "author": "Maureen D.  Hunter"}, {"rating": 5.0, "review": "Love using the Amazon Fire TV Stick! It's easy to navigate and has great Prime selections and apps.", "verified": true, "helpfulness": "1/1", "author": "M. Aleccia"}, {"rating": 2.0, "review": "I bought the Fire TV Stick because I own Fire TV...and I am quite satisfied with it. Actually, so much so, I purchased the Fire TV Stick for my bedroom. After about a month it stopped working...after visiting forum after forum and trying all kinds of so called fixes...I decided to return it. Amazon doesn't make this an easy endeavor. So, out of frustration, I purchased another Fire TV...and so far, so good.Actually, my original Fire TV is close or more than a year old...I'm totally satisfied with the quality of it...the Stick, however...can't say that I'm a fan.", "verified": true, "helpfulness": "1/1", "author": "Edward L. Brown \"mr movie\""}, {"rating": 4.0, "review": "I bought this device for the purpose of using when I travel.  As far as content, I am primarily using Amazon Prime Video as well as Netflix and both are easy to use on this device.  The device comes with everything you would need in terms of extension cable for HDMI, remote, and USB power source to get up and running on an open network.As I indicated I purchased this device for use when travelling.  My first stop was at a hotel property that had an open wi-fi network, I connected the stick to the TV and was enjoying content of my choosing immediately.  On day 2 of my trip I changed to a different hotel property that had the type of wi-fi that required you to enter information on an internal web page (name and room number).  This presented a problem for the out of box Fire Stick.To their credit, Amazon has packaged this device to be user enhanced with the necessary tools to work around the hotel property web page access check point.  There are various Youtube instruction on how to execute this task.  Which, by the way is easier to do at home, than to do while travelling.  You will need computer access and some comfort level downloading programs and changing settings on the Fire Stick to allow the changes.  In the end, I added a Firefox web browser to my Fire Stick which allows me to access the Hotel web page to enter the required information.  I successfuly albeit with brute force used my Fire Stick Remote and a Fire TV remote App from another device to enter this information.I have since purchased a very compact Bluetooth Keyboard and added Bluetooth capability to my Fire Stick and I can now use this keyboard on the Firefox browser on my Fire Stick.  I personally didn't mind this effort because I now have precisely what I want, a very portable device to use while travelling to watch my preferred content.  I have the means to connect the device to both open and guest restricted Wi-Fi networks.  The effort expended was nothing I was uncomfortable or technically challenged to execute, but that may not be for everyone.  If you're just planning to use this at home, you should have no problems other than deciding what to watch first.", "verified": true, "helpfulness": "1/1", "author": "R. Vitale"}, {"rating": 5.0, "review": "Best thing I think I have ever brought. Works wonderfully and has everything I like on it.", "verified": true, "helpfulness": "1/1", "author": "tiffani"}, {"rating": 3.0, "review": "The Fire Stick serves the basic purpose of media streaming. I have had some issues with picture clarity, but I am not sure if it is the device or my AT&T; U-Verse internet.Many times the fire stick seems like an Amazon marketing tool. I already paid for the stick. I don't want to go home and feel like I'm constantly being marketed to. Every now and then some things should be complimentary or discounted Amazon products for stick users. For example, Redbox often will give people a complimentary movie, which makes me want to actually rent a movie from them. And, AT&T; U-Verse each will have free movie channels during the holiday season.I do not feel I am getting any better movies or TV shows than I do with Netflix using Amazon Prime. Maybe the service can have movies to rent that are more recent and not on Netflix  or in Redbox for a cheaper price. For example, The Hunger Games Mockingjay Part 1 was on Amazon Prime for almost $4.00, but it is $1.20 including tax out of a Redbox.Many TV shows to pay for are new enough and able to rent. That is good, but the price is extensive considering all the media streaming options available today. For example, I like The Originals, which was also almost $4.00 on my stick, but I can buy it for $2.00 on YouTube.The games are great, but I feel like there should be more options for well-known games like Monopoly or Family Feud. It’s also nice that you can buy those. I would buy games that are well-known like that.", "verified": true, "helpfulness": "1/1", "author": "Preferred Customer"}, {"rating": 4.0, "review": "Great product easy to use", "verified": true, "helpfulness": "1/1", "author": "azar"}, {"rating": 5.0, "review": "It does everything as advertised.  I am sold on Amazon's Fire TV Stick.  Unless you REALLY want the larger Fire TV accessory that seemingly does nothing else other than voice recognition, this is all that is necessary.  Buy it and bet you won't be disappointed.", "verified": true, "helpfulness": "1/1", "author": "Dave"}, {"rating": 5.0, "review": "This was the perfect device to allow me to stream movies and TV shows, extremely easy to set up.", "verified": true, "helpfulness": "1/1", "author": "John  C. Cortese"}, {"rating": 5.0, "review": "I bought this for my bedroom TV.  Love that it doesn't take up any space and the speed is just fine with the router in the other room.  I find it has everything I need.  My only complaint is that it only plays prime music that is already in my library.  Since it allows me to explore all prime videos, I'd love it even more if I could have access to all prime music.", "verified": true, "helpfulness": "1/1", "author": "Melissa Koetke"}]