[{"rating": 5.0, "review": "very useful little device", "verified": true, "helpfulness": "0/0", "author": "Yuriy Gordiyenko"}, {"rating": 4.0, "review": "Nice product", "verified": true, "helpfulness": "0/0", "author": "Craig A. Smith \"websmithy\""}, {"rating": 4.0, "review": "Out of the box lacking, however, being able to sideload apps really makes this a great little device. Kodi(xbmc) is worth the price of admission by itself. It runs great. Unfortunately, I couldn't get hbo go running on this device (the play store version runs fine, but with no mouse you can't sign in/control the app). The amazon version doesn't even open (get an error). I still like chromecast for certain things, but like Kodi on the fire stick. Roku 3 still seems to be the fastest of all, though the fire stick is close.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was so easy to set up.  The only problem I had was getting the battery cover off of the remote.  It streams much faster than my blu-ray and it is much easier to navigate with the voice remote.  The price was wonderful.  Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fantastic product!! Easy to use and setup was a breeze. Great job Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Kim Neblett"}, {"rating": 1.0, "review": "Worked well for a few days then it kept saying that the network was connected with problems. Sometimes it works for a few minutes and sometimes it doesn't work at all even though two other devices in the same room work perfectly. Going to return it.", "verified": true, "helpfulness": "0/1", "author": "K. J. Lewis"}, {"rating": 5.0, "review": "Works perfectly. Easy to operate. May go for the Fire tv next time.  I will never run out of movies to watch or music to listen to.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Grandma Barb in MO"}, {"rating": 5.0, "review": "I'm in tv heaven! I'm so glad I purchased.", "verified": true, "helpfulness": "0/0", "author": "Dorian Madrid"}, {"rating": 4.0, "review": "It is an impressive little device, but I was under the impression that the apps available for the kindle were absolve on the fire stick and they are not. Whle they do have many to choose from they don't have my main music app RDIO. I got a prime membership for Christmas. So the stick works well for me. Hoping they get more apps soon though....", "verified": true, "helpfulness": "0/0", "author": "a. strickland"}, {"rating": 1.0, "review": "This sucks! I tried to watch a movie I rented and couldn't. It kept telling me my internet connection was too slow. I had no problems watching the movie on my laptop. But would have rather used the fire device.", "verified": true, "helpfulness": "1/2", "author": "Clayton M."}]