[{"rating": 5.0, "review": "easy to install and works great! and good price too", "verified": true, "helpfulness": "0/0", "author": "MT Madison"}, {"rating": 2.0, "review": "Bought it to replace a sony smart blu ray player that has been giving me streaming problems for a while now. had the fire stick for a few days easy set up from the get go( 2 stars for the easy set up). Sign in to Hulu and streamed fine the first day. The following day it had trouble with video freezing but audio still going. Netflix had no sound and took a while to load. Not what I expected since I had fairly high expectation for it. Maybe I got a bad one but I just returned it and got my money back.", "verified": true, "helpfulness": "0/0", "author": "Israel Carrera"}, {"rating": 5.0, "review": "We absolutely love the Amazon Fire Stick and it is such a great value!!", "verified": false, "helpfulness": "0/0", "author": "Chris Herndon"}, {"rating": 5.0, "review": "If you have Amazon prime this is an absolute must have.", "verified": true, "helpfulness": "0/0", "author": "jimfinn398"}, {"rating": 4.0, "review": "Perfect way to upgrade an older HDTV to a SmartTV!  Love being able to get Amazon Videos now on my older HDTV, along with other options.Now if only \"fling\" from my tablet worked better, had proper documentation, and didn't require an app purchase I'd be rating this 5*", "verified": true, "helpfulness": "0/0", "author": "Amber Blecker \"BurBunny\""}, {"rating": 4.0, "review": "Would've given it 5 stars if hbo go was on it but I know it's coming.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Works sometimes. Troubleshooted it and got it to work but its day 2 of not working again.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer \"Oldcollections\""}, {"rating": 5.0, "review": "Awesome!!!! :)", "verified": true, "helpfulness": "0/0", "author": "joyce"}, {"rating": 1.0, "review": "I returned it because after 2 hrs of professional installation, and a call to service center, it still would not work properly!", "verified": true, "helpfulness": "1/3", "author": "cynthia frishberg"}, {"rating": 5.0, "review": "Fast and easy to set up and use.  Only issue is getting the batteries installed.  A real pain to get that back cover off. Amazon probably knows this and hopefully will improve this in the next generation.", "verified": true, "helpfulness": "0/0", "author": "Gerry Santora"}]