[{"rating": 3.0, "review": "If the standard Amazon Fire TV is a 5-star product, which I believe it is, this is a 3. Speed isn't consistent and I run into video problems with Hulu Plus. Still a great product and better than the Roku Stick but I would invest in the regular Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Chris L."}, {"rating": 4.0, "review": "I'm giving this device 4 stars for 3 reasons:1- There are very \"few apps\" available2- It is not meant for usage outside of the USA/UK (thanks to all the licensing issues of the streaming content)3- Amazon needs to update it's support page and add Windows Phone. I have been able to completely mirror my screen of my Lumia Icon without lags, seriously Android devices lag more than Windows Phone for these matters.Overall, picture quality and interface is great.Well thought and designed.It supports Plex and is available to install from Amazon AppsStore, you can use it to stream your local media.I really wish installing apps from outside sources was a bit easier.Yes, I recommend it for both, using in the states with Prime or without it whether there or abroad.", "verified": true, "helpfulness": "0/0", "author": "G. Gutierrez"}, {"rating": 4.0, "review": "👍", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "I enjoyed using the Amazon Fire stick immensely. I liked in particular that I didn't have to use my phone to operate it and the remote control worked very well. I was able to access many sites including Netflix and YouTube. I highly recommend this device to anyone who maybe thinking about purchasing one.", "verified": true, "helpfulness": "0/0", "author": "Chris Davies"}, {"rating": 5.0, "review": "Connected quickly and works great!", "verified": true, "helpfulness": "0/0", "author": "Kathy P. Smith"}, {"rating": 1.0, "review": "The buffering is insanely annoying. I bought 2 movies and they buffer every couple minutes and the pixels get worse each time it buffers.", "verified": true, "helpfulness": "0/0", "author": "Kanani Buterbaugh"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kittyvickster"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "H.Hill"}, {"rating": 5.0, "review": "This is a great product that my whole family loves", "verified": true, "helpfulness": "0/0", "author": "Joshua baker"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Anthony M."}]