[{"rating": 1.0, "review": "After three days since I received my fire stick, it still doesn't work. Three different phone calls for help and no one could help me get past the request for a password (not their fault. All tried their best) This was supposed to be an easy to install item. No instruction booklet, so if you're having problems, you're out of luck. Have high blood pressure, and had heart surgery this spring. Didn't need the aggravation. I'd return the item if I didn't  have to re box it and drive somewhere to mail it. Instead it's in the garbage where it belongs. Oh well, caveat emptor. While I'm at it, why is it so hard to leave a complaint about an order. I've wasted three or four hours on this issue. Cmon Amazon , you can do better. I'm a loooong time prime customer and hate to complain, but there it is. Easy to install? Not even close. Call me disappointed.", "verified": true, "helpfulness": "0/0", "author": "Donald L. Campbell Jr."}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/1", "author": "Osvaldo Garcia Jr. \"ogarciajr\""}, {"rating": 5.0, "review": "I got this to try to talk my grandma into getting rid of her cable but she wasn't for it. So I used if for a couple of months and loved it! I watch mainly netflix or amazon primes tv and it worked great! Then I got grandma a tv in the living room and showed her how to use it and wrote it down, and she learned and now you can't pry her away from it! This is a great TV stick for the price!", "verified": true, "helpfulness": "0/0", "author": "Melissa Montano"}, {"rating": 5.0, "review": "This is the second Fire Stick we have purchased .  Love them because they take up no space.", "verified": true, "helpfulness": "0/0", "author": "vicsuellyn"}, {"rating": 4.0, "review": "Met our expectations. Very fast and easy set up and operation.  The only reason I give it 4 stars is that there is occasional tracking. But I knew that might the case with the lower price option and it may be partly due to our Internet service. Bottom line, for the price you can't beat it!", "verified": true, "helpfulness": "0/0", "author": "TnL Houston"}, {"rating": 5.0, "review": "FREAKING AWESOME PRODUCT! I LOVED IT!", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 1.0, "review": "hate it.. this Item keeps Freezing on my its not like my other Fire Tv Box", "verified": true, "helpfulness": "0/0", "author": "Monique"}, {"rating": 1.0, "review": "The fire stick goes in and out with my wifi. I'm not sure why because I don't have the problem with any other device. It works best when watching Prime movies but Netflix is awful with it. It is usually buffering every 10 mins or loses wifi signal while I'm watching a Netflix movie.", "verified": true, "helpfulness": "1/1", "author": "Laquesha"}, {"rating": 4.0, "review": "Pros:-Speedy setup from out of the box to using Netflix-Mainly used for Netflix and Youtube, but there are other apps but the app store or a way to search is abysmalCons:-Shaky internet connection at times even though other devices are working fine.-It should have additional languages", "verified": true, "helpfulness": "0/0", "author": "Randy"}, {"rating": 3.0, "review": "I found it to be more limited in the apps offered for streaming sites.  For 15 bucks more,  I much prefer the Roku.. The Fire stick remote seemed to have fewer controls, but that may be because it is so very teensy-weensy tiny feeling in my hands.  The Fire TV Stick has also asked me to \"log in\" several times on the same TV, which is a tedious process to do repeatedly.  It works well enough on the set in my library, which I rarely watch, but on sets that we use a lot or where we entertain, I stayed with the Roku.  It seemed better even than the on-board smart TV streaming software.  Sorry Amazon, but I am still a big fan of Prime...", "verified": true, "helpfulness": "0/0", "author": "Phil P."}]