[{"rating": 1.0, "review": "With a great deal of help from Amazon on the phone, it was installed.  When I went back a few days later it had uninstalled.  I am preparing to spend more time on the phone with Amazon.", "verified": true, "helpfulness": "0/3", "author": "avis klein"}, {"rating": 5.0, "review": "I cut the cord a while ago and this is a great replacement for the cable box on a bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Scott Arbuckle"}, {"rating": 1.0, "review": "I can't even use this product because the plug won't fit on a power strip. The base is too large to allow it to plug in between two other plugs. This seems to me an easily avoided production flaw.", "verified": true, "helpfulness": "0/4", "author": "Trevor Cobbs"}, {"rating": 5.0, "review": "Easy to install.", "verified": true, "helpfulness": "0/0", "author": "W. C. Hawkins"}, {"rating": 5.0, "review": "I bought this device when still on pre order... it was only $20 and I thought for this price would be worst than my Chrome Cast... But as soon I got it and stick on my TV, it was pleasant surprise... We replaced Chrome Cast by Fire Stick, because we don't need to have our mobile around to watch moves or TV shows, unless you want to watch Youtube videos...", "verified": true, "helpfulness": "0/0", "author": "Paulo Griiettner"}, {"rating": 5.0, "review": "worth every penny! Our whole family loves this little device!", "verified": true, "helpfulness": "0/0", "author": "eeyore"}, {"rating": 5.0, "review": "I am really impressed with the Fire Stick after using a DVD player and my ancient Wii.  It is fast, so far has worked every time I use it and has lots of viewing options.  I am not a tech person, but managed to get it set up without problems.", "verified": true, "helpfulness": "0/0", "author": "ludite"}, {"rating": 5.0, "review": "works great was able to cut a little off the cable bill. But after purchasing Hulu and Netflix I have the entertainment and saved about 15.00 off my billall you have to have is Wi-Fi. (router)", "verified": true, "helpfulness": "0/0", "author": "jill"}, {"rating": 4.0, "review": "As a simple \"turn a tv into a smart tv\" device, this is really convenient. There is a good selection of content on amazon and what there isnt, I can stream from Netflix or my pc using Plex. Sometimes the device will \"freeze\" up and I have to power cycle it (wish there was a way to do this from the remote!) but overall the UI is responsive.", "verified": true, "helpfulness": "0/0", "author": "Pierce"}, {"rating": 5.0, "review": "Amazing product. It is highly integrative with current technology. It is very easy to setup and get started. The only thing is, if you don't already have the subscriptions to some of the Apps then its a pointless to own. However if you already have the subscriptions or plan on getting them it is definitely a must have.", "verified": true, "helpfulness": "0/0", "author": "Prince Y Mckinney"}]