[{"rating": 5.0, "review": "I love it and such a great price too", "verified": true, "helpfulness": "0/0", "author": "talina"}, {"rating": 5.0, "review": "I am totally in love with my Fire TV stick. I recently checked into adding an additional cable hookup in my sewing studio and the price was extremely high. My teen age boys had seen an advertisement for the Fire TV Stick and told me to check into it. Well I took the leap and bought it and have been pleased with it since day one. It was so simple to install and set up and very simple to bring over my Hulu Plus, Netflix and Vudu accounts. Plus my Amazon Prime works like a charm!!!", "verified": true, "helpfulness": "0/0", "author": "kimmiluxich"}, {"rating": 5.0, "review": "Sa weet.", "verified": true, "helpfulness": "0/0", "author": "e"}, {"rating": 4.0, "review": "us being in the 70's in age.... took awhile to understand it, now we do, it's fine", "verified": true, "helpfulness": "0/0", "author": "Robert Huelsman"}, {"rating": 5.0, "review": "AWESOME! Get this today!!!", "verified": true, "helpfulness": "0/0", "author": "Juan Pedrozo"}, {"rating": 5.0, "review": "Just what's needed, when your Blue ray doesn't offer Amazon nor any of the offer services", "verified": true, "helpfulness": "0/0", "author": "oxyd60"}, {"rating": 1.0, "review": "Couldn't get it to connect with the internet even though all my other devices worked fine with the wireless. Not sure if it had anything to do with the Samsung model. I can connect just fine with everything by going through my blue-ray player.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This thing would be great if it worked properly.  Amazon needs to work on it.  Constantly freezes. Games will not work.  I had to reset to factory default and I could not find my password for my internet connection.  I had to contact internet provider for this info.  Big Big hassle!!It still does not work properly.  This is just one big scam!!  I do not believe these streaming devices have been perfected yet. Not by a long shot!!  But they still sell this junk to consumers.", "verified": true, "helpfulness": "0/0", "author": "truckerbob"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Cheryl M."}, {"rating": 5.0, "review": "Works great love it", "verified": true, "helpfulness": "0/0", "author": "valguen \"Valerie Guenther\""}]