[{"rating": 4.0, "review": "This is a great improvement over my old Roku.  I would like either tactile or color definition between the Navigation ring and the Select button.", "verified": true, "helpfulness": "0/1", "author": "Kieran C. McCabe"}, {"rating": 1.0, "review": "This is the biggest piece of crap I have ever bought. I have spent 20 minutes now just trying to enter my WiFi password. When you type, clicking the right button makes it go down half the time, the other half, it goes up. Clicking in the center which is usually enter...well it chooses which direction it wants to go. You get my point. I still haven't gotten the first letter entered correctly in 20 minutes. Ridiculous!", "verified": true, "helpfulness": "0/2", "author": "Amanda Varnum"}, {"rating": 5.0, "review": "I love my fire TV stick. I use it every single day in a room where I do not have a cable box. It has been very reliable and fast. The picture is crisp and clear. I have had some buffering issues on netflix, but nothing serious and nothing that bothers me enough to complain. I am so glad I purchased this and wish I purchased it sooner.", "verified": true, "helpfulness": "0/1", "author": "Vicki"}, {"rating": 5.0, "review": "Awesome. love it.", "verified": true, "helpfulness": "0/1", "author": "Tyrone Seneviratne"}, {"rating": 3.0, "review": "I've had the stick for about a week now. The first day we had issues getting an app to work and spent a good half an hour on the phone for it...and then yesterday I go to turn on the TV with it and it's just a blank black screen...I had to completely unplug it to reset it and get it to work. All this within a week doesn't give me high hopes for it. But I guess time will tell.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy, easy to install-what a value!!!", "verified": true, "helpfulness": "0/1", "author": "joy acosta"}, {"rating": 5.0, "review": "I love this Fire TV Stick and what I can do with it. TV is so boring and now I have a whole new media to pick from. I sure won't be bored for a while now. Thanks, it works great and there are a lot of great shows and movies to watch.", "verified": true, "helpfulness": "0/1", "author": "Kathy"}, {"rating": 4.0, "review": "Quick n easy. I was streaming within minutes", "verified": true, "helpfulness": "0/1", "author": "Marc Jeffery Delph \"teacherman\""}, {"rating": 5.0, "review": "Great product at a great price.  A must if you're a Prime member.", "verified": true, "helpfulness": "0/1", "author": "J. William Turley"}, {"rating": 1.0, "review": "It can never stay connected with my network.", "verified": true, "helpfulness": "0/1", "author": "Kirk Gregg"}]