[{"rating": 3.0, "review": "I received my Amazon Fire TV Stick about a week ago and it was easy to set up and relatively easy to use.  What is fairly disappointing was that some of apps such as CNN are available ONLY on the Fire TV but not on the stick.  If you are looking to purchase  streaming devices such as a Roku or a Fire TV stick,  be sure to check on the amazon app site to see if apps/programs that are important to you are supported on the Fire TV stick.  It might end up that other devices might be better suited for your needs.", "verified": true, "helpfulness": "0/1", "author": "Li Peng Yap"}, {"rating": 5.0, "review": "This is the best way to watch tv", "verified": true, "helpfulness": "0/0", "author": "Evelyn Padilla"}, {"rating": 4.0, "review": "I have net Flicks and Prime --the fire stick is easy to use --especially with the phone app--- and I do like it --  when doing searches everything and not just prime movies or net Flicks --that is my only complaint.  It works very well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It's been working great so far!", "verified": true, "helpfulness": "0/0", "author": "bernadette"}, {"rating": 5.0, "review": "I am so pleased with this little tech gadget!  Super easy to install; had it done in a matter of minutes.  Also, very user-friendly.  Love being able to watch movies/programs on my big TV.  Plus, similar products are much more expensive than the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Boxer Lover \"Luv2read\""}, {"rating": 5.0, "review": "amazing !!", "verified": true, "helpfulness": "0/0", "author": "Laura Catania"}, {"rating": 5.0, "review": "Works great. Easy set up. Makes your TV a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Ginny Hogan"}, {"rating": 2.0, "review": "still not provide streaming for out of US territory , even am still interesting in buying renting some series and movies.", "verified": true, "helpfulness": "0/0", "author": "Mountaineer"}, {"rating": 5.0, "review": "I LOVE the Fire TV Stick.  I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Dahlra"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "eric"}]