[{"rating": 5.0, "review": "Great Addition to TV Viewing - this was easy to use - love being able to watch movies and tv shows on larger screen! Great purchase.", "verified": true, "helpfulness": "0/0", "author": "C. Santoro \"Mystery Lover\""}, {"rating": 4.0, "review": "Black Friday 2014.Had to do the plug it into wall socket to get it to stream signal from my kitchen thru plaster walls to living room router signal.Loaded information like my router link (select to hide your password!!!) and my Amazon acct login.It connected and updates downloaded automatically and then it restarted and I was watching the tutorial video.I was irritated that it had to be plugged into the wall power socket and I had a usb cord draping down and across the wall.Discovered after doing an online search that after downloading updates are completed, the tv usb connection should power it even if it's just an input usb port (5 Volt, 0.5 Amp port) and not a power usb port.NOTE (this is after signing up and doing all automatic updating streaming):Just powered Fire TV Stick with my one and only usb port on my Samsung 28 inch 4000 series tv.I then had no cords hanging down the wall and the Fire TV Stick or it's cords showing form my wall mounted tv.Was able to stream beautiful, perfect and uninterrupted new PBS (free signup) Nature show (breathtaking video quality and colors).NOTE (to save power and the lifecycle of the Fire TV Stick and stop it from feeling HOT to the touch and eating up electricity when not in use):Hit the home button on the included remote.On the left side of your tv screen you'll see a long list of menu items.Scroll all the way down to the very end until you see \"Settings\" and select it.Scroll over to \"System\" and select it.Select \"Sleep\".Screen will go blank as  Fire TV Stick is powered down (touch on any of the remote's buttons and it will power back up).Go to your TV's remote and select your tv program to watch or just power off you tv until it's next use.NOTE: If the Fire TV Stick is not put into sleep mode, it will start running an endless slide show of pre-installed photos to avoid tv screen burn-in and is therefore using electric power to do this so device will get HOT so, it's best to put it into sleep mode.COMMENTS:  It works well once setup.  Very advanced streaming device but apps are limited and not as interesting or fun as my Ruku3 apps selections but it does what I needed for my second TV that uses a Winegard (clear see thru costco version) Flatwave amped antenna for over the air tv signals in my kitchen.~~~over and out~~~", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Hooked up easy, with Amazon Prime we get a reasonable number of items to watch so on a bad TV night, which there seems to be many it's a great alternative.", "verified": true, "helpfulness": "0/0", "author": "Don Mesa Arizona"}, {"rating": 5.0, "review": "East to set up and use", "verified": true, "helpfulness": "0/0", "author": "crispre"}, {"rating": 4.0, "review": "Good for a stick streamer. However, I haven't been able to figure out how to shut it off without unplugging it. And some of the apps freeze up. This second complaint is probably due to WiFi being not as fast as it could be. I usually use lan cable for fastest connection. Not an option with this device. I like that it's portable so can take with me when I go to friends house for movie nights.  All in all, not bad.", "verified": true, "helpfulness": "1/1", "author": "B. Castro \"spaced boy\""}, {"rating": 4.0, "review": "I am enjoying setting up the FireTVStick but apps so far seem to be an issue. Example; I installed WifiMediaSync but when I go to install the client either on my PC or my Mac I cannot connect to the website, it doesn't seem to be accessible. This is bad as I cannot use the app without the client and I cannot download the client. I paid for this app so it is doubly disturbing that the company is not maintaining the website. For all I know WifiMediaSync doesn't even exist anymore. If that is the case the app shouldn't be listed for purchase.I will update this review as I test all the various functions and capabilities of the Stick.EDIT: WifiMediaSync finally accessed on my PC and Mac. Connected client to device and the connection is good but some confusion as to how to stream media. I will continue working on this.NOTE: When will engineers get with the times and design the power plugs so that the plug doesn't block one or more unused outlets on a power strip??? This is a continuing problem with all electronic devices. Smart designers turn the plug so it plugs from the side and doesn't block other outlets, BUT the FireTVStick is not one of those devices. The plug blocks a free outlet on my power strip thereby reducing the number of available outlets (unless I use the last outlet but then I have to unplug everything to rearrange the power cables). Get with it guys!", "verified": true, "helpfulness": "0/0", "author": "Reluctant Consumer"}, {"rating": 1.0, "review": "Chromecast lets me cast virtually EVERYTHING and ANYTHING to my TV and finding things to cast is made fast and easy because I use a real keyboard on my PC for searching, etc. This stick ties me down to a very limited number of services and most require a paid subscription to use.Movies and TV shows cost money unless, of course, I opt for the $99 per year Amazon Prime service. Tying to use the soft keyboard for searching by selecting one character at a time is utter agony and very time-consuming, which is probably why the main way to find things to watch requires endless scrolling through thumbnails.Yes it has a Remote, which Chromecast does not. In essence the Remote becomes a extremely limited substitute for the PC (or Tablet, or Phone) that Chromecast requires for choosing and controlling videos. But it's functionality, compared to that of a PC is terribly limited.It would have been a bit nicer if the thing had actually worked right out of the box. It installed OK but I was then unable to play movies or TV shows from Amazon free of charge using my Prime account. Amazon Tier 1 support could not fix that.  Ironically, they all would play fine on my PC and  I could cast them to my TV by using Chromecast to cast the whole desktop.Chromecast - Yes.  fire TV Stick - No.", "verified": true, "helpfulness": "3/5", "author": "user659"}, {"rating": 1.0, "review": "im use to netflicks. I have a roku.this doesnt make it easy to watch all the prime videos", "verified": true, "helpfulness": "1/3", "author": "richard fleitman"}, {"rating": 5.0, "review": "Excellent. Better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "William S."}, {"rating": 5.0, "review": "We love the Fire TV Stick, it's so easy to set up and use, even an elderly person (over 80) can use it!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]