[{"rating": 5.0, "review": "The Fire TV Stick works perfectly for watching Netflix shows and movies.  We do not have a newer TV.  I hooked this device up to a second HDMI port.  I am not overly technically adept.  I managed to get this going relatively easily with no calls to support.  It has been a good purchase for me. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Jan"}, {"rating": 5.0, "review": "This was given to me as a gift and I absolutely love it!!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "Love the added features and screen layout compared to running Prime direct from TV.", "verified": true, "helpfulness": "0/0", "author": "Randy W."}, {"rating": 5.0, "review": "It is super easy to use and makes looking up movies, photos and music fun.  Great buy!!", "verified": true, "helpfulness": "0/0", "author": "Newday"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Suzanne Lanzilla"}, {"rating": 5.0, "review": "This is great for movies and more! With PRIME movies it gives me many more options than the others.", "verified": true, "helpfulness": "0/0", "author": "Discreet Shopper"}, {"rating": 5.0, "review": "We really are enjoying this item!!! I recommend it highly.", "verified": true, "helpfulness": "0/0", "author": "sharron kaufhold"}, {"rating": 4.0, "review": "I love the fire stick but my only issue is that the remote often gets stuck.  I would have Amazon rework the remote in the next gen of this product.Other than that, I love the HD quality and streaming.  The apps are good as well.", "verified": true, "helpfulness": "0/0", "author": "jezzeut"}, {"rating": 5.0, "review": "Sounds and video sometimes doesn't  match but easy reset fixes that. Think it's more my tv and internet. Other then that works great.", "verified": true, "helpfulness": "0/0", "author": "Robert Fitzgerald"}, {"rating": 5.0, "review": "Very easy installation", "verified": true, "helpfulness": "0/0", "author": "Peter Galas"}]