[{"rating": 1.0, "review": "For some reason Netflix doesn't work. Not sure why but I am contemplating returning the item.", "verified": true, "helpfulness": "0/0", "author": "steven"}, {"rating": 5.0, "review": "Great alternative to premium TV", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 5.0, "review": "Enjoyed this purchase. Does what it says it will do.", "verified": true, "helpfulness": "0/0", "author": "Sharon Rowland"}, {"rating": 5.0, "review": "This is so easy to set up and start using.", "verified": true, "helpfulness": "0/0", "author": "Angela Wolfe"}, {"rating": 5.0, "review": "I bought this mainly for the purpose of using it in a hotel for my little kids to watch some Prime and Netflix kids shows.  It was easy to set-up and get started and the remote, while not voice activated, worked well.  There is also a Fire TV Remote app for your smartphone although I haven't tried it yet.  The HDMI stick runs on a mini-USB power adapter (included) so if your TV has a USB slot you can plug it into that for power.  If not it does come with a power adapter plug for a wall socket.  The power cord is only about two feet in length so you'll need some kind of extension chord or surge protector to plug into for far away outlets.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Ryan\""}, {"rating": 5.0, "review": "I only use it for KODI, and it works great. I want the fallback if there are issues of amazon prime. Cheapest android KODI experience I could find, and the remote works with KODI out of the box. A few tweaks and the remote works really well for KODI", "verified": true, "helpfulness": "0/0", "author": "J. D. Runyan \"Legatus\""}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Kenneth J. Mott"}, {"rating": 3.0, "review": "Easy to install & use. The tuitoral video is great! Love the iphone voice app! Rated at 3 only because thought would have more avail on prime membership. Alot of kids shows at least that my kids watch need to pay for.", "verified": true, "helpfulness": "1/1", "author": "nicole jacobs"}, {"rating": 4.0, "review": "works better then any thing else i've tried.", "verified": true, "helpfulness": "0/0", "author": "James Hegenauer"}, {"rating": 5.0, "review": "so far so good!!!", "verified": true, "helpfulness": "0/0", "author": "Cheryl Globig"}]