[{"rating": 5.0, "review": "awesome gizmo. I love it 100", "verified": true, "helpfulness": "0/0", "author": "Cole Deacon"}, {"rating": 5.0, "review": "OK I've got to admit this one is a bit hard to place.  At the 17 dollar initial price point for prime users, it's a steal and a Chromecast beater.  I think it's showing 40 bucks now.  That's pretty expensive for a Chromecast level device.  Once you get up around the 50 dollar region, there is a lot more competition and I'm not sure the Fire Stick holds up very well.  Hopefully these will settle at around 20-25 bucks and it will continue to be the class leader.", "verified": true, "helpfulness": "0/0", "author": "Matthew J. Simpson \"Sjaxkingpin\""}, {"rating": 4.0, "review": "Simple to use and access to a good many things.", "verified": true, "helpfulness": "0/0", "author": "Savannah"}, {"rating": 4.0, "review": "The Amazon Fire Stick is one of the latest gadgets to use to connect your HDTV to the Internet by using apps. The Fire Stick is very simple and easy to hook up. Just plug the stick into the back of your TV into an availbale HDMI port. Then connect with your home wifi system and you are up an running. It comes with a remote which is one of the big things that separate it from Chromecast. This makes the Fire Stick very easy to use. No getting up and down to change things between your TV and other devices. Basically no casting. The apps are easy to add. Most seem to be free. The main apps I use are YouTube,Netflix,ESPN and MLBTV. The first three have all worked great. Hardly any buffering and they come up right away. They are easy to move around in too. The MLBTV app is another story though. It is nearly unusable. It constantly buffers. It may work for a little while then it will start buffering. You can go into and out of the app and it will play OK for a few minutes and then the buffering starts. You can read the reviews for this app and see many,many others have the same problem. People have complained a lot about it on the MLBTV forums too. These two need to get together to fix these issues. It would be a great app if the buffering can be eliminated. That's the reason I only give the Fire Stick a four star rating. It would be a Five if not for the MLBTV issues.Also should mention that any music you have added from Amazon can be played on this too. I have enjoyed that very much and have listened more since I have had the Fore Stick than ever before.", "verified": true, "helpfulness": "0/0", "author": "CatMan"}, {"rating": 5.0, "review": "This thing is great! I love my Fire TV Stick. I've mainly used the Hulu and Netflix apps but it always funtions perfectly and the image is great. I would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "LRL"}, {"rating": 5.0, "review": "Absolutely LOVE the Amazon Fire TV stick!!!!!  It meets AND exceeds my expectations!!!!  Thanks so much!!!  I'll be ordering another one for my bedroom TV very soon, along with an Amazon Prime membership!!!!!", "verified": true, "helpfulness": "0/0", "author": "MsMellie0488"}, {"rating": 5.0, "review": "Fantastic!!!Out shines the ROKU stick by a mile....very satisfied sure....now waiting for amazon to come out with a 4K device!!!", "verified": true, "helpfulness": "0/0", "author": "joe doe"}, {"rating": 2.0, "review": "I didn't know just how this product workout for me. I didn't know that you had to pay for moves on the fire stick. I thought that when you pay for the device the movies was included.", "verified": true, "helpfulness": "0/0", "author": "GARY  GEORGE"}, {"rating": 5.0, "review": "I love it! We have an HD TV that isn't a smart TV but with this we can have access to our Amazon prime and Netflix on that tv. Now we don't have to fight for the smart tv.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Beyond my expectations.  Absolutely love this device. I can move it from TV to TV and watch the shows that I love.  LOVE THE AMAZON FIRE STICK.", "verified": true, "helpfulness": "0/0", "author": "Karen R."}]