[{"rating": 5.0, "review": "Great little thing, So very easy to use.  Just plug it in a go.  I had a Roku stick before and It was such a hassle to get it to work I hardly used it.  But the Fire TV Stick I used everyday!", "verified": true, "helpfulness": "0/0", "author": "Bee Gee"}, {"rating": 1.0, "review": "Had for 45 days junk stopped working. Only has 30 day return. 1 year warrenty but now jumping thru hoops to get replaced", "verified": true, "helpfulness": "0/0", "author": "kim k."}, {"rating": 5.0, "review": "Absolutely love it! Have used it almost non stop since purchasing. Very easy to install and set up.", "verified": true, "helpfulness": "0/0", "author": "KAREN A MCMAHON"}, {"rating": 3.0, "review": "I like itthe price is goodi was hoping to view life sports", "verified": true, "helpfulness": "0/0", "author": "jack marascio"}, {"rating": 5.0, "review": "best purchase I have made in a very long time. works well and setup is child's play.", "verified": true, "helpfulness": "0/0", "author": "guster"}, {"rating": 5.0, "review": "Just as advertised.", "verified": false, "helpfulness": "0/0", "author": "Jake1"}, {"rating": 1.0, "review": "Unimpressed. Plugged it into my Samsung TV and the Fire Stick remote would not respond, only the Samsung remote which cannot complete all the functions.", "verified": true, "helpfulness": "0/0", "author": "Ralph Myers"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Alberto"}, {"rating": 5.0, "review": "Had it for two weeks. Easy to install this very compact unit. Performs as advertised.", "verified": true, "helpfulness": "0/0", "author": "R. Bu \"rdbug\""}, {"rating": 3.0, "review": "Its a good media player and offers most of the apps you would expect as well as of course Amazons own movie service for Prime members. I preordered for the $20 and I think it was a good buy but not great. For the speed and variety of services I just think other options do it better.  I have high expectation of Amazon products and I think this still has a lot going for it and potential to be better as features and services are added, but as it stands it just doesn't stand strong enough amongst the competition.If you're an Amazon prime member then this is still a decent buy, but I think it is worth it to pay more and get something that already has all of the features this doesn't as of this review.  I will update this review should I find reason to.", "verified": true, "helpfulness": "0/0", "author": "I Like Stuff"}]