[{"rating": 4.0, "review": "Fire stick is great for a portable device but get the full box if you want a full experience. The stick is lacking in memory and processing power... The internet connection is kind of low for streaming. The stick buffered the box did not. On standard high speed internet I am sure it works just fine", "verified": true, "helpfulness": "0/0", "author": "brianwallen75 \"Brian Allen\""}, {"rating": 3.0, "review": "So far, I am enjoying the features of the Fire Stick. What I am disappointed in is the lag. I can watch netflix from any computer or device in my home without issue. With the Fire Stick, I have intermittent connection issues, and the audio seems to get slightly out of sync with the video. I have also gotten the \"buffering\" warning when watching Prime Video, which also has no issues from a laptop or tablet.", "verified": true, "helpfulness": "0/0", "author": "Aaron Fortin \"fortinaa\""}, {"rating": 4.0, "review": "Works relatively well - stutters while streaming occasionally. Not that happy with the Amazon marketplace.", "verified": true, "helpfulness": "0/0", "author": "kudy"}, {"rating": 2.0, "review": "Annoyances include no backward compatibility for older HDMI to optical audio codec support, no Bluetooth headset support and the device not waking upon remote button push but always requiring an HDMI disconnect and reconnect.", "verified": true, "helpfulness": "1/1", "author": "Jeff E."}, {"rating": 2.0, "review": "Purchased just before Christmas 2014, Worked well enough for the first several months.I had the power brick hooked up to an outlet that turned off when my receiver was turned off, and I found that while it would boot up and stream amazon content almost immediately, 60% of the time i would have to wait 5 minutes to stream content from Netflix.  I would simply get a \"title is not available right now\" message for all Netflix content, even though i could view said titles via a laptop at the same time.  I grew tired of this, so I put it on a different plug that would not force a power cycle.Later, I found that I had to power cycle the unit every few days anyway, as it would start freezing the graphics on a stream for a few seconds, and then playing in fast forward until it caught up.  This pausing would continue until i unplugged the unit, let it cool down for five minutes, then plugged it back in; this would typically grant me another few hours of non-paused viewing.  A few weeks ago the picture would occasionally start to grain up, as though I was watching on an analog TV in a rural area in the 1990's.  Twice today the Fire TV Stick stopped sending a signal to my television at all until it was unplugged and cooled down, I think that I am reaching the end of my unit's lifespan.  I know people who have been using chromecast and rokus for  significantly longer than our Fire TV Stick, and have not heard complaints from them of this nature.  Hopefully the stick will brick up completely in the next few months, as I worry that since the problem seems to be intermittent after hours of use I don't know that the warranty service will find anything to repair.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it...saving a lot of money!!  '", "verified": true, "helpfulness": "0/0", "author": "tammy howatt"}, {"rating": 5.0, "review": "Excellent.", "verified": true, "helpfulness": "0/0", "author": "Yoda"}, {"rating": 5.0, "review": "Bought it for my girlfriend so that she can use it in her apartment where she doesn't have a smart TV. She uses it daily and loves it.", "verified": true, "helpfulness": "0/0", "author": "Robby"}, {"rating": 5.0, "review": "I went with this over the Chromecast because of the remote. Setup was super easy, navigation is simple and it works great. Awesome product, even if Gary Busey is the one hyping it :)", "verified": true, "helpfulness": "0/0", "author": "OC_Scotty"}, {"rating": 5.0, "review": "Pre Ordered, Great Price, Works Well, Portable when traveling", "verified": true, "helpfulness": "0/0", "author": "Retired369"}]