[{"rating": 4.0, "review": "It was very easy to set up and begin using.  I haven't explored all my options yet, but I have been watching movies and TV shows through my Netflix account. Great buy!", "verified": true, "helpfulness": "0/0", "author": "K D Connon"}, {"rating": 5.0, "review": "Very impressed with the fire stick tv, the only drawback is that almost every series I want to see has to be purchased. I am a big fan of British TV and everything is pay to watch and all the oldies tv shows have to be paid. I think it is a good concept but needs more channels to watch.", "verified": true, "helpfulness": "0/0", "author": "S. Carpenter \"ladycop\""}, {"rating": 5.0, "review": "Was nervous when I made the purchase but it was easy to set up and very easy to use. I have Netflix thru the fire stick as well. Love it!!!", "verified": true, "helpfulness": "0/0", "author": "William Lawson"}, {"rating": 3.0, "review": "Netflix does not work on it.  Better to use Chromecast with Netflix and Hulu", "verified": true, "helpfulness": "0/0", "author": "William Swift"}, {"rating": 5.0, "review": "followed directions an everything went fine hooking up and viewing movies", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This is amazing. We have so many options with the fire stick and it was very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Debbie Ratliff"}, {"rating": 2.0, "review": "My Tv's sound in ran to my Yamaha reciever by optical. The Fire stick only uses my tv's speakers that my husband cannot hear. I tried hooking it up differently but it does not work.", "verified": true, "helpfulness": "2/2", "author": "Debra Schultz"}, {"rating": 1.0, "review": "I've spent way too much time getting this to work. Says there's not a network connection then my network settings tell me the connection is \"strong\". tired of fighting with it.", "verified": true, "helpfulness": "0/0", "author": "Joanie McCaw"}, {"rating": 5.0, "review": "Worked great, and had it set up in minutes. It's quite a distance from router,  but have not had a problem streaming, from DSL.", "verified": true, "helpfulness": "0/0", "author": "Builtin62"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]