[{"rating": 5.0, "review": "I love the stick.  The price was low.  Now I can watch so many movies and tv series without paying for cable.  It works thru my internet.", "verified": true, "helpfulness": "0/0", "author": "Clara Duran"}, {"rating": 4.0, "review": "Works great make sure to restart once in awhile.  Like any electonic devices.  Especially after having a couple of hiccups.", "verified": true, "helpfulness": "0/0", "author": "Ibuyamazon"}, {"rating": 5.0, "review": "I am enjoying this. A lot. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Christian Radillo"}, {"rating": 5.0, "review": "It works very well", "verified": false, "helpfulness": "0/0", "author": "Cranston Logan"}, {"rating": 5.0, "review": "This thing is amazing!!!  Plug it in and it goes.  I was hesitant to try any streaming device, because on my iPad with my wifi streaming can be hit or miss; lots of buffering.  But with the Fire Stick?  Crystal clear HD, tons of stuff to choose from and .... hasn't buffered yet.  The remote takes a bit of getting used to, as does the menu but less than a week later (and having to ration my TV time) I've got it down.", "verified": true, "helpfulness": "0/0", "author": "Joan M. Mchugh"}, {"rating": 5.0, "review": "I use this every day for streaming my shows.  Works great!", "verified": true, "helpfulness": "0/0", "author": "Paul Hill"}, {"rating": 5.0, "review": "THIS WAS FANTASTIC", "verified": true, "helpfulness": "0/0", "author": "EDMUNDO J DE LA PENA and jennifer de la PENA"}, {"rating": 5.0, "review": "WONDERFUL", "verified": true, "helpfulness": "0/0", "author": "veronica navarro"}, {"rating": 5.0, "review": "I love it.  I owned the Chromecast and currently own an Apple TV.  The Fire Stick is a great balance between the both of them.  You get the spatial convenience of the Chromecast but the user convenience of the remote control.  It's a remote control that works well that doesn't need a direct line of sight like Apple TV remote.  You can use the app as an alternative remote control as well.  It has an App store unlike the Apple TV.  It feels snappy when using it as well.  For the price you pay this won't disappoint.", "verified": true, "helpfulness": "0/0", "author": "RBalm"}, {"rating": 3.0, "review": "The primary reason for getting the fire tv stick was to listen to my amazon music and prime music on my tv. Most of the rest of the things available on the stick are available through my smart tv itself or my smart blu-ray player. What I find though is that the Music on the Fire Stick simply does not sync with my Music Library. If I add an album it doesn't show up on the stick. If I add a playlist, it doesn't show up on the fire stick. If I delete a playlist, it STILL shows up on the fire stick. IT SIMPLY DOES NOT SYNC with my music library. I called the Fire Stick support line available through the Fire Stick and the first person I got acted like I was speaking Swahili and sent me to someone else. The second person said Hello and the connection was lost. I guess if I want to listen to the same music over and over, I made the right choice.", "verified": true, "helpfulness": "0/0", "author": "K. A. Powers"}]