[{"rating": 5.0, "review": "I'm loving it", "verified": true, "helpfulness": "0/0", "author": "Winnie S Whitfield"}, {"rating": 5.0, "review": "Just love it. I dont have cable in the bedroom and I can access plenty of TV to fall asleep too.", "verified": true, "helpfulness": "0/0", "author": "Gail McGaughey"}, {"rating": 4.0, "review": "Wish there were more recent shows offered free.", "verified": true, "helpfulness": "0/0", "author": "J. Rasch"}, {"rating": 5.0, "review": "Very pleased with the fire stick. Glad my friend convinced me to buy it.  I like having so many shows & movies to watch.", "verified": true, "helpfulness": "0/0", "author": "Dora M. Lowden"}, {"rating": 4.0, "review": "Little hard to get other programs except for prime", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Everything I wanted and more!", "verified": true, "helpfulness": "0/0", "author": "Manish Misri"}, {"rating": 5.0, "review": "I now use my Amazon Prime Subscription to its full potential.", "verified": true, "helpfulness": "0/0", "author": "Momatheny"}, {"rating": 5.0, "review": "We got this mostly because (1) our Sling TV app was twitchy through a PC, despite good wireless connection; (2) our Roku is too old to run Sling TV, and we're waiting to purchase Roku 4; (3) we were interested in trying another Amazon product, because we've had good luck with them; and (4) the Fire Stick was free with three months' purchase of Sling TV.We've been happy with it, although it has nowhere near as many channels as Roku (including Nowhere Man, draw poker, and many more). It does well with the big apps like Amazon Prime and Sling TV, thought, so we're happy. We had to relocate the stick to the HDMI on the side of the TV, as it didn't do well amid other HDMI cables. Relocating it fixed it.While we'll likely upgrade to Roku 4 when available, we'll continue to find a use for this device. Recommended.", "verified": false, "helpfulness": "0/0", "author": "AZ123"}, {"rating": 5.0, "review": "I'm obsessed with this right! I cast things from my iPad onto my tv constantly. And Netflix works amazingly on here. I'm not a tech savy person and I'd describe this as easy to use for anyone!", "verified": true, "helpfulness": "0/0", "author": "Beckie Delgado"}, {"rating": 5.0, "review": "LOVE it LOVE it, LOVE it! wish i had found this awesome device sooner! Cant wait to binge watch on Netflix!", "verified": true, "helpfulness": "0/0", "author": "christie nelson"}]