[{"rating": 1.0, "review": "Hopefully my experience is the exception, not the rule.  My TV goes black then pops back on trying to search for the proper resolution, even when the Fire stick is set for 720p.  I moved it to another TV where it works fine -- except when it is not the selected device it interferes with my cable box's video on the TV.I am a loyal Amazon customer, but this is frustrating.", "verified": true, "helpfulness": "1/1", "author": "Geoff"}, {"rating": 3.0, "review": "Just got my Amazon Fire Stick today and just love it! Like some others, I bought it on the advance sale for Prime members at $19.00. It was schedule for delivery by 12/16, but got it 10 days earl (an automatic plus!) So quick and easy to set up and within 15min I was kicked back and watching Hulu+, Netflix and my Amazon Prime videos! Not much of a gamer, so I can't speak for the game apps.The only negative aspect is the lack of HBO Go, but that's due to restrictions my Time Warner (owner of HBO) But I also have theKindle Fire HD 8.9\" and I have no problem with HBO Go on that, so no big loss.  I just upgraded my main TV to a 55\" smart tv anddidn't want to pay for additional cable. Wasn't sure I'd keep my old 32in TV but now it's got new life in my bedroom and I get towatch TV in bed!!Update 14Aug2015 - Okay I loved this when I first got it but after several months, I'm so frustrated with some of the apps on the Fire TV Stick.Hulu and Netflix constantly freeze while I'm watching. I don't have this problem with my Kindle Fire HD (2013 version) or with my Samsung Smart TV or Samsung Blu ray. I've tried to delete and reload the apps and even restarted the Fire TV Stick but no change. If it happened across all my devices I would blame my internet but it's only with the Fire TV Stick.  No problem with Amazon videos or other apps, just Hulu and Netflix (surprise...I use these the most!) It may have been just because I got the pre-order and all the bugs weren't worked out. I wish I had sent it back right away, but not buying a new one. If I do, I'll probably switch to Roku", "verified": true, "helpfulness": "0/0", "author": "mikey718"}, {"rating": 1.0, "review": "Need to restart fire stick quite often after switching off television. Only way to get it working is to unplug /plug in the power source.", "verified": true, "helpfulness": "0/0", "author": "Frank Steemers"}, {"rating": 2.0, "review": "I had one of these on order, then picked one up at a local Best Buy.  After testing that one I canceled the online order.  This is an Amazon Prime device primarily, with additional apps available to give you access to other services such as Netflix.  The difference in accessing Prime content and Netflix connect, built-in function vs app function, can be confusing.  Although I like the fire stick hardware better than the roku stick hardware, the roku software is much easier to use.", "verified": true, "helpfulness": "0/0", "author": "Steve \"linuxisfree\""}, {"rating": 3.0, "review": "Cheap and works pretty well. The user interface is too skewed toward Amazon content, and the Hulu Plus app is not very good. I'm also now experiencing an intermittent buzzing during shows (both Hulu and Netflix).Hoping the software improves with time.", "verified": true, "helpfulness": "0/0", "author": "Apple User"}, {"rating": 3.0, "review": "I loved this device, especially considering the price, until I tried to use Plex.  I've tried everything and it stutters so much that it is unusable.  Do NOT buy this for the sole purpose of running Plex.  You will be disappointed like I am.Update:  I have used the Fire TV Stick for a couple more weeks and Flex has become more reliable.  I do have to occasionally unplug the power to reset it because it says it cannot connect to my wifi.  This is bs since all of my other devices have zero issue connecting when it says this.  I purchased the stick for $20, Plex was only $2, and the Slingbox app that just came out was free.  Amazon is off to a great start with this product and this is why I'm raising my review to 3 stars.  Once I do not need to unplug this every other time I use it, I will raise to 4 or 5 stars.", "verified": true, "helpfulness": "0/1", "author": "MJP"}, {"rating": 5.0, "review": "I have ROKU 3, Apple TV, a smart TV, and now the stick.  It's the quickest way to access Amazon movies and Amazon streaming music.  I especially like the streaming music setup.  Worth getting.", "verified": true, "helpfulness": "0/0", "author": "P. Stein \"Bengals Fan\""}, {"rating": 5.0, "review": "Works just like advertised!", "verified": false, "helpfulness": "0/0", "author": "BWB"}, {"rating": 3.0, "review": "Love the easy access to Amazon Prime free content as well as Netflix. Would rate 5 stars BUT...Had to reboot (power cycle) after a few days because of wifi problems. Several other wifi devices on my network were fine but the Fire Stick said \"connected to network with problems\".  No option to reconnect either. Also,  screen casting from my Nexus 5 (lollipop) is iffy at best. Lots of pops and clicks and eventually the connection is dropped. Still,  since I only paid twenty bucks it's not bad.", "verified": true, "helpfulness": "0/0", "author": "Capt'n George \"AKA Spike\""}, {"rating": 3.0, "review": "Took a long time to load and start but it appears to be fast.  We could plug headphones into the Roku we had and this does not have this feature.  I also dislike to controller.  It is too small and cheap.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"jwimebb\""}]