[{"rating": 1.0, "review": "very limited selection", "verified": true, "helpfulness": "1/2", "author": "John M."}, {"rating": 5.0, "review": "Works great! Really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "South Texas"}, {"rating": 4.0, "review": "I am having the same issue that many people are having, keeping a wifi connection. Not sure if this can be fixed with an update but I hope so.When the stick is connected it is great. Easy to use, tons of apps (including games) and fast to load. I have never owned a streaming device but for the price ($19) why wouldn't I. Way faster than using a Blu-Ray player or gaming console.The IPhone app takes a little getting used to but is really cool.", "verified": true, "helpfulness": "0/0", "author": "Joe Vecchione"}, {"rating": 3.0, "review": "I do spend more time waiting to finishing buffering or connecting to my network than watching tv shows or movies , really is a constant frustrating state of mind that sometimes I just prefer to read a book than throw the stupid remote control but others days it works completely fine I just have to catch it on the right \"  mood \" .I liked amazon.com , rarely have a bad experience with their products or services that's why I did trust to buy their products but honestly on this one I should had to past but o well sometimes we error on some choices.", "verified": true, "helpfulness": "0/1", "author": "LILLY \"Mss. Greener\""}, {"rating": 5.0, "review": "we absolutely love the firestick! We use this along with the sling TV app which is $20/mo, and an antennae. So for the cost of our prime membership and $20/month we get almost as much television as our neighbors paying TONS of money for cable or satellite!", "verified": true, "helpfulness": "0/0", "author": "megan m \"megan m\""}, {"rating": 5.0, "review": "The product works well!  I was VERY CONFUSE, however, that it took nearly 3 wks to receive it -- after confirmation of 2 DAY SHIPPING.!!!BTW, where is the protection plan?  TNX.  Joan Smardan", "verified": true, "helpfulness": "0/0", "author": "joan smardan"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "terrie"}, {"rating": 5.0, "review": "AMAZING!  The FIRE TV STICK is fantastic.  So many movies and series I've wanted to watch, all in one place, many of which are FREE!!!It was super-simple to set up, and even easier to use.  I like how it tracks where I am in a series.This is the best thing since sliced bread...", "verified": true, "helpfulness": "0/0", "author": "Beverly ASH"}, {"rating": 4.0, "review": "Everything I expected.", "verified": true, "helpfulness": "0/0", "author": "Derwood"}, {"rating": 4.0, "review": "I haven't had this for long but I love it overall.  It's very easy to set-up.  The pricing is great, almost too good to be true.  I'm a Netflix subscriber and find it very easy to watch my programs and my 4-year enjoys her shows as well.  If you are an Amazon Prime member (which I am not) then you would have the added benefits of so much more.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Beckler"}]