[{"rating": 5.0, "review": "It is fantastic!  i really enjoy it!", "verified": true, "helpfulness": "0/0", "author": "Gary Terlisner"}, {"rating": 5.0, "review": "I LOVE my Fire TV Stick! I could only watch my Prime shows & movies on my kindle or computer. With Amazon Fire TV Stick I can now have my family enjoying watching with me! Thank you AMAZON!", "verified": true, "helpfulness": "0/0", "author": "Angela Ortega"}, {"rating": 4.0, "review": "***-1/2 stars!I love my Fire TV.  It's been great so far.  So getting this one was a no-brainer (got this at the early promo price.)  It works just like the Fire TV but here are my two issues.One, the wireless signal is not as strong as the Fire TV.  Even with a gigabit dual band wireless router, the reception is spotty in the upstairs bedroom (router in living room.)  Other blogs (not on this site) say the same thing.  So keep in mind that the Stick needs to be closer to your router (even with a gigabit dually).Two, this thing gets really hot.  My fear is that it will eventually burn out.  Worse case, cause a short and fire (no pun.)  I know my FTV gets hot too but not like the Stick.  So consider safety if using this on your wall-mount TV.Just a minor issue, I think it would be better to have the power port on both sides of the stick (if not opposite of where it is constructed now) because most HDTV have their HDMI ports on the left side (from screen perspective).  Older ones have the HDMI ports going perpendicular to the TV's (thanks of the flexible extender).  In any case, the power port (it has one but commercials don't tell you it has one) is up when inserted into my TV. Therefore, the power cable plugs on the upward side then has to hang down (which can tug on your stick).  Not a big deal.Other the than the two, it is comparable to the Fire TV.  I do not think these Sticks are meant to be long-use though.  Would recommend the FTV.", "verified": true, "helpfulness": "0/0", "author": "Odii Gis"}, {"rating": 5.0, "review": "Everything and more than I expected!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "There have been issues with the apps loading properly, even though the stick is right next to the router. There are extensive issues with using the remote and the application responding improperly. The setup was easy and I like the look and feel, but try to flip through with the remote is extremely frustrating, it does not work well. I am hoping there is a software/firmware fix.", "verified": true, "helpfulness": "0/1", "author": "John Mellios"}, {"rating": 4.0, "review": "Great product!!PROSEasy setup , ease of use , lots of options , quick uploads .CONSOnly can view on TV its hooked up too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just plugged in and ready to go.  Awesome to be able to quickly SMART capabilities to my dumb tv.  Some people have said that the Stick is slower than the Amazon Fire TV, but there is no doubt that it is quick.  No lag in processing or video.  Only bad thing is now I have a third remote to contend with. (Dish, TV, Fire Stick)", "verified": true, "helpfulness": "0/0", "author": "cboe"}, {"rating": 5.0, "review": "I love it! It works exactly like it's supposed to.", "verified": true, "helpfulness": "0/0", "author": "Melanie H."}, {"rating": 2.0, "review": "**update 7/2015 original review below**So I've had this thing since launch.  After a few patches its gotten better but it still isn't truly reliable.  It loses connection more than it should.  Apps crash for no reason at all and sometimes especially in Netflix the video has micro stutter meaning for about a second the image will freeze before playing again.  No matter what i do I can't fix it.  I've tried multiple routers I've tried signa boosters, different HDMI ports different TVs different USB cables for power...everything.  So its the device.If the device was $20 which is what I paid because I was a first wave buyer then it would be worth it despite the issues but at $40?  You are much better off saving money and buying a $25 chromecast.  I've never had any issues with a chrome cast and its easy enough that my mother who fan barely work a phone can use it.  In fact she likes it enough she bought a second one for her bedroom.  I bought her first.  She was going to buy a $100 box to do less so I jumped in and bought her the chromecast.  I figures the fire tv stick has too many issues and she would just get frustrated using it.-----original review below-----I got in on the first wave so my device arrived before Christmas and was only $20 so I can't be THAT mad about the bugs but I sure can post a review to warn you.The firetv stick has a bug in the way it handles WiFi.  This bug somehow causes routers to basically shut down.  It happens roughly 25% of the time I use the device which is only at night when I go to bed.When the device turns on and I load into say Netflix everything will appear fine.  I'll select a tv show and it loads up.  Then if I hit the show more episodes buttons POOF WiFi signal lost.  The problem is the WiFi signal is lost because the fire tv stick has somehow cause my router to crash.it also happens sometimes when loading the next episode and very rarely during an episode.  I'm using a premium level consumer router.  It has never had an issue before the firetv stick and the only time I have to reboot it is when using the firetv.It really makes zero sense.  I tried to report a bug but that was fruitless as amazon customer service just gave me the run around.  I have had this issue on 2 routers both from Cisco.  Both routers have the latest firmware as does the firetv stick as of 1/12/2015.Rebooting the router is a hassle as it requires me to.go back downstairs.  Its not a deal breaker but be warned it can happen and will make you curse this device.Other than that glaring issue its good for the price I paid.  It plays basic games and runs media apps I use to watch tv in bed.", "verified": true, "helpfulness": "0/1", "author": "Steve \"teamparadox\""}, {"rating": 5.0, "review": "worked seamlessly.  Set-up easy and quality perfect.", "verified": true, "helpfulness": "0/0", "author": "Technocrat \"FAP\""}]