[{"rating": 5.0, "review": "Love it! So easy - even I figured it out! Thank you Amazon as always for a really fine product!", "verified": true, "helpfulness": "0/0", "author": "Candy"}, {"rating": 5.0, "review": "Awesome device easy to use to update any TV with HDMI to a smart TV", "verified": true, "helpfulness": "0/0", "author": "BDL"}, {"rating": 2.0, "review": "The product description claims the fire stick is portable so you can use it in TVs all over your home. However, they fail to inform the consumer it is recommended that the fire stick be within 10 feet or LESS of the Wifi router. I didn't find this out until calling customer service because we were unable to get a decent connection for more than a few seconds on our family room TV (25 feet from the Wifi router). The product works ok on our TV next to the Wifi, otherwise it is useless.", "verified": true, "helpfulness": "0/0", "author": "Stephanie E. Dobrowolski \"Bridge Over the River Kwai\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Dave G."}, {"rating": 1.0, "review": "This fire stick was not as user friendly as advertised.  Also, the onscreen instructions are in German.  Also, I don't like having to pay 6 dollars to return something that I didn't have one chance in a hundred of getting to use.", "verified": true, "helpfulness": "0/0", "author": "Gil"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Dawn Polk"}, {"rating": 5.0, "review": "Best unit I have tried yet.  It is so intuitive that my 4 year old can navigate with ease.  Thanks for a great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It is great. My wifr loves it!!!", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 4.0, "review": "It works really fast! Nice productBut there isn't option for spanish language, this is the reason why I give it 4 stars", "verified": true, "helpfulness": "0/1", "author": "Alfonso Ros"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Joan A. Allen"}]