[{"rating": 5.0, "review": "awesomeit was very easy to use and it only took a second to hook up it was awesome", "verified": true, "helpfulness": "0/0", "author": "cheryl bivens"}, {"rating": 5.0, "review": "Just plug it in and wait for some updates and such.  But once that is done this thing is great!  We got the Fire stick so we could use Amazon Prime without the Xbox being turned on and off all the time.  I'm amazed that these things do so much for so little.", "verified": true, "helpfulness": "1/1", "author": "Erlach Family \"reader\""}, {"rating": 4.0, "review": "Great alternative to the Google or Roku sticks.", "verified": true, "helpfulness": "1/1", "author": "@glasswar"}, {"rating": 4.0, "review": "A lot to learn", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I got this to stream Amazon & Netflix at my cottage where I don't have cable.  I hooked up the fire stick & I couldn't get thru 2 minutes of a show on Amazon.  It would play 30 seconds, then spin for a while, then told me my bandwidth was too low for streaming, then more spinning, then blew out with \"network connection lost\".  Tried a couple more times with the same results.  Meanwhile, my ancient WII, laptop & kindle were all able to stream the same show flawlessly with no hesitation, on the same wireless connection at the same time the fire stick failed.  This is an awful product & I'm sending it back!", "verified": true, "helpfulness": "2/2", "author": "Barb Mathews"}, {"rating": 5.0, "review": "I have already had MANY HOURS OF TELEVISION ENJOYMENT with this. Movies and series, I am a prime  member on Amazon and also a subscriber of Netflix . If you have wi-fi you need this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We have a Fire TV stick and a Google Chromecast & like this one a lot more! The remote makes it easy to use and there are more app-viewing options than the Chromecast (as of now).", "verified": true, "helpfulness": "0/0", "author": "Erin Dimiceli"}, {"rating": 5.0, "review": "Best xmas gift ever !!!!", "verified": false, "helpfulness": "0/0", "author": "Xavier morales"}, {"rating": 5.0, "review": "This was easy to set up and works very well. Very happy with this item.", "verified": true, "helpfulness": "0/0", "author": "Brenda S"}, {"rating": 5.0, "review": "I simply love it. Fast no buffer.", "verified": true, "helpfulness": "0/0", "author": "reykeith s."}]