[{"rating": 3.0, "review": "Videos are choppy", "verified": true, "helpfulness": "0/0", "author": "Emily Joseph"}, {"rating": 5.0, "review": "I love it I'm still trying to figure a few things out but it's great I have no issue with buffering or the playback. It's great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "mariah"}, {"rating": 1.0, "review": "I don't usually write reviews, but this one deserves a thorough write up. I hope I just got a faulty stick, but it's no good from my vantage point. I installed it for my daughter, it was a birthday gift. we tried for an hour to improve streaming and picture quality, but no luck. The fact that I had to download the drivers or apps for each streaming service was frustrating. The following morning, I went out and bought her the other brand, you know, the one that is black and about the size of a hockey puck, from the best personal electronics company and the streaming and picture quality was what I expected and was used to on my home TV. It was great!  I was surprised and disappointed with the lack of performance and quality of Amazon's fire stick. We had planned to trade out our reliable \"hockey puck\" for this newer so called faster and better product, but for now, we will leave things alone as we have never found anything better than what we have been using. I can't get \"Prime\" on my other device and that's a bummer. Maybe Amazon will allow it one day.", "verified": true, "helpfulness": "1/1", "author": "marty \"mike\""}, {"rating": 3.0, "review": "Doesn't do anything your other devices don't do.", "verified": true, "helpfulness": "0/0", "author": "quin"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 5.0, "review": "Easy to set up easy to use", "verified": true, "helpfulness": "0/0", "author": "Nancy D."}, {"rating": 5.0, "review": "Love it! Better than my Apple TV at half the price", "verified": true, "helpfulness": "0/0", "author": "marguerite"}, {"rating": 5.0, "review": "This is an amazing little bit of technology for the price. DirectTV had lost the ability to access YouTube, where a lot of the educational programming my kids loved resided. Getting Fire Stick gave me back access to the YouTube channel to which I had subscribed AND opened up access to some really fabulous programming through Amazon Prime (worth the money you should subscribe.) They love Creative Galaxy and I love that they are learning things that will underscore their ability to read, think and create.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is by far the best I have tried! Much better than chromecast. I LOVE the remote option because it gives people the option to use it without having to have access to my phone that has the app!I only wish it had volume control and that you could turn the tv off with the remote. Maybe you can but I havnt figured it out yet. I love that we can turn the tvOn with it!", "verified": true, "helpfulness": "0/0", "author": "Luvmy4boys"}, {"rating": 4.0, "review": "Control stick is a bit light on useful features, but overall a good purchase.", "verified": true, "helpfulness": "0/0", "author": "William Warren"}]