[{"rating": 5.0, "review": "I love the fire stick. I replaced my chromecast with it. I'm going to get another one to keep I'm my suitcase for travel.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Happy with the device, my only issue is that the plug in adaptor that promotes the same wiring issues with any plug in device. I thought all that was required was the fire stick and remote. The adaptor line should be a bit longer.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 1.0, "review": "pretty poor. buggy as hell. video formats are a weakness, audio wise it can't handle many formats. would be perfect as it has 5ghz and ability to add Hulu & plea but poorly executed. lets hope there are updates to fix issues", "verified": false, "helpfulness": "3/4", "author": "ayaz fire"}, {"rating": 3.0, "review": "I didn't care for it, most of the movies that are on prime are old or pretty bad even the newer ones. The good movies were the one's you had to rent, at 4.99 it's the same as cable. I gave mine to me daughter, lets see if she likes it.", "verified": true, "helpfulness": "0/0", "author": "DDVA"}, {"rating": 5.0, "review": "I love my Amazon Prime account, but could never get Prime movies to play well on my HD TV.  The Fire TV Stick does it perfectly.  In addition, there are a host of free and inexpensive apps that bring news, entertainment and games to my TV - all with a device I plug into an open HDMI slot.The Fire TV Stick comes with an approximately 4-5\" HDMI extension so it can fit into the tightest HDMI slots and still allow you to plug the Stick into an external power source (power cord comes with the Fire TV Stick and is recommended for best performance).I also love that I can pull the Fire TV Stick out of my TV, put it into my pocket and take it travelling with me.  I don't even need to take the remote control because there is a great (free) remote control application for my Android phone that allow me to control the Fire TV Stick from my phone (using WiFi).Occasionally I need to reset the device when it freezes (very seldom).  Simply hold the center control button and \"play\" button simultaneously for about 6-10 seconds.  Then the device works perfectly again.  (Just like every other electronic device, it needs to be \"rebooted\" occasionally).The best device for my TV I've ever had.", "verified": true, "helpfulness": "0/0", "author": "Robert A. Bergman"}, {"rating": 5.0, "review": "So far so good, will know more after more use", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Works very well!", "verified": true, "helpfulness": "0/0", "author": "Lisa A. Placencia"}, {"rating": 5.0, "review": "Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Barbara Nichols"}, {"rating": 3.0, "review": "Got a strange blue screen \"content unavailable \" for the 1st two days I had it but had sound in all my movie apps on the stick.Took a ton of trouble shooting, port cleanings, power cyvles to just get it started. Had to shuffle the stick around in my home hdmi ports and power cycle it multiple times in order to finally see a show. Additionally to truly power cycle it I had to physically remove it from the port after unplugging the power supply as opposed to just unplugging the adapter. It would nit restart unless i did so. A real nuisance for my wall mounted LTD and Plasma. Had it for 3 days now and will amend review as updates come along. It's a \"beta\" stick for them so I hope for a more stable solution or off to Chrome I go.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Shipped as expected", "verified": true, "helpfulness": "0/0", "author": "parker Hand"}]