[{"rating": 5.0, "review": "I am in Heaven.  I absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Sardell"}, {"rating": 4.0, "review": "fire tv is awesome i wish more programs were free with my prime membership.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works pretty well most of the time. It loses connectivity with Amazon after using it for a while - anywhere from a few minutes to a few hours. Disconnecting it from my wifi and then reconnecting it gets it working again. In my equipment setup, reaching the unit to give it a power off/on reset is not practical. How about a software update to fix this, Amazon?", "verified": true, "helpfulness": "1/1", "author": "M. Moore"}, {"rating": 5.0, "review": "So easy to use and great replacement for expensive cable!", "verified": true, "helpfulness": "1/1", "author": "katie lynn bilbrey"}, {"rating": 5.0, "review": "Love the device. Works as stated. Do business with again", "verified": true, "helpfulness": "0/0", "author": "Rob A. Roy"}, {"rating": 5.0, "review": "The affordable cost and ability to side-load applications makes Amazon's fire stick the best choice of the available streaming devices.The stick requires power via a USB cord (which may come as a surprise), but the USB port on our TV provides enough juice so no extra outlet spots are taken up.The stick has been able to handle HD content well.  Most streaming content seems to adjust quality well when network speeds slow.  The only source we've had troubles with are on Hulu Plus app which hasn't played well on our speeds (throughput around 1.5 Mbps).Overall, I can't imagine the need to buy a different streaming device.  The Roku 3 has a headphone jack in the remote, which would be nice, but it's twice the price.  If you do a little research, you should be able to figure out how to do pretty much anything you would want a streaming device to do with the Fire Stick (except the headphone remote), and it's only $40.", "verified": true, "helpfulness": "0/0", "author": "Jessica Hood"}, {"rating": 5.0, "review": "I love it! great product", "verified": true, "helpfulness": "0/0", "author": "oh wing"}, {"rating": 5.0, "review": "Love it Works perfectly for me. It is a very nice addition to my setup.", "verified": true, "helpfulness": "0/1", "author": "Zeb \"zebra01\""}, {"rating": 5.0, "review": "I’m what you would call a media junkie. I love all things TV, movie, music and gaming. So, naturally, products like the Apple TV or the Amazon Fire TV are right up my alley. I was honored to test out an Amazon Fire TV and was thrilled to hear about the Fire TV Stick release. It’s amazing to me how such a small device can have so much power. Tiny, weightless hard drives that fit in the palm of your hand now take the place of the old 20 pound video cassette recorders of the 80s and 90s. The technology just keeps getting smaller and more powerful.Not having much experience with the ‘thumb drive media players,’ I wasn’t sure what to expect from the Fire TV Stick. What I found out the box was an incredible pint-sized device. It looks a lot like a USB thumb drive, but the input end is an HDMI cable. To get started, you simply plug the Fire TV Stick into an HDMI port on your television. It comes pre-registered to your Amazon account and is ready out of the box.The Fire TV Stick comes with a remote that is very similar to the FireTV except that it does not include the microphone for voice search. The Fire TV Stick is compatible with Voice Search, but needs the voice remote, which is sold separately.Once I plugged in the Fire TV Stick into our television, I simply went to the correct input on the TV and pressed the home button on the remote. The introduction is the same as the animation you see when you start the FireTV for the first time. And, the menu is the same as well. In fact, I have found the the Fire TV Stick works as well as, the FireTV box. I primarily use it for TV and movie viewing through apps like Netflix. Fire TV Stick has access to a massive amount of digital content. There are many apps available like Netflix, Amazon Instant Video, Hulu Plus, Crackle and YouTubeSo, what makes Fire TV Stick so much better than its competitors? The answer is in the stick. Fire TV Stick has a dual-core processor, up to 1080p HD, certified Dolby Digital Plus surround sound, Dual-band (MIMO) Wi-Fi, and 8GB storage. It’s fast and fluid from its interface to streaming video. With the Fire TV Stick’s VideoCore4 graphics engine and 1 GB of memory, there aren’t many media devices that can touch it. It does require outside power from either the USB port on your television or the included power adapter. I would recommend using the power adapter because some USB ports are underpowered and you could experience a lag when trying to move through menus or view programs using your Fire TV Stick.If you are looking for a media player, I can highly recommend the Fire TV Stick. It’s quick, responsive, affordable and can’t be beat by its competition. To be honest, I always saw ‘stick players’ as a secondary media player, but after using the Fire TV Stick, I would choose it over media player boxes for most of the TVs in my home. It’s got such a small footprint, easy installation and works so well.\"This product was received at a free or discounted price in exchange for my review. I am a technology journalist and pride myself on providing fair and honest reviews. Please feel free to ask any questions you might have.\"", "verified": false, "helpfulness": "26/26", "author": "Nicholas Calderone \"Senior Editor, Co-Founder of MacSources\""}, {"rating": 5.0, "review": "Really haven't used it much but it seems to work great--have other friends that love it too!!", "verified": true, "helpfulness": "0/0", "author": "Deborah Stephens"}]