[{"rating": 3.0, "review": "It's handy, but unless you have a prime membership or a cable provider there is not a lot on there for free. Also the remote either stops working or the buttons stick and doesn't stop moving on way or the other.", "verified": true, "helpfulness": "0/0", "author": "nutiket02"}, {"rating": 5.0, "review": "hoodoo", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It is quick to setup, but it keeps freezing to load, complain about Wi-Fi too slow. My Chromcast does not have this issue. So I do not know what is up... But the kids are having a blast watching all the kids shows.", "verified": true, "helpfulness": "0/0", "author": "Nabih A."}, {"rating": 5.0, "review": "I already had the fire box. But the fire stick is so much easier to carry and use wherever you go.", "verified": true, "helpfulness": "0/0", "author": "tommie sanchez"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Mrs. t"}, {"rating": 5.0, "review": "Love everything about the Fire TV stick, much better reception than I had on my smart TV alone!", "verified": true, "helpfulness": "0/0", "author": "DiW \"Bookworm\""}, {"rating": 5.0, "review": "I couldn't make the decision between the Chromecast and the Fire Stick so I bought both. i like both, but I think most people will like the UI built into the Fire Stick. It is very intuitive. Product is a hands down winner if you are a Prime customer.", "verified": true, "helpfulness": "0/0", "author": "Michael Melendrez"}, {"rating": 5.0, "review": "Love it more than my apple TV", "verified": true, "helpfulness": "0/0", "author": "Paul Moon"}, {"rating": 3.0, "review": "Had to return Firestick.  Only Internet service we are able to get at our house is by dish service therefore it was not compatible.  When we tried to watch something it kept stopping and buffering about every 3 to 4 minutes.  Not very conducive to enjoying movie.  Weird thing is, I can watch a movie on my computer without it doing this.  I use the same Internet service for my computer.  Go figure!  My daughter has one and is on a cable internet service where it ces into her house via an actual cable and it works fine and she loves it.", "verified": true, "helpfulness": "0/0", "author": "Dorothy Thomas"}, {"rating": 5.0, "review": "So far the Fire Stick has been great.", "verified": true, "helpfulness": "0/0", "author": "D. Kepler"}]