[{"rating": 5.0, "review": "I love the Fire Stick!  It was easy to set up and use.  Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "earlydog \"Earlydog\""}, {"rating": 5.0, "review": "bought it for my daughters tv in her room because we do not use cable tv only internet services like hulu amazon and netflix.  This works great!", "verified": true, "helpfulness": "0/0", "author": "terah"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Shopper"}, {"rating": 5.0, "review": "Works Great!! Lots of apps!!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Miller"}, {"rating": 5.0, "review": "Love it. We have a smart tv but this loads much faster.", "verified": true, "helpfulness": "0/0", "author": "Sandra Kennedy"}, {"rating": 5.0, "review": "It is very efficient", "verified": true, "helpfulness": "0/0", "author": "Torrence Herring"}, {"rating": 3.0, "review": "WatchESPN will not work with FireTV unless you already have a Cable TV subscription.  This is misleading in the marketing material.  I realize HBO and Showtime would require subscription.  ESPN was a little more of a surprise.", "verified": true, "helpfulness": "0/0", "author": "Watchful Consumer"}, {"rating": 5.0, "review": "Very easy setup. It basically does everything for you. Also very simple to use. Apps are great and you can find about any movie you want to see with lots of shows available. Highly recommend this to everyone.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "Let me start by saying we had a Chromecast for almost a year before it died. It was a pain and we had to reinstall the phone app several times and frankly, it was unreliable with the wireless.To watch anything on Prime required using the desktop computer  and doing some weird thing to make it cast to the Chrome-thingy (and whatever it was took me hours to figure out because I totally suck at this tech stuff) and it was a sucky experience all around. After cutting the Comcast cord (YAY!) and having a dead Chromecast, we needed some after market product to watch anything on our TV set. Enter the Firestick. It arrived early and while I finished cooking dinner, the hubs had it set up in less than 5 minutes. No apps to download or weird configurations to deal with - it was ready out of the box.  Even *I* could have set it up (I can't even set up the printer). The most cumbersome part was entering the wifi password. Now we can EASILY watch Netflix or Prime. The Netflix has all our family profiles ready to go. Oh, and the Prime Music is like karaoke - the words flash on the screen as the song is playing. Eventually we'll order HBO Now and we're set! The remote is kinda tiny and I'm wondering when it'll get lost (replacements are $15 or fancy voice ones are $30) but I am EXTREMELY happy with this purchase. I thought we were going to get an Apple TV (for the HBO Now) and I was THRILLED when it was announced we can get it on the FireStick. Great purchase!", "verified": true, "helpfulness": "0/0", "author": "Thrilled Mama"}, {"rating": 4.0, "review": "haven't yet fully checked all the possibilities but very satisfied", "verified": true, "helpfulness": "0/0", "author": "Whitedogdaddy"}]