[{"rating": 1.0, "review": "can't mirror laptop .. Firestick sucks..", "verified": true, "helpfulness": "0/1", "author": "Pengfei Yang"}, {"rating": 4.0, "review": "Good, but needs HBO Go added.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Except for my \"slow internet connection\" it worked great.", "verified": true, "helpfulness": "0/0", "author": "Animallover \"Adopt a friend for life.\""}, {"rating": 5.0, "review": "Setup was a breeze. Works well.", "verified": true, "helpfulness": "0/0", "author": "Venkatesh"}, {"rating": 4.0, "review": "Great device - especially if you are using the Amazon features.The search on the Netflix app hangs often (you just back out of it) so I've had to use Netflix on a computer to add items to my list.Really wish VuDu was on the box, as I have a huge library there, but I can see that it's competition for Amazon's digital streaming service and probably will never be offered.", "verified": true, "helpfulness": "0/0", "author": "ChrisL"}, {"rating": 5.0, "review": "So easy to use.  Provides so much entertainment with Netflix and Pandora as well as games and other apps.", "verified": true, "helpfulness": "0/0", "author": "Laurie Thomas-Sweatt"}, {"rating": 5.0, "review": "Super slim gadget that pops right into your HDMI port.  I was up and running with Amazon Video and Netflix within minutes.  It had to run through the typical updates, but it was completed in 10 minutes.  What I love about Amazon's \"Fire\" line is the super sexy, classy packaging.  I thought Apple had the market cornered on presentation, but Amazon \"Fire\" is taking over in this area. I love the black packaging with 'Fire' orange accent.  Remote is very light and small.  Love the fact that the up/down/side to side circle bar on the remote is big enough for a good \"press\" of the fingertip.  Way to go again, Amazon!", "verified": true, "helpfulness": "0/0", "author": "PussyCatMalone \"Feline325\""}, {"rating": 1.0, "review": "It is very hard to use the fire stick if you want to view shows on Netflix. The system does not retain your log in data therefore you have to go through the paswords etc each time you want to use the  fire stick to view Netflix. this is NOT true of ROKU . Fortunately i have 3 Roku units", "verified": true, "helpfulness": "0/0", "author": "J. malone"}, {"rating": 4.0, "review": "A bit slow but like the features.", "verified": true, "helpfulness": "0/0", "author": "Meng Zhao \"optimize\""}, {"rating": 4.0, "review": "How could so much greatness be put into such a small stick for such a small price? It seems impossible.", "verified": false, "helpfulness": "0/0", "author": "jonathan"}]