[{"rating": 5.0, "review": "Love, love, love this.", "verified": true, "helpfulness": "0/0", "author": "Erin O."}, {"rating": 5.0, "review": "Awesome device.  Better than Roku.  Easy to move from device to device.", "verified": true, "helpfulness": "0/0", "author": "Bueno"}, {"rating": 4.0, "review": "I liked the ease of installing it.", "verified": true, "helpfulness": "0/1", "author": "med"}, {"rating": 5.0, "review": "I like the fire tv stick as i can now use the mirror function and get more use of the Prime movies", "verified": true, "helpfulness": "0/0", "author": "M. Arcy"}, {"rating": 5.0, "review": "Awesome device! Very easy to install and use.", "verified": true, "helpfulness": "0/1", "author": "V"}, {"rating": 5.0, "review": "Really like the Fire TV stick. Exceptionally easy to set up and use and the quality of the video is excellent. Makes it easy to get to the right content - also can use apps on your phone to control it - all-in-all a well thought-out design. Programs available on Amazon Prime just keep growing and getting better. A great benefit when combined with Prime shipping, feels like a plus-up!", "verified": true, "helpfulness": "0/0", "author": "C. Norris \"afishionado\""}, {"rating": 5.0, "review": "I love this product!! Super easy set-up,very user friendly! You can download Netflix and Hulu and stream all your favorite shows. Also a lot of great shows to choose from if you have Amazon Prime. I don't have cable so this is a great low-cost way for me to enjoy great T.V. with many more options!!!", "verified": true, "helpfulness": "0/0", "author": "clemsongirl"}, {"rating": 5.0, "review": "Easy to set up, perfect for bedroom TVs, as we purchased it for.", "verified": true, "helpfulness": "0/1", "author": "Lisa M. Wolfe \"LisaMarie\""}, {"rating": 4.0, "review": "Works very well but I have experienced some glitches. Remote suddenly will go into a scroll mode and go through multiple pages. Some slow response issues.", "verified": true, "helpfulness": "0/0", "author": "Gregg \"westernwizzard\""}, {"rating": 3.0, "review": "It has potential.  I like the simplicity to it. It does however lose my wifi connection on a regular basis despite my many Apple TVs not losing it.  Video quality is often not quite as good as my Apple TVs too.", "verified": true, "helpfulness": "0/0", "author": "BRANDON"}]