[{"rating": 2.0, "review": "I tried to like this but after months of use, I'm ready to give up. The device lags, skips, and freezes often. Yet those aren't the reasons I'm most disappointed. It would be great if I only watched Prime shows since the setup is geared toward Amazon. But watching via other apps is tedious because you must click through so many categories to get to them; it’s almost like a game of hide and seek.  A simpler layout would be a REMARKABLE improvement. Then Amazon must work on the problems with freezing, etc. Until then, I’m going back to my old Roku box.UPDATE: Today (June 20, 2015) I finally couldn't take it anymore and reconnected my old Roku box. There are some nice features to the Fire stick and my teens like the game apps, but none us could continue to tolerate the consistent freezing of the picture ... while the audio continued. It was interesting watching the speedy motion as the picture moved to catch up with the audio, but not enough to continue with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "NanC"}, {"rating": 5.0, "review": "The Best. Better than google cast, roku and anything else.", "verified": true, "helpfulness": "0/0", "author": "Simon"}, {"rating": 5.0, "review": "Still evaluating", "verified": true, "helpfulness": "0/0", "author": "harold minnett"}, {"rating": 2.0, "review": "I'm giving this 2 stars because after a few months, the remote started acting up. It will jump down 2 or 3 categories at a time and I have to hit the up button to go back up to the category I want...very irritating. Other than that, it works ok", "verified": true, "helpfulness": "0/0", "author": "GhostofFlorida"}, {"rating": 2.0, "review": "Cannot access my hbogo because I have Comcast, I will be returning.", "verified": true, "helpfulness": "0/0", "author": "Linnea Clark"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Sondra"}, {"rating": 3.0, "review": "I have mix reviews... The first weeks it was working properly, I like the apps and everything that offers.but now stops working many times, I have to disconnected the device and connected it again in order to work.also I wish the font was bigger and I tried to get the appI'll try Chromecast I hope is better", "verified": true, "helpfulness": "0/0", "author": "Gloria"}, {"rating": 5.0, "review": "Just got this device this weekend I have to say this is very excellent device. I bought this to sideload XBMC on it and it worked like a charm :P The best thing about this device is that it can do what Chromecast does AND so much more provided that you sideload apps to give it those features to handling mirroring.One disadvantage about owning this device is that you need to be an Amazon prime member to unlock lots of the native apps. However if you sideload XBMC which is a free app...who needs to be an Amazon Prime Member?? lol. :P", "verified": true, "helpfulness": "0/0", "author": "Kevin Cooper"}, {"rating": 5.0, "review": "Awesome product. Works right away once you plug it in. Amazon preloads all of your account info so all you have to do is enter your password. Once you do that a help video starts right up. Not that you need it, it is pretty simple to use. The interface is simple and clean.Plus it is way more capable then the chromecast and roku stick for around the same price.", "verified": true, "helpfulness": "0/0", "author": "nloco"}, {"rating": 2.0, "review": "cant even watch a show without it constantly freezing. I am really disappointed, I wanted to LOVE this device but unfortunately the wifi issues need to be worked out first. Maybe I'll try again later. For now, I will return and try the Roku (never used before), and hope for better functionality", "verified": true, "helpfulness": "0/0", "author": "Brittany J. Ashley \"brickhouse\""}]