[{"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Leandro"}, {"rating": 1.0, "review": "The Amazon ads states, \"The Amazon Fire Stick, Works Everywhere, Everytime.\"THIS IS FALSE ADVERTISING, I'M IN SOUTH AMERICA AND NOTHING ON INSTANT VIDEO WORKS, AND I AM A PRIME CUSTOMER.", "verified": true, "helpfulness": "1/1", "author": "nthany"}, {"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/0", "author": "Alfredo"}, {"rating": 5.0, "review": "I ABSOLUTELY LOVE IT!!!!For those who do not have a smart TV, this works wonderfully! First of all, the product was properly packaged and arrived the morning of the due date, which was great because I was leaving work early that day; therefore, I was able to take it home immediately. It only took me approximately 5 minutes to connect and load Netflix and HULU, and SHAZAAAAM!!! Plus, the Fire TV Stick makes it much easier to watch movies when at home on Amazon Prime than before. I purchased two, but will definitely purchase another.", "verified": true, "helpfulness": "0/0", "author": "Firemom94"}, {"rating": 5.0, "review": "Fantastic product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to setup!  Easy to use, and works exactly as expected and described.  It serves the purpose that I needed it for, and I've been using it daily since I received it.  I really only use it to watch Netflix and Amazon Prime.  I haven't tried playing any games, nor will I.  But the Fire stick is a great and inexpensive way to be able to watch Netflix and Prime on my TV instead of my iPad.", "verified": true, "helpfulness": "0/0", "author": "Khalidah Taylor"}, {"rating": 5.0, "review": "I love it it's great Chris fitzgerald", "verified": true, "helpfulness": "0/0", "author": "Chris Fitzgerald"}, {"rating": 4.0, "review": "I love it, I just wish I could of try amazon prime, It said free for one month but was not able to sign up for it. Still I'm considering buying another one as a gift for my son.", "verified": true, "helpfulness": "0/0", "author": "Maria Cisneros"}, {"rating": 5.0, "review": "Nice!", "verified": true, "helpfulness": "0/0", "author": "joanne m. talone"}, {"rating": 5.0, "review": "very good one", "verified": true, "helpfulness": "0/0", "author": "Kenny Lieu"}]