[{"rating": 4.0, "review": "Glad I got it, especially at the intro price of $20. Have intermittent connection issues with the ESPN app. Amazon prime content has been bug free so far. It's nice to see on the big screen. Love to hear my music library on the tv speakers.", "verified": true, "helpfulness": "0/0", "author": "Robin S."}, {"rating": 5.0, "review": "Due to the number of comments regarding my purchase experience I will update this review.First off, I am glad I was one of the early adopters of this gadget, as I did get it half price during the promotion.My family has cut the cord and we just use internet services and local streaming of our own movies such as:NetflixAmazon Prime StreamingYouTubeHulu Plus (actually cancelled, I dont like ads)Pandora music (free, great for parties)Amazon Music streamingThe good+Streaming works great for all apps tried,+Interface is fast and very powerful for such a small device.+The 2-3 second boot up for Netflix films isn't terribly noticeable+lots of options+game apps work relatively well with any bluetooth controller, but are limited graphically (still, there are some cool games for it) It's never going to be a gaming console, but you can play a quick round of Tetris while you wait.The bad-No easy way to directly stream content to the stick/TV a la Chromecast. As I've said-- I'm thrilled watching streaming services and local content, but I havent found a way to mirror a web browser or tablet screen onto the device. For me, that is inconsequential. For others, that may be a game breaker. Just know what you are in for.It's basically an elegant stick for a cheap price that does everything it does well. It's beefier than all the other \"stick\" form factor streaming devices, but weaker than all the \"box\" streamers (duh). It's missing a couple of features that not many people will notice. It's also held back by the (intentionally?) bad UI within the Amazon Streaming App. Still, this was the best purchase I've made this year at $20 and at $40, it would still be worth it.Original Review:Poorly executed,I placed my order before Halloween, I will not get after thanksgiving, Christmas or new years, but on Jan 9.Shame on you Amazon.", "verified": true, "helpfulness": "0/12", "author": "Smithers"}, {"rating": 1.0, "review": "Very, very buggy.  Hard to watch for more than a few minutes before it reboots, if you're lucky, or simply powers off.  In the latter case, the USB power source must be unplugged and plugged back in.During playback, the screen flashes a lot, including odd green stripes.Yes, it has the latest firmware.  Yes, it's being powered externally.  Yes, I have a high-speed and very, very reliable Internet connection.  I have a much older device, a Logitech Revue, that performs flawlessly.It's a great idea, but the execution seems very, very flawed.  Not worth it even at the $25 Best Buy price.  Going back as soon as I have a chance.", "verified": false, "helpfulness": "0/1", "author": "Lynne Whitehorn-Umphres \"-Lynne W-U\""}, {"rating": 3.0, "review": "I just hooked my stick up tonight and it is OK. Not great, but OK. It was easy to setup, only took about 20 minutes. The prime videos I played to test it out looked good and sounded great with my LG bar. However and this is something I have found with RoKu 3 and even the Fire TV box. The movies or shows I play have a jump to them. It's better on the Fire stick but still there and bugs me.When I was setting up Netflix the remote went nuts on me and tho I would only push it one over it would go 4 or 5 letters over. The remote is doing it more and more as I use it. So I don't know if mine is defective or if this is normal. I will have to do some research. Either way it has to go back to be replaced or refunded.Not sure I will keep the fire stick or not. It is only slightly better then RoKu 3. I don't know why I can get such a great video playback on the PS3 or my Wii U but sticks like this or even boxes just seem to jump and make me feel like I am having some kind of a Seizure or something. Maybe there will be an update to make it work better. Anyone else having the same issues?", "verified": true, "helpfulness": "0/0", "author": "WhosYourChubby \"Kristopher Michaels\""}, {"rating": 2.0, "review": "UPDATE:I found a fix that someone posted on the Amazon forums.  I'm going to put it in here so that anyone else who has similar issues will hopefully run across it.  If you've got an Onkyo receiver, give this a try:\"Before plugging in the Fire TV Stick, change to the input you want to use, then press:Receiver-->Home-->Setup-->Choose Source Setup-->Picture Adjust-->Picture Mode-->Set to Direct (not Auto)\"It worked for me, and the Fire TV Stick works with my receiver now.That being said, after actually using the stick, I'm returning it anyway.  The wifi is too unreliable -- watching Netflix or Hulu, it regularly stops to buffer the video, and sometimes even cuts off completely saying it has lost its connection.  The thing is, my Fire TV Stick is literally right next to a Playstation 3, and the Playstation 3, despite only having wireless G support, plays video from both services just fine without any network issues (the Fire TV Stick supposedly has wireless AC, and the router that both are connecting to is a new model Apple Airport which supports AC -- if anything, I'd expect the Fire TV Stick to be better, but that's not the case).Basically, at this point, I'm done with this thing.  It's *way* too much hassle.  I'm going to bump my review up from 1 star to 2 stars because at least it is (barely) functioning now, but even doing that feels like I'm being generous.----------------------ORIGINAL REVIEW:The Fire TV Stick is a great idea which was horribly botched in execution.  I've been using a PS3 for all of my streaming media, but when Amazon offered this up to Prime members for $19, I thought it would be a great way to offload those functions from the game console and save some wear and tear on it.  Unfortunately, it's not going to work out, so I'll be sending it back.I'll start with the thing that was the absolute deal-breaker for me first -- apparently, it can't be used with a surround sound receiver.  When I plug the Fire TV Stick directly into an HDMI port on my television, it works just fine.  When I plug it into an HDMI port on my receiver (a fairly recent, high-end Onkyo), I just see a message from the TV telling me that no signal was detected.  I even tried plugging it into the same port that my PS3 is usually plugged into, to make sure that it wasn't a problem with a bad port -- no dice.  I called Amazon customer support, and after being led around in circles for 40 minutes (seriously, I asked for Fire TV Support, why am I being forwarded to Kindle Support?), I finally got my answer -- \"The Fire TV Stick is only designed to be plugged directly into an HDTV.\"  What?Sorry Amazon, that's not going to cut it.  I've invested in a good surround sound system, the last thing that I want to do is hear all of my streaming media through my TV speakers.  And even if I were to set up the TV to pass its audio signal to the receiver (which I *might* be able to do -- I honestly haven't looked into it), I'd still have the problem that it significantly complicates my HDMI switching -- now instead of just doing all of my switching on the receiver, I have to do some of it on the receiver and some of it on the TV.  I can even see myself getting confused by that sometimes, and I know my girlfriend and her daughter wouldn't know what to do with it (they have a hard enough time with just the receiver).  Hey Amazon, what on earth were you guys thinking by not making this receiver comaptible?So with that, Amazon is getting it back.  Better luck next time.I did, however, complete the setup while I had it connected to the TV, and noticed several other issues as well.  I don't think any of them would have been absolute deal-breakers like the receiver issue is, but they were definite inconveniences at the very least and are worth knowing about if you've gotten this far and are still thinking of buying one of these things...1. First of all, Amazon has apparently never heard of hidden wifi networks.  I know, I know, the \"security\" that provides is limited at best, but still, when I can set it up that way, why wouldn't I?  But when I first plugged the Fire TV Stick in, I got a screen with \"Connecting to Network\" header at the top, and then a \"Searching for Networks\" notice in the middle of the screen.  Then, after a moment, the notice went away and other than the header, the screen was completely blank.  Not even an error message.  Pushing keys on the remote made it make clicking noises through the TV speaker, so it wasn't totally frozen, but nothing at all happened.  Finally, after going through this a couple of times, I finally turned on SSID broadcasting on my router, and only *then* the Fire TV Stick was able to pick it up.  Seriously Amazon, it's 2014, by this point you should have the \"other network\" option to enter an SSID that pretty much every other device out there has had for years now.  To the Fire TV Stick's credit, I turned the SSID broadcasting back off after configuring it to connect, and it was able to maintain its connection after that.  But still, geez...(Worth noting also, if you have your router configured to only accept connections from a defined list of MAC addresses, you'll have to turn that off until you have the stick configured too, as nowhere on the packaging or the stick itself is the MAC address of the device listed.  This is a more common oversight by hardware manufacturers, but still...)2. My girlfriend and I share an Amazon Prime membership through Amazon's household members program -- which is great, but which causes several issues with a device like this.  So, even though we share the Prime membership, we both have separate Amazon accounts because we have separate finances.  For various reasons that aren't relevant here, the primary membership is on her Amazon account.  Since Amazon only allows the primary membership holders access to the free Amazon Prime Video, that means that the stick has to be registered to her account.  Which is fine for the most part, except that when it comes to actually buying content, I'm the one that's far more likely to be doing that.  So we're stuck in a dilemma...  Register the stick to her, and I can't watch any of my purchased content.  Register the stick to me, and we can't watch the free Amazon Prime Video.  Ultimately the free option is the more important one to us, so that's the way we'd go, but Amazon is shooting themselves in the foot by essentially cutting off video sales to me.  Amazon, you need to either make the free Amazon Prime Video available to all members on the Prime account, or you need to make your devices and apps able to support multiple accounts.3. Along the same lines, this issue also causes a problem with the Amazon Cloud Player music.  Again, I'm the one more likely to be buying music from Amazon, both as CDs with the auto rip included, and as direct digital purchases.  But, of course, since we have to have the device registered to her account for the Prime Video, that means I can't play any of my purchased music on it.  Not only that, but apparently you're only allowed to change the registered user for the music section once every 180 days (who came up with that nonsense?) so I can't even manually switch it to my account to use it.4. Scrolling through the interface seemed sluggish compared to the devices that I'm used to.  I've read in other reviews that this is a problem initially that goes away after some use (maybe it's buffering a lot of data or something early on?), but I didn't use it for long enough to be able to confirm that one way or the other.  It wasn't unusable by any means, but it was a little off-putting.5. The interface is clearly designed to sell you Amazon video content.  Which, ok, I get it, it's an Amazon device, but still...  I'm going to be honest, my priorities are Netflix and Hulu.  To even get to those apps, you have to do some significant scrolling, and if there was any means of rearranging the user interface to move them up, I didn't see it.  I looked for the Spotify app and couldn't even find it (to be fair, I didn't spend a *long* time searching, but you'd think that a service that major would be a little more prominent).All-in-all, the receiver issue was, as I said, an absolute deal-breaker for me.  Even if it weren't, those other issues would have significantly soured me on the experience.  Time to send this one back to the drawing board Amazon!", "verified": true, "helpfulness": "5/8", "author": "Matt"}, {"rating": 4.0, "review": "Pretty good! Sideloaded Kodi on it, and it works great!", "verified": true, "helpfulness": "0/0", "author": "J Man \"electro-geek\""}, {"rating": 4.0, "review": "I like the Fire Stick but I am really unhappy with Subtiles showing on my screen when watching movings on Netflix and there doesnt seem to be a way to turn this off using Fire Stick. If this i am unable to turn this off i will not keep this device. Other devices make it really easy to turn this feature off. I dont want to see writing on my screen while watching movies.", "verified": true, "helpfulness": "0/1", "author": "J."}, {"rating": 5.0, "review": "Just received my fire stick today.  loving it so much.", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 3.0, "review": "Its okay. But the app store has too little apps to download", "verified": true, "helpfulness": "0/1", "author": "Reviewer101"}, {"rating": 1.0, "review": "This device can best be described as \"broken right from the get go\". Here is the reason why (this is just my personal experience and others may or may not have experienced the same):-Being a Prime member, Fire TV Stick was available for pre-order at a more-then-decent price of $29.94. I have been on a look out to purchase a streaming device for all my digital content and this didn't seem like a bad deal to try out. I put in my pre-order and I was immediately informed of the expected delivery date. The item arrived a couple of days early.Problem#1: The shipping box inside the delivery package was open already. Even though it was inside the plastic USPS envelop, the packaging looked rushed to me. Carelessness at Amazon's part.Problem#2: The original Amazon Fire TV stick box (that contains the Stick and rest of the contents) was shiny and glossy. However, it was scuffed on one side as if someone already tried to tear it open. Again, careless handling, but not a deal breaker \"so far\".Problem#3: Ignoring all the minor issues, I took out the stick, plugged it on to my TV's HDMI input and connected the power adapter to the wall socket. The Amazon splash screen came on immediately. At this point, I was prompted to connect to a wireless connection. It detected my home WiFi right away and after putting in the passkey, it showed \"connection successful\". The next thing it did was to check for updated software and it sat there for 15 mins before failing. The error message was \"cannot connect to Amazon services. Please check your internet connection or contact us for support...\".Problem#4: At this point, I did what any layman would do. Unplugged the stick, unplugged power adapter and plugged in again. Same problem.Problem#5: After jumping through these hoops couple more times, I decided to get help from support. Started a chat session with an agent and after learning about my problem, he told he needed to have someone from the tech support team call me. Received the call right away. The person on the phone sounded like a harassed kid with a weird accent. He could barely sound relevant and seemed to have little knowledge of how to troubleshoot this device (I am a software professional myself and know a thing or two about hardware as well). He asked me to powercycle the stick (see #4 above) which I did,except that this time he asked me to wait for atleast 2 mins before plugging the stick back in. This time, the set up process went a little further while the technician was still on the phone with me.Problem#6: The technician wanted to stay on the call while I made sure everything worked (appreciated!). After I finished the set up of my account, it played a Welcome video. After the video finished playing, it tried to load the \"home screen\" where it shows the list of movies and videos. Error! 'Unable to connect to amazon services. check your internet connection or try again later\". Told the same to the technician. He suggested to reboot my internet router and modem. I reluctantly did the same and the next moment, my internet stopped working. Did Fire TV stick break my internet? As per the technician, I should call my internet provider and he'll check back in a day or so.Problem#7: Disconnected the Amazon support call and called my internet service provider. After spending a couple of hours with different people, finally got my internet to work. Checked it by connecting all my devices (iPad, smartphones and two laptops). Everything checks out fine. Excited that things are working, plugged the stick back in to my TV, connected to my internet and viola, the home screen loaded successfully. Decided to do a search for a TV show I like but the search failed with the exact same error message as prior! I am streaming Live TV on my laptop as I write this review which means I have internet connectivity and there are no problems with it. However, the Fire TV stick is able to connect to my home connection for a few moments and then gets disconnected. It somehow can't stay connected and the only way I have had it connect so far is to power it off, power on again and connect to the network. That too for just a few moments.I am so disappointed in this product that I'm thinking of returning it back and getting a ROKU instead. At least, I'll have peace of mind and I'll get the services I was charged for.", "verified": true, "helpfulness": "2/4", "author": "MuqadderzKindle"}]