[{"rating": 5.0, "review": "Love my Amazon fire stick.!", "verified": true, "helpfulness": "0/0", "author": "Cheryl Greaves"}, {"rating": 5.0, "review": "Amazon Fire TV Stick is very easy to use. Because I have a Prime account it came already knowing my info. So I just had to plug it in and let it find my WFI and off we went. Love it.", "verified": true, "helpfulness": "0/0", "author": "D. Hansen"}, {"rating": 5.0, "review": "So worth the money.", "verified": true, "helpfulness": "0/0", "author": "Caity Matthews"}, {"rating": 1.0, "review": "I bought the Fire TV Stick as I thought it might be the next generation Chromecast, which I have had for about a year. The Chromecast is easy easy easy to use, and I love it. The Firestick is difficult, complicated and unpleasant to use. When I compare the two on a scale of one to ten, I give the Fire Stick a one and the Chromecast a 9.5. I finally just threw the fire stick out. So DON'T BOTHER WITH THIS PRODUCT. IT IS A LOUSY PRODUCT. Buy the Chromecast instead.", "verified": true, "helpfulness": "0/0", "author": "Laura E."}, {"rating": 3.0, "review": "Lack of Youtube support is a major downer for me.", "verified": true, "helpfulness": "0/0", "author": "Vasudevan Nagalingam"}, {"rating": 2.0, "review": "I don't know what Amazon was thinking with this \"feature\": I was in the middle of watching a movie in the Netflix app, and the Fire TV Stick decided that it was time to install a system update... so it did so, without asking permission, shutting down Netflix, installing the update over several minutes, and rebooting.  In the middle of the movie.  Without asking if I'd like to do it now or later.This thing has ONE job: to let me watch stuff.  And it failed.", "verified": true, "helpfulness": "0/0", "author": "Nate Lee \"Nate\""}, {"rating": 5.0, "review": "I like the fact I can move this from TV to TV.", "verified": true, "helpfulness": "0/0", "author": "Julie Felder"}, {"rating": 5.0, "review": "Great device, it made me rethink my cable package.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Not work instant video in argentina or other place than usa..where do you inform in your advertisment...disgusted", "verified": true, "helpfulness": "0/0", "author": "Nicolas Mantelli"}, {"rating": 5.0, "review": "Love it. Bought it for myself, but my husband took it downstairs and liked it so much he says I can't have it back. Will get another one for my TV upstairs. I'm a little worried about our internet streaming 2 shows at the same time. That is our internet provider though, the fire stick could do it with no problem.", "verified": true, "helpfulness": "0/0", "author": "Alicia M."}]