[{"rating": 4.0, "review": "Amazing product did everything that was advertised and then some working great... Wifi is also really good on range and connectivity", "verified": true, "helpfulness": "0/0", "author": "Robert Letourneau Jr"}, {"rating": 5.0, "review": "Easy to install and use. No bulky wires  good choice of movies, to enjoy", "verified": true, "helpfulness": "0/0", "author": "Carol Tortorice"}, {"rating": 5.0, "review": "The fire stick works flawlessly. For minimal fee you can purchase an app to stream CNN and other old cable or large company provider high dollar paid TV for channels you never watch. Great purchase for anyone with DSL or other high speed internet. Full 1080p too.", "verified": true, "helpfulness": "0/0", "author": "Gordon Reed"}, {"rating": 1.0, "review": "It stops streaming randomly! Goes into a totally white and green pixelated view. It's just not a good product in the slightest!! Will be trying to return this tomorrow.", "verified": true, "helpfulness": "0/0", "author": "CASEY ROSS"}, {"rating": 4.0, "review": "owhat are  codes..........'...pleas help me usemy Fire  tv stick", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "put it in the kids room and now they have a \"smart\" TV :)", "verified": true, "helpfulness": "0/1", "author": "Amanda Faulk"}, {"rating": 4.0, "review": "We've been using this for about a month now. Excellent product, but it's been having some network errors lately.Bandwidth hog.", "verified": true, "helpfulness": "0/0", "author": "D J and C"}, {"rating": 5.0, "review": "Very nice!  We love our Fire TV Stick and often have family \"discussions\" about who gets to control it. The remote travels around the room and sometimes gets displaced. Luckily the phone app works extremely well and allows us to always be in control. This is a great product and has quickly become something our family can't live without.  Well made, incredible quality, very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Rachael D"}, {"rating": 5.0, "review": "A little disappointed that there's additional subscription costs. It's very convenient for a stay at home weekend. It's very easy to set up, but took a little longer than expected in programming information. I have limited, but maximum internet service and the usage runs out quickly. I'm having to go without using the stick for a month.", "verified": true, "helpfulness": "1/1", "author": "treasure_tramp"}, {"rating": 5.0, "review": "I love it. Thank you", "verified": true, "helpfulness": "0/1", "author": "Arthur Thomas III"}]