[{"rating": 5.0, "review": "Wish that I had purchased it sooner. Works great with no hassles", "verified": true, "helpfulness": "0/0", "author": "Barbara King"}, {"rating": 2.0, "review": "Cumbersome interface, lack of options, massively outdated apps.  I bought this primarily to watch Youtube videos so I set it up and installed the Youtube app.  The interface is terrible and it shows me exactly -3- videos to watch from my subscribed channels (I'm subbed to dozens and dozens of channels) and those videos are all a year old.  I dug around and determined this Youtube is ver. 1.0.7 on the Fire Stick.  By comparison, the version on my Galaxy S4 is 5.17.6.  Yes, the version can vary from device to device but there is no reason on any level for the version Amazon offers to be so old.  This is a clear dodge on their part to push their ecosystem and content.  \"Hey!  We offer Youtube!\" (we don't tell you its so old that it is beyond gimped.)Also, I own Plex through the Andoid store.  Can I get it on the Fire Stick?  Well... Yes, by turning on developer mode and side loading it.  Ok, I understand the difficulties in Amazon trying to work with Google's app store to smooth such issues out but why not let me access the app off the main menu.  To reach it you have to go through the settings menu and drill down several steps to get it via application manager.  It works but its far from an ideal situation, and Amazon can certainly do much better.The device is a little slow to boot up in my opinion, but I don't have much to compare it too so a minor point.  Also, the remote can be a little wonky in registering button presses.Bottom line:  If you are already tied into the Amazon app store and music/video content then the Fire Stick is probably going to appeal to you.  If you already have a foothold with Google's app store and ecosystem then I would advise looking at either a Chromecast or getting a dedicated set top box - the Roku 3 seems to be the clear choice atm.  Maybe if Amazon updates the firmware it might improve but as it sits I'm glad I only paid $19 for it.", "verified": true, "helpfulness": "1/1", "author": "Michael F. Duvall"}, {"rating": 3.0, "review": "It is a nice little gadget.  Nice sleek design.  It powers up like it should every time, and the remote control is super responsive, so that is a plus.There is a problem with Netflix and sometimes Hulu on the Fire TV stick.  When I try to watch Netflix, I always encounter an error, and every now and then, the same type of connection error with Hulu.  I know it is not my network, because my Roku works perfectly downstairs with both Netflix and Hulu.Maybe there is a firmware incompatibility? I am not really sure, but I find it rather disappointing so far.  It would be a 5 star rating if not for this error.", "verified": true, "helpfulness": "0/0", "author": "Kwik10z"}, {"rating": 4.0, "review": "I am very impressed with this device. I originally bought it because it was on sale, and didn't expect much. But after the quick setup I was delighted by the speed of the interface. I have a roku stick and expected something similar, but the fire stick is much quicker.My only issue is the amount of available apps. I'm sure this will increase, but for now its limited to the big names (Netflix, Hulu, etc.) and a few others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow! Connect the power supply, plug into my tv, load the batteries into the remote, and follow the simple online setup instructions. Amazon Prime on my tv! No more setting up my computer and plugging in an HDMI cable. Easy and convenient. And I love the screen saver.Thanks for the great product Amazon!", "verified": true, "helpfulness": "0/0", "author": "Pam Franchi"}, {"rating": 3.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "nazih"}, {"rating": 5.0, "review": "Look good!  Much better & faster than the Chromecast that I purchased a few months ago.  I love the bonus of HDMI male-female adapter and Remote Control included with Fire TV Stick of Amazon which were not included with Chromecast at all.  Recommended to All searching for Wifi AV streaming stick for standard HDTV.  Thanks.", "verified": true, "helpfulness": "0/1", "author": "deals2bid \"John Doe\""}, {"rating": 5.0, "review": "I purchased this when it was on sale for Prime members for $20 - but would buy it for $39 if I needed another one. This is a very nice device. I got it up and streaming Amazon Prime Video & Netflix in just a few minutes. The streaming is very good - no lags or outages for the 4 hours I've used it so far. A very nice touch is that the unit came with batteries for the remote & it came with an HDMI extender cable (which I needed for my TV because the stick itself was a bit too long to fit in the area behind). Also - the remote is small (in a good way) & very responsive.", "verified": true, "helpfulness": "0/0", "author": "PocoLover"}, {"rating": 4.0, "review": "Stuff I like:* Very fast with Amazon Prime.* High quality video* No buffering mid movie on Amazon* Lots of choicesStuff I don't like:* Non Prime videos are much, much slower with periodic buffering* Paid content is mixed in with free content when searching and browsing, so you get disappointed when you realize what you found must be purchased.* Netflix lost connection so often I had to stop using it. Fortunately, the shows I was watching were also on Prime.* Connection to my WiFi went out, periodically, even though my phone showed a solid signal.* Streaming video from your cloud account is limited to just 20 minutes per video. So, I can't load my recorded tv shows and stream.Overall, I'm reasonably happy with it.", "verified": true, "helpfulness": "0/0", "author": "Keith Price"}, {"rating": 5.0, "review": "I AM NEW TO IT ..... BUT IT HAS REPLACED \"SLICED BREAD\" as the greatest invention ever.I am a techo-backwards-child (almost 50 yrs, and I understand tech less and less as time goes by)Plug it in.  Ta Da!Great for NETFLIX and Prime Video (but that would be like buying a rolls and taking it to church once a week)This device can connect/stream ...... I can't even begin to explain .... and I just got started.LOVE LOVE LOVE IT", "verified": true, "helpfulness": "0/1", "author": "Jon"}]