[{"rating": 5.0, "review": "Love it!  Took a little while to get hooked up but customer service was awesome and helpful.Got it as a gift and great to view videos on my tv instead of tablet.", "verified": true, "helpfulness": "0/0", "author": "judy Floit"}, {"rating": 5.0, "review": "Great alternative to network TV", "verified": true, "helpfulness": "0/0", "author": "Gale D. Brugh"}, {"rating": 5.0, "review": "it just works", "verified": true, "helpfulness": "0/0", "author": "Gantulga Sumiya"}, {"rating": 5.0, "review": "Well worth the cost considering you get a fully functional Home Theater PC when you invest a small amount of effort on a continuing basis.This review will concentrate on making the FireTV Stick (FS) into a more functional HTPC.  Two applications can extend the FS capabilities into those normally found in a Home Theater PC; Plex (app available for 5 bux) and Kodi (XBMC).  All the info you could want can be found on YouTube by searching on those apps.  Plex requires installation of it's Free Plex Server software on a PC or MAC and Kodi/XBMC requires side loading an app:- stream all sorts of media from your local network & media server, including movies, TV shows, photos, music- stream the same set of media from the web (checkout tvAddOns Wizard for an easy Kodi comprehensive install and also \"Plex unsupported Appstore Installer\")Two add-on capabilities make this operation much simpler/possible;-  side loading apps  (search \"sideloading FireTV\" on YouTube for many detailed videos)  basic computer skills are recommended.-  pairing a bluetooth keyboard / touchpad device (most bluetooth devices work after the settings.app is side loaded; I used the QQ-Tech® Mini Wireless Bluetooth Keyboard.Sideloaded app examples: Kodi, XBMC, Chrome / Dolphin browsers, settings.apk, ES File Explorer, game emulators, etc.  Nobody should expect a stellar experience using the FS as a browser but it works after a fashion and gets certain jobs done very well indeed.None of these require any \"rooting\" of the FS device.  Be forewarned that such extended capabilities come with numerous bugs and issues that are mostly only annoyances eg using keyboard and remote at same time has weird extra scrolling issues, channels that do not always work properly.  Your FS HTPC will require and reward your ongoing maintenance efforts as nothing on the net stays the same forever.I would be happy to answer questions and make recommendations based on my limited experience.", "verified": true, "helpfulness": "1/1", "author": "Twanna Martin"}, {"rating": 4.0, "review": "The one key missing feature of the Fire TV Stick is that it doesn't support browser-based wifi authentication.Which means you won't be able to use it on the road, in hotels specifically. The idea of a portable Fire TV is great, but actually taking it with me on a business trip and hoping to be able to watch Amazon Prime or listen to Prime Music, I was left without any way to connect it to wifi.", "verified": true, "helpfulness": "2/2", "author": "Carl"}, {"rating": 5.0, "review": "If I could give this ten stars I would- we thought we were awesome using Chromecast (and it is awesome) but this is like the Cadillac of Chromecast! It is optimized for Amazon Prime and also offers a variety of other TV/movie services (like Netflix and Hulu) and even music with Pandora (I can't comment on the music because we haven't tried that feature yet). My hubby did all the setting up and even our six year old can use the remote and menu to choose shows he likes to watch. The menu reminds me of the Xbox live menu- it's very user friendly and the remote is simple and easy to use. It might not be ideal for someone with poor eyesight because the buttons are kinda small, but there are so few of them, I would think you could easily remember what is where in time. Overall, this is a wonderful piece of technology and worth every penny!", "verified": true, "helpfulness": "1/1", "author": "BookNoseRose"}, {"rating": 5.0, "review": "We do not have a smart TV.  We have really enjoyed this stick because it allows us to enjoy our prime movies and shows on the television.  My kindle fire does have the ability to connect to the TV via HDMI cable, but it never worked that well.", "verified": true, "helpfulness": "0/0", "author": "Beavis"}, {"rating": 2.0, "review": "I'd probably give this 4 out of 5 stars if it didn't drop the wireless signal at least once a day and require a hard reboot to fix. Emailed support and they wouldn't help unless I called. Not worth my time for something I paid $19 for. Every other device in my home (multiple computers, Rokus, Apple TV, Chromecast, smart TVs, ipad, phone, PS4, etc) keeps the wireless signal just fine, so I know it's not my network.", "verified": true, "helpfulness": "2/2", "author": "J. Phillips"}, {"rating": 4.0, "review": "I just hooked this up.  The hardest part was getting the back of the remote opened to get the batteries in.  That should be attended to.  It's a process I found annoying.  Well, I used a small flat screwdriver to get in the crack and pop it opened, but the design isn't the best there.  I also don't like that the games don't have any instructions how to play or maybe I just don't see where to find the instructions.The pluses so far , after just 5 hours of use, is the picture is very clear and the buffering is so fast and good.  The sound is good.  I like the choices.  I like that you can have favorites on your computer and they transfer to the fire stick.  Very good.It's a new world for me as I don't normally do much in new technology.  It was easy to set up.  Just follow the directions on the screen.  As I said the worst part for me was getting the remote back opened.I hope this lasts for a long time.  The price is affordable.  I did have to use the extender (adapter) for better access to the back of my TV but it worked great.", "verified": true, "helpfulness": "0/0", "author": "ME"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "aidan"}]