[{"rating": 5.0, "review": "I LOVE AMAZON FIRE!!!! Seriously, all of the products are awesome. I have the Fire stick on one TV, the Fire Box on another TV, and my son also has a Fire phone.  The Fire Box and Stick I can definitely say are very high quality, and definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Shannon Spilman \"Shay\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Mary Kent Davidson"}, {"rating": 5.0, "review": "very good worth every cent--bye bye cable", "verified": true, "helpfulness": "0/0", "author": "susan hawley"}, {"rating": 5.0, "review": "Installation and set up was a \"no-brainer\"  and is great not having to run my computer to watch Netflix, YouTube, etc", "verified": true, "helpfulness": "0/0", "author": "SFMattie"}, {"rating": 4.0, "review": "Good streamer for it's value.  I have an ATV 3 as well and love the remote so when I heard about the TV Stick I went for it.  I now have it on my extra TV and  love that it has a remote.  Way better than chromecast that needs an app on your mobile device to function and was always getting stuck on my ipad and never really worked well on my macbook.  It can be a little slow though.  I guess that's why they have the more expensive one that's supposed to be faster but it gets the job done.  I rated it 4 stars because the user interface could use a little work.  Other than that it's pretty darn cool.", "verified": true, "helpfulness": "0/0", "author": "sfalba"}, {"rating": 5.0, "review": "Awesome!! Should have bought sooner.", "verified": true, "helpfulness": "0/0", "author": "Eldon R. Repsher \"EyeDoc\""}, {"rating": 5.0, "review": "This product is soooo much better than my \"smart\" Sony b-ray players.  I ordered a second one, love it.", "verified": true, "helpfulness": "0/0", "author": "Russ Reecer"}, {"rating": 5.0, "review": "I just love it will buy another for bed room.", "verified": true, "helpfulness": "0/0", "author": "devan ballard"}, {"rating": 5.0, "review": "Really awesome", "verified": true, "helpfulness": "0/0", "author": "Andrew Higgins"}, {"rating": 4.0, "review": "A good alternative to directv or dish...lowered my bills but still get ESPN..", "verified": true, "helpfulness": "0/0", "author": "Hagan"}]