[{"rating": 4.0, "review": "I was hoping to have more access to current television. However the apps that it does provide like History, A&E;, and Disney only have some shows. I purchased the Fire Stick to avoid paying for the high cost of cable, however these apps want me to have a service with a cable provider (non that actually provide service to my area) to access the full episodes; otherwise I can only watch 1 minute of a show! I feel like the cost ($40 for the device and $99/year for Prime) it beats paying $80 a month for basic television. It would be nice if Amazon integrated with Netflix and Hulu so you only have to pay for the subscription to Amazon and you actually get those services.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Put it in my bedroom.  Picture quality is excellent and channel options are endless", "verified": true, "helpfulness": "0/0", "author": "Darselle Milfort"}, {"rating": 5.0, "review": "fast and easy set up.", "verified": true, "helpfulness": "0/0", "author": "ronald kearney"}, {"rating": 5.0, "review": "Fantastic. Even for netflix the setup is much better. Very very happy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So far better than Chrome and Apple TV. I have both on different TVs and I use all 3. I like the fact I do not need to use my iPad to view content while use the treadmill. Remote takes a little getting used to, easy to hit wrong part of control.", "verified": true, "helpfulness": "0/0", "author": "Uncle Babe"}, {"rating": 5.0, "review": "Way bettet than Chromecast. I love it.", "verified": true, "helpfulness": "0/0", "author": "Angela Knapp"}, {"rating": 5.0, "review": "My son got this for my birthday. I love it. Sometimes with cable and 100's of stations there is still nothing on. If you belong to Prime there are plenty of tv and movies to choose from. Easily installed. Worth every penny", "verified": true, "helpfulness": "0/0", "author": "feline7"}, {"rating": 4.0, "review": "Opted this over the Chromecast since Chromecast doe snot link to Amazon prime Video.", "verified": true, "helpfulness": "0/0", "author": "Jim Breen"}, {"rating": 5.0, "review": "I bought this for my daughters room since she didn't have cable in their. It was a great buy.", "verified": true, "helpfulness": "0/0", "author": "Franklin Blackmon"}, {"rating": 5.0, "review": "We did our research on fire stick tv against the other wifi sticks out there.  1.) We have had Netflix with no connection to our tv forever-- 2.) We added the prime tv for the year (Free 2 day shipping is a bonus)-- 3.) We aren't cloud people..i.e. Google or icloud.. It was easy to set up and I did it while drinking a beer..so it was really easy. Now that football season is winding down we need to catch up on shows and movies that we couldn't get on cable. We probably wont be buying the voice remote but we are considering the game remote in the future for the grandchildren.Love the fire stick so far and its 1/2 the price of apple tv.", "verified": true, "helpfulness": "0/0", "author": "Ray Ray"}]