[{"rating": 5.0, "review": "Two words.....LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "Lauren K Johnson"}, {"rating": 5.0, "review": "Excellent alternative to Chromecast that mates very well with Prime Membership.  My LGTV stopped supporting Youtube and had no support for Prime videos.  Watched Legend of Korra seasons 1 and 2 with it and was worth it just for that.  The screensaver landscapes are also mesmerizing.  I would pay just to update the photos every month and imagine myself there inside the TV.", "verified": true, "helpfulness": "0/0", "author": "Bad Penguin \"bad_penguin\""}, {"rating": 1.0, "review": "I am very disappointed with the fire stick. The video freezes while the sound continues. Then the video goes really fast to catch up. When I watch the same thing on my Apple TV everything is perfect. The audio on the Apple TV is also far superior to the fire stick. I'm playing both thru a high quality sound system. 😎", "verified": true, "helpfulness": "1/1", "author": "Mitch Greenup"}, {"rating": 3.0, "review": "I like it but it just quit working.....Waiting for response from Amazon.", "verified": true, "helpfulness": "0/0", "author": "ALARS"}, {"rating": 4.0, "review": "What can I say about this Fire TV Stick, that has not already been said. I like that fact that once you set it up you don't have to sign in again to your apps, And there is soo much more that what I expected it to be... I have found things to watch or listen to that I never would have watched before. I wish the remote actually had numbers like an actual TV remote... trying to unlock your code with the pin can be difficult. And I am not crazy about the fact that you can't turn the stick off... you can put it to sleep, but its still on downloading and gathering information.", "verified": true, "helpfulness": "1/1", "author": "AC8311"}, {"rating": 5.0, "review": "Love it...very user friendly!", "verified": true, "helpfulness": "0/0", "author": "Wendy Richardson"}, {"rating": 5.0, "review": "is very good execent product 5 strar Amazon FIRE TV", "verified": false, "helpfulness": "0/0", "author": "Ntvs.tv"}, {"rating": 2.0, "review": "A decent device with a good number of positives, but a short number of negatives that really hurt its rating.First,positives. It has a good interface which is easy to navigate. Although it steers you towards buying Amazon content, you can still use other apps like Hulu or Netflix.However, it truly fails as a *streaming* device in that it skips and lags. A lot. Sometimes shows skip, jump, or lag about every minute, even with very fast internet access. Contacting support has the same advice every time, which only offers temporary fixes for the most part. It seems the hardware does not meet the ambitions of the device and its software. I can't wait to get the next Fire TV or Roku device.But at this point, honestly, Roku is looking better.", "verified": true, "helpfulness": "0/0", "author": "NinjaSlice"}, {"rating": 5.0, "review": "It works very good.  Now I don't have to buy a smart TV.  I would highly recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Helen"}, {"rating": 4.0, "review": "This is such a great entertainment investment! I got it so that we could stream Netflix and Prime without having to connect one of our computers to the tv. Being able to watch YouTube is a fun plus. Then my boyfriend discovered the games. Oh, the games! A lot of them can be played with just the remote. (Badland FTW!) Unfortunately, a lot of other games we wanted to play require the game controller and the TV Stick isn't compatible with it. So, we decided to upgrade to the box. What made us upgrade to the box faster was that the TV Stick's remote isn't durable enough to withstand marathon gaming sessions. (Zen Pinball is intense, and I cracked the remote's navigation ring.) The only other downside is that we had to change our router's security settings in order for the TV Stick to connect to the internet. This is, apparently, a sometimes issue with Xfinity.Bottom line: If you want HD streaming and light, casual gaming, get the TV Stick. It's well worth it!", "verified": true, "helpfulness": "0/0", "author": "Rose Scarlet"}]