[{"rating": 5.0, "review": "I bought the Amazon Fire TV and loved it so much I bought the Fire TV Stick for the bedroom. Super easy to set up. This remote doesn't have the voice search like the Amazon Fire TV but with the app for the iPhone you can use voice search...Easy Peasy!", "verified": true, "helpfulness": "0/0", "author": "S K Conn"}, {"rating": 2.0, "review": "Was disappointed.  Prefer the Roku.", "verified": true, "helpfulness": "0/0", "author": "Leslie"}, {"rating": 5.0, "review": "Bought this as an impulse by on release day.  I'm a loyal roku user, for many many years, I also have the Chromecast....but this little stick is superior.  I don't know if it has a better antenna, or more memory to cache the shows but everything streams in high quality with no delays.  My roku stick didn't and, my chrome cast doesn't.", "verified": true, "helpfulness": "0/0", "author": "Peter Grizzaffi"}, {"rating": 5.0, "review": "Was very easy to install and set up. Love it!", "verified": true, "helpfulness": "0/0", "author": "Alicia Whitcraft"}, {"rating": 1.0, "review": "I'm having nothing but problems with the Fire TV Stick - I've had it for quite some time now and haven't been able to watch a single thing. I wish I had never purchased it.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 4.0, "review": "I love the remote. I just wish the 10 sec. skip back/ahead feature would work on all the apps, such as Netflix. It's a great feature that works well with prime products. The menu screen is perfect. HBO!! Oh, never mind. It's a bait and switch. The first season is free, then $25 per season after that. Lose. That's why Netflix is an essential co-dependant product.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 1.0, "review": "It's unfortunate that they don't support older slingbox models. seems like a lot of people want support for Slingbox HD PRO. guess I'll be returning this.", "verified": true, "helpfulness": "0/0", "author": "Richard Balkind"}, {"rating": 5.0, "review": "Amazon I want to thank you for giving me something to do without college football being on.  Interface is great and my 2 year old loves pbs kids", "verified": true, "helpfulness": "0/0", "author": "Jenny Dell"}, {"rating": 1.0, "review": "If this was for a smart tv it should have sad so, if not need more info on how to use it without paying $8 + for instruction book", "verified": true, "helpfulness": "0/0", "author": "Karron White \"Karron\""}, {"rating": 1.0, "review": "I am really disappointed with Amazon's method of marketing this device. I pre-ordered it back in October for the Prime Member price. it sat there pending for three months and when Amazon tried to authorize my card without warning and the charge was declined. The cancelled the order without an opportunity to remedy and now expect me to pay full freight.Not impressed at all.", "verified": true, "helpfulness": "0/1", "author": "Tom Keaney"}]