[{"rating": 5.0, "review": "This thing rocks.  Bought it at reduced price for a gift during the promotion and wish I purchased more.  Super easy to set up, fast and great quality.  Well done, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Tobymosey"}, {"rating": 5.0, "review": "Love this, loses Internet connection at times, but picks it back up! Love the music the best right now! Only had this a few days.", "verified": true, "helpfulness": "0/0", "author": "Linda Rumsey"}, {"rating": 5.0, "review": "Very easy to set up and to use.", "verified": true, "helpfulness": "0/0", "author": "CW"}, {"rating": 5.0, "review": "I am very pleased with the fire stick.  My husband and I are enjoying it tremendously.  It was easy to set up and I'm anxious to get another for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Marla \"coat lover\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Beats most other boxes, hands down.", "verified": true, "helpfulness": "0/0", "author": "Windfall"}, {"rating": 5.0, "review": "Works great and was very simple to install. I will be canceling my over priced cable as soon as I get an antenna to pick up the regular channels with.", "verified": true, "helpfulness": "0/0", "author": "Sarah in AZ"}, {"rating": 4.0, "review": "Nice gadget for my wife to watch Netflix on her tv. Easy to install and play. We are very satisfied with the purchase but took a long time getting here.", "verified": true, "helpfulness": "0/0", "author": "Jack M."}, {"rating": 3.0, "review": "It gets the job done, but I did experience a few things that were less than satisfactory. The first, most annoying issue that I have with it, is the lack of an on/off button on the remote. It's annoying to leave it in idle mode all of the time, especially when your TV had Regza mode and automatically switches to HDMI input if it detects a device that is on.The second issue I had, is that sometimes there is a lag when the pause button is pressed, and on one occasion, it continually paused and played itself without me pressing any buttons at all. I had to unplug it to get it back in track.Third, Amazon advertises the ability to mirror or cast your tablet/phone, but that isn't actually possible without third party applications. I have learned now that Amazon devices can cast without third party applications.All around, I'm dissapointed. But, it does what I need it for. The menu could use some work, and the parental features aren't the greatest.The most annoying thing is that all if the advertisements show the device without a power cord, buy it does require external power. That was really deceptive on Amazon's part, to show it in televisions without the power cord.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Amazing. Great but!!!", "verified": true, "helpfulness": "0/0", "author": "ryan alcantara"}]