[{"rating": 5.0, "review": "It's small device, packed with a lot of features for a good price and it's easy to setup. It also helps to be a prime member to get access to thousands of streaming movies and shows. In order to enjoy a seamless experience on this device I would make sure you have strong speed connections from your Internet Service Provider. Otherwise, browsing the internet on other devices while using this can be frustrating. I would recommend this to my family & friends.", "verified": true, "helpfulness": "0/0", "author": "Ahmad"}, {"rating": 5.0, "review": "Awesome product! I have a Google Chromecast but my wife always had problems using it because of the requirement of a mobile device like an iPad or phone. So she started using the Xbox, but she doesn't like having to navigate through all the menus to use Netflix. This fire stick is super easy to use and has it's own remote, which is a plus. I would recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Blake"}, {"rating": 5.0, "review": "i just received it on 11/21/14-i have no complains right now about the device...however Amazon needs to invest in more Apps for instance YouTube is one-Shoprite-Target-and much more", "verified": true, "helpfulness": "0/0", "author": "Birdy31"}, {"rating": 4.0, "review": "This media streaming stick is a tremendous bargain this holiday season.  The only negatives are these - 1) The directional pad on the remote is occasionally too sensitive and over-scrolls left, right, up, and down.  2)  Amazon not-so-subtly pushes their own services rather than presenting content in an even-handed way.  Otherwise, this is a great device - performance is zippy and consistent and the interface (despite my previous complaints) is easy to navigate.", "verified": true, "helpfulness": "1/1", "author": "Nathaniel L Burrow"}, {"rating": 5.0, "review": "Home run! of the best product for the year....hope Amazon consider keeping the price low,low,low. Other products don't compare", "verified": true, "helpfulness": "0/0", "author": "canman"}, {"rating": 5.0, "review": "Got it this weekend and plugged it in right away.  Set up was straight forward and had no issues with connectivity to my wifi.  There was a few minutes of upgrades but after a reboot, the system worked great.  It was fast and streaming was immediate and of great quality.  Excited to get into some of the other apps and streaming services.  If they are anywhere close to as good as the Prime streaming, I am going to keep raving about the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "J. Silva"}, {"rating": 5.0, "review": "It is all that Amazon says that it is.  Hooked up perfectly and started right away.  Worked on Amazon and Netflix which are all that I checked out.", "verified": true, "helpfulness": "0/0", "author": "William D. Marshall"}, {"rating": 4.0, "review": "The firetv stick at this time does not appear to support home theater receivers. I tried with 3 different Onkyo receivers including my TX NR 1008 and the device will not display a picture. The screen is black with a dark black bar at the bottom that flickers. I was really disappointed, as all other devices work fine with my receivers. I was forced to plug the device straight into my television so I am not receiving any surround sound. If it were not for the fact that this is a brand new device that MIGHT be able to be fixed with a software update I would rate this a 1 star. To the contrary, if this device worked with my receivers I would have given it 5 stars.If you are planning on just using this with a TV then this is by far the best HDMI smart stick on the market. It is very fast, has ever streaming service (except for HBO) and with a little know how, you can side load android APK's.I hope that this is a simple firmware issue that will be resolved in the coming weeks at which point in time, I will edit this review. Same goes for if this issue is NOT resolved.Update: After speaking to 5 different representatives at amazon after posting a question on their forums, they confirmed that the firetv stick DOES NOT WORK WITH HOME THEATER RECEIVERS! I think that it is VERY deceptive for amazon to advertse this product as supporting 7.1 audio when the device cannot be plugged into a receiver.Not to mention that the customer service was TERRIBLE, the first 4 people that I spoke to had no idea what a receiver was or what HDMI was!  I am a huge fan of Amazon but my experience with the firetv stick has been nothing but disappointing.Update: I posted this issue in the Amazon forums before writing this review and just yesterday got some help from Michael James (thank you)!There is a workaround to get the fire tv stick to work on your receiver. I have edited my review to reflect this fix, however, I am knocking them 1 star due to the terrible customer service that told me and others, \"the stick will not work with receivers\". @ Amazon Dev Team, This is still a bug as the device should work with receivers in Auto Mode.I was able to get it to work by changing the Picture Mode setting from Auto to 'Direct'. Before plugging in the Fire TV Stick, change to the input you want to use, then press:Receiver-->Home-->Setup-->Choose Source Setup-->Picture Adjust-->Picture Mode-->Set to Direct (not Auto)", "verified": true, "helpfulness": "67/81", "author": "Stephen McGauley"}, {"rating": 5.0, "review": "Simple and very easy to use. The best part? Its quick! I've used various different devices to stream Netflix and other apps and this software along with the remote is by far my favorite. The menu is snappy and nothing feels sluggish like my bluray player or other devices. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Mike Heath"}, {"rating": 4.0, "review": "I've been using the Chromecast ever since its release and the only thing I disliked about it was not having Amazon Instant Video access.  Once I saw this was out and had a pre-release sale that made it 20 a piece I thought I'd give it a whirl.  I've used it everyday now for 5 days.From out of the box and up and running in less than 5 minutes.Things I Like:User Interface that puts many apps a few clicks of the remote away.Ability to use Smart Phone to control TV (like ChromeCast)It seems to run a little faster than ChromeCastThings I Dislike:Laggy video - The video will pause while audio continues and then appears to speed up to sync (unsure if this is a wifi issue on my end but I think it may be the device itself)Warning message when trying to use TV USB power - I have it plugged in using AC adapter as it recommends but I intend on switching to TV power at some point.  I really hope there isn't a big drop of speed and functionality of the device.Overall - In comparison to the ChromeCast I'd have to say I like the Amazon Fire TV Stick slightly more.  Installation is quicker and the remote is very handy.  I think with the gradual updates we're likely to see some of my complaints may be resolved. If you are weighing your options between the ChromeCast and Amazon Fire TV Stick you can't go wrong either way.", "verified": true, "helpfulness": "1/1", "author": "Atuor"}]