[{"rating": 5.0, "review": "I love this device. I just wish the remote had an off button", "verified": true, "helpfulness": "0/0", "author": "marilyn gentilly"}, {"rating": 3.0, "review": "Hard to use", "verified": true, "helpfulness": "0/0", "author": "SUZANNE SLOAN"}, {"rating": 1.0, "review": "This is a piece of s***.  I DO NOT RECOMMEND ANYONE TO BUY THIS !  I'm an Amazon Prime customer.  most movies cost extra, number One.  but doesn't matter, because this stick hardly works.  I hate it.  do not buy", "verified": true, "helpfulness": "0/0", "author": "GEORGIA GRIFFIN"}, {"rating": 1.0, "review": "Would not work with Xfinity Arris router.  I worked with your tech support people and they could not make it work.", "verified": true, "helpfulness": "0/0", "author": "TomofNorthwoods"}, {"rating": 5.0, "review": "Great!  So easy to watch movies and TV shows.  Easy setup.  Can take it with you on vacation.", "verified": true, "helpfulness": "0/0", "author": "cali"}, {"rating": 5.0, "review": "Thats what i need it for my tv..thanks", "verified": true, "helpfulness": "0/0", "author": "Kerving Breton"}, {"rating": 5.0, "review": "Better than watching constant rerun and paying a fortune for cable each month.", "verified": true, "helpfulness": "0/0", "author": "Debra Dart"}, {"rating": 4.0, "review": "Very easy to use. Deceit selection of movies. Wouldn't mind seeing better varity of Prime Videos. Other that, a good buy.", "verified": true, "helpfulness": "0/0", "author": "Tenlitigator"}, {"rating": 5.0, "review": "Easy to use with the included remote or my Smart Phone. I love using my Smart Phone with it; it's just fun :) Has the two apps I'm most interested in - Amazon, of course, and Netflix - plus plenty of other apps - some free and some needing a cable subscription - I'm not so big on playing games on my TV, so I've not looked into what type of games it carries. I absolutely love this! I'm very pleased with my purchase.", "verified": true, "helpfulness": "1/1", "author": "scarlet_study_21"}, {"rating": 5.0, "review": "Read a lot of reviews prior to purchasing... Easy hook up and no issues with it stopping or pausing due to internet issues. I definitely will be purchasing another one in the future for my other tv.", "verified": true, "helpfulness": "1/1", "author": "Melinda Brown"}]