[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Gregory"}, {"rating": 5.0, "review": "Easy set up. Better than Regular Netflix, Pandora, etc.", "verified": true, "helpfulness": "0/0", "author": "Richard S."}, {"rating": 5.0, "review": "Worked as advertised.  I am very pleased with this product", "verified": true, "helpfulness": "0/0", "author": "Brian leabo"}, {"rating": 5.0, "review": "I bought this so I could use PLEX, and since I had a Prime membership it will allow me to have all my Prime goodies as well. This is awesome and bought a second one for my other TV and they work great!", "verified": true, "helpfulness": "0/0", "author": "RichieC"}, {"rating": 4.0, "review": "can't get a complete analysis because my wifi is to slow. will be upgrading in near future", "verified": true, "helpfulness": "0/0", "author": "robert t felix"}, {"rating": 5.0, "review": "LOVE IT!! I may just get ride of my current service provider.", "verified": true, "helpfulness": "0/0", "author": "Ashley Williams"}, {"rating": 5.0, "review": "I also have a competitive product. I like the Fire TV stick better because: the screensavers are worth watching in their own right,when I cut off power to the device at bedtime, it does not \"forget\" all my connection information.On the negative side:the competitive product has more channels (which Fire calls Apps)to use both devices without changing connections on the TV, I would need to get a different cable for the other device.", "verified": true, "helpfulness": "0/0", "author": "Minerva R. Hodis"}, {"rating": 2.0, "review": "Real buggy. Constantly dropped connection with my otherwise solid wifi. I bought it for Sling TV and that app crashes at least once per use. Overall, really disappointed.", "verified": true, "helpfulness": "0/0", "author": "Melodi"}, {"rating": 4.0, "review": "The Fire TV Stick was very easy to connect to my tv that I use in a spare bedroom and begin using. We have a smart tv in our family room and I wanted to be able to watch Netflix and other things when my husband was using it. My  only complaint is that it seems to buffer or lose the Internet connection more than I would like.  For the price it works pretty well though.", "verified": true, "helpfulness": "0/0", "author": "cab"}, {"rating": 5.0, "review": "This is a powerful little stick!!!!", "verified": true, "helpfulness": "0/0", "author": "Halldor Hildigunnarsson"}]