[{"rating": 4.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Luis E. L. C \"Lucho\""}, {"rating": 4.0, "review": "Very easy to install & use. Disappointed that HBO Go is not on stick. doesn't seem as versatile as the Roku it replaced.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer \"Rodger G\""}, {"rating": 5.0, "review": "Except for the voice search, this $39 device does everything it's $99 big brother, the Fire TV, does. Great value, even more so if you were able to get it at the $19 introductory price for Prime members. Easy to set up and works like a charm. This is a winner!", "verified": true, "helpfulness": "0/0", "author": "\"Big A\""}, {"rating": 5.0, "review": "Great experience", "verified": true, "helpfulness": "0/0", "author": "Rick G"}, {"rating": 5.0, "review": "Wonderful idea! It makes our regular LCD./LED TV's Smart TV's", "verified": true, "helpfulness": "0/0", "author": "Morel"}, {"rating": 5.0, "review": "Easy to set up and use. Works great with no lag and smooth streaming. Solid product.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "Love it, I disconnected from TV and Satelite a few years ago, just have Netflix, this is a great addition. Lots of variety.", "verified": true, "helpfulness": "0/0", "author": "MBGWatson"}, {"rating": 5.0, "review": "I bought this because it was a presale for Amazon Prime members and was a discount.  If I had known how great it would work, I would have definitely paid full price.  We have been using gaming consoles for Netflix, Hulu, etc... and many times they sit and buffer for long periods, etc...  We plugged this in and it started right up and wow - no more buffering, hanging or saying it can't play the video.  We have downloaded movies, apps, etc.... with no problem.  There is one app that will occasionally freeze for a second or two and then keep going.  I think is the perfect alternative to other streaming devices and works so much better.  I like that it plugs right into the TV and doesn't take up any additional shelf space.  So far I can say I don't have any complaints about the Amazon stick so far.  We now use it for all of our streaming and movie rentals.", "verified": true, "helpfulness": "1/1", "author": "Kristy Stout"}, {"rating": 4.0, "review": "Great idea except that our slow rural computer speed does not work with this.  Remember you still have to pay for the access to the movies, etc.", "verified": true, "helpfulness": "0/0", "author": "Native Texan \"WRR\""}, {"rating": 5.0, "review": "It worked perfectly", "verified": true, "helpfulness": "0/0", "author": "frustrated"}]