[{"rating": 5.0, "review": "Awesome product! Great packaging! Love the Fire!!", "verified": true, "helpfulness": "0/0", "author": "sandra k larson"}, {"rating": 5.0, "review": "Absolutely love it", "verified": true, "helpfulness": "0/0", "author": "kimberly runyon"}, {"rating": 5.0, "review": "How I love this stick! I haven't used my cable since I got this on the mail. It was really easy to set up and came pre programmed with my info. The remote back was difficult to remove the first time but once I got the batteries in it was smooth sailing. It is super easy to add music and apps from either the app or online. I can't wait to use more of the features soon. I chose this over other plug in options because its from a company I trust and doesn't require connection to a computer. Its a great choice and for the price, how could I lose?", "verified": true, "helpfulness": "0/0", "author": "str8brownsugar"}, {"rating": 5.0, "review": "Love, love, love this device.  Super easy to set-up.  I purchased this stick from a major retailer as Amazon was out for a couple of weeks.  I am very satisfied with the device, easy to use.  I am waiting for Amazon to hook up with HBO2GO this summer to complete this exerience.", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 5.0, "review": "Easy to set up. Plenty to watch. Cancelled cable. Saving $200!", "verified": true, "helpfulness": "0/0", "author": "Robin Hatch"}, {"rating": 4.0, "review": "We just received this item yesterday. Seems like an awesome alternative to cable. We looked through the available shows and movies and were impressed with the selection. It was also very easy to set up and start using. We also have prime and the show availablilty through there is awesome. My only complaint is that it has to be plugged in, hence the 4/5 stars.", "verified": true, "helpfulness": "0/0", "author": "Courtney Wade"}, {"rating": 3.0, "review": "Wroks great, took foreaver to get it.", "verified": true, "helpfulness": "0/0", "author": "Gerald L Green"}, {"rating": 5.0, "review": "It's great will save you $$$ very cool and plenty to choose from", "verified": true, "helpfulness": "0/0", "author": "Alan"}, {"rating": 5.0, "review": "Works great!!! Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Garret munoz"}, {"rating": 1.0, "review": "Doesn't work. After what seemed like an easy set-up, when we tried to view any kind of video through Netflix, Hulu, or HBO go, we were met with a blue screen and an error message. Very frustrating.", "verified": true, "helpfulness": "1/1", "author": "jhawkeye14"}]