[{"rating": 5.0, "review": "It's good. Buy it.", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 5.0, "review": "I bought this because our 2011 LG HDTV Amazon ap was no longer going to be supported.  I wish I hadn't waited so long!  It is much faster and more reliable than the TV app.  I had read some comments about not finding the free Prime TV shows and movies.  These are already sorted for you so there is no trouble finding them right from the start screen.  I've been very happy so far (couple of weeks)", "verified": true, "helpfulness": "0/0", "author": "Double Ott Rancher"}, {"rating": 4.0, "review": "I was previously using Chromecast and bought this just because it was on sale. It very quickly became the only one I used. I love having the remote. I wish it had some other apps like HBO now and apps for some cable TV stations but I think that will come in time.", "verified": true, "helpfulness": "0/0", "author": "Andrea Rodarte"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Monique Haskins"}, {"rating": 5.0, "review": "This is a really cool device.  Easy installation but it does require an ac power connection.  The remote is simple to use.  On-screen instructions for use are very good. Downloading apps is very straightforward.  Connecting to things like Netflix, HBO and Showtime is fairly simple. All in all this is a useful device which allowed me to eliminate one of my other remotes.", "verified": true, "helpfulness": "1/1", "author": "black creek"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "nikki"}, {"rating": 5.0, "review": "I Love Love my fire stick!!! I can not say enough words about HOW GREAT this device is.  All summer before I made my purchase I had to hook up my tablet to my TV to watch netflix, but NOW.....all I need is the Firestick Remote control and I watch Netflix all night long.  I loved it so much I brought one for my bedroom!  And I am in the process of purchasing one more for my 2nd Den where the children watch TV...I Do Not Have Cable right now, but with FireStick I am Good!", "verified": true, "helpfulness": "1/1", "author": "S. Jones \"DVD Searcher\""}, {"rating": 5.0, "review": "The only complaint is that it's a bit of a pain to navigate.", "verified": true, "helpfulness": "1/1", "author": "The MacGuffin"}, {"rating": 5.0, "review": "Very easy to use works great price is very awesome we are happy with our purchase", "verified": true, "helpfulness": "0/0", "author": "Lisa Eberly"}]