[{"rating": 4.0, "review": "Easy to use, and set up", "verified": true, "helpfulness": "0/0", "author": "Amanda E."}, {"rating": 4.0, "review": "This is really a bargain. For under 50 bucks you get a fully functional, attractive cable-cutter interface. I had Roku before but I like the Fire ecosystem more. It's fast and easy. It features Prime but I tend towards Prime at this point; Netflix and Hulu for specific stuff. I got personalized youtube on there within five minutes. I guess they need more apps and I suppose this is where AAPL has them beat although I did get some nice apps for my little daughter. Need more apps. But the speed and ease of install + the price makes this a real winner, I think that in general AMZN has a winning game plan in that they are really offering good products with a great \"ecosystem\" for a low price.", "verified": true, "helpfulness": "0/0", "author": "GEEEEEEE \"GEEEEEE\""}, {"rating": 1.0, "review": "It stopped working after 3 months. Doesn't connect to any network anymore.", "verified": true, "helpfulness": "1/1", "author": "Mohamed Elkholi"}, {"rating": 5.0, "review": "the fire stick is the most amazing thing I've ever seen I can mirror my tablet to my TV and has a lot of good movies on it good music TV shows I like it a lot.I like it better than the chromecast Stick i got!!", "verified": true, "helpfulness": "1/1", "author": "thomas prince"}, {"rating": 5.0, "review": "This has been everything I expected. There are a lot of movies and tv shows on here. No need to subscribe to cable. We aren't home enough to watch it any way.", "verified": true, "helpfulness": "0/0", "author": "Sara Johnson"}, {"rating": 5.0, "review": "Love what we can do by having this! It has opened up a new world for us!", "verified": true, "helpfulness": "0/0", "author": "MichaelÃâÃÂ Rodriguez"}, {"rating": 3.0, "review": "I miss important app like YouTube, and geographic restriction limited a lot. Actually only use to see Netflix.", "verified": true, "helpfulness": "0/0", "author": "Pedro"}, {"rating": 4.0, "review": "I ordered the Amazon Fire stick for $19 when they first came out.  I figured it was worth a try for that amount of money, even though I had a Vizio Smart TV I felt the portability would add some flexibility.  It works perfectly with any HD TV where Wi-Fi internet is available which means you can move it from one room to another as needed, take it to a friend’s house or even bring it on vacation. The device accesses a plethora of apps, movies and TV shows as well as access to personal media through Amazon Cloud and supports Miracacst from enabled cellphones, tablets and computers.  Voice search is possible with an app on your phone.  It actually works better and faster than the TV apps, which is why I bought a second Fire stick. I recently bought a Samsung smart TV which is a great TV, but the Smart Hub apps on it just don’t match up to the excellence of the TV.  So to add more convenience (and more fun) I bought the second Fire stick.  With three TV’s and two Fire sticks we have plenty of flexibility and plenty of content to watch.Now for the disappointments … There is no VUDU app on the Fire stick.  There is no 3D content on the Fire stick.  There is no Internet Browser and the Amazon Prime content, though plentiful is disappointing in the respect that many older movies which are currently shown on TV are only available for pay from Amazon (which as a Prime member, I already pay for).I’m an Amazon fan, and if they fix these minor discrepancies then the Fire stick gets five stars.", "verified": true, "helpfulness": "0/0", "author": "Arnold Bookheim"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "steven chaplin"}, {"rating": 2.0, "review": "No where close to Apple TV!My husband ordered our Firestick as soon as they were available. We already had Apple TV but moved the unit to another room hoping to love the Firestick. Unfortunately, that has not been the case. The Firestick interface is not as user-friendly. The remote's buttons are arranged awkwardly and you must use only the home button to get back to a different app (the back button doesn't do this even though it seems it should!)I know it's ahead, but save your money if you want better functionality and airplay!", "verified": false, "helpfulness": "0/0", "author": "Natalie Schifsky"}]