[{"rating": 1.0, "review": "Very Glitchy set up. Tried set up on 1st TV.....couldn't get it to see the Amazon network. I moved it to a second TV where I was able to advance to the software update...then it wouldn't load \"Home\". Finally after about 3 hours was able to load all content. Sounds like I'm good right? Kind of....The rest of this review I will compare to the ROKU 3.Picture Quality-Not even close to the Roku 3. This stick would be suitable for your children as they wouldn't even notice. I'm guessing that streaming wirelessly is the culprit here. Fire TV states that my network connection is \"Very Good\" so that's not it.Dolby Digital-Somehow the software has disabled plain old Dolby Digital as it prioritizes Dolby Digital Plus. Like most people who haven't upgraded their receiver in the last 3 years, I can't do Dolby Digital Plus. The best I can do with the Fire stick for Amazon content is (2.0). The Roku 3 at least allows plain old Dolby Digital for Amazon content. Netflix is a problem for both devices in that it streams only in DD+. (Damn you Netflix) The Fire stick software needs to allow for plain old Dolby Digital as well as Dolby Digital +. Future Update?Interface-The Roku 3 is much cleaner & easy. The Fire Stick is confusing & irritating.In closing, I'm really surprised that something coming from Amazon is so inferior given the top notch experience on their website.Hopefully this device will continue to be updated to address some of these issues. I'd love to hear from others if they are able to stream plain old Dolby Digital as it could be my set up....don't know??", "verified": true, "helpfulness": "1/4", "author": "Bumpa Rodriguez"}, {"rating": 5.0, "review": "Amazing product love streaming tv music and anything else. Also games run smoothly on it and I could not be happier. Only issue I have had and this isnt an issue with the streamer is Netflix does not always store the password so I usually have to re enter the info. but still perfect product", "verified": true, "helpfulness": "0/0", "author": "jose carlos zamora"}, {"rating": 4.0, "review": "Great for anyone who doesnt have a smart tv. Fast and responsive", "verified": true, "helpfulness": "0/0", "author": "pickrell"}, {"rating": 5.0, "review": "Love it! So easy to setup. They even include a cute animated setup video. Very happy with this purchase. Goodbye Comcast!", "verified": true, "helpfulness": "0/0", "author": "Kathryn Sawa"}, {"rating": 3.0, "review": "I get why Amazon created the Fire TV and Fire TV Stick.  It's a device that helps facilitate offerings on Amazon.  It works well and if you have Amazon Prime, this is probably the best way you can view Prime Movies and TV Shows.  The game capabilities seems a little silly to me, but I guess it works for some.  That being said, I primarily bought it because I wanted to take advantage of Amazon Prime Movies and TV shows.  Outside of this, it's use is relatively narrow for me.Essentially, if you consider that many products help push your multimedia to your TV, whether from the cloud or from a network drive, or even mirroring or sending content from a smartphone or tablet, they pretty much do the same thing.  The problem is, they don't support each others back-end stores.  Because of this, you have to have both to have the best experience with each service.I mentioned \"narrow\", because I already have an AppleTV, which Amazon doesn't support (and vice versa).  The AppleTV simply does everything better.  From interface to features, the AppleTV is just a better experience.  Things are simply \"built-in\" with little or no configurations required.  Because Apple's ecosystem and interface is much better, I would primarily use the AppleTV over the Fire TV Stick for everything outside of the watching Prime content.  (It's important you consider this when reading my review.  I already have a similar product that I'm essentially comparing this to.)If you don't already have a product like the AppleTV, Chromecast, Roku, or any other similar device, this may have some real value to you.  That being said, the interface is a bit limited for those that are not technically savvy.  (Ex:  My wife and kid figured out the AppleTV with almost no instructions.)  If you want to get the best value, you really need to know how to install apps and network this device.  There was a lot of configuring and installing to really take advantage of all it's capabilities.Ultimately, I give this a 2-Star rating simply because it can't compare with the AppleTV.  However, it does get me my media from Prime wonderfully, but still is limited or cumbersome to use for everything else.  Also included with my 2-Stars is the value.  I bought two for $19.95 each, one from Amazon and one at Staples (look around, you'll find them).  Lastly, I added an additional star, because Amazon has made it very easy to open this device up and install your own apps, like XMBC (unlike the closed ecosystem for an AppleTV).  The specs are also doubled compared to the Chromecast.If you're into rooting and installing apps to get to your multimedia, this may have a higher value to you.  Because this was relatively inexpensive (compared to $99 for an AppleTV), it was worth it to me to purchase it, knowing it will be used primarily just to watch Amazon content.  If you're tech savvy, I would recommend this product, because you can do a lot with this if you know how.  If you want ease of use, I would suggest something else.  If you're an Apple user, iTunes, Mac, iPhone, iPad, I would suggest you get an AppleTV as your primary device and only get the Fire TV Stick for Amazon content.Pros:InexpensiveBest way to get Amazon contentSmall footprintPlenty of room to add additional appsCan easily install non-standard appsLots of room to customize this device if you have the knowledgeCons:Interface is primitive compared to other productsRequires tech knowledge to get the best out of this productWi-Fi Only (May have issues if your TV has a weak signal)", "verified": true, "helpfulness": "0/1", "author": "Arnell"}, {"rating": 5.0, "review": "Just received this in the mail today and I'm loving it. TV episodes continue on their own in Prime, which is a big bonus over my iPad because I have to click next on each episode. Access to my music on Amazon and Prime is great through this as well. The casting feature works great with my Nexus 4 running Lollipop. Still exploring, but I haven't noticed any issues this far.", "verified": true, "helpfulness": "0/0", "author": "Standard Nerd"}, {"rating": 3.0, "review": "I'm pretty disappointed in the Fire Stick, and relieved I bought it on sale and not full-price.It's complicated to navigate, because it tries very hard to keep you in the Amazon Prime world; it's tough to locate other apps, and the search isn't global which just SUCKS. I hate having to go to specific apps to search and find whatever show I was looking for. The remote app on Android phone is a great idea, but it's clunky to use in reality. Overall, I really am just disappointed cause I was so excited for this thing, and now I wished I'd gotten a Roku or even Chromecast.The biggest disappointment is that you can only \"fling\" (cast) content from a Fire device (Amazon phone or tablet) and only Amazon content, though apparently other apps will soon be able to be shared as well? Anyway, this is my first night using it, and it was such a disappointment compared to how it was marketed that I've already turned it off and actually just ordered a Chromecast. Perhaps, as they make improvements, this thing will live up to Amazon's hype, but for now, it's a much lesser version of other streaming options, UNLESS you exclusively watch Amazon Prime video and primarily use Amazon devices, then it's pretty cool.", "verified": true, "helpfulness": "1/1", "author": "Tawn"}, {"rating": 1.0, "review": "i was hoping i would liike this since there are amazon shows i would like to watch. i was so DISSAPOINTED because i couldn't make it work in any of my hd tv's. it also did not work in my apple computer HDMI port . i did not want to force the device and ruin my equipment or the fire stick. so i am sending it back. i should not have to buy some other kind of hdmi thing to make it work. i am sticking with my completely great apple tv. it fits into all the hdmi ports and does not have to be forced. and it is a pleasure to use.too bad this is flawed.", "verified": true, "helpfulness": "3/7", "author": "sc oakland"}, {"rating": 1.0, "review": "Garbage. Really poor wifi reception, can't maintain a connection and can't play a single video without stuttering. Also, no way to power off, so if your HDMI ports are auto switching, this is not the product for you.", "verified": true, "helpfulness": "2/3", "author": "K. Barrett"}, {"rating": 1.0, "review": "Still haven't been able to watch anything on it. After 2 hours of trying, I was finally able to get it to accept my router password. It played the intro video, and I can see the main menu, but it won't let me download or access Netflix or anything else. When I click on a Prime movie or show it tells me that I can watch for free with a Prime membership (which I have) and it takes me to the trial membership screen. The device is pre installed with my Prime info, and it acknowledges me. I've done everything, and cannot keep an internet connection. I even moved my furniture so my tv would have a better signal to the router. Good signal, bad connection. Very disappointed, and I hope Amazon makes good of their poor product. My daughter has a generic streaming box that works much better. I waited a month and a half for this to arrive, and missed Black Friday deals on other streaming devices because I thought I was getting something of Amazon worthy quality. According to other reviews, it seems to be luck of the draw with these devices. I got a bad draw.", "verified": true, "helpfulness": "2/3", "author": "Loren Price"}]