[{"rating": 4.0, "review": "Bought this for hotel rooms while traveling and our daughter's dorm.  Electrical plug is only a few feet long, so recommend bringing extension cord if you don't know where outlets will be. Useless for the dorm for this reason, since extension cords are prohibited.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great item", "verified": true, "helpfulness": "0/1", "author": "klaus"}, {"rating": 5.0, "review": "Bought two of these for my 2 year old so she could have one at home and at grandma's house. Having Amazon Prime makes this so much more worth it than if I didn't. There are a lot of learning programs available so she has more options than just senseless shows. It's easy to set up, easy to use, and if I ever lose the remote, it's easy to just use my smartphone as a backup remote. No need to buy the fancy remote that has the voice controls when I can use my phone. The only con I can think of is that you have to keep it plugged in an outlet. And that's not really even a con because the charger that comes with it can be used for other devices as well. Well done, Amazon.", "verified": true, "helpfulness": "0/1", "author": "Fluffehbucket"}, {"rating": 5.0, "review": "Easy to use.  Love it", "verified": true, "helpfulness": "0/1", "author": "Michelle Russell"}, {"rating": 3.0, "review": "Better than my Chrome because it has an actual interface and remote. Still has some quirks though.The system never restarts or turns off. It just sleeps. The memory gets bogged down very quickly. Amazon video app usually hogs a ton of resources (just under 300MB) even when it has never been used.", "verified": true, "helpfulness": "0/1", "author": "Matthew"}, {"rating": 4.0, "review": "Like product but did not know I needed WiFi to use it.😊", "verified": true, "helpfulness": "0/1", "author": "Amy Fukushima"}, {"rating": 4.0, "review": "Needs a longer power cable!", "verified": true, "helpfulness": "0/1", "author": "Franktastic4"}, {"rating": 5.0, "review": "awesome little thing, looking forward to windows mirroring!  otherwise, amazon, netflix, android mirroring works fine", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Works ok... I bought it mostly for the miracast capability. I had tried a generic miracast dongle and i was unuseable. The miracast function works but you cant really use it to watch movies.... Lags and chops the audio. Netflix works ok on it.... Seems to buffer more than my gaming console does while streaming. Dont get amazon prime just for movies.... Netflix has a better selection for a buck less a month. I suppose it works ok if you just want to watch netflix or watch an incredibly expensive rental. Maybe ill try chromecast i hear it miracasts better.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really like the amazon fire tv stick. the only thing that i would need to do is get more experience using it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]