[{"rating": 5.0, "review": "I was leary about ordering it.  I was very upset at the lag in delivery time.  Then I got it.  Set up right away.  So easy.  Works great.  Worth the wait and worth every penny if you have a Prime account, (which I originally got solely for the shipping).  Simple to use, better than Comcast Xfinity for watching TV shows by a mile.", "verified": true, "helpfulness": "0/0", "author": "Andy Anderson"}, {"rating": 4.0, "review": "Needs to  be  power cycled  occasionally.Needs a on  off switch.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Bryant"}, {"rating": 5.0, "review": "exactly what I wanted. If we can get more content,etc. this is a great solution to having cable.", "verified": true, "helpfulness": "1/1", "author": "Jarrod Watson"}, {"rating": 5.0, "review": "I love it! !!!! $", "verified": true, "helpfulness": "0/0", "author": "MIRELLA PEREZ"}, {"rating": 5.0, "review": "It's awesome...haven't had any issues with a lag or buffering!!  Very happy we got this, it's nice to watch amazon instant video and Netflix on something other than my ipad!!", "verified": true, "helpfulness": "0/0", "author": "Catherine A. Pudwill"}, {"rating": 5.0, "review": "I purchased this for my older flat screen that was not a smart TV, and it works great.  I have access to all the programs and everything I need.  Installation was minimal and everything was up and running in less than 10 minutes.  Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Tom Thomason"}, {"rating": 2.0, "review": "I have an issue with this there seems to be a fault  on it and I can't use Netflix!Lots of the channels that look worthwhile look like a subscription is due to watch..", "verified": true, "helpfulness": "0/0", "author": "catchdatdeal2"}, {"rating": 5.0, "review": "I am very pleased with this purchase! So easy to install!!! I didn't get frustrated one time! LolComes with Amazon prime movies, as well! I only wish I got this when it came out and got the Amazon prime lower price!!! 5 stars +++++", "verified": true, "helpfulness": "0/0", "author": "Syd"}, {"rating": 4.0, "review": "nice, better than i thought", "verified": true, "helpfulness": "0/0", "author": "tradog626"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "stephen cowan"}]