[{"rating": 5.0, "review": "What a crazy deal for a great product this thing will rock your socks off.Pros:FastGreat WiFi connectionGood choice of appsSimplistic designCheapMore future-proof than competitors productscons:USB power option didn't work my TVInitial update failed for me onceBattery cover needs the hands of God to remove", "verified": true, "helpfulness": "0/2", "author": "ameyer117"}, {"rating": 5.0, "review": "Easy to set up and use.  Ordered when it was $19 for Prime members.  Best money I've ever spent and will buy another at full price as a gift.", "verified": true, "helpfulness": "1/2", "author": "Rob"}, {"rating": 4.0, "review": "Other than it took two months to get I like it. I bought the fire tv so I could hook it up with cat5. Better than Roku and Apple TV.", "verified": true, "helpfulness": "0/1", "author": "mmv"}, {"rating": 5.0, "review": "Very easy to set-up, but you will need your home network password. Excellent for watching Prime content. Huluplus synced flawlessly. I downloaded the PBS app, but haven't tried it out yet. The interface is simple and attractive. Everything you need to start using the Stick is included in the box, no running to the store, and yes, that includes the batteries for the remote. For the price, excellent.", "verified": true, "helpfulness": "1/2", "author": "J. F. Monaghan"}, {"rating": 5.0, "review": "Totally awesome.  Everything chrome should have been.  Everything you need in a space saving stick.", "verified": true, "helpfulness": "1/2", "author": "Alex Lee"}, {"rating": 2.0, "review": "I bought it for $19. only couple of Apps are working. Amazon prime movies app works. But it does not have search option. There are very few apps. It shows Netflix, Huluplus, PBS, ESPN --- as UNAVAILABLE. So whats the use of it? NEED MORE WORKING APPS.I did not have any problem with setup. but as yet I have not found anything useful.", "verified": true, "helpfulness": "1/6", "author": "baba"}, {"rating": 5.0, "review": "A breeze to set up.  So far it's working very well.  I like it's menu a lot.  Seems easier and quicker to navigate than Roku.  It may be my imagination but I think the picture quality and audio are better than either the Roku box or Chromecast stick I have.  I have not yet figured out how to project the computer screen to the TV.  The ease of doing that is definitely a Chromecast advantage.  But I haven't had a lot of time to spend figuring it out yet.  It may be something simple that I haven't run across yet.  I do like it a lot!", "verified": true, "helpfulness": "2/4", "author": "Charlesqc2"}, {"rating": 1.0, "review": "Another product made by amazon that is purposely crippled so it will only work with amazon made tablets.  Interface is awful, clunky, and outdated. Go elsewhere if you seek a quality product that will work with your non-amazon products.", "verified": true, "helpfulness": "5/19", "author": "The Truth Is Out There"}, {"rating": 2.0, "review": "Screen mirror does not work with standard android devices - tried with both a nexus 4 and a galaxy tab S with constant mirroring failures on both.Fire Remote app is incompatible with tablets for some reason, meaning I can't use the device most often sitting on my living room table to control it.Bad out-of-box experience", "verified": true, "helpfulness": "0/4", "author": "Terrance Garrett"}, {"rating": 5.0, "review": "I just hooked mine up and maybe it's too soon to say but I LOVE IT!I already had a Prime subscription and was able to buy my Fire Stick for the awesome price of $19.99 so i figured if it didn't work it was ok but since it works that was an amazing deal!I can stream the free Prime shows & movies on my tv rather than sit in front of my computer or watch on my Kindle Fire so that's a big plus. I also can access a vast amount of free kid shows including Sesame Street so that alone makes it invaluable as a mom.Can't wait to watch all of the seasons of the Good Wife!", "verified": true, "helpfulness": "1/2", "author": "Crystal Moreno"}]