[{"rating": 4.0, "review": "I was able to pre order this at $20 which is an awesome value. This device is definitely much better than Chromecast because it comes with a remote control. The remote alone makes a world of difference. Never having to reach for my phone or pc to cast to the device. For a device that is worth $40, it has a lot of value. Since I own the Fire TV as well, the performance of the Fire TV Stick is not great. It is great at $40 though. If I had a choice to either get this or Amazon Fire TV at $100, I would get the Fire TV because of the performance increase. Overall, a good product.", "verified": true, "helpfulness": "0/2", "author": "brandon"}, {"rating": 3.0, "review": "For $19 (prime users), this is a steal, a great bargain for a tv without a streaming device!  For anything more than that...it's just ok.  I set this up on the spare tv in the our bedroom and it works, not enough to replace our Roku in the living room though.For starters, the UI is painful.  Added apps are not shown significantly on the home screen.  They are placed at the top, but smaller than the many movies and tv shows and advertised apps Amazon has filled your home-screen with.  It makes sense because Amazon is trying to push their content on you, but it strains the customer experience by adding extra steps when navigating to an app.  To open Netflix or anything else, you have to scroll to the top, wait for the apps to expand on the screen, then you may scroll to select your app.  This process is far too cumbersome, and hopefully something they will fix eventually.Freezing...it has happened once already (in about 10-15 minutes of navigation).  I was sorting through the episodes of a show on Amazon prime and they froze on me as I was clicking.  When the box caught up, it quickly jumped forward 3-4 episodes.Updates...when I first turned on the system, it took about 10 minutes for it to update.  There should be an option to update later when you are not using the system, while allowing the user to continue watching.  Why interrupt the viewing experience.  This is something the Roku handles very well that amazon should take notes on.Apps.  There aren't many apps on this stick.  The ones available are all available on the Roku, out of the hundreds available on the Roku.  They have the largest names in apps, Netflix, Pandora, Prime (Built In of course), PBS, Plex, Disney, and a few others, not a whole lot more more though.  The stick has games though, but not ones that look all too interesting.  I sorted through those available and didn't see the need to download any.  Maybe they will come out with more.  The games are this stick's advantage, hopefully they will utilize it.It has Plex!  It works well, and the UI looks great!  This is a major plus.  I haven't tested the apps yet, this is how I watch the Colbert Report.  It would be nice if we can turn on an episode while waking up in the morning.  I will probably be using Plex more on this device than the other apps.  It also has Netflix, that's a major plus too.I would buy this device if you need another streaming device on a spare television and you don't want to buy a Roku (I don't have an apple tv, so can't compare).  I would also buy the device if you'd like to wait and see how Amazon updates their system (maybe you're curious).  Hopefully they will update the UI and make the system better before coming out with a Version 2 of this stick.", "verified": true, "helpfulness": "0/1", "author": "jon_show"}, {"rating": 5.0, "review": "Love it! Plug in and play. It even came registered with my account on it (nice touch Amazon). Now I can watch all my shows in one place.", "verified": true, "helpfulness": "1/2", "author": "David Hernandez"}, {"rating": 3.0, "review": "ConsSetup took me all day, it kept crashing--chatted with support, no one had a clueThere must be some problem between this device and my router because every time I play a video it stops every few seconds, I have no problem streaming video on my chromecast, even in a room farther away from the router.No one at Amazon seems to know how to troubleshoot this device, and I am still waiting for an email response after chatting with themProsIt it was working for me, I would love it, I love that you have the remote and that it allows you to install apps, the interface is great, but I can't seem to get it to stream video, so I am really frustrated with this device.  I wish they had some sort of manual that you can use to trouble shoot, so far they just keep telling me to unplug it, and plug it back in", "verified": true, "helpfulness": "1/3", "author": "Julie N. Hagaman \"juju\""}, {"rating": 5.0, "review": "**Updated**My first Fire Stick overheated and dropped the connection after about 30 minutes every time that I tried to use it . The only way to get it to work again was to unplug it for a while to reset it . After talking to the Stick support they took a bug report and requested that I return Stick #1 so I asked for a replacement to give it another go .Stick #2 works like a dream . No more dropped connections , navigation is faster , night and day difference . The temp difference was massive too . Stick #2 runs about 30 degrees cooler at idle and while streaming compared to Stick #1 . That's more like it .I haven't added Netflix yet to test but Prime streaming works flawlessly .I am really impressed with the Amazon CS team as well as my replacement Fire Stick . Great product .", "verified": true, "helpfulness": "24/35", "author": "Bryan"}, {"rating": 5.0, "review": "Set up in less then 5 mins.  Works just like the Fire TV.  Remote is easy to use (no voice commands though).  Only key difference between Fire TV Stick and Fire TV is that the stick is wireless and the Fire TV has a LAN cord that connects to a router.", "verified": true, "helpfulness": "4/5", "author": "lhodd \"idolfanatic\""}, {"rating": 4.0, "review": "it is fast and easy to set up. Not quiet a game changer, bcs we've been using out Blu-ray for years to get online. Some pros it is fast and has a very nice look. For Netflix you are actually downloading the app not the program so it seems to me you would still have to get on the computer to really do some looking for dvds and instant videos, but it works well so no complaints there. If the price stays low then it is worth it. One bad thing the controller is tiny and I can see it getting lost with 3 kids...", "verified": true, "helpfulness": "0/1", "author": "big al"}, {"rating": 5.0, "review": "The brief, Works as designed.  Received it yesterday and plugged it in.  Let it do the automatic update and all worked as expected.  Getting the battery cover off the remote was the hardest part of the whole process.Basically I own 4 streaming devices.  A small Windows laptop(with HDMI output), a Google Nexus 7 tablet, an older Roku (with RCA audio in/out so it can hookup up to my \"old tube TV\") and now the Firestick.  They all play the 4 \"main content streaming providers\" that I use.  Amazon Instant, YouTube, NetFlix and HuluPlus.The Nexus cannot play Amazon Instant (but does play Google Play), the Kindle FireStick can not play Google Play content. I understand why each company is \"locking out the others content\", but it really seems silly to me.  To be perfectly honest, I think Amazon has the \"upper hand\" on content over Google Play.", "verified": true, "helpfulness": "3/4", "author": "SJ"}, {"rating": 5.0, "review": "Nice..... got my for $19 with a preorder last month. Arrived in mail today - set-up was a cinch. Checked out Prime Videos and Netflix within minutes. I have a ChromeCast - this thing uses a lot more bandwidth and gives a nicer picture. Sideloaded bubbleupnp and vplayer easily and have the FireTV Stick streaming video from my lan dlna server (although navigation in bubbleupnp is going to take some figuring out). My android phones and tablets can also be used as remotes. I have it plugged into a computer terminal with hdmi input - simple semiportable setup.", "verified": true, "helpfulness": "1/2", "author": "Frank L. Warren"}, {"rating": 1.0, "review": "this is definitely not a chromecast killer.  not even close.  it constantly freezes up and crashes just from scrolling  up and down too fast.for apps,  theres next to nothing besides a few standard apps like pandora and espn and netlix and a few like that.  they show are very laggy in multi-player  to the point where its unusable.i will be returning unless some deveolpers can make this usable", "verified": true, "helpfulness": "0/11", "author": "mason"}]