[{"rating": 4.0, "review": "The twitch app has some bugs but I'm getting a great experience from Netflix and Prime Video. The twitch app sometimes cancels the video stream when casters play ads, which is sometimes annoying because you have to reselect the stream and watch an ad potentially a second time in a row before the stream will start again.", "verified": true, "helpfulness": "0/0", "author": "Josh Porter"}, {"rating": 2.0, "review": "I can't believe I'm returning a $19 Fire Stick. I have an Apple TV, and a Chromecast. I'm not wedded to any brand, I just want a cheap way to get Netflix on my older TVs, and if I can get Prime, bonus! I tried this unit on two different TV, and could barely get a network connection on either TV. I know that the Chromecast connected without issue, and it supposedly has a weaker wifi transmitter. I asked to exchange it, and Amazon directed me to the support page. They return everything without blinking an eye, but made a big fuss for an exchange? I don't get that. I wanted to give it a chance. I did get the unit up and running for a moment, and the interface looked nice, but the wifi issues are just too much to take.", "verified": true, "helpfulness": "0/0", "author": "Meatyard"}, {"rating": 4.0, "review": "I've got two of these guys and I like them quite a bit.  I purchased them for two reasons:  (1) watch content while on the road from the hotel and (2) watch content at home on 'dumb' flat screen TVs.As to on the road, its been hit and miss.  The major problem is captive WiFi at the hotel.  I side loaded Chrome and Firefox and in one case could answer the terms of service question.  In the other case no.  I sure hope Amazon comes up with a solution to this captive WiFi issue that works as no one out there has a solution.  They promised is - we shall see if they come through.  In the future I will just take my iPad, a HDMI adapter, and an HDMI table and forget the AFTS.  The other thing I would say that the one time I did get it to work the Plex client was not too great.  It paused every 10 to 15 seconds and was not useable.  Netflix and Amazon Prime were perfect.  Other apps had pausing issues occasionally.  I think it is the Plex client on the AFTS as Plex on the iPad at the same time worked just fine.  My son has an Amazon Fire TV box and we really couldn't see any difference in performance between one and the other.As to working here at home on the local network, no problems - even with the Plex client.  I know it seems like it could have been just the remote access but again the iPad worked fine on the road where as the AFTS did not.Altogether I'm happy with the purchase and they do exactly what I wanted when it comes to home use.  Amazon could have a much better device if they solve the captive WiFi problem.", "verified": true, "helpfulness": "0/0", "author": "Dean H. Wooldridge Jr."}, {"rating": 4.0, "review": "I expect this product to only improve with time.  As more apps are developed, the content possibilities will only grow.  Notably absent are a few sports content apps I would like to see, including Fox Sports Go and The Golf Channel.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy peasy", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 4.0, "review": "Not as good as the full blown fire TV, but almost!  Definitely miss the voice search as it doesn't come with a voice remote, but that can be remedied either by buying a voice enabled fire remote or by downloading the app for your smartphone. Of course it isn't as snappy as the bigger version, but this is way more portable and is nice and easy to take with you on trips or to a friends house or if you just want another streamer for a different room in the house.", "verified": true, "helpfulness": "0/0", "author": "Bill Brasky"}, {"rating": 4.0, "review": "The fire stick has started to overheat-it gets so hot that it can't be touched, and when it overheats the playback becomes choppy and the video eventually freezes while the audio continues.  I've taken it out of service and am waiting for a response from Amazon.  Hopefully this is an isolated incident and Amazon will quickly make it right.It's located in a position where there is ample air flow in a room that is kept at 65 degrees.Update:  Amazon quickly replaced this one and send a prepaid shipping label to have my overheating unit returned to their engineering dept.  The replacement unit works as it should without the overheating, picture freezing and other quirks.  Kudo's to Amazon for their customer service and quick response.  I've also updated my rating to reflect the replacement, working unit.", "verified": true, "helpfulness": "0/0", "author": "Michael Chiodo"}, {"rating": 3.0, "review": "The stick will definitely get \"warm\" during use (I'm using the included AC adapter) and drop the network connection requiring a power disconnect to re-enable networking.  It's the perfect size for being obscure and hidden but unfortunately it just isn't as reliable as the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 4.0, "review": "Not bad.  Only froze up once.  Love the smartphone and tablet control features.  Totally worth it with prime membership.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Am having fun with the fire stick!! So easy to use. Love it!!", "verified": true, "helpfulness": "0/0", "author": "karen z shafer"}]