[{"rating": 5.0, "review": "Easy set up. I love it!!!", "verified": true, "helpfulness": "0/0", "author": "LaVonne Coles"}, {"rating": 3.0, "review": "The only problem I've had is with the controller, which tends to double (tripple, or more) click when I just click once.  Overall it's OK.  I was expecting a bit more though... the Amazon website is actually a better interface to the prime videos than the Fire TV Stick is.  Also, with the Amazon App provided by PS4, this ended up being a bit redundant for me (I bought this and the PS4 not knowing the PS4 had an Amazon app).", "verified": true, "helpfulness": "0/0", "author": "carlosjhr64"}, {"rating": 5.0, "review": "Very happy with the Amazon Firestick! Just had to unplug cable and TV then reboot and the HDTV recognized the firestick. Just followed directions. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Bruce Mc Laughlin"}, {"rating": 5.0, "review": "Works great. I was worried that the connection wouldn't be as great as a full-sized TV box, but I haven't had any trouble so far. I use it for Netflix and HBO Go and both work perfectly.", "verified": true, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 4.0, "review": "It ask for my wifi password every other day and that is fruatrating", "verified": true, "helpfulness": "0/0", "author": "Edward Dufresne"}, {"rating": 4.0, "review": "Everything amazon seems to work fantastic on the Amazon Fire TV Stick. Prime movies and TV shows run smooth and I like the fact that you can buy movies directly from this device unlike my old xbox one.There are not many great games and aps for this but that's not really the has been awful on this device. Every show I've tried to watch is glitchy every 15 seconds which was incredibly annoying. Other than that I have no complaints. Interface runs smooth and the start up time when turning your fire stick on is about 2 seconds. Since I have an Amazon prime account this was a great buy.", "verified": true, "helpfulness": "0/0", "author": "clam digger"}, {"rating": 5.0, "review": "What a great improvement to my television-watching experience!", "verified": true, "helpfulness": "0/0", "author": "Kimmie"}, {"rating": 5.0, "review": "I wasn't sure if I could handle this. I'm not too adaptable to new things. I love it. The options to watch are varied and I haven't explored it all yet but I'm getting there.", "verified": true, "helpfulness": "0/0", "author": "Patricia Ryan"}, {"rating": 3.0, "review": "No problems at first. Now it won't stay connected or stream. In a nursing home. Help!!!", "verified": true, "helpfulness": "0/0", "author": "mom"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]