[{"rating": 3.0, "review": "Hi ..I was wondering if anyone has a nexus 6 phone and if its compatible with the fire stick? Thanks", "verified": false, "helpfulness": "0/0", "author": "Debie"}, {"rating": 5.0, "review": "I really like the fire stick. I thought that all movies were included with prime which is not true but, overall I'm very pleased with the product.", "verified": true, "helpfulness": "0/0", "author": "Emily Sizemore"}, {"rating": 5.0, "review": "What could be easier?  Plug it in and go.  Very effective.", "verified": true, "helpfulness": "0/0", "author": "D. Asmussen"}, {"rating": 5.0, "review": "Love it.....Love it....The pictures on my HDTV are amazing", "verified": true, "helpfulness": "0/0", "author": "S. Robinson \"pstryshar\""}, {"rating": 5.0, "review": "We use this with Plex to have access to our TVs and Movies around the house. Plus it's so nice that it's automatically tied to your Prime account, AND you can watch Hulu, Netflix, and listen to music on it too. We don't use the games too much, except for some Tetris and trivia, but I'd imagine you'd want the full Fire TV if you were gonna play real games.", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "it will do all that it is listed to do, and it is very easy to use", "verified": true, "helpfulness": "0/0", "author": "indexer"}, {"rating": 2.0, "review": "The user interface is great.  I like the way it classifies the content and shows the art.  The interface flows well, much better than the native browser interface.  My problem is that the wi-fi adapter or the integrated player must be of a very low quality because I couldn't get enough bandwidth to stream anything and it wouldn't adapt to a lower profile/bit rate to get the content to flow.  I have both wired (W7 and W8 PCs) and wireless devices (iPad, iPhone, and Surface), all of which have no problem streaming Amazon Prime content.I returned the stick.  Thought about getting the Fire TV box, but not for $99.", "verified": true, "helpfulness": "0/0", "author": "johnfromva"}, {"rating": 5.0, "review": "Perfect for catching up with your favorite series's.", "verified": true, "helpfulness": "0/0", "author": "lkell"}, {"rating": 4.0, "review": "It works very well, the kids watched movies all weekend long.", "verified": true, "helpfulness": "0/0", "author": "Jeff Steere"}, {"rating": 5.0, "review": "Great option for those wanting to watch Netflix, Hulu Plus, Amazon Prime Instant Video, etc. It's not quite as fast as the Amazon Fire TV but that's to be expected. I have the Fire TV in my main living room and the Fire TV stick in my basement rec room and they both work great. I was able to install android apk files to add custom apps as well. Love it.", "verified": true, "helpfulness": "0/0", "author": "J. Nichols"}]