[{"rating": 5.0, "review": "Works great & setup was simple. I like having the iPhone app to control it too in addition to the included controller", "verified": true, "helpfulness": "0/0", "author": "Edward C Anderson"}, {"rating": 1.0, "review": "It often has trouble connecting to the internet.  It tries to claim there is a problem with the network or router, but all other wireless devices still work.  After restarting it several times, occasionally it will start to work. When it does work it seems to work well, but I haven't had it working enough to connect my phone yet.", "verified": true, "helpfulness": "0/0", "author": "bd"}, {"rating": 4.0, "review": "The Fire TV stick is a great device, and Amazon content works very well. If that were all I had to say, it would be a five-star device.My major pain point is that navigating through menus is agonizingly slow and Starz and HBO apps (which are already slow on Fire TV) are sometimes unusable.Pros:- Almost any content you want is available- Once videos are streaming, they're smooth and beautifulCons:- Performance, but for the price it is expectedWe own two of these along with a Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Awesome product I am loving it.", "verified": true, "helpfulness": "0/0", "author": "Rama Chada"}, {"rating": 5.0, "review": "Love the ability to watch almost any show any time that I want to!", "verified": true, "helpfulness": "0/0", "author": "Kevin Rollings Jr. \"irishfan\""}, {"rating": 4.0, "review": "We're a mixed-device cord-cutting household, and I purchased my first Fire Stick as part of Amazon Prime Day's special.  Prior to that, we were using a mix of Rokus and gaming consoles for all of our streaming needs.  When I saw a good price on the Fire Stick though, I figured it was worth a shot.I'm honestly glad I took the plunge.  It's not perfect, but there are a lot of things I like about it.  I like the integration with my Prime Account, directly from the home screen.  I enjoy it's ability to multi-task, so I can stream Prime Music while I'm playing Solitaire on the couch.  The selection of channels is nice.  Sure, you don't get the private stash of channels like you can with Roku, but those can definitely be hit or miss anyway (how many channels do I need running the same 50's movies and TV shows, really?)And Pluto.TV.  Oh my gosh, Pluto.TV.  Finding this was a godsend.  Free themed and curated Youtube channels running in a \"live TV\" format.  Turn it on, put on your favorite channel, and you're all set.  I can constantly find MMA, Kickboxing, Tech reviews, headline news, movie and entertainment news, and apparently a channel called Cats 24/7.  Yeah, you heard right.With Pluto.TV, for a cord-cutter looking for the optimal streaming device, it's hard to argue against the Fire Stick.It's not all perfect, mind you.  I don't like how to do a \"Force Stop\", you have to go into a sub-menu of a sub-menu of a sub-menu.  Force Stop should definitely be one of your choices when you highlight an app.  And as awesome as Pluto.TV is, it still can be a little glitchy at times, slowing down your Fire Stick and making you either Force Stop the app or a soft reboot.  (That's not Amazon's fault per se, but it's worth noting.)  The Prime integration is very nice, but it often feels like it dominates your home screen, and you sort of feel like it's always in \"Sell Mode\".  You can't arrange your apps the way you want, your navigation choices are either alphabetical from a sub-menu, or \"Recent.\"Some of these are nit-picks, of course, but they do keep it from earning that fifth star from me.  There are things that I like better on Roku, certain channels only available there, and the ability to arrange my app icons the way I want.  But overall, the Amazon Fire Stick is a solid, polished product that brings some good stuff to the streaming table, and I feel like for a lot of folks, a mixed solution like mine--Rokus in some rooms, Fire Sticks in others--will end up being the best solution.At any rate, I liked it enough to go back and purchase a second a few weeks later at full price, if that tells you anything.  I do recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Ken B."}, {"rating": 5.0, "review": "This is an awesome piece of gear! Buy it!!", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 4.0, "review": "The fire stick arrived on time. The instructions were easy to follow. I had no trouble with the installation. It works well. The only problem is I share my daughters prime membership, and it won't let me view Prime videos under her name, because the fire stick was purchased under my name.", "verified": true, "helpfulness": "0/0", "author": "Philip Horrocks"}, {"rating": 5.0, "review": "Love the device it has everything my family needs from my older children to the grandchildren.", "verified": true, "helpfulness": "0/0", "author": "williemae haden \"Williemae Haden\""}, {"rating": 5.0, "review": "Awesome, worked just as described. Not sure what the other neg. reviews are about.", "verified": true, "helpfulness": "0/0", "author": "Tomas Omalley \"Liquidmind314\""}]