[{"rating": 2.0, "review": "The only reason I give it 2 stars is because it cannot stay connected to my internet for more than 15 minutes it seems. Literally no other internet related device will be having a problem in my house, yet the Fire TV Stick constantly says it cannot find my wifi network. It is even located directly below the room with the router in it. I wish it didn't have such poor internet connectivity, because it truly is a great device!", "verified": true, "helpfulness": "0/0", "author": "Terry"}, {"rating": 3.0, "review": "Requires a lot of bandwidth of internet, you need very fast internet connection", "verified": true, "helpfulness": "0/0", "author": "Laura O."}, {"rating": 4.0, "review": "this sitll needed to be connected by usb cable to the power adapter supplied with it.  i tried it on two tvs and does not work by just plugging into the hdmi port...otherwise it works very well and the interface is great", "verified": true, "helpfulness": "0/0", "author": "dan cha"}, {"rating": 5.0, "review": "Like it", "verified": true, "helpfulness": "0/1", "author": "BOB F."}, {"rating": 5.0, "review": "I first went the cheap route with Neo TV, horrible. The stream kept stopping on Netflix, not a lot of options. I bought the Fire TV Stick with the Sling TV promotion, and it's wonderful. I didn't even know it had an app for MLB TV. Amazing.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Price"}, {"rating": 4.0, "review": "I love my new Fire Stick, I can watch Netflex and Amazon on my Non-Smart TV.What I don't love is some of the TV programs don't continue to the next episode. Then I have to search for the program and then keep advancing until I am at the right episode.", "verified": true, "helpfulness": "0/0", "author": "Kathy Bauwens"}, {"rating": 5.0, "review": "Best invention ever!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "otaku_4ever"}, {"rating": 3.0, "review": "This is fine as long as you are okay with slow and interruption buffer periods and Netflix working sporadically. Haven't made it through one full episode on Netflix yet... I've been trying for a month. The other services are okay most of the time. I would not buy again.", "verified": false, "helpfulness": "1/1", "author": "michael"}, {"rating": 5.0, "review": "Bought this for my 74 year old mother who does not have the money for cable. She was able to navigate and set up on her own, which is a feat. Works well, she never has any issues accessing what she wants to watch. Should have bought years ago!", "verified": true, "helpfulness": "0/0", "author": "Noell Jackson"}, {"rating": 2.0, "review": "I would spend the extra money and get an Apple TV. The price is great but waiting for it to buffer almost constantly is not. I also own an Apple TV that runs on the same connection and it runs smooth. It is double the price but what is your frustration worth", "verified": true, "helpfulness": "0/0", "author": "Jon Hunter"}]