[{"rating": 5.0, "review": "Luv it but got quantity of two.  Think I'll keep for gift or another home tv.  Thx luv it", "verified": true, "helpfulness": "0/1", "author": "debbs \"poldarksearcher\""}, {"rating": 5.0, "review": "the only way to make it better would be to add you tube or vevo type apps for music videos", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"pog1187\""}, {"rating": 5.0, "review": "Awesome. So easy to use, especially if you have amazon prime.  I prefer it to roku. Fire stick is Easier to set up!!!", "verified": true, "helpfulness": "0/0", "author": "nikkimc11"}, {"rating": 5.0, "review": "Dropped cable 11 years ago and have not looked back.  The Fire stick rocks!!!", "verified": true, "helpfulness": "0/2", "author": "2007 POG Contest"}, {"rating": 5.0, "review": "Better than expected. It isn't a roku but it is great.", "verified": true, "helpfulness": "0/1", "author": "Nelson G."}, {"rating": 3.0, "review": "It works very well with the apps available to it. It should have more access to the Amazon app store. You can side load apps but why should you have to?", "verified": true, "helpfulness": "0/0", "author": "B. Carmack \"Rev. Bill\""}, {"rating": 5.0, "review": "Great", "verified": false, "helpfulness": "0/1", "author": "Todd Matukaitis"}, {"rating": 4.0, "review": "The Fire TV Stick does exactly what I wanted it to. I can now watch movies and shows from my Amazon instant video and Prime instant video on my TV instead of on only my computer.", "verified": true, "helpfulness": "0/0", "author": "David Haley"}, {"rating": 5.0, "review": "I pre-ordered the Fire TV Stick when it was being offered to Prime members at half price. Should have bought more as they were selling for over $100 on eBay just before Christmas. Anyways, the Fire Stick is pretty basic and very easy to use. Navigating through the GUI is also a breeze.The only hiccup I ran into was not being able to output sound through my HDTV's Toslink optical connector to my surround receiver. I could only get sound through the TV's speakers.The work around is that I connected the Fire Stick to one of the available HDMI ports on the back of the receiver instead of the TV and that worked out fine. Would like to know if anyone else has had that problem.To be honest the Fire TV Stick sat unopened for two weeks after it arrived until it became the hero on Christmas Eve. That's when Sony experienced the much publicized hack attack on the PlayStation Network which meant we could not log in to Netflix via our PS4. Then, a light bulb came on in the old cranium and it dawned on me that we had an alternate source to watch Netflix. (Duh!) So a big thanks to Amazon for the Fire TV Stick which is now our new primary source for streaming media content including Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Dano \"Daniel Contreras\""}, {"rating": 5.0, "review": "I love this easy way to watch Amazon tv hits, such as Transparent, and catch up on older series too.", "verified": true, "helpfulness": "0/0", "author": "Dr.Lynn"}]