[{"rating": 5.0, "review": "Quick and easy to set up, streaming seems to be fast and clear.  Easy to move between TV's in case you have kids that want to watch something.  If you'd rather search with a voice controller, there's a free app in the apple store for it.  Great product!", "verified": true, "helpfulness": "0/0", "author": "Jennifer McEwin"}, {"rating": 3.0, "review": "While you will find a lot of glowing praise from loyal Amazon reviewers I find that I must add the one problem with this stick that is not mentioned in the other reviews that I read.  I must point out that this stick will do everything that it says it will do, and for the most part do it well.  The price is good but I feel I paid more for fancy packaging instead of performance.  When streaming from Netflix or Hulu I find that the show will skip 1 or 2 seconds every 6 to 8 minutes.  This can be annoying when it happens during a crucial dialog moment and you have to rewind to catch what was said.  Incidentally, this problem does not manifest when streaming from Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Igziabeher"}, {"rating": 5.0, "review": "I was used to stream my videos on my Xbox but I was paying for Xbox Live over the other streaming services so I started to look for a final payment solution. I saw the amazon stick offer and the benefit of having one as a prime member with a Kindle in the house and I thought This Might be one!. When I got it I spend 10 minutes learning how to use it and lot of hours just looking at the options i had.Here are just few:My daughter can play the games of her tablet on the big screen and download new ones.With the ASAP technology videos load twice faster.To See Live sports gamesHeard music.Friendly Interface, even for my 60+ years mom.And take all of this where ever you go and when ever you want on its good looking box.And lot more if you are Prime memberTry it. You wont regret it.", "verified": true, "helpfulness": "0/0", "author": "Omar E. Peralta \"op-tech\""}, {"rating": 3.0, "review": "can't mirror Windows 7.  Otherwise had everything I needed.", "verified": false, "helpfulness": "0/0", "author": "Vishal"}, {"rating": 2.0, "review": "Got this stick because Amazon has decided not to make Prime instant video compatible with Chromecast. Setup was super easy (there wasn't any), and the menu system looks great and works well. The remote is nice looking and functions well. Amazon content plays pretty much flawlessly, and some apps (Red Bull TV, Plex) generally work pretty well. Ability to rent movies and stuff is cool.The bad news is that this thing does not seem to play nicely with Netflix at all, and from checking out the support forums this is a pretty common problem. This thing has logged me out of Netflix for no reason, causing me to have to re-enter my password etc (which is a real pain with the remote), and on a regular basis it gives me a message saying it's unable to play/load the content. Diagnostics show that it's connected to all available Netflix servers, so it's a bit of a mystery to me. Streaming Netflix via browser on my laptop has worked fine in every instance, so it's not a problem with Netflix. People have had some luck clearing the cache and unplugging/replugging, but I've had mixed results. Some people seem to have no problems, but it's been enough of a headache that I just use the chromecast for netflix now.There are a few other minor points (lack of real YouTube app for example) that I don't like but aren't a huge deal. The main thing is that if you want this to be your do-it-all smart tv attachment thing you may have mixed results. Some people have no issues with Netflix and other apps, but for me it's been enough of a hassle that I'm thinking about getting a Roku.", "verified": true, "helpfulness": "0/0", "author": "bkm"}, {"rating": 4.0, "review": "Very nice product to have.  I enjoy how I can side load other Android apps onto it from my local home network and be able to view or play them on my TV.  I would recommend this for viewing just about everything.", "verified": true, "helpfulness": "0/0", "author": "Jean-Paul M"}, {"rating": 5.0, "review": "The Google Chromecast was a great idea, but came up a little shy of the \"Total Package\", since it completely lacked the ability to operate on its own (it cannot even be connected to many hotel wireless networks), and had no 5GHz capability (Can you say range/speed limitations?).  Then, along comes the Amazon Fire TV Stick...PROBLEMS SOLVED.  Now I can browse to the Hotel's wireless registration re-direct page, in order to get internet access; at home, I can go ahead and connect to my 5GHz network for better wireless range, speed and latency.  I do wish that the Wireless Display feature was available from the main navigation menu, rather than having to drill down into settings, but it's a small price to pay for such a big functional improvement.  The CPU/GPU offers plenty of horsepower to run the apps and games you've been using on your phone/tablet (it's pretty impressive for a tiny device) and the remote is nice and simple, but still perfectly functional.  Amazon's app selection is pretty good, but side-load Kodi (which runs smooth as silk chocolate), and your content options are limitless!  Even if you're NOT an Amazon Prime member, this stick can (and will) give you access to a plethora of handy apps and features on your TV.  What's not to love?  I just ordered a second stick for my mother, and I foresee a third one for my daughter to take with her to college.  Please believe me, this stick has far more functionality than what Amazon describes in their product description...just do a quick web search of Fire TV Stick and read a few techie reviews, and you'll discover all kinds of great ideas for it.  And, as I mentioned above, side-loadind Kodi may very well change the way you think about TV...just read a little bit about Kodi and TVAddOns...you'll love 'em.  Here's a good place to start: http://www.htpcbeginner.com/best-kodi-addons-2015-for-cordcutters/", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "I had a bit of a problem getting started but love it now that it's working. Very easy to bounce around within its apps.", "verified": true, "helpfulness": "0/0", "author": "Francene Figg"}, {"rating": 5.0, "review": "So, I don't normally write reviews for products, but I felt that it was necessary to do this. We received our fire stick yesterday and have been enjoying service on it ever since then. We were able to receive the stick for free by using the promotion from sling tv. Now we are able to stream 20 live channels of tv along with other amazon and Netflix content on our second tv. On our primary tv we have an Xbox one system. This device streams better than that, and I am considering the purchase of another fire stick. This device really is worth the 40 dollar price, and if you can also get yours for free from sling.com, it just sweetens the deal!", "verified": true, "helpfulness": "0/0", "author": "t8washere"}, {"rating": 5.0, "review": "Very happy with the Fire TV Stick.  Have seen Chromecast and although it is also good, I went for the Fire Stick because of the remote, which is really nice to have.  I think there were other plusses with the Fire Stick that Chromecast did not have, but can't think of them right now.  I bought this for my two boys to use in their room and they love it as well.", "verified": true, "helpfulness": "0/0", "author": "Stephen Langele"}]