[{"rating": 3.0, "review": "OK but nothing special to write home about.  Navigation is clumsy.  Nice try.", "verified": true, "helpfulness": "0/1", "author": "Foster"}, {"rating": 5.0, "review": "I was lucky enough to get this when it was available for preorder at a great discount. It's incredibly easy to install and set up. I use it primarily to listen to amazon music and Prime Streaming video. The menus are easy to navigate. It's a simple way to add features to your television.", "verified": true, "helpfulness": "0/1", "author": "Avid Reader"}, {"rating": 2.0, "review": "When i first hooked it up, I thought it was amazing! Then after the movie on netflix I was watching was done, the input on TV said DVD Player with blank screen. Could not hit home button or anything. Who knew I would have to reboot my tv (thought that was only for computers). so I reboot TV... comes back and midstream as I am scrolling through my netflix list, TV goes back to DVD player (no, a DVD player is not connected - only this device) and blackish empty screen. I rebooted TV again, and no firetv logo comes up, still says DVD even when I choose input button on my tv. This stinks as well as having to painfully enter my netflix username and password every single time I  access it. Hmmmmm wondering if I will send it back", "verified": true, "helpfulness": "1/4", "author": "blossom"}, {"rating": 5.0, "review": "Super easy. We love it!!", "verified": true, "helpfulness": "0/0", "author": "ND"}, {"rating": 5.0, "review": "Works great! Like having a amplifier on your network.", "verified": true, "helpfulness": "0/0", "author": "Hardaway33"}, {"rating": 3.0, "review": "When Amazon announced the stick, and offered a special price of $19 for Prime members, we decided to go for it. I had been wanting to get a newer model Roku, or even the Roku streaming stick, but this was less expensive, and would provide a streaming option for the one TV that lacked it.Setup was extremely easy, which is a definite plus. I hooked it up and had it connected to the network within a couple minutes, and was able to start exploring the options.I've had a Roku player for a few years, so I'm used to that interface, although I know that the newer models have an updated look to them. The Fire Stick interface seems very cumbersome in comparison. Granted, it really is designed around Amazon Instant Video, but they seem to neglect the fact that they promote it as a good device to stream other video sources as well.I found the app/channels to be very lacking. Where the Roku has hundreds, maybe thousands, of channels to choose from, the Fire Stick seems to have tens of channels. Sure, I don't use all the channels available to Roku, and there are many more than what I can have installed at one  time, it's nice to have them. The Fire Stick talks big about having more memory than other devices, but if it has nothing to use that memory for, it's pretty pointless.I like having the option to use my photos that are stored on my cloud drive as a screen saver, but then if it goes into screen saver mode, it means I'm not watching it anyway.Prime Music is good, but I couldn't find a way to add any other music on the Fire Stick itself. Apparently I have to add songs/albums to my playlist via the computer, which doesn't make for a seamless user experience.I downloaded the remote app for my phone. Not impressed in the least. Instead of having buttons to navigate with, you have to slide you finger in the direction you want. This works, somewhat, but makes it extremely difficult to navigate precisely to what you want. It either goes to far, or the wrong direction, or not far enough. Also, without having a selection button, you are supposed to just tap, but that doesn't always work. I tried playing a multi-player game, and I could use the remote that came in the box, but the remote app would not work, because it didn't have a select button. Again, Roku wins out in the remote app contest.It's not all bad, of course, and if all you're doing is watching Amazon video, it's great. It just seems to be lacking in so many areas, where they could have done much better.I was thinking of using the Fire Stick as my main streaming device, and putting the older Roku on the other TV for the children, but I'm pretty sure that's not going to happen. I've found myself using the Roku more than the Fire Stick. It's familiar, offers more options, and a more pleasing user experience overall.I'm fortunate to have only paid $19 for this, and I really don't think it's worth the $39. I am so very glad that I didn't spend the money on the full size Fire TV box. Think I'll save up for a new Roku one of these days, Amazon has a lot of work to do yet.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This amazing fire stick was so easy to set up .Amazon has a video to show you how to use this but it only took me 3 minutes to start watching Amazon prime movies . I can get rid of Dish network now because Amazon has so many movies and shows to choose from, I think Amazon just hit two homeruns with this and the Amazon Echo smart speaker which my whole family has fallen in love with because it really is a smart speaker that listens and answers your questions. I wonder what Amazon will come up with next. I can hardly wait to find out", "verified": true, "helpfulness": "3/3", "author": "aafan"}, {"rating": 5.0, "review": "Shipped sooner than anticipated, prompt notification of arrival. The Fire Stick was packaged well, with relatively little waste, aside from the unnecessary plastic wrap around the components. The Stick is very straightforward to install. Plug it in your TV, plug it into the USB power, change the tv to the HDMI port and follow the instructions on the screen. ID your Wi-Fi network, enter your password, Stick checks for updates and your live. The \"help\" video was longer than the time to actually update it and be trolling for videos. As a Prime and Netflix customer, I've gotta say this is one of the best scores of the year.  Now if Amazon can work with Microsoft to integrate the voice control with Cortana on my Windows phone, life will be grand!", "verified": true, "helpfulness": "0/0", "author": "R. S. Daly"}, {"rating": 1.0, "review": "Worthless five minute intro video made me shut the whole thing off and go back to chromecast.", "verified": true, "helpfulness": "0/11", "author": "ColinP"}, {"rating": 5.0, "review": "I have the regular Fire TV also for main tv (love it)...bought this for bedroom tv and I love it.  The voice remote is nice, but this gives you an alternative to save some money.", "verified": true, "helpfulness": "0/0", "author": "Youki"}]