[{"rating": 4.0, "review": "technology is really amazing", "verified": true, "helpfulness": "0/0", "author": "Bob Radomski"}, {"rating": 5.0, "review": "This thing works great, super easy to get set up and going.  Our TV viewing has been greatly expanded and the picture quality is excellent in HD.", "verified": true, "helpfulness": "0/0", "author": "Robert F. Steele \"piano lover\""}, {"rating": 5.0, "review": "This is such a bargain of a product, I love it!", "verified": true, "helpfulness": "0/0", "author": "K. Whyte \"Music Junky\""}, {"rating": 5.0, "review": "Works great, just as described", "verified": true, "helpfulness": "0/0", "author": "Dawn Rumin"}, {"rating": 5.0, "review": "so glad that I bought it! I have access to so many movies has so many different things on it it would take me a lifetime to see everything. I highly recommend purchasing this. You will not regret it. it will make you cancel Netflix!", "verified": true, "helpfulness": "0/0", "author": "Marcia Hayes"}, {"rating": 3.0, "review": "Not as strong as I thought. But maybe it is my equipment", "verified": true, "helpfulness": "0/0", "author": "Kmhooker \"Kathleen\""}, {"rating": 5.0, "review": "So far this thing it is AMAZING. I have a flat screen- not smart TV in the bedroom, and now I can watch everything I want!Extremely intuitive. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "tlynne \"terri davis\""}, {"rating": 5.0, "review": "Wow, do I love this or what. Everything I'd need for all my Television, Music, Movies, Photo pleasure all at my finger tips with the easy-to-use remote and the smallest device ever. No more messy wires going across your room. I love this & recommend it to anyone who uses a Television set!", "verified": true, "helpfulness": "0/0", "author": "John Stamos"}, {"rating": 3.0, "review": "Plug and play. I enjoy using my IOS as the remote control. Too many pay for use apps though...", "verified": true, "helpfulness": "0/0", "author": "Jason H."}, {"rating": 1.0, "review": "The firestick constantly runs slow, freezes, and it's just not worth it. Unless you have the patience  of Job, just get a chromecast. I have both, and I've had my chromecast longer and it works like a dream. I got the firestick because as a prime member, I got it for 50%, so I figured, why not? Now I know why, lol. It sucks, or I just got a really bad one.", "verified": true, "helpfulness": "0/0", "author": "wkugirl382"}]