[{"rating": 5.0, "review": "Love the stick. Hate the app", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great!  No longer have to go thru my WII to get to prime. The app with voice search is a great enhancement.", "verified": true, "helpfulness": "0/0", "author": "paul willner"}, {"rating": 5.0, "review": "Easy to use and set up.  It's as portable as you can get, so it's easy to move to a diff. room or even someone else's house to watch movies. Have had zero issues, so I bought a second one.", "verified": true, "helpfulness": "0/0", "author": "Olgier"}, {"rating": 1.0, "review": "It looks like Amazon is making you buy a $99 a yr membership to use this product... Or it well not work save your money.", "verified": true, "helpfulness": "0/1", "author": "Derrick"}, {"rating": 5.0, "review": "We love this.  Best $40 dollar purchase in a long time.  We already had amazon prime and Netflix and now we can actually use them.  We will most likely cancel our satellite TV and just use the fire stick.I only wish the remote was a little larger as it cab easily get misplaced with kids.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 5.0, "review": "I love the fire stick. Lots of great content for so little money. Some occasional glitches and I wish there was an \"information\" button to tell more about individual shows", "verified": true, "helpfulness": "0/0", "author": "jonnygreen"}, {"rating": 4.0, "review": "Works well. Occasionally gets warm and starts jumping but that is not a big deal.", "verified": true, "helpfulness": "0/0", "author": "Mary Hatfield"}, {"rating": 5.0, "review": "So far, so cool.  Not really all that different from Roku box that we have, still have to plug it in to a wall socket for power, but the portability is nice if you don't have smart TVs.", "verified": true, "helpfulness": "0/0", "author": "C. Rollins"}, {"rating": 5.0, "review": "", "verified": true, "helpfulness": "227/242", "author": "Gary R. Sunneberg"}, {"rating": 5.0, "review": "Great experience so far. Had it for about 2 weeks now.", "verified": false, "helpfulness": "0/0", "author": "Carlos"}]