[{"rating": 1.0, "review": "I got the Kindle Fire TV Stick for a spare bedroom and had high hopes for it since I love all my other Kindle products but I actually could not get it to play. The remote was not very responsive and would delay 15-20 seconds before the indicator on screen would move. I pressed the button so many times that by the time it would start moving on screen it certainly went way past the item I was trying to reach. It wasn't a problem with my internet because the other items connected worked and responded as they always did. I had to return the Fire Stick and got a Google Chromecast instead. I've had no problems with the Chromecast.", "verified": true, "helpfulness": "3/3", "author": "Victoria"}, {"rating": 5.0, "review": "Greasy product; easy set up with great connection!", "verified": false, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Device worked great when it works. Stream came through HD quality and kept up with fast forwarding. It had a difficult time staying on my Wireless, not like my SmartTV or my CCast. Sometimes there was no Audio from my Streaming, in which case I needed to power down and reboot the device. I had to power cycle about 1-2 times a week.", "verified": true, "helpfulness": "1/1", "author": "J. Lee"}, {"rating": 5.0, "review": "Everything I was hoping it would be. Love watching amazon prime video in HD. Easy setup and use", "verified": true, "helpfulness": "0/1", "author": "Francis Felice"}, {"rating": 5.0, "review": "Wonderful gadget,  have not used a cable channel in several days.........", "verified": true, "helpfulness": "0/0", "author": "Keith A. Felton \"AVCHD editor\""}, {"rating": 3.0, "review": "BEWARE! - This ships preloaded with your Prime credentials.  I almost gifted this after purchasing, glad I didn't. Powered it up and it was connected to my Prime account including photos I sync'd from my cell phone.Make this a little better by requiring credentials during setup.", "verified": true, "helpfulness": "0/0", "author": "Hugemongus"}, {"rating": 2.0, "review": "I like the features of the Fire Stick, but I've had constant issues with connectivity. I have many other devices (eg cell phones, tablets, game systems) that never lose connectivity to the internet. However, the Fire Stick frequently has difficulty with the connection. If this is improved, the Fire Stick will be an excellent device due to the large number of apps available for download, the included remote control, and the Amazon prime content. In fact, you could get rid of cable if you also have Netflix and Hulu plus.", "verified": true, "helpfulness": "0/0", "author": "michael629"}, {"rating": 4.0, "review": "So, I have a Roku 3, an older Roku, Chromecast and Fire TV Stick in my home. In order of preference, the devices are Roku 3, Fire TV Stick, older generation Roku, Chromecast. Here is why the Fire TV Stick ranks second. I've had the Stick for around a month now.Pros:Modern version of Netflix, complete with profiles.Best Prime Instant Video browsing experience.Fully functional as a stand alone device.Allows reception of streaming signals from devices, though haven't used that functionality yet. It shows up along with ol' Chromy Dubois (my Chromecast) and Roku boxes from YouTube, etc.Cons:No Vudu, MGo, Play Movies, etc. By default this means I won't be using this in the main rooms of my home. We have a lot of digital movies which won't show up in the lone UV platform for Fire TV (Flixster). By choice of content provider, Fire is the worst of the platforms, even though it will be fine for most consumers.Streaming issues. Netflix is rock solid, Hulu and Prime Instant Video are extremely touchy. The Fire TV Stick is 10 feet from my router and is 5 feet closer to it than my computer in the same room. The Roku 3 is an additional 15 feet away through an additional wall, it can be playing videos from Amazon Prime Instant Video or Hulu with no issues, as can my computer. This is my biggest gripe with the unit. I have reset the cable modem and router and that has not helped the issue.Sometimes the signal from the remote to the Stick gets \"stuck\" for a second, pressing an arrow 3 or 4 times instead of once.Initial updates to software was annoying, especially reentering passwords. I think I spent about a half hour as it downloaded updates.Neither a pro or con:Allows app installation. So far haven't really needed to do so, installed a couple of things, but using the remote isn't ideal for most apps.Summary:If I had never had a Roku, I'd be blown away by the Fire TV Stick. I got it at the introductory price and for less than $20 it is a total steal, and I wholeheartedly recommend it over the Chromecast. If I need to buy another streaming TV device, it will likely be a Roku, I may pay $10 - $30 more for the box, but it is the better choice for me until Amazon fixes the buffering issues and let me access my content directly from the stick.", "verified": true, "helpfulness": "0/0", "author": "Matt Griffith"}, {"rating": 5.0, "review": "Wow..great product....connectivity is excellent, it is well though out..and easy to connect!", "verified": true, "helpfulness": "0/0", "author": "Keif"}, {"rating": 5.0, "review": "Awesome device with extras if you know what I mean ;-)", "verified": false, "helpfulness": "0/0", "author": "Fred carver"}]