[{"rating": 5.0, "review": "This is an amazing little device.  I am not real tech savvy so I was pleasantly surprised how easy the set up was as well as navigating through the various apps.  I would definitely recommend.  I just wish Amazon Prime had more (read watch-worthy) free content.  The prices on the movies and TV shows is a little ridiculous.", "verified": true, "helpfulness": "0/0", "author": "Shannon Powers"}, {"rating": 5.0, "review": "Excellant it makes the television like it is when you play the xbox or your playstation. So awesom.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great device for a very decent price.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Aparicio"}, {"rating": 5.0, "review": "Wonderful!!", "verified": true, "helpfulness": "0/0", "author": "laurel"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Emad"}, {"rating": 5.0, "review": "I'm very pleased with the product.", "verified": true, "helpfulness": "0/0", "author": "Kimberly A Phillips"}, {"rating": 5.0, "review": "these is really good and i connect to 5 GZ so no lag time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"slim2556\""}, {"rating": 2.0, "review": "This would have been 5 star.  Super simple installation, pre-registred (nice touch), works as advertised,Why 2 stars?  Amazon's deceptive sales practice.  When one signs up for Amazon Prime there is no upfront warning that Prime TV cannot be received by all current TV makes and models. You are not directed or notified to first check the list of compatible Prime TVs.  So instead of Amazon asking for the TV make & model first they gladly take your $99 and you find out after the fact you cannot receive Prime TV and have no idea why.  In the case where your TV is incompatible with Prime you would think Amazon would at least offer the Fire Stick at half price.  I asked, they said no way but you can wait for a sale.  I don't like being sucked in........So the real cost for Amazon Prime (to work on my Samsung Smart TV) was $99 plus $40 for the Fire TV stick.", "verified": true, "helpfulness": "1/1", "author": "Joep42 \"Retired Geek\""}, {"rating": 5.0, "review": "Best thing after slice bread!!!!!", "verified": true, "helpfulness": "0/0", "author": "Rafael nieto"}, {"rating": 1.0, "review": "I can't really rate this item but I will leave a comment. I had to order this item twice due to the fact Amazon screwed my order up twice and had no explanation other than \"this is rare, I'm sorry, we made an error\". Needless to say ordering through Amazon sucked!!", "verified": true, "helpfulness": "0/1", "author": "Joey Martinez"}]