[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Ok, this thing is awesome.  We bought it for our RV for when the cable isn't so great in the campground.  The kids discovered it has games and they use it pretty much daily in the house now.  This is a great alternative to buying gaming systems for younger kids as it takes up zero space and there is no disc for them to damage.", "verified": true, "helpfulness": "0/0", "author": "CJ Blickenstaff"}, {"rating": 5.0, "review": "I should have bought 2 when they were on sale!", "verified": true, "helpfulness": "0/0", "author": "W. Seifert \"Sony Defender\""}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "robert"}, {"rating": 5.0, "review": "Better than anything else out there, purchased one for every family member.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This stick is great.  It beats out all the other ones.  Functions perfectly and used with the downloaded app for voice control its perfect.", "verified": true, "helpfulness": "0/0", "author": "Houstoer"}, {"rating": 4.0, "review": "Great addition to our TV viewing.", "verified": true, "helpfulness": "0/0", "author": "Nancy Fuleihan"}, {"rating": 5.0, "review": "Super easy to install and set-up. I also  have an Apple TV and I think the Fire Stick works just as well and possibly even better.  The price is very reasonable for what you get.", "verified": true, "helpfulness": "0/0", "author": "Lori C"}, {"rating": 2.0, "review": "OK, folks, let me save you some exasperation on this little device. You CANNOT adjust the specific RATINGS of the video content allowed on the Amazon Fire TV Stick. I just spent a good hour on the phone with three different Tech Reps from Amazon discussing this and was finally informed that it is an all-or-none selection. You either restrict ALL programs (even \"G\" rated) and the user has to enter a pin number to unlock ALL programs or you turn off the parental control entirely and ALL programs are watchable. Not a very logical choice as I would like to set the program ratings (like allow \"G\" but not \"PG\" or greater) but no deal, it's not possible. Good Grief Charlie Brown, who thought this up? The device is a perfect size for a remote kids room, except for the little bitty tiny issue noted above....! Don't buy it if you have the thought of using it in a room where you are not constantly present to monitor what is being watched.", "verified": true, "helpfulness": "0/1", "author": "G. Shaw"}, {"rating": 5.0, "review": "love it why do we need cable? I just canceled my cable service and will save tons of money!", "verified": false, "helpfulness": "0/0", "author": "Nicholas Galeota"}]