[{"rating": 3.0, "review": "I love the movies offered and most programming. I wish it had more tv channels options. It freezes sometimes but I am overall happy with it. I cannot set it up to Spanish subtitles.", "verified": true, "helpfulness": "0/0", "author": "Carlos Esquivel"}, {"rating": 5.0, "review": "Beats chromecast everyday! Amazon created an app so its compatible with iPhone now which is even better! Works flawlessly and remote works amazing when trying to search things, much better than the typical remote. I would highly recommend this to anyone who is thinking about a smart stick, beats the rest no problem.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 1.0, "review": "Does not work with surround sound, poor technical advice ( we'll send you another one) Amazon is slipping, no longer great", "verified": true, "helpfulness": "0/4", "author": "Francis X Baldino"}, {"rating": 5.0, "review": "This has been a great product.  It is small and discrete so our apartment has kept clean.  Additionally, it is easy to use with lots of variety so we have actually become more social as a result.  I love the fact that it has Pandora.", "verified": true, "helpfulness": "0/0", "author": "Andrew T Pickens"}, {"rating": 4.0, "review": "I like", "verified": true, "helpfulness": "0/1", "author": "June"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Mary Beth Spivey"}, {"rating": 5.0, "review": "I love, love, love my Amazon Fire Stick!!!  I can finally watch my streaming shows with my boyfriend without having to crowd in front of the laptop.  Not that I don't love the closeness - but sometimes you want to share a meal while watching \"American Horror Story\".Set up is EASY and getting all my content took mere minutes.  I love the stick - a great (cheap) investment.", "verified": true, "helpfulness": "0/1", "author": "Jennifer"}, {"rating": 5.0, "review": "perfect for receiving internet streaming without a computer", "verified": true, "helpfulness": "1/1", "author": "puppet guy"}, {"rating": 4.0, "review": "It would just be nice for it not to have to be plugged in.", "verified": true, "helpfulness": "0/0", "author": "Mary Weidner-Ruediger"}, {"rating": 5.0, "review": "I love it now I can actually see all my german movies from u tube on my TV love it love it", "verified": true, "helpfulness": "0/0", "author": "Tanja Sieking"}]