[{"rating": 5.0, "review": "I like it alot so far.  I've had it a few weeks.  All the standard TV and movie apps.  Easy to use with the remote it comes with.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product super easy to setup and use", "verified": true, "helpfulness": "0/0", "author": "LuAnn Stine"}, {"rating": 5.0, "review": "Absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Cupcake Mom"}, {"rating": 5.0, "review": "The Fire Stick plugs in and it's  ready to go!! Navigation is a snap!  What a deal!!", "verified": true, "helpfulness": "0/0", "author": "Sue FitzPatrick"}, {"rating": 4.0, "review": "Very early review, but the only reason it's not 5 stars are a few small details.  I could see switching this to a 5 star if it holds up well.It's easy, it works well, the interface is functional and clear.  For the price, I doubt there is anything that beats this product (at least for a Prime subscriber).I wish there was an easy way to type all the log in info you need to use all these great services.  It is a pain in the butt to use the cursor based typing.  Something like an interface that lets me enter the info on my computer, here on the website and have it save to my stick account would make life so much simpler on setup.I also don't like the cord to the outlet , but I don't think that is avoidable with current technology.These are minor complaints, this is a great item.", "verified": true, "helpfulness": "0/0", "author": "Bard Medicine"}, {"rating": 5.0, "review": "Simple. Works great. Wish it streamed Youtube.", "verified": true, "helpfulness": "0/0", "author": "Adam D."}, {"rating": 1.0, "review": "I could not run it until now.", "verified": true, "helpfulness": "0/0", "author": "Majid Z."}, {"rating": 5.0, "review": "It does all I need it to do!", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Excellent. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Own three replaced my rokus! Super fast and easy to install", "verified": true, "helpfulness": "0/0", "author": "Roy West"}]