[{"rating": 5.0, "review": "This has the most stable wifi signal out of all the viewing devices I've used.", "verified": true, "helpfulness": "0/0", "author": "Ella A."}, {"rating": 4.0, "review": "I was able to side-load Kodi media center and use it to access my videos and music shares from my server.Since the amazon fire tv box has a usb port  I had wanted to use it instead (it's even more expensive than the stick) so I could plug an external hard disk in that would contain my media files.  According to the internet this no longer works after a certain firmware revision and it appears the new ones have the newer firmware.The fire tv stick works fine - I just would have preferred the more expensive set-top fire tv.  I think it was a bad decision if they really did remove external drive support.  I was told it was of concerns of recording rented shows.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Everything I need is right here!Awesome!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome. I love it.", "verified": true, "helpfulness": "0/0", "author": "Todd Schlientz"}, {"rating": 3.0, "review": "Good compact product that has all the programs but the actual streaming is inconsistent. I'm using this to access Netflix and Hulu in my TV from a different room but the connection seems very spotty - constantly updating and downloading.It's an affordable product so despite the irregular performance, I don't think it's a total waste of money.  The streaming quality could also be a function of the location of the room however, I don't have the same issue with my iPhone or iPad.  Overall, a decent product but not great.", "verified": true, "helpfulness": "0/0", "author": "RubyRu"}, {"rating": 5.0, "review": "Works great. We have taken it traveling and are able to watch our favorite streaming shows. Very easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The Item is really slow, lags a lot, and the worst issue is that it keeps on restarting once every 30 mins", "verified": true, "helpfulness": "0/0", "author": "Rayan Alzain"}, {"rating": 5.0, "review": "For whatever reason I was afraid this might not work for me but it works almost perfectly. The only issues I have are due to my at&t; internet connection. I am a satisfied customer!!", "verified": true, "helpfulness": "0/0", "author": "M. C. Tee"}, {"rating": 5.0, "review": "It is great used it last night for the first time and I was impressed", "verified": true, "helpfulness": "0/0", "author": "Garry"}, {"rating": 5.0, "review": "Fast", "verified": true, "helpfulness": "0/0", "author": "matt serwach"}]