[{"rating": 3.0, "review": "overall easy , great value, snappy performance, but missing a \"homepage\" like view (kind'a like apple TV) where it's not content based or driven (where obviously amazon's content would rise to top ) where among content thumbnails I see app thumbnails but rather have just app view - perhaps it's there (in apps) but in 10min I had on it, it didn't look like that's where someone intended I'll find myself in.also the fact they force you to watch the intro video upon initial connection - BAD! (I went in / out, power off/on - it insisted on finishing the clip all the way thru) - I understand the impact ( less support calls, training users etc) - but forced spoon feeding ? come on...I REALLY HOPE this is on a \"per account\" and not \"per device\" - b/c if I have to re-watch it each time I hook up a new stick ( I bought multiple) - ouch....", "verified": true, "helpfulness": "0/0", "author": "Noam Gonen"}, {"rating": 5.0, "review": "Works great.At first I thought the stick didn't turn on when my TV turned on, but if you push any button on the remote it'll wake the stick up.I like how when browsing for content the possible selections show up on the screen rather than just on my phone/computer. This allows others in the room to see the options rather than just me.The remote app for the smartphone is great in that it is extremely simple.", "verified": true, "helpfulness": "0/0", "author": "James Hales"}, {"rating": 5.0, "review": "Great. Got it primarily to watch Amazon Prime, and it's perfect.", "verified": true, "helpfulness": "0/1", "author": "Ralph Appelbaum"}, {"rating": 5.0, "review": "I currently own a HTPC, XBox, PS4 and a Roku so why did I order this?  Because it does what all those devices does and uses a fraction of the power and space. Amazon Prime in combination with this device is an incredible value. You can even play games and screencast (tested with my Nexus 5).  It comes with the HDMI dongle, remote, micro-USB cable, HDMI extender and USB wall plug. IT feels extremely responsive.[+] Small size[+] Sturdy Build[+] Powerful dual core processor and plenty of storage and ram[+] Decent Game library[+] Nice Remote[+] Preregistered with Amazon[+] Screen casting[+] (bonus) potentially rootable ;)[-] Missing a few important channels (HBO Go, VuDu, etc)", "verified": true, "helpfulness": "0/1", "author": "@TrevorHikes"}, {"rating": 1.0, "review": "Did not work with my DSL", "verified": true, "helpfulness": "0/7", "author": "Steven K."}, {"rating": 4.0, "review": "For $19 (preorder) this is a very good deal and product.  The only reason it didn't get five stars is because my provider doesn't support WatchESPN on the Fire TV Stick yet.  That's the main reason I bought it.", "verified": true, "helpfulness": "1/2", "author": "Brett R Barnett"}, {"rating": 5.0, "review": "works quickly and smoothly....easy set up", "verified": true, "helpfulness": "0/0", "author": "Bryan Flynn"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Richard R Gerren"}, {"rating": 5.0, "review": "Works as expected. Easy to set up and use. Great price.", "verified": true, "helpfulness": "0/0", "author": "Nicholas F. Alexander"}, {"rating": 1.0, "review": "The power cord to the wall is WAY too short. This is virtually unusable for our family. The images of the Fire TV Stick in use do not show a power cord being necessary so it is implied that it is wireless...this is not the case and we will likely be returning this. Very disappointed.", "verified": true, "helpfulness": "0/5", "author": "Katherine Grun"}]