[{"rating": 5.0, "review": "I am really enjoying my Fire TV Stick.  It was easy to set up.  I recently (and gleefully) gave my cable company the boot.  I don't watch tv the way a lot of people do, so my assessment could differ a lot from other people's.  I like to have mindless old shows on while I am working at home - something I don't have to give my full attention to, but can chuckle at now and then.  Right now I am working my way through old Frasier episodes.  I missed the first season of Downton Abbey, so I'm looking forward to watching that sometime when I can give it more attention than I do old sitcoms.  I am also enjoying playing my prime music through the television.,  I took advantage of the offer Sling TV had of giving a free Fire TV Stick with three months prepayment of Sling.  Not so sure about Sling - I probably will not renew, but it's nice to have during basketball season, which is the only sport I really follow.  I haven't fully explored the other options on my Fire Stick as yet, but feel it was worth the price just for what I am using it for now.  Take THAT, Time Warner Cable!!", "verified": true, "helpfulness": "0/0", "author": "rebecca loer"}, {"rating": 5.0, "review": "The Fire Stick was so much more than I thought it would be and so easy to install.", "verified": true, "helpfulness": "0/0", "author": "Barbara Sink"}, {"rating": 1.0, "review": "Well i hate to say this but it is not working for me right now?? And haven't had the time to figure out why!! Was working fine one day and then it nothing.?My husband has been trying to get help on the issue and is not getting the correct info. for our issue??pretty frustrating!!", "verified": true, "helpfulness": "0/0", "author": "Sarah D. Hildebrand"}, {"rating": 5.0, "review": "Love this little stick.", "verified": true, "helpfulness": "0/0", "author": "Whitney"}, {"rating": 1.0, "review": "Beware!!!!  Don't buy this if you want to stream mlb tv. It is fine for stuff that isn't live, but a mess for live baseball.  Bought Roku 3 instead and it works great for MLB TV", "verified": false, "helpfulness": "3/3", "author": "B1"}, {"rating": 5.0, "review": "Better than expected.", "verified": true, "helpfulness": "0/0", "author": "Peter d murray"}, {"rating": 5.0, "review": "Did what we expected it to do...streaming shows from Netflix.", "verified": true, "helpfulness": "0/0", "author": "Marilyn T. Roan"}, {"rating": 5.0, "review": "I switched from Apple TV to Fire TV Stick, love it!", "verified": true, "helpfulness": "0/0", "author": "Amy Moore"}, {"rating": 5.0, "review": "I love it!  It is so nice not to have to mess with plugging in a computer to the tv any longer.  I was able to get caught up on Downton Abbey which is exclusive to Prime, and now I watch Netflix through this device as well. It does appear to work more quickly than when I use Netflix through our blue ray player connection.", "verified": true, "helpfulness": "0/0", "author": "Anthony J."}, {"rating": 3.0, "review": "Misleading...basically useless if you don't purchase everything", "verified": true, "helpfulness": "0/0", "author": "LizZie"}]