[{"rating": 5.0, "review": "Do u haVe to have internet attached to Ur tv. Or just WiFi, which I do have?? This site doesn't even mention how it works.", "verified": false, "helpfulness": "0/0", "author": "John Garten"}, {"rating": 5.0, "review": "Works great and has a ton of programing.  Easy way to add a TV with out the need for wires or a cable box!", "verified": true, "helpfulness": "0/0", "author": "Ryan L."}, {"rating": 5.0, "review": "Its excellent. Its quite fast, loads the applications quickly. Set up was easy. Have so many apps. Simply love it", "verified": true, "helpfulness": "0/0", "author": "Mufaddal"}, {"rating": 5.0, "review": "The Fire TV Stick is Awesome. I pre-ordered it when it first came out so I was able to get it for half price. Best Decision Ever. This device basically made my \"dumb\" TV into a Smart TV. I couldn't ask for more out of $20, especially when getting a built in smart TV would have meant spending an additional $100. So far I have not had any problems with it. Netflix runs great on it. Red Bull TV runs well and Amazon movies stream great. I don't store anything on it and those three things are the only things that I really it for.", "verified": true, "helpfulness": "0/0", "author": "Alexander"}, {"rating": 5.0, "review": "Just got our Fire Stick.  Included instructions were easy to follow and set up was also pretty straight forward.  We use our iphones as \"hot spots\" and we had no trouble connecting to the internet via our iphones.  We intend on using the Fire Stick when we travel in our Motorhome and so far I can see no problem doing that.", "verified": true, "helpfulness": "0/0", "author": "Scottymn"}, {"rating": 5.0, "review": "Easy to install, if I can do it anyone can. Seamless.", "verified": true, "helpfulness": "0/0", "author": "GypseaQueen"}, {"rating": 3.0, "review": "Overall great addition to my entertainment, sometimes has poor image quality.", "verified": true, "helpfulness": "0/0", "author": "Jon Parkerson"}, {"rating": 5.0, "review": "Excellent, easy to use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Have had the Fire TV Stick for two weeks now and am loving it.  I did my research online and in store between this, the Google Chromcast, and Roku; this one encompasses all the features and then some.  Did experience one problem with it not working: the screen turned blue and said \"Unauthorized Content\" for apps that I already had paid subscriptions for.  Hasn't happened since so other than that, I love that I made my old flat screen into a \"Smart TV'.", "verified": true, "helpfulness": "0/0", "author": "Taryn Anderson"}, {"rating": 4.0, "review": "Very neat and well worth the price!", "verified": true, "helpfulness": "0/0", "author": "MattyP"}]