[{"rating": 5.0, "review": "Just plugged it in and I'm loving it so far! Good stuff. I bought this instead of a different TV Streaming device because it had a built in Slingplayer App (for Slingbox) and I wanted to see what the feature was like. So far, it's money. Other people have complained about the lagging on the Slingplayer App, which certainly is a drawback, but this negative is, in my opinion, far outweighed by the ease of use (as compared to using Slingplayer app for iOs device and \"beaming\" the video to an Apple TV, or Roku, both of which I've used in the past) and user-friendly display. Finally, I'm not afraid to teach my less-than-tech-savvy friends and family how to actually use my TV to watch live TV. Good stuff!", "verified": true, "helpfulness": "0/0", "author": "T. Kenyon"}, {"rating": 5.0, "review": "Best ever!  So much easier to use and better than Google's stick thingy.Especially relevant if you have a Prime membership. Free streaming shows.  I love this thing!!!!!", "verified": true, "helpfulness": "0/0", "author": "A. cronin \"ac\""}, {"rating": 5.0, "review": "Easy install. Easy remote. Took all of abot 5 minutes to set up!", "verified": true, "helpfulness": "0/0", "author": "Bryn McInnish"}, {"rating": 5.0, "review": "We have had our Fire TV Stick for about 2 weeks and absolutely love it!  It was easy to install and easy to use. We still have to explore a few more of the features, but it definitely meets our needs. Now we can enjoy watching movies/shows via our Prime membership, in addition to Netflix. We plan on buying another Fire TV Stick for our other TV soon.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I bought this product to replace my old Google Chromecast who got damaged and I ve found it very useful so far.  Installation was easier than the Chromecast, and the remote control makes it easier to use and navigate in case you don t have your tablet/phone or laptop in hand.  The video quality is good, and I haven t tried a lot of applications yet, but the installation is easy.  I would like if possible to be able to purchase or rent movies even if I am outside of the US and it would be nice also to control it via the amazon Echo", "verified": true, "helpfulness": "0/0", "author": "Ricardo W Brando"}, {"rating": 5.0, "review": "Wow- I could not believe how easy this was to install and to use, and how much  quality content is on it , including apps- really happy with it!!", "verified": true, "helpfulness": "0/0", "author": "Mariah L. Oneill"}, {"rating": 5.0, "review": "I use this daily! love the convenience", "verified": true, "helpfulness": "0/0", "author": "Colette Eggebraaten"}, {"rating": 5.0, "review": "I love it. It's convenient and handy and makes everything right at your fingertips. It was easy to install and I haven't had one second of problems with it.", "verified": true, "helpfulness": "0/0", "author": "Sundi S. Rose"}, {"rating": 5.0, "review": "Great little gizmo, for sure!", "verified": true, "helpfulness": "0/0", "author": "John Williams"}, {"rating": 4.0, "review": "It's is great, however the pauses that happen when playing a movie is annoying. It doesn't happen with TV shows, other than that is has been great.", "verified": true, "helpfulness": "0/0", "author": "Brittanie"}]