[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "bobromines"}, {"rating": 4.0, "review": "The Fire TV Stick works very well. The picture quality is wonderful and the ease of installation had the Fire TV Stick up and running in under 5 minutes. My only complaint is the inability to add certain channels. I have a subscription to a network, but although I can search for the network using the Fire TV Stick, there are only options to purchase, not sign in. I did enjoy the ability to listen to my Amazon music selection through the TV. I also have Chromecast and the separate remote is a definite plus. The Fire TV Stick immediately was available from my phone and the streaming quality of the device  is a pleasure to watch. I'm sure as the device goes through a few minor updates, I will be able to give it a full five star rating. Right now it has a nice blend of features from many devices already on the market and is worth purchasing.", "verified": true, "helpfulness": "0/1", "author": "S"}, {"rating": 5.0, "review": "Small and simple to operate with an intuitive menu design. Have not had any problems streaming HD video on it from Netflix or Amazon", "verified": false, "helpfulness": "0/1", "author": "Spike Spiegel"}, {"rating": 5.0, "review": "Wonderful. Easy to set up and lots of entertainment options.  Worth the price!", "verified": true, "helpfulness": "0/1", "author": "marie donlon"}, {"rating": 5.0, "review": "Love It!!!", "verified": true, "helpfulness": "0/1", "author": "Angela Watkins"}, {"rating": 3.0, "review": "If you have a tv that hangs on the wall please note their is a power supply cord that ruins the setup that the ad and commercial fails to mention that where it looks like a plugin to hdmi and it will work on its own not the case.", "verified": true, "helpfulness": "2/2", "author": "Jeremy M"}, {"rating": 3.0, "review": "I got it on sale the first day it was announced because I was curious how it will work. Finally, it arrived, and I got to play with it. I mostly watch Netflix on it, and couple of games from my old Kindle Fire worked there too, At first I had some problems with the stream stopping for just a moment, and then continue working as it was meant to do. I changed wi-fi to 5 GHz network, and it stopped doing that.My main problem with it is that it heats up really badly, I ended up suspending it from the TV arm on the back, so it won't touch anything and start fire. There is no way to turn it off other than unplugging. It says it gets to sleep after a while, but I am not sure if it wakes up if TV is turned on for different purpose, like gaming.", "verified": false, "helpfulness": "2/2", "author": "genoa golf"}, {"rating": 1.0, "review": "Broken right out of the box. Will not get anywhere near actual set up. Their solution is wait 4 days for a replacement. Junk product, with service that's just as bad. You've really gone down hill amazon.", "verified": true, "helpfulness": "1/3", "author": "Brian Marquis"}, {"rating": 5.0, "review": "LOVE this thing! No more $100 DirecTV bill !!! People call and disconnect their accounts all the time in favor of internet and netflix. The firestick takes that to a whole new level by allowing you to fling stuff wirelessly from your phone or tablet to your tv. I haven't checked out all the apps yet, but I can tell already that I will have more to watch than I have time for. Firestick, internet and a local antennae is all I need now, 68 bucks a month powers my whole home's entertainment. I couldn't be happier! =)", "verified": true, "helpfulness": "1/1", "author": "PrimeFan \"Urethekau\""}, {"rating": 1.0, "review": "I have a Samsung H6201 Smart HDTV I purchased during Black Friday along with this Amazon Fire stick. Like everyone says, wifi connectivity is an issue. I actually was able to get mine to work pretty well with wifi after a couple days, my issue that has never been resolved is apparently a TV compatability issue. I get a distinct double image which from afar looks like a blurry image. The screen test on my tv shows a normal image, so its not the pannel. No matter which HDMI port I use, double image, oh and a green bar across the entire bottom portion of my screen. Aside from that, my TV menu shows a double screen on the same input as the fire stick. when removed, double image goes away. when switching to whater HDMI port my blu ray player is on, no double image... back to firestick input, double image and green bar.  I am actually able to get rid of it about every 5th time i reset my TV to factory settings, but as soon as i turn the tv off and on again, back to double image and green bar. Samsung is sending a technitian over to take a look at it.  Not sure its worth having my tv gutted out for this. Im hoping for a firmware update SOON to fix this issue. Very frustrated.  Time wasted so far to get this thing \"operational\"= 10+ hours. Too bad amazon content is so hard to get on streaming devices.To note: on my acer computer monitor there are no issues. On Vizio E series 48 inch (no smart functionality), no display issues either. I chose the samsung 6 series for its superior pannel and overall image quality, jokes on me.", "verified": true, "helpfulness": "6/8", "author": "Camila"}]