[{"rating": 5.0, "review": "I love using my Amazon Fire Stick. It is convenient and has so much to offer. #gettingridofcable :)", "verified": true, "helpfulness": "0/0", "author": "Phyllis Kirk"}, {"rating": 5.0, "review": "OUTSTANDING investment. I am very pleased with this unit.", "verified": true, "helpfulness": "0/0", "author": "ken J. Cayer"}, {"rating": 5.0, "review": "Wow offers so much and so easy to use I might even cancel my cable!", "verified": true, "helpfulness": "0/0", "author": "SHanke"}, {"rating": 5.0, "review": "After a week of use, I can say that this little stick is very nice for prime content. I've not tried anything beyond that at this point. No load buffers or stutters. It is quick starting and easily searchable using the smart phone voice control app.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tracey Levy"}, {"rating": 5.0, "review": "Gives television viewing a lot more flexibility and wider selection of viewing options", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The Fire TV Stick is an affordable way to add smart features to your TV. It can play some of the games on the Amazon app store and has most (if not all) of the video apps you could need for a smart TV. However, it has some limitations and flaws.Pros:Affordable and easy to setup. The remote is neat and doesn't require line of sight. Runs a lot of apps and games including Netflix, Plex (after app purchase), Amazon Prime Video, Vevo, etc.Cons:Video stutters on Netflix and Plex. Every three to five minutes, the video completely stutters and garbles up the video and audio. It's frustrating and no other smart device in my home has the problem (Apple TV or Google Chromecast). I have an 802.11ac router with 100gigabit internet. It's clearly a software or hardware problem with the device.Second, the interface is a huge mess. It's not very intuitive or customizable. I just want to pin my most used apps to the first page, but there are so many categories and menus that I don't even know where to look. Luckily, it stores your recently used apps and videos on the first menu. I like routine and having them change location is frustrating.Gaming is alright, but I'd recommend another device or dedicated game console if you want to play games. The included remote is very limited. Just because it can play games doesn't mean it should.Amazon could have a decent thing going here with a few tweaks and optimizations. It's definitely better than a Chromecast which basically only mirrors, but I don't know if it's really any better than a Roku or Apple TV.Update 7/22/2015:It's been a few months since my first review and the problems still exist with this little guy. Video on Netflix starts skipping and missing audio once in a while. Happens about every 10 minutes and lasts for a few seconds.The interface is as confusing as ever, and at one point, it removed Netflix from my recent viewed apps and I had to dig around for a few minutes to find it again.On the plus side, the clarity and sound are great if only they can fix the stutter ring problems and clean up the interface.As such, I would not recommend this device.", "verified": true, "helpfulness": "0/0", "author": "Brian J Lambert"}, {"rating": 5.0, "review": "Love being able to access my prime movies on my larger screen!!", "verified": true, "helpfulness": "0/0", "author": "Debbie P"}, {"rating": 5.0, "review": "Really great, easier to set up than the roku, and does the same. Had it up and running in ten minutes! The hardest part of it was putting batteries in the remote! The litter buggars hard to open. Highly recommend it! Good value for the money too.", "verified": true, "helpfulness": "0/0", "author": "cheflyn"}, {"rating": 4.0, "review": "Not a bad little streaming stick.  I put the Fire TV in my bedroom and use this one in the living room along with Apple TV. Still use my Apple TV because I can get network TV apps on it such as ABC and FoxNow.  This allows me to catch up on shows I missed.  These do not exist on Fire TV.  But for streaming a Amazon Prime movies this works great.  I still use Apple TV for NetFlix as the HD resolution seems to appear better to me.  I like the speed of the fire stick and again for $39 a nice portal to Amazon Prime movies and shows for now.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey A. Higgins"}]