[{"rating": 4.0, "review": "A friend gave me the Fire TV Stick as a gift.  I live in an area where the best internet connection I can get is DSL. So far no problems with buffering, so I like the technology and content available.", "verified": true, "helpfulness": "0/0", "author": "Matthew J. Mcateer"}, {"rating": 5.0, "review": "Is every thing I expected.  Good color, sound & selections.", "verified": true, "helpfulness": "0/0", "author": "Judith Aucutt"}, {"rating": 5.0, "review": "I like it, fast", "verified": true, "helpfulness": "0/0", "author": "William Largen"}, {"rating": 5.0, "review": "This is awesome! Easy to install and operate. For the price. I'm going to order two more. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Kristian Verash"}, {"rating": 3.0, "review": "Its ok..Im not much of a tv watcher anymore...but its nice to have youtube on the tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Ryder"}, {"rating": 3.0, "review": "Interface is 5 stars.  Have had a little trouble with reception.  Looks like a fiem ware update might have fixed ime videos streaming.  And support had reset the device for Netflix to work.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "VERY Simple to operate (plug and play! with addition of network password and various service accounts). I have many media players and this is probably the simplest yet. I have to admit, my wifi router sits next to my TV so I haven't had any connectivity problems, but if you've got a strong signal, I'm not sure how much clearer or simpler it can get. Also, I love the android app that allows me to search by voice.", "verified": true, "helpfulness": "0/0", "author": "Henry T \"Globetrotter\""}, {"rating": 1.0, "review": "I can have Netflix streaming on four different  devices at the same time but cant run the fire stick without it constantly buffering. Not only did I waste my money on this device but I renewed my prime specifically for it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Mobygrape\""}, {"rating": 4.0, "review": "Wish it had more apps but response pretty good", "verified": true, "helpfulness": "0/0", "author": "rick"}]