[{"rating": 4.0, "review": "It works as expected. I was hoping for some more recent hits on there but I understand why there aren't. I really enjoy it though!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I bought two of these.  The first one I received worked great, very few issues.  I would give it four stars.  The second, however, does not work well.  I have to reboot it daily, which is a pain.  Thinking of returning that one.", "verified": true, "helpfulness": "0/0", "author": "S. Helms"}, {"rating": 5.0, "review": "This data streamer just flies. It was a great choice and my Netflix never was more enjoyable. No more lengthy pauses. I'm very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Ringer"}, {"rating": 5.0, "review": "Works very well the only draw back is that you need a power cord for use.", "verified": true, "helpfulness": "0/0", "author": "Leisa Smiley"}, {"rating": 5.0, "review": "Fantastic", "verified": true, "helpfulness": "0/0", "author": "Andrew lyons"}, {"rating": 5.0, "review": "Love this.  I had a blue ray player that was streaming capable and it was so slow.  The Fire TV stick is lightning fast and has a ton of content.  Some are subscription based, others are free.  Very easy to set up, just plug it into your HDMI port and start streaming.  Love Love Love it.", "verified": true, "helpfulness": "0/0", "author": "kimmy"}, {"rating": 5.0, "review": "The Fire TV Stick is literally the best $39 device you can buy. My wife and I use this on a wall mounted 42\" LED in our bedroom (mostly because we have the Fire TV in the livingroom) and could not be more happy. They really shouldn't keep secret all the amazing things that it can do, like side loading OnLive and using it as a $2000 gaming PC. I could list awesome possibilities for this device until i'm out of available characters but the bottom line is if you don't have one of these, buy one.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "Works well and easy to setup.  I'm still figuring out how to integrate into my sound system.", "verified": true, "helpfulness": "0/0", "author": "Donald L. Sielert \"ANN SIELERT\""}, {"rating": 4.0, "review": "Works great. Only reason I didn't give it 5 stars is because you cannot get the HBOGo app on it 👎", "verified": true, "helpfulness": "0/0", "author": "BLECT \"ABL\""}, {"rating": 2.0, "review": "When it works, it's excellent.  When it freezes, it stays that way, and is useless.  Returning it.", "verified": true, "helpfulness": "1/1", "author": "roxann hunt"}]