[{"rating": 5.0, "review": "Like the new form factor. Own an original Fire TV and was happy with it. Needed a couple more and the stick made sense for those tv's especially at half price.Setup was easy as always. Only problem was remote wasnt recognized at first even with troubleshooting steps. Rebooted the stick and have been fine ever since.", "verified": true, "helpfulness": "2/2", "author": "Aaron B"}, {"rating": 5.0, "review": "Works good. Need longer power cord to reach outlet.", "verified": true, "helpfulness": "1/1", "author": "Ricardo Rios"}, {"rating": 5.0, "review": "Very easy to set up and use", "verified": true, "helpfulness": "1/1", "author": "Mike castle"}, {"rating": 5.0, "review": "Received mine and had to update it which took a little time. The walk through is very simple and yes it needs external power. I love the app section especially weather! Please a better weather radar and I'll leave Apple! I use it mainly for Amazon Prime which I'm a member. I've had no picture or sound issues and the thing is very simple to use. The remote could be better but hey 19.00 I'm not complaining. I find this device MUCH better than Apple TV. If you have Amazon Prime this is your device! Thank you for a great product.", "verified": true, "helpfulness": "2/2", "author": "M. Morgan \"Towhaul\""}, {"rating": 5.0, "review": "Awesome very fast, voice search is wonderful. Glad I bought it. Pulled out my Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Siggy"}, {"rating": 5.0, "review": "agent was very professional and courteousin helping me set up the Amazon stick. he called back in 15 minutes made sure everything was running well and I was very pleased.", "verified": true, "helpfulness": "1/1", "author": "Paul"}, {"rating": 2.0, "review": "Using Fire TV Stick in place of my Xbox to stream content to my non-smart HDTV.  When it works, it's nice.  But, it doesn't always work.  Have had issues where device let's me navigate to Netflix, then when in Netflix I click on the show I want to watch, and it selects a different show.  When I back out and try again, same story.  Also, I will get Netflix connection issues, where the Fire TV Stick lets me check the Netflix servers, and I get a bunch of red X's.  Log into Netflix on any of my other computers over the same Wifi network, works just fine.  Unplugging the Fire TV Stick(which, BTW, is the ONLY way to reboot it, and is supremely tedious as my 50\" TV is in a corner, the HDMI is on the back, and I have all of my wires loomed to keep them out of sight...) miraculously fixes the \"Netflix\" red X's.  Then, today, the supplied remote started having issues.  Navigate normally, nothing.  Try again, nothing.  Press multiple things in an obviously frustrated attempt to not launch it to help power the probe on that asteroid, nothing.  Then, all of a sudden, EVERYTHING.  That's right, all of those commands just happened at once.  I think I broke the internet.  So, maybe those Chinese batteries are already dead.  Swap out some fresh AAA's, but, alas, supreme delayed reaction continues.  Have the remote app on both of our smart phones, it works just fine.  So, to recap, got it last Thursday, today is Sunday, so, we've been using it for less than 96 hours, and it is no great improvement over the Xbox it was replacing.  Also, since my TV is older and only has 1 HDMI input, I do not have the Xbox available as an installed backup for the next time the Fire TV Stick disappoints me.  And it will, of that I have no doubt.  Who the hell Beta tested this thing?  They need a spanking.  $20 wasted.Oh, and I tried sending feedback to firesticktv-feedback-us@amazon.comRejected Address", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Update.  I spoke with Tech Support today 1/7.  The issue I had with the fire stick not being able to negotiate a proper resolution was resolved in an update in Mid December.  My Fire Stick now works at 1080p on my new Plasma screen.  I'm changing my rating to 4 stars.*  And to the idiot that said I don't have a New Plasma, you apparently don't know as much as you think you know fool.  This a BRAND NEW Plasma, Samsung and Vizio are the only companies still making them and Samsung isn't making them after this model runs out.  So if you don't know what your talking about shut your mouth and keep your worthless comments to yourself.Old Review....Ordered two of them.  The video keeps cutting in and out.  Not sure it is worth keeping.  I have Chromecast and Roku and think both are better.Update...Amazon called me because of my review.  The tech was not able to assist.  They are going to send me NEW devices.  Even though I told them the issue is it appears to not be compatible with my brand new Samsung 60' Plasma.Ultimately the issue appears to be that my TV and the Firestick can't agree on a screen resolution.  If I manually set the resolution to 720P (using another TV) it works on my Samsung Plasma.  If I set it to anything 1080 or Auto the video flickers.I don't have these issues with Roku, Chromecast or Comcast.  They all support 1080P....If the NEW devices come in and work on my TV @ 1080P 60hz then I'll adjust this review.  Until then..One star.Sorry Amazon...", "verified": true, "helpfulness": "26/31", "author": "matt haught"}, {"rating": 4.0, "review": "So far, it's exactly what I was expecting.  I do see some lag when scrolling through, hence the 4 star rating, but for the price, I'm willing to deal with that.  It's not a horrible lag, but it's noticable.  Intended use is on an extra tv, one that's a distance from our router, yet it picks up signal and plays well.  I'm happy with my purchase so far.", "verified": true, "helpfulness": "0/0", "author": "Cziggy13"}, {"rating": 5.0, "review": "I was lucky enough to secure a Fire TV Stick in the pre-order phase for $19.  I figured for $19, I cant go wrong.  I got it on Thursday and connected it right away.  I must say I am truly impressed.  I figured it would be good, but my expectations were exceeded.  Once setup its fast and the app selection is great.  Ive always heard that Amazon Prime videos load quickly on the original Fire TV, but I was not expecting what I say.  I press play and the videos start almost immediately.  I used to primarily watch streaming videos on Netflix, which of course is supported, but if I now have the opportunity to watch a video on Netflix or Amazon Prime, I will definetely choose Prime. I havent tried too much apps, but what I have worked great, including the aforementioned Netflix.One of the fist apps I did install was Plex.  I had previously purchased it with the Amazon Appstore and its working flawlessly.  I tried a couple of games, and they worked, but they would probably be much better with the Fire Game Controller.  Im actually considering purchasing it.  I have a Chromecast connected to one of my TVs and the Fire TV Stick will be replacing it.  Dont get me wrong, the Chromecast is good too, but the Fire TV just seems so much faster and I love the fact that it has its own remote and doesnt rely on pushing content to it from a phone, tablet, or computer.For $19, the Fire TV Stick was a steal.  Even at $39 its going to be a great bargain.  I can see myself buying 2 or 3 more for other rooms.", "verified": true, "helpfulness": "1/1", "author": "JohnnyDanger"}]