[{"rating": 5.0, "review": "Just awesome", "verified": true, "helpfulness": "0/0", "author": "Bob Noone"}, {"rating": 1.0, "review": "Is very slow, takes a lot of time streaming segment even though I have a fast Internet connection. Want to send it back.  Have other devices, (ROKU, SONY) and they work Ok.", "verified": true, "helpfulness": "1/1", "author": "Alberto P."}, {"rating": 5.0, "review": "We love this product. Took it out of the box, plugged it in to the tv, put it into the power supply, and starting watching tv.", "verified": true, "helpfulness": "0/0", "author": "Evlwife"}, {"rating": 5.0, "review": "We love our Fire Stick! It is so simple to use and has opened an entire new world to our TV.", "verified": true, "helpfulness": "0/0", "author": "Stacy Hayes"}, {"rating": 5.0, "review": "I really like my firestick the price was very reasonable and getting it setup was a breeze!  With my Amazon Prime my granddaughter can watch a lot of her favorite shows!", "verified": true, "helpfulness": "0/0", "author": "Sandra A. Bazzell \"Sandy B\""}, {"rating": 4.0, "review": "Hey its another Fire TV in a significantly smaller form factor and it is hidden out of sight.Drawbacks:There is no OFF button, but then I figure that it does not give a run on your electricity bill.PIN Validation: Each time you watch a programme irrespective of the rating, it asks you for the PIN. Even if you inadvertently pressed the back key and restarted the same program. This is annoying. I can understand the need for the PIN, but when watching multiple shows it is annoying as hell. The only time it doesnt ask if you are binge watching multiple episodes of a series.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For one, my two Fire sticks shipped on a Sunday, which I very much appreciated. This is a multifunctional unit that is great for families! I can watch Netflix, my boyfriend can watch his shows, and my nephew can play games! It is great for everyone!", "verified": true, "helpfulness": "0/0", "author": "Mellisa"}, {"rating": 5.0, "review": "nice device", "verified": true, "helpfulness": "0/0", "author": "Jonas Tatchieup"}, {"rating": 4.0, "review": "My daughter was given a fire stick as a birthday gift, for the most part it is easy to use and install. Our only issue with it was the parental controls, which are a joke. Basically you can only password protect on Amazon prime, which means that our 10 year old can't watch anything on it, not sure why there is no way to set a rating limit .", "verified": true, "helpfulness": "0/0", "author": "Lisa Griffith"}, {"rating": 5.0, "review": "We had a bit of a wait..supply & demand,  I guess..but once we got it, Loving it!  We've already watched a movie.  I especially am enjoying my music.  We picked our own music selections and now we just enjoy!!  Enjoying it!", "verified": true, "helpfulness": "0/0", "author": "Lora M"}]