[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "mt"}, {"rating": 5.0, "review": "5stars  ookok", "verified": true, "helpfulness": "0/1", "author": "gloria cowan"}, {"rating": 1.0, "review": "the worst product that amazon that amazon has produce. it does not work at all.", "verified": true, "helpfulness": "0/4", "author": "Francis Duhem"}, {"rating": 5.0, "review": "Small but powerful great stick beats Google Chrome hands down. Love it! lots of stuff wish there was more but I love it.", "verified": true, "helpfulness": "0/1", "author": "Christopher Colon"}, {"rating": 5.0, "review": "Best addition for my TV since the DVR,", "verified": true, "helpfulness": "0/1", "author": "Timothy O. Barb"}, {"rating": 5.0, "review": "This is the second one Iv'e purchased. One of our favorite things about the Fire Stick is being able to take our TV out by the firepit, deck or hot tub and having access to the shows we enjoy!", "verified": true, "helpfulness": "0/1", "author": "V.Olsen"}, {"rating": 4.0, "review": "I had a few glitches registering my device to my amazon account. Amazon e-mailed me shortly after with troubleshooting instructions and a temporary password. I appreciate how quick they were to assess the issue and provide a solution. The device works great now and I am very pleased with it.", "verified": true, "helpfulness": "0/1", "author": "Caitlin Scharf"}, {"rating": 5.0, "review": "I bought this after my wife bought the Roku stick.  I cannot get over how well the Fire stick is packaged and how easy setup was.  It was already registered to my Amazon account which made everything super easy.  The streaming is great on this thing.  I absolutely recommend this product.", "verified": true, "helpfulness": "0/1", "author": "Ronnie \"RjSD\""}, {"rating": 1.0, "review": "Very complicated., not gonna use.", "verified": true, "helpfulness": "0/2", "author": "Tomas Otanez"}, {"rating": 5.0, "review": "It's great, easy and offers so much more boob tube entertainment!", "verified": true, "helpfulness": "0/1", "author": "LMR"}]