[{"rating": 3.0, "review": "The Fire TV Stick is very cool in many respects. It's extremely small, it's got a great mix of content and apps, and it's very simple to setup and use. That said, I've pulled it from the TV I had it on because of a few shortcomings and one showstopper. On the shortcomings, first of all it's kinda slow. Not excessively so, but certainly noticeable and after a while it gets pretty tiring. Second, the screen sharing doesn't work with any Windows device. Again, not a huge deal but it's supposed to be a Miracast compatible device and being able to use screen sharing with my Miracast compatible Windows machines would have been pretty compelling. But it just doesn't work. Third, there is no way to turn it off, and the sleep function is buried in settings. Why is this important? Because of the biggest issue with the Stick and the thing that put the nail in the coffin: the remote doesn't support basic TV functions like on/off and volume.I didn't expect this to be such a big issue, but it was with my family. I have tons of gadgets in my house, and the only way I can get the rest of my family to use any of them is that they have to \"just work.\" We have an Xbox 360 hooked up to our bedroom TV, and we mostly use it for apps like Amazon Video, YouTube, and Netflix. The 360 remote does everything from controlling the TV to controlling the Xbox and its apps. That makes it super-simple to use because you don't have to keep track of or mess with more than one remote. Now I know it's not fair to compare a $200+ Xbox to a $39 Stick, but I've long believed that for any TV accessory to really work it has to make TV better, otherwise it won't get used. The Stick does add some things to the TV experience, but having to keep track of and use more than one remote just makes it to much of a bother, and actually makes watching stuff on TV more complicated than just using the TV (or the Xbox). My TV will auto-sleep if there is no signal, so being able to turn the Stick off would be a workable alternative to turning the TV off. We'd still have to use the TV remote for volume though, so we'd still have to keep two remotes around.The Fire TV Stick is a nice idea and there's a lot to like. But for me and my family, the shortcomings were too much of a hurdle to keep it as our primary TV experience. I'll definitely watch this space for improvements though, as replacing an expensive game console or STB with a small inexpensive device like the Stick would be great.", "verified": true, "helpfulness": "1/2", "author": "blokpardi"}, {"rating": 5.0, "review": "So easy and fun to use. Can't believe how fast it sets up.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Great item....buy it", "verified": true, "helpfulness": "0/0", "author": "tambria"}, {"rating": 4.0, "review": "Works great...I'd like to see more free avenues for videos (like YouTube)...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Keeping it in the box so as to re-sell for a profit. Don't want to open so I can say, \"New\" when I re-sell it.", "verified": true, "helpfulness": "0/0", "author": "C J Daubenspeck"}, {"rating": 4.0, "review": "Easy to setup and use. The system runs laggy from time to time, occasionally drop the wireless signals while my router is quite powerful to cover the entire house.", "verified": true, "helpfulness": "0/0", "author": "killerWhale"}, {"rating": 3.0, "review": "Not worth it if you have a smart TV or any game system that runs a entertainment apps like amazon prime, netflix, hulu...if you don't, than this is a good purchase.  Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Daniel Mandell"}, {"rating": 4.0, "review": "I have had this for about a week now & I like it.  Bought it for the tv upstairs & was a little worried it wouldn't work.  I have had problems with the wifi signal upstairs so I was skeptical.  I pre ordered it for $20 which was great because I dont use that tv much so didnt want to make a big investment.  I also used Amazon Prime so if it didnt work I knew I could return it with no issues.  Over all I think it was a pretty good deal.", "verified": true, "helpfulness": "0/0", "author": "Michele H."}, {"rating": 4.0, "review": "Won't work with dumb TV.", "verified": true, "helpfulness": "0/0", "author": "W. Chen \"Gamer Z\""}, {"rating": 5.0, "review": "So far, so good, still learning on it versus the Roku we have.", "verified": true, "helpfulness": "0/0", "author": "Dallas, Texas \"Dallas, Texas\""}]