[{"rating": 5.0, "review": "More than met expectations.  Have suggested it to friends.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I already own a Roku 3 and a chromecast but purchased two of these as gifts because I love Amazon products.  I think there will come a day when Amzon surpasses Apple in technology.The interface on the Fire TV stick is very user friendly and looks great.  If my parents can figure out how to use it.....you can too!!  ;)I am seriously beginning to wonder if I need cable anymore.  The Fire stick enables you to stream so much content.  It is just as fast as my double the price ROKU 3 and the app/channel store is robust.  You can also play games on it. Please do yourself a favor if you are trying to choose between this and chromecast hands down the fire stick is the way to go.  You can't do much with chromecast and are limited to mirroring a handful of apps from your phone, not to mention that it does not come with a remote nor can you play games.  I'm very excited to see what Amazon has in store, because already they are knocking it out of the park.", "verified": true, "helpfulness": "0/0", "author": "Elliott"}, {"rating": 4.0, "review": "We were hoping to rent more recent movies instead of buying them, such as Dallas Buyers Club and Grand Budapest Hotel.", "verified": true, "helpfulness": "0/0", "author": "Jeanne Russell Guest"}, {"rating": 5.0, "review": "Best $40 I have spent!", "verified": true, "helpfulness": "0/0", "author": "Gina  Lund"}, {"rating": 5.0, "review": "The fire stick is the truth works great happy from the time I plugged it in even better then the set up on my blue ray players", "verified": true, "helpfulness": "0/0", "author": "lakee edwards"}, {"rating": 4.0, "review": "Works great as long as your wi-fi is adequate. Once I boosted my wi-fi with a wi-fi extender, the Fire Stick works beautifully. Installing the batteries was a bit of a challenge. You have to press on the stick extremely hard to open the battery compartment.", "verified": true, "helpfulness": "0/0", "author": "Fred V. Amundsen"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Christian Tejada"}, {"rating": 5.0, "review": "When I first received the Fire TV Stick, my TV was not able to read find the device. Trying another TV, the Fire TV Stick was detected, but could not find the remote.  Before I gave up, I returned that unit and exchanged it for a new one.  I'm happy to say that I think the first unit I got was defective. The second one I received worked perfectly.  Setup was easy and I was happy to see how responsive the interface was.", "verified": true, "helpfulness": "0/0", "author": "rocksteadytheory"}, {"rating": 1.0, "review": "THe firestick did not meet my expectations because it stops all the time you can never see a complete movie. I wanted to return but I tore the box. Very unsatisfied.What can you do about that.", "verified": true, "helpfulness": "0/1", "author": "dorothy hamlin-bryant"}, {"rating": 5.0, "review": "Best on the market!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Russell M. Cowley"}]