[{"rating": 3.0, "review": "No problems setting up or using.  It does seem to want to take over my TV though.", "verified": true, "helpfulness": "0/0", "author": "Larry 57108 \"outofbeeragain\""}, {"rating": 1.0, "review": "I hate it. I have had it for a couple of months and then figured out it doesn't support very many channels. I have waited too long to send it back. I will never do it again. ROKU all the way!!", "verified": true, "helpfulness": "0/0", "author": "Unknown"}, {"rating": 5.0, "review": "The most awesome gadget for Prime members......I cannot believe I didn't get this sooner------hours and hours of awesome streaming of movies and music.......love it", "verified": true, "helpfulness": "0/0", "author": "B. Chambers"}, {"rating": 5.0, "review": "I love the Amazon fire stick. It has so many options for television and movies.  There are even awesome games you can play.", "verified": true, "helpfulness": "0/0", "author": "katherine albritton"}, {"rating": 4.0, "review": "Works good.  I've only had it for a week but  like it so far and I don't rely on cable that much anymore.", "verified": true, "helpfulness": "0/0", "author": "Thakurdeo"}, {"rating": 4.0, "review": "It's a great little device. It has several fun games and several online video streaming apps. If you have prime membership it includes prime video and music and many fun things. We don't watch TV much anymore, other than for GOT now.  The only things I'm unhappy with is this clicking noise it makes once in a while, but you have to really pay attention to be able to hear it. My family can't hear it until I point it out. Also, maybe it's my internet connection, but it stalls sometimes, very few times, but enough to bother me. Best thing about it is whenever we have family night at my in laws house, I can take the little device with me for movies and such.Great buy!", "verified": true, "helpfulness": "0/0", "author": "ADS"}, {"rating": 5.0, "review": "love my  fire tv!!! have several ...", "verified": true, "helpfulness": "0/0", "author": "Rita M. Mckeown"}, {"rating": 5.0, "review": "I love my kindle fire stick, I previously had a roku 3 and while the roku had a lot of similar apps this seems to function much better. I use the remote app on my phone since I tend to lose remotes and I love how easy it is to use. I do wish I could browse the internet from this but I can watch so many things on it that I'm more than content watching whats available.", "verified": true, "helpfulness": "0/0", "author": "errrmerika"}, {"rating": 2.0, "review": "If you love Hulu Plus then stay away - the app has been buggy for months with no update. Its unclear if Amazon or Hulu are to blame, but there's no support from either vendor. We've gone back to using our older and slower Roku 2 to have uninterrupted playback, as we use Hulu 80% of the time.Netflix works great. No experience using Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "TheZombieParade"}, {"rating": 5.0, "review": "This is an awesome product. Congrats to all the engineers that made it happen with Bezos' certain meddling. Must have been like running a 20K in mud up to your knees.", "verified": true, "helpfulness": "0/0", "author": "Danver Mishtannoc"}]