[{"rating": 3.0, "review": "Not yet ready. We have a Fire TV. We love it. We occasionally need to cycle the power when it forgets it's connected to the network.This little toy, however, seems to have no end of connection problems. Cycling the power may be required several times during a single 40 minute TV show.When it works right (80% of the time) tho, it's nice.", "verified": true, "helpfulness": "0/0", "author": "Elderbear"}, {"rating": 5.0, "review": "Fire TV stick is everything we expected and more. Love it.", "verified": true, "helpfulness": "0/0", "author": "Teresita Bigay"}, {"rating": 5.0, "review": "Amazing service and product", "verified": true, "helpfulness": "0/0", "author": "Orlando Martinez"}, {"rating": 2.0, "review": "I'm going to return it I should have spent a few more dollars and purchased the fire tv box I have one and it works great the stick doesn't load I wait and wait and then it tells me I don't have internet connection so I check that and it's fine so I try the stick again and it's not loading so I use the fire tv box and it worked fine", "verified": true, "helpfulness": "0/0", "author": "joann \"Joann Adcock\""}, {"rating": 4.0, "review": "there is no proper search filter for free/included prime video. and the interface while is good could be much better. also it could use the ability to customize your fav items or shortcuts", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "Works just as advertised. I got tired of trying to access Amazon Prime via my Playstation 3 so when I saw the Fire Stick at $39, I went for it. It showed up promptly and I was up and running in no time.I inserted the Fire Stick into the HDMI Slot 2 in my AV Receiver instead of the TV, using the dongle and power supply provided. Next, I went into the software for my Logitech Harmony One Universal Remote. I added the Fire Stick as a device, and then created an Activity called \"Watch Amazon Prime\". I told the Remote it was in HDMI 2 and that was it. Once the software updated the Remote, I just pointed it at the Receiver, selected \"Watch Amazon Prime\", and the Fire Stick launched me from DirecTV right into Fire Stick Network Setup. It found my Wireless Network, I entered the PW, and away we went. The whole thing took less than 10 minutes. Sweet!", "verified": true, "helpfulness": "0/0", "author": "West LA Guy"}, {"rating": 5.0, "review": "Love it!  all of the Amazon Fire products are great.", "verified": true, "helpfulness": "0/0", "author": "Elaine Lee \"Elaine Lee\""}, {"rating": 5.0, "review": "Fast, responsive, easy to use, good wireless support and streaming support has been real good even though my wireless network is not great throughout my house.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 1.0, "review": "Don't lose the remote for this device. You won't be able to use it ever again afterwards. I even have a phone that I can use as a universal remote for any TV but it won't work on this device just for the simple reason of them not being on the frequency of Internet connection. same router, same Internet connection, different frequency, yet this p.o.s won't work!", "verified": true, "helpfulness": "0/0", "author": "Tpmmy F."}, {"rating": 5.0, "review": "Happy with the purchase", "verified": true, "helpfulness": "0/0", "author": "sonya green"}]