[{"rating": 5.0, "review": "Works great. As advertised", "verified": true, "helpfulness": "0/0", "author": "ROBERT STEHLY"}, {"rating": 4.0, "review": "Works fairly well. Glad I was able to get it on a prime deal for 19 bucks. Wish there were more game apps available for the included remote. Do not expect to use the second screen function with a 2013 Kindle Fire HD.", "verified": true, "helpfulness": "0/0", "author": "Kenny B"}, {"rating": 5.0, "review": "Easy installation and easy to use. Great product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The movies appear to show very dark.", "verified": true, "helpfulness": "0/0", "author": "Eugenia"}, {"rating": 4.0, "review": "How do you get the battery  compartment opened I have tried everyway I could and can not manage to open the battery compartment.Finally found in comments how others had this problem and got it opened.Like the stick and it is simple to operate.Deducted a star for poor info on how to open battery dept.", "verified": true, "helpfulness": "0/0", "author": "Eddie Wils \"EJ\""}, {"rating": 3.0, "review": "I'm still getting to know the device, but it did disappoint me that after setting up and connecting the Fire Stick, it is supposedly out of range of our home network.  So I have to check more into this since every other computer and smart phone in our house can receive our wi-fi network signal.", "verified": true, "helpfulness": "0/0", "author": "Patricia Pringle"}, {"rating": 4.0, "review": "It works faster and better than my old Roku stick. The price is definitely right... I'm sure it's a loss-leader type thing for Amazon, especially at the pre-order price. In fact, I bought two and I'm not even sure what to do with the other one! I wish the buttons on the remote lit up though because it's difficult to use in the dark. I haven't tried to use it in concert with my Kindle Fire yet, but that could be very cool!", "verified": true, "helpfulness": "0/0", "author": "FDR Jones"}, {"rating": 5.0, "review": "Easy to setup, no problems.  Was watching within 15 minutes.", "verified": true, "helpfulness": "0/0", "author": "Skyhawk"}, {"rating": 4.0, "review": "This is truly a marvelous product.  After reading two different books on using the Fire TV Stick and everything I saw on Amazon, I have a few things to add that would make it absolutely perfect, or at least allow us to know what we were getting.  First, nowhere, anywhere, that I could find, mentioned that you need to have high-speed Internet.  I have satellite (with no other option available) and it just isn't fast enough.  To make it worse, there is no option I could find to have the Fire Stick transmit in standard definition instead of high def.  I have a NetFlix account that is locked in standard definition for those who have with limited bandwidth.  That would seem like a doable feature that could be added.  Second, a little clarification on the directions would be useful--like adding just the name of the remote to use during set-up..  \"Using your TV remote, select the HDMI port that has the Fire Stick plugged in.\"  And, \"Using the Fire Stick remote, put in the security code for your WiFi system.\"  (or whatever the exact wording is)  We are all sitting here with a stack of remotes.  Make it simple by telling us which one to use.  Super product!  Just wish I had more bandwidth.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 1.0, "review": "Apparently, I haven't had the experience that some who like this have had, but I would not advise getting this. It almost never works. I have to re-enter my network details almost every time and often that doesn't work and I have to resort to watching Prime shows through the app on my iPhone.I have three other streaming devices (Apple TV, Google Chromecast and a Samsung USB drive). None of these products have caused me anywhere near the headache and frustration that the Fire TV Stick has. It simply does not work. At least for me it doesn't.P", "verified": true, "helpfulness": "1/1", "author": "Patrick Miller \"LA Kayaker\""}]