[{"rating": 5.0, "review": "Works very well. So easy to install. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Lisa W. Wright"}, {"rating": 5.0, "review": "Fantastic!!!", "verified": true, "helpfulness": "0/0", "author": "Carol Flannigan"}, {"rating": 5.0, "review": "Works great...worth every penny. Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Boomer54"}, {"rating": 5.0, "review": "It is great!  I came ready to go.  Very easy to install.", "verified": true, "helpfulness": "0/0", "author": "sheri"}, {"rating": 4.0, "review": "Product was as advertised. Fast delivery", "verified": true, "helpfulness": "0/0", "author": "Jeremy Williams"}, {"rating": 5.0, "review": "The fire stick is fantastic, I got it for my wife as a gift she says it is the best gift that is have ever gotten her", "verified": true, "helpfulness": "0/0", "author": "William Pate"}, {"rating": 5.0, "review": "Love this product!  I was so tired of using my cell, laptop, and tablet to navigate all the different apps.  This is a ONE-STOP-SHOP!  I can now listen to Pandora, watch movies on Netflix or on my Amazon Prime Account.  It's really been the best $$$$ I've spent in a while.  A MUST have!", "verified": true, "helpfulness": "0/0", "author": "May S Moua"}, {"rating": 2.0, "review": "I was very excited to get my Amazon Fire TV Stick; unfortunately, after 3 hours of trying to get it to work, including 45 minutes on the phone with Amazon, nobody could figure out why it would lose connection from the internet every 30 seconds. When I ran a test on the device, it said it was connected with good strength. I unplugged and restarted the Fire TV stick multiple times. I restarted my internet multiple times. Both my cell phone and laptop were connecting to the internet alright. At the end of the night I made the decision to just return the product altogether. It's an awesome concept, but unfortunately I think that I just received one that was bad.", "verified": true, "helpfulness": "1/1", "author": "Stephanie Matsey"}, {"rating": 5.0, "review": "Got ATT-Uverse. It works great with Amazon Prime movies.Not so great with MLB. So I'm stuck on the MacBook until I get home to MO from CA.I'm missing my Cardinals in their FANTASTIC season on the big screen.Go Cards, GO!!!", "verified": true, "helpfulness": "1/1", "author": "Jarhead"}, {"rating": 5.0, "review": "Easy!", "verified": true, "helpfulness": "0/0", "author": "Barbara Tuset \"Responsible\""}]