[{"rating": 5.0, "review": "Great product with lots of options for things to watch.  Very easy to set up.  All most as good as a smart TV.  I have done the cord cutting and don't have cable TV  and this gives many options for all kinds of programming.  The money saved over cable TV is wonderful.", "verified": true, "helpfulness": "0/0", "author": "VaroomVaroom"}, {"rating": 5.0, "review": "Excellent device! easy to setup.During the initial setup, I found my device to restart on and off ; I noticed that it needs to plugged on to a  power outlet (needs 1mAh , whereas my tv had only .5 supply). Hope this lil tip helps someone out there facing the same issue I did :) Overall, no complaints and great performance!", "verified": true, "helpfulness": "0/0", "author": "yuvashree dilipkumar"}, {"rating": 5.0, "review": "Love this thing. Have the Fire TV (full size) in the living room and picked this up for the bedroom TV to replace an aging WDTV product. This does so much more and the speed is perfect. Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "Jason Kloos"}, {"rating": 5.0, "review": "Been using it for awhile now and love it.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "I've had an Apple TV for a few years now, and loved the interface and integration of services, but the Fire Stick blows it out of the water. The UI is so easy to navigate, and looks great. The performance is top notch, zero lag when loading or playing video. All the services you could want are provided.Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "Aric Miller"}, {"rating": 5.0, "review": "Easy to use with steps that take you from the whole process. Lots of apps available to stream. Great price!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer wonder woman"}, {"rating": 5.0, "review": "Works perfectly. No bugs (yet), unlike Chromecast that I gave up on a year ago.", "verified": true, "helpfulness": "0/0", "author": "DashHound \"dachshund\""}, {"rating": 1.0, "review": "We've had the fire stick for a month and have yet to be able to watch a movie uninterrupted without streaming delays, even though we had a DEDICATED DSL INSTALLED at 10mg, the highest speed available on Century Link. Furthermore, if you search for \"Fire Stick Support\", one is connected to several operating manuals for PURCHASE. We could not find any support database or information, and NOTHING of the kind is included in the box. So, we've simply contributed to Amazon's growing profit margin.", "verified": true, "helpfulness": "0/1", "author": "D C Dan Lee"}, {"rating": 3.0, "review": "it loses connection constantly, and the issue is not my router. I have to frequently unplug and replug the fire stick in. very annoying.", "verified": true, "helpfulness": "1/1", "author": "Matthew James Jimothy"}, {"rating": 5.0, "review": "Love this thing planning on buying one for each tv", "verified": true, "helpfulness": "0/0", "author": "Christopher T."}]