[{"rating": 4.0, "review": "Like it's cool", "verified": true, "helpfulness": "0/0", "author": "percy landrum"}, {"rating": 5.0, "review": "I am very impressed so far. I bought the Firestick 3 weeks ago and it has been easy to use. The streaming services I use most, Prime and Netflix both work perfectly. I recommend highly.", "verified": true, "helpfulness": "0/0", "author": "Lorrie Legg"}, {"rating": 4.0, "review": "Pros: the remote control is an outstanding innovation! Easy to use, fast, many apps and choices to watch and listen (yes audio apps too!), sync with KindleCons: it needs full 5v of power, so USB ports from the tv may not be enough, one needs to conect it to the wall outlet so cables looks not very nice.", "verified": true, "helpfulness": "0/0", "author": "Greivin Hernandez-Gonzalez"}, {"rating": 5.0, "review": "This is a great alternative to cable.", "verified": true, "helpfulness": "0/0", "author": "Imyursister"}, {"rating": 5.0, "review": "Simply awesome !!!!!", "verified": true, "helpfulness": "0/0", "author": "Daniel Sale"}, {"rating": 5.0, "review": "I love it. . Its exactly what I wanted.  Now I can watch Netflix and listen to music.", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "Simple but powerfull", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "Easy to install and use. Like the remote. Has replaced my chromecast for most functions..tho sometimes the apps like Netflix pause more then with my chromecast and pictu re quality sometimes goes grainy for shirt periods of time.", "verified": true, "helpfulness": "0/0", "author": "StaySea"}, {"rating": 5.0, "review": "Great overall", "verified": true, "helpfulness": "0/0", "author": "Derrick J Turner"}, {"rating": 2.0, "review": "I understood that there would be some 70,ooo movies and tv shows I would be able to watch.  Well' I can't find only about 70 of them.  Take away the R rated and the children's TV we found two that we actually watched.  I can say though, it was very good picture quality.", "verified": true, "helpfulness": "0/0", "author": "David Allis"}]