[{"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Jo Ellen Schmid"}, {"rating": 3.0, "review": "its freezing up!", "verified": true, "helpfulness": "0/0", "author": "Jessie Duran"}, {"rating": 5.0, "review": "Great", "verified": false, "helpfulness": "0/0", "author": "marilyn mullenhoff"}, {"rating": 1.0, "review": "Had issues with this after using it three days. It began to flash on and off and was covered with either red or green. We tried to get support from Amazon but were unsuccessful. After spending hours searching the internet and following a list of things to try we returned it. That was another story all together but finally was able to send it back. When we called to return we were offered support but it was way past that with us. Glad to be done with it. It was great while it worked but you are on your own if something goes wrong.", "verified": false, "helpfulness": "0/0", "author": "Donna"}, {"rating": 5.0, "review": "It was a Mother's Day gift from my children and I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "EFFIE DEUBLE"}, {"rating": 5.0, "review": "Works wonderful.", "verified": true, "helpfulness": "0/0", "author": "Chuck Walters"}, {"rating": 4.0, "review": "This is a very reliable product. I recommend it for its economy. We have enjoyed using it. Great reception! The Fire Stick expands our choices, versatility and dollars. We also have a Roku for the same reason, and the Fire Stick has fewer choices but is comparable in quality. Thank you, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Wise Owl"}, {"rating": 5.0, "review": "Easy to use. Easy to install. What more could you want for the price.", "verified": true, "helpfulness": "0/0", "author": "Joe reader"}, {"rating": 5.0, "review": "Fantastic value for the money, especially if you are a prime member.  Works very well, and it's fast.  Thousands of viewing options. I don't have cable but with the sling tv app I don't need it.", "verified": true, "helpfulness": "0/0", "author": "J.French"}, {"rating": 5.0, "review": "I'm very happy with my Fire TV stick, and the apps addon feature.", "verified": true, "helpfulness": "0/0", "author": "Dexter Love"}]