[{"rating": 5.0, "review": "if you do not have a smart tv then this is for you because it will turn your tv into one.  and you can take it on the road with you wherever you go as long as wifi is available. the remote is really functional and easy to use. would really recommend.", "verified": true, "helpfulness": "0/0", "author": "keith"}, {"rating": 5.0, "review": "We loved our Full size FIRE TV, that we got this stick for the kids play room. We really like it and our 6yo and 2yo know how to operate the remote and get to the shows they like. I wished we had more control over the parental controls. Right now it seems like you can either LOCK EVERYTHING down, or NOT lock anything. I would like more control of what we lock down and how. But, I recommend this to everyone. We don't even have cable anymore.", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 5.0, "review": "Excellent steaming device and remote means everyone can use it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Good product.  I which you could modify the menu options a little more.  I bought it to use Sling TV and Netflix.  I'm not an Amazon Prime member, nor to I plan on being, but most of the menu options are for purchasing things though Amazon Prime.  Other than that its a cool little device.  The remote works wonderfully.  There are available Apps, including YouTube and Spotify (for Spotify premium subscribers only...which is annoying).", "verified": true, "helpfulness": "0/0", "author": "Joseph Chaumont"}, {"rating": 3.0, "review": "The Fire TV Stick is a good device that has been cheapened by the remote provided.", "verified": true, "helpfulness": "0/0", "author": "D. Abrahams"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Wannette Crumiel"}, {"rating": 2.0, "review": "I purchased this in December when it was on sale for $25 from my local Best Buy. The thing worked really good for a few months but all of a sudden it stopped working. The power will not even turn on. I contacted Amazon but not warranty on this thing or at least one that last 6 months kind of pissed. although now I'm debating purchasing another one....the kids use it for their streaming of shows.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "WOW, this turns a regular TV into a Smart TV.  Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "David Redfield"}, {"rating": 5.0, "review": "Really like this thing! Super cool. Haven;t had it long so I don't know all the limitations and such but so far it's great.", "verified": true, "helpfulness": "0/0", "author": "Rose Conley"}, {"rating": 5.0, "review": "it is a great item", "verified": true, "helpfulness": "0/0", "author": "Dean Groff"}]