[{"rating": 5.0, "review": "I love it. Easy to use and the remote is wonderful", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it, even purchased one for gift", "verified": true, "helpfulness": "0/0", "author": "Barbara Sajewski"}, {"rating": 5.0, "review": "Awesome, no need to buy a wifi tv after purchasing the fire stick", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "Got this for my daughter for Christmas and she has not stopped using it. It is a great little device that is easy as pie to setup, update and use.", "verified": true, "helpfulness": "0/0", "author": "DaveC"}, {"rating": 3.0, "review": "Like the Fire TV Stick...But, not happy that as a Amazon Prime member I have to pay to view movies...Why is this ?", "verified": true, "helpfulness": "0/0", "author": "Salvatore"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "thomas m muradian"}, {"rating": 2.0, "review": "It works ok, however it would be nice if it also worked with non-subscription services like basic Hulu and CBS.com", "verified": true, "helpfulness": "0/0", "author": "curtis schneider"}, {"rating": 5.0, "review": "I love the convenience of the FireStick! It's awesome!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Root"}, {"rating": 4.0, "review": "Works great, and love that it came preloaded with account info so that setup was very easy.  The FireTv stick makes it (mostly) easy to access Amazon Prime and Netflix on the go.  The only real difficulty, which I hope Amazon updates, is that if you're travelling and the hotel or other wi-fi connection requires a sign-in page, the Fire TV stick will not work since there is no html browser.  This should be a simple fix with a software update, and hope one comes soon - I would give 5 stars except for that one problem.", "verified": true, "helpfulness": "2/2", "author": "Ted Howard"}, {"rating": 5.0, "review": "I have both chromecast and fire stick...I love the fire stick!! Super easy... Love it! Makes your tv into a smart tv without the cost!! Nice job amazon!", "verified": true, "helpfulness": "0/0", "author": "Melissa A Garofolo"}]