[{"rating": 5.0, "review": "Very simple installation, fast connection to Internet, and simple navigation to apps.  This was an excellent buy for its fit and function far exceeded my expectations!!", "verified": true, "helpfulness": "0/0", "author": "nicholas s."}, {"rating": 5.0, "review": "Super, easy to access interface, and you can't beat the price! Going to put one of these on all my TVs.", "verified": true, "helpfulness": "0/0", "author": "Ted E"}, {"rating": 4.0, "review": "The Fires TV Stick seems (after 1 day) to work just fine and is great for the money, it is far faster than my Sony smart TV though I suppose that could be proximity to the router. The unit is very easy to get up and running which is a good thing since it comes with virtually no information about installation or capabilities. I was very surprised to see that the dongle needs external power which is supplied via a usb connection and was surprised yet again to read in a review that the external power may not be necessary if you are getting enough power through the HDMI connection. I may have missed that in the instructions...... but I doubt it.All in all the Fire Stick does all my Sony TV does except faster and with a bias towards Amazon Prime. I attached it to my old Westinghouse V and revitalized it.", "verified": true, "helpfulness": "1/1", "author": "daveb \"daveb\""}, {"rating": 4.0, "review": "I've been a prime member for several years now, so at the $20 introductory price it just made sense.  The product works as advertised and I'm very happy that I can easily stream Amazon content to my TV.  With that said, I'm disappointed that DirecTV customers (like myself) are unable to use apps like Showtime Anytime, and Disney etc...", "verified": true, "helpfulness": "1/1", "author": "R. Seward"}, {"rating": 5.0, "review": "I'm thrilled with the user interface and ease of use.  I'm really glad I got the TV Stick.  Am watching fewer and fewer commercials all the time.  Yaaaaaayyyyyyyyy", "verified": true, "helpfulness": "0/0", "author": "R. Talley"}, {"rating": 5.0, "review": "Update: I use this almost pretty much every evening. It has clearly paid for itself...so handy for a tv I don't have any cable on, only used for streaming.  I'm thinking of purchasing a second.I've had the fire stick on my tv for the last few days. Set up was simple. I read through reviews prior to connecting it just so I could anticipate any problems.  The stick did not easily fit in my hdmi port, so I used the dongle...that worked fine. It connected and updated without issue.  (Previous reviewer was right. Though it asks you for your router pw a second time after updating...the second entry is not necessary. If you ignore it for a moment it still connects)I have only streamed Netflix and my video library so far, but both work without any buffering problems.  I did have amazon stop detecting a connection once. Which confused me since my pc, kindle and phone were running fine on my network. It seemed to correct itself within about 15 mins.Navigation on the remote is tolerable. I don't like having to enter my pin every time I connect to a show, however I have children in the house that want to use it as well..so parental control is necessary.Ive noticed if you watch for a period of time without any pausing or such, it will ask you if you are still watching. Not a big deal unless you are half asleep.Overall...I paid $19 and it's working as I intended it to...to stream Netflix, hulu and most importantly my amazon content. True, you can accomplish the same feat with any cheap dvd player and a small connection cord for your kindle...but this is more convenient.", "verified": true, "helpfulness": "0/0", "author": "Love to Shop"}, {"rating": 5.0, "review": "Works pretty flawlessly. Remote makes it much easier to use than Chromecast. And, simple games like sonic and zen pinball run really well.", "verified": true, "helpfulness": "0/0", "author": "Joseph Sullivan"}, {"rating": 4.0, "review": "I really enjoy the Amazon Fire TV Stick and I believe it adequately handles most peoples needs without exceeding a reasonable and entry level cost. I have used it to stream Pandora, Netflix and with limited use the showtime anytime app. I encountered a few issues with the showtime app and found that the volume is often excessively low when delivering showtime content and often found itself buffering, which wasn't required when streaming Netflix. I ordered an additional unit to keep accessible for traveling and vising places which a device such as this might not be available but would be beneficial, such as my parents house over the holidays. It definitely outperforms the Roku Streaming stick which I purchased for my girlfriend several months ago.", "verified": true, "helpfulness": "0/0", "author": "Daniel M"}, {"rating": 2.0, "review": "Very weak WiFi reception.  Would never work in my family room.  Gave up and stuck it on a bedroom tv.  Laptops and tablets work fine in the family room.  Not the fire stick.  Very disappointed", "verified": true, "helpfulness": "1/2", "author": "Randall S Thorn"}, {"rating": 1.0, "review": "I pre-ordered this product although I like the Roku a lot.  It arrived on time, setup was easy, and it worked - once.  Since then I get a message that it cannot connect to the internet and to check my settings.  Since my iPhone, iPad and iMac and Roku are all connected to the internet, the problem is with the Firestick.  I'll try again for a few days before I return it.  In the meanwhile, I remind myself to never buy anything with a low serial number.Update sometime later that same day - finally got this thing to connect to the internet, and it even said the signal was strong, but with \"problems.\"  Kept messing with the remote, went to settings, and my network was there, but then I got a message \"out of range.'  Really? 20' is out of range?  If I place the TV next to the router, its also next to my Mac with a big enough screen to watch what I thought I'd be watching with the Firestick.  So I'm returning it lock stock and stick tomorrow.My techno consultant, aka son, tells me the Fire TV is great with no range problems, so I've ordered one.  After paying the sale price, using a credit card cash back, and the return on the stick, I'm only paying the price of a decent wine for the Fire TV.", "verified": true, "helpfulness": "1/3", "author": "John Robinette"}]