[{"rating": 3.0, "review": "I was really happy with the fire stick until this past month. After watching for a while the video goes out and the audio stays on. The only way to keep it working is to unplug it and plug it back in every few hours.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The firestick is fantastic. I am pretty much tech ignorant but this remote is easy to figure out.  The stick was easy to install and get up and running.Cant go wrong for the price.", "verified": true, "helpfulness": "0/0", "author": "David Mills"}, {"rating": 1.0, "review": "I have to unplug my fire stick and replug it in every time I want to use it. Then after it worked for a month I finally bought an Amazon Prime account and all of a sudden all my videos on the instant stream page and on Netflix just show a blue screen with \"HDCP unauthorized content disabled\" across the screen. I'm so fed up with this product. Definitely not worth the money and I wouldn't recommend it for anyone.", "verified": true, "helpfulness": "0/0", "author": "Jess j."}, {"rating": 5.0, "review": "it was easy to install, worked great.", "verified": true, "helpfulness": "0/0", "author": "Larry W. Liberman \"larry l\""}, {"rating": 5.0, "review": "I love this product so much that I have cancelled my cable service. So much variety, so few commercials...why did I not do this sooner?", "verified": true, "helpfulness": "0/0", "author": "Michelle Anderson"}, {"rating": 5.0, "review": "This is Way over the top. You will be surprised at the ease of use and performance", "verified": true, "helpfulness": "0/0", "author": "garyedavidson"}, {"rating": 4.0, "review": "Set up easy.  Need to be sure modem and internet is fast enough or will slow streaming. Otherwise, well worth the money.", "verified": true, "helpfulness": "0/0", "author": "R. Wayne Stevens"}, {"rating": 3.0, "review": "It works fine. Just a little slow moving between apps and programs, etc. And less content than I thought I had for automatic/included subscriptions, for having Prime.", "verified": true, "helpfulness": "0/0", "author": "Raina Edwards"}, {"rating": 4.0, "review": "excellent and easy to use...", "verified": true, "helpfulness": "0/0", "author": "John A. Daly Jr"}, {"rating": 5.0, "review": "This is awesome.  No longer do I have cords coming out of my tv to my Kindle Fire.  Push a couple of buttons and you can look at anything you have on your Kindle or anything you want to purchase or rent. I never have to get up unless I wish to. Technology is great.  Keep up the good work.", "verified": true, "helpfulness": "0/0", "author": "Zigzag67"}]