[{"rating": 5.0, "review": "excellent!!", "verified": true, "helpfulness": "0/0", "author": "leo"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Moises Garcia Rojas"}, {"rating": 4.0, "review": "love it! Doesn't have the best reception but once we put it in a tv close to the router, it worked fine!", "verified": true, "helpfulness": "0/0", "author": "Luvmy4boyz"}, {"rating": 2.0, "review": "Nowhere near as good as the Chromecast. It may have a better processor and more memory but it is overly sensitive to wireless AP's. I have 3 AP's in my home and this is about 20' away yet it keeps having to buffer. Glad I got it when it was 19.99 but I'm sticking with my Chromecasts until they improve the performance of this.", "verified": true, "helpfulness": "0/0", "author": "Mike S. \"-Mike\""}, {"rating": 5.0, "review": "Love it!! Way better than my Chromecast, steams a lot smoother!! A little disappointed with the lack of expandable storage, though hopefully in the future updates they might include USB OTG functionality via a powered otg cable..", "verified": true, "helpfulness": "0/0", "author": "joshua holder"}, {"rating": 2.0, "review": "Wow, I am so disappointed in the performance. Keeps freezing. Must reboot constantly.  Slow loading videos &movies.; It keeps stopping to buffer. It`s taking us 20 minutes to watch the last 3 mins of the movie! Ugh. Netflix does not work well. Amazon Prime Movie selection sux too, and very expensive to rent!  Wow. That's all. WOW.", "verified": true, "helpfulness": "0/1", "author": "Diane McLean"}, {"rating": 5.0, "review": "Exelent", "verified": true, "helpfulness": "0/0", "author": "Pedro C. Delgado"}, {"rating": 4.0, "review": "I got one of these as a special intro at half price. But even at full price, the Fire TV Stick is still one of the best values available. Turns an ordinary TV or computer monitor with an HDMI jack into a network enabled television. And unlike a Smart TV, you can download apps to your heart's content.The Fire TV family definitely favors Amazon content and is geared to make downloading and paying for that content easy. But Netflix is available, and so are several other paid and free streaming apps. Plus Fire owners get 5 GB of photo upload space free on Amazon Cloud Drive, which makes this a great way to browse your digital photo collection.", "verified": true, "helpfulness": "0/0", "author": "J P Kazarian"}, {"rating": 3.0, "review": "Getting used to it", "verified": true, "helpfulness": "0/0", "author": "keith lydon"}, {"rating": 5.0, "review": "We mounted a small TV on our covered porch recently. We purchased the Fire Stick to avoid having to have a cable/satellite connection installed. The Fire Stick so far has far exceeded our expectations. Set up was quick and simple. Being Prime members our family has access to seemingly endless viewing options. Our kids enjoy having friends over to \"camp\" in the back yard and watch a program or play a game. My husband and I enjoy having a beverage while listening to music. Perfect for our needs. Love Amazon products and service.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]