[{"rating": 5.0, "review": "Absolutely love it!  There are tons of apps and games and it's very fast.", "verified": true, "helpfulness": "0/0", "author": "Dee"}, {"rating": 1.0, "review": "I bought this for my daughters TV so she could watch Netflix and Amazon in her room.  She is a very early riser, were talking like 4am sometimes on the weekend.  Guess who gets woke up to go put in the Netflix password or troubleshoot why it is only showing a black screen?  Our Chromecast and Roku are rock solid reliable but the Fire stick only works about 25% of the time.  I'm returning it and getting another Roku.", "verified": true, "helpfulness": "2/2", "author": "mark"}, {"rating": 5.0, "review": "Love this. If you are a prime member, you must get the fire tv stick!!!", "verified": true, "helpfulness": "0/0", "author": "Queen Reader"}, {"rating": 5.0, "review": "I have a Roku, Chromecast, Gaming systems and many other devices to stream video.  This Fire TV Stick has been moved to the main TV in our house.  Easy to use, remote works great.  Even my non-techie wife loves it.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "worked seamlessly the first time. good product and we will enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this thing! Bought the ChromeTV first and took it back because you don't get a remote; you have to use your phone or tablet to manage everything. Well, signing into my phone to change channels or search proved to be too much hassle. I can use the FireTV remote now OR I can use my phone or tablet.  And, with the app on the phone I can simply speak into the app what I am looking for to watch and it pops up!!! You don't have to type your search with the remote into that lengthy search page. With Amazon Prime you get more content than you can watch in a lifetime.I have already used the Amazon prime to order things as well. Free shipping on everything means the price you see online is the price you pay. There is no additional charges.  The Amazon prime has already saved me $32 in shipping birthday presents and I have only had it for 3 weeks!  I could not be happier about my decision to go FireTV.  You won't either.", "verified": true, "helpfulness": "0/0", "author": "Larry Harmon \"ShowBiz\""}, {"rating": 5.0, "review": "Amazing product, I bought three after the first one for every TV. There is always room for improvement but I buy it again if had to. Cut NY cable bill $113. It cut my brothers cable bill $183", "verified": true, "helpfulness": "0/0", "author": "Brittany"}, {"rating": 2.0, "review": "I was disappointed that one must disconnect the HDM1 cable to use the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "penrod"}, {"rating": 5.0, "review": "Ordered it to use with a Slingbox M.  Utilizing the Amazon App it works as expected on my home network.  I have Apple TV too, but this is much easier to utilize and smaller.  I was able to power the Fire Stick from a USB port on the TV so there is no need to run the AC power supply that came with the device.", "verified": true, "helpfulness": "0/1", "author": "MB"}, {"rating": 1.0, "review": "Stops and starts even when the signal is very good.  Freezes, have to turn off tv, wait a while, then turn back on.  Frustrating!", "verified": true, "helpfulness": "3/3", "author": "Elton Rouse"}]