[{"rating": 3.0, "review": "freezes up once every one to two days and has to be unplugged from the power source and plugged back in to perform a hard reset. i'm guessing the RAM becomes too full and doesn't have an effective process to dump data from previously played videos since it was turned on last.but when it does work it's usually pretty good.UPDATE 7/12needs to be restarted more frequently, and the remote app is slow and difficult to use", "verified": true, "helpfulness": "0/0", "author": "Dean \"dad\""}, {"rating": 5.0, "review": "Looovvvve this!! Loads shows quickly with almost zero interruption. Also love that the remote is very quick to respond (in my opinion, much faster than AppleTV, which I also own). Planning to buy more of these as gifts for friends & family.", "verified": true, "helpfulness": "0/0", "author": "blondecurve \"blondecurve\""}, {"rating": 5.0, "review": "Love this product! The wall port that comes with it helps with better internet connection and the many features that come with this product are great. I had no idea how many apps you can actually get with it. Definetly worth every cent!", "verified": true, "helpfulness": "0/0", "author": "Ta-Janay Smith"}, {"rating": 5.0, "review": "I Love that there is a Library List you can add items to so you can go back to that list rather than search through the plethora of the multitude of increasing entertainment that is added daily!What I would like to see Amazon! If you are also reading this! Is a way to send a trailer of a video you have watched that you want to share with a friend or family member in another household. If there was a way to do this Amazon would actually make more money!Plus they did work out on their Kindles where you can loan a kindle book to someone so why not be able to loan out a film you just bought to someone just like a kindle book!I would really like to see some sort of connectivity in that way!", "verified": true, "helpfulness": "0/0", "author": "K. Roth \"ladyroth\""}, {"rating": 5.0, "review": "The Fire Stick was a great purchase and we have enjoyed it every day!  It was extremely easy to hook up and we were pleasantly surprised when we found out we could also rent movies.  I would recommend it highly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazing device we just love it!", "verified": true, "helpfulness": "0/0", "author": "Cassidy Schulke"}, {"rating": 5.0, "review": "Love it , Love  it. ...did I mention I  loved it.", "verified": true, "helpfulness": "0/0", "author": "J. Turner \"Ms Purple\""}, {"rating": 1.0, "review": "I bought this along side my Kindle HDX 7, but I think it might have been a mistake. It took forever to finally find my Wi-fi signal. The first time trying, it kept dropping connection or not finding one at all. After it finally found a connection the stick then froze on me. Finally after getting it connected and stable I tried display mirroring with my Kindle HDX 7, tried is the key word. My kindle could see the fire stick, but when trying to connect it just kept trying to no avail. I then loaded up a video, the video seemed to take much longer to load, and kept buffering. I thought this would be a step up from my Vizio smart TV streaming options, but doesn't seem like it at this point. I'm gonna try it out some more tomorrow, but if it doesn't start working and flawlessly I'll be sending it back for sure.", "verified": true, "helpfulness": "1/1", "author": "Daniel Jennings"}, {"rating": 1.0, "review": "I just love being hoodwinked into buying the stick, based on my experiences with my Kindle; only to wait LONGER for the videos to come up. A unique pleasure for which I need not have paid money. Rip off of the first caliber.", "verified": true, "helpfulness": "0/2", "author": "S. W. V. Cott \"Broadway Baby\""}, {"rating": 5.0, "review": "Love it! Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "amy e drewel"}]