[{"rating": 5.0, "review": "Very inexpensive - no need for a computer to connect to the Internet.", "verified": true, "helpfulness": "0/0", "author": "M. Goodridge"}, {"rating": 1.0, "review": "I purchased one of these as part of that initial deal Amazon when they first released them and a second at Best Buy on a Black Friday deal.  We were very excited to get the units and have had them both since December.  We cut cable several years ago and have been using one Roku 3 since that time that we love, but as we have additional TV's we thought this would be a cheaper alternative to buying more Roku devices.There are multiple problems we have had with the Fire TV Stick units. First, the interface is terrible, it is built around Amazon Prime although you can use other apps.  Rather than just having all the apps listed on the main screen with an ability to order them as you want, you have an always changing initial menu, and have to go through other menus to get to your full list.  We have Amazon Prime, so it was slightly less irritating, but for someone who does not, it would be a mess.Second problem, and the deal breaker for us that caused us to actually give one of the units away is that these things have to be almost in the same room as the wifi router to get a consistent signal.  I was so committed to making it work in one of the rooms, that I actually purchased a wifi router with better signal output and external antennas and still got very inconsistent connections on the one device that at the end of the house (as a side note, not one other device we have: iPads, Roku, iPhones, etc has trouble connecting in that room).  I contacted Amazon support about this issue and they wanted me to just factory reset the device to fix it (something I had already done).Third problem: multiple crashes requiring me to go unplug the device to hard reset, I probably have 1 crash every 6 months with the Roku, but with the Fire Stick I was having a crash about every other time using the device.My suggestion is to not get this device unless you are okay with an Amazon Prime focused system (even if you don't have Amazon Prime), and only get the device if you are planning on using it close to your router.", "verified": true, "helpfulness": "0/0", "author": "J. Reid"}, {"rating": 3.0, "review": "Really 3.5 stars if I had an option.  I like the fact that the hardware is better than the Google Chrome stick and the price is in the same range.  However, it is lacking many important apps like YouTube.The sync with your phone is pretty neat but it doesn't stream seamlessly enough to try to watch a movie or play a game. It was too choppy for that kind of thing.", "verified": true, "helpfulness": "0/0", "author": "Rami S. \"To thine own self be true!\""}, {"rating": 5.0, "review": "I love the Amazon stick and it has met my expectations.", "verified": true, "helpfulness": "0/0", "author": "Steph"}, {"rating": 5.0, "review": "Love this slick tool.  So easy to access Netflix and Amazon Prime with it.", "verified": true, "helpfulness": "0/0", "author": "Cajungirl"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "D Beamer"}, {"rating": 5.0, "review": "This is a great thing to have if you love movies.it does everything it claims to do. Love it.", "verified": true, "helpfulness": "0/0", "author": "Tami"}, {"rating": 5.0, "review": "The best you will ever use great quality works fast and Bluetooth remote is awesome. Way better than rokus and the dinosaur Apple TV", "verified": true, "helpfulness": "0/0", "author": "Gloria Lee Kim"}, {"rating": 5.0, "review": "Easy to install. No hassle. So far so good.", "verified": true, "helpfulness": "0/0", "author": "David M. Mccarthy \"love books\""}, {"rating": 1.0, "review": "Still haven't been able to use it. My WiFi powers everything else in the house so I don't know why this is such a problem.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Stark"}]