[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "christian d mcclarty"}, {"rating": 2.0, "review": "It States that you get thousands of movies and TV free that is true but the stuff I want to watch is all pay per view or you need to buy into another APP to view what you want. Not at all impressed with this setup and would not recommend.", "verified": true, "helpfulness": "0/0", "author": "George A. Ott"}, {"rating": 5.0, "review": "Love our Fire TV Stick! Easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "gogo"}, {"rating": 5.0, "review": "Great item, worked as well as the first one. Streaming Netflix every night. Flawless", "verified": true, "helpfulness": "0/0", "author": "Mike Duncan"}, {"rating": 4.0, "review": "It's awesome. The only thing I have a problem with is that even when my internet is working great the netflix doesn't want to play very much. It's constantly buffering and then says it can't connect to the Internet. It works sometimes but like this morning while I was doing chores my son couldn't watch tv in my bedroom to keep him out of things. Other than that it's awesome.", "verified": true, "helpfulness": "0/0", "author": "nea nea"}, {"rating": 1.0, "review": "Got it home and it worked great for 1 day.  Then, it wouldn't work any more.", "verified": true, "helpfulness": "0/0", "author": "David G Olson"}, {"rating": 3.0, "review": "Roku is better. Lots of skipping and buffering", "verified": true, "helpfulness": "0/0", "author": "jason lipply"}, {"rating": 2.0, "review": "Thus did not run on my TV I could never figure out the issue", "verified": true, "helpfulness": "0/0", "author": "mikey p"}, {"rating": 3.0, "review": "Its not as fast as i thought it would be. It tends to lag at times. I guess its because its based on Android 4.2. I wish Amazon would update the OS.Hopefully these things are going to be supported for a few years and not abandoned for something new.", "verified": true, "helpfulness": "0/0", "author": "nokian"}, {"rating": 3.0, "review": "It's a bit hard to figure out, every movie I've picked on Amazon Prime I have to pay for and at this rate I'll be back at the same as paying for cable. I thought I'd be able to get local channels through an app but no luck so far, Idk, I'm so annoyed!", "verified": true, "helpfulness": "0/0", "author": "Silvia Sandoval-mena"}]