[{"rating": 5.0, "review": "Work great, easy for the kids to use", "verified": true, "helpfulness": "0/0", "author": "ryan"}, {"rating": 5.0, "review": "excellent I was able to push other apps on the fire sticks awesome", "verified": true, "helpfulness": "0/0", "author": "ben"}, {"rating": 4.0, "review": "It works for what I purchased it for primarily. I however have not been able to get my android 4.0.3 tablet to miracast to it regardless of what software is used. Since it let's me take me take my media with me when visiting people it fulfills it primary function.", "verified": true, "helpfulness": "0/0", "author": "Ian F. Dragon \"Hypermechanic\""}, {"rating": 2.0, "review": "The Fire Stick arrived in a timely manner and was easy to install and program. I am disappointed with the avialable viewing material. There is little that is not available from Netflix. I am also disappointed with the trial Prime subscription and will not continue after the trial period expires. Particularly dissapointing is the viewing cost of much of the material even on Prime.", "verified": true, "helpfulness": "0/0", "author": "Harry G Burger"}, {"rating": 5.0, "review": "Powerful little stick!!! I use when I travel and it works great with iPhone hotspot", "verified": true, "helpfulness": "1/1", "author": "David Brown"}, {"rating": 4.0, "review": "I love the Fire Stick!  I put it as four stars though since every couple of days, it seems to get \"stuck\" and you have to unplug it and basically reboot it, otherwise it just freezes.  Other than that though, its been great.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Eureka\""}, {"rating": 5.0, "review": "I orginally had some issue with my bandwidth so I upgraded my router and the Fire TV Stick worked like a charm. Lots of prime movies and series availble for everyone to watch. I can't wait till my Direct TV contract is up so I can save $$$.", "verified": true, "helpfulness": "0/0", "author": "Raymond Gregory"}, {"rating": 1.0, "review": "Netflix doesn't work and that's the only reason I bought it.", "verified": true, "helpfulness": "2/3", "author": "Hannah Neville"}, {"rating": 5.0, "review": "Simple and fast. Join Amazon prime then order your Fire TV Stick and it will come ready to go. Then enter your network key and BAM! your ready to watch your favorite movies and shows.", "verified": true, "helpfulness": "0/0", "author": "Shawn G Dostal"}, {"rating": 4.0, "review": "Cool device and works well for streaming. The only complaint I have is that I have to unplug it to reset it, after a a couple of hours of inactivity, it appears to \"go to sleep\" and can't be woken up with the remote.", "verified": true, "helpfulness": "0/0", "author": "Tj"}]