[{"rating": 3.0, "review": "**EDIT** In the interest of fairness and truth I must update my original review. Still experience connection drops and some sound/playback issues but the constant reboots seem to have been caused by a faulty USB outlet adapter. Once the outlet adapter was swapped out with a spare I had from an old phone the reboots stopped. Network connection, while still problematic is improved over my original experience and only occurs intermittently now. Will continue to troubleshoot my set up and see if there is anything I may be able to change on my end, but for now, the bulk of the issues I describe below seem to have been directly related to an unstable power source. ****Original Review****Was really excited to try this so ordered the first day it was available. Amazon services seem to be the only service that works well on here, Netflix, Hulu, Plex, all have freezing picture issues, stuttering sound and connection losses even though the TV the stick is connected to is sitting less than 5 feet from my wireless router. These issues occur constantly, occasionally within just a few seconds of the last instance forcing me to exit the application, restart it, resume my show only to have to do it again within a short period of time. The stick also randomly reboots in the middle of use and then gets stuck in a boot loop which it won't recover from until its disconnected from power and then plugged in again. Hopefully Amazon will get these problems resolved in a future release but I'm afraid the test subjects who bought the original are out of luck. Will be buying another Roku for this TV, thankfully I only paid $19 for this in its initial offering.", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 5.0, "review": "Very easy to install and set up and use.  I just love it!", "verified": true, "helpfulness": "0/0", "author": "Fred"}, {"rating": 5.0, "review": "Works great and the price was right. If they ever have another sale of them for $25.00 from either Best Buy or Staples I plan to purchase two more.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 3.0, "review": "Can't believe it didn't come with a HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "S. Hing \"picky buyer\""}, {"rating": 5.0, "review": "We already had the fire tv bix and git a deal on the stick. Sometimes it seems like the stick works even better then the box. The box tends to crash apps like hulu whereas the stick doesnt. I would buy more but don't have any more tvs.", "verified": true, "helpfulness": "0/0", "author": "Jeff C."}, {"rating": 3.0, "review": "It works, pretty well. My first foray into streaming TV & Movies. Minimal delays (I have good internet speed) and very good quality.I was disappointed that there was so many bad/B-movies in the free pile (with a few good movies mixed in), but all the good stuff is under the 'Pay-me-More' title, even the TV shows. It's kind of like when they give me 4 days of free pay channels (an enticement) on DirecTV and I spend 2 hours looking through the 4 days of the guide, only to find 90% of the movies are rated less than 20%. The ones that are rated higher, are a waste of time.Also, there seems to be no obvious upgraded subscription to Prime members to make more of it available. Where is Amazon's version of Hulu? Maybe some more digging will help me find what I expected.", "verified": true, "helpfulness": "0/0", "author": "fn-pauly"}, {"rating": 3.0, "review": "works, only held back by lack of content", "verified": true, "helpfulness": "0/0", "author": "Quiettune \"Bob\""}, {"rating": 5.0, "review": "Awesome!  I got this when if first came out and Amazon was offering it an intro price!  Wow!  I love it!  When I go on vacation I can bring it with me and watch my amazon tv on any television.  How cool is that?!", "verified": true, "helpfulness": "0/0", "author": "CJ"}, {"rating": 3.0, "review": "Easy set up, onscreen menu difficult. I use kindle fire to load my watch list - just seems quicker and easier. Downside - have to reboot every 3-4 hours of watching - had to do online search to find how to do.  Firestick will say \"connected with problems\" and stop streaming. Network check shows connection \"very good\"?", "verified": true, "helpfulness": "1/1", "author": "Neil Giconi"}, {"rating": 4.0, "review": "very satisfied, fast, logical set up with some problemstoo much information displayed on screen, which causes problems scanning the options if your eyesight is not 20/20if you know where you are going, it's greatif you are scanning for selections, the icons can appear too small to quickly understandstill I prefer the Fire TV stick over our recently purchased AppleTV that chooses to go a different direction in displaying information in a simpler format, but suffers from having to dig screen after screen to find items and has no \"home\" button to get back to a central screen.We will still use the AppleTV for its connectivity to our Apple products thru AirPlay, but eschew it for streaming, especially since getting Amazon streaming selections is not supported on it.", "verified": true, "helpfulness": "0/0", "author": "Eric"}]