[{"rating": 5.0, "review": "Works great....Amazon adding features is a plus!", "verified": true, "helpfulness": "0/0", "author": "Walter Rusciano"}, {"rating": 5.0, "review": "As described. Great.", "verified": true, "helpfulness": "0/0", "author": "MacDaddy \"rkny22\""}, {"rating": 2.0, "review": "Pretty disappointed in this product, especially being from Amazon! It's got a bad layout, lags and freezes a lot. It has a bad wifi connection and drops it a lot, even though no other device in my house has issues. Definitely wouldn't buy again!", "verified": true, "helpfulness": "0/0", "author": "Bryan H"}, {"rating": 5.0, "review": "Love It, so easy to use; I had a roku and this is much better ( my roku was a older model)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The service is great and I love the programs and apps it gives me, but the controller falls extremely short when navigating using the circular feature at the stop of the remote so often in everything I use it moves too fast and skips what I am after.", "verified": true, "helpfulness": "0/0", "author": "K. Kellum \"Lifesong\""}, {"rating": 5.0, "review": "Easy to connect and now I can watch whatever I want when I want.", "verified": true, "helpfulness": "0/0", "author": "Marsha"}, {"rating": 1.0, "review": "I bought this Amazon fire stick with much excitement, however, I have very quickly been disappointed with this product and amazons customer service. The device will not load nor stay connected to the wifi while this is the only decide connected at a home private network. Not really sure how this is supposed to work at a dorm or hotel setting.  I was on the phone with customer service for almost 40 minutes and the representative seemed lost and confused while my issue has still not been resolved. It will be sent back soon.", "verified": true, "helpfulness": "1/1", "author": "cindy caraway"}, {"rating": 5.0, "review": ":)", "verified": true, "helpfulness": "0/0", "author": "Jennifer Miller"}, {"rating": 5.0, "review": "This little thing makes it easy to watch something else besides tv.  I can play games or watch movies or old shows.  I would recommend this for everyone.", "verified": true, "helpfulness": "0/0", "author": "Jackie Huber"}, {"rating": 5.0, "review": "A lot better than I expected, got this as a gift for my dad and he's seeming to really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}]