[{"rating": 1.0, "review": "This has never arrived.  I can not say anything nice about THAT.", "verified": true, "helpfulness": "0/0", "author": "Northern latitude \"arthritic old woman\""}, {"rating": 5.0, "review": "I am pretty pleased with this little guy. The ability to search both prime and netflix at once is a huge plus for me. I use it mainly for Netflix, Plex, and Twitch. I also power it with the 5V usb output from my TV, even though it gave me a message that it wasn't ideal. Still works just fine. Own three of them, gave one to my father who is not that tech savy and after just a little while he was able to use it just fine and loves it.", "verified": true, "helpfulness": "0/0", "author": "Smashington"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Theresa"}, {"rating": 5.0, "review": "the Firestick is more than we ever expected! Works great with our Non-Smart older HD Flatscreens and with Smart TV's. Can toggle easily from regular cable to Netflix, Hulu, Amazon Prime Instant Video and all streaming icons.  Comes with its own easy to use remote. Made it a breeze for us to handle and also helped us be more in control of what we want to see. Bought two for our house here and got one for our place up north. The best!", "verified": true, "helpfulness": "0/0", "author": "Deanna M. Albert"}, {"rating": 3.0, "review": "Love the firestick, however every time I ise it I have to force stop, clear data and restart in order for there to be no cliches in playing.", "verified": true, "helpfulness": "0/0", "author": "Diane Rohnow"}, {"rating": 5.0, "review": "I can now watch Amazon Prime on my living room TV. I love it!", "verified": true, "helpfulness": "0/0", "author": "kathy pflug"}, {"rating": 5.0, "review": "Amazing!! Not sure why I didn't get sooner!! Love it!!", "verified": true, "helpfulness": "0/0", "author": "betty ortiz"}, {"rating": 3.0, "review": "Unlike the AppleTV...........FireTV Stick does not work Internationally.....My vote goes to AppleTV", "verified": true, "helpfulness": "2/2", "author": "MMavec"}, {"rating": 5.0, "review": "I got this product on sale before it's release for about twenty dollars and it was the best thing I ever bought. I had prime for over a year but it wasn't till I got the fire stick that I started watching the videos on my TV. It's super easy to plug in and use and I love it love it LOVE IT.  I recommend this product highly.", "verified": true, "helpfulness": "0/0", "author": "A Romance Junkie \"Mady\""}, {"rating": 2.0, "review": "I'm severely disappointed in this product.  I would have expected this product to be able to play my local files already being served by a DLNA server.  The only way you can do it is to buy a $5 app from them AND put yet another media server on my network.  Without this, this just duplicates the functionality of the TiVo that I already have.", "verified": true, "helpfulness": "0/0", "author": "Dave Doyle"}]