[{"rating": 4.0, "review": "Love this in my sons room. We but movies on amazon and he can watch them in his room.", "verified": true, "helpfulness": "0/0", "author": "Kathryn Harper"}, {"rating": 5.0, "review": "The coolest device I have bought in a long time!", "verified": true, "helpfulness": "0/0", "author": "FabianCordobaG"}, {"rating": 5.0, "review": "Simply put this is the easiest way to watch any thing from Amazon Instant Video or any internet streaming service like netflix, hulu, youtube, etc.The Amazon Fire TV Stick is fantastic.  I love this device.  It took my old 2008 dumb tv and made it a Genius TV (Yes that's better than smart TV).I am able to play (android) games from the amazon app store, watch over 40,000 programs with my amazon prime membership and so much more.One feature I really love about this is the screen saver.  I have uploaded thousands of photos to my amazon prime cloud photo storage account.  When the Fire TV stick is idle for a number of minutes the screen saver kicks in and it starts a photo screen saver from my cloud photos.With the ability to load apps from the amazon app store and watch any videos or TV shows offered by amazon this product is a must own for any amazon prime member or someone that would like to have a simple device to watch internet TV (hulu, netflix, youtube, etc)", "verified": true, "helpfulness": "0/0", "author": "Adam \"AdamB\""}, {"rating": 3.0, "review": "had quite a few problems with the sound and quality when we 1st purchased it, but after the multiple updates it is really working better", "verified": true, "helpfulness": "0/0", "author": "Logan's Run"}, {"rating": 1.0, "review": "THIS UNIT WORKED FOR JUST ABOUT A WEEK AND THEN BEGAN DOING AS IT PLEASED AND REFUSING TO FOLLOW MY INSTRUCTIONS.  IT PULLED UP SITES I ON YOU TUBE WOULD NEVER GO TO, WOULDN'T TURN OFF OR CHANGE CHANNELS.  OUR APPLE TV IS MUCH EASIER TO USE, DEPENDABLE, AND FOLLOWS INSTRUCTIONS.  I'M RETURNING IT AND DRIVING DIRECTLY TO THE APPLE STORE.  ONCE AGAIN I MUST DISCOVER \"CHEAPER IS NOT BETTER\"!", "verified": true, "helpfulness": "0/1", "author": "SASQUATCH"}, {"rating": 4.0, "review": "Happy with fire stick, lots of choices to pick from. Wish it had more streaming or live coverage for up to date news & weather though. In General , Happy with this product, lots of movies to chose from, and love the old original tv programs. Thank-You to whomever invented this technology. Very Nice!", "verified": true, "helpfulness": "0/0", "author": "Betty Nerren"}, {"rating": 5.0, "review": "Awesome product that suits my family's entertainment needs.  Leave it to Amazon to update devices for today's consumers.", "verified": true, "helpfulness": "0/0", "author": "alison wagner"}, {"rating": 5.0, "review": "It's great to no longer be tethered to the Kindle!!", "verified": true, "helpfulness": "0/0", "author": "Jerry B"}, {"rating": 5.0, "review": "I'm not very tech savvy, so I'll keep this brief.  I previously had GoogleTV, but it was the first version of it, so I needed to upgrade.  I was somewhat hesitant to purchase Amazon Fire TV Stick because of the price -- was wondering if it was too good to be true, however I love it!  I've had it a couple of weeks and have had no issues with Netflix or Amazon Prime.  I love being able to transfer it among TVs within my house and it was super easy to setup.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 5.0, "review": "Bought for my Daughters room and she absolutely love this. I have the Fire TV puck in the front room along with Neflix and I prefer the Amazon unit - especially the voice commands. This little device saves you a lot of money if you have a TV with HDMI but not a smart TV or smart DVD player. The only issue is the need to plug into an outlet - has a long enough cable (with extension) but there is the issue of having another cable hanging out.", "verified": true, "helpfulness": "0/0", "author": "TooClean"}]