[{"rating": 5.0, "review": "Love it, way better than our chromecast, we dont need the phone or ipad", "verified": true, "helpfulness": "0/0", "author": "JCB \"John C Baldelli\""}, {"rating": 5.0, "review": "Bought it for my sister.  She loves it.  It works great..better than her Chrome stick", "verified": true, "helpfulness": "0/0", "author": "Dr A J D"}, {"rating": 1.0, "review": "Cannot keep this working. Always have to adjust. It has been a huge disappointment", "verified": true, "helpfulness": "0/0", "author": "N. Gray"}, {"rating": 4.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Customer"}, {"rating": 1.0, "review": "Slips and lags a lot..I'll be in the middle of watching a show and it will completely go back to the main menu..not that happy", "verified": true, "helpfulness": "0/0", "author": "Robyn S Morrison"}, {"rating": 5.0, "review": "Only complaint so far was the lack of a good dlna streaming player. Vimu caused my movies to skip. I had to sideload an app to watch them. I really feel this is a better way for my content. The chromecast is good but lacks the internal app use...", "verified": true, "helpfulness": "0/0", "author": "toml"}, {"rating": 5.0, "review": "Great device.  My only complaint is the size of the remote.  It is really easy to lose!Great for Netflix and Amazon Instant Video.  This is a must have for any prime subscriber.", "verified": true, "helpfulness": "0/0", "author": "gotaholen1"}, {"rating": 5.0, "review": "Once I figured out how to use it, I really am enjoying it.  One problem though.  The night I tried to install it, it wouldn't work and so I called the help line.  I could barely understand the guy who answered and he couldn't understand me to well and he told me I had to be clearer.  I got very frustrated and gave up.  A week later I figured it out by myself.  It has been great as I am really sick of cable.", "verified": true, "helpfulness": "0/0", "author": "Karla Hamilton"}]