[{"rating": 5.0, "review": "easy to navigate!", "verified": true, "helpfulness": "0/0", "author": "Steve K"}, {"rating": 5.0, "review": "This is my second Fire Stick, so it just goes to say that I am happy with this product. I also don't seem to have to reset my WiFi connection as often with the newer Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Jennie L. Kilby"}, {"rating": 5.0, "review": "Would definitely buy again.", "verified": true, "helpfulness": "0/0", "author": "DonnaMarie"}, {"rating": 5.0, "review": "Works perfect! Amazon does it again. Design is better than Roku...", "verified": true, "helpfulness": "0/0", "author": "Weston Crockett"}, {"rating": 5.0, "review": "Nice little machine. Plug in and away it goes. Will be ordering more for my other tv's in the future.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 3.0, "review": "I purhcased this for the Sling TV app which my TV does not have.  It works well but needs a sleep button on the remote.  To put the unit to sleep you have to go through a menu of selections which is not quick or convenient.  Failing to put it to sleep will cause the unit to continue to use bandwidth with many apps  including Pandora.  The auto-off on the TV does NOT turn off the amazon streaming.  So when I fall asleep at night the music is still streaming in the morning for a tremendous waste of bandwidth.  Put SLEEP on the remote!", "verified": true, "helpfulness": "0/0", "author": "Iceman"}, {"rating": 5.0, "review": "Liking it so far. Still customizing the settings but nice to have the added channels and movies with my Analog TV.", "verified": true, "helpfulness": "0/0", "author": "darkthorn"}, {"rating": 3.0, "review": "I bought this thinking I could use it instead of my PS3 for our video streaming.  It kinda serves it's purpose, most of the time, but far too often we would find ourselves switching back to the PS3 to watch videos because the stick would lose connection or have streaming issues.  Now days we just use the PS3, saves us the hassle of having to switch back.The stick is fine, I got it on sale so I won't complain too much, but there are tons of better options for your streaming needs, including the Roku stick (or any of the Roku family).", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "This is a must have for people wanting KODI installed. It out performs the android g-boxes and has a ton of apps that really open options up that can be sideloaded to it. It's snappy and responsive and has a clean interface. The remote feels solid and works great from the couch. Highly, Highly recommend!! Will be buying the Fire TV box next.", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 5.0, "review": "I love the fire stick so much, I bought a second one.  I may even buy more for the house and possibly as gifts.  If it only picked up my local channels I'd probably ditch the cable company entirely.", "verified": true, "helpfulness": "0/0", "author": "sharon burton"}]