[{"rating": 5.0, "review": "A terrific buy, got it for the kitchen since we have a roku player on the main TV. This works great. We can pick our favorite show or movie fromAmazon Prime, Netflix or play music with Pandora. We use the kindle app as a remote so that we can use voice commands. Works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Tom C. 2013 \"Tom C.\""}, {"rating": 3.0, "review": "My Fire Stick cuts out randomly and freezes up. I'd like to replace it but, now it's out of stock.", "verified": true, "helpfulness": "0/0", "author": "TeeShot"}, {"rating": 5.0, "review": "Great tool.  Very easy to use.  Remote is very sensitive even though the stick is at the back of tv", "verified": true, "helpfulness": "0/0", "author": "Quan Chen"}, {"rating": 5.0, "review": "Still getting to know the device but at this point we love it. easy to use, install and navigate. now if only they would allow HBO go to be one of the apps we can use.....", "verified": true, "helpfulness": "0/0", "author": "A. W. Manuel \"Mommy of 1\""}, {"rating": 4.0, "review": "So far, it's working out fine.", "verified": true, "helpfulness": "0/0", "author": "Philly"}, {"rating": 5.0, "review": "just right...easy to use...super cool! 5 stars.", "verified": true, "helpfulness": "0/0", "author": "kim young"}, {"rating": 2.0, "review": "This was half price and works about half the time. It has issues staying connected where as my roku and chromecast work fine. I'll probably just throw it away and get another roku.", "verified": true, "helpfulness": "1/2", "author": "John Kuchera"}, {"rating": 4.0, "review": "most of the time it eliminates delays in streaming", "verified": true, "helpfulness": "0/0", "author": "MM"}, {"rating": 4.0, "review": "We had a Chromecast until it broke. So when I saw the promotion for the Fire TV stick I pre-ordered it for $19. It originally appeared that Amazon was going to ship it in late November. We didn't get it until December 19th.  In the day or so we have had it I must say it we are thoroughly impressed. This widget has much more content versatility and reliability than the Chromecast. Taking into account the great discounted price I would give it 5 stars. However having to wait almost 2 months to receive it drops it down to 4 stars.", "verified": true, "helpfulness": "0/0", "author": "King Faraday"}, {"rating": 5.0, "review": "I just got it delivers Xmas gift for myself...excited to start watching movies!", "verified": true, "helpfulness": "0/0", "author": "Matt"}]