[{"rating": 4.0, "review": "Great! It would be much wonderful if you get this less than 39.9 dollars.", "verified": true, "helpfulness": "0/1", "author": "SU MIN MIN"}, {"rating": 4.0, "review": "Super fast, excellent device only thing I do not like is that you have to plug the USB into a wall power supply.", "verified": true, "helpfulness": "0/0", "author": "Blah"}, {"rating": 5.0, "review": "Excellent, working perfect.", "verified": false, "helpfulness": "0/0", "author": "K.william \"K.william\""}, {"rating": 5.0, "review": "simple interface, low power consumption and an rf based remote! No complaints at all.", "verified": true, "helpfulness": "0/0", "author": "Steve \"Steve\""}, {"rating": 4.0, "review": "Very simple tool if you like to do all things Amazon (like watch your Prime stuff). I give it four stars for ease of use.  However, I have to take one star away for not being able to \"fling\" online content  from my laptop to the TV via the stick.  Since for example the Arte.tv app on the stick is not working, I wanted to stream from laptop to TV without having to occupy another HDMI slot (I only have three and they are all used).  This is disappointing. Apparently this is possible with the Chromecast.  Hopefully Amazon will fix this soon which will make the stick a major contender vs the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Sommersprosse"}, {"rating": 1.0, "review": "Do not waste your money. I bought this because I was trying to decide between fire tv and a roku, I finally chose this one when I got the pre-order email. It seemed pretty cool at first but anytime I try to watch a movie I get the spinning circle to let me know it's loading. But it doesn't actually seem to load because I get this all through the movie. It's constantly dropping connection, this is the only item in the house that drops signal this often. It's a good thing it was only $20, otherwise I would be really mad.Again I can not emphasize enough, do not waste your money.", "verified": true, "helpfulness": "0/1", "author": "Antonio Rodriguez"}, {"rating": 1.0, "review": "I should send this back to Amazon.  I still have not been able to open the remote to install the batteries, so how could I be able to see how \"well\" it works.  I'm furious that the engineers made something so awful.", "verified": true, "helpfulness": "1/3", "author": "Jean G. Weidner"}, {"rating": 5.0, "review": "I got the fire tv stick during the limited $19.99 promotion and it was a great decision! I cancelled my cable service a few months ago and switched entirely to my roku 2. It ran smoothly but the picture quality was always poor. Didn't think the fire tv stick would be much different but I was entirely wrong! First, the setup and interface is awesome and way better than the Roku. Amazon prime and Netflix stream in HD and the quality is superior. Also, the stick saves counter space and has less wires- a plus. Second, you can stream Dpotify from your devices with the Spotify app, so no need to go into the tv app version to play a song (like Roku). Also, for$2.99 I got the AirPlay app and you can AirPlay everything just like the Apple TV!! I love this device- works great and it is a million miles away from Roku. Love.", "verified": true, "helpfulness": "0/0", "author": "Ivet Taneva"}, {"rating": 4.0, "review": "The Fire Stick is a great device. The steaming quality is fantastic and integration with amazon video/music is great.If you regularly steam video online using amazon video, then this the device for you! The one major problem I have with this device is that there is no way to control the volume from either the app or the remote. There is also no integration with Google movies/music but that should be expected as the Chromecast does not have amazon video/music either.Pros:-Good streaming quality-Amazon app integration-Amazon prime video/music-Netflix-Remote-Easy to useCons:-No Google movies/music-No volume control-Requires Amazon Prime membership to be goodOverall: I prefer it to Chromecast as the controller is very easy to use and more convenient than my phone but the lack of volume control is a real bother as I must use the TV remote to change it since music/movies have different base volumes which is really annoying. The voice search via the phone app is great but I don't use it often. Lots of potential.", "verified": true, "helpfulness": "1/1", "author": "Peter M"}, {"rating": 4.0, "review": "Good but very few free movies!!The fire stick is great but I was so disappointed at how few movies were free. I actually watch net flex more and so the fire stick isn't really used.", "verified": true, "helpfulness": "0/0", "author": "Janet Trout"}]