[{"rating": 5.0, "review": "Excellent product.....", "verified": true, "helpfulness": "0/0", "author": "jose Carlos sousa"}, {"rating": 5.0, "review": "AMAZING!!!!!!! I joined the human race and got Netflix, which acquiring this stick, has allowed. It was fairly easy to assemble to the TV and by that, I mean I had someone else do it.", "verified": true, "helpfulness": "0/0", "author": "Peace, Love and Sandy Feet."}, {"rating": 5.0, "review": "Love this, my son and family bought it for me for Mother's Day. Have Netflix and HBO Go and have already watched more movies then I usually would.", "verified": true, "helpfulness": "0/0", "author": "Mary J Lowe"}, {"rating": 5.0, "review": "Bought this as a gift and I received rave reviews about all the features and having bought it for the $5 off price made it even nicer; and let's not forget the benefits of being a prime member (which the person I bought it for is too), 2 day shipping but streaming 2,000 or more movies. Buy this or the Fire TV (which I own). Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Sundance"}, {"rating": 5.0, "review": "LOVE IT & IT'S EASE OF USE!", "verified": true, "helpfulness": "0/0", "author": "C T BLAIR"}, {"rating": 5.0, "review": "LOVE it! Easy to install and simple to use. I like that there's a phone app for control, including voice activation.I was a little sad to learn that while my Fire Stick was in shipment, the price dropped....but I still love the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"music lover\""}, {"rating": 5.0, "review": "i really enjoy the fire TV stick! As soon as I connected the device a video popped up showing me how to use it and my options to have a free prime trial. I also was able to connect it to my Netflix and pandora accounts. It's totally worth the money. The only thing I advise to consider before you purchase this product is to make sure you have a good wifi connection and that you are not sharing it with a lot of people (as in free wifi at an hotel or something) because it could slow it down. If im out of town I turn the hotspot on my phone. I really enjoy this device and it is so small! It's easy to hide the one cord and so easy to set up! I'm very very pleased with my purchase!", "verified": true, "helpfulness": "0/0", "author": "Lauren Hicks"}, {"rating": 5.0, "review": "Love it.  So easy to use", "verified": true, "helpfulness": "0/0", "author": "Kathleen P. Boucher"}, {"rating": 5.0, "review": "Works great I love it!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Brenner"}, {"rating": 5.0, "review": "it is as good as I expected and will recommend to others", "verified": true, "helpfulness": "0/0", "author": "Sharon McCombs"}]