[{"rating": 5.0, "review": "My family and I absolutely love this! Would highly recommend. Easy to install/easy to use!", "verified": true, "helpfulness": "0/0", "author": "eserd"}, {"rating": 5.0, "review": "Pretty cool", "verified": true, "helpfulness": "0/0", "author": "Joseph Graf"}, {"rating": 4.0, "review": "Product as stated. I only wish they had Pandora as an app.", "verified": true, "helpfulness": "0/0", "author": "osuchic"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jane S"}, {"rating": 5.0, "review": "Fire stick is great. Easy to program and set up and now I can watch Netflix and others on my television.", "verified": true, "helpfulness": "0/0", "author": "cyclingdoc"}, {"rating": 5.0, "review": "I have a Roku 3 on my bedroom television and considered buying a Roku stick for the living room.  I read some reviews on the Roku stick and there seemed to be some issues of dropping wifi and the remote not connecting.  This didn't sound promising so I looked at the Fire TV stick and thought it would pair well with my Prime account and ordered it.I'll start by saying that for a $39 device the packaging was really quite impressive.  The installation instructions were clear and five minutes later I had everything set up.  There's a brief video that walks you through the controls - nice - and then I was ready to explore the content.I installed MLB.TV, signed into my account and ran the app.  Video stream was smooth without buffering.  The interface is clean and easy to navigate and is very responsive to the remote.  So far I haven't had any issues with the wifi dropping or buffering when viewing Prime content.In short, it works extremely well and is a quality device.  For the price it's a bargain.  It doesn't offer the range of content of a Roku - most of which I don't utilize - but if you have a Prime account this is a great way to take full advantage of Prime Video.", "verified": true, "helpfulness": "0/0", "author": "Neecy G."}, {"rating": 5.0, "review": "I love my new fire stick! I am going to order one for every room!", "verified": true, "helpfulness": "0/0", "author": "sandra kilpatrick"}, {"rating": 3.0, "review": "So far I have only used it to access my subscription to Sling TV.  For that purpose, it works just fine.  Most other channels available are duplicates of what I can access through my wi-fi enabled Blu-Ray player.  Since I don't play games or listen to radio with my TV, I probably will not use it for more that Sling TV.  Besides, most movies that I might want to watch are either not available or have a rental fee attached.  I can rent DVD's locally for less that the streaming rental fees.", "verified": true, "helpfulness": "0/0", "author": "L. B. Falgiani"}, {"rating": 2.0, "review": "It freezes up on me. Have to unplug and start it again.  This happen a lot", "verified": true, "helpfulness": "0/0", "author": "linda"}, {"rating": 5.0, "review": "Had no idea how EASY this would be for such a technologically challenged person as myself...amazing little piece of equipment!! I feel very good about my purchase and would recommend it highly!!!", "verified": true, "helpfulness": "0/0", "author": "DebbieMcK"}]