[{"rating": 2.0, "review": "The device would be exponentially better if they improved the wifi connectability. It seems that if the fire stick is not within a 5 foot proximity to a router, it will drop connection intermediatly. I would also make the recommendation of better organizing the user interface. The app selections of the fire stick are what makes the device. I just wish the apps could be organized more like a Roku or AppleTv. The Prime and PPV selections are a mess. Tighten it up!With all of that said, the device really has potential and the price point is great.", "verified": true, "helpfulness": "0/0", "author": "Zach Foshee"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "neana"}, {"rating": 5.0, "review": "works great  ..", "verified": true, "helpfulness": "0/0", "author": "Gregory M Sullivan"}, {"rating": 2.0, "review": "I received my firetvstick and I can't get it to do anything.", "verified": true, "helpfulness": "0/1", "author": "tony lynn sims"}, {"rating": 4.0, "review": "This is a good device. Some of the apps you download for it still have some kinks that can be somewhat frustrating at times. And the volume is never constant. Other than that it works very well.", "verified": false, "helpfulness": "0/0", "author": "Lashawn Brain"}, {"rating": 5.0, "review": "Great product for price and easy to use. Amazon Prime has is getting a competitive selection compared with Netflix although I like the combination of subscribing to both.", "verified": true, "helpfulness": "0/0", "author": "Dorothy Donoghue"}, {"rating": 5.0, "review": "After about four years of paying for Amazon Prime, I only used it for shipping.  It is to bad I did not read all of what Prime was giving our household.  Now that we have an Amazon Fire Stick, my whole family is enjoying it's programing.  Kudos to Amazon for their programming.By the way, The Fire Stick works perfectly.", "verified": true, "helpfulness": "0/0", "author": "David F"}, {"rating": 5.0, "review": "I can't believe I didn't buy this sooner!!!", "verified": true, "helpfulness": "0/0", "author": "Kimi Gomez"}, {"rating": 5.0, "review": "I like it more than cable!", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 1.0, "review": "Its simple for me. The only thing this stick has that I use is Netflix. I needed it to also have Vudu and YouTube but nope. So for me, the stick is pretty useless.", "verified": false, "helpfulness": "0/2", "author": "jody"}]