[{"rating": 4.0, "review": "Bought this to access shows from my Prime account. Product works great but free Prime shows are few and far between. Very disappointed in free selection. Most titles are are sale.", "verified": true, "helpfulness": "0/1", "author": "Lynn"}, {"rating": 1.0, "review": "I don't tend to write too many reviews, I do them when either I really like a product or really upset with a product or the service behind it.Lets face it, there are many streaming devices out there with very similar capabilities but this little guy held an interesting promise that other devices didn't promise - Miracast the ability to stream/duplicate your device screen on the TV. Very cool feature and as such its being advertised.Tried it out, it doesn't work with any of the windows devices. Looking on the web, searching twitter it seems I am not the only one who expected to get it and never did.Amazon advertisement is misleading - just don't buy this if this feature is important to you.Beyond that, tried the device on two TV's with only half success- I guess this is also a standard issue? 😉", "verified": true, "helpfulness": "2/2", "author": "Bird \"Not sure what I was thinking\""}, {"rating": 5.0, "review": "I enjoy how many things are on the fire sick. Easy to use. I like how my stuff was programmed on to it already.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"audioagirl\""}, {"rating": 4.0, "review": "This product is well worth the money paid for it .", "verified": true, "helpfulness": "0/0", "author": "RJ"}, {"rating": 5.0, "review": "We are really enjoying the Amazon Fire TV stick. Included a video to show what to expect when you receive the producthttps://www.youtube.com/watch?v=7G3bbz5C_mk", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Easy to use.  Lots of choices.  I have Amazon Prime and Netflix accounts and the Fire Stick recognizes both accounts giving us more choices of what we can watch for free.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Larry Klutzke"}, {"rating": 2.0, "review": "It's fine if you only want Amazon Prime TV to work. Netflix and Hulu both have serious issues with buffering and freezing.", "verified": false, "helpfulness": "0/0", "author": "JUSTIN COLE"}, {"rating": 2.0, "review": "I was hoping that this would eliminate using one my my Blu-Ray Players for streaming, but that will not be the case.To start, the UBS \"power cable\" is rather short and required the use of and extension cord. Not a big deal, but short sighted on the developers. Also the 90 degree angle on the power plug that the UBS cable goes into would mean that plugging it into a surge protector would require it to be plugged into the bottom spot or it would take up two spots. Again, not a big deal, but short sighted on the the developers. Once hooked up the setup was easy which was nice. After that, things went down hill. After downloading the Netflix app and getting that up and running the video quality is rather poor. Within a five minute span, it can go from great quality to bad to OK and then back to great to OK and then bad again in no particular order. This happens continuously... never ending. Annoying when trying to watch a movie. Has nothing to do with my internet or wireless network as other wireless streaming devices (four of them) do not have this issue. Thinking this might have something to do with Netflix, I tried Amazon Prime Video and had the same results.The Stick also lags from buttons pressed on the remote. You can push a button and nothing happens to you push it again and again and again.... then the Stick responds to each button press scrolling past what you were actually wanted to select. Dumb.I was hoping to recommend this to people new to online streaming, but I defiantly will NOT be. This would be a horrible first experience in streaming due to the video quality. This would defiantly turn new people off from streaming video.Maybe things will improve with time, but who knows. Until it does, the ONLY THING I would use this for would be taking with on trips and still being able to watch streaming TV at places that have WiFi. Even then, I might not take the time to hook it up.I purchased it for $20. If I paid full price, it would be getting returned immediately.*If things get better I will update my review*", "verified": true, "helpfulness": "0/0", "author": "EB"}, {"rating": 5.0, "review": "I ordered two of these during the pre-sale event and I am glad I did! I LOVE LOVE LOVE them! I purchased it mainly to watch Netflix. We have been using a Wii for years and it was a pain with slow response time and a lot of freezing. The Fire TV Stick has not frozen once and the response time is immediate. Streaming videos on Netflix and other apps on the device do not take a long time to load. Most items only take about half a second. .Pairing is awesome! I love that I can be watching a video on YouTube on another device and then switch to TV without having to search for the video. The only drawback is that the YouTube app loads kind of slow. Even with the slower load time, it's really nice, for me, when watching recipe or how to videos to be able to see it on a bigger screen instantly.The overall interface could use a little improvement. For the way that I use it, it doesn't flow well, but I still give the device 5 stars. Since I bought it during pre-sale, I think it is an awesome buy for the money. At full price, I am not sure since their are other devices that can do similar things and more. However, for a user just wanting to watch TV on Demand, Netflix, Hulu and such, this is perfect with it's features.", "verified": true, "helpfulness": "0/0", "author": "Marcina"}, {"rating": 5.0, "review": "What a GREAT product! Purchased this for when I traveled and used a wifi hotspot instead of my home wifi. I provided the hotspot provider the wifi MAC address of the Fire stick and I was in watching in minutes. Picture and sound are great, remote easy to use with very fast response from both the remote and the Fire Stick. Could not be happier.", "verified": true, "helpfulness": "0/0", "author": "E. Coleman"}]