[{"rating": 5.0, "review": "Wish I would have found this sooner!", "verified": true, "helpfulness": "0/0", "author": "Lisa G Johnson"}, {"rating": 5.0, "review": "It works great I love. It!", "verified": true, "helpfulness": "0/0", "author": "Janet"}, {"rating": 4.0, "review": "Good buy. I would recommend this item.", "verified": true, "helpfulness": "0/0", "author": "CT"}, {"rating": 4.0, "review": "It works very well, and the remote control is very well designed and useful.  Netflix works very well on it.However, I don't like it as much as the Chromecast because there are many smartphone apps that work well with the Chromecast.  The only things you can really do with your smartphone on the Fire Stick is mirroring (which is displaying your cell phone screen onto a TV), and remote control.  However, mirroring does not work as well as I would like.As a stand alone item, the Fire Stick is great, because you can download games/apps directly onto it and use them from it.  But if it were easier to pair with a smartphone and use applications from there, I would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "A. Nasri"}, {"rating": 3.0, "review": "The Amazon Fire TV Stick is pretty awesome. It has a fluid design, kind of like Roku 2 but way smoother. Reminds me of using my friends PS4's Netflix app in a way. One thing that I do find very annoying and wish that Amazon will remedy with a future update is the parental and purchase lock code you can set in place. When you choose to have a code required for purchase and viewing restrictions it applies to all titles. Meaning anything you select to watch or download will require a pass code. It becomes very tedious, and is something that could be easily fixed. I wish they would have the same options as they do when you register a console, select what content is appropriate to watch and restrict purchases on your Amazon account. I have a child, and bought this device primarily to be used by the whole family in our living room.", "verified": true, "helpfulness": "0/0", "author": "Scareycrow"}, {"rating": 5.0, "review": "Fire stick is great, but there are not enough good movies on Prime.", "verified": true, "helpfulness": "0/0", "author": "Patricia Wofford"}, {"rating": 5.0, "review": "I purchased this for my daughter's playroom.  My husband and I have the Fire TV for our use.  While this does tend to be a tad slower than the fire TV it still works great and we haven't had any issues with it.  We have had it for over 2 months now.", "verified": true, "helpfulness": "0/0", "author": "K. Bryant"}, {"rating": 5.0, "review": "Great, easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Bochski"}, {"rating": 5.0, "review": "I have nothing but good things to say about the Fire TV Stick! I cannot compare it to the Fire TV, because I've only used these... but I have two now, and I use them 1) on an older tv that is not a smart tv and 2) on a newer tv that I purposefully bought as a non-smart tv because I knew I'd be using a Fire TV Stick with it. My daughter benefits from this device every day and night. She watches all of her favorite cartoons thanks to the availability of Netflix and even a little Amazon Prime Video! It comes with Amazon Prime for a certain amount of time included, can't remember how much. I've always been a prime member, and this device was no exception to my satisfaction with Amazon and its own line of products! Thanks, Amazon! Keep up the good work!", "verified": true, "helpfulness": "0/0", "author": "Joshua Storme King"}, {"rating": 5.0, "review": "This thing is awesome at an awesome price! My kids love it!", "verified": true, "helpfulness": "0/0", "author": "Brett McCollum"}]