[{"rating": 2.0, "review": "Unhappy Prime Day Sold out before I even had a chance. Not too cool Amazon", "verified": false, "helpfulness": "2/6", "author": "M. Arends \"Mayhem\""}, {"rating": 5.0, "review": "This is really a 4.5 star review.Pros:- Broadcasts in HD-Allows sideloading-Comes with a lot of appsCons:- Interface isn't super user friendly- Sideloaded apps don't come up in the\"home\" \"recently used\" apps section.- Could use a stronger processor.Overall this is a phenomenal stick and will do 95% of things wonderfully. Looking back I wish I had paid a little more for the Amazon Fire TV so I could plug it directly into a router.", "verified": true, "helpfulness": "0/0", "author": "Matt G"}, {"rating": 1.0, "review": "Com'on Amazon. Very disappointed.", "verified": false, "helpfulness": "2/7", "author": "D. Carey"}, {"rating": 4.0, "review": "The amazon fire stick is great! Easy to install to support the use of wireless Internet.", "verified": true, "helpfulness": "0/0", "author": "Troy A. Thibodeau"}, {"rating": 4.0, "review": "Works excellent and very user friendly. Easy to connect and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Transforming Lives, LLC"}, {"rating": 1.0, "review": "So this item was on the lighting deal for $24, as soon as I woke up and took my daughter to her swimming class early in the morning it was fulfilled. However it was on the wait list that I could join.  I tried too join the wait list on my fire phone and on my desktop since both said it was available to join the wait list,  and the button would reset not showing anything other than the wait button would appear again to join.  I called to see if their was something wrong with the website and I was told it was fulfilled on their selling quota and the wait list was full too.  I reiterated that, both my fire phone and desktop said it was available for the wait list. They just said sorry,  bye can't help.  S**** promotion for prime members when they can't get the deals that are offered because it is limited, might as well just not do it. Some of us have responsibilities other than to be first in line to get a deal,  that's why we joined prime to get the deal without the chance of not getting it.", "verified": false, "helpfulness": "3/8", "author": "David Roman-Nichols"}, {"rating": 1.0, "review": "This is the biggest failure on Prime day that will leave a bad test in mouth!", "verified": false, "helpfulness": "4/11", "author": "T. PANDYA"}, {"rating": 4.0, "review": "We use it all the time and we really like it. However, keep in mind that the firestick only works as well as your wireless internet connection. We live in a rural area and have really crappy internet; thus anytime we try to watch anything, the connection is constantly interrupted. But this isn't Amazon's fault, and it really is a brilliant product.", "verified": true, "helpfulness": "0/0", "author": "KCFAM"}, {"rating": 3.0, "review": "It's alright, but I think I prefer Chromecast more. The twitch interface on the fire stick is really boring, I can't even watch the streamers I'm following. Plus this stick won't connect to my 5ghz wifi.", "verified": true, "helpfulness": "0/0", "author": "Joey"}, {"rating": 2.0, "review": "I really wanted to love the Fire TV Stick -- great price point, there are options for downloading a number of apps (free and paid), easy to use and install -- for those reasons, I give this more than one star.  The issue I have is that even though I have a TV with HDMI ports, a fast WiFi connection, HD, etc. we cannot watch any videos, movies, etc. from Amazon Prime, Netflix, HBO Go, etc.  I can only get the audio while a blue screen shows an HDCP error message (but the ads and commercials come in just fine).  From what I've read online (not through Amazon), this is an issue because our TV is not new enough.  Total bummer.", "verified": true, "helpfulness": "0/1", "author": "ColieCO"}]