[{"rating": 5.0, "review": "The fire stick works well.  I prefer the Apple TV but at 1/4 the price the fire stick has the majority of the function at a fraction of the price.", "verified": true, "helpfulness": "0/0", "author": "ryan kitchel"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Thomas M. Ward \"Tom ward\""}, {"rating": 5.0, "review": "Works Great! Can't beat the price :)", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 3.0, "review": "The Fire Stick is great for watching Netflix on my TV. The reason why I gave it 3-stars is because it shuts off occasionally due to \"weak router signal.\"  Don't know what this is about since I use my laptop in same area with no problem.", "verified": true, "helpfulness": "0/0", "author": "Robert Schuppert"}, {"rating": 4.0, "review": "For  whatever  reason ,  the  streaming  DVD  players  I  got  always  seemed  unable  to  get  AMZN  vids  working  so  I  ended up  just  watching  them  on  my  computer .I  should  note  tho ,  that  I  got  dad  a  smaller  smart  panel  for  his  nursing  home  room  &  AMZN  vids  did  work  on  the  smart  panel .The  stick  was  a  2  minute  setup  and  I  was  then  into  the  videos  immediately  on  my  bigger  flat  panel .I  am  now  just  hoping  to  take  it  with  me  when  I  travel  given  it's  petite  size .Hopefully  the  stick  retains  all  the  registration  info  when  plugging  into  a  monitor  elsewhere .THANK-YOU  AMZN  !Wish  I  could  afford  your  stock  .  .  .PS Note :  this  is  Not  actually  a  TV  device  as  it  does  not  get  any  broadcast  television .  The  videos  are  all  from  a  library  built  by  Amazon  which  does  include  previously  aired  TV  shows  that  have  been  licensed  to  Amazon .I  post  this  because  when  showing  a  neighbor  something  from  Downton Abbey ,  their  questions  suggested  they  thought  the  stick  picked  up  TV  channels  ( since  it's  be  called  a  TV  stick ) .Maybe  a  correct  label  would  be  \" Fire  Video Stick \" .", "verified": true, "helpfulness": "0/0", "author": "knobe"}, {"rating": 1.0, "review": "It required three phone calls to get it registered and then after working for a week it quit entirely.  Just a black screen.", "verified": true, "helpfulness": "0/0", "author": "Gail A. Walkley"}, {"rating": 5.0, "review": "Turn your TV into a \"smart TV\",...unbelievable low cost, exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "Norma Wright"}, {"rating": 2.0, "review": "We bought this on the promotion they had for Prime members and excitedly waited for it's arrival at the end of December. We we so happy to not be using the glitchy and difficult apps of our smart TV and we really like it at first. We also have a Roku 3 and had been using it for several months prior to purchasing this. So we placed on the TV right next to the wireless router, plenty of signal strength. So immediately we had issues with using the remote to browse, sometimes after the third or fourth time you hit the next button while slowly going through the list of movies it would spaz out and jump 5-10 movies and you'd have to backtrack and then I started noticing the remote would just stop working and the only way to fix the problem was a hard reset, then we started having slow loading issues and freezing on just HBO Go then it started on Hulu and then it even started happening on Netflix, the audio would keep time and the video would freeze and then the video would speed through to catch up to the audio. We thought maybe it was slow internet, but going to the back bedroom, the furthest from the router, and using the Roku 3 we had no issues what-so-ever. So then we thought maybe it was the crappy tv, so we swapped out the Roku 3 to the same tv and it ran smoothly on every single app. That same day I ordered a Roku 3 and replaced it in the living room and gave my mom my Fire stick and I won't be recommending it to anyone.Overall: this works, it has glitches, but it works and I only wasted $19 on it so oh well. It may have just been mine, but I'm done with it and loving my Roku 3", "verified": true, "helpfulness": "0/0", "author": "Cbgb1404"}, {"rating": 4.0, "review": "Can't believe all the options available, continuing to explore great value with Prime.  Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 5.0, "review": "This is the best.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Domenech"}]