[{"rating": 5.0, "review": "Wonderful - easy to install and ready for use in just a few minutes.", "verified": true, "helpfulness": "0/0", "author": "cynthia j andrewsc"}, {"rating": 4.0, "review": "I bought this to use while traveling and at home for a HDTV that does not have a cable box attached.  The picture quality on the HDTV is amazing, much better than when simply going through the cable signal alone.  It does what I wanted, which is to allow us to watch Amazon Prime and Netflix on any TV in the house.  The only reason I gave it 5 stars is that if the wifi signal is not strong, the stick doesn't work well and spends a lot of time buffering.  I had to use a wifi extender to get it to work consistently in all areas of our home and it wouldn't work on the second floor of the house we rented at the beach, despite the fact that we seemed to have a fairly decent signal on our phones and tablets in the same location.  Despite the issues with the wifi signal, I like it enough to buy a second one for the house.  I was hoping to get the second one on Prime Day, but I won't rehash that ordeal here.", "verified": true, "helpfulness": "0/0", "author": "beachwife \"bearswife\""}, {"rating": 1.0, "review": "Hard to navigate. Prime movies have to be rented. Will be giving it back.", "verified": true, "helpfulness": "0/1", "author": "Butler Tyler"}, {"rating": 5.0, "review": "So far it's a great source of entertainment. Easy to install and to navigate through the menus. I may just cancel my TV service.", "verified": true, "helpfulness": "0/0", "author": "Splinter"}, {"rating": 1.0, "review": "It flickers a lot", "verified": true, "helpfulness": "1/1", "author": "randy merrell"}, {"rating": 5.0, "review": "very nice its very fast, i like that you could use your cell phone as a remote control and iteven has voice search.", "verified": true, "helpfulness": "0/0", "author": "D. Rojas"}, {"rating": 5.0, "review": "Great product. But you can only access prime movies if you live in the USA. Unfortunately, I was not aware of this restriction.", "verified": true, "helpfulness": "0/0", "author": "SHAKA NKHOSI"}, {"rating": 1.0, "review": "This Item was miss read and a mistake ,  But Great for someone who wants to buyAnd Rent Movies", "verified": true, "helpfulness": "0/1", "author": "Carlos"}, {"rating": 5.0, "review": "I love this so glad I looked into this. Its great!!!#", "verified": true, "helpfulness": "0/0", "author": "patti jessen"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Osliris Barrios"}]