[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "grateful"}, {"rating": 4.0, "review": "works very well.  the remote control is a plus....", "verified": true, "helpfulness": "0/0", "author": "Ron Mestdagh"}, {"rating": 2.0, "review": "I love the concept of this, but I think I should have just bought the Amazon TV. There is constant buffering. I don't have this issue with my Apple TV. I hardly use it because it challenging to watch a show with intermittent buffering. I know now that the HDMI sticks just aren't as good quality. Also, I wasn't expecting to have to have it plugged into the wall all the time. You don't have to do this, but the buffering is so much worse if you dont. Great idea, but I won't ever buy a stick again.", "verified": true, "helpfulness": "0/0", "author": "Kristin Nagle"}, {"rating": 5.0, "review": "I love it. It was a plug an play. Now I can watch Netflix and Amazon Prime movies right on my TV.", "verified": true, "helpfulness": "0/0", "author": "Debi L"}, {"rating": 5.0, "review": "Excellent...got the whole family excited with our choices of movies, TV series etc. A great investment indeed!", "verified": true, "helpfulness": "0/0", "author": "Eileen G Van Loan"}, {"rating": 3.0, "review": "I'm trying to figure out how to connect to my Blu-ray/surround sound to have better sound.  Dissapointed that I can't use Vudu because it and most Amazon devices do not have Vudu capabilities.  I tried Flirted but does not list all my digital movies.Like the size and protability.  I love my Fire TV app...  Works well with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "JenPet 46"}, {"rating": 5.0, "review": "Love it! I think we will get another rather than move it a between basement and living room.", "verified": true, "helpfulness": "0/0", "author": "Maureen"}, {"rating": 3.0, "review": "I purchased and installed the Fire TV Stick.  I was disappointed that the description doesn't include a \"What's in the box\" section.  If I had known there is a USB cable included, I wouldn't have purchased one separately.  I was also surprised to find that the device requires an outlet for power -- it can't be simple connected to a USB port on my TV.  It's ability to stream WiFi is so-so.  I should probably purchased the Fire TV device that can use a wired connection.", "verified": true, "helpfulness": "0/0", "author": "J. T. Paulson \"book listener\""}, {"rating": 5.0, "review": "Does exactly what it says - easy to install and works like a charm", "verified": true, "helpfulness": "0/0", "author": "DCN \"DCN\""}, {"rating": 4.0, "review": "Great way to make an older TV smart.  Only 4 stars because you need to find an available outlet to plug in. Would have been better if it drew power from tv", "verified": true, "helpfulness": "0/0", "author": "Brett H. Engel"}]