[{"rating": 2.0, "review": "Miracast does not work with Windows.despite supposedly being a standard. Other than that, at $20 it is decent, at $40 there are better devices. Audio lags in HBO to go, Does not work with any universal remotes either.", "verified": true, "helpfulness": "1/2", "author": "B. Marranzini"}, {"rating": 5.0, "review": "It is very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "PATRICIA A. BELL"}, {"rating": 5.0, "review": "I love this. I wanted to have a tv in my bedroom but didn't want to pay for cable.Im able to watch all of my Amazon prime shows now. Very easy to set up ,took me less then five minutes .perfect device.", "verified": true, "helpfulness": "0/0", "author": "Sharon L. Markatan \"sherry\""}, {"rating": 5.0, "review": "It works and is very quick.  Much faster than my old Ruku player.  When you first install it make sure you use the dongle and get it away from the tv", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "the only downfall was the shorter cord  but I love it", "verified": true, "helpfulness": "0/0", "author": "im40"}, {"rating": 3.0, "review": "There is a lot of hesitation in the video, while the audio is playing at normal speed.  I also get messages that my internet speed is too slow, but I know that isn't the cause of the problem.  If I connect and watch video on my wii, I don't have these problems.", "verified": true, "helpfulness": "1/1", "author": "anna grace"}, {"rating": 5.0, "review": "Just awesome, if you can think about it then most prob. is you can enjoy it with the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "EduardoFigo"}, {"rating": 2.0, "review": "Poor picture quality.", "verified": true, "helpfulness": "1/1", "author": "Rob Vought"}, {"rating": 3.0, "review": "Was disappointed because - I thought youtube was on the stick", "verified": true, "helpfulness": "1/1", "author": "paulette hartwell"}, {"rating": 4.0, "review": "When it works, I LOVE it (and now the iphone app is out, letting me control it from my phone and do voice search.) I've had a little bit of connectivity problems...not sure if that was a temporary hiccup in my generally very high speed internet, or problems with a new product. Would recommend it for sure. I got it for only $20 (first day it was available,) so I pretty much view mine as a steal of a deal.", "verified": true, "helpfulness": "1/1", "author": "Dani and Jimmy"}]