[{"rating": 2.0, "review": "It doesn't have very much memory and is constantly indicating that it is running out of memory.  Other streaming devices in the house have little skipping problems but I feel like this stick is resetting and freezing frequently.The remote is very cheap, feels cheaply made.", "verified": true, "helpfulness": "0/0", "author": "Anonymous User"}, {"rating": 5.0, "review": "Really like it,my son in law installed it with no problem", "verified": true, "helpfulness": "0/1", "author": "Pat"}, {"rating": 5.0, "review": "I am a huge fan of Amazon products. I already had the Fire on one tv, and decided to get the Fire stick for the other since it was about half the price. I'm not sure if it's my tv or the Fire/Fire Stick, but the menu on each tv is completely different. I enjoy the menu on the regular Fire more, but the rest of my family doesn't seem to care. The biggest disadvantage to the Stick is that the remote doesn't come with the voice control button for searching. I'm lazy. I REALLY like the voice control. I know that I could just buy another remote, but if I was spending that much money, I would've just bought the regular Fire in the first place. The Stick is also convenient because you can just unplug it and take it with you (we took it on vacation). I am very pleased with the price point of the Stick, and will probably start buying them as gifts.", "verified": true, "helpfulness": "0/0", "author": "Eva Moon \"Eva\""}, {"rating": 5.0, "review": "Easy setup. Easy use. Great programming!", "verified": true, "helpfulness": "0/0", "author": "Catherine  Lee"}, {"rating": 5.0, "review": "Great, as described", "verified": true, "helpfulness": "0/0", "author": "SeaDoc"}, {"rating": 5.0, "review": "Very happy with it! Put off getting this for quite some time and have had prime for a few years. Finally I sucked it up, bought it, and couldn't be happier! Should have gotten this sooner!", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 5.0, "review": "This was an awesome purchase, and I love that it was already tied to my Amazon account when it arrived. We use it all the time. Love It!", "verified": true, "helpfulness": "0/0", "author": "Erica K"}, {"rating": 1.0, "review": "I got the fire tv stick for the tv in my kitchen, less than 20 feet away from my router. It connected at first and worked to watch a few shows 2 days in a row then it stopped connecting to the Internet. I spent hours on the phone with tech support and hours more working with different routers and settings to try to get the stick to connect to he internet. It did not. I got a replacement stick because the tech said it was defective. The new one wouldn't connect either. The next tech tells me I don't have the stick close enough to my router, which is crap. I returned it and got the roku stick, which connects perfectly at 20 feet away and works every time I turn it on.", "verified": true, "helpfulness": "1/1", "author": "Inkmeinpink"}, {"rating": 1.0, "review": "Worthless piece of garbage and a frustrating waste of time.  Totally unreliable...works fine one day...not at all the next.  What's the point of something that will let me watch \"thousands of movies and television shows...\" SOMETIMES.  This is going right back to Amazon for a full refund.  Even when it was working fine, I found the interface to be overdesigned and obnoxious and the ONE app I really bought it for (MhZ Choice) was so different from what was advertised.  This whole experience has been a total letdown.  I'll stick with my Chromecast and my Roku, both would be better options for anyone considering the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "There are two problems that I've had while using the Amazon Fire TV stick (which I bought for $19 pre-sale in October and immediately started using when it was delivered November 30, 2014) that have caused to me to discontinue use of it.  1.) It is always asking me to put in my Amazon digital code.  It doesn't matter if I own the movie, if its a Prime show, whatever.  It doesn't do this unless I am purchasing something on any other Amazon App when using my Sony DVD player, X-Box, or iPad.  It will sometimes ask for my code 2-3 times before letting me watch a show that I already own!  2.)  Sometimes it works great and runs smoothly, but just as often, the picture will freeze and I can only hear words or audio and video will stop and start continuously making it extremely annoying to watch.  I know it's not my internet because I will stop using the Fire Stick and turn on my Sony DVD player and it will work fine with no streaming problems.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Harris \"4th Grade Teacher\""}]