[{"rating": 3.0, "review": "Faster than Roku, especially for Sling, but Amazon hasn't provided an answer as to why the set up says that it has insufficient power, even though it's plugged into a wall outlet. Amazon support just says everything I already know and have tried.", "verified": true, "helpfulness": "0/0", "author": "PLB \"real world\""}, {"rating": 5.0, "review": "Love it.! I have 5 of them in my home.", "verified": true, "helpfulness": "0/0", "author": "Ralph Spadaccini"}, {"rating": 5.0, "review": "happy", "verified": true, "helpfulness": "0/0", "author": "Isabel M. Lewis"}, {"rating": 5.0, "review": "Exceeded my expectations in every way!  Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Jonathan Lippincott"}, {"rating": 5.0, "review": "We had the Fire Stick for a  while and we love it!", "verified": true, "helpfulness": "0/0", "author": "Mitzy Blue"}, {"rating": 5.0, "review": "Wonderful! I use it for amazon movies and Sling tv!", "verified": true, "helpfulness": "0/0", "author": "HW"}, {"rating": 2.0, "review": "Just an opportunity to purchase movies, we use Redbox.", "verified": true, "helpfulness": "0/0", "author": "Bob Satterly"}, {"rating": 5.0, "review": "I found the Fire TV Stick easy to set up and once connected I found that I could easily access Prime Videos, Music and many apps.  I have had it less than a week and I find that I mostly use it for Pandora although I have played around with some of the other features.  It sure beats having to watch/listen to Comcast all of the time!", "verified": true, "helpfulness": "0/0", "author": "jfd34"}, {"rating": 5.0, "review": "I'm enjoying it i don't feel board any more", "verified": true, "helpfulness": "0/0", "author": "Jonathan John"}, {"rating": 3.0, "review": "The stick is alright; the Amazon Prime content is awful. I hadn't done my homework so I was disappointed to find that most of the good old t.v. shows are on Hulu, which isn't free; also expecting TCM-like films, not much there either. Instead we get HBO profanity-laden content.At least I can watch Cheers  and Frazier reruns,at least", "verified": true, "helpfulness": "0/0", "author": "M. A. Rehak"}]