[{"rating": 5.0, "review": "Our first smart stick and we love it!! For Prime members it's a must!! The remote is a plus too! We are planning on putting these on every TV we own. It's the way to go for streaming!", "verified": true, "helpfulness": "0/0", "author": "amazonamy"}, {"rating": 3.0, "review": "We like the Fire TV a *lot* better.....", "verified": true, "helpfulness": "0/2", "author": "Sabrina G."}, {"rating": 5.0, "review": "Easy to set up for me. Worked great first time.", "verified": true, "helpfulness": "0/0", "author": "G. Woolever \"seeker of the Muses\""}, {"rating": 4.0, "review": "For the price, it is hard to criticize the Fire TV Stick. You get access to Amazon's Instant Video and Prime Video, as well as other Prime services like music and photos. There are also a lot of 3rd party apps you can download for accessing content from other services like Netflix, Hulu, and Pandora. What I don't like about the stick is that streaming is not smooth. Video playback often \"stutters\" and pauses, sometimes bumping down to a lower quality. It's not my network because Apple TV and Playstation do not have these problems using the same services. I think the problems are likely due to either the built-in WiFi receiver and/or on-board memory to buffer content.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "This works amazingly well.  Now I can watch Netflix and Amazon Prime in my bedroom.  Yipee", "verified": true, "helpfulness": "0/0", "author": "Julie Franklin"}, {"rating": 5.0, "review": "OMG! this thing is great...the only complaint is that it doesn't have the voice search. if you can afford the next step up, get that one but my deal on this thing for pre-order was so good i had to get it. Great, solid, and able product. Thanks!", "verified": true, "helpfulness": "0/0", "author": "NMS"}, {"rating": 5.0, "review": "I have Amazon Prime video and Netflix. Best little gadget to own and affordable too!  I Love it, works great!", "verified": true, "helpfulness": "0/0", "author": "josiane"}, {"rating": 4.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "Gary S. Van Wert"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Angela Sierra"}, {"rating": 5.0, "review": "Bought 4 of these for xmas, love them!!!  We have used at hotels, and many other places, ZERO issues.  Easy to stream music, netflix, amazon vid's, etc.  Does all the Apple TV does, but I paid $30 for this and $100 for Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Andy Ullrich"}]