[{"rating": 5.0, "review": "Love it...disapponted I can't get closed captioning as I really need it.", "verified": true, "helpfulness": "0/0", "author": "ME"}, {"rating": 5.0, "review": "One of the best in the market", "verified": true, "helpfulness": "0/0", "author": "Keslo"}, {"rating": 3.0, "review": "It works fine on newer TV's, but I wanted to use it on an older set with no HDMI. I bought a converter, but the Fire Stick only goes down to 780p, and my old big screen TV is 480i. But I still like it.", "verified": true, "helpfulness": "0/0", "author": "Mark L. Schmidt"}, {"rating": 5.0, "review": "I love my amazon stick I have access to my Netflix and Hulu at the click of a button....I only wish I would've gotten rid of my cable earlier :)", "verified": true, "helpfulness": "0/0", "author": "Lenora"}, {"rating": 3.0, "review": "Super easy to setup and start using, even with iPhone controller. Bought this to explore free video on Amazon Prime;good value as long as the monitor is around 20\". All the free videos samples were noticeably low resolution on my 60\"!HDTV system. Whether this is intended or a consequence of putting the HDMI signal through my Pioneer VX70 system cintroller, I don't know. The stick itself also gets quite hot, so I have been leaving it plugged in.", "verified": true, "helpfulness": "0/0", "author": "John R Brand"}, {"rating": 5.0, "review": "Love the Fire stick easy and fast to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Cool", "verified": true, "helpfulness": "0/0", "author": "Bryan Al"}, {"rating": 5.0, "review": "easy to install and operate.", "verified": true, "helpfulness": "0/0", "author": "tyrone kent"}, {"rating": 5.0, "review": "I am extremely impressed with my Fire Stick, it's quicker than our smart Blu-ray player and has great quality. I love having the remote app on my phone to control it and the physical remote is small and we'll designed.5 stars all the way!", "verified": true, "helpfulness": "0/0", "author": "Don M."}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Cord Dixon"}]