[{"rating": 3.0, "review": "Great for Prime member's features, but VERY limited on other apps.  Apple TV has many more features for options.", "verified": true, "helpfulness": "0/0", "author": "Jeff B."}, {"rating": 5.0, "review": "Everyone else has written long detailed explanations of all the wonders of this stick. So I will keep it short and simple. I own an xbox, and the xbox one. I also have a ps3, roku, bluray with apps, etc. I hate wasting so much power on larger devices to stream, so I bought this. It blows the Roku interface out of the water and has become my preferred streaming device. Amazon has done a nice job on it. Wish search included apps like Roku does but thats it. I love this thing.", "verified": true, "helpfulness": "1/2", "author": "EvilNCarnate"}, {"rating": 5.0, "review": "Awesome little device. I have Chromecast and Fire TV already but couldn't resist the early prime price. This is perfect for an Amazon Prime member. I have it in a bedroom on a 32 inch TV and it works perfect. The UI is a little slower to respond than my Fire TV but it's still fairly smooth. Great product. Only negative is it has no app that will play my UV collection in HD. Flixster only plays SD and there is no Vudu app yet. I still dream of having one device that allows Netflix, Google Movies/Music, HD UV, and Amazon Instant because I run out of HDMI plugs!", "verified": true, "helpfulness": "0/0", "author": "CHUMP"}, {"rating": 5.0, "review": "Love it! This device just replaced a full sized media center PC with XBMC. Setup was a snap, took all of 2 minutes. is currently being powered by USB on back of my TV (Sony Bravia), so for me this is a self-contained unit. Fast interface. Sideloading apps took some figuring out, but once I did, it was pretty easy. Sideloaded android version of XBMC, and it works great. Haven't messed with all the features, so I can't really say I've had any issues. But so far the experience is far exceeding my expectations. Can't say enough. If you're on the fence, don't hesitate. Get it.", "verified": true, "helpfulness": "0/0", "author": "Daniel Rice"}, {"rating": 1.0, "review": "It will not stay connected to Wi-Fi!! My router is literally just on the other side of the tv and every single time I turn the tv on it asks for my password and then will not even log in. It makes me type in the password about ten times before it connects.horrible!!Once it's connected it's good though, fix the Wi-Fi issue and I'll give it 5 stars.", "verified": true, "helpfulness": "1/1", "author": "Marie Sapper"}, {"rating": 4.0, "review": "FUN, FUN, FUN", "verified": true, "helpfulness": "0/1", "author": "Edward Dennis"}, {"rating": 1.0, "review": "I cannot get my fire stick to load. I have contacted Amazon but haven't heard back.  Have had it 6 days and it hasn't worked yet. The screen says to unplug and try again.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am truly impressed with the Fire TV Stick. It was already tied to my Amazon account, so once I joined it to my wireless network, I was up and running.Previously, I'd been streaming Amazon video through my Sony Blu-Ray DVD player and I must say the video quality is exceptionally better now when I stream through the Fire TV Stick.Also, the ability to install apps on the stick is a plus as well. Just the other night, I installed the A&E; app, so my son can watch the most recent episodes of Duck Dynasty.The Fire TV Stick is an exceptionally well designed product, available at an affordable price. Highly recommended. 5 out of 5 stars!", "verified": true, "helpfulness": "0/0", "author": "Shaun Tabatt"}, {"rating": 5.0, "review": "So much better than the Chrome stick!  Easy to install, strong signal pickup and works beautifully!  With all my options from my Amazon Prime membership, I needed this!", "verified": true, "helpfulness": "0/0", "author": "Chelle \"always reading\""}, {"rating": 4.0, "review": "Works fine - but same as my Roku.  If you already have Roku, the only benefit I could see with the Fire Stick is that you can take it with you.  I did return it since there was no benefit to owning both - As always, Amazon service is THE BEST!", "verified": true, "helpfulness": "0/0", "author": "Mooma"}]