[{"rating": 4.0, "review": "First, it should be made more clear that this does not just plug into the TV, it also needs  to be plugged into a wall for power. The chord is short like a phone charger, and so is a pain to wire up neatly if you don't want a cord visible. I don't see why this seems better than a box with an HDMI cable connecting to TV... at least that can reach power more easily and be better hidden without having to make use of extension cords (sold separately, of course).... so yeah, that was disappointing.Otherwise the interface looks nice, and it seems to stream pretty nicely compared to my Roku/smart TV.", "verified": true, "helpfulness": "3/4", "author": "Breoghan Ferri"}, {"rating": 5.0, "review": "Superior to google chrome. Won't replace your Apple TV but a solid 'guest room' device. Great execution.", "verified": true, "helpfulness": "0/0", "author": "joe voss \"joevoss\""}, {"rating": 5.0, "review": "Great value", "verified": true, "helpfulness": "0/1", "author": "Chris Senanayake"}, {"rating": 5.0, "review": "Received my fire stick a few days ago. Was extremely easy to set up, just plug it in and download the latest update. I actually had to unplug mine and plug back in to get the latest update, but I believe it may have been due to a slow Wi-Fi on my end. Otherwise has worked perfectly with no issues. Very convenient especially if you have an older TV that doesn't come with internet capabilities and apps.  Remote is small, simple and easy to use. I would recommend it to a friend...", "verified": true, "helpfulness": "1/1", "author": "Sampsen007"}, {"rating": 5.0, "review": "Ultra fast loading and i like the remote. The interface is so smooth. I like how amazons prime services are categorized into tv shows and movies. Super easy to use and not expensive. A must buy for movie and tv enthusiasts. Buy it you wont regret it. Thanks amazon i love the fire stick.", "verified": true, "helpfulness": "1/1", "author": "E.Marrero \"nfamisnme\""}, {"rating": 5.0, "review": "Sweet", "verified": true, "helpfulness": "0/1", "author": "Eric"}, {"rating": 5.0, "review": "love it, it's way better than google chromecast & roku stick, highly recomend!", "verified": true, "helpfulness": "0/0", "author": "Giovanny Viznay"}, {"rating": 4.0, "review": "I didn't give it Five stars because it keeps reminding me to use provided power supply when it is already connected. Otherwise setup was straight forward and using it is a pleasure. The remote that comes with it is intuitive and responsive. I haven't tried the Android app for controlling it, but I have downloaded it and am looking forward to taking it for a spin. Finally a seamless path to my amazon prime video store! Selecting, playing pausing and rewinding easily accomplished from the remote. amazon knocked it out of the park with this!", "verified": true, "helpfulness": "3/4", "author": "Edward Zaffino \"TechGuy\""}, {"rating": 5.0, "review": "Outstanding product! Thank you!!!", "verified": true, "helpfulness": "0/0", "author": "movieman0508 \"Chris Crenshaw\""}, {"rating": 5.0, "review": "Great value. Saves run time on my Xbox.", "verified": true, "helpfulness": "0/0", "author": "cj"}]