[{"rating": 5.0, "review": "I waz secaptal at first but after a few days I got use to the menus and other features and now I love it who needs cable when u got fire stick", "verified": true, "helpfulness": "0/0", "author": "matthew ray"}, {"rating": 5.0, "review": "Excellent product.  Easy to set up and navigate.  Very user friendly.  I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Daniel Beismer"}, {"rating": 5.0, "review": "Its awesome easy setup and i love u can personalized your screensaver :D", "verified": true, "helpfulness": "0/0", "author": "zoie"}, {"rating": 4.0, "review": "Overall great device, extended use creates lagging and has to be power cycled.", "verified": true, "helpfulness": "0/0", "author": "Funkypunk"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Stantuf"}, {"rating": 1.0, "review": "can't cast from PC or desktop? forget it!Cancelled my pre-order.Chromecast supports casting from cloud, windows pc, android phone.  Amazon once again has tried to build a wall around their product, but have strangled themselves instead.", "verified": false, "helpfulness": "1/2", "author": "Barry Holsinger"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "keith cobb"}, {"rating": 5.0, "review": "Awesome! We absolutely love this.", "verified": true, "helpfulness": "0/0", "author": "sabby77"}, {"rating": 3.0, "review": "I can't get the screen mirroring to work with my Galaxy s5, I have used a chromecast that works perfectly for mirroring and I figured this would do the same.  Every time I try it just pops up an error message stating that it couldn't connect.  Everything else seems to work okay, but that was the main reason I wanted it.  So not really very useful for me.  If they fix the screen mirroring, then I would give it a 5 star rating.", "verified": true, "helpfulness": "0/0", "author": "Lindsay Sheffield"}, {"rating": 5.0, "review": "Awesome! The value of the Fire TV Stick is awesome....Bye! Chromecast <-- dead man walking!", "verified": true, "helpfulness": "0/0", "author": "Victor"}]