[{"rating": 5.0, "review": "Simple to plug in and start using, and accesses Netflix, Vudu, etc. Streams very fast - much quicker than through my blu-ray player.", "verified": true, "helpfulness": "0/0", "author": "Dorian McDaniel"}, {"rating": 5.0, "review": "Fire stick turns my TV into a smart TV. All my apps are in one place at my fingertips. My computer is no longer tied up with those apps running. You' ll probably want one for all your TV sets.", "verified": true, "helpfulness": "0/0", "author": "James Wink"}, {"rating": 4.0, "review": "We formerly used PS3 for streaming access for Amazon Prime. I am more than tired of all the lengthy updates, and nonsense from PSN (getting kicked off their network a LOT was not uncommon). The remote is very lightweight, which means it can be misplaced or dropped easily. I added the free Fire remote app to my phone so we could use the Voice Search feature, which costs $29.99 more to get with the optional Fire remote. So far, we love the convenience and ease of use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Everyone in the household loves this little device, and for the price you can't beat it. Fantastic value and some really great features.", "verified": true, "helpfulness": "0/0", "author": "SSR"}, {"rating": 4.0, "review": "Best $40 dollars I spend I am a Amazon Prime member so tons of movies for free :)", "verified": true, "helpfulness": "0/0", "author": "Sandra Chavez"}, {"rating": 5.0, "review": "Downloads not always speed of light but overall an excellent product, equal to chromecast but with Prime access.", "verified": true, "helpfulness": "0/0", "author": "Charlotte Thompson"}, {"rating": 3.0, "review": "I snagged the fire stick when it was promoted at $19. I received it in December and started using it in January.  Already, I've gone through 2 pairs of batteries for the remote. It works fine for Amazon Prime videos, but when it came to streaming other channels like PBS Kids or HuluPlus, it was really, really glitchy...like it's buffering or something. I also have a Roku 3 and I can watch Amazon Prime stuff on it and streaming channels run fine. I just think my unit was too new and probably has a lot of bugs to work out.", "verified": true, "helpfulness": "0/0", "author": "MaruMaro"}, {"rating": 5.0, "review": "Love Love Love my Firestick!!", "verified": true, "helpfulness": "0/0", "author": "Amy J. Moore"}, {"rating": 5.0, "review": "This has been wonderful.  I love this because it was the most easy hook up I've every had.  It streams great.  I have always wanted an easy way to stream from my computer to tv and this was the answer.", "verified": true, "helpfulness": "0/0", "author": "Betty K."}, {"rating": 4.0, "review": "I am not able to share my phone screen (galaxy note 2), so that is sad.  I downloaded an app to share photos and videos from my phone, but I would like to be able to share any website I am looking at.", "verified": true, "helpfulness": "1/1", "author": "Polly A. Propst Everritt"}]