[{"rating": 5.0, "review": "The only thing missing on the stick is the ability to search amazon for movies. I guess I could try my phone", "verified": true, "helpfulness": "0/0", "author": "Greg D"}, {"rating": 5.0, "review": "Beats chromecast  or roku hands down.", "verified": true, "helpfulness": "0/0", "author": "William Akers"}, {"rating": 4.0, "review": "My wife loves it!!! Unfortunately will not pick up the Wi-Fi signal in family room so she uses it in the master bedroom which is closer to the router, all in all she's happy so, I'm happy!!", "verified": true, "helpfulness": "0/0", "author": "ray elliott"}, {"rating": 1.0, "review": "The sole reason for purchasing Fire Stick was to receive MHZ Choice. Now it isn't being launched till Fall so it's worthless to me.", "verified": true, "helpfulness": "0/0", "author": "Travelgal"}, {"rating": 4.0, "review": "I ordered the FIRE TV stick for a second television since I'm an Amazon Prime member. We use a ROKU with our main TV, but so far I've enjoyed the FIRE TV Stick just as much as the ROKU. It was absolutely TOO EASY to install and begin using. It took all of 7 minutes to unbox and hook up.", "verified": true, "helpfulness": "0/0", "author": "Atlanta123"}, {"rating": 4.0, "review": "Very simple to install and user friendly. Enough programs to watch and do till dooms day.", "verified": true, "helpfulness": "0/0", "author": "Salvatore Amato"}, {"rating": 5.0, "review": "Faster then chromcast and more features. Good buy", "verified": true, "helpfulness": "0/0", "author": "Lee"}, {"rating": 2.0, "review": "I have to pay extra for movies and tv shows that I can watch for free with my Netflix subscription.", "verified": true, "helpfulness": "0/0", "author": "James W Sims"}, {"rating": 5.0, "review": "No problems!!!", "verified": true, "helpfulness": "0/0", "author": "J Christie"}, {"rating": 5.0, "review": "We've not used it a whole lot, but its very functional and intuitive to use.  Easy to use with any of the tv/movies apps - Netflix, Hulu, PBS. Sling, and of course, Amazon Prime!  On a side note:  I think Amazon should buy Sling and make it better.  Sling has got the right idea, they just need to expand their offering package.  Love the sports package option for $5. Bout time...", "verified": true, "helpfulness": "0/0", "author": "CM"}]