[{"rating": 5.0, "review": "Easy to set up and use. Excellent audio and video. I'll follow up after I take it on the road.", "verified": true, "helpfulness": "0/0", "author": "Mr G"}, {"rating": 4.0, "review": "Pretty good for the Slingbox app (reason I bought the Fire Stick).  My internet download speed is only 7MB, so the \"best\" quality is pretty pixelated at times, and there are pauses, but the lesser quality settings are acceptable.", "verified": true, "helpfulness": "0/0", "author": "Craig Keepers"}, {"rating": 5.0, "review": "Happy with overall functionality and how compact it is.  Only thing I would add to it, is a ethernet jack.  In case your wireless router is too far away and the WIFI signal is low.", "verified": true, "helpfulness": "0/0", "author": "pablo balseca"}, {"rating": 5.0, "review": "Outstanding and very user friendly!!Alo streams very fast,I love it!!", "verified": true, "helpfulness": "0/0", "author": "Timothy Wilson \"timbo\""}, {"rating": 5.0, "review": "This thing is sweet and buffers very little. I love it just as much as my fire TV", "verified": true, "helpfulness": "0/0", "author": "Chad Ainsworth"}, {"rating": 5.0, "review": "Excellent and cheap", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 5.0, "review": "Excellent product and excellent service.", "verified": true, "helpfulness": "0/0", "author": "Raymundo Rosales"}, {"rating": 4.0, "review": "This product is pretty awesome! I would have given it a full five stars but a couple times it froze up on me", "verified": true, "helpfulness": "0/0", "author": "Deshawn Velasquez"}, {"rating": 4.0, "review": "You really don't need this if you have smart TV. It has few additional capabilities like games and adding other applications not supported by smart TVs. So it all depends on the need. Really useful if you want watch movies on amazon prime and play some games. Tedious process to install new applications and access them.", "verified": false, "helpfulness": "0/0", "author": "rmsrao"}, {"rating": 3.0, "review": "I love this item.The price was great. My wireless connection is in the back bedroom of my house, so I was a little worried that my picture would not be clear. However, that was not the case. I saw a great movies each time. I really have enjoyed it so far. I will tell all of my friends to buy this.", "verified": true, "helpfulness": "0/0", "author": "Ronald VanMeter"}]