[{"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "0/0", "author": "SyedMohsinkhalid"}, {"rating": 4.0, "review": "very satisfy. Less one star just for the remote: too small and difficult to type words...", "verified": true, "helpfulness": "0/0", "author": "william halim"}, {"rating": 5.0, "review": "I like it. It's a good deal for the price. It was easy to set up. I didn't have any problems. I corrected the cord into the HMI on the back of the TV and connected it to my Wi-Fi and was done in 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "DOREATHER HARVEY"}, {"rating": 5.0, "review": "Fire TV Stick has been such a breeze to set up and get it going. I've used Netflix and Sling TV and the quality of picture & sound is amazing. I also have Chromecast at home and for the last 6 months, there is always a problem streaming Netflix. FireTV Stick seems to hold a lot of promise. I will update my review later if I run into any issues.Go for it!!", "verified": true, "helpfulness": "0/0", "author": "Hank Reardon \"discerningBuyer\""}, {"rating": 3.0, "review": "This fire stick doesn't quite meet the mark no matter where I plug it in or how close to my quantum speed Internet connection it is it still tells me I don't have enough connectivity speed. Always buffering...", "verified": true, "helpfulness": "1/1", "author": "NeeCee Mo \"Denise B. Moore\""}, {"rating": 5.0, "review": "This is a great product!  Once I put the batteries in right, I had it up and running no time flat.  Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Vickie O'Bryant"}, {"rating": 3.0, "review": "It's a great idea, but I get better wireless access with my IPad than with the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Baker"}, {"rating": 4.0, "review": "Pretty awesome", "verified": true, "helpfulness": "0/0", "author": "mark kuester"}, {"rating": 1.0, "review": "I cant register mine. Phone number to ccontact customer service would help. It wont accept my email. Help please.", "verified": true, "helpfulness": "0/0", "author": "Sherry S."}, {"rating": 5.0, "review": "So far it's been working great!!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Fogelmark"}]