[{"rating": 5.0, "review": "Another brilliant device by Amazon. Simple, quick, intuitive. Why did I bother with buying Roku that stopped working 4 mo. later? I really only watch  Prime movies and Netflix and both work great.", "verified": true, "helpfulness": "0/0", "author": "Gloria Newton \"Driada\""}, {"rating": 1.0, "review": "It kinda sucks . I was excited hoping I'd hook it up and bam there are movies and Netflix and more ... But no .. I have to pay for amazon prime which is only $100 a year so I went for it .. Still so excited to watch hulu and Netflix and HBO .. But... No . you still have to have your own Netflix account and hulu account etc . you end up paying for everything anyways might as well just get a blueray player .", "verified": true, "helpfulness": "0/1", "author": "lizbeth"}, {"rating": 5.0, "review": "Works great, user friendly. Easy to install and navigate.", "verified": true, "helpfulness": "0/0", "author": "Kelli Daugherty"}, {"rating": 2.0, "review": "My fire stick over heats and makes some crackling noise.  Apparently it's pretty common... just rebooting it fixes the frozen screen issue by disconnecting power and reconnecting.  Unfortunately, apps don't know where you stopped mid-movie or TV show. It's a pain... and it happens DAILY.Minus the overheating issue, it's great.  We purchased Sling TV too... Awesomeness!  If only it would work properly", "verified": true, "helpfulness": "0/0", "author": "Shannon McCay"}, {"rating": 4.0, "review": "This is an awesome unit. Works great so long as your WiFi is stable. Totally my new go to gift", "verified": true, "helpfulness": "0/0", "author": "ludgardo"}, {"rating": 5.0, "review": "very fast and easy to work", "verified": true, "helpfulness": "0/0", "author": "sue rupe"}, {"rating": 5.0, "review": "I LOVE IT!!!  Very easy to install.  As a Prime member, I have quite a selection to choose from.  My kid loves the games as well.  I cannot see myself ever going back to cable.", "verified": true, "helpfulness": "0/0", "author": "Maggie E"}, {"rating": 3.0, "review": "Not like it much", "verified": false, "helpfulness": "0/0", "author": "Katya Orellana"}, {"rating": 5.0, "review": "I already had ordered the HD FIRE box for my living room but I ordered the FIRE Stick for the TV in my bedroom & it's wonderful. Very pleased & got me a pretty good watch list on AMAZON Prime. Quite a few series I've gotten into also. Would reccomend to anyone that has a WIFI modem.", "verified": true, "helpfulness": "0/0", "author": "Hall.Terry82"}, {"rating": 4.0, "review": "Everything very good except I wish I didn't have to activate ShowtimeAnytime and HboGo through their websites. Also would be nice to have the ATT UVerse App. Otherwise all good", "verified": true, "helpfulness": "0/0", "author": "Benjamin Aronov"}]