[{"rating": 5.0, "review": "Simply amazing and so easy to use!", "verified": true, "helpfulness": "0/0", "author": "Michelle Pursell"}, {"rating": 4.0, "review": "Need external power supply", "verified": true, "helpfulness": "0/0", "author": "Do \"toyer\""}, {"rating": 4.0, "review": "no problems, so far with the stick. connecting and setup is straight forward, connect device to open HDMI port on your TV and follow instructions.  The navigating the search function is a little funky with the standard remote but no different then any other V-keyboard design.  No buffering problems Amazon prime streaming,  nexflix did have a couple of wait/ buffering when trying to watching a movie but far better then trying to use my \"smart TV\"  I was a little disappointed that you are not able to access hotel wireless at this time (new feature this summer) but in all, this is a terrific product,  sure you are not going to be able to hack the pentagon with this device but you will be able to watch movies, access google store, listen to music and avoid high cable cost all for 39.00", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 4.0, "review": "We haven't used it yet. Been busy and etc. I really think we will enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Elma E Porter"}, {"rating": 5.0, "review": "Enjoying thoroughly,easy to use worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Jenipher"}, {"rating": 3.0, "review": "This would be 5 stars if the remote worked better.  Essentially I've had to download the app and use that as a remote.  If I was going to do that I could have saved a few bucks and bought a Chromecast.  The plus is that you do get access to your prime catalog if you are a prime member.", "verified": true, "helpfulness": "0/0", "author": "Joshua Duell"}, {"rating": 5.0, "review": "I am very pleased with my Fire TV stick now that I can watch Netflix on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Susie"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Mike M."}, {"rating": 3.0, "review": "I find it extremely difficult to navigate around the site.  With prime I already have Amazon Instant Video and it is very easy to see what is available.NOT SO.  EITHER THAT OR I'M MISSING SOMETHING.", "verified": true, "helpfulness": "0/0", "author": "Jarhead"}, {"rating": 4.0, "review": "worked very well and not to hard to setup", "verified": true, "helpfulness": "0/0", "author": "bob lawrence"}]