[{"rating": 5.0, "review": "Love it works really well also very easy to set up", "verified": true, "helpfulness": "0/0", "author": "Lakeshia"}, {"rating": 5.0, "review": "Had issues when i plugged into my Smart TV  while testing (wifi in Smart TV causes it to drop) but when plugged into its intended TV in bedroom it has worked perfectly. A+", "verified": true, "helpfulness": "0/0", "author": "mr s l mcgill"}, {"rating": 5.0, "review": "Works great!  Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Chris C."}, {"rating": 5.0, "review": "Very impressed. Would recommend buying it if you don't want to pay for cable anymore. Netflix and Showtime is the way to go!", "verified": true, "helpfulness": "0/0", "author": "Alex Ramos"}, {"rating": 4.0, "review": "I am very much enjoying the firestick, I can enjoy watching everything I can even remotely want to see!!", "verified": true, "helpfulness": "0/0", "author": "Floyd Farque"}, {"rating": 5.0, "review": "Working great as expected.", "verified": true, "helpfulness": "0/0", "author": "Luong le"}, {"rating": 5.0, "review": "Bought the fire stick and Amazon prime membership about two weeks ago. So far works great. It's made my Chromecast obsolete. Great variety of music.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "I already have the larger Amazon Fire TV box with the voice activated remote in my master bedroom. I needed one for my family room TV but didn't care if it had the more advanced remote. It was so easy to configure when it arrived and found my wireless network on the second attempt to connect. The picture quality seems to be just as good as my other Fire TV larger box and am very happy with the $39 price. I was on the waiting list for the Prime Day Anniversary for this item, but finally bit the bullet and paid the full price. It is definitely worth it.", "verified": true, "helpfulness": "0/0", "author": "Thomas N. Gilmore"}, {"rating": 5.0, "review": "It's fantastic", "verified": true, "helpfulness": "0/0", "author": "avery ashe"}, {"rating": 2.0, "review": "I have \"license trouble\" and \"IP error\" so I can't  use it in DR.", "verified": true, "helpfulness": "0/0", "author": "Clara Berg Victoria"}]