[{"rating": 5.0, "review": "Love this product. Easy installation. Simple usage. Highly reccomend. Love that I can use my firehd and give it voice commands. Five star all the way.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Druzsba"}, {"rating": 5.0, "review": "The Fire TV Stick replaced my AndroidTV stick and it has been great so far. There have been a few network issues, but I believe those are due to my network hardware. It needs more apps, but for the sale price I purchased them it's hard to complain. The ability to add software like XBMC/KODI is also nice. Altough it didn't completely replace my Chromecast stick due to easy of casting certain apps from my phone, it has become my goto device when wanting to see a Netflix or Amazon Prime show or movie.", "verified": true, "helpfulness": "0/0", "author": "Eddie F."}, {"rating": 4.0, "review": "This was a gift and we are pleased. It is easy to navigate the system and, being an Amazon Prime member, we have access to numerous watch possibilities.", "verified": true, "helpfulness": "0/0", "author": "mommo"}, {"rating": 5.0, "review": "This product is everything it's cracked up to be.  As promised, setup was quick and easy, and within minutes I was able to continue a program from my Watchlist that I had started previously on my iPad.  The options available by way of Amazon Prime, Netflix, Pandora, et cetera, work brilliantly.  This is my first television streaming device, and I could not be more pleased.", "verified": true, "helpfulness": "1/1", "author": "KatieR"}, {"rating": 4.0, "review": "First time installing something that was easy and went as smooth as advertised!", "verified": true, "helpfulness": "0/0", "author": "Dianne Schliep"}, {"rating": 5.0, "review": "Love it... just wish I had more time to watch more tv.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "100% Better than google cromecast", "verified": true, "helpfulness": "0/0", "author": "Larry Wenters"}, {"rating": 1.0, "review": "This is not very useful or user friendly. The UI is clunky and the remote doesn't respond all of the time. There's not really a good reason to own this given so many other options on the market", "verified": true, "helpfulness": "0/0", "author": "Kevin S."}, {"rating": 5.0, "review": "I purchased Apple TV last year because I own an iMac, iPad, iPhone, and iPod and love the integration between all of them, but something was missing. I signed up for Amazon Prime because there were tons and tons of movies and TV shows I couldn't get anywhere else and watched them on my iMac, iPad Mini, or my Windows laptop. When Fire TV Stick came out, I thought about it and thought about it, but thought I already have all of these other products, how much more can I watch??? When I saw that I could get the Fire TV Stick for $39 I had to get it. It took a few weeks because of it's popularity, but it was well worth the wait. It took literally 5 minutes to set it up and log into Netflix and HuluPlus. It comes with your Amazon Prime accvount already activated, so there's a big plus right there. I was watching Season 2 of Under the Dome in no time at all! The only negative that I found (which was not Amazon's fault) was that Xfinity does not support Showtime Anytime of Fire TV. I can't wait for HBO Go this spring!", "verified": true, "helpfulness": "0/0", "author": "Morton Goldberg"}, {"rating": 5.0, "review": "Really easy to use and is a great way to watch amazon prime in HD!", "verified": true, "helpfulness": "0/0", "author": "Pete"}]