[{"rating": 5.0, "review": "Great product excellent value. Simple to use.", "verified": true, "helpfulness": "0/0", "author": "John L. Call Jr."}, {"rating": 4.0, "review": "It's nice back of TV 😘", "verified": true, "helpfulness": "0/0", "author": "hemu"}, {"rating": 5.0, "review": "I was fortunate enough to purchase this when it was $19 for Prime Members.  SO GLAD I DID.  We have been Roku Streamers for years - cut our cable long ago.  The Amazon Fire Stick has a much better platform than the Amazon Roku app and makes watching Amazon Prime shows much easier.  My only complaint is that the remote is TINY and is easily lost by any children in my room, so I have to hide it from the kids.  Way to go Amazon, I'm impressed.", "verified": true, "helpfulness": "0/0", "author": "Mrs.V"}, {"rating": 5.0, "review": "It was so easy to use and love that my TV is now able to watch my Amazon Prime! I plan on getting 2 more for other TVs in my house.", "verified": true, "helpfulness": "0/0", "author": "Jamielei"}, {"rating": 4.0, "review": "Nice interface.  No signifiant delay from buffering yet on my network.  I had some problems with various sources not working with the Chromecast device, but so far no problems with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Mark L. Mitchell"}, {"rating": 4.0, "review": "The controllers rotary is too stiff.", "verified": true, "helpfulness": "0/0", "author": "Holly Liu"}, {"rating": 5.0, "review": "Amazing product but the best part is the navigation. The apps on the fire stick are way better than my smart tv and it is all packed into a little stick.", "verified": true, "helpfulness": "0/0", "author": "jon jones"}, {"rating": 4.0, "review": "Love the Firestick, it was very easy to setup it was working in 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "Michael W. Howe"}, {"rating": 4.0, "review": "Simple to boot-up and easy to use", "verified": true, "helpfulness": "0/0", "author": "John Kummers"}, {"rating": 5.0, "review": "Purchased it for my sister who is clueless when it comes to technology.  Having used Chomecast before I figured the Fire Stick would be easier to operate for her as it eliminates the step of syncing the phone to the tv.  So far so good.  She has figured it out and has had no issues with it.  Great deal for $19. If it goes on sale again I would snatch another one up.", "verified": true, "helpfulness": "0/0", "author": "Tara"}]