[{"rating": 5.0, "review": "We got this for free by prepaying for Sling TV for three months. We love the Fire Stick and Sling TV so much we dumped Dish Network, got an Indoor Antenna for local channels that ends up saving us $80 a month!  I highly recommend this option to anyone looking to save money without sacrificing your favorite cable channels.", "verified": true, "helpfulness": "0/0", "author": "Becki Fraley"}, {"rating": 4.0, "review": "Just wished it worked with Windows 8 = (", "verified": true, "helpfulness": "0/0", "author": "Helen"}, {"rating": 4.0, "review": "Nice streaming device but lacks essential apps. YouTube app didn't cast through iPhone and AirPlay app was very sluggish too. Wish it could support bunch of Android apps.", "verified": true, "helpfulness": "0/0", "author": "BioMed"}, {"rating": 3.0, "review": "not what I thought had to send it back not there fault just read it wrong", "verified": true, "helpfulness": "0/0", "author": "Janet R"}, {"rating": 1.0, "review": "sorry it did not when I hooked it up it caused the remote for the cable box not to work and the sound bar too", "verified": true, "helpfulness": "0/1", "author": "gary delpriore"}, {"rating": 5.0, "review": "We love this as an alternative to cable!!!", "verified": true, "helpfulness": "0/0", "author": "Matt webb"}, {"rating": 5.0, "review": "My son uses this all the time for net flicks", "verified": true, "helpfulness": "0/0", "author": "Carol Gilmour"}, {"rating": 5.0, "review": "Excellent product. Moving from the downstairs to the upstairs is easy. I can now watch my Netflix and Amazon Prime from one source.", "verified": true, "helpfulness": "0/0", "author": "Tom G"}, {"rating": 1.0, "review": "Google Chromecast does more.  I bought a refurbished wifi Blu-ray player does that pays amazon movies for $40.  Kinda disappointed.", "verified": true, "helpfulness": "0/0", "author": "virginia rose peiffer"}, {"rating": 5.0, "review": "This Fire TV Stick works well.It was easy to install and together with Netflicks it provides a lot of content to watch.There are plenty of channels to choose from.  This is an economical alternative to cable or satellite T.V.Amazon did a good job on this product, I recommend it - you'll enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Danny All"}]