[{"rating": 4.0, "review": "It was very easy to install.  Very user friendly.  But the remote was near to impossible to open.  So much so, I had to search several YouTube videos for instructions for opening the remote.", "verified": true, "helpfulness": "0/0", "author": "Dora"}, {"rating": 5.0, "review": "I love the product,  but it took almost a month before I got it.", "verified": true, "helpfulness": "0/0", "author": "virginia russell"}, {"rating": 5.0, "review": "Great way to see old shows and new movies.  Love listening to my music and my TED talks.", "verified": true, "helpfulness": "0/0", "author": "Rebeca Illescas"}, {"rating": 2.0, "review": "I can.t watch movies or TV Shows because appears a message about my geographic region.", "verified": true, "helpfulness": "0/0", "author": "Francisco Larrea"}, {"rating": 5.0, "review": "definitely a 'must have'!", "verified": true, "helpfulness": "0/0", "author": "frizz"}, {"rating": 5.0, "review": "Pros:This little thing is pretty cool.  Setup took 5 minutes and another 5 minutes to install the programs I wanted to use.Little to no lag on any shows or videos with my 15mb down, 1 mb up internet speed.I haven't tried many games yet but it hasn't had any difficulty playing any I have tried so far.The remote is nice any easy to use and won't overwhelm you with buttons.I can find apps on amazon.com on my phone and then download them directly to the fire tv stick whic his great when I'm out with friends and they recommend something.Extremely portable.  I can fit every piece into one ziplock bag and break it out and set it up anywhere in 5 minutes.Cons:While it has no difficulty streaming content, searching for the content and loading the stream take a few seconds extra due to the limited cpu power when compared to the fire tv.The hdmi extension that comes with this is about 3\" long and almost pointless in my opinion.The power cord is significantly longer, but with my wall mounted tv there was still no plug within reach, so I had to break out a surge protecter/extension cord to use.", "verified": true, "helpfulness": "0/0", "author": "Cali Adventurer"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Alden14"}, {"rating": 5.0, "review": "Great product. Much better than Apple TV or Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"SDKletzien\""}, {"rating": 5.0, "review": "Everything and more!", "verified": true, "helpfulness": "0/0", "author": "Michael Brotten"}, {"rating": 2.0, "review": "(updated review after using it a few months) I've actually gone back to my old Roku, as much as I love the interface in this over the Roku interface, it just has too many problems to keep using it.  It has major buffering problems, it will randomly freeze mid playback, and there are times when the playback starts skipping.  I may be willing to try the full fledged Fire TV for the better interface, but the stick is just too underpowered for streaming.  My advice would be avoid the stick players in general, I had a roommate who had the same problems with the Roku stick, and just spend the extra on a full fledged stand alone device.(out of the box review) A great product, definitely better than the Roku that I had been using.  That said, it does have its limitations.  The biggest complaint I have is that it does not yet support screen sharing with Windows 8.1 (the product description does acknowledge that it is not yet 8.1 certified, so I can't say that I wasn't warned).  Otherwise, the interface is responsive and fairly intuitively organized (it does have a slight learning curve if you are used to the Roku, but took less time to get used to overall), the video and audio is very clear, and being completely hidden behind the TV is great for keeping the entertainment center appearing neat and organized.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Gawthrop \"smileyeagle\""}]