[{"rating": 5.0, "review": "Excellent program TV/music reception through wireless internet.  Quick/easy setup, inexpensive, portable so can be used on trips or at the relatives....", "verified": true, "helpfulness": "0/0", "author": "J. Stivers"}, {"rating": 1.0, "review": "The streaming was slow and kept getting interrupted.  Could not use HD when wanting faster streaming.  Save your money.  Many titles are on Netflix; however, it did have items that Netflix ONLY has on DVD.  That was the only plus since it was difficult to watch a movie or show in it's entirety without it glitching.", "verified": true, "helpfulness": "0/0", "author": "G. Bixler \"mom of 3\""}, {"rating": 4.0, "review": "Works great with a second TV in my house; already have the Fire TV box on another.  I'm getting closer to cutting the cable.", "verified": true, "helpfulness": "0/0", "author": "Richard A. Mcjunkins"}, {"rating": 1.0, "review": "Not strong enough to play videos", "verified": true, "helpfulness": "0/0", "author": "Karin L Hanner"}, {"rating": 1.0, "review": "Has a terrible time getting connection", "verified": true, "helpfulness": "0/0", "author": "J*Me Nichoje"}, {"rating": 5.0, "review": "The Fire TV stick is easy to use. It is simpler than some TV remotes.", "verified": true, "helpfulness": "0/0", "author": "campingfriend"}, {"rating": 4.0, "review": "Have not used it enough yet but so far it is pretty good.  I ordered it with sling TV", "verified": true, "helpfulness": "0/0", "author": "Ramon P."}, {"rating": 4.0, "review": "It is easy to use and they have a lot of option to use", "verified": true, "helpfulness": "0/0", "author": "Chau M Lam"}, {"rating": 5.0, "review": "So much better than the Roku I have on my other TV! I love this!", "verified": true, "helpfulness": "0/0", "author": "happy"}, {"rating": 4.0, "review": "After having both Roku and Apple TV, I have to say I wish there was a better user interface and menu. All in all though, it's another reason for me to continue to patronize Amazon for basically everything. The processor seems to be faster than my Roku 2 so that's a plus. Overall I recommend this device. It's a must have in this day and age. By the way, the Fire TV App is top notch. Better than Apple TV app and leaps and bounds over the Roku App.", "verified": true, "helpfulness": "0/0", "author": "Robert Laurie"}]