[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "margaret cornn"}, {"rating": 3.0, "review": "Great media service with a very good selection of media. With Amazon Prime it's even better. However, the WiFi is not as strong as my ChromeCast and it only worked reliably when my router was very close to the FireTV stick. Luckily I have a two router setup in my house because it would not work with where my main router is located about 70 feet away, but my ChromeCast was working fine. Tech support told me it worked best with 5MHz Wi-Fi routers, but it works fine with 2500 Hz router as long as it's a really strong signal. Excellent once it's working.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is by far my favorite streaming device. Easy to install, handy remote, and great on screen options. The home screen is a little busy and requires a bit of scrolling but the performance and options compared to competitors can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Brandon Pettit"}, {"rating": 5.0, "review": "The Fire TV Stick does everything one could expect.  Very intuitive and east to use. Pre-Registration makes immediate use a snap.", "verified": true, "helpfulness": "0/0", "author": "Leonard T. Bzura"}, {"rating": 4.0, "review": "Great deal for $19. I purchased the Fire Stick for traveling.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I didn't think we needed one of these, but my husband insisted that I order one. I love it!It is awesome.It's inexpensive, easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "cwhodat"}, {"rating": 3.0, "review": "Does what it's supposed to do.  However need to provide a way to cancel that miserable advertising cartoon masqueerading as directions on how to use the the firestick.", "verified": true, "helpfulness": "0/0", "author": "Rick Holcomb"}, {"rating": 2.0, "review": "The roku products are better,. i dont like the interface and it doesnt have as much of a channel selection as roku. It also buffers a lot at times. Once i restart it, it stops all the unnecessary buffering.", "verified": true, "helpfulness": "0/0", "author": "Callie Torres"}, {"rating": 5.0, "review": "Love it,got rid of cable and got this best thing I ever did", "verified": true, "helpfulness": "0/0", "author": "angryalice."}, {"rating": 5.0, "review": "I'm going to dump my cable and purchase more for my home", "verified": true, "helpfulness": "0/0", "author": "Ed Fowler"}]