[{"rating": 5.0, "review": "If you are an Amazon Prime Member, the Fire TV Stick is a no brainer purchase.  It is nearly worth the price to be able to display ALL your photos on your big screen TV.  Prime members get UNLIMITED cloud photo storage at no additional charge.  Couple that with all of the free video available and the Fire TV Stick is a must have.  We had been relying on a PS3 or Sony Blu-Ray Player to watch Amazon Video.  The Fire TV Stick is significantly better than any Blu-Ray player app, and has advantages over the PS3.  It is fluid and seamless in operation - a very well engineered device.  I also have the Fire TV Box that includes the voice remote - it is fantastic!.  I will update this when I try out the iOS App (iPhone & iPad) that adds voice remote to the Fire TV Stick at no additional charge. Even the included screensaver puts up great photos that turn your TV into a huge photo frame. All in all, this is a great product and a great value.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "very easy to set up like was stated.  Still learning how to access more movies", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love IT!!!!!!! Best thing ever!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The setup was easy, and the overall startup experience was very smooth. I really liked how fast everything works and loads. However, after a week of use, the Netflix app started to hesitate and lag every minute or so. I have an XBOX that I compared the streaming on, and had no issues with Netflix. So, clearly there's an issue with FireTV Stick and it's Netflix app.If they can figure out the Netflix bug my rating would be 5/5 stars.", "verified": true, "helpfulness": "0/0", "author": "A. Wills \"adw\""}, {"rating": 2.0, "review": "lack of IOS support and need for a separate remote makes this a disappointing product for me. I already have a Roku box, but for the promotional price, I went ahead and bought it. first off it does what it does pretty well. It is fast and responsive, but if you own Apple devices, it does nothing new. It would be worth the price if I could mirror from my iPad, but you can't, and it doesn't appear that this will ever support that.The other annoyance is the RF remote, because of this I can not program me Logitech remote to control this. Now I have to have a separate remote, which is small and easily misplaced, They claim to have an IOS remote app next spring, but I could care less about using my phone as a remote, but it would be useful if you lose the supplied remote.As no surprise, the stick is prime-centric.  It's interface is built in, while Netflix is a separate channel. Not a big deal, but if you don't subscribe to prime, it doesn't make much sense to buy this.In short, if you're an android owner subscribing to prime and don't care about universal remote compatibility, this is a nice product, otherwise it's probably not worth it.This is also a wireless only device, which I suspect that most people want, but I have wire to my TV and much prefer the dependability and performance of a wired device although I was surprised how well the video streamed, but it does have a some buffering everytime I watch a movie, something that rarely happens with a wired Roku. Also since using this just before Christmas I have had to disconnect it and plug it back in (reboot) in order to unfreeze it, this has happened a handful of times. Maybe the'll have a firmware update to fix this issue.", "verified": true, "helpfulness": "0/1", "author": "TH"}, {"rating": 5.0, "review": "We are very happy with the results of having installed the fire stick. It has opened up a whole new world in choices for us!", "verified": true, "helpfulness": "0/0", "author": "LARRY NORMAN"}, {"rating": 5.0, "review": "So far so good. This is an awesome addition to our entertainment options. At this rate we will not need TV cable or satellite providers with all these great options!", "verified": true, "helpfulness": "0/0", "author": "Ryan McArthur"}, {"rating": 4.0, "review": "I really like this device, it has all you need to stream from the main streaming services.  Sometimes I notice that Amazon videos stream better than Netflix or Hulu.I have used it when traveling to my folks' and is really easy to plug on any tv.", "verified": true, "helpfulness": "0/0", "author": "Fabio Lopez"}, {"rating": 5.0, "review": "Works as advertised.  Can't believe how much there is to choose from.", "verified": true, "helpfulness": "0/0", "author": "Redline7"}, {"rating": 5.0, "review": "Love this product! So glad Amazon made one of these!", "verified": true, "helpfulness": "0/0", "author": "Blake Ross"}]