[{"rating": 5.0, "review": "Love it!. Also have google chrome cast but think I like this better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love the stick.  My only complaint is the sound quality.  I'm not sure if it is the amazon streaming or the stick that is the problem but the volume is never constant.  Sometimes it's crazy loud and a few mins later,  you can barely hear it.", "verified": true, "helpfulness": "0/0", "author": "Misty"}, {"rating": 5.0, "review": "Very easy to hook up and to watch shows without commercials is awesome.", "verified": true, "helpfulness": "0/0", "author": "xpro1981"}, {"rating": 3.0, "review": "This thing works okay. I like the included remote. It would really be awesome if it could also receive casts like a Chromecast.I bought this for Plex. I already paid for Plex on my Android phone. Plex wants me to pay for it again since Amazon Fire stuff is \"not Android.\" This isn't Amazon's fault.", "verified": true, "helpfulness": "0/0", "author": "Wayne Manion"}, {"rating": 5.0, "review": "After I figured out I had to go to my Amazon account, update my information and set up the 1-Click function. I had trouble downloading Netflix and Youtube prior to doing the update. Once update done, I could download any of the apps I wanted and it plays everything with very little if any buffer time. I would definitely recommend it!", "verified": true, "helpfulness": "0/0", "author": "Stephen Ryan"}, {"rating": 5.0, "review": "Works very good, solved my buffering problem.  Next choice, is to add Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "River219"}, {"rating": 5.0, "review": "I love it but the fact I dont like about it in order for it to run I have to connect some sort of power source otherwise just by inserting into the TV HDMI it doesnt seem to work, else I highly recommend this product compare to Roku or apple tv or chromecast.", "verified": true, "helpfulness": "0/0", "author": "jetcen"}, {"rating": 5.0, "review": "We are that much closer to getting rid of satellite tv and cutting the cord.....Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Carol A Andersen"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Brent Martin"}, {"rating": 1.0, "review": "Mine worked good at first but has increasingly gotten worse. It almost hangs out of the back of my tv because it doesn't quite fit/really needs to be held on with something like duct tape. When people walk by the TV it rattles it out and I have to mess with it to get it to work again. I have a Fire TV and I would recommend that over the fire stick. I am super disappointed in this product.", "verified": true, "helpfulness": "0/0", "author": "AER459"}]