[{"rating": 5.0, "review": "Very fast compared to the roku stick. Very satisfied. Interface could use a little bit of work but overall very good especially if you got at $20 price.", "verified": true, "helpfulness": "0/0", "author": "Tedla"}, {"rating": 5.0, "review": "Great product, easy to set up and convenient to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Disapointed with Kodak\""}, {"rating": 4.0, "review": "My only complaint is the remote control cover was hard to remove to install the batteries. Otherwise love it. No issues. Took less than 5m to hookup.", "verified": true, "helpfulness": "0/0", "author": "Happy"}, {"rating": 5.0, "review": "My daughter loves this, they don't have cable so it was the perfect solution and easy to use.  I plan on buying another one for my husband.", "verified": true, "helpfulness": "0/0", "author": "L. Prince"}, {"rating": 4.0, "review": "Fast while scrolling and streams content quickly. The only problem is that it tiles every once in a while throughout a long movie.", "verified": true, "helpfulness": "0/0", "author": "Zilcho"}, {"rating": 5.0, "review": "LOVE this! We use mostly apple products in our house and I wondered if Amazon could have possibly mastered this as well as the Kindle. They most certainly have! I not only like it, I love it! Works amazing! So glad I purchased it!", "verified": true, "helpfulness": "0/0", "author": "T. Howard"}, {"rating": 1.0, "review": "Junk, hours trying to get it to read my wifi and I am returning it.", "verified": true, "helpfulness": "0/0", "author": "Thomas Clary"}, {"rating": 5.0, "review": "I love it! Streaming video and audio quality is great, and the interface is pretty fast compared to my 'smart' blu-ray player. Highly recommended if you already are a prime subscriber.", "verified": true, "helpfulness": "0/0", "author": "C French"}, {"rating": 5.0, "review": "I pre-ordered the Fire Stick not honestly expecting much for the price, but it totally exceeded my expectations - so much so I bought another one when they were on sale over Christmas. With the $5 AirPlay app and Plex the Fire Stick becomes the cheapest most functional streaming device on the market today, handling local streaming plus Android, Windows, and Apple mobile devices very well. I imagine that over time the library of streaming services grows, but with Netflix and Amazon Prime available from the get go, all my needs are covered.", "verified": true, "helpfulness": "0/0", "author": "TSG \"TSG\""}, {"rating": 4.0, "review": "Easy to use with a great connection to the wifi.", "verified": true, "helpfulness": "0/0", "author": "Rick Fisher"}]