[{"rating": 3.0, "review": "3 stars for the hardware, remote control and possibilities. Not 5 stars because it doesn't support spanish language anywhere not even in ui or subtitles and it loses most of its functionalities if you travel with it or buy it for another country.", "verified": true, "helpfulness": "0/1", "author": "Federico Gomez"}, {"rating": 4.0, "review": "Recommend a longer power cord, at least 3' longer. Good on line instructions.", "verified": true, "helpfulness": "1/1", "author": "Michael D. Kenny, P.E."}, {"rating": 5.0, "review": "I love the portability of the fire stick , the picture quality is excellent it beats the Chromecast hands down.", "verified": true, "helpfulness": "0/0", "author": "william bailey"}, {"rating": 4.0, "review": "The Fire TV Stick is easy to install and use.  Its performance is excellent.  My only complaint is that the power cord is too short.  It barely would reach a wall outlet directly behind it, and, in my case, my surge protector power strip is at the other side of the TV on the floor.  I have had to pull it up on top of the TV stand that the TV is on in order to be able to reach it.  My wife is not thrilled with the aesthetics.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Seems to be good... Still learning it..", "verified": false, "helpfulness": "0/1", "author": "Howard Cole"}, {"rating": 5.0, "review": "Work as expected", "verified": true, "helpfulness": "0/1", "author": "Michael M. Wong"}, {"rating": 4.0, "review": "The fire stick is nice it just loses the network connection more than I would like.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I recently ordered the fire stick as a free purchase for signing up for 3 months of Sling TV, plus we bought a second stick for another tv in the house. Honestly, I was skeptical. Ive been wanting to do this cable cord cutting stuff and lower bills but I was afraid the non-cable service wouldnt be as good or we couldnt see as many shows, boy was I wrong! This is the best thing I could have done and I wish I would have done this much sooner.The Fire Stick allows me to use my prime acct...which Ive had for 3 years and barely used besides for the free shipping. We can get on our netflix, hulu and of course most importantly our live \"cable\" channels through Sling tv. I love this product for the simple fact that it works great and helps me lower my monthly bills!", "verified": true, "helpfulness": "1/1", "author": "Gretchin Anderson \"bug78\""}, {"rating": 4.0, "review": "The Fire TV Stick delivers a great picture, super resolution.  We purchased it because it was the only streaming TV product which would let us negotiate a hotel web portal--our Roku was dead in the water.  Despite a mediocre internet connection, the Fire TV stick works well.  We primarily use Amazon Instant Video and Hulu.  There is a minor buffering issue where a show will pause for about one second, but this is minimal and is only a minor annoyance.  Users who plan on using the MLB.TV app, however, should note it buffers continually and is basically unusable--the Fire Stick displays a message that it can't play back the game.  It's the app, because a laptop and a tablet can play baseball games easily with a small amount of buffering.  The other negative is that you can't use the smartphone app to input the username and password to the hotel WiFi because the Fire Stick isn't on the WiFi and therefore can't be recognized by the smartphone app.  This makes sign-in tedious because it must be done every 24 hours.  Overall a great product if one can live within its limitations.", "verified": true, "helpfulness": "0/0", "author": "Susan E Pilcher"}, {"rating": 4.0, "review": "I mostly purchased this item to have access to Netflix and after 6 days. am still not able to connect to Netflix.I believe this is a Netflix problem with the Fire TV Stick, but still disappointing.Otherwise it works quite well and access to the movies on Amazon is great.", "verified": true, "helpfulness": "0/0", "author": "Landman"}]