[{"rating": 4.0, "review": "We're enjoying the Fire Stick as it brings so much to our TV system with only a few clicks of its remote control.  No more cables/networking my computer to the tv to show photographs or YouTube, etc., this thing does it all.  I do with the free content would refresh more often, but for free I guess I can't complain.  I rated only 4-Stars because the thing completely locked up once and would not turn on - I had to remove the power cable from it and after plugging it back it, it seemed to have reset and is working ok (don't know if this will be a recurring issue or not - only happened once so far in the short time we've had it).", "verified": true, "helpfulness": "0/0", "author": "Sandog"}, {"rating": 2.0, "review": "The only disappointment that I had was I could not see how to access any internet television stations for live broadcast.  I thought that would be available.  I have Netflix but thought getting live TV would be a step up.  The fire stick works fine and is easier to use than Netflix.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "For years we could  never get to see movies since we live in a remote area and reception was so bad. It literally took 2 minutes to set up the  fire stick and it has been amazing. Just press  a few  buttons and we can watch anything we want.", "verified": true, "helpfulness": "0/0", "author": "catnurs"}, {"rating": 5.0, "review": "greatest thing ever", "verified": false, "helpfulness": "0/0", "author": "lisa gomez"}, {"rating": 1.0, "review": "Installed but did not get any sound. Returned and tried another one. Same problem.", "verified": true, "helpfulness": "0/0", "author": "Arnold Greenstein"}, {"rating": 5.0, "review": "I ditched cable TV in favor of OTA w/ TIVO and Netflix. There's the hassle of an outside antenna cable to each TV so I only do OTA to our main Smart TV. I use the Fire TV Stick in a smaller TV in the bedroom so I can get Netflix over the Wifi without any other connections.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very pleased with this purchase. I already have a Roku 3 and a Chrome stick and this has some of ofthe benefitoff of both. It has a small form factor and lots of available apps including one for Netflix, YouTube, and PBS Kids and, like the Roku, it has a small remote control so the user doesn't have to rely on a smart phone as the interface. It was easy to set up and it has good organization in the menus for both the apps--including recently used ones--and for the shows and movies available through them and through Amazon.", "verified": true, "helpfulness": "0/0", "author": "Enld"}, {"rating": 5.0, "review": "The Fire TV Stick is small in size, but not in performance.  It does everything that my old Media PC use to do!  I was a fan of the original Roku player for quite some time, but it did not provide all my viewing needs.  The Fire TV Stick has exceeded my needs, and makes it possible for me to bring a personal media player wherever I may go.  No more being forced to watch what's on the hotel TV, I can just hook my Fire TV Stick to the HDMI port and enjoy my favorite stations.", "verified": true, "helpfulness": "0/0", "author": "Patrick McDonnell"}, {"rating": 1.0, "review": "It always keeps disconnecting from the wifi. No matter what trouble shoot I do. It never works.  But my Hulu, netflix always works perfect on my ps4", "verified": true, "helpfulness": "0/0", "author": "Jonathan harden"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "RHONDA L HICKS"}]