[{"rating": 5.0, "review": "Very simple set up; easy to use!", "verified": true, "helpfulness": "0/0", "author": "Deeba"}, {"rating": 5.0, "review": "I've enjoyed the quality of the product and ease of use.  I will recommend it to all my friends.", "verified": true, "helpfulness": "0/0", "author": "Sandy Michaud"}, {"rating": 5.0, "review": "My family absolutely loves the fire stick.  It's extremely easy to install and use.  I highly recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Shellmass73"}, {"rating": 3.0, "review": "I REALLY with I could use this device to mirror whats on my computer screen like I can with Chromecast. This works fine for Netflix and Amazon video and it's nice that it comes with a remote, but if I could use this to mirror what's on my computer screen, it would be amazing.", "verified": true, "helpfulness": "0/0", "author": "Brian West"}, {"rating": 5.0, "review": "Very Happy with it", "verified": true, "helpfulness": "0/0", "author": "Michael J Jay"}, {"rating": 4.0, "review": "I really liked the fire stick-- both the stick and the remote are trim and sleek, and it's fast. But, the Roku stick will mirror the screen of a Windows 8 computer, and the fire stick is limited for that purpose to other Fire devices and a few Android devices. So, I went with the Roku.", "verified": true, "helpfulness": "0/0", "author": "!wolfie!"}, {"rating": 4.0, "review": "Really like it. With prime membership come certain movies; buy newer releases for a fee. Easy install. No negatives.", "verified": true, "helpfulness": "0/0", "author": "Liz h"}, {"rating": 5.0, "review": "Great product thinking about canceling my cable", "verified": true, "helpfulness": "0/0", "author": "Mik"}, {"rating": 5.0, "review": "Easy to set up; performs as expected.", "verified": true, "helpfulness": "0/0", "author": "M. Hopkins"}, {"rating": 5.0, "review": "Love it. I just wish there were more recent shows available for free to Prime members.", "verified": true, "helpfulness": "0/0", "author": "chan"}]