[{"rating": 2.0, "review": "It works great if you want to pay for Amazon's service. It sucks if you want to us Netflix or Hulu. It constantly \"cannot connect to Netflix\". But I can get Netflix to work fine on my Kindle. So it's not my network that has the problem. Crackle works fine. I think Amazon doesn't want you to use Netflix so it makes it crash. Very disappointing Amazon. Makes me not want to pay for their service. Btw, Netflix works fine on my blueray player in the other room but crashes on the Firestick. Very disappointed...", "verified": true, "helpfulness": "0/0", "author": "CLR"}, {"rating": 2.0, "review": "I dislike the interface. I prefer the Roku 100x to this. This interface is harder to navigate. It is a giant Amazon advertising sea. Look, recommended Amazon shows. Look another row of Amazon shows. Look, another row. The channels are there somewhere.The remote is easy to use, after i managed to open it for the batteries. Make the notch deeper instead of smooth. I have the non-voice model.The channels, aka apps, take forever to download. Set up has taken around an hour after waiting for each app to download and activate. Set up on the roku was half that. I didn't even bother hunting for all of the ones I wanted. I was tired of staring at the Amazon advertised shows in the que.Sling which was a buy a three month subscription, get this stick free promotion isn't worth the cost even with the free stick thrown in. 59.99-39.99 means I paid for one month get two free.Allow me to set up my own choices, get rid of the endless Amazon program icons that are advertising I didn't pay to navigate around. One row, fine. Several rows, every time I turn it on, I am not happy. Yes, it is an Amazon product, and stupid me, I should have remembered Amazon likes to push their products harder than drug dealers want to hook people on drugs. It's overkill. I will never purchase another Amazon created product.", "verified": true, "helpfulness": "1/1", "author": "Angela C."}, {"rating": 5.0, "review": "Love the Fire TV Stick. Great content and apps. $39 and $99/yr for PRIME is a great deal.", "verified": true, "helpfulness": "0/1", "author": "Juan"}, {"rating": 5.0, "review": "Oh Yay!!!!!!!!!!", "verified": true, "helpfulness": "0/1", "author": "Princess Pamela \"The Princess of All\""}, {"rating": 4.0, "review": "I haven't used it enough yet , but it seems to work well !", "verified": true, "helpfulness": "0/1", "author": "Richard Eveland"}, {"rating": 5.0, "review": "Very easy to set up and use. Great product so far", "verified": true, "helpfulness": "0/1", "author": "Kelsey brown"}, {"rating": 3.0, "review": "Trying to put batteries in the remote is very challenging. I shouldn't have to go to the Internet to find out how tough it was to remove the cover to install batteries.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Great choice :)", "verified": true, "helpfulness": "0/1", "author": "Ariel"}, {"rating": 3.0, "review": "I have to say I am enjoying my Fire TV Stick.  For the value, it definitely delivers with a smooth interface, making navigation pretty intuitive.  My only gripe is that I bought this not only to enjoy Netflix, Amazon Prime & Spotify, but for Vimeo.  Which makes me wonder who's the culprit for it's consistent buffering while watching short videos.  Everything else streams just fine, so I'm not sure what to make of it besides hope there's an update of some sort that will fix it.  Otherwise this works great hooked up to my AV Receiver and I used all the accessories that were provided (HDMI Extender, USB Cable & USB wall plug).  I use this on a 1080p dumb tv and put the settings on the fire stick to a 720p output in hopes that the streaming demand would help speed up Vimeo, but it still looks great and I've left it that way.  Hope this review helps some people out there on choosing whether to buy or not buy the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Spunos"}, {"rating": 4.0, "review": "Love it! Has exceeded my expectations! Would buy it again!", "verified": true, "helpfulness": "0/1", "author": "Jon Michael Williams"}]