[{"rating": 3.0, "review": "I recently puchased a samsung blu ray home theatre system with wi fi and currently have a sony blu ray which i barely use. Im a bit out of touch with technology and these new gadgets. i also orderred a new smart tv on cyber monday. im trying to figure out the fuss and is it worth me getting this new amazon tv or stick? do i even need it? can i eliminate my cable bill? can i surf internet? does it serve a purpose without internet? how can i get internet/ wifi for cheap without bundled with current optimum cable bill. fyi, i also have a kindle fire which i barely use. Can i use it when i travel? anyone help", "verified": false, "helpfulness": "0/2", "author": "Crystal Demi"}, {"rating": 5.0, "review": "This thing is pretty sweet.  I have Prime, a Fire TV, and now this Fire Stick.  The only thing I would want out of the Fire Stick is the Fire TV Remote.  Also, I wish the picture would show that you have to have it plugged in into the outlet.  I really wasn't aware of that once I ordered and had to do some re-wiring to get it powered on.The great thing about it is that the remote works without pointing at the device.  This is also my first stick device, so I might just be naïve, but it was something I truly appreciated, since my HDMI is on the back of the TV.We use it solely for the kids to watch their shows (TumbleLeaf, Paw Patrol, UmiZoomi).  If you can get it for the special price, you can't really beat this thing.Also, I've read that you can get XBMC on this.  I haven't done that since I have an AppleTV2, but in terms of speed, this thing blows my ATV2 out of the water.  Just the fact that it can have XBMC on it makes me feel that it's a better value than Chromecast and any other stick device.  I guess the only rival I can think of is RaspPi, but I like having a remote.", "verified": true, "helpfulness": "0/0", "author": "P. Pak"}, {"rating": 5.0, "review": "I haven't used it for all it's capabilities yet but it functions nicely! Simple setup and very simple navigation on the menus", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 2.0, "review": "I was very much looking forward to this. Unfortunately, neither of the Samsung HDTVs in my house nor the Sony HDTV apparently have a powered HDMI port, making external power to the stick necessary.That's where the trouble starts. Apparently the output of the USB ports on any of my TVs also doesn't supply enough power to run this device. You get a warning screen that has the option \"start anyway\", but that clearly says that there is not enough power for normal operation.So now the problem becomes supplying power to the stick. But the supplied USB cable is so short that you cannot do this without an ugly and clumsy extension cord. And that is where the whole concept just falls apart.It just seems to be a much better idea to have a regular HDMI cable running to a hidden box in a cabinet (as in an Apple TV or a Roku or the Fire box) that is powered along with all your other devices. The stick concept is useless unless you have a TV set that supplies the power directly to the HDMI port.Makes me wonder of course what brands / models of TV actually provide enough power to run the Fire TV Stick directly", "verified": true, "helpfulness": "0/1", "author": "Michael Franz"}, {"rating": 1.0, "review": "Piece of CRUD. My roku works fine. Have tried it with and without the extender. I even unplugged all other electronics which use my wifi and still NOTHING. It just keeps telling me connection failed. No no, you fail stupid stick", "verified": true, "helpfulness": "1/2", "author": "katie longworth"}, {"rating": 2.0, "review": "Spent most of the evening with the Fire Stick hung on the \"Amazon\" screen.  Eventually got it to work, and it told me I should be using the power adapter that came with the stick (which I was).  Finally, I'm having HDCP Authorization issues when using the Fire Stick with my HDMI switch (the equivalent of the blue screen of death), even though my setup is HDCP compatible (i.e. I have no issues playing HDCP content from my Xbox through that switch).  Not being able to integrate it into my system renders the product worthless to me.  I've also experienced some intermittent network connectivity issues.For comparison, I have never had any issues this severe with my Chromecast in the year that I've had it.*Edit*I've worked through most of the issues and it seems to be working fine.  The HDMI switch I was using needed more power for the HDCP pass through to work*.  Again, I haven't had any of these problems with other HDCP devices.*I temporarily tried using the Amazon power supply to power the HDMI switch, which solved the HDCP pass through issue, but that resulted in major network connectivity issues with the Fire Stick.  Using anything other than the power supply that came with the Fire Stick is an exercise in futility.", "verified": true, "helpfulness": "1/1", "author": "Krystalee"}, {"rating": 1.0, "review": "I'd love to be able to review all the pros and cons of this device, but unfortunately I can't even use it without buying a remote that costs more than the Stick itself.True, I did buy this knowing that there was no iOS remote app. I guess I just put too much faith in Amazon and assumed that when they said one was coming soon, they meant it. A month later (and almost a year after the launch of Fire TV) and still no iOS app. So I can let it collect dust, or I can shell out 40 more bucks for the remote. I genuinely hate to say it, but I wish I bought a Roku.", "verified": true, "helpfulness": "0/2", "author": "Roman Paul \"professional appreciator\""}, {"rating": 5.0, "review": "I'm just a 48 year old woman who loves to watch movies. I've used the Roku device in the past and really found that to be a pain to use. I stopped using the Roku because it was limited and took too long to get what I wanted to watch.The Fire Stick intrigued me because (1) it's Amazon and (2) I can use it with any hdmi television. My TV is about 11 years old. It has only 2 hdmi ports. Very limited and huge. The Fire Stick brought the television into this century! I'm enjoying movies like never before!First, the Fire Stick is SIMPLE to setup - I did it within minutes! I was watching prime instant videos and downloading apps all night. It's great fun. The remote is very easy to use though it has no TV functions at all -  Strictly Fire Stick functions. I had no problem getting the photos on my phone to appear on TV through the cloud app. It really is an easy to use device and I found it to be quick. Maybe others who found it slow have slower connections? I have 75 FiOS speed. It's much better than the Roku by far,  both in the ease of use and with the remote.I highly recommend this product. It has made me start searching for a newer TV so I can truly enjoy all that the Fire Stick has to offer.", "verified": true, "helpfulness": "1/2", "author": "Jacobs house \"Amazon Shopper\""}, {"rating": 5.0, "review": "I am really impressed.  This small thing just blew out of the water all similar gadgets I have including Chromecast, Roku, smart TVs and some Android microcomputer, When you unpack the stick you will have no doubt that you are dealing with a top notch device. The responsiveness is incomparable both in video playback and the user interface.I wish Amazon included full keyboard with the device but it undoubtedly would increase the price.", "verified": true, "helpfulness": "0/1", "author": "Papa Carlo"}, {"rating": 5.0, "review": "Very cool!  I own a Roku LT and a second edition AppleTV.  Wanted another streaming device for the bedroom and decided to give this a try.  The unit is very small and surprisingly fast.  Interface is clean (similar to the ATV) but includes both Amazon Prime and Netflix (which was a must).  While the Roku has the advantages of letting you search across all channels from the main screen, you can't do that with the Fire TV stick (at least not yet that i can tell) the overall speed and clean interface of the Fire TV stick makes up for much of that - along with being able to \"voice search\" anything on Prime from my iPhone via the app.  Very very impressed with the responsiveness and that is likely due to the large storage/buffer capacity and fast networking.  Definitely recommended.", "verified": true, "helpfulness": "0/1", "author": "Irwin Fletcher"}]