[{"rating": 3.0, "review": "only gave it that rating because i didn't read about it that well. i guess for this to work properly you have to have wifi. i don`t have wifi. i`m going to vent here for a bit. we all spend good money for protection of our computers. but it still isn`t good enough. i have bought three or 4 different programs to stop hackers, malware and viruses. everybody says they have the best. you buy them but you still get all kids of crap that slows your machine down. from what i have read wifi is even worse then ethernet. i have 3.8 gig amd 8 gigs of ram and 1 gig nvidia video card. and even with all the stuff i bought to keep all these things out still get things that slow my computer down. and read it`s even worse with wifi people can go by in their cars and tell if you have wifi. if these idiots can hack the government. how are supposed to stop them unless you're as good as they are. i can build my own computers but when it comes to software i`m lost. had my computer cleaned for $100.00 it ran like a demon for a weak then same old crap again. is there anybody out there who can give me some tips ? will this run without wifi", "verified": true, "helpfulness": "0/2", "author": "mark boucher"}, {"rating": 5.0, "review": "Set up was plug and play.  Everything works perfectly.  Great product.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Giuliano Mineo"}, {"rating": 3.0, "review": "The Netfix app does not work.  Come on Amazon - test things before your release them!", "verified": true, "helpfulness": "0/1", "author": "Richard Howard"}, {"rating": 5.0, "review": "Installation was SUPER EASY & FAST!!!  It is very easy to use.  With the exception of a little glitch where it was not connecting to my network because I moved the tv 2 inches, I am very pleased!!!! The picture quality is Great and the watching shows, no delays.  I recommend it!!", "verified": true, "helpfulness": "0/0", "author": "Zoeville"}, {"rating": 5.0, "review": "With so many spots where you can't retrofit an ethernet cable, and so few wireless device that support Amazon Prime, This is an amazing alternative. Took just a few minutes to set up for my network and my other accounts. Worked immediately as advertised and a nice little tutorial video to boot. You'll love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Recent graduate New York Institute of Photography. Love SciFi and mystery.\""}, {"rating": 5.0, "review": "This thing is great. Arrived the day it was supposed to and it was easy to set up", "verified": true, "helpfulness": "0/0", "author": "David Garcia"}, {"rating": 4.0, "review": "Love the interface, works well!  5 stars if there were more prime movies, either I am unsure where to look for them or they are not listed.  I do recommend this!", "verified": true, "helpfulness": "0/0", "author": "Kerry Wald"}, {"rating": 5.0, "review": "Is better than roku stick", "verified": true, "helpfulness": "0/0", "author": "Eliott Neumann"}, {"rating": 5.0, "review": "It was better than expected. I received it about two weeks early. The interface is better than the Roku and any other blu ray player that I use to stream. It is also very efficient and hidden away. I would recommend this to anyone who is looking for their first or another streaming device.", "verified": true, "helpfulness": "0/0", "author": "Frank Pressel"}]