[{"rating": 2.0, "review": "Can't make it through even one show without freezing.  I have the Amazon Fire Tv in several rooms in my house.  Thought I would buy the cheaper Fire Stick for my sewing room.  Waste of time and money.  Ended up ordering another Amazon Fire TV.  It works so much better and is worth the extra cost.", "verified": true, "helpfulness": "2/2", "author": "Sharon Das \"SD\""}, {"rating": 4.0, "review": "Definitely better user interface for viewing movie titles, however it is really difficult to search through various genres of Prime movies. I'm not sure if Amazon just doesn't have many titles for Prime or if they're just buried deep down into the UI, but this is an area that could use improvement.Besides this, the UI for YouTube and Netflix are better than what I used previously on my LG smart DVD player, however searching for titles could still use more work, especially since there isn't an easy to integrate keyboard. The hunt/peck system of the click remote seems very web 1.0, but until there is a voice function on this version or some type of Kinect motion based letter/word selection tool, it will have to do.The Fire TV Stick offers a simple set up experience which was pleasurable. I was honestly surprised how easy it was to set up. It would be nice to have an \"on/off\" feature on the stick though or at least have it shut off when the TV is off because it gets quite warm when it is not in use and downright hot when it is in use. I generally unplug it from the TV after I turn the TV off because I'm not sure how much electricity it is eating up when not in use and I'm not a fan of how warm it gets.Overall it is a very useful addition to my media experience and for what they charge I would definitely purchase it again.", "verified": true, "helpfulness": "0/0", "author": "JennyMac"}, {"rating": 5.0, "review": "Surprisingly good - compares very favorably to Chromecast and almost as good as Apple TV (at half the price). Easy setup, it's a great purchase for $40 or less.", "verified": true, "helpfulness": "0/0", "author": "Cruise Cardinal"}, {"rating": 1.0, "review": "Check the support forums before you buy this product as you will clearly see numerous people complaining about steaming issues with certain apps. There are known problems with the device having choppy playback with Netflix and Hulu. This doesn't seem to happen while using other apps and Amazon content was always perfect. Our 720p Apple TV plays these apps just fine so it was nothing to do with our network connection. Tried several troubleshooting tips, but none fixed the choppy playback for Netflix and Hulu.", "verified": true, "helpfulness": "1/1", "author": "J. Baum"}, {"rating": 5.0, "review": "Love it! We have 3! We cut cable and bought these to stream Netflix, Hulu, and sling TV primarily. A little slower (literally seconds.....not enough to be concerned over) starting apps then turning on the cable box but so much cheaper! Highly recommend (we also did a prime trial but honestly more stuff on Netflix, so will be cutting out prime after 30 days....DO NOT NEED PRIME ACCOUNT TO WORK THIS FYI!)", "verified": true, "helpfulness": "0/0", "author": "M. Mahoney \"tgrlipgloss\""}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 4.0, "review": "Nice interface, works with Harmony Remote... but would be EPIC if i could control through our Amazon Echo.", "verified": true, "helpfulness": "0/0", "author": "Tim Hunt"}, {"rating": 5.0, "review": "Product works as advertised. The navigating around the screen is a bit cumberssome for an old guy like me, but it does the job.", "verified": true, "helpfulness": "0/0", "author": "r abel"}, {"rating": 5.0, "review": "Great portable item all of the streaming is great, I am thinking about buying the Fire TV box and donating my Roku Box.", "verified": true, "helpfulness": "0/0", "author": "Insight"}, {"rating": 3.0, "review": "I really do love this thing, wanted to give 5 stars and own several of them. But just one gripe - they're behind the times in the app department. They need to add Verizon and Time Warner Cable apps to the stick so one can watch on other tv's without the pricey cable box. Roku already has this. Come on Amazon! You're better than that!", "verified": true, "helpfulness": "0/0", "author": "Gaga"}]