[{"rating": 5.0, "review": "I am having trouble accessing Netflix, besides that l love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I was very excited by the prospects of being able to easily stream my Amazon Prime movies/TV shows to my TV -- since Amazon does not appear to support Google's Chromecast.  The demo for the Fire Stick looked great, and its setup and interface looked easy to use.  Then, the reality of the situation occurred when I tried to use the Fire Stick.I have only been able to get it to work for about 4-5 days at any given time.  At first, it worked fine.  Then, after a couple days, any time I attempt to stream anything from Amazon, I get noting but a blue screen that says: \"HDCP unauthorised.  Content disabled.\"  I can hear the program in the background, but there is no picture.  Needless to say, this is pretty frustrating and useless.I have called Amazon support.  They had me reset everything you can think of, and it started working again.  However, this only last about 2-3 days.  Then, back to the blue screen of death (sorry Microsoft).  I was informed that it might be related to other HDMI devices plugged into the TV.  The strange thing is that none of my other devices (Chromecast, Apple TV, Blueray player) have any issues at all.  It is only the Amazon Fire stick that does not appear to want to work.I am pretty disappointed.  This looked like a great device that would let me stream most of my content through one device -- since it is compatible with Netflix, Hulu, etc.  However, the inability to play Amazon's own content correctly really kills this device.  I had higher hopes for Amazon.", "verified": true, "helpfulness": "1/1", "author": "Nomadic Dan"}, {"rating": 4.0, "review": "I purchased this for my downstairs family room after I had already spent the money on the Fire TV for upstairs. It works great, the only drawback that I have found as it doesn't have a processor or memory on it like the Fire TV it can not install and play some of the games that I have installed on my Fire TV. It was the main reason I bought it was to keep my kids off the upstairs TV and downstairs. But it works perfectly for what it was designed for.", "verified": true, "helpfulness": "1/1", "author": "K. VonEber \"voneber\""}, {"rating": 4.0, "review": "Love it! No need for cable tv!", "verified": true, "helpfulness": "0/0", "author": "Stephanie brown"}, {"rating": 2.0, "review": "Constantly loading,takes forever to watch a show, even with high speed internet", "verified": true, "helpfulness": "0/0", "author": "Angela m Gallo"}, {"rating": 5.0, "review": "Had my son plug it in and away I went!  Great.", "verified": true, "helpfulness": "0/0", "author": "Rosey Kyle"}, {"rating": 4.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "vlk"}, {"rating": 5.0, "review": "This is a great product.  My other TV has a roku stick.. hard to pick my favorite though.  They are good for different things.", "verified": true, "helpfulness": "0/0", "author": "Nicki"}, {"rating": 5.0, "review": "I ordered the Amazon fire tv stick as a replacement for a new Roku that I returned (the roku was expensive and you had to subscribe and pay for ALMOST ALL content; little was included); what a fortunate decision! The Fire TV stick  works great. Easy to use, intuitive, and excellent voice search (Siri could learn something here!)! Coupled with my Amazon Prime Membership, it's an outstanding deal!", "verified": true, "helpfulness": "1/1", "author": "Paul D. Simpson"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "Bat"}]