[{"rating": 5.0, "review": "This is a great piece of hardware and the user interface is nice and simple. For the price the Fire TV Stick is not just a  good purchase, but a no-brainer. One major point for me is that line of sight is not required with the remote. I have the TV mounted on my patio outside and the Fire Stick is plugged into an HDMI jack inside my house (a weird custom setup, no need to go into details about it), and the remote works fine. I love it. I have the RoKu 3 also and it's great but it was like twice the price...", "verified": true, "helpfulness": "0/0", "author": "csramin"}, {"rating": 5.0, "review": "great device to have", "verified": true, "helpfulness": "0/0", "author": "Ali Hussain"}, {"rating": 1.0, "review": "YouTube doesnt work. Cant permit log on or download.Titles in Netflix are crazy. Put me the name of one title but really is other title.", "verified": true, "helpfulness": "0/0", "author": "Sergio D."}, {"rating": 5.0, "review": "i love it it works great on my daughter tv i am so happy i got it now.now i can watch wwe network with no problem just for $10 a month", "verified": true, "helpfulness": "0/0", "author": "Monica maldonado"}, {"rating": 5.0, "review": "This is such an awesome little device.  I wanted to upgrade to a smart TV, but tried this instead.  It is so much better than a smart TV. I take it with me when I go to my folks for the weekend- I have all of my content in the palm of my hand.  Its awesome!", "verified": true, "helpfulness": "0/0", "author": "lovell-books"}, {"rating": 5.0, "review": "I got this for a tv in one of my bedrooms that my teenage granddaughter uses when she visits.  This is  great as it allows her to access my subscriptions (Netflix, Amazon Prime and Hulu) and I don't have to have another cable outlet installed.", "verified": true, "helpfulness": "0/0", "author": "susan b. ray"}, {"rating": 5.0, "review": "We love the Firestick. It was very easy to install and use. We are retired on a fixed income, so we don't rent many movies. A lot of the free ones are notvery good.  but you can still fine something worthwhile.", "verified": true, "helpfulness": "0/0", "author": "pet lover"}, {"rating": 5.0, "review": "Works 1-2-3!!! Easy to install! Terrific !", "verified": true, "helpfulness": "0/0", "author": "Anthony J. Fisher"}, {"rating": 4.0, "review": "I thought there would be newer movies quicker but this works well.  I tried a Google Chrome but it was not compatible with my Kindle so this was a steal for me.  I got it for only $19, preordering it.", "verified": true, "helpfulness": "0/0", "author": "Jo Ann Houghton"}, {"rating": 1.0, "review": "Worked great for a couple weeks, but I haven't been able to connect for quite a while.  I keep getting an \"authentication problem\" in the network settings even though it says there is a very good WIFI signal.  I tried resetting everything but nothing ever works.  Turned out to be a waste of money.", "verified": true, "helpfulness": "0/0", "author": "Keith Mize"}]