[{"rating": 4.0, "review": "This device will save me loads of money on cable!! I Was sick of paying so much money for channels I didn't watch anyway, so I decided to try this device. Now I get to see what I want and don't have to pay an arm, a leg, and a foot. So far I am happy with this device. I just plugged it in everything else was already setup.", "verified": true, "helpfulness": "1/1", "author": "Yolanda L. Winfield"}, {"rating": 5.0, "review": "I have been a Roku owner since they came out.  This seems to be just as good but what I really like is the size of it.  It doesn't have as many channels available as my Roku and the menu is not as easy to navigate but now I can take my Prime Videos with me when I travel! (assuming you have wi-fi access at your destination)  The introductory price of $20 was too good to pass up and even at regular price would be a great deal.", "verified": true, "helpfulness": "1/1", "author": "CW in AZ"}, {"rating": 3.0, "review": "It's fast, but that is about all it has going for it - disappointed by poor selection of \"included with Prime\" selections and apps in general.Worth $19? Yes. Worth the $99 Prime subscription? No.", "verified": true, "helpfulness": "0/0", "author": "David I."}, {"rating": 4.0, "review": "The only thing that isn't clear is that you pretty much HAVE TO use the A/C power.  It doesn't suggest that you could use the USB port on your TV.  I guess I could try it but again - its not even a suggestion.", "verified": true, "helpfulness": "0/0", "author": "nh_handyman"}, {"rating": 5.0, "review": "My review may be a little biased as I got in on the $20 offer, so \"free star\" for that. As for the product itself, it's great but it's missing a couple of things. One, it's only power option is the included AC adapter. That takes away some of the convenience of the product. Two, you can't \"cast\" like you can with Chromecast. Not a dealbreaker, but it would have been nice to have. On the plus side, it's great everywhere else. Easy set up and decent enough UI. The included remote is super great (and could only be made better if there was some way to control the volume on the TV). If you've \"bought in\" to the Amazon ecosystem, you'll love this as all of your Prime, Cloud Drive, Prime Music, and Prime Video preferences show up and are easily accessible.", "verified": true, "helpfulness": "1/1", "author": "Terence Polk"}, {"rating": 4.0, "review": "Works very good, but limited on Apps compared to roku, for the price you can't beat it. We use is on the computer monitor in the living room as a second televis n via the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Douglas Koser"}, {"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/1", "author": "Lizmarie"}, {"rating": 1.0, "review": "Couldn't get the device to work and called up Amazon. After having me start and restart my TV, equipment, and WiFi several times, the rep just told me that this device is not compatible with Samsung TV purchased prior to 2013. No, I'm not crazy, he really told me that.", "verified": true, "helpfulness": "394/444", "author": "Dork"}, {"rating": 1.0, "review": "Waste of money. You still have to pay for services. That I can get thru my playstation and pay for. Why pay the extra 36 dollars to do what my playstation can already do.", "verified": false, "helpfulness": "1/11", "author": "Tina"}, {"rating": 3.0, "review": "Netflix pauses occasionally and it doesn't recovering from buffering.Good attempt but it's difficult to separate paid content from free (prime) ones. To be a differentiator they need to release the phone ASAP and make the remote with voice standard.", "verified": true, "helpfulness": "0/0", "author": "Vivek Vallachira \"Vk\""}]