[{"rating": 5.0, "review": "Easy to use and install. Wonderful product", "verified": true, "helpfulness": "0/0", "author": "luckydj \"luckydj\""}, {"rating": 3.0, "review": "Ehh it's aw-ight", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really great", "verified": true, "helpfulness": "0/0", "author": "RaeAnn"}, {"rating": 1.0, "review": "Completely quit working after a month and a half.  Will not connect to wifi even though every other device has no problem.  Tried a factory reset and now it won't even let me sign into my Amazon account.  We thought it was great at first, now very disappointed", "verified": true, "helpfulness": "1/1", "author": "gina"}, {"rating": 2.0, "review": "I keep having connection issues. I used the HDMI extension, resetted the device, and followed the steps on the help page but nothing works. I have cellphones and computers close to the stick and they have strong signal and perfect connection. When the device finds the network it says it has strong signal, but 2 seconds later the network is gone. When connected I can't even use the device because network speed is too slow. Netflix keeps loading after 10 seconds watching.I'm disappointed by this device.", "verified": true, "helpfulness": "0/0", "author": "Tomas S."}, {"rating": 5.0, "review": "Opens one up to other options beyond cable.", "verified": true, "helpfulness": "0/0", "author": "Paul R. Howland"}, {"rating": 4.0, "review": "The installation was a bit more difficult than expected for the Fire TV Stick but I love being able to see my Kindle movies on a much larger screen!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love the item. Fast shipment. Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "prendy"}, {"rating": 5.0, "review": "The best streaming device on the market!", "verified": true, "helpfulness": "0/0", "author": "Angelica"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tina Parker"}]