[{"rating": 2.0, "review": "Just doesn't work good", "verified": true, "helpfulness": "0/1", "author": "marie musacchia"}, {"rating": 3.0, "review": "Potentially a great item, which can make a \"dumb\" tv into a smart tv.  With the access to apps, etc. online as well as via the screen, it COULD be even better than our Vizio smart tv.BUT-  no access to streaming from broadcasters like ABC, CBS, NBC (though there is an app for access to PBS streaming).  Amazon has an app for CBS -but it only works on the Fire Tablet and Android devices.  (which makes one wonder what they are thinking)However, at least as perplexing is that it took 3 rounds of email and an extremely long chat session, in order to find out the above.  (In the 1st email, support said I could download the CBS app -apparently unaware it is not suitable for Firestick.  I learned that online.  In the 2nd email, which pointed that out and asked for a solution, I was told I would have to call -but the agent didn't include a phone number.)So, unless you simply cannot read the fairly simple directions that come with the Firestick, support is really of no help.However, the Firestick DOES make our \"dumb\" HD TV capable of accessing streaming from Netflix, PBS, and streaming from a few of the cable channels that we are subscribed to through our CATV provider.  The assortment of movies available through Prime is OK for my interests, but my wife found very little that she likes (Netflix has a better range).Functionally, it works great, and we'll use it to view Netflix when our trial of Prime expires.  (Actually, we've watched only a couple of things thru Prime in the past 3 weeks.)If Amazon adds apps to access streaming from the basic broadcast networks, and perhaps streaming from a few more CATV channels, this will be a much more useful device.  (for my purposes, the game apps are of no value)", "verified": true, "helpfulness": "1/1", "author": "a guy \"Engineer-type\""}, {"rating": 4.0, "review": "Had this Since pre-launch, love it!  Works out of the box, was considering Apple TV (I'm an admitted Apple nut), or Roku, glad I got this one.  Streaming on my TV works good, there are a few buffering issues I think thats because Comcast stinks and theres not a lot of buffering space on the stick.  Really pushes Prime content but between Prime and Netflix, I am happy, there are a few programs I have go to their networks sites to stream but that is a problem with content deals not the device.Wish the remote was bigger, have lost it several times because its been hiding in plain site or slipped in a crack somewhere", "verified": true, "helpfulness": "1/1", "author": "R. Brackett \"rbrac\""}, {"rating": 5.0, "review": "Super easy to setup and works excellent, priced right.", "verified": true, "helpfulness": "0/0", "author": "beepilot"}, {"rating": 5.0, "review": "Works great...I have no complaints.", "verified": true, "helpfulness": "0/0", "author": "NuJoiseyGurl"}, {"rating": 4.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "Joshua Saperstein"}, {"rating": 5.0, "review": "When we received our Fire TV Stick, it took about 10 minutes to watch Amazon movies and Netflix  with excellant picture and rich sound.  I would recommend this media player to anyone who loves watching movies.", "verified": true, "helpfulness": "0/0", "author": "Jack Bradford"}, {"rating": 4.0, "review": "great, this is the solution to watch kodi and much cheaper than the regular firetv, rate 4 stars because took almost 1 month to be available", "verified": true, "helpfulness": "0/0", "author": "Cesar"}, {"rating": 5.0, "review": "As expected", "verified": true, "helpfulness": "0/0", "author": "Richard Hernandez"}, {"rating": 3.0, "review": "Fire stick has met my expectations and more", "verified": true, "helpfulness": "1/1", "author": "Odette  Lawrence"}]