[{"rating": 5.0, "review": "Its is just what I needed.  Thanks for coming up with such a cool add on.", "verified": true, "helpfulness": "0/0", "author": "Ellen"}, {"rating": 5.0, "review": "It is the best  39 dollars ever spent, works super super well. I am cutting the cord from dish, better picture and sound quality and a tremendous range. The only caveat is that it needs more apps but otherwise, it is very effective. Can use remote or use my ipad to control the stick.5 stars!!!", "verified": true, "helpfulness": "0/0", "author": "Arturo"}, {"rating": 5.0, "review": "Excellent, have not had any problems.", "verified": true, "helpfulness": "0/0", "author": "Emery S"}, {"rating": 5.0, "review": "So far this has been great.", "verified": true, "helpfulness": "0/0", "author": "Lee Campbell"}, {"rating": 5.0, "review": "Great little device for the Tv. Really wish it was USB Powered.", "verified": true, "helpfulness": "0/0", "author": "Kevin Fitzgerald"}, {"rating": 3.0, "review": "So I purchased this to place in my living room as my Google Chromecast is in the bedroom. It works fairly well as a streaming stick but I do have some slight problems with it. First off it's a lot slower than my Chromecast  and buffers a bit more. The second issue is that apps in it will crash to the home screen on random occasions. Finally the lack of Vudu support is unfortunate.", "verified": true, "helpfulness": "0/0", "author": "Seth Chick"}, {"rating": 5.0, "review": "It installed in a matter of minutes and was easy to navigate. Offers a lot of great programs to watch. Definitely makes prime worth it.", "verified": true, "helpfulness": "0/0", "author": "KFed1"}, {"rating": 5.0, "review": "Amazing product", "verified": true, "helpfulness": "0/0", "author": "Carlos \"cam2c\""}, {"rating": 5.0, "review": "Small, compact, easy to use, fast!! Needed Netflix and Amazon Prime for our Vizio (non smart tv). What an inexpensive and simple addition.  Just what I was looking for.  Can easily take this on trips as long at the TV has HDMI slot. Love it!", "verified": true, "helpfulness": "0/0", "author": "beaufam"}, {"rating": 5.0, "review": "Pretty sweet", "verified": true, "helpfulness": "0/0", "author": "Ramiro"}]