[{"rating": 5.0, "review": "Awesome!  A much better selection than Cable of DirectTV,  more Free movies and lower prices on the paid shows.", "verified": true, "helpfulness": "0/0", "author": "Chris Crews"}, {"rating": 5.0, "review": "The Fire Stick exceeded my greatly expectations. It's almost easier to use than the Fire! Amazon has definitely upped the game when it comes to TV watching!!!", "verified": true, "helpfulness": "0/0", "author": "Nona"}, {"rating": 4.0, "review": "I am enjoying the Fire stick. I was disappointed that some of the apps require cable service subscription to watch, though--like Watch Disney and Watch ESPN.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"KKlioness013\""}, {"rating": 5.0, "review": "Great product.  Fast Ship.  Easy set up.  Beware Xfinity/Comcast customers... as HBO Go and Showtime are not made available on Fire TV by this cable subscription provider.  Please note that if you are not already aware of this, the product does have an AC plug that needs to be plugged into an electrical outlet for power.  Netflix and other streaming video is great, and saves me from running my PS4 unnecessarily for those services.  Pandora is great to listen to through the home theater sound system and carries over all of your channels, etc through your Pandora log in.", "verified": true, "helpfulness": "0/0", "author": "LA from Ft Laud, FL"}, {"rating": 5.0, "review": "Easy to install and reliable so far", "verified": true, "helpfulness": "0/0", "author": "Wallace Moulis"}, {"rating": 5.0, "review": "so far", "verified": true, "helpfulness": "0/0", "author": "Joseph Sims"}, {"rating": 5.0, "review": "Worked perfectly,  the fact that it had a remote made it awesome", "verified": true, "helpfulness": "0/0", "author": "Ehi"}, {"rating": 5.0, "review": "Love it so much. It is really worth for $39.99. Strong recommend for my friends :)", "verified": true, "helpfulness": "0/0", "author": "Duy Do"}, {"rating": 4.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "rodney pyle jr"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]