[{"rating": 4.0, "review": "My grandson would like more games and I would like to see more instruction on what can be downloaded and how.", "verified": true, "helpfulness": "0/0", "author": "Terry L. Israel"}, {"rating": 5.0, "review": "This device works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Justin K."}, {"rating": 5.0, "review": "so  far i haven't been able to use it that much, because my kids always have it!  they love it, it is easy to use and was super simple to hook up and get started using it....for someone like me who has prime i think it is the best way to go. wish i had gotten it sooner, now i feel like i get my moneys worth with prime!", "verified": true, "helpfulness": "0/0", "author": "amazonsGR8"}, {"rating": 2.0, "review": "so far not satisfied", "verified": true, "helpfulness": "0/0", "author": "Ed Binkley"}, {"rating": 5.0, "review": "Such a quality product for such a small price! Excellent, I'd recommend it anyone and would buy it again. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "marie c"}, {"rating": 5.0, "review": "Amazing.. More than expected..!!Amazon did a wonderful job with this Fire TV stick..", "verified": true, "helpfulness": "0/0", "author": "Berc"}, {"rating": 3.0, "review": "I have been considering buying a streaming device for awhile now.  It only seemed logical to purchase the fire stick since I was already a prime member.  I do enjoy it, with only a few annoyances.1) I sometimes loose connection.  I am going to blame the stick because all other devices in the house are receiving signals.2) Parental control is kind of annoying.  I feel if the program is something that was already purchased or part of prime then you shouldn't have to put in your password every single time.As a mom who is trying to get things done while kids are watching television, I dislike getting interrupted to type in a password.  Just saying.Other than that I recommend it.  The options are endless to make TV your TV.", "verified": true, "helpfulness": "0/0", "author": "leticia"}, {"rating": 5.0, "review": "Had to get one. No complaints.", "verified": true, "helpfulness": "0/0", "author": "Brenton C. Mckenzie \"Brenton McKenzie\""}, {"rating": 4.0, "review": "Excellent product!  Just What I've been waiting for.", "verified": true, "helpfulness": "0/0", "author": "Mary Munson"}, {"rating": 2.0, "review": "freezes, loses connection with wifi and have to re-start it frequently.. slow to navigate... you have to have it plugged in to the power outlet and defeats the purpose of being a USB stick. Not too happy with. I also have an Apple TV and like it much better but I thought I gave the USB stick a try for my room.", "verified": true, "helpfulness": "0/0", "author": "Danny Montalvo"}]