[{"rating": 5.0, "review": "I'm normally not a fan of Roku boxes or Apple boxes, but I would have to say with my Amazon Prime membership I find that the stick is the perfect solution for my family. We are able to watch netflix, hulu plus and amazon prime with no problem. We also are able to use the app to control the fire stick from our smartphones or using the remote. I would recommend to anyone that doesn't want another box , but would rather have something hidden.", "verified": true, "helpfulness": "0/0", "author": "nhcollegechic"}, {"rating": 1.0, "review": "mine doesn't work.I get the video,no sound @ all.tried it on two separate televisions.sound did not work on either one.Still waiting for Amazon to authorize a return.", "verified": true, "helpfulness": "0/0", "author": "Daughter#1"}, {"rating": 5.0, "review": "Easy to use. No lag time vefore shows are ready to watch!! Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "LISA"}, {"rating": 5.0, "review": "Easy to install, easy to use! I like it much better than Google Chrome!", "verified": true, "helpfulness": "0/0", "author": "Betsy"}, {"rating": 4.0, "review": "So great! Exactly what I was expecting.  So much more versatile than AppleTV", "verified": true, "helpfulness": "0/0", "author": "CK22vd"}, {"rating": 5.0, "review": "I love this, I've been recommending the fire stick to my friends.", "verified": true, "helpfulness": "0/0", "author": "Patricia Grossweiler"}, {"rating": 5.0, "review": "Works very well in our older Sony in the basement.", "verified": true, "helpfulness": "0/0", "author": "Jacob"}, {"rating": 5.0, "review": "happy", "verified": true, "helpfulness": "0/0", "author": "Nathan A."}, {"rating": 1.0, "review": "Fire TV Stick is one of the best interactive internet - TV accessories.  Nevertheless it has too many inconveniences for me.  1) it only works in the USA territory, 2) no navigation on internet allowed (only apps discharged via the Amazon website)  3) cannot download / purchase at full price movies due to region inability.Good things : fast data download, easy to use.My one star is because on a Globalize world, the World should be a Small World after all...", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Ricardo\""}, {"rating": 5.0, "review": "It's pretty great. Haven't had any problems at all. It does what I need it to do, which is access Netflix, with ease.", "verified": true, "helpfulness": "0/0", "author": "Daniel Reichert"}]