[{"rating": 5.0, "review": "Working just like you said it would.  Thanks", "verified": true, "helpfulness": "0/0", "author": "Frank La Scala"}, {"rating": 5.0, "review": "Easy to install... works great", "verified": true, "helpfulness": "0/0", "author": "dion watson"}, {"rating": 4.0, "review": "The remote is tedious, but I downloaded the app on my phone to use as a remote and it's been smooth sailing.  One step closer to breaking up with cable!", "verified": true, "helpfulness": "0/0", "author": "Mandy"}, {"rating": 5.0, "review": "A few years ago some friends of ours passed down their AppleTV and we fell in love with having all of our TV apps in one place and having way more choices than XBox, which also has to be updated every 5 minutes. Problem is, we have two TV's, and constantly unplugging it to use in the other room was becoming an issue. I decided, on a whim, to order the Fire TV stick. It seemed like a decent deal for the price and worth a shot. SO glad my impulse buying is a thing, because the Fire TV Stick is AWESOME. So much better than AppleTV (GASP!) It is ridiculously easy to set up and use, the remote is, in my opinion, WAY better than the tiny Apple TV one (more buttons, feels better in the hand, harder to lose), and the interface just makes sense. You really can't beat this for the price. And now that HBO is a stand-alone, we may actually finally ditch cable. Every time I turn this on, which is pretty much daily now, I'm still super excited to use it and not have to fiddle with the XBox controller or AppleTV (which we now barely use.)", "verified": true, "helpfulness": "0/0", "author": "A. Derway"}, {"rating": 5.0, "review": "I absolutely LOVE my Fire TV Stick.  I haven't had any problems with loading or buffering, like I do on my laptop and now my laptop and tablet are free for me to use while I'm watching something on TV.  Plus now I use my Netflix and HuluPlus accounts more often because it's more convenient.  I would highly recommend the Fire TV Stick if you have any of the online TV watching sites.", "verified": true, "helpfulness": "0/0", "author": "Lifetime Reader"}, {"rating": 5.0, "review": "Love it! Can watch all kinds of movies and TV for free!!!!!!", "verified": true, "helpfulness": "0/0", "author": "beth dagger"}, {"rating": 5.0, "review": "works well!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 1.0, "review": "After researching the fire stick and never reading that it does not work with all brands of TVs, we purchased it for my Samsung 2006 version. Only to realize that even though it has a USB port, it does not support this device.", "verified": true, "helpfulness": "0/0", "author": "Sheri Barrett"}, {"rating": 5.0, "review": "It is great.  Has many more features than chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I wish I had bought it 2 months ago - amazing!", "verified": true, "helpfulness": "0/0", "author": "Heather Rahilly"}]