[{"rating": 3.0, "review": "Way too much buffering. Netflix hardly ever works on the Fire Stick, however my kids Wii-u, that also plays Netflix, doesn't buffer anywhere NEAR as much. Constantly says no network connection, but when I check the other devices in my home, they're all connected. HBOgo may as well not be compatible because it freezes 90% of the time. Takes 30 extra min to watch a movie. The only thing that seems to work ok IS Amazon Library and Prime movies of course. Over all the stick has ok days, but it bad days out weigh the good days. I've been told the Fire TV is much better. MAy try my luck with it instead.", "verified": true, "helpfulness": "0/1", "author": "theladyny"}, {"rating": 5.0, "review": "This thing is nice!!! I wanted a smart tv but didn't want to have to buy a new tv. niw with the fire stick I have a smart tv without the price.", "verified": true, "helpfulness": "0/1", "author": "Sean Caldwell"}, {"rating": 5.0, "review": "Amazing that you can have all these TV shows and movies with prime and only pay 40 dollars for a lifetime!", "verified": true, "helpfulness": "0/1", "author": "Libertarian"}, {"rating": 5.0, "review": "Easy to use, the remote app for your phone is awesome", "verified": true, "helpfulness": "0/1", "author": "Annie Zimmerman"}, {"rating": 5.0, "review": "I use my fire stick every day to watch shows and movies. Very convenient. Easy to use and move to other rooms if needed to.", "verified": true, "helpfulness": "0/1", "author": "Brandi Dover"}, {"rating": 5.0, "review": "Great way to see movies when you are ready to watch them. I am going to drop the movies on cable and use my Amazon fire stick from now on.", "verified": true, "helpfulness": "0/1", "author": "gerry"}, {"rating": 2.0, "review": "Being an Amazon Prime member, I saw the Fire TV Stick as a great opportunity to finally cut the cord on cable/satellite. I signed on to Netflix as way to enhance viewing options. While I didn't encounter as many issues of buffering and cutting out with Prime viewing, I did have quite a few of them with some of the other apps, including Netflix. I upped my internet speed from my ISP and  purchased a WiFi extender with hopes of correcting the problem yet still had issues. I even considered purchasing a new router to see if that would help. I was to the point of thinking I was premature on the idea that it was possible to cut the cord at this time. However, I decided to try a Roku 2 to see if that made a difference. It made ALL the difference!! The Roku did not buffer or cut out once, not once. The Fire TV box may be a better alternative to the Fire TV stick if you want to stick with Amazon products. As for me, I will be purchasing additional Rokus  for the additional TVs in my home. Roku offers many more channels and the ability to watch an entire program without buffering. Plus the cost comparison makes Roku 2 even more attractive:Fire TV Stick $39.99, Roku 2 $59.99, and Fire TV box $99.99. I really wanted to like the stick because there are no visual cords but the Roku box is much smaller than I expected. I cannot address the Roku Stick since I have not tried it. Roku 2 Streaming Media Player (4210R) with Faster Processor (2015 model)", "verified": true, "helpfulness": "0/1", "author": "psat"}, {"rating": 5.0, "review": "The Amazon Fire Stick is perfect for me to watch my Amazon Prime Instant movies. The movies are clear and I have no problem connecting it with my Panasonic TV. best purchase this year!!!", "verified": true, "helpfulness": "0/1", "author": "Lady"}, {"rating": 5.0, "review": "Love it! So simple to set up, works great!", "verified": true, "helpfulness": "0/1", "author": "Debora Martinson"}, {"rating": 5.0, "review": "Works perfect", "verified": true, "helpfulness": "0/1", "author": "Chuck Boroff"}]