[{"rating": 2.0, "review": "I bought this awhile ago but just started to use it yesterday.  At first it worked just fine.  I was watching the second season of Downton Abbey but then it started to buffer and told me my internet connection was too slow.  Since then I cannot watch anything with the Fire TV stick because it insists the internet connection is too slow.  When I check the internet connection, it shows the connection is very good.  I had such high hopes for this product.", "verified": true, "helpfulness": "0/0", "author": "N. Dandro \"Nicks mom\""}, {"rating": 5.0, "review": "technology is just amazing - I cancelled my cable all together......Saving my money now...Let's get the sports on there and we can all relax better.", "verified": true, "helpfulness": "0/0", "author": "Jenny \"jenny\""}, {"rating": 5.0, "review": "Arrived quickly, EASY to install and set up. I am no \"tech-ie\", so simplicity is key! Navigation onscreen is clear and service...so far, so good. Sling TV has a few kinks to work out, but, by their own admission, they are working to improve!", "verified": true, "helpfulness": "0/0", "author": "jscottl"}, {"rating": 2.0, "review": "needs google music.", "verified": true, "helpfulness": "0/1", "author": "Thadd Larue"}, {"rating": 2.0, "review": "Freezes frequently, losses connect with internet connection, picture frozen in place and sound continues, and picture quality is fair. I am not pleased at all. I find the remote difficult keys to small. Would not recommend.", "verified": true, "helpfulness": "0/0", "author": "Sparkle and glitter \"sparkle\""}, {"rating": 5.0, "review": "much quicker and better picture quality than the Roku 2 I was replacing.", "verified": true, "helpfulness": "0/0", "author": "promez"}, {"rating": 4.0, "review": "Very cool to have works great", "verified": true, "helpfulness": "0/0", "author": "dennis"}, {"rating": 5.0, "review": "The best thing I ever bought here on Amazon. Not saying other things were bad but this device is amazing. It's fast responsive and cool", "verified": true, "helpfulness": "0/0", "author": "Alex Wilson"}, {"rating": 3.0, "review": "Works great but interferes with over the air reception", "verified": true, "helpfulness": "0/0", "author": "kris heins"}, {"rating": 5.0, "review": "Very smooth and efficient.  Minimul load time. Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Matthew M."}]