[{"rating": 5.0, "review": "yep, it's awesome.  there should be a lot more in the description about the wealth of services and channels that it connects to.  The free ones.  Only paid services are shown in its description.  I was delightfully surprised to find hundreds of quality free channels.  Far superior to the crap that is on satellite and cable television services.  Best money I ever spent.", "verified": true, "helpfulness": "0/0", "author": "Jeff Herter"}, {"rating": 1.0, "review": "Defective - Tech Support not capable of fixing the problem. $40.00 for a worthless device and over $60.00 in phone bills for worthless \"tech support\".", "verified": true, "helpfulness": "0/0", "author": "elevenken"}, {"rating": 4.0, "review": "Love it . It opens up a whole new avenue of TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I wish this device would live up to its expectations, it constantly loses signal. It always has to buffer or reconnect to the internet connection, will kick you out to the home page whenever. I love Amazon but this product is not really getting my vote of choice, might be switching to a Google Chomecast soon.", "verified": true, "helpfulness": "0/0", "author": "JerBear"}, {"rating": 3.0, "review": "Signal strength is not very good. Have to reposition my router at some point for it to work.", "verified": true, "helpfulness": "0/0", "author": "Tim Apodaca"}, {"rating": 2.0, "review": "Did not know i had to make a purchase to enjoy different movies!!With Fire Stick 😕😕", "verified": true, "helpfulness": "0/0", "author": "MINCEY1961"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Karl B. Pritchett"}, {"rating": 1.0, "review": "I purchased two of these.  They continuously drop off the network, 10+ times per day.  I'm a little skeptical of the other high reviews here, especially the ones that seem like advertisements - because when I search the internet for this issue it seems like there are many other people out there having it - in most cases Amazon sent them a replacement stick.", "verified": true, "helpfulness": "0/0", "author": "Tara S. \"Tara S.\""}, {"rating": 5.0, "review": "My husband and I use it mainly to watch Netflix, Amazon and Hulu Plus. It works very well and it is super easy to install.", "verified": true, "helpfulness": "0/0", "author": "J. MacDonald"}, {"rating": 1.0, "review": "Wont allow me to register.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}]