[{"rating": 5.0, "review": "I originally had ChromeCast hooked to my TV but after multiple issues with having to reboot the stupid thing (because it my tablet kept loosing the signal), I thought I would try the Fire Stick when it came out.  I love it, love it, love it!!!!I can now watch movies and shows off Amazon Prime, some of which are no charge because of my Prime membership; the movies that I do have to pay for are much cheaper then Direct TV's On Demand; with the remote control, everyone who is watching can see the choices and movie descriptions so I don't have to read them out loud; and not only can I access my Netflix and Hulu accounts, but I can also download other movie apps from Amazon for more choices.Get the Fire Stick!! You will NEVER regret it!!!", "verified": true, "helpfulness": "0/0", "author": "itigger \"ccupps\""}, {"rating": 4.0, "review": "Excelente producto!!", "verified": true, "helpfulness": "0/0", "author": "Zoraris Rosario"}, {"rating": 4.0, "review": "The Fire TV Stick is very convenient. I like that you just use a remote and not a phone/tablet/computer screen like you do with Chrome Cast. The only issues I've noticed is that you have to charge this device instead of it drawing power from the TV, which is weird, and the WiFi seems to stutter every once in a while. I know the WiFi is the Fire Stick and not our connection because nothing else has this issue.", "verified": true, "helpfulness": "0/0", "author": "jessica fowler"}, {"rating": 5.0, "review": "Wish I had bought this sooner.", "verified": true, "helpfulness": "0/0", "author": "HJ"}, {"rating": 5.0, "review": "I purchased the Fire TV Stick to side load Kodi. I downloaded the remote control app to my phone to make searches much much quicker.  I still have my Roku3 and my chrome cast, but I enjoy the Fire TV Stick the most.", "verified": true, "helpfulness": "0/0", "author": "Fredy Agron"}, {"rating": 3.0, "review": "somebody help me.my tv : sony 32hx750phone : sony xperia z3when mirroring, screen on but no sound.what should i do?", "verified": true, "helpfulness": "0/0", "author": "minwoo son"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "erick ramirez"}, {"rating": 5.0, "review": "Exelente manera para ver television !!!Exellent way to watch tv at home !!!", "verified": true, "helpfulness": "0/0", "author": "CHRISTIAN"}, {"rating": 5.0, "review": "Bought it. Plugged it in. Works like a charm. So far no issues like the ones I read. Really slick device. Amazon continues to amaze me.", "verified": true, "helpfulness": "0/0", "author": "FLChic"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Keith Jones"}]