[{"rating": 4.0, "review": "I ordered this as a prime exclusive for $20 pre-order and have used it for a day. Overall the product is worth the $20 I spent or $40 retail. However, I use a Google Chromecast as well and still believe that the Google Chromecast is more convenient than this device. Using any Android device and the Google Chromecast, I could send any MP4 video I am watching directly to the TV with no issue. This device only supports it you are using an Amazon Fire device. Also, the Google Chromecast supports mirroring directly from laptop browsing, phone mirroring, and tablet mirroring. These options are very important, but as Google runs Android it is expected that Amazon could not replace the abilities of the Chromecast. Overall, I would have still bought the Google Chromecast but this device is still pretty amazing.Pros:StylishRemoteSame price as ChromecastMore Power than ChromecastGamesCons:You need a power outlet to use the FireStick properlyYouTube is not natively supportedIf you're not a Prime member, this device's streaming abilities are near nothing.", "verified": true, "helpfulness": "1/1", "author": "Kevin J Nguyen"}, {"rating": 3.0, "review": "worked right out of the box post setup for one day, BUT now it says I have an \"authorization\" problem. Several attempts to re enter modem/router password not effective  - still says  \"authorization\" problem  *Do now notice that when I attempt to access amazon video directly from my 2nd gen. KINDLE FiRE HD, it won't open as usual and customary  **So I now believe the problem is on your end somehow.  Help.", "verified": true, "helpfulness": "1/1", "author": "JO KINDL"}, {"rating": 5.0, "review": "This device could not be easier to install, setup and navigate. Simple wins.", "verified": true, "helpfulness": "0/0", "author": "callen \"partschick\""}, {"rating": 5.0, "review": "Works better than anticipated. Voice recognition from the phone app works great too. I love it!", "verified": true, "helpfulness": "0/0", "author": "Linda R"}, {"rating": 2.0, "review": "I really wanted to like the fire stick. So much I bought two. I had occasional problems with the RoKu, but this thing is so much worse. It will not stay connected to the router. I have to restart shows repeatedly. I would have bought another Chromecast, but this had a remote and I liked the idea of the kids setting their own shows since I won't let them use the ipad. I'm glad I bought it on sale or I would be returning the open one. The unopened one is definitely going back. I'm thinking we will put back the Roku. It's slow, but nothing as frustrating as this.", "verified": true, "helpfulness": "1/1", "author": "Kriss"}, {"rating": 5.0, "review": "Turned an older Flat Screen TV into a smart TV within 10 minutes. Product is great, pay attention to video it guides you through the use of remote.", "verified": true, "helpfulness": "0/0", "author": "florida"}, {"rating": 5.0, "review": "Works well,  picture quality seems better than Chrome cast. Remote is a welcome addition.  Does not have you tube app.", "verified": true, "helpfulness": "0/0", "author": "Abhishek Gautam"}, {"rating": 1.0, "review": "Worthless as will not connect to my wireless network after many attempts.", "verified": true, "helpfulness": "2/2", "author": "JB"}, {"rating": 5.0, "review": "Item comes with easy to follow directions. Just plug it into your TV, plug it into the wall, connect to your wireless internet, and you're set. Remote makes it very easy to navigate the menu and it's a nice simple interface. Definitely would recommend to friends and family!", "verified": true, "helpfulness": "0/0", "author": "Courtney L. Fisher"}, {"rating": 5.0, "review": "Great device for what we wanted.....and the price is right!", "verified": true, "helpfulness": "0/0", "author": "mary kay hayward"}]