[{"rating": 5.0, "review": "Simple and easy to use. Interface is easy to navigate for my kids. Shocking how small the actual stick is. Installation could not have been easier.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 2.0, "review": "I bought 2 of the Fire Stick . Gave one to my brother but he already had the Fire TV so he sold it on craigslist. Two days later, i tried the amazon fire stick and and its already Registered the device under my account. I can watch movies for prime member didnt try to buy or rent any movies. But I'm  sure that  It will let u buy the movies without asking for password.  If you plan on buying this Fire Stick for gifts, you better go under your amazon account and Deregister the device .I don't write review ever because of my bad grammar. Its  just im so.................", "verified": true, "helpfulness": "1/1", "author": "Hung"}, {"rating": 1.0, "review": "All other Wi-Fi systems in the house work properly without buffering issues. The Fire Stick does not work for more than 2 minutes without buffering, and it is literally 2 feet from the wireless router. Poor performance. Glad I only paid the $19 versus $39!", "verified": true, "helpfulness": "1/3", "author": "Lawrence Tickner"}, {"rating": 1.0, "review": "YouTube Live Videos not supported on Fire TV Stick.Amazon should fix this ASAP.", "verified": true, "helpfulness": "1/2", "author": "R. Lee"}, {"rating": 3.0, "review": "Not amazing, not as good as Roku...quality issues and lacks the features of Roku.", "verified": true, "helpfulness": "0/0", "author": "Johnny A."}, {"rating": 1.0, "review": "I give this remote 1 star for its failed design with the remote. The case is nearly impossible to open without a tool to put in the batteries. I almost returned the whole thing out of frustration (still might).... I'll change my review if this device turns out amazing", "verified": true, "helpfulness": "2/3", "author": "Wesley"}, {"rating": 2.0, "review": "Preordered and delivered a day early on SundayPrime member so the cost was $20, not $40. No brainerSetup• 4/5 on ease: connect to HDMI, power and connect to Wi-Fi• 3/5 on time: brand new device required a software update and reboot. At my 50Mbps connection, the total time was 12 minutes. The update required a reconnection to Wi-Fi, wiping out the previously setup connection This might not seem like a big deal but with all the Wi-Fi squatters around, I have a long and complicated password. If I have to do this each update, I can tell you it won’t happen.• Overall it was ok. Fix the password reset and we’re good.PLAYBACKHULU Plus• Audio and video lag after each advertisement. Sometimes lasting for 10-15 seconds. Mostly smooth through the rest of the segment with a few blips here and there. In contrast, I don’t recall ever seeing an audio sync or video blip with Chromecast or my Sony Blu-ray playerNETFLIX• No audio glitches• Multiple video pixilation, blue/blur and pause• Remote jumps around on the menu. Sometimes it moves one space per click and other times it moves multiple.ADD ONShowtime Anywhere: DirecTV not supported on this deviceHBO Go: NoINTERFACE• Clunky and non-intuitive. There are too many “smart” menus that shift and I can’t find Netflix or Hulu+ easily. As expected, Prime has a dedicated side menu and easy to reach your queue.• I want to customize the interface. Move options, apps, etc. around. Apple TV is perfect when it comes to an interface. Simple, easy and in your face. Do that. Don’t’ get complicated.EXTENDING LAPTOP• Miracast has limited and not standard access to transmit your screen to the monitor. I was unable to fund a decent Mac options. This is where Chromecast is the clear winner. “Cast” or throw any tab from Google Chrome to the monitor and use Videostream to “Cast” movies, music and more. It’s easy and like a Mac, it just works.FINALGreat to provide Amazon Prime movies. Since I own it, I will keep it.I’ll stick with my Chrome Cast where I can still Cast Prime so I’m not outHere’s the kicker. You have a guest staying and they want to listen to their Pandora, watch their Netflix when they crash out. The only option is Chromecast as it’s powered from the users device, not the “home” account. I have this same beef with SONOS, which I love.Don’t tie to individuals. Everyone has access to everything. Let us play and make changes allowing it to flow the way we want to see it.", "verified": true, "helpfulness": "1/1", "author": "Mark Freytag"}, {"rating": 1.0, "review": "Chrome cast works. This is slow, stalls constantly, Netflix audio difficult figure out and still only occasionally works. Spend the extra money for the chrome cast.", "verified": true, "helpfulness": "0/1", "author": "Scott Smoron"}, {"rating": 2.0, "review": "New Fire TV Stick just got it yesterday. Was working fine but now getting a error while watching any video. Error says \"HDCP unauthorized. Content Disabled\". There is something very wrong with the product. Just noticed similar complaints. Check link : http://www.amazon.com/gp/help/customer/forums/ref=cs_hc_g_tv?ie=UTF8&forumID;=Fx1SKFFP8U1B6N5&cdThread;=Tx1A10FFQXCSZ2M", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 1.0, "review": "My original Nintendo Wii from 2005 has better WiFi functionality than this thing. I'm serious. Like, the Wii is right next to my Fire Stick and streams Netflix without a hiccup and this thing hangs at 25% buffering half the time. Pretty sad. I just want HD streaming. I constantly see 'Connected with Problems' under my network settings even though the device regards the signal strength as 'Very Good'.UPDATE 3/14/15: I took another reviewer's advice and have placed the Fire TV Stick in a static free bag and performance is greatly improved. I'm not increasing my rating, however, because I shouldn't need to do this in the first place.", "verified": true, "helpfulness": "1/2", "author": "Kristopher Wainscott"}]