[{"rating": 5.0, "review": "I am not into setting up any electronics and still ordered this for me to put in by myself.  Well, it was so easy to set up and use!  I have even moved it from one TV to another.  I love movies and this enables me to start a movie earlier in the evening, have lots of choices of movies, watch series that I haven't seen, and not listen to all the commercial breaks.  Now when I want to take a break I can pause the action and come back later with nothing missed.  It is everything that it says it is!", "verified": true, "helpfulness": "1/1", "author": "jestsat"}, {"rating": 5.0, "review": "Awesome gadget.  I looked at the Chromecast and decided against it for many reasons.  I have Prime so when this was on sale, I ordered it.  I have Roku in one room and The Fire Stick on another.  I like the ease of using over Roku.  Roku isn't hard an offers things the Fire Stick doesn't have but I really like how Amazon laid out the menus.  That makes a big differences.", "verified": true, "helpfulness": "0/0", "author": "SE"}, {"rating": 5.0, "review": "Works great- easy to set up. I now have access to Amazon prime , Netflix and others", "verified": true, "helpfulness": "0/0", "author": "Barbara Beech"}, {"rating": 4.0, "review": "Fire stick is a good product. I have both this and the chromecast. I give the fire stick the edge simply because it can operate independently with its own remote and native apps but still allows you to cast. Video looks good from native apps as well as cast. I do find the fire stick a little slow to boot and open apps and sometimes it seems to want to stop playback and buffer more than expected. Overall it's a solid product for the price.", "verified": true, "helpfulness": "0/0", "author": "Jason m. Gilbert"}, {"rating": 1.0, "review": "Great product, good materials, quality and packaging. I would like a little more of content free, it is overly oriented to Prime users. I'm in Argentina and the Prime  service is not so useful here to pay the service by year.Hope a future release with more free content.Sincerely.", "verified": true, "helpfulness": "0/0", "author": "Estefania Ghirardotto"}, {"rating": 5.0, "review": "Bought this for my parents so they could watch Netflix on the living room TV. (They don't understand the concept of watching it on their laptops). Works fantastic, couldn't have asked for a better product. Easy to install, just plug it in, and go!", "verified": true, "helpfulness": "0/0", "author": "RWendows"}, {"rating": 5.0, "review": "I absolutely love this! First my space is limited for anymore equipment even though I have a flat screen so size wise it is perfect and you not only have simple written instructions but there is also a great tutorial and you can easily take out and use on different tvs throughout that have HDMI slot. Also the price is great! Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "lezette williams"}, {"rating": 2.0, "review": "I want to love the Fire Stick, I really do. I love the concept of it. Execution, not so much. The picture is grainy and the signal cuts out...a whole lot.I find myself resorting to watching shows on my phone which is very frustrating since my Fire Stick is connected to my big screen TV.", "verified": true, "helpfulness": "0/0", "author": "LEONARDOVERSE \"Leonardo Ramirez\""}, {"rating": 1.0, "review": "I was having problems setting this up and no instructions no phone number nothing. I looked up information on the Internet and again no information. Terrible", "verified": true, "helpfulness": "0/0", "author": "Sheri Snyder"}, {"rating": 3.0, "review": "It has started to lag for me and not sure what the cause is.  Speed is still the same for internet.", "verified": true, "helpfulness": "0/0", "author": "Michael Bixler"}]