[{"rating": 4.0, "review": "Works great and it is small.", "verified": true, "helpfulness": "0/1", "author": "Ablaze PowerSports"}, {"rating": 5.0, "review": "I was using an LG DVD Blueray player for my Amazon Prime Instant Videos and it would constantly stop playing to buffer the content.  This Fire TV Stick has been amazing!  Easy set up and a wonderful picture.  The menu is easy to navigate and I am anxiously awaiting the IOS app to be able to use the voice recognition search features.  I also think the screen saver pictures are so beautiful and look great on an HD 55\" tv!", "verified": true, "helpfulness": "0/0", "author": "spotter84"}, {"rating": 1.0, "review": "Not ready for prime time: it drops connections often and does not compare to the features of other streaming devices such as Roku!", "verified": false, "helpfulness": "3/8", "author": "Paper Boy"}, {"rating": 2.0, "review": "This is just another stick.  The $20 promotional price is the big attraction here. This is a terrific value at this price.  At $39, the stick is nothing special.  I would look at alternatives prior to buying at this price.", "verified": true, "helpfulness": "1/4", "author": "z"}, {"rating": 5.0, "review": "Great device very easy to use and got two weeks before the orginal shipping date", "verified": true, "helpfulness": "0/0", "author": "Michael S. S"}, {"rating": 3.0, "review": "It registered itself for Prime and charged me 99.00 without asking.", "verified": true, "helpfulness": "0/2", "author": "Jay R. Degenkolb"}, {"rating": 1.0, "review": "Nice that our cloud stuff is so easily accessable but we bought 2 for streaming movies and at that the Fire TV Stick fails miserably. All streaming video is choppy and constantly buffering. We will go back to our old streaming devices and hope Amazon comes up with a fix for this issue.", "verified": true, "helpfulness": "2/5", "author": "Danny Iris"}, {"rating": 5.0, "review": "Fast delivery, easy to use, handy little remote. Only complaint is that it really prefers to be plugged into the wall all the time, even though it would be more convenient if you could just leave it plugged into the USB port of the TV (you can, it just complains every time you start it up and it doesn't get automatic updates while you aren't watching).Our internet isn't overly quick (only about 7mbp down), and the initial update seemed to take forever but it has ran flawlessly since. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Red RN"}, {"rating": 4.0, "review": "I discovered something important that may explain some peoples issues.On one TV I comnected direct to the HDMI outlet on the TV, everything worked flawlessly. Then I connected it with HDMI but this time through my AV receiver and the whole experience slowed down drastically with drops in the streaming. FYI on each of these setups I used the power option , not USB.So it's performance really depends on your set up. With the direct HDMI connection this little thing is amazing. !", "verified": true, "helpfulness": "0/0", "author": "Andrew I. Munro Sr."}, {"rating": 5.0, "review": "Got the Amazon Fire TV Stick just before leaving on a family trip for the holiday week.  Easy set up and love being able to travel with the Amazon Fire TV stick.  We love being able to enjoy our favorite movies and TV series while traveling.  Would highly recommend this product.  Thanks Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "browneyedgirl"}]