[{"rating": 1.0, "review": "I was very disappointed with the Fire TV stick. Even after talking to support at Amazon, they told me themselves that the \"mirror\" function, even with an Amazon tablet, is flakey at best. The solution is a hard-reset of both units! Apparently there is some memory corruption that occurs. I have 30+ years of computer and networking experience, and after futzing with this thing for 2 hours I have up. Also, it frequently \"freezes\" during playback, and I'm guessing it is due to the fact that 1) Hardwired networking isn't an option and 2) the built-in antennas don't work well. The unit is only about 20 feet from a router on a 100mbps internet connection. I never had a playback problem before with my WD TV player even though it is also wireless in the same spot. It was a big mother's day gift FLOP! I want my 2 hours of life back!", "verified": true, "helpfulness": "1/1", "author": "Amy"}, {"rating": 2.0, "review": "It works great as well as the regular Fire TV box as long as they are both within a close distance to the Internet connection. Other than that they are both Fantastic devises", "verified": true, "helpfulness": "0/0", "author": "Ron Dieter"}, {"rating": 2.0, "review": "I should have throughly read the specs, this device does not live up to its big brother, (box) I need bluetooth connection for headphones and keyboard;  this device does not do that. Also, the processor is smaller. Overall, if you are going to buy a streaming device, spend the extra money on the Amazon Fire TV box; I have one and hopefully, I can sell the stick and buy another box.", "verified": true, "helpfulness": "0/0", "author": "Paul E. Washington \"Pdub76\""}, {"rating": 5.0, "review": "It works great and is easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "Kathryn Kearns"}, {"rating": 4.0, "review": "Overall, I am glad that I purchased the Fire TV Stick. It is very easy to use, doesn't take up any space (as opposed to a wifi enabled DVD player), is fast, and I can take advantage of my Prime subscription on my TV. The remote buttons, on the other hand, started to squeak and stick the same day I opened the box and set up the system. Also, unbeknownst to me prior to ordering the Fire TV Stick, COMCAST does not support HBO Go or Showtime Anytime on this device. Bummer.", "verified": true, "helpfulness": "0/0", "author": "Whitney"}, {"rating": 5.0, "review": "I love this I get to watch shows that I want to watch & not pay for things I don't want", "verified": true, "helpfulness": "0/0", "author": "jc"}, {"rating": 5.0, "review": "Love it, took a little while to get used to how it worked. Lots of videos on YouTube to help you understand how to use it. Great device.", "verified": true, "helpfulness": "0/0", "author": "Claude hepworth"}, {"rating": 5.0, "review": "I previously used the Wii gaming system to connect to Netflix, Hulu, Amazon Prime, and YouTube. It was my gateway into cable-free living. I went cold turkey and at the time, it was just the system I needed to get me through my cable withdrawls. But, over time it became less and less reliable, it just wasn't connecting. Freedom was being replaced with frustration. I even considered cable again. (GASP!) Then I heard there were other fish in the sea, ones that would connect, be consistent, more reliable. That's when I found fire. I asked around for some opinions because sometimes when you're looking for something new, you overlook some drawbacks. The feedback was positive! I am happy to report that fire and I have been strongly connected since Mother's Day and it has successfully kept me away from ever considering cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very Easy to install and use , and I can access my prime account and view my movies and tv shows in my library. Very satisfied", "verified": true, "helpfulness": "0/0", "author": "Fred Salinas"}, {"rating": 3.0, "review": "Not what It said on the description not happy", "verified": true, "helpfulness": "0/0", "author": "Epigmenio Saenz"}]