[{"rating": 5.0, "review": "I'm on the road a lot for work. I've tried other \"sticks\" but none of them work with hotel wifi. THE FIRE STICK DOES!!!! I love it. All my streaming in a hotel room with the crappy, free, hotel wifi!! I love this stick!", "verified": true, "helpfulness": "0/1", "author": "Badkarma013"}, {"rating": 3.0, "review": "When the firestick works, it's great, but it has a lot of connectivity issues with my router even when my other devices are working perfectly. I might switch to google's chromecast, but for now I am using the firestick.", "verified": true, "helpfulness": "0/0", "author": "Blake Cole"}, {"rating": 5.0, "review": "Love the programs available. Was easy to install", "verified": true, "helpfulness": "0/0", "author": "charlotte ruderman"}, {"rating": 5.0, "review": "Love it, and now I can watch amazon prime shows and neflix without having a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Kelcie K."}, {"rating": 5.0, "review": "Purchased this to replace my older Roku. It was very simple to set up and has nice parental controls. Very easy to operate. I like how you're able to listen to your amazon music and view photos stored on your cloud. Access to Netflix, Amazon Instant Video and also apps from the app market. Happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Anon81"}, {"rating": 5.0, "review": "I like this is amazing", "verified": true, "helpfulness": "0/0", "author": "Fini"}, {"rating": 4.0, "review": "Very good cost/performance ratio. Not the premium buffering and navigation performance, but for $39 it is absolutely a great value and it is functioning as expected.", "verified": true, "helpfulness": "0/0", "author": "it's a good note taker"}, {"rating": 5.0, "review": "First time with the stick and I love it", "verified": true, "helpfulness": "0/0", "author": "David Nielsen"}, {"rating": 5.0, "review": "AWESOME!! Everything I expected and more!! Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Tasha Redick"}, {"rating": 5.0, "review": "I love the Fire Stick!  It was easy to set up and use.  Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "earlydog \"Earlydog\""}]