[{"rating": 4.0, "review": "This is a great alternative to cable. You have access to a lot of types of channels.", "verified": true, "helpfulness": "0/0", "author": "Jae"}, {"rating": 1.0, "review": "Was not impressed with.", "verified": true, "helpfulness": "0/0", "author": "M. Rosas"}, {"rating": 1.0, "review": "DO NOT PURCHASE THIS DEVISE IF YOU DON'T HAVE A NEW TELEVISION.  Buried somewhere in the use agreement is a statement that the devise will not work with televisions that don't have a chip that blocks unlimited recording of downloaded items.  Additionally, when the Fire Stick is first purchased, it works perfectly.  Only after months of use does the user learn that the older (two or three years old) television is not compatible.  I spend thousands of dollars annually on Amazon, and due to this blatant misrepresentation, it will now be tens.of dollars or less.", "verified": true, "helpfulness": "0/0", "author": "Mark C. Sanchez"}, {"rating": 5.0, "review": "exactly as described.  Just what we wanted.", "verified": true, "helpfulness": "0/0", "author": "Mari"}, {"rating": 4.0, "review": "Nice device. I own a chromecast but this addsfunctionality to my tv without needing cable.", "verified": true, "helpfulness": "0/0", "author": "Elaniece Alstork"}, {"rating": 5.0, "review": "awesome, super easy to use", "verified": true, "helpfulness": "0/0", "author": "shawn bernard hartwig \"Cooking, Sports, and far out tales, what else is there?\""}, {"rating": 5.0, "review": "Best way to stream Amazon Prime.  I've only rarely had connection issues and even then only for brief periods.  Just make sure you remember where you left the remote!", "verified": true, "helpfulness": "0/0", "author": "Justarasta"}, {"rating": 5.0, "review": "This is great for watching Prime TV.  It does everything it is expected to do.  Easy to set up and easy to move to a different TV set.", "verified": true, "helpfulness": "0/0", "author": "D. Frank"}, {"rating": 3.0, "review": "Works as advertised but very disappointed with the fact that you cannot use your home theater system for improved surround sound quality. Something they do not advertise. The sound quality is just as poor as watching a movie on a standard TV.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 3.0, "review": "Sir/Ma'am,I've lost track of how many times this device has frozen in the middle of a show, forcing me to pull the plug to reset.The most recent issue is that after freezing while watching something it is telling me that \"home is currently unavailable\" and to check my network settings if I hit the home button (thinking it may have been an issue with Hulu or Netflix, and not the firestick). Done.  It shows a strong network connection.  Still no home screen available. Other network devices are functioning as normal.  Even my 8 yr old laptop that survived 16 months in Baghdad can still boot and stream without freezing...  It's not the providers or my network. The only issue is with the firestick.  Unplugging it and plugging it back in is getting old...but it works again.  We shouldn't have to do this every day.", "verified": true, "helpfulness": "0/0", "author": "eternalgreenknight \"Chris\""}]