[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Daphine Hollins"}, {"rating": 5.0, "review": "Easy to install. A great product for a good price. Very well worth it.", "verified": true, "helpfulness": "0/0", "author": "Elena Kozlov"}, {"rating": 4.0, "review": "like it, but it does freeze up at times.", "verified": true, "helpfulness": "0/0", "author": "trese"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Channy Figueroa"}, {"rating": 1.0, "review": "doesn't do what I expected", "verified": true, "helpfulness": "0/0", "author": "Lonnie"}, {"rating": 5.0, "review": "Thats what I was looking for. Especially as it comes with Remote even younger kids can play. On top of it Child lock helps to restrict adult contents for them.", "verified": true, "helpfulness": "0/0", "author": "Vijay K. Jaiswal \"Newbie\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Duc H. Nguyen"}, {"rating": 5.0, "review": "Amazon Fire TV Stick Works great and was shipped on time. Love the portability", "verified": true, "helpfulness": "0/0", "author": "Jeffery E. Catalucci"}, {"rating": 4.0, "review": "I love this thing!  The only downfall is that many of the apps are still not compatible with certain cable companies (I can't use the showtime app because it doesn't offer Charter as a choice for cable providers, etc.).  That would be the only thing to make the Fire Stick better, along with an Xfinity app (there just isn't one for the Fire Stick, but there's one for my kindle).  But I just mirror my kindle with my tv and can watch everything that way.  Therefore, if you don't have another Amazon product, like a tablet, you should go with another streaming device.  Otherwise this is one of the best purchases I've ever made, I don't know why people still have cable!As a sidenote:  the way this product is listed it misled me to thinking that the voice command remote was included.  It is not, you have to purchase that seperately, just fair warning.", "verified": true, "helpfulness": "0/0", "author": "Audra O'Brien"}, {"rating": 5.0, "review": "It is very comparable to the Fire TV! I haven't used it like I do my Fire TV, but I love it so far!", "verified": true, "helpfulness": "0/0", "author": "Randy Wintjen"}]