[{"rating": 3.0, "review": "I previously had a Chromecast, and was going to buy another one when I saw the Fire TV Stick.  It plays Spotify, gives me my Amazon Prime video, and the usual Netflix, et al.  It looked too good to be true.Sadly, it was.  It does* play all of the things that it says, and I really only have two complaints with it.1) When I'm casting Spotify or other things from my phone/tablet, it doesn't change my TV over to the correct input (which Chromecast does). Annoying, but I can deal with it.2) This one is huge.  Amazon has failed to get an agreement with Comcast for HBO Go.  This means that you can't play HBO Go on your Fire TV Stick if you have Comcast.  It seems like EVERY other cable company subscriber can watch HBO Go on their Fire Stick, but if you're stuck with the LARGEST cable provider in the country, you're screwed.  Fix this, Amazon.  I'm almost certainly going to return one of the two that I bought, and I'm seriously considering returning the second one, too.", "verified": true, "helpfulness": "0/0", "author": "David Raabe"}, {"rating": 5.0, "review": "I am very impressed. I think that Amazon created something very special here. I bought the fire stick to try it out, fully knowing that I would forego the voice button on the remote.  Well, it's on the very organic app that feels like a lot of time went into making the phone give feedback, and yes, the pull down activates listening mode. When you let go, it fetches in a second!The stick came with a very high quality flexible dongle for easier plug in even behind wall mounted TVs. It's standard micro usb and even the included USB charger looks special, like somebody cared.I love how fast the interface is, and the video quality is excellent. This new purchase replaces a lesser Roku that didn't have true HD, and not 1080p. Big difference in the quality, and the interface is MUCH faster.I also have to applaud the way that it scrolls.  Very smooth and fast.No regrets, easy to set up. Love the app.Try one for yourself. I have prime but this also works for Hulu plus and Netflix as well as HBO GO.", "verified": true, "helpfulness": "0/0", "author": "M. Damm"}, {"rating": 1.0, "review": "It's ridiculous after receiving I came to know this device can't be used in middle East due to license error issues.", "verified": true, "helpfulness": "0/0", "author": "khurram"}, {"rating": 3.0, "review": "I ordered the Fire TV Stick before release and received it just after release for the discount price of about $20. Right away, the HDMI extender worked well but then stopped working about two weeks into use. The Fire stick worked really well with Amazon Prime. Very fast load--faster than my best PC or Mac and faster than my Roku 3.  At first the Netflix app took longer to load than my other devices which includes an Apple TV device. After a few months, the Netflix app on the Fire stick sped up and now loads pretty fast. I also tested this against three Blu Ray players made by Samsung, Panasonic, and LG. The Fire stick worked faster and better than all the Blu Ray players I've tested. That is except the Oppo 103 I've installed in rich people's homes. That is the best device I've tested yet.So, why do I write a review this far into my Fire stick ownership? Well, the performance of the stick has deteriorated to the point of uselessness for me. The stick still loads stuff quickly and I love that it has CEC capability. However, using Amazon Prime and Netflix on the stick fails because the video freezes every few minutes and the audio drops out. So, I miss some words in the dialogue and then the video speeds up to catch up after the freeze. This happens reliably every show I watch. This behavior is not present using the same WiFI signal I use for the Roku 3, the BluRay players, the Apple TV, and my computers. No, I don't use them all at once. I also tend to turn off my cell phone's WiFi when I'm using streaming just to reserve all possible bandwidth for the video I'm watching. So, Amazon support tells me nobody else has ever reported this problem. Oh well, I'll try my Fire TV Stick on another WiFI network with even stronger signals and see if it works better. Otherwise, $20 bucks down the drain", "verified": true, "helpfulness": "0/0", "author": "David J. Riffle \"TV dude\""}, {"rating": 5.0, "review": "plugged it into my tv hdmi connection and it worked right away!", "verified": true, "helpfulness": "0/0", "author": "cartero"}, {"rating": 5.0, "review": "I wanted to try the fire TV but didn't want to spend a lot. I opted for the fire stick and I am not disappointed. Its a great little streaming device. I have even used it in hotels on lg TVs and it works on the hotel WiFi. I tried connecting my Chromecast and Xbox and neither worked. I take it with me whenever I travel.and I like that you can sideload apps to it, some work better then others.  I'm going to order more as gifts for family and friends. I don't own a fire TV but its on my to buy list now.", "verified": true, "helpfulness": "1/1", "author": "JJ"}, {"rating": 2.0, "review": "Buffers then stops", "verified": true, "helpfulness": "0/0", "author": "Leah Beth Ramsaur"}, {"rating": 4.0, "review": "I have a chromecast, and didn't really want another, but couldn't pass up the grand release sale to add another gadget to the collection.  I know have both hooked up to the TV, and much to my surprise, use this almost exclusively over the Chromecast.  99% of our use is Netflix, though we now watch more Prime since it is easily accessible, and something about having a remote just makes it our go-to over Chromecast. There are still some times when Chromecast is the only one that will work, and there are still times when the Fire TV Stick will free, or more often the streaming \"stutters\", but in general, have been very pleasantly surprised.  I do wish there was a way to turn off the display of for-purchase content so that I don't even see those items when I'm browsing, but I can mostly work around it.  If this was introduced - it might just tip me into 5 star territory.", "verified": true, "helpfulness": "1/1", "author": "Kyle"}, {"rating": 1.0, "review": "It constantly disconnects from wifi, even with good signal and no interference. Seems to be a common problem.", "verified": true, "helpfulness": "0/0", "author": "jonlong"}, {"rating": 5.0, "review": "I'm very happy with the features so far.  You can't beat the price for what it does.", "verified": true, "helpfulness": "0/0", "author": "Michael"}]