[{"rating": 1.0, "review": "The fire stick would never connect to any of the apps.", "verified": true, "helpfulness": "0/0", "author": "Zachary N. Schuyler \"Movie Maker\""}, {"rating": 5.0, "review": "better than I thought it woulored be - very easy to use - only draw back is I sit in front of the TV more", "verified": true, "helpfulness": "0/0", "author": "Judy Mohan"}, {"rating": 5.0, "review": "This is my absolute fave streaming device right now!  It is small, portable, and it has wide selection of apps.  The friendly UI makes navigation a cinch, and remote is very responsive unlike others I've tried.  I highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Tonya"}, {"rating": 5.0, "review": "Love, Love, love the Fire TV stick.  Bought it to replace our old Roku device.  This is amazing and by far is so much better than Roku could even dream of being.  The remote works really well even with the stick behind the TV. The Android phone app is awesome!  You can control the stick from this App with great ease.  Movies and shows load super fast and playback is crisp and clear without any interruptions.  You can pause easily, fast forward, rewind, all with easy and it is super smooth.", "verified": true, "helpfulness": "0/0", "author": "Charles Z. Crumpler"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 4.0, "review": "I like because it works well and its not a  large remote to handle and I do not have to go on line to activate like the chrome cast..", "verified": true, "helpfulness": "0/0", "author": "toni"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Ronald Porter Jr"}, {"rating": 5.0, "review": "really easy to use and love the remote. not a lot of options as to free stuff though...", "verified": true, "helpfulness": "0/0", "author": "colleen"}, {"rating": 5.0, "review": "Easy to set up  Great price", "verified": true, "helpfulness": "0/0", "author": "Bella Caldara"}, {"rating": 2.0, "review": "It is usable with very limited apps and stations.  Narrow field of choices with overt pressure to view Amazon Prime video and token nods to Hulu and Netflix.  I wish I had bought a second Roku.Stick is difficult to navigate through other apps except for prime.  There is currently no connection to Vudu or M-go where past purchases for me are", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]