[{"rating": 5.0, "review": "Great value for the money. I tried the roku stick and roku 3 but returned both. This little stick is pretty slick.", "verified": true, "helpfulness": "0/0", "author": "Terron Scott Andrews"}, {"rating": 4.0, "review": "I AM VERY HAPPY WITH MY AMAZON FIRE STICK", "verified": true, "helpfulness": "0/0", "author": "Larry Leombruno"}, {"rating": 5.0, "review": "Awesome product!!", "verified": true, "helpfulness": "0/0", "author": "ruatech2"}, {"rating": 5.0, "review": "I bought the Fire Stick together with the Fire TV box.  The big box was for the house and the stick, hopefully, would be for traveling.  Recently, we took a week-long trip with one of our grandchildren and I decided to give the Fire stick a try over the hotel Internet.  Fortunately, the hotel TV had an open HDMI port, which I was able to access without any problem.  Initial set up took a little time for the stick to download and install software updates, but that went smoothly.  I had no trouble connecting with the hotel WiFi and throughout speeds were good.  The Stik worked just as advertised, high resolution, fast response, not a single hiccup.  I also downloaded the free companion remote app on both my android phone and iPad.  For some reason, the Apple app couldn't find and connect with the Fire Stick so I can't speak to its functioning, but the Android phone app immediately found and connected with it.  Be aware that the app will query the Fire stick and give you a security code on the TV to enter before connecting to handshake with your device and ensure that your next door neighbor isn't using his remote app to hijack your programming.  The remote app was fantastic!  I found it easier to use than the included remote and it has the full voice search capability that the stick remote doesn't.  I use the voice search all the time with my Fire TV remote and really appreciated that capability on the Fire stick app.  I also noted that the app will work on both the Fire Stick and Fire TV and will search for any Fire devices broadcasting and allow you to select which one you want to connect with for that session, making it pretty much a universal remote for either of the devices.  The only uncomfortable thing about the stick is that it requires AC power to operate, unlike some other streaming devices that are powered directly from the TV's HDMI port.  That wasn't a deal breaker for me, more of a minor inconvenience.  In the future, I plan to side load some additional software on the stick to give me access to additional programming.  All in all, I highly recommend the Fire Stick, especially if you are a Prime member and tend to default to Amazon streaming.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I like it better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Dr. Kats"}, {"rating": 3.0, "review": "The Fire Stick is a great concept and a nice alternative to the expense of cable television. The only ongoing issue that we seem to be suffering from is that Sling keeps prompting for the software to be updated but it says it has the latest version. The software has not been updated since (I believe March) and Sling TV keeps locking up and/or crashing. This has been rather irritating and I am hoping the software is updated soon so eliminate this problem. Other than that, it's great. There are new shows being added regularly to diversify viewing options for every kind of taste. I see this as being the future of television.", "verified": true, "helpfulness": "0/0", "author": "Tanya"}, {"rating": 5.0, "review": "It really works great. My only complaint is why do I have to pay for the final season of \"Justified\"?", "verified": true, "helpfulness": "0/0", "author": "Robert M. Squier"}, {"rating": 5.0, "review": "Excellent video streaming device!!", "verified": true, "helpfulness": "0/0", "author": "WIL RIVERA"}, {"rating": 5.0, "review": "Great product,  arrived as requested", "verified": true, "helpfulness": "0/0", "author": "Doug Needham"}, {"rating": 2.0, "review": "Jumps a lot seams to be slow.", "verified": true, "helpfulness": "0/0", "author": "kenny boone"}]