[{"rating": 5.0, "review": "No need for another spec review. I've had a chromecast since they came out so that's my point of comparison-Amazon \"recommends\" you use the actual plug to power the stick, which is far less convenient than using a usb port on the back of the TV (like you can do with the chromecast). We tend to move the chromecast from room to room sometimes and this will make that a far bigger pain.-The second time I used it I got HDCP issues (blue screen with error message) when I tried to play content. I think it was just a connector issue. It resolved after unplugging and plugging it in a couple times and cycling TV on/off. I havent had this problem with any other HDMI connected device, ever.-With the chromecast, you get the sense that it is only a medium for whatever content you're telling it to play from your phone/tablet. With the stick, it certainly feels more like an individual device with it's content menu and provided remote. This will make it slightly easier to manage content as a parent coming and going. With the chromecast, it's a bit of an awkward handoff trying to control the device from your phone if it was started by a different phone. (Trying to pause something!!)-(So far) The companion phone app feels pretty useless except for text entry and voice search, though I haven't tried the latter and don't really plan to.", "verified": true, "helpfulness": "4/6", "author": "HM"}, {"rating": 4.0, "review": "Less than ten meters from the access point, running off a 10w wall wart, network still keeps dropping. I have tried every combination of network settings to no avail. Being consistent is only a plus when it consistently works.UPDATE: Per tech support, I put that little extender on the stick, and it turns out that being a few inches further from my television fixed the WiFi issues. With that fixed, this really is a great little gizmo.", "verified": true, "helpfulness": "1/4", "author": "T. Balsley"}, {"rating": 5.0, "review": "It was very easy to set up and I love how much better this is than having to plug in my Fire HD (first gen) to stream.  It frees up my other device so my goddaughter can watch her cartoons while someone else uses that Kindle.  I like the apps that are available and the interface is pretty straightforward.  I like how I can set the screen saver to randomly cycle through my cloud photos.  Pictures look nice on there and navigation of my cloud photo albums is pretty easy.  I like that I can listen to music while navigating menus and browsing my pictures.  An amazing value at the Prime introductory price I paid ($19) but I would have probably bought it at $39 anyway because I didn't really want to have to pay $99 for the Fire TV.", "verified": true, "helpfulness": "3/4", "author": "Elaine B."}, {"rating": 1.0, "review": "UPDATE 2-8-2015This device has become a real pain! it keep telling me there is no wifi but my roku, Chormecast and and built in Netflix work fine with plenty of signal. And when it does work, it tells me halfway through a program/movie that the rest of the  program is unavailable so I have to switch to  my Chromecast, Roku or  the built in Netflix to finish watching.It has gotten to the point where I will have to throw it into the trash, it is past Amazon't reutrn date and is now useless!Obviously, I not longer reccomend this device...........................This really is (WAS) a nice device that I like a lot, however, as good as it is, there are some negatives to consider.....Pluses.The device itself is very nice, easy to set-up though the inital set-up was pretty slow, it came pre-registered which I appreciated a lot.It has some of the features I like such as Netflix, PBS, prime videos etc.The picture quality is amazingPrograms start up with little lag.The remote is incredibly easy to use and well laid out.I also love the photography on the screen saver, that alone is worth watching if you appreciate good photography.NegativesIf you are using WIndows devices, it WILL NOT cast anything to your TV and this, cannot replace Chromecast and I think this is a huge mistake by Amazon because they actually compare it to Chromecast.In the product comparison, it shows it to be miracast compatible, but if you are using Windows 8.1 it is not.Strangely, it  says an ios app will be available soon, but no mention of WIndows.So I may end up going back to my ROKU and Chrokecast becase as neat as this is, there is not much of an advantage without being able to cast from my WIndows 8.1 Laptop to my TV.I think this will make a great stocking stuffer for someone else but at the moment as it currently stands, it is NOT the right device for me.", "verified": true, "helpfulness": "1/3", "author": "Brian M. Edwards"}, {"rating": 3.0, "review": "Well it works but not as well as a Roku stick. I have used both on the same tv and in the same house location. The Fire TV stick is more likely to stop playing and buffer and it's remote is more cumbersome to use and the menu is less intuitive in the way you navigate from app to app. I am overall disappointed with the Amazon product as it is not as good as the Roku. It has better specs but that does not tell the whole story in this case. On paper the Amazon Fire TV stick should be superior by a wide margin. In use however it is lacking in being user friendly and overall performance.", "verified": true, "helpfulness": "1/2", "author": "E. Golden \"Gene Golden\""}, {"rating": 5.0, "review": "This device performs as well as Amazon says it does. And I like it far better than my Chromecast. HOwever I do have a few minor complaints. One would be where the USB port is located on the stick. Because of this location I have to have the USB port on top of the stick while it is plugged into my TV. Minor I know but I like my wiring to look as clean as possible. And the second one is the forcing me to watch the intro video. Again minor but annoying. But overall the performance is quite good.", "verified": true, "helpfulness": "1/2", "author": "Sol McNally"}, {"rating": 5.0, "review": "hopefully more apps get added..seems much faster than roku stick but lacking the apps!", "verified": true, "helpfulness": "0/2", "author": "Brent J. Old"}, {"rating": 5.0, "review": "We were using our PS3 to stream Amazon, Netflix, etc.This works in a similar fashion.  Took about 5 minutes to  plug it in and get it running (honestly, the worst part was getting the batteries in the remote).", "verified": true, "helpfulness": "1/2", "author": "J. White"}, {"rating": 5.0, "review": "The FireTV Stick seems to be every bit as functional as it's older sibling, the Fire TV box - which I also have. Although it lacks the USB, optical, and ethernet ports of the set top box, if you don't require those things and are fine on WIFI - there's no noticeable difference in operation or processing power. The remote is a simplified version of the one that comes with the STB - sans the voice control - but perfectly functional. And I've been able to download the Fire TV Remote app to my phone and tablets and it functions perfectly with both devices. Sideloading of apps (like TVMC) works just as it did with the STB. At $19, I'm glad I bought 2! I will be buying several more for the other TVs in the house as well as for Christmas gifts this year. Too bad Amazon is backordered and I will have to purchase those at other retailers in order to have them in time. I currently have Apple TV and Roku - and I think the Fire TV Stick could win this race. The only thing I'd REALLY love is to have the Time Warner Cable (TWC) app function on this and I wouldn't need any of my Roku's. I look forward to further development of apps and content on this device.", "verified": true, "helpfulness": "3/4", "author": "D. Snedigar"}, {"rating": 1.0, "review": "I am glad I only paid $19 for this.Set up was a pain (as highlighted by other reviewers).  It took me 45 minutes to make it work, and never told me what the problem was (likely that it had weak WiFi).  It was only once I decided to move my TV close to the router that it picked up the software update and allowed me to start watching something.Interestingly, Chromecast works just fine in my den and the speed and picture quality look the same.  Oh well... hardware spec aren't everything after all.  Back to watching Netflix on my Chromecast.", "verified": true, "helpfulness": "12/20", "author": "Antoine"}]