[{"rating": 5.0, "review": "liking it so far", "verified": true, "helpfulness": "0/0", "author": "david tisue"}, {"rating": 5.0, "review": "Amazing gadget - I love it!", "verified": true, "helpfulness": "0/0", "author": "Cindy T \"smile!\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "BRIAN HARKEY"}, {"rating": 4.0, "review": "great product and a buch of apps to choose from. i wish you were able to cast other apps from your phone to it though", "verified": true, "helpfulness": "0/0", "author": "Ellis"}, {"rating": 5.0, "review": "Loving all our viewing options the fire stick offers.", "verified": true, "helpfulness": "0/0", "author": "Felicia D Fontenot"}, {"rating": 5.0, "review": "Addicting", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 3.0, "review": "It's okay but doesn't have the same variety as Apple TV/iTunes. Switching to Apple TV", "verified": true, "helpfulness": "0/0", "author": "Q. J. A."}, {"rating": 2.0, "review": "It works, and if you are really into Amazon's Prime offerings, it might be ideal. Having said that, there are other \"sticks\" on the market that have a remote, a greater number of apps and better user interface. I suppose you could make the case that Amazon's stick has better specs, but for me, at least, I don't notice any difference on my TVs. If I could do it all over again, I probably would have bought the other stick (the purple and black one with a dedicated remote with which Amazon competes). Nevertheless, it works and I'll keep the Fire TV Stick until it breaks. When that happens, I'll buy the other brand. If Amazon opened this device to more third-party apps, it would go a LONG way toward alleviating the shortcomings. Because I have the other stick device on another TV, I know what apps (from reputable companies) I am missing.", "verified": true, "helpfulness": "0/0", "author": "C \"C\""}, {"rating": 5.0, "review": "Great product!  We cancelled cables and needed something for the bedroom TV and this is perfect!  We can download all our apps (NetFlix, HBOGo, Showtime Anytime), and the HD Quality is fantastic!  Picture is super clear!  Highly recommend for any TV in your home.", "verified": true, "helpfulness": "0/0", "author": "kewlCHIKA413"}, {"rating": 5.0, "review": "Great addition to make your TV a smart TV. Easy to use and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "robert crowder"}]