[{"rating": 4.0, "review": "I bought this for netflix but the extent of benefits it's way beyo d that.", "verified": true, "helpfulness": "0/0", "author": "Raul Taveras"}, {"rating": 1.0, "review": "Terrible. I wanted this to work badly, unfortunately it just does not. Has issues connecting, has issues staying connected and crashes continuously. Only buy this if you are a TV addict who wants to kick his/her addiction. In that case this little device will do the trick. It is so frustrating having to restart 10x times during a half hour show (one of amazons own, not even Netflix or anything else) that you will never want to watch tv again. I am returning this piece of junk.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "I have the fire tv. the fire stick is the same, now I have my shows everywhere in my house! absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "loved it"}, {"rating": 5.0, "review": "Very easy to setup. Does everything as advertised. Great device!", "verified": true, "helpfulness": "0/0", "author": "Mary E Jean"}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Christopher Wade Crestwell"}, {"rating": 5.0, "review": "I find the modem very sensitive to touch but otherwise I like the fire stick.", "verified": true, "helpfulness": "0/0", "author": "J. R. Whitworth"}, {"rating": 5.0, "review": "Love this little streaming device. I can finally cast my youtube videos on my old Vizio directly from my phone. All the apps such as Pandora, Hulu, Netflix.On top of that you get free android app as a remote with the use of the microphone.  What more do you want ? I had chromecast once for one day and returned it the next. I bought the fire stick for $24 on the on the anniversary day. But it is definitely worth spending $40.", "verified": true, "helpfulness": "0/0", "author": "MarkC."}, {"rating": 5.0, "review": "Works great, easy to use remote", "verified": true, "helpfulness": "0/0", "author": "kevin flood"}, {"rating": 5.0, "review": "This little gadget is best, most affordable way to convert any TV to a streaming video monster.  It really works in conjunction with your high speed internet and wi-fi to get you the best in TV shows, live sports, and movies.Don't spend big bucks for a \"smart\" (duh?) TV.  Buy the best dumb TV you can afford and spend another $39 for this slick stick.", "verified": true, "helpfulness": "0/0", "author": "A. Nonny Mouse \"Anonymous\""}, {"rating": 1.0, "review": "It does not work in the UK??", "verified": true, "helpfulness": "0/0", "author": "Suresh"}]