[{"rating": 1.0, "review": "Probably the worst electronic device I have ever owned. It is slower that the first computer I ever owned, back in 1992. Anything streaming on it barely plays. Sometimes freezing every few seconds. My wifi connection is great and any of my other streaming media devices work flawlessly. It takes a few minutes just to navigate around apps considering how laggy the whole thing is.", "verified": true, "helpfulness": "2/2", "author": "afifteen"}, {"rating": 3.0, "review": "Just got it and was disappointed it did not come with operating instructions.  I bought a book on Fire Stick from Amazon and found it not helpful at all.  Started playing with and found most documentaries or movies I wanted to see cost money.  Have to go to search for tv sitcoms I watch.  I'm going to keep and hope for better free programs", "verified": true, "helpfulness": "0/0", "author": "Susan H. Novi"}, {"rating": 4.0, "review": "This was one of the best purchases I've made this year.  The Fire Stick has ended up being used more than my satellite lately.  I only have one complaint.  If you're watching Amazon based programming, either Prime or Amazon Instant Video digital purchase, it plays flawlessly with no buffering and no lag time.  However, if you plan to watch via the Netflix, HBOGo, or Starz Play apps, be prepared for very poor performance at times.  I've had times where these apps were painfully slow.  That being said, I purchased this without knowing those apps were even an option to have, so I just flip back over to the Amazon video and it's fine.", "verified": true, "helpfulness": "0/0", "author": "Pure Textuality \"Jena @ PureTextuality\""}, {"rating": 5.0, "review": "Loads quickly. Excellent selection of movies and TV shows. Easy to install.", "verified": true, "helpfulness": "0/0", "author": "SAM \"SHIRLEY MCKINNEY\""}, {"rating": 5.0, "review": "Amazing... Great product", "verified": true, "helpfulness": "0/0", "author": "Christian cordero"}, {"rating": 5.0, "review": "Love this appliance, it does everything I need it to do, lots to watch and streams flawlessly.", "verified": true, "helpfulness": "0/0", "author": "MauiMike"}, {"rating": 4.0, "review": "Great item.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Way better than Roku in terms of speed, reliability, and stream quality ( I have a 3 yr old roku hd).  Got mine for free when I signed up for the Sling TV service.  Sling was cool and worth the price, but buffered a lot because their servers suck. Still use the fire stick daily for netflix and amazon prime vids.  It's awesome", "verified": true, "helpfulness": "0/0", "author": "Waters"}, {"rating": 5.0, "review": "I love the Fire stick we have one in every room. I would recommend this to everyone.", "verified": true, "helpfulness": "1/1", "author": "heidi"}, {"rating": 5.0, "review": "Great easy to hook up works great", "verified": true, "helpfulness": "0/0", "author": "Sherry O`Connor"}]