[{"rating": 5.0, "review": "I love it!  Plugged it into my TV and it started its magic immediately.I only wish I could use it in Mexico:(", "verified": true, "helpfulness": "0/0", "author": "ME"}, {"rating": 5.0, "review": "Pretty cool device.  Very easy to set up.  When I first hooked it up, I used the USB port on the back of my TV to power it.  I kept getting \"insufficient power\" until I plugged it into the wall using the included adapter.  Apparently the TV just doesn't supply quite enough juice.  I use it often and it works great!  I'll be getting another when they go on sale again for $19.99.", "verified": true, "helpfulness": "0/0", "author": "Bradley B."}, {"rating": 5.0, "review": "It hasn't made fire yet. Maybe I need two sticks to rub together.", "verified": true, "helpfulness": "0/1", "author": "Patricia Wilson"}, {"rating": 5.0, "review": "I'm loving it.", "verified": true, "helpfulness": "0/0", "author": "J. Sharp"}, {"rating": 1.0, "review": "There are constant issues with audio irregularities (cracks, pops, etc).The Plex and Netflix apps are barely usable, with frequent buffering/stuttering issues as well as the audio issues noted above. Hulu and Amazon prime apps don't have the same issues.I am able to immediately switch to the Chromecast or Roku stick and the issues go away; so I am attributing this to the device. I purchased my Fire TV stick in the first wave of preorders.", "verified": true, "helpfulness": "2/3", "author": "Brendan R Clemmer"}, {"rating": 5.0, "review": "so easy to install and lots of fun with movies", "verified": true, "helpfulness": "0/0", "author": "phan tran"}, {"rating": 5.0, "review": "Love it!  I had been streaming Amazon through my Wii, but it was slow and picture quality was awful.  The HD through Fire TV is sooo much better.  Also get Netflix, Showtime, Hulu, etc. We have an Apple TV and this is surprisingly comparable for less than half the price.", "verified": true, "helpfulness": "0/0", "author": "J. Tucker"}, {"rating": 3.0, "review": "I bought this to replace the Chromecast in my master bedroom. My wifi signal is a little weak in the master bedroom (1-2 \"bars\" on my Android phone), but that was never an issue for the Chromecast. The Fire Stick, however, lost signal constantly (and before you ask, yes, I did use the included AC adapter as recommended by Amazon). I have since switched back to the Chromecast in the master bedroom, and plan on deploying the Fire Stick somewhere else in the house that is closer to the wireless router.Setting up apps like Netflix was slightly confusing at first. When you first plug in the Fire Stick, it almost appears as though Netflix and a few other apps are pre-installed. However, this is not the case. They are pre-loaded, I guess, but not pre-installed.I find navigation on the included remote a little tedious as well. The round circle (for up, down, left, right controls) at the top takes getting used to. I don't have fat fingers or anything, but I still often found myself accidentally hitting the middle \"enter\" button instead of the navigation controls.All in all, it's not a bad device. Definitely the best hardware specs for the current generation of \"stick\" devices. Once it gets HBO Go, I'll definitely consider using it as a main device again. But for me, the ease of use of the Chromecast and the fact that the Chromecast works well under less-than-ideal wifi conditions, makes me hesitant to \"stick\" with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Shane"}, {"rating": 5.0, "review": "Upon plugging the Fire Stick in, it was immediately clear that this is a far superior product to Chromecast, with extensive app support from the start.  And once you are able to instantly play videos with ASAP, it's really frustrating to go back to Netflix, which often takes 15 seconds or more to load.", "verified": true, "helpfulness": "0/0", "author": "Mitch \"Soli Deo gloria\""}, {"rating": 5.0, "review": "This is a great little device. It'll be even better once the ios app is released. It does everything we need. We used to access Netflix and Prime TV through our Wii, but the battery life of the wiimotes was terrible and we needed to reboot the wii every time we wanted to watch Netflix. We got this, plugged it in, downloaded the Netflix app and we're off and running. We've had only minor buffering issues, not enough to take a star. Overall, very pleased.", "verified": true, "helpfulness": "0/0", "author": "Deborah Estes"}]