[{"rating": 4.0, "review": "iT 'S REALLY WORKING!!!  i  had tried others but this is really working, installation was quick and easy and its in use since then without any trouble.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Well, I had to learn a lot, ... like how to get it out of German, so luckily my grandson was here to work his techy magic and teach me along the way.  I think I would have gotten it eventually, as I have learned a lot of what to look for, but he was faster.  Yes, I like it. As with all technology, it will do more than I have time to learn, but I like it anyway.  After all, I don't have to be able to build a motor to have and drive a car, do I?", "verified": true, "helpfulness": "0/0", "author": "Y. Marts"}, {"rating": 5.0, "review": "Love it. I take it when I travel.", "verified": true, "helpfulness": "0/0", "author": "The Reviewer"}, {"rating": 5.0, "review": "Love it!! I had another type b4. Which limited me on what I could do. Now I get true 1080 great picture much more options and remote to boot. Great purchase!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "But not so good for non amazon prime members.  You cant take off all the amazon stuff or even hide it.  Its just there in the way for no reason. The lack of control over whats on your screen makes this one big advertisement for amazon prime and amazon content.", "verified": true, "helpfulness": "0/0", "author": "Joanna B"}, {"rating": 5.0, "review": "Highly recommend! I love mine, and TV is now a fraction of the cost of cable! With Prime, Netflix, and Hulu we are never short of things to watch.", "verified": true, "helpfulness": "0/0", "author": "K. Tewell \"celestial spell\""}, {"rating": 1.0, "review": "So far no satisfaction with the Firestick. First one worked upon initial set up but as soon as we turned off the tv it quit working. Spoke with someone at Amazon and they sent us another one. Exact same thing happened. Spoke with someone at Amazon again who had me try several things (most of which I had already tried based on troubleshooting videos/helps.) Still nothing. Was asked for make and model number of our TV and told that the info was being sent to another group/division, something like that. Last call I received was four nights ago saying whoever has our info still has it and someone will get back to us. Seemed line it would be a great thing to have but so far not the case. I will say our TV is 9 years old but it is an HDTV and it has HDMI ports.", "verified": true, "helpfulness": "0/0", "author": "Teresa  A. Jones"}, {"rating": 5.0, "review": "works better than expected, definitely happy with this product and would recommend to someone looking for a media streamer that's incredibly small.", "verified": true, "helpfulness": "0/0", "author": "Todd R."}, {"rating": 5.0, "review": "Better then I expected", "verified": true, "helpfulness": "0/0", "author": "John Gonzalez"}, {"rating": 1.0, "review": "Fire stick keeps lagging. I've got very powerful wifi and have no problems on my other devices. I have a flat screen tv that I use the fire stick on since it's not a smart tv. The fire stick will lag and buzz a bit. I am not satisfied at all.", "verified": true, "helpfulness": "0/0", "author": "Chloe Haskind"}]