[{"rating": 5.0, "review": "We got a $40 Fire stick & immediately canceled our $100 a month cable.  Small, easy to install and set up, and offering worlds of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Denise Michaels"}, {"rating": 4.0, "review": "Good product.Wish it had access to the Internet to search other sites/TV network channels...like abc.com, PBS, etc.", "verified": true, "helpfulness": "0/0", "author": "A R Allen"}, {"rating": 4.0, "review": "I truly enjoy the Fire TV Stick, the only issues I have had is, when I am watching Netflix it will disconnect for short periods of time.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 2.0, "review": "I WAS DISAPPOINTED WITH THIS PURCHASE YOU STILL HAVE TO PAY TO WATCH  SHOWS AND MOVIES SURE SOME ARE FREE . BUT MOST SHOWS ARE 1.99 AND UP  I'LL STICK WITH NETFLIX", "verified": false, "helpfulness": "0/0", "author": "jennifer richards"}, {"rating": 5.0, "review": "Really nice product with great selection of movies at a reasonable price.  Have been pleased with the available games offered.  Was not aware that was available too.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "Nice and easy, except for that remote battery.", "verified": true, "helpfulness": "0/0", "author": "RC \"Ronald Cruz\""}, {"rating": 4.0, "review": "Works fine when plugged into the TV, but would really like to run it through the surround receiver and through the surround speakers, but I don't think it works that way.", "verified": true, "helpfulness": "0/0", "author": "Kelly Collins"}, {"rating": 4.0, "review": "It's easy to connect, I just wished it had more free movies and TV shows.", "verified": true, "helpfulness": "0/0", "author": "Cheree Cline"}, {"rating": 5.0, "review": "Love my Fire TV Stick! It is easy to set up and I love traveling with it!", "verified": false, "helpfulness": "0/0", "author": "Deeder"}, {"rating": 5.0, "review": "A bit of a project getting it going had to have cable come then had no sound and had to call amaZon then netfliX then thought we were in business and no sound again called amaZon then Netflix again and got it straightened out finally but have to say amaZon man was so patient and even called me back to make sure Netflix got it corrected!", "verified": true, "helpfulness": "0/0", "author": "elaine massarelli"}]