[{"rating": 5.0, "review": "I love this little thing!! Works great!! Love having pandora play right to the TV.. Still trying to figure out all of the benefits of having it !!", "verified": true, "helpfulness": "0/0", "author": "rajeeyahk"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Aneudy Alvarez"}, {"rating": 5.0, "review": "Works great. Even though we have a new smart tv it would constantly buffer and display an Internet bandwidth error which required restating the movie or show. That hasn't happend once since getting the fire stick.", "verified": true, "helpfulness": "0/0", "author": "jimmy dean"}, {"rating": 5.0, "review": "I love this!! I wish I had bought one sooner.", "verified": true, "helpfulness": "0/0", "author": "Margaret C. Patton"}, {"rating": 4.0, "review": "Best yet- works out of the box, sometimes bogs down when playing games but maybe it's the apps? Netflix and prime movies play without any buffering and limited load times! Although wish I could use time warner cable app like on my fire.", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 4.0, "review": "Love the firestick once we figured out how to hook it up.  It seemed easy, but when we hooked the stick directly into our older Sony Bravia flat screen HDTV, we had picture but no sound.  After adjusting audio within the TV and the firestick settings, still no luck.  Finally, we used the USB adapter included with the firestick and that was all we needed.  We get a great picture on our tv and have no problem receiving the wireless signal in our bedroom, which is upstairs and a fair distance from our router. The only downside so far is that we are having problems getting Netflix to work properly.  We keep getting an error message saying that Netflix is not installed, etc. It IS installed. We also just ordered the fire tv box for our living room and same problem there.  I have read all of the suggestions for fixes and clearing the cache in Netflix app, forcing stop and restarting, it works for a bit, but is not dependable.  I have yet to have it work on the firestick (a week now). Not sure if this is totally a Netflix app problem or if there are problems with Amazon and Netflix compatibility.  I just wish they would figure it out and give us a fix.  We did away with DISH and are relying on Amazon Prime, Netflix, Hulu and an antenna for our TV. We are relying on Netflix for a bulk of our entertainment.  Come on Amazon.....lets make this right. Have no problem with HULU or Amazon Prime.playing.", "verified": true, "helpfulness": "0/0", "author": "Jane P. Goodness"}, {"rating": 5.0, "review": "Bought this Fire TV Stick cause it was $5.00 dollars off...plus having all movies at my finger tips is amazing!", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "I wasn't sure how much we'd use this but I'm pleasantly surprised by how often we turn to it. I didn't realize all of the functions and apps that worked with it. Maybe some day I can convince my husband to cancel our cable subscription!", "verified": true, "helpfulness": "0/0", "author": "Alisson Shea"}, {"rating": 1.0, "review": "I liked the application but I wanted to download acorn tv  but unable to do so.", "verified": true, "helpfulness": "0/0", "author": "David Francis"}, {"rating": 5.0, "review": "once i learned how to use it i ordered more for the other tv's.  i love it !!!", "verified": true, "helpfulness": "0/0", "author": "LMJQ"}]