[{"rating": 5.0, "review": "Love my Firestick!  What more can I say?", "verified": true, "helpfulness": "0/0", "author": "Mamapajama \"often confused\""}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "laura crossman"}, {"rating": 5.0, "review": "I absolutely LOVE my Fire TV Stick!  I have a Chromecast and a Roku as well, but the Fire TV Stick is the best one.  The best part is that it keeps getting better as they add new apps.  I honestly never thought I would care about the games on this, but there are some excellent party games (Jackbox Games) that I put on whenever we have people over and they are a big hit! The only thing I'm missing is my Disney Anywhere movies and Spike TV (for Lip Sync Battle), if it had those, I wouldn't need any other devices!", "verified": true, "helpfulness": "0/0", "author": "Craig Pettitt \"technophile\""}, {"rating": 5.0, "review": "love it..easy to use", "verified": true, "helpfulness": "0/0", "author": "Melanie Pendleton"}, {"rating": 2.0, "review": "It loses my internet connection before I can even pick something to watch.  I haven't been able to use it at all.  My internet is very solid and I don't have problems with it.  It is up and running each time the Fire TV loses track of it.", "verified": true, "helpfulness": "0/0", "author": "P. Plante"}, {"rating": 4.0, "review": "All is well", "verified": true, "helpfulness": "0/0", "author": "Partick M McKenzie"}, {"rating": 3.0, "review": "Works well, but the navigation can be a little confusing, and there is no way to access fox now or the abc app that I could find. In my opinion Apple TV, though more expensive, will give you everything this does plus more apps and options, and you can still stream prime video by projecting from phone, tablet or computer to Apple TV. So more options for about double the cost. I think it's worth it, because it's a one time purchase.", "verified": true, "helpfulness": "0/0", "author": "Ilhwa"}, {"rating": 5.0, "review": "Bye bye cable- I signed up for sling for 3 months and got this for free- works great!", "verified": true, "helpfulness": "0/0", "author": "Kaycee Pronschinske \"Kaycee P\""}, {"rating": 2.0, "review": "Not great! It keeps freezing up with hulu. Works fine with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Benjamin S."}, {"rating": 5.0, "review": "Easy to set up Didnt need anything else to set up. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "robert"}]