[{"rating": 3.0, "review": "I'm a little disappointed so far. I've been using the Fire Stick for a couple of weeks and so far, I like my Roku 3 better. The Fire Stick seems to load more slowly and I could not get the mirroring from my phone to work and sending YouTube videos from my phone to my TV repeatedly failed until I just gave up. YouTube sends videos to my Roku 3 immediately and seamlessly. I'll try the Fire Stick again, but several attempts the other night just crashed.I do like the games and apps that are available, but I haven't found a great way to search for them yet. No more apps than Roku, but there are more free games, not that I'm a gamer, but nice when kids come over. Voice search worked well from my phone app.I'm glad I bought it because I needed it and I decided on this one because of the price and memory space, but I'm glad it is just for my second TV because I like the Roku 3 for primary use even though it was more expensive (worth the extra in my opinion).", "verified": true, "helpfulness": "0/0", "author": "Tracy1326"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Marilyn Smith"}, {"rating": 5.0, "review": "This little thing is perfect for little apartments. When u have a prime membership watch as much as u like. I definitely can recommend this stick.", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 4.0, "review": "Will not connect to a Samsung Galaxy S6 without a third party app.  Once I figured that out I'm pretty happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Christopher R Whiteman"}, {"rating": 4.0, "review": "This is pretty awesome!!! I love the fact that you can use it with a computer monitor with HDMI. I went back and forth a lot between buying this or google Chrom Cast. Decided on this since Amazon Prime Play isn't compatible with chrome and chrome doesn't come with a remote! Also it comes with extra cord extender between the stick and the tv/monitor, where with chrome you have to purchase if you HDMI isn't a side port but one that stick straight into the wall. Totally love this!! My only complaint is that you have to be careful with purchases, unless you change your setting in Fire TV its as easy as one click, it doesn't ask for verification. My first day I accidentally bought an upgrade to Amazon Prime since I was using a different account. Thankfully I was able to call and have amazon refund me without a problem.", "verified": true, "helpfulness": "0/0", "author": "HeatherLue \"Heather Rogers\""}, {"rating": 5.0, "review": "Mothers day gift for my mom, and she loves it. She said it was easy to set up and she loves all the features.", "verified": true, "helpfulness": "0/0", "author": "Larren Mazyck"}, {"rating": 5.0, "review": "EVERY ONE NEEDS ONE OF THESE! these are great! I put one on every tv!, ther are fast on the remote! no lag time and the app is perfect to operate!, you can even use your smart phone to run the app (with voice commands too)!.", "verified": true, "helpfulness": "0/0", "author": "Randall Lambert"}, {"rating": 3.0, "review": "Pretty good once u download the good apps. Even better if u get it preloaded. All the movies from way back to the latest on DVD even some movies that are still in theaters. Also the latest poverty are usually available all for free. Only problem is sometimes it cuts off mid movie & starts all over. I wouldn't ditch cable for it because you're relying on streaming video, but I would downgrade to a basic package & watch the other TV shows & movies on here...", "verified": true, "helpfulness": "0/0", "author": "Raymond Honor"}, {"rating": 5.0, "review": "This, by far is a great investment. I no longer have to get locked into a contract for cable that costs more money and nearly not the selection!! Only negative is a lot of shows require u to purchase the episode or to just watch it.", "verified": true, "helpfulness": "0/0", "author": "holly"}, {"rating": 5.0, "review": "Love it turned old tv into a great smart tv", "verified": true, "helpfulness": "0/0", "author": "JeneralJoe"}]