[{"rating": 3.0, "review": "Mainly purchase for the Netflix portion of this, and with the recent Netflix app, it won't work. Everything else on the stick seems to be working with no issues. It just sucks that I can't use it for what I mainly purchased it.", "verified": true, "helpfulness": "1/1", "author": "S. Mick"}, {"rating": 5.0, "review": "It lets you side load 3 party apps without having to root/jailbreak the device. That alone makes it worth getting.  The remote is also really nice.", "verified": true, "helpfulness": "0/0", "author": "Sith Lord"}, {"rating": 1.0, "review": "I waited too long to open the package and hook it up so I'm not sure if it's returnable, however something doesn't work as I can't get the remote to even turn on. tried new batteries that didn't work. Just a waste of my time and money.", "verified": true, "helpfulness": "0/0", "author": "DOC"}, {"rating": 1.0, "review": "Useless outside of the US.  Even though there's not a single mention of this on the product description page.  $20's wasted.", "verified": true, "helpfulness": "2/7", "author": "loki_racer"}, {"rating": 4.0, "review": "So far so good, I do have connectivity issues for some reason with this on specific channels (ESPN, etc).  But I do like it better than my Chromecast", "verified": true, "helpfulness": "0/0", "author": "zimmy"}, {"rating": 2.0, "review": "Laggy interface, intermittent audio clipping, apps crash frequently.", "verified": true, "helpfulness": "1/1", "author": "Zac"}, {"rating": 4.0, "review": "I have both a chromecast and a DVD player that can play internet services such as hulu and this device beats both of them easily.  The problem with chromecast is that it relies completly on apps to control the device.  This is problematic in several ways that Fire TV stick has overcome.1.  I can now safely pause without worrying about loosing the spot due to disconnect from app.2. With the Tv stick I do not need to cast which sometimes can be problematic with chromecast - lots of problem like app not finding chromecast.3. fire stick actually stores information such as location, etc...4. I'm not sure about this but I feel that fire stick also stores a cache so that I hardly get stuck videos.4.  firestick is fast.5.  I'm not going to speak for DVD interenet playing since it is much slower and only use as a backup but even with this is more reliable than chromecast.I was about to return this due to negative reviews that chromeast is better - literally was about to cancel order and forgot to do so, when it arrived was about to just return it, forgot again, and finally decided to just give it a shot and now I'm using this exclusively.summary better than chromecast by far.  solid product!Hopes this helps.", "verified": true, "helpfulness": "0/0", "author": "Alex Lee"}, {"rating": 5.0, "review": "Very nice! Easy setup, and very very fast!", "verified": true, "helpfulness": "0/0", "author": "dholanda"}, {"rating": 4.0, "review": "I love how much faster this loads and streams compared to Chromecast. i just feel like it is a smoother user experience/interface. I really enjoy the portability of this as well.My only wish was for the makers of these types of products to figure out a way to power it from the TV without having to plug it in to a  seperate outlet. Outlets are at a premium by my TV. I already have many different tech devices plugged in. Please figure out a way to make this work without the power plug. This is in no way personal towards amazon and the fire tv stick. This is how all of these \"stick streamers\" operate. Otherwise, this is a great product for streaming video from hulu, netflix, amazon instant video. Definitely worth the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great and simple way to get your internet subscriptions anywhere in the house. Highly recommend it. Sooooo much better than Roku. I am on a campaign against Roku. Received it as a gift. Still don't know how I will tell my nephew I can't use it. I've owned 4 other devices for streaming and Roku was the first one that I've tried to activate only to find that the device is useless unless you supply a credit card number. I already have accounts for Amazon and Netflix and some free providers. I don't intend now or ever to subscribe to anything else from Roku. BUT they won't let you use the already paid for device until you turn over your personal information. DON'T buy Roku. Go Fire TV Stick. Even if you don't have an Amazon Prime account (consider getting one) the stick will provide many options.", "verified": true, "helpfulness": "0/0", "author": "Uncle Billy \"Bill\""}]