[{"rating": 3.0, "review": "Great device, but the lack of the Xfinity tv go app is incredibly frustrating. I mean this device offers a solution for us on the go, but to have the key to mobile tv missing is unforgivable. This device does not live up to it's potential till it allows me to stream live tv on the go. The xfinity tv go app is already an app for android. Amazon please make it happen and port it to this device. We need it! Will upgrade my rating when and if Amazon cares enough to address this small request.", "verified": true, "helpfulness": "0/0", "author": "Liljmia"}, {"rating": 5.0, "review": "Wish I had looked into this before now. Great product for the price", "verified": true, "helpfulness": "0/0", "author": "Randy Nichols"}, {"rating": 5.0, "review": "Great device. Worked flawlessly for about a month, and then the remote died. I've been using my mobile device as a remote for the past two weeks or so. Just changed out the batteries on the remote, and the problem persists.Will try to contact customer support if possible. If not, will just consider this a loss.", "verified": true, "helpfulness": "0/0", "author": "Michael Hilliard"}, {"rating": 4.0, "review": "It's been great!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Brown \"Ms. Kim\""}, {"rating": 4.0, "review": "Excellent device.", "verified": true, "helpfulness": "0/0", "author": "Carlos R."}, {"rating": 5.0, "review": "Worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Cate W."}, {"rating": 5.0, "review": "After 6 months we had to replace it because it stopped working. Amazons customer service were very helpful. Disappointed it broke but love its ease of use & ability to use all our prime benefits now. Will update if new stick is a POC", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "received quickly, easy to install, works well", "verified": true, "helpfulness": "0/0", "author": "Mary L. Collins"}, {"rating": 4.0, "review": "It's very easy to use", "verified": true, "helpfulness": "0/0", "author": "jose"}, {"rating": 1.0, "review": "First let me say that I am a huge fan of Amazon.  I have experienced lots of great buys and very fair prices, and Customer Service is truly great.  Basically, I do all my shopping with Amazon.  However, I have to be honest and admit Amazon has missed with this product.  It really doesn't work - at least not  well enough.  My experience was that it could not hold a Wi-Fi signal for very long.  One might make the argument that my modem is too far from the TV, etc..  But that argument doesn't hold up because - before and after the Stick - an inexpensive Sony smart blue-ray player has functioned just fine for the same TV in the same place.  Now I must admit that Amazon sent an email suggesting a number of research steps I might go through regarding my Wi-Fi connection so they could better solve the issue.  But the instructions were much too complicated for my interests.  Why would I want to do all that when I can simply use another device?  Let me also note that I use the regular Fire TV box for my primary TV and it works great.  However, that doesn't really mean anything regarding Wi-Fi because I use an Ethernet connection with that device - so I don't know..", "verified": true, "helpfulness": "0/0", "author": "mrliberty"}]