[{"rating": 5.0, "review": "Great product.  Clear & easy instructions with quick setup/installation.  Very easy to use and navigate.  Remote is the kicker for this product - fantastic item.", "verified": true, "helpfulness": "0/0", "author": "KEITH KAUFFMAN"}, {"rating": 5.0, "review": "Great interface..blows away the others with built in apps like blue ray and smart tv's...plus I can move it from room to room. Down side is that my harmony remote can't talk to it.", "verified": true, "helpfulness": "0/0", "author": "telenoiz \"telenoiz\""}, {"rating": 5.0, "review": "Works great with Prime. I recommend.", "verified": true, "helpfulness": "0/0", "author": "Thomas H. Weatherell"}, {"rating": 5.0, "review": "We love the fire stick!! It's so conveinent and easy to watch out favorite shoes on HBO, ESPN & Netflix. I give it 5 stars  and would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Janelle Smith"}, {"rating": 4.0, "review": "I have been using Roku devices for several years. Recently I started having a buffering problem when watching Amazon Instant Video. I tried replacing my Roku2 device with a Roku Stick, but the problem continued. I decided to give the Fire Stick a try and it has been working fine for Amazon content, with no buffering issues. Overall  I still prefer the Roku2 and continue to watch Netflix, HBO Go and MLBTV because the Roku2 does a better job, but for streaming Amazon content the Fire Stick solved my problem. An additional benefit for Prime members is being able to play your Prime Music library which you cannot do on any Roku device. So for Amazon content it's very good.", "verified": true, "helpfulness": "0/0", "author": "Rock"}, {"rating": 3.0, "review": "Couldn't use it in my bedroom. Would connect to the wifi but not to amazon.Moved out to the living-room tv and it works perfect.Moved the PS3 to the bedroom, that works perfect.Situation was resolved, just not ideal.", "verified": true, "helpfulness": "0/0", "author": "Merritt L. Palmer III"}, {"rating": 1.0, "review": "Original Fire TV stick would not work. Replacement did not work either. Unable to connect to me wireless network.", "verified": true, "helpfulness": "1/1", "author": "Bernard Stetz"}, {"rating": 5.0, "review": "A lot of movies and TV series available. Well worth the cost of the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "yh"}, {"rating": 2.0, "review": "Since the Kodi app has been blocked by amazon most of the firsticks advantages have been blocked as well. However if you don't have a smart Tv the device is still useful for running netflix and hulu as well as prime. If your looking to reduce your cable bill this is not the answer.", "verified": true, "helpfulness": "1/1", "author": "Steve R."}, {"rating": 4.0, "review": "Makes life of watching TV so much easier.", "verified": true, "helpfulness": "0/0", "author": "Celia Culbert"}]