[{"rating": 5.0, "review": "I just got my Fire TV stick in the mail today and already love it. It was so simple to set up and it has so much capability. The parental controls are great because it will mainly be used with my children. I love being about to stream all my Amazon prime shows and music. I can see all my pictures and videos from my Amazon cloud storage right on my tv for easy viewing. There is a great selection of apps such as Netflix, twitch and many games. Im really happy with this purchase and would highly recommend.", "verified": true, "helpfulness": "3/3", "author": "fireman9iner"}, {"rating": 1.0, "review": "Once my satellite cable special ended, I was paying double the amount- and I didn't have the Oprah channel! While seeking another special with a customer service representative via telephone, I was reading about the Fire TV Stick online to weigh my options. The satellite company did not present a new special; yet, I was paying for service wherein I had to watch what was offered during specific time slots. It doesn't take a genius to realize the advantages of Amazon's product, so without hesitation I cancelled my satellite service- and I am have a ball! Owning a portable device that allows me to watch what I want when AND where I want is a blessing! All I need is WiFi access, popcorn and water using the device. I plan to purchase one for my bedroom and a third one or my dad. THANK YOU, Amazon, for giving us the opportunity to finally stick it to cable and satellite companies!  :-)UPDATE: September 12, 2015After using the device for over two months, I am truly disappointed for sure. The Fire Stick TV (FST) began freezing for several seconds only to buffer in the end. Soon afterwards, the buffering began lasting fr several minutes only to return to the main home page. After the ads finish running, a black screen appears for thirty seconds minimum. I thought it was my Wi-Fi but decided to purchase the Google Chromecast to compare the two, and the Chromecast confirmed my initial belief- the FST is worthless! The Chromecast has yet to disappoint, and it uses the same Wi-Fi network as the FST. If I had the time to return the FST, I would send it back in an instant. However, it is quicker to encourage others to avoid making the same mistake regardless of being a loyal Amazon fan.Sorry Amazon, but you missed the mark with this product.  :-(", "verified": true, "helpfulness": "0/0", "author": "Angela"}, {"rating": 5.0, "review": "Love my Amazon Stick. Works much better than my WII ever did. I'm a very satisfied customer.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Ordered this as part of Prime Day and so far I love it! It was so easy to hook up and had no problems at all! So far the quality is better than our HD cable!", "verified": true, "helpfulness": "0/0", "author": "Amber B"}, {"rating": 5.0, "review": "great item works fine", "verified": true, "helpfulness": "0/0", "author": "mmmmclaire"}, {"rating": 4.0, "review": "😊", "verified": true, "helpfulness": "0/0", "author": "Terry"}, {"rating": 1.0, "review": "I wanted to ask if  the arrow pointing backwards was for replaying the last minute or so, if you missed what was said etc. the answer is NO.  That arrow is to take you up to the last menu.  I didn't appreciate that you had to buy it to find out, either.  I also wanted to know if you could get Gaiam TV in the apps, but I couldn't find it there.  ( I don't care for violent tv!)  I tried the search function, but that only brought me to yoga programs for  $3.99 each, which I get those and movies for $9.99 a month on their channel.  The sound kept stuttering even in the  installation videos, so I unplugged it for 30 secs. etc, still no good. I got busy with something else, then the screensaver came on, that's when I noticed a circle kept spinning (loading or buffering).  I tried to adjust the sound setting mentioned in the video but the Dolby Plus wasn't even on. So I went to try out my favorite show \"Krishna Das Live in New York City Vol 1\"  and the screen said not enough bandwidth.  I quit then, as I don't like the tiny remote, nor the navigation from what I saw.  I believe it only held  75 programs on my watch list, I just noticed hundreds more watchlist programs on the roku, being held, but i had to remove some for those to pop up.  I had to  disconnect and reconfigure all the plugs, my chrome dongle had to be moved, I was thinking I'd have to leave off my roku or the chrome,  I BOUGHT THIS BECAUSE I WANTED A BETTER, FULL SIZE REMOTE WITH AN INSTANT REPLAY BUTTON ( that what my Roku 2 is, chintsy and  w/out the replay button).  I only have/want 720 P, don't want to pay extra for the 1080p videos either, I am on a limited income.  It was a big  hassle to find out it just wasn't a good fit. Perhaps if the  bandwidth ... the navigation was confusing, YUCK !  Sorry Amazon...", "verified": true, "helpfulness": "1/2", "author": "carol anderson"}, {"rating": 5.0, "review": "Amazon Fire TV Stick works very well, much better than expected. Incredibly clear picture! It really makes Amazon Prime worth the cost. Congratulations on the Emmy nominations and good luck!", "verified": true, "helpfulness": "0/0", "author": "RIP \"Robin P-\""}, {"rating": 2.0, "review": "Bought for $19. Better plan on buying Netflix or Hulu subscription or go broke paying rental fees for EVERYTHING - including old PBS shows that are free everywhere else. Glad I only paid $19!", "verified": true, "helpfulness": "0/0", "author": "Ratqueen Reader \"Ratqueen Reader\""}, {"rating": 5.0, "review": "Enjoying the ease of watching shows I've not had access to! Set up and use is SO simple!", "verified": true, "helpfulness": "0/0", "author": "Cyndi Daman"}]