[{"rating": 4.0, "review": "works great, would give it 5 stars but it doesnt show that there is a big long power cord that feeds the fire stick which makes it bulky and funny looking, and so far EVERYONE that has come over asks me whats sticking/hanging out of the side of my tv...", "verified": true, "helpfulness": "1/1", "author": "fifthday"}, {"rating": 5.0, "review": "Work great and are easy to setup and navigate.", "verified": true, "helpfulness": "0/0", "author": "BlugTX"}, {"rating": 5.0, "review": "We love this little stick.  Regardless of which family member speaks to it,  it understands and brings up the title.  Easy to install, easy to set-up, and even easier to find and watch the shows we want.  Great little gadget.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"queen of piers\""}, {"rating": 4.0, "review": "I bought the Amazon Fire Stick, because I could not afford my cable companies prices. Read the reviews, so took a chance, also added HULU so I could watch local TV you know shows that are on known regular channels.  Any way this product has worked real well for me (69-70)year old.  Tonight however it decided to give me sass.  With this message Digital channel signal strength is low!  So for the first time in a week I can not watch TV, I like the Fire TV Stick, I'll give it a 4 star, because even with this glitch, it worked great for me.  I can and will recomended to those who want to get out from under $100 dollar cable bills just for TV and live on a tiny, tiny income.", "verified": true, "helpfulness": "3/3", "author": "Claudia Mott \"avid reader\""}, {"rating": 4.0, "review": "Giving 3 stars because when I did the research when wanting to replace my broken Chromecast it states that the Fire Stick does everything and more..(so I purchased)..However you cannot Stream Live  from your Laptop onto your TV like with the Chromecast. Also HBOGO is still not working. I will be purchasing another Chromecast and will put the Fire Stick Downstairs for the kids to watch Netflix, Hulu, Prime, ect..... But if you want to stream from your Laptop to the TV this is not the stick for you.", "verified": true, "helpfulness": "1/1", "author": "HelloDollie"}, {"rating": 3.0, "review": "I was half way through a movie and it keep trying to restart.  I might be returning this one", "verified": true, "helpfulness": "1/1", "author": "Catherine Housmah"}, {"rating": 5.0, "review": "As a railroad engineer, I spend a ridiculous amount of time in hotels. The Amazon Fire Stick has allowed me to circumvent the lack of enjoyable content on the typically limited number of channels provided at the hotels, and those 3AM infomercials no longer have me wanting to rinse my mouth out with a pistol. Between Prime, Netflix, and the other options, I have no problem finding something to keep me entertained while I await my train back home.", "verified": true, "helpfulness": "0/0", "author": "David Foster"}, {"rating": 5.0, "review": "It is a cheap and easy device.It comes already hooked up to your account unless you change it to someone else.", "verified": true, "helpfulness": "0/0", "author": "Angelo Jaramillo"}, {"rating": 5.0, "review": "This is an absolutely great device. Simple install which takes two minutes. Just connect to Wi-Fi and log into your Amazon account. Easy to move from television the television. Easy to travel with. I don't know what they did, but the wi-Fi on this device is much faster than my AppleTV and just about any other device I have.  My AppleTV is right next to it and the Wi-Fi does not compare.  Now at $34, this is a must-have device especially if you subscribe to Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "vbrown11204"}, {"rating": 4.0, "review": "I haven't had any issues;  the remote is good my 3 year old uses it; she wouldn't be able to use my phone.  i couldn't figure out a good app for steaming via DNLA;", "verified": true, "helpfulness": "0/0", "author": "NetPatel"}]