[{"rating": 5.0, "review": "this thing is like magic.", "verified": true, "helpfulness": "0/0", "author": "G. Paige \"Cody Broken\""}, {"rating": 1.0, "review": "What a let down, this device functions so slow. I bought this mainly for using PLEX, this thing forces you to make an account to use your local plex server and keeps promoting you to pay for plex. I started playing a video and it pauses a ton. It also will not stream movies from prime without issues saying slow internet connection. I tested my Roku doing the same things and there were no issues. After that I decided to return it. It had only been plugged into my tv for 45 minutes, this thing was so hot I could barley hold it. Maybe that is why it is called the fire stick because it can probably start a fire in your home. I will be buying a second Roku.", "verified": true, "helpfulness": "0/1", "author": "Turtleman"}, {"rating": 5.0, "review": "Awesome. Can't believe I waited so long to get this!", "verified": true, "helpfulness": "0/0", "author": "Trish P"}, {"rating": 3.0, "review": "Would be 5 star but.... I had 7 TV's and had it hooked up to one and it worked great. Gave that TV to my mother and guess what? it doesn't work with the other 6. Why? because somehow none of them are HDCP compliant so I get sound but no picture.They need to fix that BS. Luckily I got one for $20 on a sale. it was great while it lasted but I am not happy. Highlight that in bold on the tech details so I would then no that was important. I'm not a tech guy and I'm not happy at all. tech support was great and tried everything to help but nothing worked. FIX IT!", "verified": true, "helpfulness": "0/0", "author": "J. White \"Kindle reading maniac.\""}, {"rating": 3.0, "review": "I've used this with Amazon Video and Netflix. The wireless remote and iPhone apps are great. Setup was easy, it responds quickly and feels responsive. This is a vast improvement over Roku's terrible TV stick. That thing was painfully slow, awkward and requires a credit card for basic setup. Google's Chromecast stick plays video better than this, but it doesn't have a dedicated remote or Amazon Video.When playing Netflix, the video sometimes freezes and jerks a few seconds every 10 to 15 minutes. It looks like Fire TV is causing the problem. My WiFi and cable modem work perfectly and Fire TV is less than 10 feet from the access point. On the same TV, Google's Chromecast plays Netflix perfectly.", "verified": true, "helpfulness": "0/0", "author": "Elderberry Dogs"}, {"rating": 5.0, "review": "Regret buying the AppleTV - this is just so much better.Easier to navigate.  Actually HAS the Prime App on it.  AND - doesn't crash requiring restart all the time.", "verified": true, "helpfulness": "0/0", "author": "LD0708"}, {"rating": 1.0, "review": "Eh it's OK", "verified": true, "helpfulness": "0/0", "author": "cocosimone"}, {"rating": 2.0, "review": "I did not know that this was constantly using bandwidth we wnt over 150 G and got an additional charge on our internet service provider.", "verified": true, "helpfulness": "0/0", "author": "Anthony McQuagge"}, {"rating": 5.0, "review": "I use to have a Roku streaming stick until it bit the dust after three months.  Besides having a better controller, the Fire TV Stick is faster and well made.  I'm glad I have the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Yo!"}, {"rating": 4.0, "review": "The stick was easy to install.  I am still getting used to what it does, but so far I like it.", "verified": true, "helpfulness": "0/0", "author": "sandy grabner"}]