[{"rating": 4.0, "review": "I like the ease of use. Can't wait until there are more recent movies in Prime. I love horror flicks though and there is a healthy selection.", "verified": true, "helpfulness": "0/0", "author": "scottswelderchick"}, {"rating": 4.0, "review": "Easy to use and made my old TV smart.  It was very easy to setup - took about 5 minutes to setup including getting my netflix up and running.  Very good for the price, $39.The only downside is it seems that netflix content locks multiple times per show.  It recovers to the 25% mark and then hangs, bounces you out and asks if you want to retry or go to other content.  If you say retry it works fine 9/10 times.  That does not happen with Amazon provided videos.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer - Jody"}, {"rating": 5.0, "review": "Got it at the intro price and love it!!", "verified": true, "helpfulness": "0/0", "author": "Aaron K"}, {"rating": 3.0, "review": "Having some glitches with Netflix. Easy to use but somewhat unreliable so far.", "verified": true, "helpfulness": "1/1", "author": "LMP1962"}, {"rating": 5.0, "review": "Extremely simple to set up.  If you are already using fire tv then this stick will look very familiar.", "verified": true, "helpfulness": "0/0", "author": "Mark Hintze"}, {"rating": 4.0, "review": "This little device is pretty amazing. I have been very impressed with what it has to offer. I am not much of a gamer so this is a great alternative to owning a PS4 or Xbox one and gives you all the streaming capabilities that you could desire.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Purchased to watch youtube guitar lessons on my large screen tv a nd ended up using it for so  much more.. love it .", "verified": true, "helpfulness": "0/1", "author": "tcb"}, {"rating": 4.0, "review": "I signed up for the original Prime Member offer for $20.00. It is a very good deal even at the regular Amazon price. It came  registered to my account and the only thing I had to do is plug it in turn in on and enter my WiFi's password. The top speed I get on my Internet connection is about 5 Mbits. I have watched several Prime movies without noticeable delays or interruptions.  This would be a five star rating if it were not for the inability to change NDS servers. However, this would be irrelevant to most users. If you are one of those consider this to be  a five star rating.", "verified": true, "helpfulness": "0/0", "author": "Spiro C. Manolis"}, {"rating": 5.0, "review": "This is an amazing little streaming stick. Look up a program called \"Kodi\" formerly \"xbmc\" and never have to pay to see another movie or TV show again. Its easy to install on the Amazon TV stick and will change your life!", "verified": true, "helpfulness": "1/1", "author": "Fernando P."}, {"rating": 4.0, "review": "I purchased two of these, one for my house and one for a siblings house back when they were on sale for $19 each for prime members. The TV sticks themselves work great, but my only complaint is with the remote. Neither me or my sibling have enjoyed using the remote, as occasionally it will ignore arrow presses, or pretend that you're holding down the arrow and go flying across the page. Aside from that one con, which can make this product rather frustrating to use, the TV stick works fully as advertised and is a joy to have.", "verified": true, "helpfulness": "0/0", "author": "Hayden"}]