[{"rating": 5.0, "review": "I love this thing. I am thinking about buying another one. Seamless functionality, easy to set up and use. I was at first, somewhat hesitant as I have been thinking about purchasing some Amazon product so I could exploit my Amazon Prime features more, some people seemed disappointed in some Kindle Editions and with Fire TV. While I have no experience with Fire TV the Fire TV stick is a real pleasure to use. So is my Kindle HD.", "verified": true, "helpfulness": "0/0", "author": "Eric G. Johnfelt \"Eclectic Collector\""}, {"rating": 5.0, "review": "Love the fire stick!!!", "verified": true, "helpfulness": "0/0", "author": "Carrie"}, {"rating": 4.0, "review": "Some shows have intermintent pausing which becomes annoying, while seemingly nothing is wrong with the network, wireless etc.  While other shows are fine, no hiccups etc.  We wish it had a better way to detect slowness downs and somehow buffer the show for you.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Love it! Wish I had bought one sooner", "verified": true, "helpfulness": "0/0", "author": "Erin Bosworth"}, {"rating": 5.0, "review": "Easy setup, user friendly, great quality! Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "Wish it had online access for more apps but what it has is great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really cool! Easy to use, tons of apps. I'm very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Danny Hergenrader"}, {"rating": 5.0, "review": "Love how easy this is to use", "verified": true, "helpfulness": "0/0", "author": "ksun"}, {"rating": 4.0, "review": "Very please with Fire TV Stick. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "lisa"}, {"rating": 5.0, "review": "Awesome. Love the mobile app as well. Easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Paul"}]