[{"rating": 5.0, "review": "easy to install. very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Ramona"}, {"rating": 5.0, "review": "Fantastic! Monumentally easy to set up and use. LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Kimberly A. Blom-Roemer \"R2-Photography\""}, {"rating": 5.0, "review": "Easier step by step install and on screen tutorial.  I have a chromecast also.  This is more user friendly and easier to watch.  I plan on purchasing one for my parents who are not tech savvy and believe they will be able to get a lot of use from this.", "verified": true, "helpfulness": "0/0", "author": "Mary B"}, {"rating": 5.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "i got my firetv stick free with fuel broadband ,i would never pay for this.all i want to do mainly is mirror the media from my laptop or andriod phone ,lots of apps that supposedly allows you to do this,do any work?does it b*******ksnot any of my devices from windows to andriod can connect to anything installed ot 3rd party apps.waste of space.", "verified": true, "helpfulness": "0/0", "author": "rob ford"}, {"rating": 4.0, "review": "Love everything except for volume control.So far have just used for Videos.", "verified": true, "helpfulness": "0/0", "author": "Linda Rainey"}, {"rating": 5.0, "review": "I can't really knock the stars off for this but it runs Kodi pretty sluggishly but it was not really designed for that so oh well. I would look into disabling both hardware acceleration options. You have to go to Settings (make sure you are in expert mode) then video and hardware acceleration. Can't remember the options but I turned them both off and playback is smoother but not always perfect. I did the same for the Fire TV as well.", "verified": true, "helpfulness": "0/0", "author": "Matthew Gambill"}, {"rating": 4.0, "review": "Great addition to \"Prime\" Membership.Very cost effective way to enjoy features of Prime Membership.It's lightweight, small- not at all bulky and simply plugs in TV.  Setup is simple and I love how it comes already linked to your Amazon profile.Only complaint is that is should come with the voice remote instead of it having to  be purchases separately.", "verified": true, "helpfulness": "0/0", "author": "Danielle Dean"}, {"rating": 4.0, "review": "The remote is very hard to use - very touchy when scrolling.", "verified": true, "helpfulness": "0/0", "author": "Scott Blum"}, {"rating": 5.0, "review": "Best streaming product that I have ever bought. This product is better than the Google Chromecast and it supports better wireless ranges and stores plenty of memory and includes a remote.", "verified": true, "helpfulness": "0/0", "author": "Matthew Senecal"}]