[{"rating": 5.0, "review": "Works great! Love it!!", "verified": true, "helpfulness": "0/0", "author": "B. Shea"}, {"rating": 5.0, "review": "Being a roku owner, I wanted to try the amazon fire stick to see how it compared. It was easy to install and set up. I loved the user interface! It's a must for anyone who has amazon prime!!", "verified": true, "helpfulness": "0/0", "author": "Alicia Laskowski"}, {"rating": 1.0, "review": "I used it for a few weeks and found this not as stable in keeping the network connection. I have to re-establish connection way too often comparing to my other devices that do similar thing. Very disappointed with this product.?", "verified": true, "helpfulness": "1/2", "author": "Anthony Kong \"kongster\""}, {"rating": 3.0, "review": "Nice simple design. It acts up every couple days and it has to be removed and rebooted which is a pain to do.", "verified": true, "helpfulness": "0/0", "author": "Tia Flicker"}, {"rating": 5.0, "review": "Works great.  Use it on our cheap bedroom TV.  Now I can watch videos, or movies and Netflix without going to the living room.", "verified": true, "helpfulness": "0/0", "author": "Pastor 4 Deaf"}, {"rating": 3.0, "review": "While I like the functionality of the Fire TV Stick, when I first set it up I was having alot of problems in regards to freezing and stuttering with the fire stick. I had to replace the ac adapter in order to resolve the issue. Other than that issue, the stick has been fairly impressive. I especially like the self-contained nature of the device.", "verified": true, "helpfulness": "0/0", "author": "MJ"}, {"rating": 5.0, "review": "Very good replaces the need for smart tv and CD player with smart apps my subscription are all there. And it is a space saver", "verified": true, "helpfulness": "0/0", "author": "Lutreb"}, {"rating": 5.0, "review": "Love the compatibility with our kindle fire HDX7s. Had a minor issue the first attempt we made trying to use the mirror cast function but restarted the kindle and all was well. No issues streaming anything and loads much faster than our chromecast. All in all a great purchase after cutting the cable chord.", "verified": true, "helpfulness": "0/0", "author": "Zachary R."}, {"rating": 2.0, "review": "Can only watch certain shows on Hulu plus on it can't turn it off with out unplugging it. Not what I was hoping for", "verified": true, "helpfulness": "0/1", "author": "Randall halbur"}, {"rating": 5.0, "review": "Absolutely,I've this little guy. Trying to convince my husband to finally get rid of that damn Apple tv.!", "verified": true, "helpfulness": "0/0", "author": "Meghan M. \"Meghan M.\""}]