[{"rating": 2.0, "review": "There is no web browser available with this product.  The apps do not include all the content on a site so the selection is limited.  It was easy to install.", "verified": true, "helpfulness": "0/0", "author": "DENISE L HENRETTA"}, {"rating": 5.0, "review": "Love it!!!!!  So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Teresa Sherman"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Tech Dude \"Tech Dude\""}, {"rating": 5.0, "review": "This gives us an incredibly wide variety of viewing for our Amazon Prime and Netflix accounts.  We find that we spend most of our TV viewing time using \"the seashell\".", "verified": true, "helpfulness": "0/0", "author": "Lynn DeRoche"}, {"rating": 2.0, "review": "I ordered one as soon as they became available, but just recently plugged it in and started using it. The interface is user friendly and I like having a physical remote, but the wireless antenna in the devise sucks. I unplugged my chromecast stick and plugged this in to the TV and can't even stream netflix without moving the TV closer to the wireless access point - even though it shows near full signal strength. I am going to have to buy an HDMI extender cable to be able to place the stick 6ft closer to the wireless to get it to work propperly", "verified": true, "helpfulness": "0/0", "author": "Richard Reaksecker"}, {"rating": 4.0, "review": "Great little device. Picture quality for prime content and YouTube doesn't seem to have the quality as ps3 connected to tv for same content. Still good quality. I would give it five stars if I didn't have to have the power cord running to it or if it would have came with a longer cable so I could run it through wall and hidden like my other cables.", "verified": true, "helpfulness": "0/0", "author": "SquareAce"}, {"rating": 5.0, "review": "As an early adopter (Nov 2014), I was expecting a product with a few hiccups out of the box. While I can't get the miracast support to work right (I don't really need it anyway, but I'm a tinkerer), it's done a stellar job at everything else. I used to rely on my Tivo for amazon video, no more.", "verified": true, "helpfulness": "0/0", "author": "Paul Timmins"}, {"rating": 5.0, "review": "It arrived quickly and works excellent", "verified": true, "helpfulness": "0/0", "author": "Patrick O."}, {"rating": 5.0, "review": "Awesome and cheap!", "verified": true, "helpfulness": "0/0", "author": "Arienne"}, {"rating": 1.0, "review": "Netfilx freezes.  Feel like I wasted the extra $8 that I spent on fire stick instead of google chrome stick.", "verified": true, "helpfulness": "0/1", "author": "Joellyn Nunno \"Joellyn Nunno\""}]