[{"rating": 3.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Cate&Nate"}, {"rating": 5.0, "review": "Grand daughter loves it!", "verified": true, "helpfulness": "0/0", "author": "Mary Mendes"}, {"rating": 5.0, "review": "Compact; easy to assemble; *easy to hook up; easy to use.  What more could I want?  Too bad they didn't include a voice-activated remote control as part of the set-up rather than make it an extra-cost extra, but otherwise we're very happy with our Fire TV Stick.  (*However, there is one drawback:  the power cord is only 5' long; it should be 7' to 8', which would add relatively little cost for Amazon but would add positively to customer convenience.  I had to add a short extension cord in order to plug my unit in to the nearest outlet.)", "verified": true, "helpfulness": "0/0", "author": "Marvin Nance"}, {"rating": 5.0, "review": "Love It.", "verified": true, "helpfulness": "0/0", "author": "johnny fortune"}, {"rating": 4.0, "review": "Very nice unit and excellent to use. Quite an interesting product with so many channels and programs", "verified": true, "helpfulness": "0/0", "author": "jk"}, {"rating": 5.0, "review": "Awesome so far! Only problem I have is streaming. Stops to load a lot", "verified": true, "helpfulness": "0/0", "author": "Christie Eyer"}, {"rating": 5.0, "review": "Fabulous, great content (much free), extremely small footprint.  Have not watched anything on my cable channels for two weeks now except weather news (impending snow storms). Plug it in and you have instant \"smart TV\".  If live sports were available ala carte at a reasonable fee, you could probably dump your cable tv service altogether.  A few issues:  when you first boot up the device, you need to \"register\" it through your Amazon account.  For some reason, my credentials were not recognized even though I could use them to login from other devices such as my iPad.  Ended up having to call Tech Support.  After speaking to two different agents and about 40 minutes was finally able to login.  Since I had purchased two at the same time, I inquired if I would have to do the same thing for the 2nd one.  That didn't prove to be the case however.  I have also added a third with no problem.  The other issue is sometimes when I turn the tv on and it is set to the port with the stick, it comes up fine, but if I switch to another hd I port (for live tv) and then go back to the port the stick is in, it doesn't boot up.  Unplugging the stick from the port and plugging it back in fixes the issue.  Don't know if this is related to Amazon service or my tv, network, etc.  This is a brand new LG HD set on a fios network.", "verified": true, "helpfulness": "1/1", "author": "Tina"}, {"rating": 5.0, "review": "My son got this to give to me for my birthday and we have enjoyed watching several movies with it. I am sure that we will watch other things when we learn to use it better. It was a nice gift from my loving son.", "verified": true, "helpfulness": "0/0", "author": "Donna Harryman"}, {"rating": 5.0, "review": "Works well.  It rocks.", "verified": true, "helpfulness": "0/0", "author": "G. Gray Mcdonald Jr. \"Finding my way\""}, {"rating": 4.0, "review": "Love them. Make the perfect gift.", "verified": true, "helpfulness": "0/0", "author": "Maurice A Upshaw Jr"}]