[{"rating": 1.0, "review": "It is constantly searching for the internet and buffering. I have a great internet connection and it the router and modem are in the same room as the device. It is clearly faulty.", "verified": true, "helpfulness": "0/0", "author": "Nathan F."}, {"rating": 5.0, "review": "This is a great product, highly recommend it. Easy to setup and use", "verified": true, "helpfulness": "0/0", "author": "2 tropical dogs"}, {"rating": 3.0, "review": "Cox TV will not allow HBO Go to be accessed by Amazon Fire Stick", "verified": true, "helpfulness": "0/1", "author": "Jerry Williams"}, {"rating": 5.0, "review": "Easy to install. Netflix works well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Exactly as advertised, get everything I want in one package.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This Thing is awesome. especially for a college student like myself. Super Easy to use and set up, plus its really portable and small. the apps are phenomenal, I'm currently watching the NBA finals on the ESPN App, plus you have Netflix, Spotify, YouTube, and tons of others that I constantly use. Picture Quality is great, no complaints! Because of this I have yet to hook up cable in my new apartment. 10/10 would DEFINITELY RECOMMEND!!!", "verified": true, "helpfulness": "0/0", "author": "Flynn Lemonnier"}, {"rating": 3.0, "review": "Super quick shipping. The product is everything I hoped for. Say goodbye to your cable bills cuz fire stick is where it is at! Keeps my kids entertained providers me with enough channels to satisfy.Update. I've had this for about three months, it has already started to malfunction. During use it randomly cuts out and my tv displays no signal. Then it will come back on. It's annoying and happens after 30 return policy. I believe its the poor design of the fire stick as it really heats up at times, it lacks any vents for cool down or fans. We all know how important it is to keep electronics from heating up so this is obviously pure ignorance in design or maybe it's intentional to make money. I say go with the roku as it has seriously addressed these concerns. Sorry Amazon you lost my prior 5 stars due to this.", "verified": true, "helpfulness": "0/0", "author": "Sonar"}, {"rating": 5.0, "review": "Love the roku but decided to try this in a spare room in our house. My wife and I love it.", "verified": true, "helpfulness": "0/0", "author": "Dillin G. Wright"}, {"rating": 4.0, "review": "Amazon, will you please get with MLB and help them to develop an MLB Premium app that is watchable. It's not my connection speed as every other thing works perfectly on my stick. The constant starts and stops make watching a game unbearable. I realize that this is more MLB's problem but I've already complained to them too.", "verified": true, "helpfulness": "0/0", "author": "Brian Mather"}, {"rating": 5.0, "review": "This is the best, very fast very easy to use,  my kids love it.", "verified": true, "helpfulness": "0/0", "author": "Luis  R."}]