[{"rating": 1.0, "review": "When I first got this product I was impressed. But the honey moon period is over. It constantly freezes, crashes, and simply doesn't work well. Very disappointing. I urge you to look at other options.", "verified": true, "helpfulness": "0/0", "author": "Teresa K"}, {"rating": 1.0, "review": "Constant WI-FI network connection issues which seem to be getting worse. No matter the app, distance to the router or distance from the TV using 6 ft HDMI extension. JUNK!", "verified": true, "helpfulness": "0/0", "author": "Daniel H"}, {"rating": 5.0, "review": "I absolutely love it.  Perfect for my needs,  Small remote the only thing I would do would be to put a few more instructions about turning it off on the paperwork that comes with it.  Us old folks like written instructions.", "verified": true, "helpfulness": "0/0", "author": "Peggy Stephenson"}, {"rating": 3.0, "review": "When it is working, the Fire TV Stick is awesome (fast connection, unobtrusive) - however consistency is it's downfall. Some days it works like a charm, other days it turns off the TV automatically, or requires restarting it to access certain applications (like SlingTV). These issues seem to be random - same WiFi connection, some hardware, etc", "verified": true, "helpfulness": "0/0", "author": "A. Fortner"}, {"rating": 5.0, "review": "Very smooth, enjoyable", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Have 2 of them and they work GREAT!! Very happy, exceeded expectations and would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Bought mostly to extend get my Plex on TV. Unfortunately Fire TV stick is not compatible with DTS or 5.1 pass-through HDMI. Aside from this issue great overall solution, especially for prime users with movies and music access.", "verified": true, "helpfulness": "0/0", "author": "Howdoin"}, {"rating": 4.0, "review": "The streaming is smooth and seamless. The remote navigation takes some getting used to.", "verified": true, "helpfulness": "0/0", "author": "Tony Orum"}, {"rating": 4.0, "review": "my android phone can not find this device using the fire stick app", "verified": true, "helpfulness": "0/0", "author": "pumma \"Pumma\""}, {"rating": 5.0, "review": "Perfect little gadget to be able to watch movies and listen to music.", "verified": true, "helpfulness": "0/0", "author": "Bradley S."}]