[{"rating": 5.0, "review": "This is probably my favorite streaming device. It is small, never lags or buffers, easy to set up and comes with a remote. The remote really helps with navigating. I wish it lit up for late night in pitch dark binge watching sessions though.", "verified": true, "helpfulness": "0/0", "author": "Dovahkiin"}, {"rating": 4.0, "review": "I really like it, but surprised how many things aren't covered on Prime. Renting some movies cost insane amounts, some more than my old Blockbuster account's monthly charge. The TV show seasons offered are great, so much to catch up on.The device works great, easy to install. I have had NO buffering issues or lag to watch shows.", "verified": true, "helpfulness": "0/0", "author": "C. E. Sawyer"}, {"rating": 4.0, "review": "Love this device!  No complaints", "verified": true, "helpfulness": "0/0", "author": "Kerrene Forde"}, {"rating": 5.0, "review": "I picked this up for my dad as a Christmas gift. He's not exactly 'tech savvy' and I'm trying to get him to ditch cable TV.Good news: It's easy enough that even the technologically challenged can use it. Really straightforward interface.Bad news: Said interface can suffer from lag/slowdown when searching or using any of the typing functions like you would to enter a password.Minor grip.Overall nice little streaming stick.", "verified": true, "helpfulness": "0/0", "author": "Jon Frederick"}, {"rating": 1.0, "review": "Cannot even get a steady signal more than one room away.  Unless your in the same room as your router or have the router that the wall is on back to back with the Fire stick the signal will not be strong enough to stream anything.  This thing unforntunately was poorly designed, whether intentionally or not.", "verified": true, "helpfulness": "1/2", "author": "I have to say..."}, {"rating": 5.0, "review": "I find the fact that this Fire TV Stick can get on any Guestnets now, is one of the best reasons to get the Fire stick TV. Going out of town and checking into a WiFi at a hotel or Hospitals? Well the agreement pages at the guestnets would be hard to get by if it didn't have a way to see them. FireStick just recently added the Guestnet feature and it's great. Being able to have the portability and the ability to connect to the questnests everywhere you go is great. Now you have more choices of Movies on the go.", "verified": true, "helpfulness": "0/0", "author": "Kevin S"}, {"rating": 4.0, "review": "We love our Fire Stick! It's so easy to take to the other room when we need to. The remote is super easy to use and so light and small. So much content and the apps are nice to! Great product!", "verified": true, "helpfulness": "0/0", "author": "Kristy"}, {"rating": 3.0, "review": "The interface is great, but video playback is sub standard.  I constantly get stuttering video and audio/video sync issues no matter which app I use, mainly youtube and plex.  Ive never had these issues with my chromcast. pausing the video for a few second usually fixes the audio sync, but the video just randomly stopping for several second is really annoying.*** I have an update.  I recently upgraded my wifi to a 300 Mbps access point (from  54 mbps) and the performance is much better. I still get some occasional stuttering while using Plex, but have not lost wifi connection and has not completely stalled since. I also no longer have audio sync issues.", "verified": true, "helpfulness": "0/0", "author": "T. Erickson"}, {"rating": 1.0, "review": "The unit heats up to the point you can't hold onto it.The wireless connection is constantly having issues, buffering what seems like every couple of minutes.It's not any issues from my wireless since I have other devices that work fine, mainly my Roku and BR player.", "verified": true, "helpfulness": "1/1", "author": "JB"}, {"rating": 5.0, "review": "When Amazon first offered this at half-price for Prime members, I shrugged and said \"Meh.\"  Then my brother showed me his in operation.  No longer \"Meh,\" I ordered mine that day.  It arrived a good month ahead of schedule, too (kudos, Amazon!).  So, how does it perform?  The Fire TV Stick works *at least* as well as my AppleTV (both are playing through a Denon receiver on a Mitsubishi 65\" 1080p DLP), and it's great having access to my Prime Movies and TV Shows on the big screen in my TV room.  The video is HD and the sound is quality stereo.  So far I have observed no buffering, video, or sound quality defects.  If you're trying to decide between the Fire TV Stick and an AppleTV (at twice the price)... honestly, it may just come down to brand loyalty.  Both have Netflix and other general favorites, so it is a question of which company you've bought more videos from.  If you are starting out fresh, and aren't already heavily invested in Apple Store movies and TV shows, I'd recommend going with the Fire Stick.  It costs less than half what the AppleTV does, and the video quality is on par between the two.  Additionally, Amazon Prime offers a fair amount of free programming (which Apple does not).  And, because the Fire TV Stick is so affordably priced, I'm not even upset that I didn't get this when it was half price! (Ah, who am I kidding?  I'm going to be kicking myself over that for a while!)", "verified": true, "helpfulness": "4/4", "author": "S.M. O'Brien"}]