[{"rating": 1.0, "review": "I am really unhappy with this product. Before I received the Amazon fire stick I was so excited to take advantage of all its capabilities with such a low price. However, if you don't have Amazon prime be ready to become a member. It signed me up for Amazon prime with out my permission because I ordered a movie for $12.99 which you don't have to be a member to do.The wifi strength on this device is terrible for me. I have barely been able to use it because every time I want to watch something or use an app it takes me about 15 minutes for it to load correctly with out saying \"network error\". By the time I get it working, that is IF I do, then I'm too frustrated to continue use.The device blames my network connection but every other device in this house is working. Cell phones, tablets, and laptops. It is not because too many devices are connected either because I never had this problem with my Google Chromecast. Even when the device is running properly it still has very long loading times.I'm not one to make a huge fuss on a review I have just never been so disappointed with a piece of technology. I would not recommend this to anyone.I am very upset and I will be making a return.", "verified": true, "helpfulness": "0/1", "author": "Stephanie"}, {"rating": 5.0, "review": "Good stuff.", "verified": true, "helpfulness": "0/1", "author": "Johnson"}, {"rating": 5.0, "review": "I bought this for my mother who is not tech savvy in the least. She found it easy to navigate once she watched the tutorial at the beginning of set up. She's happily watching all her favorite shows on Netflix now and has not needed me to reset anything. ..yet.", "verified": true, "helpfulness": "0/1", "author": "Brenda"}, {"rating": 4.0, "review": "Very convenient and powerful little stick. I like that you can carry it with you wherever you go and it works.", "verified": true, "helpfulness": "0/1", "author": "anesh"}, {"rating": 5.0, "review": "Lovee it. No problems with is. Use it in my kids tooms", "verified": true, "helpfulness": "0/1", "author": "Emperatriz betancourt"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/1", "author": "b"}, {"rating": 5.0, "review": "Best thing ever cable doesn't even compare to this.", "verified": true, "helpfulness": "0/1", "author": "wifey1"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "KJL"}, {"rating": 5.0, "review": "Love this little thing.", "verified": true, "helpfulness": "0/1", "author": "Deborah J. Terry"}, {"rating": 5.0, "review": "Love our Fire TV stick.", "verified": true, "helpfulness": "0/1", "author": "Kim"}]