[{"rating": 5.0, "review": "Features are great. Easy to use with little or no problems.", "verified": true, "helpfulness": "0/0", "author": "C. Rodriguez"}, {"rating": 4.0, "review": "I'm happy with the product.", "verified": true, "helpfulness": "0/0", "author": "Brendan Henschel"}, {"rating": 5.0, "review": "It took a while to get it set up on the TV, but everything is working great now.  Love all the options.", "verified": true, "helpfulness": "0/0", "author": "Sharalyn I. Jenson"}, {"rating": 5.0, "review": "I wish I would have known about this sooner. I was using a Smart DVD player, but it does not even compare to this. The fire stick is easy to use. My 5 year old maneuvers through it with ease. The thing I really like about it is that you can put in any titel of a movie you like and it will show you every app on your fire stick that has it for free or otherwise. It really makes searching for a movie a lot faster and convenient. It does come with a remote. Great buy everyone should have one.", "verified": true, "helpfulness": "0/0", "author": "Ginger bridges"}, {"rating": 5.0, "review": "Excellent connection to Internet, well worth the money.", "verified": true, "helpfulness": "0/0", "author": "jdmiller sr"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "S Widner"}, {"rating": 4.0, "review": "Love the app selection. Can be a bit sluggish at times, and I wish it had an IR receiver so I can control it with my Harmony remote. Otherwise, my favourite steaming device so far.", "verified": true, "helpfulness": "0/0", "author": "Chris H"}, {"rating": 5.0, "review": "I love how easy the Amazon Fire TV Stick is to use.  It is very intuitive and just a delight!  I have really enjoyed all of the apps that are available and I love that the apps stay current and the programming is quite entertaining.  I love having so many options!", "verified": true, "helpfulness": "0/0", "author": "Infinity"}, {"rating": 4.0, "review": "I had put in a return request on the Fire TV Stick, with a scathing complaint about its inability to hold a wifi connection that it rated Very Good one second, nonexistent the next. I worked my Internet provider over pretty hard (and there were issues there as well), but still no joy with the Fire Stick. Finally, in sheer exasperation with the whole situation, I took the advice of one of the Verizon techs - try a wifi range extender! So I spent another $35, and guess what - now the Fire Stick works like a champ. I'm not giving 5 stars, because I feel Amazon has been less than forthcoming in not warning that it's likely some users will need to double their investment before getting satisfactory performance. That said, I also found the search function somewhat lacking. I went looking for Sling Player for Fire TV, and got no results on the search. Really, Amazon? It was only upon lengthy clicking through the Apps menu that I finally found it. Once found, it works great. So I cancelled my return request and post this caveat for future buyers.", "verified": true, "helpfulness": "0/0", "author": "Karen M. Nash"}, {"rating": 5.0, "review": "This gift was much appreciated", "verified": true, "helpfulness": "0/0", "author": "cliff b"}]