[{"rating": 5.0, "review": "Love the compact size, it's undetectable and fits on the side of my TV.  Hands down the best streamer, with lots of content.", "verified": true, "helpfulness": "0/0", "author": "N. Buckman"}, {"rating": 5.0, "review": "Absolutely love the Fire tv stick. You can do so much more than with chrome cast. And best part since I'm a prime member it's basically all free!! Love love love this!", "verified": true, "helpfulness": "0/0", "author": "Therise Bond"}, {"rating": 5.0, "review": "must buy, is it perfect maybe not for the price is really good. just plug it in the tv and power outlet and you done. If you have prime and you bought it on your account the stick is programmed to work with your account from the start. I don't have a internet TV so this with a quick fix for Netflex to Amazon prime kids movies alone will save you a fortune..", "verified": false, "helpfulness": "0/0", "author": "Michael C."}, {"rating": 5.0, "review": "Works exactly as advertised.  I like it better than my Roku box.", "verified": true, "helpfulness": "0/0", "author": "Navigator \"heets\""}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Reinaldo collazo"}, {"rating": 4.0, "review": "This is a fantastic device. I've used it for a month now and the only trouble I've had from it is the Hulu app.Hulu will freeze shortly after it plays a commercial or start playing with only the audio. Overall a very disappointing app on a great device.", "verified": true, "helpfulness": "0/0", "author": "Jester In Courts of Chaos \"IneffibleMind\""}, {"rating": 3.0, "review": "Only benefits so far are access to Prime and I like Allcast. My TV keeps turning off while using Fire Stick, very annoying, and I am disappointed at how many things I want to watch cost additional money.", "verified": true, "helpfulness": "0/0", "author": "Robbin Benson"}, {"rating": 5.0, "review": "We love our Fire Stick. It is so much more reliable and easy to use than our Internet tv for accessing Wi-Fi applications plus there are many more selections. It was a smart purchase!", "verified": true, "helpfulness": "0/0", "author": "Alan Hodges"}, {"rating": 5.0, "review": "Works great.  Have 3 in the house so far.  Kids have the game controllers with theirs.  May buy another 2 for the other TVs.", "verified": true, "helpfulness": "0/0", "author": "Geoffrey M. Andrikanich"}, {"rating": 5.0, "review": "I LOVE my Fire TV Stick. The packaging is sleek, the instructions are simple, it was ridiculously easy and quick to install. I'm ordering another one for the living room TV. I don't want to share with my Mom. If you love to binge watch, this is your product.", "verified": true, "helpfulness": "0/0", "author": "Jackie Renteria"}]