[{"rating": 4.0, "review": "This is the worst product for Internet tv I have ever bought. I also have Apple TV and rook 3. All my movies have an a screen over all content that gives only sound and a blue screen. There is no number to call for help. Save your money and go google or roku because this product is the biggest joke and the joke WILL be on you.I have since gotten an e mail from Amazon stating they would work to make it work. Nice and I placed the unit on another TV and all is working fine. Apparently you have to put it directly on a hdmi port on the TV. If it runs through another cable you get the unarthorised user blue screen.  It is working fine at this time and like the ability to get Amazon music through it. The trouble I had earlier is the only reason for the 4 stars.", "verified": true, "helpfulness": "0/0", "author": "DAVE'SCAVE"}, {"rating": 5.0, "review": "i got more then i thought i would! it does everything and it just goes in an HDMI port on the TV!", "verified": true, "helpfulness": "0/0", "author": "scott a kessler"}, {"rating": 5.0, "review": "Easy to set up and use.  Lots of viewing options.", "verified": true, "helpfulness": "0/0", "author": "fairfan11"}, {"rating": 2.0, "review": "We have a Roku, Chromecast, Apple TV and now the Fire TV Stick. Out of all of them I like the Fire stick the least.  It seems like it's the least reliable in terms of maintaining a connection and seamlessly streaming content. I constantly have problems with a dropped network connection and this has never happened with our other devices. Another complaint is with the interface. I understand that this is an Amazon device, but it's very focused on Amazon steaming video. Getting to thee content channels is more difficult than it should be. I do like the app that works with it. It makes searching much easier than using the remote that other devices supply. Overall, I wouldn't buy this device again. I think the Roku is much more reliable and only marginally more expensive.", "verified": true, "helpfulness": "0/0", "author": "laural \"Laura\""}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Victor Rivera"}, {"rating": 1.0, "review": "Product doesn't work (connects to WiFi, but keeps giving error messages that it \"can't reach amazon.com\". The support page is not helpful with just a bunch of FAQs, and there does not seem to be any real support.", "verified": true, "helpfulness": "0/0", "author": "Markus heilig"}, {"rating": 5.0, "review": "Love it...", "verified": true, "helpfulness": "0/0", "author": "Terrell Barnes"}, {"rating": 5.0, "review": "so happy when this was ready for shipping! It quickly became a favorite of my visiting 5 yo grandson, who became convinced that the wonders of the world resided in the fire stick, and not the cable! Easy even for a senior to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Haggys \"Haggy\""}, {"rating": 5.0, "review": "Absolutely fantastic.works wonderfully. An amazing array of things to watch. I love it.", "verified": true, "helpfulness": "0/0", "author": "Carol Ruthen"}, {"rating": 5.0, "review": "Works great with sideloaded apps", "verified": true, "helpfulness": "0/0", "author": "Troy"}]