[{"rating": 5.0, "review": "I am electronically challenged and I was able to set it up and begin using it without any problems.", "verified": true, "helpfulness": "0/1", "author": "mike"}, {"rating": 5.0, "review": "Love my Kindle Fire Stick. I have Kindle Prime so I have movies, TV shows, music, and my photos stored in the Amazon Cloud at my finger tips and all on my big screen HD TV.", "verified": true, "helpfulness": "0/1", "author": "Youngatheart"}, {"rating": 4.0, "review": "It works well, and a much cheaper alternative to buying a smart TV for my bedroom. I've had a few problems with it finding my internet connection, but I leave it plugged into my wall, so if I disconnect it to reset, it works just fine after. I use it for Netflix and Amazon Prime Videos.", "verified": true, "helpfulness": "0/0", "author": "Dinorah"}, {"rating": 5.0, "review": "Really awesome. I wish it had one for the living room since I am disabled but I can afford it. Really awesome product!", "verified": true, "helpfulness": "0/1", "author": "GINGER K STEWARD"}, {"rating": 5.0, "review": "The Fire Stick was easy to install and allows for a very large selection of viewing especially if you are a Amazon Prime Customer.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Dumped my cable, love this, lots of apps, easy to use, I think it's better than apple tv.  Tried google's and couldn't even get it to work.  This is great, I have one for each of my tv's.", "verified": true, "helpfulness": "0/1", "author": "consumer"}, {"rating": 3.0, "review": "The commercials on TV make the Fire Stick look so easy to plug in and use. They don't show that the stick had to be plugged into an outlet or another USB port", "verified": true, "helpfulness": "0/0", "author": "Jackie the busy Mom"}, {"rating": 5.0, "review": "Love this item!", "verified": true, "helpfulness": "0/0", "author": "Ricky Stewart"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Parker Lingon"}, {"rating": 5.0, "review": "Excellent device, works perfect.  No problem getting it setup and working.", "verified": true, "helpfulness": "0/0", "author": "Lea \"Lea\""}]