[{"rating": 5.0, "review": "Worked great right out of the box with little or no effort. I'm a fan!!", "verified": true, "helpfulness": "0/0", "author": "Kay Van Aacken"}, {"rating": 2.0, "review": "It works like a smart TV, not very smart, though.", "verified": true, "helpfulness": "0/3", "author": "Yiping Lu"}, {"rating": 5.0, "review": "perfect item, it is amazing, i have installed some android apps like mozilla firefox, the standard control is unconfortable for gaming, but im not a game fan, so.... now i have an smart tv for only $26. thanks amazon!!!!", "verified": false, "helpfulness": "0/0", "author": "Eric Bris"}, {"rating": 5.0, "review": "Works awesome!", "verified": true, "helpfulness": "0/0", "author": "michele marx"}, {"rating": 5.0, "review": "Love, love, love. Need I say more? :)", "verified": true, "helpfulness": "0/0", "author": "Jacqui"}, {"rating": 5.0, "review": "play's amazon video.comes with a remote.actually plays games! even with the default remote!miracast support!but the downside is it dose not have the deep in-app integration that chromecast has,you can't just click a button in your favorite video app, and have it continue playing on the screen.but the fire TV stick is set up to be a media center, not a companion device like the chromecast,if you want something you can just turn on, watch a movie or show, then leave, it's great!However the UI is VERY amazon centered.you have multiple sections for the amazon video's TV, Movies, prime movies,but if you want to watch netflix, hulu, or youtube, you must leave that section, go to the 'Apps' section, then scroll through a combination of games, apps, and streaming (services all in one big list) to find what you need, and that can be a bit cumbersome.the 'recent's section' is a big help, but I'd still prefer better organisation then 'amazon stuff' and 'everything else'but the fact that you can side load apps like XBMC really is the icing on the already delicious cake,it's not an official option, but without hacking, modding, or jailbraking/rooting, you can easily install your own android apps!that's something the chromecast can not do, even with modding!", "verified": true, "helpfulness": "0/0", "author": "BOBdotEXE"}, {"rating": 5.0, "review": "The fire TV stick works just fine.Thanks.", "verified": true, "helpfulness": "0/0", "author": "Sol A. Gonzalvo"}, {"rating": 5.0, "review": "Easy setup.Easy use all around.", "verified": true, "helpfulness": "0/0", "author": "London"}, {"rating": 4.0, "review": "I've had a Roku and a smart BluRay player, both really easy to set up and use, but I've been looking for something that doesn't take up a lot of space so I chose the Fire Stick, mainly because of the introductory offer of a discounted $19.99. It comes in a very small black box and has everything you need to connect it to your tv.Set up, for me, was tricky. I have DSL service so, on a good day, get about 7mbps, not great, but better than my old 2.29 mbps from another provider. The Fire Stick, right off the bat, kept giving me error messages that the internet either wasn't connected or was too slow and kept shutting down during the inital connection and download of an upgrade. After about a half an hour waiting for the download to install, the Fire Stick let me into the service.Trying to log in and set up my various accounts on all the services I use, frustrating. Then I tried to watch a show. I kept getting error messages about the slow internet connection and got really frustrated, so went back to watching those services on my desktop. I really wanted to love \"the stick\" (eww, that sounds a bit creepy), but was so frustrated I decided to give it a rest.Well, I tried again tonight and, guess what? OK I'll tell you, it worked great. No error messages, picture was incredible, sound fine, Netflix and HULU loaded and played as they should and an Amazon Prime show played flawlessly.I'm giving it 4 stars because, since I have no problems with my internet connection while watching shows on my Fire HDX I expected the same quality of connection in the Fire Stick. Also I was hoping that Acorn TV (British television) might be in the app line up and isn'tI did try the Fire TV remote app for android and it works pretty good. Haven't tried the voice search option yet, but do like the idea of having a remote always as near as my phone.", "verified": true, "helpfulness": "0/0", "author": "Yodi \"DJ Burma\""}, {"rating": 4.0, "review": "Fairly nice device with fluid navigation. Seems smoother than my roku stick.  Seems like you pretty much need prime to enjoy the amazon content with Netflix and other apps kinda pushed back to page two of the menu but not too difficult to locate and launch any of the apps. The output looked great on my samsung smart tv.  Some of the cable premium apps like showtime don't connect with charter cable company credential, but neither does the Apple TV for that matter. The hardware remote is excellent and intuitive. The remote app for android os seems pretty cool. I would say overall this is a great value for the money.  I have most of the steaming devices Roku xs, amazon stick, roku stick, Apple TV, and chromecast.. I have listed these in the order of my personal preference. I feel an up to date roku box ( not stick) would still be the champ amongst these contenders. I will say I was really surprised that the fire stick does place a solid second for me and when you factor price it almost can't be beat. I personally would not compare this to chromecast the fire stick I feel is a much easier for simple streaming. I hope to see this device give roku a good run in the future.", "verified": true, "helpfulness": "1/1", "author": "DjFRERE \"DjFRERE.com\""}]