[{"rating": 5.0, "review": "Get rid of the high price of TV. Fire Stick is a great value", "verified": true, "helpfulness": "0/0", "author": "Dr Paul"}, {"rating": 1.0, "review": "It's a piece of junk... I'm very disappointed with this product by Amazon 😩You ALWAYS have to enter the password of your wifiIf you fail to connect to the Internet... I need a refund for this...", "verified": true, "helpfulness": "0/1", "author": "Manny"}, {"rating": 1.0, "review": "I love the Amazon Fire TV so my expectations were high with the Fire Stick.  I have had so many problems with it losing connection and having to disconnect my internet only to \"reset\" the stick.  At first I thought maybe it was my speed or possibly a weak single strength in my house but each speed test is showing i'm getting what i'm supposed to.  And streaming prime tv shows/movies is just fine from my laptop in the same area of my house.  I'm returning and getting the regular amazon fire tv.  I don't have time to spend waiting to buffer....", "verified": true, "helpfulness": "0/0", "author": "Hannah Spann"}, {"rating": 5.0, "review": "I just opened the package and already enjoying TV shows on Netflix great device for the price", "verified": true, "helpfulness": "0/0", "author": "ury22"}, {"rating": 1.0, "review": "Huge connection issues. In searching for answers online, found a forum devoted to the same issues i was having. I even did all the things the trouble shooting guide suggested abs still it would play for 2-3 minutes then stop and start searching for the WiFi then finally after 5-10 minutes of searching it would say no connection. Phones, ipads, Kindle, and chromecast all worked with no issues wife the fire stick struggled to stay connect. Extremely disappointed and am getting rid of it and buying apple tv tomorrow.", "verified": true, "helpfulness": "0/0", "author": "Bonnie"}, {"rating": 5.0, "review": "So far, we are loving the fire stick", "verified": true, "helpfulness": "0/0", "author": "Jessica Hammeke"}, {"rating": 1.0, "review": "I was disappointed. Was just expecting more.", "verified": true, "helpfulness": "0/1", "author": "Lonny Kramer"}, {"rating": 5.0, "review": "Awesome product that does a lot. The remote is a bit cheap, and I suggest upgrading to the remote with voice search. The remote itself feels better in your hand. It is really easy to setup and get going watching movies.", "verified": true, "helpfulness": "0/0", "author": "Overachiever"}, {"rating": 5.0, "review": "We have the Apple TV and a Hulu account for watching tv shows and use Amazon Prime for our movie watching. I didn't want to get another hundred dollar item just so we could easily watch movies so was very excited to have this option. It works well. While my husband and I both agree that we find navigating apps is easier in the Apple TV, this is a perfect item to add to our entertainment system. This product has rounded out what we were missing and has taken us one more step in the right direction to unplugging our cable.", "verified": true, "helpfulness": "0/0", "author": "Jenni"}, {"rating": 5.0, "review": "It is awesome.  What ever we want is obtainable.Makes it easy for my child to find her shows.", "verified": true, "helpfulness": "0/0", "author": "Roderick Zavala"}]