[{"rating": 5.0, "review": "Just what we needed for our bedroom. Netflix, Pandora, SlingTV and other apps work great. :)", "verified": true, "helpfulness": "0/0", "author": "Erik L"}, {"rating": 3.0, "review": "The stick works well and is snappy in response but lacks apps found in Roku -- TWC.  I use Time Warner Cable and eventually replaced this with Roku sticks since Roku supported the TWC app to watch the channels instead of a rented box.  I have Xbox's too that can do it but it much simpler to not power up the Xbox's just to watch TV.The remote is fine (like Roku), the speed is fine (like Roku), and its just as easy to connect as anything else like it is.This Amazon stick works OK, but does not have the content of Roku -- simple as that.  Roku also has Amazon Prime so I see no need to have the Amazon stick instead as it offers less than Roku.If these were $10 and you did not care about TWC, then these would be OK.", "verified": true, "helpfulness": "0/0", "author": "C. Sulto"}, {"rating": 2.0, "review": "Installation of the stick caused the year old TV to power off without explanation. We moved it to an older TV and it works fine.", "verified": true, "helpfulness": "0/0", "author": "Susan S"}, {"rating": 5.0, "review": "Worked better than I thought. I love this device and have already recommended to all my friends and family", "verified": true, "helpfulness": "0/0", "author": "dann1286"}, {"rating": 5.0, "review": "There is no going back from the fire stick. Previously we used a Rocku2, the difference is phenomenal, both in speed and quality of the platform.Great buy.", "verified": true, "helpfulness": "0/0", "author": "Pablo Micolini"}, {"rating": 5.0, "review": "Really works well, replacing many pay per view channels currently for me! ;)", "verified": true, "helpfulness": "0/0", "author": "Donald Gallagher"}, {"rating": 5.0, "review": "Works awesome! And the mirror phone feature works great with no wifi needed.", "verified": true, "helpfulness": "0/0", "author": "daniel penate"}, {"rating": 5.0, "review": "Very enjoyable it brings my kindle to TV with all the same viewing options.", "verified": true, "helpfulness": "0/0", "author": "Julian Saavedra"}, {"rating": 4.0, "review": "Exceeded expectations", "verified": true, "helpfulness": "0/0", "author": "Josh Woodson"}, {"rating": 5.0, "review": "Couldn't be happier with this,,,just wish it didn't have to be plugged in", "verified": true, "helpfulness": "0/0", "author": "Michael J. Tornambe"}]