[{"rating": 4.0, "review": "Works nicely and easy to install. In fact it installs itself.", "verified": true, "helpfulness": "0/0", "author": "Dennis Jackson"}, {"rating": 5.0, "review": "I received my Amazon Fire TV Stick last week and I love it. It is able to get and keep a wifi signal in a notoriously weak signal strength area of my house. It's simple and effective.", "verified": true, "helpfulness": "0/0", "author": "Scott Majka"}, {"rating": 4.0, "review": "I set password protection. From prime video, it also requires password. I'm expecting it only require it for >$0.00 videos.  Otherwise, it fits all of my needs: easy to setup, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works great. Lots of free movies and content but still wish there was more.  Wish rentals were cheaper too.", "verified": true, "helpfulness": "0/0", "author": "Greg Morris"}, {"rating": 4.0, "review": "If you've decided to \"cut loose,\" this stick should answer the needs of anyone who isn't an addictive watcher of the current talk shows on MSNBC, FOX, or Comedy Central.  Since my wife can't part with those channels--nor, for that matter, with American Movie Classics and Turner Classic Movies--I continue to scrape together a couple hundred per month to send to Time-Warner cable.  (No matter that you can still summon up a number of these shows as \"archived editions\": the perception that what you're watching is not \"current\" is simply too much of a downer for some viewers.)Solution: For me it was the new Sony 48\" Smart TV (going on Amazon for under $550).  I frankly didn't expect the set to be as versatile as it is.  Sony apparently has no reservations about use of their equipment for viewing competing media sources like Netflix, Amazon, and (if you download the appropriate app) non-Android streaming purchases from Apple iTunes.The problem is that now I've got almost 200 invested in set-top boxes I don't need and have no interest in peddling.  I've managed to unload the Google stick on my son, but a couple of Roku boxes (imo, the best set-top box--in any of the 3 price ranges--if you plan to have only one) and two Amazon Fire devices remain.As far as the pictured Amazon device, it works flawlessly if you remember one thing.  Initially, I kept getting messages that power was inadequate to complete the loading of various films I had started to stream.  Once I turned off power to the Time-Warner box, the stick worked like a charm--but I've found no advantages with the stick when compared to the built-in smart technology of the Sony.  It might be useful in various hotels and guest houses, if you're a frequent traveler--or perhaps with the TV in the laundry room.Compared to the Chromecast, I much preferred the Amazon Fire Stick. The Chromecast comes with an optional USB connection for power--but my prior TV lacked any such port.  Moreover, the Chromecast required use of the Chrome browser, courtesy of the ubiquitous and, insidiously invasive, forever \"monetizing\" Google (I realize the same could be said about Amazon, but Bezos' mega-network store seems more \"up-front\" about what's being sold to whom and for how much).  Finally, the wire attached to the Chromecast--even with the included extension--was a foot shy of reaching the included electrical adapter.Not only did the Fire Stick's wire extend to the electrical outlet on the floor but there was no requirement--or even recommendation--that a USB connection be employed. Finally, and perhaps most importantly (especially if you're one of the rare individuals who doesn't \"misplace\" the remote on a daily basis), the Fire Stick comes with a handy / dandy remote control.  If by some happenstance you find yourself with both the Fire TV Box and the Fire Stick, their remotes are not instantly, or automatically, interchangeable.  You'll need to go through a one-step process to pair the two remotes--which required no more than 5 seconds, which is not bad for a \"techno-ritard\" such as me.If you have both remotes, and have paired them, keep the Amazon Fire TV as your first remote and the Amazon Fire Stick as a spare.  The Amazon Fire TV is the heaviest remote that I've handled (compared with Roku, Google, Apple similar devices), giving its user a greater sense of \"authority\" in his program selecting.  It also comes with Amazon's celebrated \"Voice Search,\" which is supposed to function equally well with the Fire TV Box or the Fire Stick.  I suspect I'm the only Amazon client on the planet incapable of summoning up a program by voice with either of the Amazon remotes.  I've tried everything, changing my voice from bass to falsetto soprano, whispered, shrieked, lobbed up hanging curve balls (\"I want Fox News\").  Zero success, nada, nothing, futility, frustration.But also not important.  I wouldn't be writing this review if I couldn't write faster than I can talk. Which is a good thing, because I see that books are being sold on Amazon--for as much as $10--on how to use Vocal Search with the Fire Stick.  I must be the customer profiled for such a book-- as I said, I'm not much of a talker.  Either that, or I'm not as commanding--or as bright--as Gary Busey.", "verified": true, "helpfulness": "1/1", "author": "Caponsacchi"}, {"rating": 4.0, "review": "It doesn't get a perfect score from me because the remote is unpredictable.  Sometimes it scrolls through 3 or 4 titles with one click and sometimes it doesn't respond.  I haven't had the FTVS that long to be a remote battery issue. It can work well for hours after the malfunction. When that happens,  i use my TV remote and control the FTVS through my TV which has been working flawlessly. Having said that, i love my FTVS.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I think it is great,  I have the chromecast, this does more. If you are prime member you don't need Netflix", "verified": true, "helpfulness": "0/0", "author": "Lawdog"}, {"rating": 5.0, "review": "Very good this is what I wanted thank you", "verified": true, "helpfulness": "1/1", "author": "carmen rivera rosa"}, {"rating": 1.0, "review": "I live in a very rural community and our internet runs at 5mb of speed but that is not fast enough for us to be able to watch any movies.  The 5mbs of speed is the fastest internet we can get where we live.  We are very disappointed that we are unable to use this with the internet service that is available to my rural community.", "verified": true, "helpfulness": "1/4", "author": "Alicia K."}, {"rating": 5.0, "review": "I got this when Amazon offered a special. Now that I've used it, I reckon I would have been happy to pay full price.", "verified": true, "helpfulness": "0/0", "author": "Fred Holzknecht \"kaiapit\""}]