[{"rating": 5.0, "review": "It's great to be able to watch our favorite movies and tv shows on the big screen. Love it.", "verified": true, "helpfulness": "0/0", "author": "John Woodard"}, {"rating": 5.0, "review": "This product is amazing. Forget smart tv's.  Love it. Now have three of them.", "verified": true, "helpfulness": "0/0", "author": "brian hrouda"}, {"rating": 4.0, "review": "works great, very easy, easy set up, only one regret, wish it had blue tooth for headphones.", "verified": true, "helpfulness": "0/0", "author": "Harry L Saxton"}, {"rating": 5.0, "review": "Watching a new movie every night! Love it, don't know how to play the games yet", "verified": true, "helpfulness": "0/0", "author": "Pat VB"}, {"rating": 1.0, "review": "It did not meet my expectations.  I was disappointed.  :(  There was suppose to be a lot of free movies on there, and the free stuff was very little and was so blurry, you couldn't even make out the faces.  I just expected a lot more out of the fire stick.  I thought maybe I was missing something so I went through it all again.  Just didn't excite me.", "verified": true, "helpfulness": "0/0", "author": "L.S.L"}, {"rating": 5.0, "review": "I have been slowly switching my media streamers from the Roku to Fire TV for a couple of months now.  I previously purchased the Fire TV box for two of my TV's and thought I would give the Fire TV Stick a test rather than the box for one of the TV's.  The price for the stick can not be beat.  We do lose a little bit of functionality with the stick, like the USB storage and I do not think that I will be playing any Gamefly games on this thing.  The smaller CPU may limit how well the regular games run also, but so far it has not been noticed with what the kids play.  Kodi was installed without issue as expected.  I have noticed that Kodi runs a little slower and isn't quite as smooth as the regular Fire TV, but it works well none the less.  This was such a budget purchase that I went ahead and purchased a second Fire TV Stick to get rid of the last Roku.  Now I can move on to other things to tinker with.", "verified": true, "helpfulness": "0/0", "author": "Ovidson"}, {"rating": 4.0, "review": "I like it but can't get you tube videos on it that Iknow of like I can on Chromecast. I like the remote and having the menu on my TV screen.", "verified": true, "helpfulness": "0/0", "author": "mike groves"}, {"rating": 5.0, "review": "I love it.  So easy to pick a show to watch.  Love that it keeps my viewing list separate from those of the rest of the family.", "verified": true, "helpfulness": "0/0", "author": "jerry green"}, {"rating": 5.0, "review": "I love it  Just perefect", "verified": true, "helpfulness": "0/0", "author": "acastillo"}, {"rating": 5.0, "review": "Best investment I've made this year!", "verified": true, "helpfulness": "0/0", "author": "david"}]