[{"rating": 3.0, "review": "It is ok.", "verified": true, "helpfulness": "0/0", "author": "Private Name"}, {"rating": 5.0, "review": "Better than I expected, all I need on is the WiFi - My husband uses this, doesn't have to deal with the computer. Makes my life easier.", "verified": true, "helpfulness": "0/1", "author": "Sal Warren"}, {"rating": 2.0, "review": "Although I immediately hooked it up, I haven't been able to use and enjoy it. There are issues with the remote control that is sluggish to respond.", "verified": true, "helpfulness": "1/1", "author": "Kioumars Ghobad"}, {"rating": 5.0, "review": "first one did not work correctly -  second one works perfectly - tech support was great", "verified": true, "helpfulness": "0/0", "author": "Leonard B. Lance"}, {"rating": 5.0, "review": "It is great!!", "verified": true, "helpfulness": "0/0", "author": "Jane M Pfeifer"}, {"rating": 3.0, "review": "Fast performance and easy access to Amazon content. The menu interface can be a little kludgy, and the appearance of two identical items --  a trailer (\"Episode 0\") and the program itself (\"Episode 1\")  side by side for each Amazon pilot was confusing at first. A particularly useful feature is that the device automatically self-selects my Sony TV's input when powering on, saving me a couple of menu clicks and a switch to the TV remote. I wish the more interesting \"free\" content channels like Kino Lorber had deeper content offerings -- Hulu Plus does it right with its wide selection of Criterion titles.", "verified": true, "helpfulness": "0/0", "author": "Swolf"}, {"rating": 4.0, "review": "Everything I had expected and more.  Very easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "John R Hanna"}, {"rating": 1.0, "review": "Every time I turned it on, about fifteen minutes into a movie or whatever it would stop and reload I think. I returned it .", "verified": true, "helpfulness": "2/2", "author": "B. Webb \"webbsy\""}, {"rating": 4.0, "review": "It does what it says it will do but the effectiveness depends on your own WiFi strength of signal.  For me, the buffering is distracting so I will have to figure out how to increase the WiFi speed.", "verified": true, "helpfulness": "0/0", "author": "L. Faulkner"}, {"rating": 5.0, "review": "LOVE IT", "verified": true, "helpfulness": "0/1", "author": "FRED INGA"}]