[{"rating": 5.0, "review": "Works great love it", "verified": true, "helpfulness": "0/0", "author": "Daniel Castro"}, {"rating": 5.0, "review": "I am satisfy", "verified": true, "helpfulness": "0/0", "author": "DeniseBrookins"}, {"rating": 5.0, "review": "After a couple of weeks of use it failed to connect to the Internet. I tried every rebooting move I could think of but nothing worked. When I connected my iPad it streamed Netflix without a problem from the tv USB port .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love it.works Great", "verified": true, "helpfulness": "0/0", "author": "Linda Oconnor \"lindytrav\""}, {"rating": 5.0, "review": "For it's price, its a powerhouse. Lots of great features; smooth and clean. Really enjoy the prime video integration to the main interface.", "verified": true, "helpfulness": "0/0", "author": "avaid"}, {"rating": 1.0, "review": "While the Fire Stick offers a good array of programing, it overheated every time I turned on the TV which made it freeze up, and it would cycle through shutting down and restarting. I returned it and got the more expensive fire TV box. I. Bought a refurbished unit for $79.99 vs the $99.00 new unit price. This is perfect. Avoid the stuck.", "verified": true, "helpfulness": "2/2", "author": "Richard Tutching \"Filmster\""}, {"rating": 3.0, "review": "Kind of a disappointment - almost anything I was interested in watching was not free & cost the same or more than my cable provider charges.  On the positive side, I did enjoy the Amazon series Alpha House (which is free).", "verified": true, "helpfulness": "0/0", "author": "Rose Mary  LaChapelle"}, {"rating": 5.0, "review": "Just awesome. Great interface and selection. A mini media center right in your living room. Get HBO GO and I'll be happy! Thanks!", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "The only thing wrong with this is that the remote is too sensitive, you can press the button just a tiny bit and it skips 2 or 3 steps beyond the selection that you wanted.  But that is a small fault in comparison with the vast selection of shows you can view.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I purchased the Fire Tv Stick because the device I was using stopped working.  Fire Tv Stick worked  good , except it did not have a VUDU application.  I purchased some movies on VUDU and could not access them.  I returned the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Bernie Houle"}]