[{"rating": 1.0, "review": "I have the Fire phone and I bought the Fire stick assuming that the Fire stck app would work seamlessly. It did the first day. After that the phone never detected the Fire stick even though both the phone and the stick were on the same wifi network. Even the Fire stick when operated by itself needs to be consistently 'rebooted'. I need to remove it from the HDMI slot or from the power source to be able to view the apps. I also own Chromecast and Roku3 and both of the other products seem better. Chromecast is great in that I am able to get my tablet and spare android phone perfectly connected everytime.", "verified": true, "helpfulness": "1/1", "author": "Jay"}, {"rating": 5.0, "review": "Preliminary review as I just got the Fire TV Stick last week, but it is as easy as pie to install and use.  I can already see how my late nights, when I can't sleep and there is nothing on the television, will improve.  I have a huge \"Watchlist\" with Amazon Prime and to be able to watch on my tv in lieu of the computer (plus the comfort of the couch versus the office chair) is a huge bonus.  My only negative (unless I haven't researched enough) is that there is more detailed information on the listings on the computer.  For instance, if a movie on your \"watchlist\" is no longer streaming but is now charging a fee to watch, that is not information that is provided on the television.  Just make sure all of the items on your \"watchlist\" are free and you're good to go.", "verified": true, "helpfulness": "0/0", "author": "Anne Schulman"}, {"rating": 5.0, "review": "Works like a charm.  Have 2 Roku units, but the Fire TV Stick works as good or maybe at times better.  It was a gift and a very nice gift. If I knew it was going to be this good I would have had a Fire Stick when they came out.", "verified": true, "helpfulness": "0/0", "author": "M. Urso"}, {"rating": 5.0, "review": "Great tool for streaming. Much better connection than streaming on Xbox Live", "verified": true, "helpfulness": "0/0", "author": "Adam Muise"}, {"rating": 5.0, "review": "Great. Amazing access to all kinds of media!!", "verified": true, "helpfulness": "0/0", "author": "Cicely Wynne"}, {"rating": 5.0, "review": "Works great! So glad I purchased it . Only downside is it has to stay plugged into the wall outlet to work.", "verified": true, "helpfulness": "0/0", "author": "CCross"}, {"rating": 3.0, "review": "Better have good internet connection.  It buffers alot.  When not buffering it works like a charm.", "verified": true, "helpfulness": "0/0", "author": "C. Bell"}, {"rating": 1.0, "review": "I was very excited about the Amazon Fire Stick. I pre-ordered mine the first day I saw it on Amazon.com, and couldn't wait to receive it. When it came in, I was very impressed with the design, everything from the packaging to the unit itself were neat, clean lines, etc. I plugged it in to my TV and fired it up.When I first installed it, there seemed to be a little bit of an issue connecting to my home WiFi. It would connect, but then get stuck downloading a software update and eventually lose the connection. I didn't think too much about it, because it finally connected successfully, downloaded the update, and I was up and running. My router was not next to the TV, but was in the same room, 15 feet or closer. Regardless, everything seemed to be working fine, and my wife and I were very happy.We continued to use it without major issues for a couple of weeks, but started noticing an intermittent buzzing/freezing/lag issue while watching content. The symptoms were all very accurately described here: http://www.amazon.com/forum/kindle?_encoding=UTF8&cdForum;=Fx1D7SY3BVSESG&cdThread;=Tx3UBSMPD3VTWIJ . We encountered this on both Amazon Prime videos and via the  Netflix app. I wasn't crazy about this, but it didn't dramatically interrupt viewing, and I figured it was just something that would get fixed eventually via a software/firmware update.But by the third week, we started experiencing some major issues. The stick would lose connection consistently at first, and just cut off whatever we were watching. Usually, power cycling the stick would resolve it, but this was still pretty frustrating. Finally it just quit connecting altogether. With the holidays, we traveled a bit, but when I got back and tried to use the stick, I had constant connection issues. The Home screen would not load, and it would tell me to check my network settings, at which point, I would be prompted to reenter my WiFi password, and one of two things would happen: it would reject my password, or tell me I was \"Connected with Problems\". I googled that and came across the following post that is almost exactly what I was experiencing: http://www.amazon.com/forum/kindle/ref=cm_cd_pg_pg1?_encoding=UTF8&cdForum;=Fx1D7SY3BVSESG&cdPage;=1&cdThread;=Tx2CDOG0K31UBSBI power cycled the fire stick several times, and also my WiFi router several times. I moved the router closer to the TV (less than 10 feet away). I installed the HDMI extender and made sure the fire stick had a direct sight line to my router. Finally, I performed a factory reset on the fire stick. Nothing. After the factory reset, it could not even download the software update.At this point I began chatting with Tech Support. I even had several phone calls. Of course the first steps were ones I'd already performed, but I did them again on the phone. Finally, someone told me I had to have a network error or a problem with my WiFi router. However, the Fire TV stick was the only piece of WiFi equipment in my house that wouldn't connect to my router, so I found this doubtful. Still, I did a factory reset on the WiFi router. Nothing.Amazon sent me a replacement Fire stick that arrived in 1 business day. I was grateful for this, but couldn't connect it either. Same issues as before. Through multiple chat sessions with tech support, I was told repeatedly that they were aware of the WiFi connection issues and working to fix them. I'm returning both Fire sticks: the one I bought and the replacement they sent me.I'm disappointed this didn't work. For the price, it seemed like a steal, and the specs on it are great. For the two weeks it worked, I was happy with the device. I'm also very thankful for Amazon's tech support; aside from an initial conversation where I felt like they were blaming me for all the issues, they did everything they could to help me fix this and make it work. But ultimately, the device simply does not do what it is supposed to do, and until they can figure out how to make it work properly, I would avoid this device.", "verified": true, "helpfulness": "0/0", "author": "Joseph Taylor"}, {"rating": 4.0, "review": "Works perfectly fine..Although menu is not as easy to navigate as Apple TV's, it has a lot more content..I was able to download apps to watch French and German TV.Content is pleasing..BUT, it is very difficult to browse only the free ones..Amazon is trying to sell paid content, and mixes them with free prime items..marketing gimmick,..I would not play games with the given remote..I purchased the better remote which takes voice commands well..still, not for playing..Overall, however, I am pleased with it. Prime content which is free with our prime membership is sufficient..", "verified": true, "helpfulness": "0/0", "author": "Hans Blix"}, {"rating": 5.0, "review": "Great unit. It's lightening fast. Ton of apps.Very easy to use and set up.Highly recommended", "verified": true, "helpfulness": "0/0", "author": "J. Lerner \"Ny Ranger fan\""}]