[{"rating": 3.0, "review": "I did not get it in 2days as advertised and it freezes constantly during movies", "verified": true, "helpfulness": "0/0", "author": "Joanne Holder"}, {"rating": 5.0, "review": "Easy to insert the firestick. Good directions. EXTRENELY HARD to open the remote and install battery. I had to go on YouTube for a video of how to open the stupid case where they do say it is very hard to open. I could see the line for the cover but could not get it open and didn't want to break it!", "verified": true, "helpfulness": "0/0", "author": "eileen"}, {"rating": 4.0, "review": "Was hoping this would be a major step towards eliminating cable, but it is only a minor step.  I would like to see a lot more content, but what should one expect for a one time fee of $39?  I watched a movie on regular cable and there was 5 minutes of commercials for every 10 minutes of movie - at one point I almost forgot what I was watching.  Guess I will read a book!", "verified": true, "helpfulness": "0/0", "author": "JD Byrider"}, {"rating": 5.0, "review": "Love the fire stick", "verified": true, "helpfulness": "0/0", "author": "Deborah Green"}, {"rating": 5.0, "review": "Very quick and easy set up. User friendly. Love it!", "verified": true, "helpfulness": "0/0", "author": "Kathleen Shulterbrandt"}, {"rating": 5.0, "review": "My former problems with buffering have been solved by using the Fire TV Stick.  Set up was very easy and the video showing you how to use the remote was helpful. It's wonderful to watch my Prime movies and TV series on my larger screen TV in the comfort of my living room.  NOTE:  The Fire Stick only works on televisions with an HDMI port (this was not emphasized as much as it should have been in the product description).", "verified": true, "helpfulness": "0/0", "author": "DA Texas"}, {"rating": 1.0, "review": "Terrible experience - much the same as many reviewers.  Setup was very simple, but performance has been terrible - keeps freezing up.  At first I thought it was my Internet speed - checked that at 150Mbps, no problem.  Fire Stick setup says both connection and speed are very good.  Bought an extender to see if that helped since TV is down the hall from wireless.  No fix there.  Decided to hook up MacBook direct output to TV screen and then run Instant Video from that - eureka, no problem what so ever.Read reviews that say must tape it to the back of the TV so that it is exactly vertical, will try that and report back if problem is fixed.Probably return and try Chromecast.Was soooo hopeful...", "verified": true, "helpfulness": "0/0", "author": "Cleck"}, {"rating": 5.0, "review": "We really enjoy being able to watch Netflix on our \"non smart\" TV! Just plug into the HDMI port and go!", "verified": true, "helpfulness": "0/0", "author": "Christy"}, {"rating": 2.0, "review": "I'm not very thrilled with this product. It is \"okay\" compared to other streaming sticks such as the Roku.  The apps are slow and 99% of the time I wait 15-20 minutes just for an app to load (Disney Jr, Netflix, Hulu, etc).", "verified": false, "helpfulness": "1/1", "author": "bldenh01"}, {"rating": 3.0, "review": "Not sure if its the device or the internet connection. But it just stops and goes to a random blank screen at the beginning of a new episode works fine when deep into the episode. Stick has been doing this with all season tv shows. Very annoying but other than that better than the PS3 and trying to login to their network.", "verified": true, "helpfulness": "1/1", "author": "Justin Smith"}]