[{"rating": 5.0, "review": "I love the firestick. Wherever I go, I can take television with me and apps as long as there is a good wifi connection. I use it everyday. I subscribe to Sling TV, Hulu Plus and Netflix. I did order one movie from Amazon Prime, but I've yet to find out the value of instant prime video. I already have access to HBO Go and it's awesome watching Game of Thrones without actually having a cable subscription. With Sling, I am able to catch the NBA playoffs, which lead to my ultimate cancellation of NBA League pass. League pass was $33.00 month, but most of the games were blacked out, especially my local teams. Now I pay $20.00 month for Sling, and $16.00 for Netflix and Hulu. So, technically, I spend $36.00 month for all the channels and movies I need. Oh, HBO Go is free through my brother. Just think, Netflix allows streaming of more than one device simultaneously, so why not split these bills with family??? Anyway, Firestick turns your tv into a smart TV, but if you're not an avid Amazon user, be aware that it is Amazon interface based.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install. Fast delivery.", "verified": true, "helpfulness": "0/0", "author": "DMC"}, {"rating": 5.0, "review": "Awesome apps and prime is smoother running than any other device I've used.", "verified": true, "helpfulness": "0/0", "author": "Gordon Martin"}, {"rating": 2.0, "review": "This thing regularly drops wifi connections ad is quite annoying.", "verified": true, "helpfulness": "0/0", "author": "Shane Sullivan"}, {"rating": 1.0, "review": "Fire stick is leeching data. Shows keep running, it does not have auto shutoff to customize. Most of the streaming devices shutoff after a certain period of no activity, but fire tv keeps running the show even if the tv is switched off. This caused me to go beyond my data cap for straight 2 months. Not using this device until Amazon fixes it.", "verified": true, "helpfulness": "0/0", "author": "MADELLA JAIKISHORE"}, {"rating": 4.0, "review": "It is high quality works well for videos however there are some software bugs when playing music", "verified": true, "helpfulness": "0/0", "author": "dustin ordahl"}, {"rating": 4.0, "review": "The only thing I was disappointed in was that my cable provider doesn't support the Fire TV so I am not able to view my HBO account on the stick.  Otherwise, enjoying the device very much.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "So I have been using this for the past 3 months and I am impressed. It's fast powerful and capable of so much, but I have also begun to see its short comings.First and foremost this needs a UI that is less Amazon centric and more Rokuish in layout. It is very hard to navigate and find things as well as what is Prime and what is purchase.I recently signed up for Sling TV and had the choice of Roku or Fire and chose the Roku simply because it is easier to use and has more apps. I know Amazon is working hard, but again a software update is neededI would still recommend a fire stick, but after a Roku at this point", "verified": true, "helpfulness": "0/0", "author": "Ryan Kirkpatrick"}, {"rating": 3.0, "review": "You will sell more units when you allow Latin America to use Amazon Prime streaming benefits, It's a shame you don't, I'm glad we have Netflix", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"Luis Soto\""}, {"rating": 4.0, "review": "your items works exelent", "verified": true, "helpfulness": "0/0", "author": "saisnarine ramdas"}]