[{"rating": 5.0, "review": "Works very well with Amazon Prime video, Netflix and HBO go.", "verified": true, "helpfulness": "0/0", "author": "DebBaum"}, {"rating": 1.0, "review": "I purchased a new Fire TV Stick. It worked very well initially. Then, it seemed to me that it began to become extremely hot. I was issued a return authorization and a \"new\" unit was sent to me. There was no indication that I was receiving a Certified Refurbished Fire TV Stick. The unit that I received did not function at all. The unit presents a black and white welcome screen and that is it. I went through all of the reset procedures, multiple times, and I waited patiently for the unit to initialize. I reported the problem and I was told that I needed to contact a support person to help me. Bah! The unit is now in a box, in a closet, awaiting the day when I have the patience to hook it back up and speak on the phone with someone whom will tell me what I already know ... that the unit is broken, that it was broken when it arrived, and all of the talking on the phone with a technician is not going to change that. Someday I will purchase a NEW Fire TV Stick, someday, but not soon. I am so disappointed that I was sent someone else's problem device and that I was only made aware of the devices prior history by being invited to review some of my many, many Amazon purchases.", "verified": true, "helpfulness": "0/0", "author": "Errol"}, {"rating": 5.0, "review": "We've bought three of these now for the kids' rooms after ditching cable.  No problems, nice design and easy setup.", "verified": true, "helpfulness": "0/0", "author": "John Kevin Felgentreu \"Felgen2\""}, {"rating": 5.0, "review": "Great way to view", "verified": true, "helpfulness": "0/0", "author": "Richard Robinson"}, {"rating": 1.0, "review": "I have had horrible connection issues with this fire stick.  Worked fine for a couple months, but recently I can't do anything because it won't get a good connection with my router. I have tried hard resets on everything.  Every other wireless device in my household works fine.  Will be trying to return and will not buy again.", "verified": true, "helpfulness": "0/0", "author": "Charlie Kalkman"}, {"rating": 4.0, "review": "Loving this device. Very straight forward. Only complaint is that the companion Android and iOS Apps are not available in most countries. Install before you purchase to avoid being disappointed, just in case.", "verified": true, "helpfulness": "0/0", "author": "Leonardo Arboleda"}, {"rating": 5.0, "review": "We love the fire stick.  It was easy to install so now we can watch Netflix  and shows on Prime that we like.", "verified": true, "helpfulness": "0/0", "author": "Peggy Wood"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "david moore"}, {"rating": 5.0, "review": "Love having the internet, right at your TV:)", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "Easy to use and setup especially if your a prime member!", "verified": true, "helpfulness": "0/0", "author": "James Lowery"}]