[{"rating": 5.0, "review": "Very easy to install and use", "verified": true, "helpfulness": "0/0", "author": "drconehead2000"}, {"rating": 5.0, "review": "Love it. It's so much faster than the previous streaming device I used and I love being able to watch Amazon Prime content.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Bird Lady"}, {"rating": 4.0, "review": "Pros:super easy set up.Fast streaming. ..very fast!Super clean picture quality.Cheap...err. inexpensive.Integration with prime us awesome.Easy setup for netflix.Cons.No separate digital audio out.Comcast wifi doesn't like it. I fault comcast.Free Prime movies seem very limited. The good stuff still costs you a few bucks. Prime issue but something to consider.", "verified": true, "helpfulness": "0/0", "author": "HMS"}, {"rating": 5.0, "review": "LOVE  IT !!  I no longer have cable or a dish and I don't miss it one bit and save so much money by having this device plus a prime membership !", "verified": true, "helpfulness": "0/0", "author": "sldak"}, {"rating": 4.0, "review": "The Amazon fire tv stick offers the menu on the left (search,home, prime video, movies, etc) in a list . On the right side, there are horizontal bar. Contained in home section, on top your recent activity use of the apps, followed by featured app and games, prime originals and exclusives.it is a well designed stick that gives you tons of options and lots of app. Including twitch netflix and more. One thing I noticed they didn't have crunchyroll app. Unless I missed. Other than that its worth the buy", "verified": true, "helpfulness": "0/0", "author": "Manjeet Singh"}, {"rating": 1.0, "review": "Showtime doesn't support xfinity!", "verified": true, "helpfulness": "1/1", "author": "Anju Vij"}, {"rating": 4.0, "review": "Works great. My chromecast didn't work well in the bedroom upstairs but the fire TV stick works great. The remote is a great convenience over chromecast. Amazon prime video selection isnt that great right now, however having netflix on it makes up for that. The only thing I really miss from chromecast is the ability to chromecast from my PC to the TV. With fire TV stick I am limited to the apps on the stick.", "verified": true, "helpfulness": "0/0", "author": "P. Jaaj \"Raptor Claw\""}, {"rating": 4.0, "review": "Live the fire stick ... Took a couple of tries to get it setup but works great now. I have a variety of movies at my fingertips. Great value", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 3.0, "review": "Appears to be some software issues. We have to unplug, then plug the fire stick in almost everytime we try to use it just so it works. Also disconnects from the Internet and won't recognize signal until it's reset.", "verified": true, "helpfulness": "1/1", "author": "TravandKim D'Amico"}, {"rating": 5.0, "review": "Loving my Fire Stick! Set up was just as the instructions stated. Started watching programs right away! First purchase was seamless. No complaints! Easy to search with remote and save to watchlist. Wish my husband would let me cancel our satellite network!!", "verified": true, "helpfulness": "0/0", "author": "Kristi B"}]