[{"rating": 3.0, "review": "this is the beginning of a great product just not there yet. I purchased this thinking I would be able to stream from my pc to my tv. It won't even do that. it will connect to your wifi so that you can view amazon prime stuff but all the good stuff costs more to rent than just going to red box or being a netflix member.", "verified": true, "helpfulness": "1/1", "author": "rlbrobst"}, {"rating": 4.0, "review": "Nice apps. Like having my Prime shows on my TV.", "verified": true, "helpfulness": "0/0", "author": "Tammy Studebaker"}, {"rating": 5.0, "review": "Easy to set up and use.  Even I can figure this one out!", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 5.0, "review": "I Love My Fire TV Stick!!! Endless amounts of apps, games and access to movies and hit shows at the touch of my finger.  The kicker is I get to CHOOSE what I want to pay for and not have to deal with paying for 100's of channels and only watching 15 to 20 of them.  Saving me time and money. Thanks a million and more Amazon.", "verified": true, "helpfulness": "0/0", "author": "Ronnie Ferguson"}, {"rating": 5.0, "review": "If you're thinking about streaming entertainment, look no further than the FIRE STICK!!! This is by far the finest piece of electronic gear that I own (and I have one of each to be sure). We enjoy the music and movies most.", "verified": true, "helpfulness": "0/0", "author": "FosterBoy"}, {"rating": 4.0, "review": "My Daughter took it away from me to watch all the shows available.", "verified": true, "helpfulness": "0/0", "author": "Oscar Estrada"}, {"rating": 5.0, "review": "Lot better than chromecast", "verified": true, "helpfulness": "0/0", "author": "pradeep"}, {"rating": 5.0, "review": "Love the fire tv stick.  I don't know why I waited so long to get one.  I think I may be able to cut back my cable service and save $$.", "verified": true, "helpfulness": "0/0", "author": "Bazinga"}, {"rating": 1.0, "review": "Took me a while to learn how much this is annoying to work with, now they wont let me return it", "verified": true, "helpfulness": "0/1", "author": "Jesse Cryns"}, {"rating": 5.0, "review": "Love it. Easy set up and fast.", "verified": true, "helpfulness": "0/0", "author": "Hal Van Metre"}]