[{"rating": 4.0, "review": "Its okay but I definitely will not be getting rid of Netflix", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I bought this for my wife. She loves it. She can watch a show on her Kindle Fire HD7, pause it, and then continue to watch it on out TV. Now we are getting more use out of our Prime membership.I set up the Fire TV Stick for my wife. It was quick and painless. Pay attention to the on-screen prompts and you will have no problems.", "verified": true, "helpfulness": "0/0", "author": "Michael Besket"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "julie"}, {"rating": 5.0, "review": "I love this and it was very easy to setup compared to the fifty steps for a chrome stick. Works every time I want to use it again unlike googles piece of crap.", "verified": true, "helpfulness": "0/0", "author": "Leslie Wilson"}, {"rating": 5.0, "review": "I love this gadget! Works perfectly. Set up was super easy and fast.", "verified": true, "helpfulness": "0/0", "author": "Steve Shuman \"bigboyrandy\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Plugged it in and away we went, watched all the series from the UK that I have missed whilst overseas. Easy set up, no problems.", "verified": true, "helpfulness": "0/0", "author": "Minimum"}, {"rating": 5.0, "review": "I am trying out the prime membership so I bought this TV stick. It works fine so far if my internet does not act up. So far so good!!", "verified": true, "helpfulness": "0/0", "author": "tcwong59"}, {"rating": 4.0, "review": "This thing is awesome for 40$ and if you are a prime member you actually do get quite a bit of extra content / movies / shows that netflix does not offer. It has shut off a few times randomly but i don't really care. Simply unplug and plug back in and realize how moderately priced the product is. One thing i did not know what that it DOES use a power outlet but no big deal.After this purchase i will be buying the bigger version for another TV set up.", "verified": true, "helpfulness": "0/0", "author": "alonzo"}, {"rating": 4.0, "review": "It is amazing! I'm giving 4 instead of 5 because it needs compatibility with dorms and hotel wifi. Also prime should be cheaper for fire stick owners.", "verified": true, "helpfulness": "0/0", "author": "Melania Rivas"}]