[{"rating": 4.0, "review": "Seems to work pretty well for what I need it to do, but the remote is too tiny and easy to slip down the couch cushions and lose. A silicone case would help but I can only find one for the bigger voice remote.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Your product has met all my expectations", "verified": true, "helpfulness": "0/0", "author": "Clarence Dean Hurt"}, {"rating": 2.0, "review": "Will not pick up the WiFi signal on the second floor which is where I needed it.  Works fine on the main floor.", "verified": true, "helpfulness": "0/1", "author": "Rodney G. Brady"}, {"rating": 3.0, "review": "Great streaming device but, has a few bugs. First, remote is too small. It's constantly getting lost, or falling in between the couch cushions. It's become quite a pain always trying to find the remote. Second, the device has a tendency to over heat. If watching for a long period of time, the picture will freeze , it wants to reboot, and sometimes it just completely shuts down. I make sure I unplug my fire stick before retiring for the evening or the next day it won't work because its too hot.", "verified": true, "helpfulness": "0/1", "author": "Patty Pennell"}, {"rating": 5.0, "review": "luv luv it! I have the fire box in the main living room, and got this for my bedroom.  I don't really need \"voice search\" in there since I hardly watch TV in my bedroom.  It is great for the price, and all the apps I originally downloaded for the box can be accessed in the bedroom too. I didn't have to download all over again.  Just know that you cannot watch both TV's at the same time (or at least I can't, with my internet) because if I do, one or the other TV is really slow, it will have long spooling pauses, etc.  Other than that, it is great!! I used to pay over $100 per month on satellite, now I only pay $20 per month for the SLING APP (which is live TV), which has all the channels + a few that were \"pay channels\" that I normally watched on dish.  I can really see that streaming TV will eventually put the other companies out, once people catch on to this....!  I would have \"free TV\" altogether if I didn't have the sling app, who can beat that? Amazon Fire is doing for TV what Magic Jack did for phones! Plain & Simple.", "verified": true, "helpfulness": "0/0", "author": "Sheryl"}, {"rating": 2.0, "review": "Must be registered with Amazon.  This is a bad thing.  Also, one-click shopping increases possibility of accidental purchase.  To remove such a purchase is time-consuming.  Overall, I am not impressed,", "verified": true, "helpfulness": "0/1", "author": "Patricia Horton \"Hortonsbks\""}, {"rating": 5.0, "review": "Great addition to video system. Pandora works great as well as the Amazon movies.", "verified": true, "helpfulness": "0/0", "author": "Raymond L. Newby Jr."}, {"rating": 5.0, "review": "easy to navigate and wonderful. Especially if you have Netflix.", "verified": true, "helpfulness": "0/0", "author": "Ellen Richardson"}, {"rating": 5.0, "review": "love", "verified": true, "helpfulness": "0/0", "author": "fbyers"}, {"rating": 4.0, "review": "Quick shipping. Easy setup. Lots of content, especially with the prime service. premium channels will require payment per episode/season or will require cable provider of some sort already. Does exactly what I expected and love the portability of the stick. Will recommend to others.", "verified": true, "helpfulness": "0/0", "author": "vp"}]