[{"rating": 4.0, "review": "It works well if you have a good wireless connection. I had to prioritize my connection via QoS in my wireless router settings in order to avoid stuttering when playing back HD content using the Kodi.tv app. The only problem I have now is that when it goes to sleep it doesn't allow my TV to power off due to no signal because it is sending a blank grey screen instead of no signal.", "verified": true, "helpfulness": "1/1", "author": "Justin"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Wagner"}, {"rating": 5.0, "review": "I love the portablity of it.", "verified": true, "helpfulness": "0/0", "author": "Larry Kohlmeier"}, {"rating": 3.0, "review": "I don't know what the problem is but it is forever buffering. I have a computer next to the tv and don't have this problem. I also watch tv on my ipad with no problems. Is the stick defective? Is there a antanna made for this?", "verified": true, "helpfulness": "0/0", "author": "Timothy S."}, {"rating": 5.0, "review": "mom loves it and ease of use. since she cant understand chromecast", "verified": true, "helpfulness": "0/0", "author": "David A."}, {"rating": 4.0, "review": "A simple to install and great low cost alternative to a Wi-Fi dvd player.", "verified": true, "helpfulness": "0/0", "author": "tjohnusa"}, {"rating": 5.0, "review": "This exceeded my expectations. The install was super easy. It offers a wide range of entertainment and was very easy to navigate. I would highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I've had one die on me already.  It also tends to crash frequent for me. I really wanted to give it a chance.  Go with a Roku or Apple TV.", "verified": true, "helpfulness": "0/0", "author": "AppleStock"}, {"rating": 5.0, "review": "Love it recommend this item to any  one..", "verified": true, "helpfulness": "0/0", "author": "nasir ladson"}, {"rating": 5.0, "review": "This is the best thing I have purchased.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]