[{"rating": 5.0, "review": "Easy to install.  Have it plugged into electricity, as advised, and usually have good reception.  Turned TV into a smart TV, just as advertised.", "verified": true, "helpfulness": "0/0", "author": "GrandmafromTX"}, {"rating": 5.0, "review": "This gadget is a must have..picture quality is amazing...I've had this product since Feb. 3rd and absolutely cannot believe I was living without it...Love Love Love it..", "verified": true, "helpfulness": "0/0", "author": "Sonia N. Dorsey \"sneaker fetish\""}, {"rating": 5.0, "review": "To give a background I have 2 Amazon tablets, 1 high end reader, 2 Fire TV (Box and Stick), Prime, Kids FreeTime for 4 kiddos, and Kindle Unlimited.  Personally I think while the Kids FreeTime is a decent attempt at isolating kids from non age appropriate content I feel as though it is not fully what I was expecting.  So back to the Fire TV stick, as for functionality I like it a lot.  BUT... What parental controls are lame.  I would rather not have my kiddos seeing certain genre movie covers let alone not being able to set a PIN for amazon prime content for PG13+ especially for R and MA content.  Sure you can put a PIN on everything, but then they can't watch a G Prime Movie without me entering the room.  Telling all of them to not look at the screen while I enter in my PIN (how long before they know the PIN anyway knowing as a kid I'd be peering thru my fingers to catch it, wouldn't you?).Edit - Looks like Amazon added another option so you no longer have to see the PIN on the screen.  Instead it can be a series of buttons sequences.  Changing from 3 to 5 stars as I've been pretty happy with itAnyway yes it is pretty decent for what it does, just wish you had better level of parental control (and why the difference between the Fire Tablet and the Fire TV?)  As you can tell to amazon to lock content above PG13 on Tablet, but not on the Fire TV?  I personally expect a bit more in this area...Maybe over time there will be improvements, but as of this review it is a bit lacking.", "verified": true, "helpfulness": "0/0", "author": "Chad V Aberle"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 2.0, "review": "no happy with the product.  thought i could stream from pc or non kindle tablet.  not able to.  spent a lot of time trying to figure this out.  support suggested i purchase a kindle to mirror.  good idea, but would have been an addition $134.00.  i will stick with the chromecast. thank you.", "verified": true, "helpfulness": "0/0", "author": "clm"}, {"rating": 4.0, "review": "I love this device! I also have a Chromecast on another TV, but this also gives you a remote in addition to be able to use a smart phone as the remote. Also another advantage over the Chromecast is that you can watch Amazon Steaming video on it! It has a huge amount of additional content including games! This is going to be given to all our family and friends for Christmas/Hanukah next year. Best of all, it's so easy to install even my parents could do it!", "verified": true, "helpfulness": "0/0", "author": "Michelle Wyman"}, {"rating": 2.0, "review": "We were looking forward to this new source of digital content, however we could not make the device work with out system.  So it is possible that it was a hardware issue on our end but our router (Apple Airport Extreme) and wireless network work quickly and flawlessly with numerous other devices.  We did get a connection of sorts, but there was an error message \"connected with problems\" and were completely unable to stream any content at all.  And I have to mention the remote; getting the back cover off for batter installation was incredibly frustrating.  So much force had to be applied I was sure it would break.  When we got this item the packaging and presentation was clearly mimicking Apple; the big difference was that nothing worked nearly as well as Apple products!", "verified": true, "helpfulness": "0/0", "author": "bonedoc"}, {"rating": 4.0, "review": "I love the fire stick. It's more responsive than my Roku and more powerful than the Chromecast. It looses one star due to the lack of free applications available for it (Expect to spend a bit on apps to make it fully functional).", "verified": true, "helpfulness": "0/0", "author": "Jaypoc"}, {"rating": 5.0, "review": "It's awsome I love it!", "verified": true, "helpfulness": "0/0", "author": "Dawn Reed"}, {"rating": 5.0, "review": "Never going back to cable! Saved $130 a month. ❤️ This is an awesome find!", "verified": true, "helpfulness": "0/0", "author": "Lexeous"}]