[{"rating": 5.0, "review": "It's a great little device. Nice interface and seems to perform well.", "verified": true, "helpfulness": "0/0", "author": "D. Mattow"}, {"rating": 5.0, "review": "Purchased when they were on sale for 19 dollars. We have 3 chrome casts which we use everyday with PLEX for viewing our offline content. We previously had tried the FireTV but returned it when it proved difficult to view our Prime content. The FireTV stick is much better, prime content plays without first being directed to purchase amazon content. In addition, PLEX works great as a downloaded app. We have no issues with the remote, and it is easier to use the remote than our phones with the chrome cast. Overall, this is great buy for under 30 dollars for PLEX and Prime users.", "verified": true, "helpfulness": "0/0", "author": "DavidC18"}, {"rating": 5.0, "review": "Great interface and navigation seems smooth. Comes with everything you could possibly need including an hdmi extension.", "verified": true, "helpfulness": "0/0", "author": "Deucer"}, {"rating": 5.0, "review": "uses both low (2.4) and high(5) bands speed superb quality great (1080P) just installed but happy so far", "verified": true, "helpfulness": "0/0", "author": "Bart Johnson"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV this summer and felt that nothing could compare to how amazing this Fire TV performed until my Fire TV Stick arrived yesterday. I had raved so much about my Fire TV that my baby brother purchased the Fire Stick and had already received his. He told me that it was amazing and so easy to set up and use. He was absolutely correct. I opened my package with zero frustration, which I love that Amazon has done. I then literally had my Fire TV Stick up and running in under 5 minutes. Another brilliant and outstanding product, Amazon.", "verified": true, "helpfulness": "1/1", "author": "Rebecca Cole"}, {"rating": 2.0, "review": "I don't normally do reviews but I was excited for this product and it turned out to be a huge letdown.Sure, I can access all my prime content and netflix and all that jazz, but it suffers from a few major flaws.1. It seems to lose connection to my wifi at random and can't reconnect until reset. As this is located right next to my 360 and wii, which don't have that issue, I assume it's a problem with the stick.2. I've had apps crash and kick me out. Wouldn't be a big deal, but I can't get back in until the device is reset, as in the above. This leads me into the biggest problem3. I can't find a way to turn this off or reset it without unplugging it from my tv and the power source every time. There is just no excuse for there not to be a reset button or an option on the main menu.4. Not a huge issue but something that needs to be addressed, the battery port for the remote. This thing took me at least 5 minutes to get open and the whole time I had to question if I was going to break it. They don't tell you that you need to push part of it in, then pull the back down toward the bottom. I have more gadgets than I can count, and this is the first time I've had a problem like that.", "verified": true, "helpfulness": "0/0", "author": "Lunacy"}, {"rating": 4.0, "review": "4 stars for Good overall productCons: More tied to amazon prime. For casting youtube from my phone I need to use chromecast. The navigation lags as we scroll through different movies.", "verified": true, "helpfulness": "0/0", "author": "same"}, {"rating": 1.0, "review": "Highly not satisfied. Not easy as chromecast.missing ios apps", "verified": true, "helpfulness": "1/2", "author": "Rajesh P."}, {"rating": 2.0, "review": "Grabbed 2 of these during the launch sale. Wish I wouldn't have. I got one for my bedroom TV and one as a gift for my mom instead of buying her an Apple TV for Christmas. I have had an Apple TV in my living room for 2 years and love it.  I even cancelled cable and use Apple TV and Antenna exclusively.  Never run into the issues I run into constantly on the Fire TV Stick. Set up was easy enough. Running Hulu is a total joke and exercise in frustration. Run a half hour TV show and it will freeze up 3-4 times before the first commercial break. Video freezes or goes black sometimes audio comes back. Sometimes you can back out and resume the episode sometimes every button on the remote is unresponsive for 5 minutes while it buffers or something then it suddenly registers all the button pushes after it finally decides to start playing video again. I'm not really sure what it's doing. There's no loading symbol or status bar it just goes black or freezes the video, maybe it's buffering I don't know. I spent over 45 min watching a half hour show playing this freezing game. I am now trying to use the Fire Stick for the second time and it's the same issue different show. I could grab my ipad and watch it faster. I'm seriously so embarrassed I got this for my mom I may return the 2nd unit and get her an Apple TV anyway. This sucker is beta at best. No wonder all of the Fire products keep flopping.", "verified": true, "helpfulness": "0/0", "author": "J. Hanke"}, {"rating": 5.0, "review": "Amazing value. If you are already a prime member even better. Either way you won't be dissapointed. From the moment you see the box till your done with your setup (about 10 minutes total) you will be impressed. Prime video and music the way you always thought it should be no matter what your using. Buy it...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]