[{"rating": 2.0, "review": "since switching to UVERSE nothing but problems connecting.", "verified": true, "helpfulness": "0/0", "author": "gramps"}, {"rating": 4.0, "review": "Works well.  easy to install.", "verified": true, "helpfulness": "0/0", "author": "Lenord McGownd"}, {"rating": 5.0, "review": "Very pleased...Fire TV Stick exceeded our expectations", "verified": true, "helpfulness": "0/0", "author": "Bud Miller"}, {"rating": 1.0, "review": "A big flop.  Got it so I could use the Miracast feature with an Android tablet. Worthless. Guess if it's not an Amazon Kindle Fire or a Fire Phone it's a coin flip if it will work. Called heads and came up tails.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it! I'm also glad it let's your smartphone be a remote control in case you cannot find its original one. Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "ffces153"}, {"rating": 5.0, "review": "The new fire stick resolved the wifi connection issues i faced with my previous one. As soon as i provisioned the new one and and connected my wifi everything worked at peak performance.", "verified": true, "helpfulness": "0/0", "author": "james stimac"}, {"rating": 5.0, "review": "Perfect!!! Cable no more, to expencive! Fire Tv Stick is easy to used, I'm happy with my choice!!", "verified": true, "helpfulness": "0/0", "author": "Suleyma Perez"}, {"rating": 5.0, "review": "Works well easy set up and very user friendly", "verified": true, "helpfulness": "0/0", "author": "C. Reese \"MedicinAZ\""}, {"rating": 5.0, "review": "The Fire Stick is amazing! Way better than any other streaming services.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "This is my first foray into a streaming device on my tv, but so far I'm more disappointed than excited.  The bandwidth requirements are higher than my 6MB cable internet connection has in order to stream something from Amazon or Netflix, but the Netflix service works uninterrupted and lag free on my blu-ray player.  Additionally I'm disappointed in the Amazon Prime costs for programming that are on top of the Prime membership costs.I'll keep trying and see if I can find a way to integrate this into my life, but I'm far from loving it.  The kids use it more and even then, its only for games, not TV.", "verified": true, "helpfulness": "0/0", "author": "Timothy A. Doyle"}]