[{"rating": 1.0, "review": "You would think that Amazon would at a very minimum pair its FireTV with its existing products that are capable of behaving as remotes.  There is no reason why they couldn't make a remote app for the Kindle Fire except sheer arrogance and laziness.  I'm really having a hard time understanding this.  I can't rate this any higher than one star because I think this is just as ridiculous omission as when they failed to have an iOS app at launch time!", "verified": true, "helpfulness": "0/0", "author": "Frank Z \"frankz00\""}, {"rating": 5.0, "review": "I love it! Such a nifty gadget, I have XBMC running on it and it works wonders. I prefer XBMC over Plex and Amazon fire stick allows side loading of apps without the need to root. I'll be ordering a few more as gifts, only unfortunate thing is it seems to be out of stock until January meaning no fire stick chimney stocking stuffers.", "verified": true, "helpfulness": "0/0", "author": "Phong Nguyen"}, {"rating": 5.0, "review": "The smooth and nice interface with no lag. Crystal clear picture quality and get this IT EVEN WORKS IN YOUR CAR! (HDMI PORT AND AT LEAST 5WATT OUTLET REQUIRED)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Small yet capable.  No problems.", "verified": true, "helpfulness": "0/0", "author": "Linux Administrator"}, {"rating": 4.0, "review": "This is a great streaming product, Amazon has really improved on the basic streaming stick. The companion app, and remote make watching content easy and almost effortless.Pros: Content, with the entire Prime library this has a huge amount of content.  The added flash memory is great for downloading apps.  Fast boot up, once I turn on the tv the fire stick immediately loads.Con: The usb power location is a little awkward, it's right in the middle of the stick, so if you have multiple hdmi plugs in your tv you might need to rearrange the placement of a few.", "verified": true, "helpfulness": "0/0", "author": "Ben W"}, {"rating": 5.0, "review": "Set up was extremely easy, it works great right from the start. It is easy to add shows, apps and music. Such a simple little device that does wonders.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It seems to need to be restarted (power on/off) frequently.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I like the idea of Amazon fire tv stick; however I purchased 2 sticks and only 1 was fully operating. The defective one did not reboot when I unplugged it from the HDTV and the wall socket. Also, removed AAA batteries and used my battery tester; found out the batteries were stillin the \"GOOD\" range.", "verified": true, "helpfulness": "0/1", "author": "Kevin D. Robinson"}, {"rating": 3.0, "review": "I gave it 3 stars because i got it for $20 during the initial pre-order. Knowing what i know now about it, i would not pay the full price.It is nice and compact and plays Amazon Prime stuff really nice. I didn't have Dolby Digital Plus when i got it, so I did get a new AV receiver to play DD+. I needed a new one for a future 3D tv purchase and i needed the receiver to handle it. So once i got the new receiver, i hooked up the fire stick and it played the Amazon Prime really well complete with surround sound. But the main reason i bought it was for the Flixter app. I have a lot of ultraviolet and Vudu movies and i wanted to watch them using the firestick instead of the Xbox One. So i fired up the app and quickly realized it doesn't give me 5.1 surround, just 2 channel stereo. I can't comment on the video quality of the Flixter app, because it was so awful sounding that i turned it off.So bottom line, if you want it for Amazon video, and you have DD+, then this is probably a good deal. If you wanted to use the other apps, then maybe not. I don't know if the other apps also have this limitation of 2 channel sound or not. If the Apple TV had a Vudu app, i would never have purchased the fire tv stick.", "verified": true, "helpfulness": "0/1", "author": "E. Bluebaugh \"EWade\""}, {"rating": 3.0, "review": "Does anyone know if you can browse the web on this?", "verified": true, "helpfulness": "0/0", "author": "Steven Gleyzer"}]