[{"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Furstenberger"}, {"rating": 4.0, "review": "Good product but it's surprising how limited the free Amazon film library is. You'd think they'd have more old movies available for free or a reduced price.", "verified": true, "helpfulness": "0/0", "author": "Bill Neville"}, {"rating": 5.0, "review": "Great product did all the things that it said it would do.", "verified": true, "helpfulness": "0/0", "author": "Jesse Fabela"}, {"rating": 5.0, "review": "Very easy to use.  It works well in replacing bulky components to watch streaming content.  It really is an all-in-one for watching TV and movies.", "verified": true, "helpfulness": "0/0", "author": "Jim Soria"}, {"rating": 5.0, "review": "This is grreat! Use it to watch local network media with Plex and Netflix and for course, Amazon Prime. Kids love playing Crossy Road on it! I happened to order it pre-release and wow what a great deal! Which I'd gotten a couple more!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wonder what I did without it.  Truly love it.", "verified": true, "helpfulness": "0/0", "author": "Jean"}, {"rating": 2.0, "review": "I'm not happy with it. It stopped working", "verified": true, "helpfulness": "0/0", "author": "terreva arrington"}, {"rating": 5.0, "review": "Awesome product with Amazon Prime! And lots of Closed Captioning for hearing impaired people like me!", "verified": true, "helpfulness": "0/0", "author": "Courtney M."}, {"rating": 3.0, "review": "Freezes more than the amazon box. It had a glitch (acted jittery 2-3 times in one episode). It doesnt last long but still the program is running as smooth as our amazon box. it is still convienient for our guest room. We only tested it out for a day or two. So we'll see how it holds up. I was lucky enough to get it at the promotional price.", "verified": true, "helpfulness": "0/0", "author": "Amazonian"}, {"rating": 5.0, "review": "Excellent.. Very easy to install and I am not a tech person.  Very good purchase at a good price.", "verified": true, "helpfulness": "0/0", "author": "Margaret Ahearn"}]