[{"rating": 5.0, "review": "This is AWESOME!!!!  It is even better that I expected!!The movie selection is vast and the \"Amazon series\" have been good so far.The access to Netflix is faster and easier than my previous method of using my blue ray player.There is nothing not to love", "verified": true, "helpfulness": "0/0", "author": "Lou Ann Prescott"}, {"rating": 5.0, "review": "I have had a Roku 2, still have a Chromecast, and now a Fire TV stick, by far the Fire TV stick is the best of the bunch.  I have had it about 2 months now and it is very easy to use, I don't have to use my PC, phone, or tablet like a chromecast, and much smaller then a Roku.  It took about 2 minutes to set up and is a breeze to use, I plan on buying 3 more for my kids.", "verified": true, "helpfulness": "0/0", "author": "Schmedy"}, {"rating": 5.0, "review": "having had other media stream players, this one is very fast. I can stream from Netflix and Amazon Prime as well as my local DLNA server which houses many of my music and movies.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It's definitely a good value; I would buy one as a gift and would purchase again.", "verified": true, "helpfulness": "0/0", "author": "klunited"}, {"rating": 5.0, "review": "Just started using it,so love it", "verified": true, "helpfulness": "0/0", "author": "jennifer turbett-leighton"}, {"rating": 5.0, "review": "Works awesomely!  Love it!", "verified": true, "helpfulness": "0/0", "author": "SurgicalRN"}, {"rating": 5.0, "review": "Got the stick for a bedroom.  I have the Fire TV for the main living room.  The stick works great, maybe a little lag as comparef to Fire TV but you would not even notice it without a side by side comparison.  Everything just works well on the little stick.", "verified": true, "helpfulness": "0/0", "author": "NEYankee"}, {"rating": 5.0, "review": "Excellent. Easy to install easy to use. Better than expected.", "verified": true, "helpfulness": "0/0", "author": "Carmen Pacella"}, {"rating": 5.0, "review": "Own a roku and decided to try the fire stick, love it, works great and my kids can operate it too!", "verified": true, "helpfulness": "0/0", "author": "Mom of Twins"}, {"rating": 5.0, "review": "I placed an order and it was already on back order however AMAZON was able to deliver it before it's due date. I have now had the AMAZON Fire stick for 2 weeks and I am extremely happy with it. It is very responsive. The options are great. The stick is currently also very capable of having other no prime apps installed on it. You can google how to sideload apps to fire stick and you can find guides on YouTube and so on. I will be updating my review in the coming months.", "verified": true, "helpfulness": "0/0", "author": "Saman"}]