[{"rating": 5.0, "review": "I love my fire stick. I can watch whatever I want whenever. Easy menu easy to install easy to use. Kids love the games I love the music and just everything else about it", "verified": true, "helpfulness": "0/0", "author": "Laci \"~Dum Spiro Spero~\""}, {"rating": 1.0, "review": "What a piece of garbage. Worked terrible with some major connectivity issues, and the usb power didnt work and I couldn't get it to continually connect with my tv. It just kept not showing on my tv.Plus, it would launch on my tv without me telling it to.", "verified": true, "helpfulness": "0/0", "author": "HULLDUCK"}, {"rating": 2.0, "review": "there's not enough variety..definitely not even close to an alternative to cable or satellite plus you have to pay for everything ...so not even cost effective.....don't waste your time......", "verified": true, "helpfulness": "0/0", "author": "tony"}, {"rating": 5.0, "review": "Have to wait until my husband comes back in town to set this up, but it looks like I am going to love it.It is really what I wanted for awhile now.  Thanks for fast shipping", "verified": true, "helpfulness": "0/0", "author": "Joanne Phillips"}, {"rating": 5.0, "review": "Can't believe we waited as long as we did to pick one up. It's great for the bedroom t.v. to use our Prime membership as well as Netflix and Hulu. We quit cable a long time ago so some of the free offerings on it are fun to have as well. The remote is so simple that even my technologically challenged wife finds it easy to use. We'll definitely give the voice remote a try when we get our next Stick for our other t.v.", "verified": true, "helpfulness": "0/0", "author": "Mopjockey"}, {"rating": 3.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "HERNAN"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Darrell Sheetz"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Seeshe"}, {"rating": 5.0, "review": "It's just like they said, very easy to set up, it is a great item", "verified": true, "helpfulness": "0/0", "author": "Randy Zimmer"}, {"rating": 5.0, "review": "Although it took forever to get to us. (ordered in dec got it in march) this thing is perfect! Hit the home button and it will automatically switch my tv over to the correct HDMI channel. We use this thing more then we watch cable at this point! I really like that it has a remote, coming from a chromecast and all the BS that goes along with connecting to the wifi, trying to get the phone and unit to synch, having the program crash the phone etc. This allows me to just use the remote and avoid all that!", "verified": true, "helpfulness": "0/0", "author": "James E. Ross"}]