[{"rating": 1.0, "review": "Very poor buffering all the time and in between. The resolution was about  a 420 aweful", "verified": true, "helpfulness": "0/0", "author": "don salazar"}, {"rating": 5.0, "review": "Product was as promised and easy to install even for an oldster like me. Looking forward to many hours of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Stan Florczak"}, {"rating": 5.0, "review": "Up and running in less than 10 min I started off using the remote control that came with the firestick but ended up downloading the firestick app and now use my phone or tablet. I never had chrome but I can't imagine it could be any better.", "verified": true, "helpfulness": "0/0", "author": "William Y"}, {"rating": 5.0, "review": "Very happy with the firestick.  Super easy to install to TV. Opens right up with Amazon Prime movies and TV shows, saves my watch list.  I did not get the voice control remote but what an awesome feature that is available.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Really enjoy it, may get rid of our satellite service", "verified": true, "helpfulness": "0/0", "author": "Keith S."}, {"rating": 5.0, "review": "My Amazon Fire Stick showed up on time. The setup was super easy. I spent the next three hours going through the LONG list of apps. that are downloadable . You can shop directly on your TV or log into your amazon on your account from your computer/tablet and shop for the apps that way. I bought the three months of Sling TV to get the Fire Stick free. I will not pay the high amounts for cable or Dish because we only watch 2 or 3 of the channels. Sling is perfect for our family. I kept Hulu and Netflix so all together we have a great selection of shows/movies for way less then you would pay a month for cable or dish.", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 5.0, "review": "Perfect for the family room", "verified": true, "helpfulness": "0/0", "author": "Gymnast_Jillian"}, {"rating": 5.0, "review": "Really great", "verified": true, "helpfulness": "0/0", "author": "Janet king"}, {"rating": 5.0, "review": "Brand new to this service and loving it so far~!!!!", "verified": true, "helpfulness": "0/0", "author": "Jane Gue"}, {"rating": 3.0, "review": "The auto level need to be improved, we needed to set the level at max on the TV when using the stick but  had to reset to a lower auto level when back on the network.", "verified": true, "helpfulness": "0/0", "author": "robert t tobias"}]