[{"rating": 5.0, "review": "Works great love it. Remote was hard to open that was the only thing that I had a problem with. But I love it.", "verified": true, "helpfulness": "0/0", "author": "Joe Reed"}, {"rating": 5.0, "review": "just started using it what a great deal with Prime", "verified": true, "helpfulness": "0/0", "author": "colleen antonini"}, {"rating": 5.0, "review": "Love my Fire Stick!!!  This thing is awesome!  If you don't have one get one, it's well worth the price, a very reasonable price.  Super easy to install and use. I am 63 and not electronic savvy, so when I say this is easy to use....trust me.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works as advertised. Easy to use and no poblems.", "verified": true, "helpfulness": "0/0", "author": "cddaddy"}, {"rating": 4.0, "review": "I was pleased with the ease of installation and set up.My major concern with its use is the \"sensitivity \" of the keypad when typing in search. An \"accidental brush \" over a letter caused numerous mistakes. Overall, a good and useful tool.", "verified": true, "helpfulness": "0/0", "author": "Evan Clay"}, {"rating": 5.0, "review": "Nice product, easy to use and works seamlessly with my wifi! Recommended", "verified": true, "helpfulness": "0/0", "author": "Don PI."}, {"rating": 5.0, "review": "Althought it took a long time for the initial setup download (about 20 minutes), after that, It runs fast, faster than similar devices for much lower price.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Liao"}, {"rating": 5.0, "review": "Really easy to use. Loving all the apps and the selection of movies, shows, parenting guides. Wished I would have thrown out Direct TV along time ago.", "verified": true, "helpfulness": "0/0", "author": "Dannette de Pando"}, {"rating": 5.0, "review": "works better than expected would recommend to all", "verified": true, "helpfulness": "0/0", "author": "J. Wellner \"Jim\""}, {"rating": 5.0, "review": "I love this device.  It works perfectly and would highly recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "RSStockt"}]