[{"rating": 3.0, "review": "Works good but often starts buffering.", "verified": true, "helpfulness": "0/0", "author": "Jorge barreto"}, {"rating": 5.0, "review": "Excellent product! All of the popular networks are at your fingertips and it is well worth the cost. I highly recommend!", "verified": true, "helpfulness": "0/0", "author": "yse37"}, {"rating": 5.0, "review": "Works great, like it better than my smart TV with Amazon already installed.", "verified": true, "helpfulness": "0/0", "author": "Roy French"}, {"rating": 5.0, "review": "Great portable smart TV!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "JHColonJr"}, {"rating": 4.0, "review": "I love making my boring flat screen into a smart tv. I also love Amazon! However, I find that this stick sometimes has a hard time staying connected to the network. Also, it does not do well when I try to go back to Netflix because it always makes me log back in again (could be a problem with Netflix, but either way my watch time is lessened). I still like it and use it often.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Great little device. I've had it for about a month now. The small device can't handle getting a little warm, because there is no way to turn it off without unplugging it. Once it is hot it gets very laggy and the video has a hard time keeping up. Unplug it, wait a few minutes, plug it back in and it work fine for awhile...", "verified": true, "helpfulness": "0/0", "author": "Nic Olson"}, {"rating": 5.0, "review": "Fifteen minutes after the FIRESTICK arrived I was watching some great programs.", "verified": true, "helpfulness": "0/0", "author": "emily himelstein"}, {"rating": 5.0, "review": "The fire TV stick works as advertised. It provides a cheaper alternative to steam apps on a TV. I used my Xbox360 to stream video, but lately has stopped working correctly. I chose the fire TV stick because of the reviews not only on Amazon, but all over the internet. Great price and performance.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Richard Marquez"}, {"rating": 5.0, "review": "I wanted to be able to watch Netflix and Amazon Prime on my television. This device allows me to do that. It also allows me to listen to my local NPR station which I have trouble picking up inside my house with a radio.", "verified": true, "helpfulness": "0/0", "author": "Wendy Ross"}]