[{"rating": 4.0, "review": "I had an Apple tv before,and it is comparable to it.  So far it has been working well.", "verified": true, "helpfulness": "0/0", "author": "Ronald G. Watson"}, {"rating": 4.0, "review": "Like this because you can go to a series like \"Game of Thrones\" and watch it all in a row without trying to catch all the parts out of order.  Also now I can access Netflix w/o using my old WI machine. (i think that you need to be a member of Netflix already).  Also has a free app for kindle fire and other androids if you need a better keyboard instead of just find the letters on the search engine.  Hundred of new movies including amazon Prime (if you have those) are available with just one search engine.  It already saved money the day i got  it because i was going have to order a back season1 that wasnt showing anymore and there it was!The biggest downfall is its black and VERY tiny  so  its bound to get lost and very hard to find  We solved this by gluing a Finder beeper to the back of it !.The learning curve is pretty fast for the controller except needs  to have the select button in the very center marked and if the directionals marked would help.. They sacrificed clarity for the sleek design. But anyone under 12 will be able to show you.Suggestions--make it bigger in a bright color and mark the enter button.", "verified": true, "helpfulness": "0/0", "author": "pamakarma"}, {"rating": 5.0, "review": "There were a couple extra steps to installing not explained when purchased but I am extremely happy. Im sure my local video store will miss me.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Clark"}, {"rating": 1.0, "review": "The stick cannot recognize my Amazon account and you cant skip it i.e. DOESNT WORK !!!! And Amazon do nothing about it.", "verified": false, "helpfulness": "0/0", "author": "vFarid"}, {"rating": 5.0, "review": "Making any of my tvs a smart tv is pretty cool.  This is better than my smart tv,my photos go on it automatically .  Games,my amazon music.  Netflix ,amazon prime.  My phone has a remote app that works awesomely.  I'm still figuring it out but I think it's the coolest.", "verified": true, "helpfulness": "0/0", "author": "sam wrong"}, {"rating": 4.0, "review": "This device is excellent!!! Just make sure to have a strong WiFi connection.", "verified": true, "helpfulness": "0/0", "author": "Thomas"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jeanne mcginness"}, {"rating": 5.0, "review": "so convenient and easy to install works great - great buy !", "verified": true, "helpfulness": "0/0", "author": "Leonel Torres"}, {"rating": 2.0, "review": "I really wanted to like this product. I had read up on reviews of other streaming devices and decided to try this out to replace my apple tv. I found it connected to the internet terribly. At first I thought it was just my connection, then I tired it at a different house and same problem. When it did connect to the internet it seemed to run amazon content much better than anything else. I had read this product pushes it's own content (makes sense) but that fact that it would only really work on it's own content infuriates me. I switched back to my apple TV (which connects to the same internet fine) and am moving the kindle fire to the TV literally next to the router. if it still doesn't work I will likely return it or throw it away. I am annoyed that it doesn't work great but exceedingly frustrated and disappointing in amazon that it seems to only work on amazon content. Bottom line: would not recommend it.", "verified": true, "helpfulness": "0/0", "author": "Rosie Loring"}, {"rating": 5.0, "review": "does everything I expected it to do", "verified": true, "helpfulness": "0/0", "author": "Mike"}]