[{"rating": 5.0, "review": "Love it really easy to get started.  Plug and begin watching!!!!  Great buy.", "verified": true, "helpfulness": "0/0", "author": "Javon R."}, {"rating": 5.0, "review": "A great device for the price!", "verified": true, "helpfulness": "0/0", "author": "Margaret"}, {"rating": 5.0, "review": "This is a great product. The picture quality is amazing, even with a slow internet connection, and it's pretty simple to use and setup. I love that you can download a remote app on your phone for it too (although apparently apple hasn't jumped on that band wagon yet). I much rather use the Fire TV Stick than my PS3, Samsung TV, or WiiU. Not only is the picture quality better, but you can only assume that your sucking up a little less electricity using this than a gaming console, BD player or computer if you connect the power source to the TV's flash port. It's also super convenient if you use the amazon cloud feature as a prime member. It's easier and faster to transition from one app to another than any of my BD players or consoles. I'd definitely harass my friends into buying this. ^_^", "verified": true, "helpfulness": "0/0", "author": "EYR"}, {"rating": 1.0, "review": "sending it back.  You would think that the easiest thing would be to plug in into the tv but it wont go in.  I feel like I am breaking the tv.", "verified": true, "helpfulness": "0/2", "author": "Linda Erickson"}, {"rating": 5.0, "review": "Yes we wanted to add more streaming to our TV choices.  It works great!", "verified": true, "helpfulness": "0/0", "author": "Terry"}, {"rating": 5.0, "review": "Easy to set up in about 10 minutes. Looks like a nice unit to use for the money. I wish I seem them for $19.00 when they had them on special. Cheaper than the ROKU device. Smart Phone app works fine. Take it out of the box and plug it in. Follow on screen details and you are good to start watching. I use Netflix and Amazon Prime for movies.", "verified": true, "helpfulness": "0/0", "author": "M. Ours"}, {"rating": 5.0, "review": "Finally got this up and running.  Have a little trouble with the remote initially but it seems to be working fine. You must download apps such as Netflix to watch Netflix. A bit different concept than the Apple TV I have which comes with everything pre-installed.  The Netflix app is a bit different than Apple.  The music on Prime consists of only existing playlists.", "verified": true, "helpfulness": "0/0", "author": "Voltaire"}, {"rating": 5.0, "review": "Works awesome! Highly recommend it for non smart TVs", "verified": true, "helpfulness": "0/0", "author": "Matthew Norris"}, {"rating": 5.0, "review": "Love it and bought another one as well", "verified": true, "helpfulness": "0/0", "author": "Michele Meres \"Michele Meres\""}, {"rating": 4.0, "review": "Works good. I bought this for my living room to help eliminate the clutter of cables and peripherals. If you have Comcast, HBOGO is NOT supported. Plex is also NOT a free feature with Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "lowtech"}]