[{"rating": 1.0, "review": "Do not buy this. Mine completely cleared itself wiped it from the account. Piece of crap. I had spent a week getting everything set up. Used it a day ago. Then today I turn it on and it is in new setup mode. Terrible terrible terrible. Do not buy do not buy do not buy.", "verified": true, "helpfulness": "0/0", "author": "Robert E mason"}, {"rating": 3.0, "review": "Unable to access. Prime content in my country.  Had I known this before would not have purchased.  Just use my smart TV", "verified": true, "helpfulness": "0/1", "author": "Elizabeth Saunders"}, {"rating": 5.0, "review": "Best purchase I have made all year!", "verified": true, "helpfulness": "0/0", "author": "PATRICIA DOMINGUEZ"}, {"rating": 5.0, "review": "Love love love it!!! Well worth the money for anyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use and set up.  Worked immediately. Does not have bug or crashing issues. It is affordable too.", "verified": true, "helpfulness": "0/0", "author": "rabbit rabbit \"rabbit rabbit\""}, {"rating": 5.0, "review": "Easy to use, much more convenient than Google's Chromecast as a computer is not required while watching Netflix, YouTube, etc.", "verified": true, "helpfulness": "0/0", "author": "Amanda Beckman"}, {"rating": 5.0, "review": "freaking love it. It is really nice having all the prime videos so easy to access. I will be getting another soon", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Works great and truly is easy to install.  I'm NOT a techno whiz but was able to do it in less than 15 minutes.", "verified": true, "helpfulness": "0/0", "author": "Janet"}, {"rating": 2.0, "review": "Love the firestick.  Remote quit working 6 weeks later and its out of warranty. Not cool!", "verified": true, "helpfulness": "0/1", "author": "brittaney hart"}, {"rating": 5.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "Denise C."}]