[{"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "Nina Herrera"}, {"rating": 5.0, "review": "i love it. although i want to search for movies and shows and the sear menu option is to tricky and specific. there should be an option to put any actor in or title.  just keep seeing the sme things in the menu options", "verified": true, "helpfulness": "0/0", "author": "Sherry Ray-Von"}, {"rating": 5.0, "review": "The Fire Stick is as it was advertiseed to be and more. I like it very much and will get a lot of use out of it.", "verified": true, "helpfulness": "0/0", "author": "Thelbert Edwards"}, {"rating": 4.0, "review": "I am very pleased with the purchase of the Fire TV stick. It is very easy to use. I now have the advantage of having a \"smart\" tv.", "verified": true, "helpfulness": "0/0", "author": "Mary Delores Torres"}, {"rating": 5.0, "review": "My daughter said to me \"Check this out on Amazon.\" Boy am I ever glad I did. This was a very good purchase. Reasonable price. Great performance. So easy to install I could do it and trust me that's saying a lot about my ability to handle electronics.Really recommend the Fire Stick. Can't think of a reason not to.Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Sharon R. Steinecke"}, {"rating": 5.0, "review": "Excellent value. It even works as advertised. Neat product..", "verified": true, "helpfulness": "0/0", "author": "John Felton Wagner"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "gabriel delgado"}, {"rating": 5.0, "review": "I love this Fire TV Stick.  It is so much better than using the Xbox.  Just plug this in the HDMI port and it's ready to use.", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 5.0, "review": "I'd been using my iPad and Apple TV to watch Amazon prime videos, but this is so much easier.", "verified": true, "helpfulness": "0/0", "author": "R. Kosh"}, {"rating": 4.0, "review": "I was disappointed that the remote did not have the microphone on it and the previous version did.", "verified": true, "helpfulness": "0/0", "author": "Rueben Dallas, Sr."}]