[{"rating": 5.0, "review": "Way better than paying $155+ for cable and internet! I highly recommend it! Also very easy to install and setup.", "verified": true, "helpfulness": "0/0", "author": "Mely"}, {"rating": 5.0, "review": "Great Product!!", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "I got this for my dad, I thought it would be simpler than getting him the Fire TV. He loves it.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Maldonado"}, {"rating": 5.0, "review": "Love the Fire TV Stick. My smart TV broke this past spring and I didn't want to invest in another one. But with the Fire Stick my current tv is \"smart\". LOVE IT LOVE IT LOVE IT! Way to go Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"BeautyRevieJunkie\""}, {"rating": 4.0, "review": "The biggest complaint I have is that this would be great to use in hotels but if you are required to sign in to the internet though a proxy server like most hotels do then there is a very complicated process to set that up.  I had read there were going to be updates that might eliminate that process but I have not checked recently to see if that is the case.  I think this is unfortunate since my idea of its best use would be while traveling.", "verified": true, "helpfulness": "0/0", "author": "Tfarm33"}, {"rating": 2.0, "review": "So slow. The streaming is terrible with this device. I am so annoyed. I am shipping it back today.", "verified": false, "helpfulness": "0/0", "author": "Gladys Jones"}, {"rating": 3.0, "review": "The new promotion pushing this because HBO is available (and Showtime) is not really true. It depends on your cable provider. Before you purchase this, make sure you cable provider is on the list. Mine (Charter) is not on the list so I cannot get HBO or Showtime with the Fire TV. I have to use my X-Box. I bought it specifically to use on these two services and was very disappointed.", "verified": true, "helpfulness": "0/0", "author": "JLnSTL"}, {"rating": 4.0, "review": "So far I'm happy with my fire stick. Very simple to set up and use. My only complaint is navigating. Flipping through the selections/pictures is time-consuming. Unless you know what you are looking for and where it is. The search option is tedious selecting letters to spell out your show or subject . Also I may have overlooked this but it would be nice to have instructions to read as you learn to navigate the menu.", "verified": true, "helpfulness": "0/0", "author": "BLK \"B Kedro\""}, {"rating": 5.0, "review": "OMG!!! This was so easy to use. It came already linked to my amazon account so, I was able to use prime video already!! I was beyond happy. I have a kindle so I had apps already downloaded and they were on the cloud so I simple had to download them. I was watching HBOGO in under 2 minutes.The stick is so easy to use and install. I am proud to say I did not need my husband to \"fix\" this for me! I am an independent woman and I did this on my own! If I can anyone can!!I am extremely happy with my stick and I would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "JustMyThoughts"}, {"rating": 5.0, "review": "excellent product", "verified": true, "helpfulness": "0/0", "author": "Robert T."}]