[{"rating": 5.0, "review": "We love it!!! It's so easy to use. No more expensive cable bills.... Thank you Amazon... Now we can watch what we want to, when we want to.", "verified": true, "helpfulness": "0/0", "author": "LeeAnn Penor"}, {"rating": 5.0, "review": "Like it but got complicated trying to install because I only had 2 ports on back of new TV and so had to buy something xtra to use both fire tv and DVR!  Had to find friend to do this so total extra expense ended up being over $100 -- that's a lot of rented movies! LOL -- but now very usable although too many remotes!! :)", "verified": true, "helpfulness": "0/0", "author": "Joyce Marshall"}, {"rating": 5.0, "review": "Good deal, If u have Prime and Netflix or any other subcriptions. I cant watch Showtime due to  having one of the cable providers.", "verified": true, "helpfulness": "0/0", "author": "Thomas Family"}, {"rating": 4.0, "review": "ENJOYING IT. STILL LEARNING THE DIFFERENT USAGES...THANK YOU", "verified": true, "helpfulness": "0/0", "author": "Monica Solis"}, {"rating": 5.0, "review": "I just installed the Amazon fireTV stick, and it was one of the easiest installations I've ever done. Congratulations Amazon.", "verified": true, "helpfulness": "0/0", "author": "Orlando Habos"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Bobby Washington"}, {"rating": 5.0, "review": "I decided to try this after my Roku and Chromecast both let me down in its ability to stream my slingbox without buffering and cutting out. I read in the slingbox forums that people had good luck with with the fire TV stick.For the price, I figured why not. If not, I could toss it in my spare room and use it for Netflix and Plex.I can honestly say I am pleasantly surprised. Setup is simple. After spending just a couple minutes trying in logins, I was up and going with not only Slingbox, but also HBO go, Showtime, Netflix and my entire Plex library, and of course prime video.Naturally, all other programs work perfectly. I expected the to. Slingbox was my big curiosity. It too worked great! Every once in a while I get a little studded, which is expected when relying on my not so great upload from my other house.Quality is fine. I was able to watch baseball and hockey and be content with the quality.I also like the remote app for my phones. Mykids love to lose small remotes, so being able to use a simple app on my phone to control everything is great.Since I started using the fire TV stick, my roku has stayed unplugged.One thing that needs improving. 5.1 sound is a known issue with firetv firmware. It pretty much doesn't work along with plex.Otherwise, I'm very happy.", "verified": true, "helpfulness": "0/0", "author": "Camalus"}, {"rating": 3.0, "review": "Generally this is a good product, except the wifi signal seems a little too spotty.", "verified": true, "helpfulness": "0/0", "author": "Jesse J. Skorupa"}, {"rating": 4.0, "review": "Fits my needs", "verified": true, "helpfulness": "0/0", "author": "R. Bell \"firecap302\""}, {"rating": 5.0, "review": "I approach electrical connections with great anxiety.  This was plug and play!  It came pre-registered to my account and my watch list was waiting for me.  I was using a Sony Network device and I was shocked at how fast the Fire Stick moved.  I am sorry I didn't get it sooner.  Frankly, I only had one difficulty.  The batteries were VERY hard to get into the Fire Stick remote.  Really.  I could see how they were supposed to go in, but I could not get the back off.  I eventually went to the Amazon Help Page, where it stated that a lot of pressure had to be applied.  I eventually moved it open enough to pry the rest off with a knife.", "verified": true, "helpfulness": "0/0", "author": "B. K. Smith \"camel friend\""}]