[{"rating": 5.0, "review": "Product was as described.", "verified": true, "helpfulness": "0/0", "author": "jmstorm"}, {"rating": 5.0, "review": "Wasn't sure how much I would really like this, but it is great! Able to watch netflix or amazon prime quickly and easily! Will definitely be buying more for other televisions in house and also for gifts! LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Amazon Junkie \"Amazon Junkie\""}, {"rating": 3.0, "review": "Keep in mind, you need to have an extra AC power outlet close by.  They don't show it on the commercials or in the pictures, but you need to have AC power to plug this in, it is not like a flash drive that is powered off the port.  Other than that minor pain in the a** it works well and my wife really likes using it.", "verified": true, "helpfulness": "0/0", "author": "PowerFish \"PowerFish\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Valerie"}, {"rating": 5.0, "review": "Very cool!", "verified": true, "helpfulness": "0/0", "author": "Carol Petrie"}, {"rating": 3.0, "review": "It's a decent addition to my Fire collection, but the number one thing is it requires almost perfect WiFi to watch a single prime movie without buffering, I watched \"Paranormal activity: The marked ones\" and had no problems, but then I tried watching \"The Wolf of Wall Street\" and I had took disconnect my Fire HDX for it to play with buffering every now and then, but with my Fire HDX connected the movie would pause every 5-7seconds and then play for another 7-10 seconds. If it didn't buffer so often I would rate this at a 5, and also it's the same with listening to music on the Fire stick also, if the HDX is connected the music has to buffer ever 10-15seconds.", "verified": true, "helpfulness": "1/1", "author": "Nancy"}, {"rating": 3.0, "review": "The stick itself works great. Remote stopped working after a month.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 5.0, "review": "Works great. Easy set-up. Packaging is top notch. Only wish Amazon would make a top-notch hdmi splitter to go along with it, as the TV it is hooked up to only has one hdmi port, and splitter reviews are less than stellar for those advertised through amazon.", "verified": true, "helpfulness": "1/1", "author": "Robb R"}, {"rating": 5.0, "review": "Very straight forward instructions - EASY to install - EASY to use. Great product!!!", "verified": true, "helpfulness": "0/0", "author": "Georgia Harbeck"}, {"rating": 5.0, "review": "Plugged this into a computer monitor with a HDMI connection and it worked great.", "verified": true, "helpfulness": "0/0", "author": "Papawgary"}]