[{"rating": 5.0, "review": "I like the Fire stick. Set up was so easy and fast. All you need is your router password . Much easier than Roku..No guessing with Fire Stick . 10 minutes and it was set up and watching. Good value !!!", "verified": true, "helpfulness": "0/0", "author": "D R."}, {"rating": 4.0, "review": "A ton of great content is available through this device. Its comparable to many other similar \"dongles.\" It is great that it came with a remote, where some others do not. My remote, however, has not worked quite right since day one. The buttons often stick, and randomly will scroll about a dozen times, rather than the once that I pressed it. I know you can also use a smart device as a remote.  But, the hardware should work, if its in the box.The remote is the only thing keeping my review from being 5-stars.", "verified": true, "helpfulness": "0/0", "author": "Jeremiah Mize"}, {"rating": 4.0, "review": "yes, it was a great gift and the the selection of apps/ games are amazing.", "verified": true, "helpfulness": "0/0", "author": "LIL Todd"}, {"rating": 5.0, "review": "easy to use", "verified": true, "helpfulness": "0/0", "author": "GEARY E WELLS"}, {"rating": 5.0, "review": "Great product. Having a Prime membership adds a lot to the Fire TV Stick's features. Although I primarily use this for Plex, I also like to use it with Netflix, Pandora, TuneIn Radio, Prime Music, Prime Video, and Prime Photos. I wish there were more apps, and specifically Dish Anywhere (they have Slingplayer).", "verified": true, "helpfulness": "2/2", "author": "beans"}, {"rating": 5.0, "review": "Works great!Easy navigation and plays movie perfectly on my TV.", "verified": true, "helpfulness": "0/0", "author": "HwiTaeKim"}, {"rating": 5.0, "review": "This is awesome. Easy to install. I own a Roku but I often had problems with the connection and had to reboot. With Fire stick I Have had no problems. I have basically stopped using the Roku.  Using the control is easy. This tops Apple tv too which is also very inconsistent with the connection. It is also better than Chrome. Given that you can't stream lap top content, like Chrome, it is more reliable.", "verified": true, "helpfulness": "0/0", "author": "despond \"eig\""}, {"rating": 5.0, "review": "Easy to use and I love it!", "verified": true, "helpfulness": "0/0", "author": "Kalama Hochreiter"}, {"rating": 5.0, "review": "Transitioned from the Xbox to the Fire Stick and we love it. Faster loading times, never drops the wifi signal, and can completely handle all of the traffic we put through it. I can't praise it enough.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Bummer-  Some nice features BUT it doesn't consistently run NETFLIX.  So we are back to our ROKU.", "verified": false, "helpfulness": "2/4", "author": "Kath"}]