[{"rating": 5.0, "review": "Works great would recommend to a friend", "verified": true, "helpfulness": "0/0", "author": "Joseph king"}, {"rating": 5.0, "review": "I can't believe how simple this is to use!", "verified": true, "helpfulness": "0/0", "author": "Cynthia R Stevens"}, {"rating": 4.0, "review": "Doesn't pick up my wifi as good as I would think it would but overall very pleased", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 2.0, "review": "Well I found the remote little clumsy in its performance although it was not even 5ft distance of operating it. Other than that it is not the device if you are looking for casting.", "verified": true, "helpfulness": "0/0", "author": "KKS"}, {"rating": 5.0, "review": "Love being able to watch my Netflix and Prime right on my tv. Easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "chrystal dangelo"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Brian Standeidge"}, {"rating": 5.0, "review": "2nd one for my house", "verified": true, "helpfulness": "0/0", "author": "Mark Benacquisto"}, {"rating": 4.0, "review": "Works very well.  Complaint is that the interface (while aesthetically pleasing) is not as intuitive as other devices I've used.  For the price, this is a great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Great idea, horrible execution. Everything buffers - I mean everything. I'm surprised I didn't read more about that in the Amazon Reviews, because once I started having an issue and looking into it more I found that it seemed to be a common problem. There is a forum on Amazon with hundreds of questions/concerns regarding this matter and not ONE response from Amazon. Very unfortunate, because I was excited about this product. Printing off the return label as we speak and will be purchasing the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "ljackson"}, {"rating": 5.0, "review": "Amazing even better if you get the controller", "verified": true, "helpfulness": "0/0", "author": "koolkatsalley"}]