[{"rating": 5.0, "review": "Works well.  Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Lori Smith"}, {"rating": 3.0, "review": "It is a good device for those that don't mind its lack of versatility.  I got used to having a laptop for streaming on my TV and what you can watch on a laptop far outstrips what you can do with any streaming device like the fire stick.  Plus I didn't like that fact I couldn't navigate to channels websites like CBS to watch shows there for free.  But if you already have or don't mind paying subscriptions to services like Hulu then I could be a good fit for you.I did like the remote and ease of setup it was pretty much plug and play.", "verified": true, "helpfulness": "0/0", "author": "Joshua Larson"}, {"rating": 4.0, "review": "Easy install, great connection,  movies and TV I wanted. Music and games still to explore. Grw as t product.", "verified": true, "helpfulness": "0/0", "author": "Marci B."}, {"rating": 5.0, "review": "Awesome. Should have got this a long time ago", "verified": true, "helpfulness": "0/0", "author": "Virginia Vovrse \"virginia vorse\""}, {"rating": 4.0, "review": "I primarily purchased this device/model due to it's compatibility with the latest Slingbox series. I can easily share the video output of my DVR in another room without having to pay monthly fees, and the Fire TV remote is also capable of controlling the DVR remotely. Great performance for the price.", "verified": true, "helpfulness": "0/0", "author": "klotzkm"}, {"rating": 3.0, "review": "Only decent movies or tv shows are with prime 50 percent the rest you still have to pay for", "verified": true, "helpfulness": "0/0", "author": "Donna L Gatley"}, {"rating": 5.0, "review": "great if you have high speed internet", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great", "verified": false, "helpfulness": "0/0", "author": "Betty DuRante"}, {"rating": 5.0, "review": "I'm enjoying the Firestick so far. I wish I'd paid extra to upgrade the remote. The remote that comes with it is hard to use.", "verified": true, "helpfulness": "0/0", "author": "Karen Geiger"}, {"rating": 5.0, "review": "Worth the wait great sale price", "verified": true, "helpfulness": "0/0", "author": "Rehab guy"}]