[{"rating": 5.0, "review": "best 20 bucks ive ever spent", "verified": true, "helpfulness": "0/0", "author": "Carsten de Wolff"}, {"rating": 5.0, "review": "I just got mine in the mail today and this thing is awesome.I can watch just about anything I want using this thing. Having Twitch.tv and the WWE Network were HUGE PLUSES! I can finally watch my WWE Pay Per Views or CS:GO Tournaments on a big screen instead of all of us huddling around my computer. How cool is that? (Or nerdy/lame, I guess it depends on your tastes, right?)There's also a massive collection of movies and TV shows, which I'm sure you're familiar with if you already have Amazon Prime.There are also a ton of other apps (History channel, a lot of food and recipe channels, there's an entire indie cable app that looks just like real cable).Protip: If you want to stream videos from your computer, the app you're looking for is PLEX. You'll also have to download the PLEX Media Server onto your computer. The app costs $4.99, but it's totally worth it if that's what you're looking for (and oh was I looking for it).Basically... I've barely scratched the surface and we're well into 5 star territory. I wish I could give it 10 stars.I'm very excited to keep exploring this thing. Maybe I'll even get to cancel my cable. We'll see.", "verified": true, "helpfulness": "1/1", "author": "Stephen Cosgrove"}, {"rating": 5.0, "review": "This gives me all the flexibility I want to see Netflix, Amazon Prime Movies, Pandora Radio etc. without purchasing expensive products or a fire compatible tv.  I spent about 10 minutes setting it up (maybe less), logged into my favorite apps, and had my tv as an extension of my virtual world.  I love this.  The fire stick already knew who I was, so the amazon connection was almost instant.", "verified": true, "helpfulness": "0/0", "author": "Dotty Dear Old Thing \"Barb\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "keith williams"}, {"rating": 5.0, "review": "FANTASTIC--replaced my roku 3--now i can listen and watch Amazon Prime Music.  It is also great for watching Amazon Prime Video.  Thanks Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "LASTCALL"}, {"rating": 4.0, "review": "This is a REALLY awesome device!  I have since been downloading apps that really help make it a great experience.Between my Netflix app, to the bowling games, Flappy Bird and a host of other emerging news comp apps, this is really a neat and compact tool to avoid having to hook up a computer to your tv if you just want to use it for a second tv in the place/house.  I got rid of a computer in the room I was using after seeing how robust this device is.However, I fall short of giving this 5 stars because it needs better apps to add to their arsenal.  Example: local news, specific market targets (all news and shopping related).  Other than that, I love it.  Oh, please add the \"search\" option to the Vimeo app?  Thanks!", "verified": true, "helpfulness": "0/0", "author": "CB \"cbmuzik\""}, {"rating": 5.0, "review": "I wasn't expecting much from the Fire TV Stick but I am positively surprised by how it works. I even like its interface more than that of my Samsung SmarTV. It's way better than the Chromecast.  Definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Vinicio Mckay"}, {"rating": 5.0, "review": "Still learning to use this product. Great functionality compared Chrome Cast.", "verified": true, "helpfulness": "0/0", "author": "Seth"}, {"rating": 5.0, "review": "I've owned 2 different rokus, the chromecast, 3 apple tvs and now the Fire TV stick. Wow. The Fire TV stick is far and above the competition. Nice fluid layout. Very very good image and sound. Tons of options. Setup is a snap. Not a single complaint.Chromecast was slow. Image quality was always bad. The function was slow and lazy.Apple TV always did a good job but I don't like the lack of apps or price point.Roku got the job done but was slow at loading and picture quality left something to be desired.", "verified": true, "helpfulness": "0/0", "author": "Eddie Correa"}, {"rating": 1.0, "review": "Stacked side by side with roku and chromecast this product is a distant third.  It lags, neither of the others do.  Video quality has been unacceptable.  I am going to contact customer service tomorrow and see if a fix is coming.  If not I will return it.Update: tech support decided that the solution was the power strip and the remote. They would send me a new remote and nothing more. For kicks I tried the device and it still did not work with a dedicated outlet-and a new remote will not fix that. It is going back to Amazon", "verified": true, "helpfulness": "0/1", "author": "The_naprox"}]