[{"rating": 5.0, "review": "Awesome!! Love it!", "verified": true, "helpfulness": "0/0", "author": "Michael Breisch"}, {"rating": 3.0, "review": "Overall works great, if you have the subscriptions. If you don't have amazon prime, Netflix, hulu plus, or an internet/cable provider, it is not worth your time. I currently have charter and many of the apps don't work with charter. Which is extremely frustrating since many of them do with a different streaming device such as roku. Also, Fox sports says it works with charter, yet it is not an option. I think this is likely due to an amazon thing rather than a charter thing. Also a BIG negative it will disconnect from the internet regularly. Not sure why, but it is not my internet as I have used it on different Internets.  I will then have to unplug it and reset it at least once a day, normally.", "verified": true, "helpfulness": "0/0", "author": "Nikki Terry"}, {"rating": 4.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Michael J. Fox"}, {"rating": 4.0, "review": "I purchased this product for my parents. They seem to really enjoy it. The only thing I can say that is a negative is the layout of the home page. They made it much more complicated than it needed to be, but other than that it works great and was very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Loski"}, {"rating": 3.0, "review": "Overall it has met my needs - I've run into network connectivity issues a lot more with the Firestick than I do with the Chromecast, but I also think that is in part to a poor internet connection. Compared to the Chromecast, I think this is less user friendly since everything must be done through the TV using the remote (vs being able to stream directly from your phone). I bought the Firestick since I have Amazon Prime and thought it would be a big variety of movies, but honestly the Prime selection is pretty weak. Some of the TV series are nice, but most that is available (without additional cost) are Made-for-Prime movies and TV series. If I could do it again I probably would have just used the Chromecast and not spent the money on the Firestick.", "verified": true, "helpfulness": "0/0", "author": "Jackie"}, {"rating": 5.0, "review": "Makes TV much easier and a lot more fun.", "verified": true, "helpfulness": "0/0", "author": "julio cesar"}, {"rating": 4.0, "review": "streaming movies/ cutting cable bill", "verified": true, "helpfulness": "0/0", "author": "Tom McNeill"}, {"rating": 5.0, "review": "Awesome, easiest to install, get the app to go along with it.", "verified": true, "helpfulness": "0/0", "author": "luis charria"}, {"rating": 2.0, "review": "Wifi connection is very bad", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 5.0, "review": "Works much better than Roku when the signal is not strong!", "verified": true, "helpfulness": "0/0", "author": "Ebquillen"}]