[{"rating": 5.0, "review": "It is perfect! We love it!", "verified": true, "helpfulness": "0/2", "author": "A. Stearns"}, {"rating": 5.0, "review": "Love our fire stick was quick and easy", "verified": true, "helpfulness": "0/1", "author": "R.Berghold"}, {"rating": 4.0, "review": "What a Cool little piece of technology!", "verified": true, "helpfulness": "0/1", "author": "Jamie"}, {"rating": 5.0, "review": "Comes preprogrammed with your Prime membership and works really well. It doesn't use an IR remote so the stick lives behind your set. Great for guest room tvs.", "verified": true, "helpfulness": "0/1", "author": "Busy Angel \"David Simpson\""}, {"rating": 5.0, "review": "This is awesome.....love all the choices and the ease of use.  So glad we purchased the Fire TV Stick.  Well worth it.  Thanks Amazon!", "verified": true, "helpfulness": "0/1", "author": "Linda Ferraro"}, {"rating": 5.0, "review": "I am not a tech person but this thing was easy to set up and very easy to use.  When combined with Prime, it offers an amazing selection of movies and other content at no additional cost.", "verified": true, "helpfulness": "0/1", "author": "John"}, {"rating": 5.0, "review": "I love this new Fire TV Stick!  I had been wasting so much time, waiting for the buffering of my Netfix programs to finish.  Now I can watch Netflix, Youtube, HBO Go, and so many other programs, in a way they were meant to be watched, without tons of delays as they were buffering.  This TV Stick is easily worth five times as much!", "verified": true, "helpfulness": "0/1", "author": "Tom"}, {"rating": 5.0, "review": "I have to admit I stream more than I watch straight tv and sometimes you really want to watch something  on the larger tv screen than on your computer or a portable device. I waited on my Fire Stick to come from back order and the wait was well worth it. This was easy to hook up to the tv and is fairly easy to operate. If you stream and have Amazon Prime or Netflix this is for you. It has many other apps as well but those are the 2 main things I use it for.", "verified": true, "helpfulness": "0/1", "author": "Pat the Bookjunky \"Bookjunky\""}, {"rating": 5.0, "review": "Easy to install and works very well - What I would expect from Amazon!", "verified": true, "helpfulness": "0/1", "author": "Robert H. King"}, {"rating": 5.0, "review": "i love my  Fire Stick!! I can watch all my NCIS reruns on Netflix and then go to my Bible shows and Christian movies. I''m actually considering cancelling my Cable TV because I can get everything I want with my Fire Stick. I'm so grateful to my nephew for talking me into getting it. Great idea Amazon!!!", "verified": true, "helpfulness": "0/1", "author": "jane"}]