[{"rating": 2.0, "review": "Picture constantly freezes (not in the tv's refresh rate), the sound does continue however. Easy remote and Android remote use as well.", "verified": true, "helpfulness": "0/0", "author": "Tommy"}, {"rating": 5.0, "review": "Replaced a Google Chromecast.  WAAAAAAAAY better.", "verified": true, "helpfulness": "0/0", "author": "Snowbound"}, {"rating": 3.0, "review": "Although it does what it is supposed to, it is just not as intuitive as my Roku boxes.", "verified": true, "helpfulness": "0/0", "author": "Great One"}, {"rating": 4.0, "review": "I bought two. I had to type my 16-digit Wi-Fi password in 4 times to get it going, it kept crashing during software update. I found that plugging in the AC stopped the crashing. I'm not looking for another thing to plug into an outlet on my wall-mounted TV. So I used it once and it worked, now I get nothing but a black screen on the second time trying to use it. It's not starting up. My second one was supposed to be given away as a gift, now I'm not sure. I hope I just got a bad one, will return. Will update stars if it just happens to be one bad one. I'm using an older Samsung flat-screen TV, maybe 5 years old.Update: When plugged in to AC has worked well for months now. Gave the second one as Christmas gift and works well by USB power. Updated to 4 stars.", "verified": true, "helpfulness": "0/1", "author": "Ed Kayo"}, {"rating": 4.0, "review": "Super easy to setup. Fast. Nice little controller, wish it was glow in the dark.Great for Amazon content. So so Netflix performance.", "verified": true, "helpfulness": "0/0", "author": "GaboPagan \"gabopagan\""}, {"rating": 4.0, "review": "Fantastic device, it works just like chrome cast but you don't need to bother with your phone or tablet.  only draw back is some of the search features are not as easy as using the chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Douglas Brooks"}, {"rating": 5.0, "review": "Love That Fire TV. This one, purchased for the special Prime 2-day price, is for a second TV. Already have one for the main TV and have never had a problem with it, whether streaming content or grandkids playing games. Great products, feature almost all the services I want. Now if only Amazon and Acorn.tv could get together and offer an app for Acorn.tv I would be even happier. For the Stick, only negative was getting the remote open to put the batteries in.", "verified": true, "helpfulness": "0/0", "author": "William Sutton"}, {"rating": 4.0, "review": "The HDMI connector doesn't fit into either HDMI port on my tv and neither does the extension adapter and I have a new one month old Samsung tv. All my other devices slide in and connect effortlessly.Update from my previous one star review.  Quite a bit of pressure I was finally able to get the device to go into my HDMI port. After one night of viewing I can say it's much faster than my apple tv. Picture quality, speed and sound are much better.  The free movie choices are much better than Netflix and more current.  Movies load much faster and are less expensive than from iTunes. The connectivity is good.  I've owned two apple tv''s and found them to slow, frustrating and temperamental ALL the time. The Fire stick provides more options, less aggravation at half the price. It appeared to come pre-loaded and customized to my viewing preferences and knew my name which I found a little unnerving since I've never viewed a movie on Amazon prime before purchasing this device. Besides knowing my name it apparently it knows I'm gay because after the installing the device the Primes free movie selections and suggestions were mostly gay titles.  I guess Amazon knew I was gay before I did. Talk about an intervention with big love....Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "DW. Camp \"dwc\""}, {"rating": 2.0, "review": "Bought this because it seemed like the easiest way top access prime music. Have it plugged into my receiver (like all my devices) and I have to have the tv on to start the music because the app is only directional not mirroring the menus. Turned the tv off and the output stopped. Which also means I won't be able to play or control the music in my second zone which doesn't have a video output. This capability was the only reason I bought it... I can do everything else this does with about 6 different devices I already own.", "verified": true, "helpfulness": "0/0", "author": "SWO"}, {"rating": 5.0, "review": "I have a Fire TV for my living room so I got 2 of these for the bedrooms. They are amazing! For the price, these are real fast and offer a lot of features, apps, and games. What I love most about this is that unlike ChromeCast, Fire TV Stick offers a remote and does not depend on your phone. At the same time you can use your phone as a remote too. It is very well built and hides behind the TV. One of the best products out there for streaming.", "verified": true, "helpfulness": "0/0", "author": "LED Maniac"}]