[{"rating": 4.0, "review": "works just great.", "verified": true, "helpfulness": "0/0", "author": "Roger K. London"}, {"rating": 2.0, "review": "I hate this thing. it has so many problems, sure its more powerful than a chromecast but the apps on it suck. PLEX is crashing a ton  and sometime won't even launch, I bought it for the better wifi, but it doesn't seem to make a big difference.", "verified": true, "helpfulness": "0/0", "author": "Kyle Rooney"}, {"rating": 4.0, "review": "I found it hard to open the remote which is essential to setting up the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "A. BRADLEY \"culture curator\""}, {"rating": 5.0, "review": "Bought this for my parents since they don't have a smart TV and so far they love it. They are not very tech savy, but they can still use this.", "verified": true, "helpfulness": "0/0", "author": "ShopperMe"}, {"rating": 4.0, "review": "I have been using Netflix on my TV via my PS3 for quite some time now and I have to say that, while the interface itself, on-screen, is the same visually, the picture via the Fire TV Stick is much cleaner with less freezing and stutter and quicker load times. Add to that all the other features in the Amazon Fire TV Stick and I am very pleased. I do wish there were more Prime movies and TV Shows for the annual price i am paying, but overall I am still very happy.My only complaint, and the only reason this did not get 5 stars, is that there should be at least the option for a \"universal\" remote available that can work with my TV, DVR, and other devices, as well as the option to connect an external hard drive to the  Fire TV Stick for downloads. I understand the larger, more expensive  Fire TV box has that, but it would be simple enough to include an additional USB or HDMI output to allow connection of ones own backup drive.", "verified": true, "helpfulness": "0/0", "author": "Evilboy"}, {"rating": 5.0, "review": "It is great.been watting for something like this for a while.", "verified": true, "helpfulness": "0/0", "author": "betty anding"}, {"rating": 4.0, "review": "So far, so good. Fire TV stick has its quorts however. In the beginning we noticed a lot of video delay, but that seems to have gotten a lot better and I wonder if Amazon through its updates has been fixing the delay problem?So, it's Fire TV Stick for us now, we've stopped paying for Microsoft Live streaming through the Xbox system", "verified": true, "helpfulness": "0/0", "author": "Edward F. Avila"}, {"rating": 5.0, "review": "It's cool", "verified": true, "helpfulness": "0/0", "author": "Nestor D. Pineda"}, {"rating": 2.0, "review": "So disappointed. The interface is great, if it just worked all the time. I have a friend who has the Fire TV and loves it. He bought two of these when I bought my one, and we are having similar issues. The HDTV that my Fire TV Stick is connected to is less than 10 feet from my wireless router, and it constantly loses connectivity, and/or tells me it is connected with errors. It doesn't matter if I am watching Amazon content, or content through an app such as Netflix. The remote consistently acts goofy, moving 25 items to one direction or another when I just press it once. I know that the Fire TV works, I have seen it, but I am very disappointed with the lack of quality control with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Jason W. Welty \"Jason\""}, {"rating": 4.0, "review": "Have this and the Chromecast connected. Fire Stick gets used more than the Cast. Menu is really easy to navigate. Need the game controller for most games. Easy to connect and watch right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Kevin Dale"}]