[{"rating": 5.0, "review": "We love our Fire TV for our living room, so I got the Fire Stick for the bedroom. The \"tutorial\" was annoying, wish I could have skipped it. Set up after that was fast & easy. We have Prime membership, so we have lots to watch. We have used a Roku stick previously, but the Fire stick has more features (games!)", "verified": true, "helpfulness": "0/0", "author": "Five Cats"}, {"rating": 5.0, "review": "Loving this product to view Prime content and rent movies.", "verified": true, "helpfulness": "0/0", "author": "T. Rodgers"}, {"rating": 4.0, "review": "Works well out of the box, but most Smart TVs these days have everything you can get on this.  Great for streaming movies if you are a prime member, or use the Amazon movie venue.", "verified": true, "helpfulness": "0/0", "author": "Shawn R. Keenen \"Skeenen\""}, {"rating": 5.0, "review": "This is my first ever review I think. We just love it that I have to tell the world!", "verified": true, "helpfulness": "0/0", "author": "with_cute_kids"}, {"rating": 5.0, "review": "Gift hoping ot works well?", "verified": true, "helpfulness": "0/0", "author": "beek"}, {"rating": 5.0, "review": "I love it! Sooo much better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "ellie.mae.sue"}, {"rating": 5.0, "review": "Works great with Amazon Prime. The remote is a real plus.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Junk....marketeers forced it to market way too soon. Won't pick up router without extender, freezes and won't load apps and video. I bought 4 tried two with same results....marketeer driven junk. ...and I am a loyal, but very disappointed, Amazonian.I am updating my review. There is no warning anywhere indicating so, but I had a several year old Belkin router that worked great with everything but the Firestick. I just got the $20 TP Link 300Mbps N Router from Amazon and the Firestick works great. Much better than my several year old Roku. Don't know whether to apologize to Amazon or be pissed because they didn't indicate that my router could be a problem.....", "verified": true, "helpfulness": "2/4", "author": "Anders Tornberg"}, {"rating": 5.0, "review": "Works good easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "sandra stephens"}, {"rating": 2.0, "review": "This device is really disappointing. The UI is nice, the speed between apps is a welcome change to the Roku, but it simply does not work. It buzzes, it stutters, it freezes, it plays the audio with a black screen and it sometimes freezes and won't do anything. I wanted to like it. I wanted to use it, but it is far too frustrating.I spoke with the tech support and they told me to use the HDMI extender which did nothing to help. He also suggested I restart my wifi router. The router sits about a foot from the Fire Stick and has never been a problem with my Chromecast, Roku, TV, Kindle, Nexus 7, phone or the other Roku that is in another room 30 feet away. The only consolation is that I bought it at the intro $19 price. I may hang on to it to see of there is a software update to correct the problems. Until then I will stick with my somewhat clunky but dependable Roku.", "verified": true, "helpfulness": "2/2", "author": "Matt S."}]