[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/1", "author": "Phillip Summers"}, {"rating": 4.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Caleb hendon"}, {"rating": 2.0, "review": "I am having a really hard time getting it to stay connected to the wifi. We have an Apple TV and the fire stick and the Apple TV never has an issue but when I watch Netflix on the fire stick it buffers every minute or so! Very frustrating. I really liked the concept just disappointed in the outcome.", "verified": true, "helpfulness": "0/0", "author": "christen volin"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "D. Silverman \"Big Mamma\""}, {"rating": 5.0, "review": "It works as advertised~", "verified": true, "helpfulness": "0/1", "author": "daun troncin"}, {"rating": 4.0, "review": "Overall really great. The remote is almost too small and too light. It easily slides off the bed or gets lost in the covers. Really like the program though and love how it serves as a central hub for all of my streaming.", "verified": true, "helpfulness": "0/0", "author": "allisonjunehayes"}, {"rating": 5.0, "review": "we love the fire stick! we already watch Prime on our computers, so this lets us go seamlessly to the tv. We haven't even explored all the options on it yet --- I have no doubt it's way better than we know.", "verified": true, "helpfulness": "0/0", "author": "2elles"}, {"rating": 5.0, "review": "Purchased as a gift for my parents who struggle with even the most basic technology.  Once I set this up for them (still extremely simple) they can now use this easily to watch Netflix on their non-smart tv!", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Set up was easy, works well, and there is an app for my phone that makes control very easy, especially for adding user names and passwords.", "verified": true, "helpfulness": "0/0", "author": "Charlie Carpenter \"CD Carpenter\""}, {"rating": 5.0, "review": "I had no problems with this from the start.  It's been amazing.  I would recommend this to anyone!  Love the fact I can use it to watch Netflix also.  Have only had it a short time and now I'm having a hard time turning it off  :-)", "verified": true, "helpfulness": "0/0", "author": "Marlene Znidar"}]