[{"rating": 5.0, "review": "Great interface! Very easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love this gizmo.  Better than Roku or the Google version.  Has all the apps you need and works flawlessly.  Interface is very easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Matt F"}, {"rating": 5.0, "review": "Very easy to install and was ready to go with all of my information.", "verified": true, "helpfulness": "0/0", "author": "Megan P Dyer"}, {"rating": 5.0, "review": "I was amazed how easy it was to set this up.  As simple as plugging the usb into the TV and the power cord into the usb.  That was it!  I turned on the TV and before I knew it I was selecting a show from Amazon Prime with the tiny remote that came with it and watching.  I don't even think it took a full minute between taking it out of the box and sitting down to a great show.", "verified": true, "helpfulness": "0/0", "author": "C. Cook"}, {"rating": 5.0, "review": "Great product.  Installed this on my kid's TV and she loves it.  No loss in picture or sound and the quality of both is really good.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "I love the fire stick.  The remote is handy and being able to run plex and Netflix without changing source on tv is convenient for my last days in bed", "verified": true, "helpfulness": "0/0", "author": "colin"}, {"rating": 5.0, "review": "I had trouble at first navigating with the remote but I think I have gotten better as I keep using it.  I am not good with modern gadgetsI am in my late seventies I great grandchildren can help me.", "verified": true, "helpfulness": "0/0", "author": "BHB"}, {"rating": 5.0, "review": "Great little stick.  Got more power than my Roku stick.  Great for watching Sling TV.", "verified": true, "helpfulness": "0/0", "author": "John Graham"}, {"rating": 4.0, "review": "Great product and easy to use.  It takes up no room, and can be hidden perfectly.  Great job Amazon", "verified": true, "helpfulness": "0/0", "author": "Zombie's are a girls best friend"}, {"rating": 5.0, "review": "Works fine", "verified": true, "helpfulness": "0/0", "author": "Melvin J BARNES"}]