[{"rating": 5.0, "review": "A great way to increase your programming at a cost effective price.", "verified": true, "helpfulness": "0/0", "author": "Jack Alexander"}, {"rating": 5.0, "review": "Just received and very impressed with all that can be done with its use and amazon prime.  So much available without additional expense.  Highly recommend particularly if on a budget.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 4.0, "review": "FireTV Stick has outdone AppleTV on many levels...", "verified": true, "helpfulness": "0/0", "author": "Patrick S. McKoen"}, {"rating": 5.0, "review": "Happy with item", "verified": true, "helpfulness": "0/0", "author": "Francisco J Serna"}, {"rating": 3.0, "review": "The fire stick video can be choppy sometimes. The interface that appears when first turned on is a little confusing, Voice search with the fire HD 6 only searches through amazon's offerings and not netflix or any other apps. I bought this for HBO GO because Comcast won't let HBO GO work with a roku and I was a little disappointed. Hulu plus, Netflix, and youtube all work fine but HBO GO always has choppy video. Not sure if this is HBO GOs fault or the fire stick. Roku 1 box is better I think but for $25 it is okay for maybe a tv not in the living room.", "verified": false, "helpfulness": "2/2", "author": "Kathy Stone"}, {"rating": 5.0, "review": "Arrived on time.  Wouldn't work on our TV downstairs, but I think our CD player is too old, as it worked GREAT in our new upstairs one!", "verified": true, "helpfulness": "0/0", "author": "Mary \"Mary\""}, {"rating": 5.0, "review": "Open the door to TV entertainment!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the fire stick so much to choose from.", "verified": true, "helpfulness": "0/0", "author": "Wildchild"}, {"rating": 1.0, "review": "It would not work in our bedroom because it appears our wifi was not strong enough to load it!!nNot happy!", "verified": true, "helpfulness": "1/2", "author": "ferdie50"}, {"rating": 1.0, "review": "I got this device to replace a Roku and didn't like it at all. I gave it about 2 weeks before just throwing it in a drawer and getting a new Roku. The user interface is horrible if you want to watch anything other than Amazon content. I like to watch Hulu and it was basically impossible with the Fire stick. I couldn't keep my Wi-Fi connection, despite being in the same room as the router, and when it did have a connection the video quality was terrible. These are problems I don't have using a Roku. I love Amazon Prime, but I'll continue to watch using the app for Roku. The Fire stick is garbage.", "verified": true, "helpfulness": "1/2", "author": "CLK_4_Real"}]