[{"rating": 5.0, "review": "Great product to have. Great time with family watching TV. The remote is good to have also.", "verified": true, "helpfulness": "0/0", "author": "gloria hinton"}, {"rating": 5.0, "review": "Bought this along with Fire TV and both are great.  Very Fast", "verified": true, "helpfulness": "0/0", "author": "Bubbles"}, {"rating": 5.0, "review": "Great...", "verified": false, "helpfulness": "0/0", "author": "modesto valle"}, {"rating": 3.0, "review": "Ordered it and returned the same day. The device is snappy and overall is a well made product. The deal-breakers for me were :1. Did not power from my TV's USB plug and kept complaining about insufficient power (I bought a Roku stick finally and it worked fine)2. Plex is paid subscription on the Fire Stick. Roku wins again.", "verified": true, "helpfulness": "0/0", "author": "Nick \"booklover\""}, {"rating": 5.0, "review": "awesome deal", "verified": true, "helpfulness": "0/0", "author": "Wladyslaw Kielebaj"}, {"rating": 5.0, "review": "This is my second one so that I can have one upstairs and in the theater in our basement. We find that it is much better than trying to use Netflix.", "verified": true, "helpfulness": "0/0", "author": "Deborah L. Huffman"}, {"rating": 4.0, "review": "The stick version has a lot of apps, but are a little slow to load. The main reason I got this was to be able to use it on business trips in the hotels. It works well for this purpose, and is the only device that currently has the ability to access hotels WiFi sign on web pages.", "verified": true, "helpfulness": "0/0", "author": "Anthony Strode"}, {"rating": 5.0, "review": "So very happy to get my tv stick!  It hooked up easy to my tv and accessibility was excellent.  My only issue.... no access to my VUDU account...  sooo sad!  Seriously.. I love the ease of access to the movies and applications I love, and the games are amazing.  Thanks Amazon, for a GREAT product!", "verified": true, "helpfulness": "0/0", "author": "Sherrie S"}, {"rating": 5.0, "review": "Great addition to any TV", "verified": true, "helpfulness": "0/0", "author": "Lee E. Bengry"}, {"rating": 4.0, "review": "Nice stable connection. Great quality.", "verified": true, "helpfulness": "0/0", "author": "Jerrelle"}]