[{"rating": 5.0, "review": "NICE", "verified": true, "helpfulness": "0/0", "author": "FOTOMAN"}, {"rating": 5.0, "review": "Very easy to set up and easy to use. So far I am very happy with purchasing and using the Amazon fire stick!", "verified": true, "helpfulness": "0/0", "author": "burke3732"}, {"rating": 4.0, "review": "Great device, I only wish that you could project video from my smartphone like the chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Bruce A Rodgers"}, {"rating": 5.0, "review": "Love this!  We've been using it almost daily!", "verified": true, "helpfulness": "0/0", "author": "Jill Hockema"}, {"rating": 5.0, "review": "Everything we thought it would be.  Love it!", "verified": true, "helpfulness": "0/0", "author": "russell e berggren"}, {"rating": 2.0, "review": "The Fire Stick really isn't that great.  So many issueso,  so little support.  With constant freezes and bugs,  namely  Netflix constantly playing videos in a shrunken preview window with the only remedy of unplugging the unit.  Which in turn you must punch in all of your log in credentials... Makes me want to seek out alternatives.", "verified": true, "helpfulness": "0/0", "author": "Ikenvape"}, {"rating": 5.0, "review": "great, no issues, everything at my fingertips", "verified": true, "helpfulness": "0/0", "author": "D. Derderian"}, {"rating": 3.0, "review": "I love this because I'm a prime member so streaming movies and music is easy and I use those benefits more often.I only gave it three stars because it has a hard time keeping my internet connection and staying up to speed while my Apple TV has no problem.All in all its a good product and worth it if you are a prime member.", "verified": true, "helpfulness": "0/0", "author": "Michelle G."}, {"rating": 1.0, "review": "I must pay additional rates for the on line channel- Is more like a wifi modem than a TV opportunity - Beside since Im located outside US the restrictions are greather.", "verified": true, "helpfulness": "0/0", "author": "Adiv Gonzalez"}, {"rating": 5.0, "review": "Easy install.  So, far works Ok with my fairly slow internet connection.A few more free selections with Prime would be nice.", "verified": true, "helpfulness": "0/0", "author": "Snow country family"}]