[{"rating": 4.0, "review": "Works ok.", "verified": true, "helpfulness": "0/0", "author": "Jeff Davis"}, {"rating": 5.0, "review": "I admit that I only picked this up because it was the single thing I found worth buying during the Prime garage sale, but I couldn't be happier with the purchase. We have both an Apple TV and this device in the household now, and I can definitely say that I completely prefer the Fire TV Stick to the Apple TV. The Fire Stick made setup an absolute breeze (and included a nifty tutorial video to boot), and the interface is very user friendly and easy to navigate while giving me access to all the apps I use on a daily basis like Pandora, Hulu, HBO GO, etc. I also very much prefer the remote to Apple's, and it appears to me at least to respond better to button presses and just generally feel more natural due to it's larger size and more substantial depth. Overall, I'd highly recommend this for any users that aren't already heavily invested in the Apple ecosystem. For the price, this device simply can't be beat!", "verified": true, "helpfulness": "0/0", "author": "Jonathan Walters"}, {"rating": 5.0, "review": "I have a Roku and I love it.  Unfortunately, Roku does not have some of the channels the Fire Stick has (like Starz, etc) so I decided to buy a Fire TV Stick too.  I already ordered another on for my other TV.  I love it.", "verified": true, "helpfulness": "0/0", "author": "VLV"}, {"rating": 5.0, "review": "We went \"TV-less\" about two years ago when we canceled our satellite service.  Unfortunately at that time, it resulted in more investment on our part and we ended up having to get a new Blu-Ray that had internet streaming and when conversions failed, we ended up buying a new TV.  Even though we didn't need it at the time, I ended up buying two Fire TV Sticks when they went on sale to Prime members.  They sat in the boxes for a while but the internet streaming on the Blu-Ray broke, it started refusing to play.  So I dug out one of the sticks and put it in.  We haven't looked back since.  The kids hardly ever even play DVDs anymore, everything is Amazon Prime or Netflix through the Fire Stick.  This thing gets A LOT of use and so far, after about 6 months or so, no problems.  When I do have an issue, it's our internet.  We love this thing.  Even the simple remote is great for the little ones to back up and pause their programs on their own.", "verified": true, "helpfulness": "0/0", "author": "Veep Haim \"makuahine\""}, {"rating": 5.0, "review": "Works just as good as the other 3 I have purchased. They make great gifts.", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 5.0, "review": "I've had a Google Chromecast for several years now and I like it, but it doesn't work great with the DSL we have now (yay for rural life and lack of internet options). I'd heard good things about this and got it for a deal on Prime Day. We are in LOVE with it. I'm seriously considering canceling our cable because this thing works like a dream. No skipping, great picture, tons of options. I'm going to buy one for every TV.", "verified": true, "helpfulness": "0/0", "author": "Cheryl"}, {"rating": 4.0, "review": "Easy to hook up. I had trouble with the power cable/plug at first. The device reported it didn't have enough power to run. I grabbed a Samsung Phone charger (micro USB) and used it and it worked great. Maybe an isolated incident but that was annoying. It does pause/reset the image every so often on Netflix and Amazon Prime TV. I assume it's changing resolution due to connectivity, but it's 30' in direct sight of the wireless router (Comcast at 50 MB/s) an I have click Play on the remote again to continue.", "verified": true, "helpfulness": "0/0", "author": "Adam Howe"}, {"rating": 5.0, "review": "Really easy to set up, takes 2 minutes and you are good to go. I also own a fire tv, so got the stick for a spare room for guests. No complaints and its really easy to use.", "verified": true, "helpfulness": "0/0", "author": "Michael H"}, {"rating": 4.0, "review": "It's nice, I received it as an unexpected gift! I have it on one of my TVs and if I didn't have AppleTV on another TV, I would've gave it five stars!", "verified": true, "helpfulness": "0/0", "author": "Michael P. Collins"}, {"rating": 5.0, "review": "I LOVE my Fire TV Stick!  Buying this was the saving grace of Prime Day for me.  I am seriously considering cancelling my cable because I now have this.", "verified": true, "helpfulness": "0/0", "author": "Hannah Fowler"}]