[{"rating": 4.0, "review": "Love the stick, great alternative to cable when having a Prime membership and a bad-ass internet provider. (Highest plan with the most GB or MLPS) Since Wifi only, it works great in the same room as router, but farther you get, the more buffering and loss of HD you get. Got the Fire TV and hard wired the Internet and had a quality hdmi cable hook up and love it much more! Spend a little extra and get the box!", "verified": true, "helpfulness": "1/1", "author": "K. Curtiss \"Gigantes!\""}, {"rating": 1.0, "review": "I purchased my Amazon fire Stick in February 2015.  I followed the instructions for set up and when I plugged it in to the HDMI port of my Vizio TV the TV shut off.  I attempted to turn my TV back on only to get a blank screen and have it power back off.  I repeated this process with the same result.  I contacted Amazon and was transferred to tech support.  I explained the issue to them.  They concluded the Firestick was defective and offered to send me a new one.  When I asked them what to do about my TV I was told they could not help me with that and I would have to contact my TV's manufacture.  Because I used an Amazon product my TV is no longer working and it appears it will remain that way until I can contact the manufacture for support.  I am disappointed in Amazon for not taking full responsibility.  I will think twice before purchasing their products.Dan C.Auburn, Washington", "verified": true, "helpfulness": "1/2", "author": "Dan C."}, {"rating": 5.0, "review": "This little stick is awesome very happy with it. Bought 2 one for my dad and he cant get enough of it. Good job amazon.", "verified": true, "helpfulness": "0/0", "author": "Axel u torres"}, {"rating": 5.0, "review": "Got this for my four year old mainly to use for netflix. Does more than expected. We are still learning it. I am amazed the remote is a game remote. It's so easy for my kid to use. He loves it. We definitely use the parental locks.", "verified": true, "helpfulness": "0/0", "author": "Michael McCann"}, {"rating": 5.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "Allan Bloczynski"}, {"rating": 5.0, "review": "Easy set up and easy to use. Very much worth the price.", "verified": true, "helpfulness": "0/0", "author": "ladylib"}, {"rating": 3.0, "review": "it would of been better if it wasn't wifi and the ethenal cord plugged into it. ill be watching a show and in the middle of it and it will start searching for the internet connection.  ill have to give it away as a gift to someone.", "verified": true, "helpfulness": "0/0", "author": "maynard w."}, {"rating": 5.0, "review": "I love my fire stick!!!", "verified": true, "helpfulness": "0/0", "author": "rayna simon"}, {"rating": 1.0, "review": "It says it is Miracast certified by it doesn't actually work with windows computers or phones.", "verified": true, "helpfulness": "0/1", "author": "SWM"}, {"rating": 5.0, "review": "I love it! It is a great product, which anyone could expect from Amazon. Great build quality, easy setup and syncing for screen mirroring with other devices (such as my HDX 7\") and beautiful display with almost no lag time what so ever. And at a superb price point. If you are a prime member, I highly recommend this. If you're not a prime member, I recommend you  become one and then buy this. I have 2 newer model Roku boxes and I prefer the Fire TV Stick over either of  them. I've seen some of the reviews say that it's too \"Amazon centric\" but honestly, I disagree. I think Amazon has out done themselves yet again with this amazing streaming device. I am looking into upgrading to the full Amazon fire TV box and game controllers. Admittedly, I am an Amazon devotee in the fact that I own 3 Kindles ( 3G, original Fire and Fire HDX 7\" 2013) as well as the Amazon Echo, Alexa ( which is another product I highly recommend! She is great and my family loves her) and am hoping to convert to the Fire phone soon too! Anyway, if you are a prime member who loves Amazon, loves movies and TV shows, music, and wants to see your cloud photos on your big screen then buy the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Joseph McBride"}]