[{"rating": 2.0, "review": "I was able to configure wireless and then it updated but now TV says unsupported mode.  Not sure why since my TV can support all standard resolutions.  I tried different HDMI ports as well.  For now back to Roku until I have time to troubleshoot further.", "verified": true, "helpfulness": "1/6", "author": "The one who moves around a lot. \"Dan\""}, {"rating": 5.0, "review": "Wow, much better than I expected.  Menus are smooth, and quick, and it is fully featured like any traditional streaming box device.  Also load times are near instantaneous, and there is very little HD buffering (usually only a second or two), much quicker than my old streaming stick.  Plus the fact that it has a remote is great, as my other streaming stick requires me to use my phone, which seems to fail sending commands sometimes, the remote on the Fire TV Stick always works.", "verified": true, "helpfulness": "1/2", "author": "Michael Le Gere"}, {"rating": 1.0, "review": "One star because this device is useless in my case. I was expected something that could stream my PC video, but this piece of junk supports only on my Android phone. I thought this device could replace my Apple TV, but I was wrong. My Apple TV and TV box has similar (TV apps)  that has this stick, so i don't see any other reason to have extra device which have similar apps. I won't recommend to buy this device for those who is looking for PC streaming.", "verified": true, "helpfulness": "2/31", "author": "Firdavs"}, {"rating": 3.0, "review": "When I got it in, I couldn't wait until I got home so I hooked it up to a TV at work. Updates? Ok, lets skip this for now...I can't? Seriously? OK, well, our IT guys throttle Amazon traffic pretty hard but let's try. Fail. Fail. Fail. Well, how about setting my phone up as a mobile hotspot. That's working. What's this text? Data usage? How big what this update? Let's look at my data usage for today. This thing needs a 800+ meg update just to start? How did this not ship with usable software? OK, all up to date, let's kick this pig. Oh a little video....telling me how to do what I just did that let me watch this video in the first place....ok. Well, tv is needed for work, lets unplug it. Wow! This thing is burning up! I could have wrapped cookie dough around it and had a nice crisp cookie shot glass by now!OK, now I'm home and ready to rock. OK, up and running with a better connection, everything is snappy, plex is working well, that was my main goal. But wait, my wife has just gotten XBMC down, do I want to retrain her for plex? Let's see if...yes, xbmc can be side loaded! OK, got that done....where is it...ohh...I have to go to settings, then applications, then all applications and scroll down? Why is this not on the apps screen like it should be? Even my daughter's kindle treats sideloaded apps just like the ones that came off the Amazon store. Man, it's like the 50s in here with this segregation. OK, surely they will fix that eventually. ***Update: Look in review comments for fix!***How about a game before I head to bed? Oooo, Zen Pinball! Installed fast, started up a little slow but ok, plink, plink, plink, mash the right half of the circle..ball falls between the flippers...right flipper moves...huh, lets try that again. Same thing. OK, I know this is a media stick with games tacked on but man, at least a half a second of lag? Wireless keyboards and mice had a bad rep with gamers for years over milli-seconds.So yeah, it's nice but there are some pretty glaring issues. The sideloaded apps can be fixed with an update, maybe the controller lag (that could have even just been that game) but the over heating worries me. The heat could actually be a software issue, or maybe our office tv has the problem, please don't let it be a hardware issue. I hope so because with a little work this could be a really awesome device.", "verified": true, "helpfulness": "3/9", "author": "C. S. Moore"}, {"rating": 4.0, "review": "For $19.00 (Early Adopter Prime member OFFER) whats not to like. Use it for Amazon Prime Videos and Twitch only.. Set-up was easy as pie. Only gripe is, wish there's a in-app (ie.. Twitch.tv search function) for streams i follow... as i don't really enjoy scrolling to hundreds of game streams to find what i want. Apart from that i'm still pleased with my purchase.@Amazon Fire TV Devs.. Please add a Twitch.tv in-app search function in the next twitch app update.All in All it does what i want for a fraction of the price compared to other streaming device(s).", "verified": true, "helpfulness": "0/1", "author": "rodney® \"r0dn3y\""}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Amazon Fire stick is a must-have for Amazon Prime members that do not have a Smart TV or existing streaming device for their TV (Apple TV, Roku). It allows you to stream all of the free Amazon Prime content (if you're a subscriber) plus you can connect your Netflix, Hulu Plus and other streaming devices. Although, you'll get the most bang-for-your <$50 buck if you are an Amazon Prime member. Not only can you stream movies, but you can use their Prime Music and Photo storage services. If you didn't know, Amazon Prime members have unlimited photo backup to the Amazon cloud from their phones/tablets/computers with the Amazon Cloud App, so you can backup all of your photos and save room on your local device if you need to perform a 4.0 GB update (cough... iOS).Included in the box with the Stick and remote are a HDMI adaptor and a USB charging cable.The HDMI adapter is nice if you have a wall-mount that doesn't allow you to just stick the Fire TV Stick directly into the HDMI port on the TV or if the HDMI ports are close together and plugging in the stick will prevent you from keeping something else plugged in. The fact that it comes included is a HUGE bonus.The USB charging cable makes this device more reliable. Here's why. If you just have this plugged into the HDMI port on the TV, it is only powered when the TV is on. That means that every time you turn on your TV, you'll have to wait for initialization and any update time required. Keeping this plugged into a power source allows the device to perform the updates and stay connected when the TV is off. It's recommended and does add an extra cable to the setup, but if you can spare that, then it's worth it.SetupSo, Amazon definitely did something right here... Amazon already registers the device they send you with your account. That means, there's no additional setup required to link it to your Amazon account. Very clever and convenient.The features seem nice and this is a great entry or add-on for any TV needing to be upgraded to include streaming content. Of course, it will still not compare to the stand-alone boxes like the Amazon Fire, Roku 3, and Apple TV, but this is designed to compete against other sticks, which it does nicely. It's also less than half the price of those other devices. I would highly recommend this device for people that occasionally stream or want to add streaming capabilities to a secondary television.Personally, I have the Roku 3,  Apple TV and now this Fire TV Stick. My favorite device is still the Roku as it offers the most seamless content. The Apple TV is great if you have a lot of devices in the Apple Eco-system (iPhone, iPad, iMac, MacBook) as it is able to project content from the TV, play your iTunes music and stream your photos and videos stored in the iCloud. The Amazon Fire TV Stick is similar as it integrates all of your Amazon content for your TV. The Fire TV stick is an affordable gateway to the Amazon content you've already paid for.", "verified": true, "helpfulness": "0/1", "author": "R. Weiland \"bx01z\""}, {"rating": 4.0, "review": "I've had experience running media devices like the Roku 2 XD, WDTV, Samsung TV Apps, most of the game consoles, and Chromecast (mostly for sending videos from my phone to screen). All of these products have had their pros and cons whether it's limited in function or slow. I did not have a Chromecast in my room but wanted a device I could use to send a YouTube video I'm watching from my phone to the screen for others to see as the TV in my room is unable to do that like our living room Samsung does natively. Instead of buying another Chromecast, I wanted to jump on the Fire TV Stick to try something new.Compared to the Roku 2 XD, movement through the menus is much smoother and faster. The small remote is nice and simple. It doesn't feel cheap. A gripe I had with my Roku was that it never played the next episode in a TV series. The Fire TV Stick does so that was a big convenience plus for me. Fast forwarding and time seek were pretty smooth and fast too with a good internet connection. It does the same thing my Roku does for media streaming from Netflix, etc but the \"quality of life\"  in interacting with the product feels better.Where I was frustrated the most last night working with the Fire TV Stick was getting a video file or YouTube clip I was playing on my phone to be sent to the Fire TV Stick. It's possible that I may be spoiled from my Samsung Smart TV and Chromecast's functionality regarding this. I use my Galaxy S4 to watch/send YouTube videos to those two devices all the time and it's pretty simple. The TV is the best when I can just send whatever YouTube video I'm watching straight to the screen from my phone by just pressing the transmit button. There's no need to do anything on the TV. It's automatic (it will interrupt whatever you're currently watching which is fine with me). Last night, when I tried to do the same for the Fire TV stick, my phone's YouTube app could not pick up the Fire TV Stick as a device to send the video to while it did pick up the other devices in the house. It was a bummer because it was a feature I really wanted to work seamlessly when I purchased this. I didn't give up however and looked for a YouTube app on the Fire TV Stick. I found it, installed it (think it should have been pre-installed IMO), and had to pair my phone to the Fire TV Stick's YouTube app. I was now able to watch YouTube videos on my Fire TV Stick from what I was selecting from my phone. The Fire TV Stick's app accesses the video from it's YouTube app and plays the quality well, however, I was experiencing some stuttering every now and then on a 4-5 minute music video I was watching for YouTube sent from the phone. I have a good internet connection, so it might be from the Fire TV Stick. The only other negative was I could not start sending YouTube videos from my phone to the Fire TV Stick unless I opened the YouTube app. That meant extra steps.The other frustrating thing I had with the Fire TV Stick was just sending a tv show video file I had on my phone to it. The video player app on my phone has the transmit button and when I pressed it, the Fire TV Stick wasn't listed (while other devices showed up) just like what happened when I tried it for the YouTube app from my phone. This was disappointing as I could send these things easily without any configuration to my smart TV. I figured it's just app compatibility since YouTube was needed on both devices to sync whats playing. I then looked into the screen mirroring function to see if I can get it done. After looking through the settings I was able to find in the Display Settings and option to enable screen mirroring. I enabled it and it gave a notice that I could connect a device for screen mirroring. I went through my phones screen mirroring and connected to the Fire TV Stick. It worked. I was able to watch my video on the Fire TV Stick, however, I can't tell if it was from my phone or the Fire TV Stick (need to do more tests) but the video would stutter/freeze every now and then during the video which was an hour. My biggest gripe with this was having to go through Settings > Display > Enable screen mirroring. I wish it was a more seamless process.I will still need more time with this device as I only had a good 3-4 hours with it. With all the media player devices out there I was hoping to find a really good do-it-all (which doesn't seem to be possible and I've accepted that). This Fire TV Stick performs well and does pretty much nothing new from what's out there. So does it do everything better? Not really, but it has speed over my old Roku, a remote, and access to Amazon Instant Video (Chromecast). The transmitting from my phone to the Fire TV Stick was a letdown. The functionality is there but the execution left a lot to be desired from me especially when my Samsung Smart TV and the Chromecast does it effortlessly and seamlessly. What I liked with those two devices is the sense of Standby. We're so bombarded with things and stuff moves fast so it's nice to have those little things just work so you don't have to add a step. I know it's a little step, but when you don't have to think about it, it is nice. That's something I felt was missing from the Fire TV Stick regarding the interaction with my phone. The sense of doing things more seamlessly.Would I recommend this to someone? If you got it at $20, it's a steal. At $40, I would only recommend it over Chromecast to a person if they had to watch their Amazon Instant Video. If they improved the casting functionality and maybe tweaked things for performance on some playback issues I saw, I would no doubt recommend it as the best all around device available right now. As of launch, I do not believe it is which is why I cannot give it a full 5 stars.Update: So I had time to mess with it after initially trying it the other night. The YouTube does start automatically when I connect to it now. Which is good and what I wanted. However, when I stop/disconnect the connection from my phone, it doesn't resume what I was doing earlier or just stop it in general. So halfway there.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Makes your old HDMI equipped TV a \"Smart TV\" in one easy step.  We have an old Sony HDTV on our bedroom that we used the Fire TV stick on to add Amazon Prime streaming, Netflix and Hulu too.  It works perfectly out of the box.The Amazon packaging was frustration free, and Apple-like in its clean, well thought-out approach.  The printed instructions are minimalistic, but more than enough to get the Lego-level simple assembly (snap three things together, and away you go) done.  The online instructions and help are extensive.  The introduction video walks you through everything you need to know.WiFi set-up went quickly, and the stick was able to use my faster wireless network.  HD video streamed without issue from Amazon, Hulu and Netflix for me.  The provided remote did everything I needed, so the optional voice remote is not something I think will be necessary for most users.  I will download the free iOS app just to play with it when released.  Fire and Android phone users can download it now.Overall, the Fire TV exceeded my expectations, especially for the Amazon Prime price it was offered at.  Highly recommended.", "verified": true, "helpfulness": "1/2", "author": "Eric L. Fletcher"}, {"rating": 5.0, "review": "This has so far worked very well for me. The set up was really slow downloading the software update and took me three resets to get it going, but I figure it's because EVERYBODY else was doing the same thing at the same time yesterday since it was the first day for the device to arrive. I imagine if you order it later on you'll have no issues. I kind of blindly ordered this very early on the 27th when I saw the ad because I wanted to be able to actually watch the Prime movies on my tv and thought for $19 I'd give it a shot. So after set up I watched a movie last night and was quite pleased, worked smoothly and easily for me, quality a little less than with my dish but nothing to complain about. I have an issue in the winter that I lose my reception on my dish under mounds of snow I can't clean off, I am happy to have an alternative now.", "verified": true, "helpfulness": "1/2", "author": "BoulderCo"}]