[{"rating": 5.0, "review": "Easier to install and use than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Norris"}, {"rating": 5.0, "review": "Works as promised. Love that we can easily have wireless tv on our deck.", "verified": true, "helpfulness": "0/0", "author": "Inky"}, {"rating": 1.0, "review": "Right now i'm pretty frustrated because I can't get Netflix to work. I watched one movie from Amazon Prime and then it shut down.", "verified": true, "helpfulness": "0/0", "author": "Craig Jones"}, {"rating": 5.0, "review": "I love this little unit!  It arrived quickly and is a GREAT to use with an older \"not Smart\" tv.  The set-up was super simple and once you pair it with your wi-fi device, it streams Amazon Prime, Netflix and many other channels flawlessly on your tv. It is important to have an available plug outlet nearby though.  I love that it is portable and EASY to install on other devices...therefore I am able to take it back and forth to our beach house and am always able to \"stream\" my shows!  An added bonus is the remote which is SO easy to use!  This unit seemed faster and easier to set-up than our older Roku streaming device.  I am very happy with my new Fire Stick; the price is very reasonable and would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Murphandaly"}, {"rating": 2.0, "review": "Worked well for a while, however Netflix stopped working. It seems a lot of customers are having the same problem as tons of reviews state the exact same problem I am having - App gets upgraded and it stops working. Most of them say they're glad their Apple TV is working.. same here!!", "verified": true, "helpfulness": "0/0", "author": "Carlos Eduardo Nuñez"}, {"rating": 5.0, "review": "Simply amazing, I've been using it and still learning what to do with it. You can add the apps you want, but it's trial and error.", "verified": true, "helpfulness": "0/0", "author": "Efren A."}, {"rating": 5.0, "review": "This is great. No more paying for cable boxes for other rooms in the house.", "verified": true, "helpfulness": "0/0", "author": "cassie"}, {"rating": 5.0, "review": "Works great . Thanks .", "verified": true, "helpfulness": "0/0", "author": "Ely Rivara"}, {"rating": 4.0, "review": "Works as advertised.  Excellent picture, and offerings", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Works as described.  It has a bit of a freeze up issue on occasion, but over all works well.  I can download all of my usual apps, and it comes with a lot of pre loaded apps.  The remote is small, and user friendly.  I took off one star for the freeze up issues.", "verified": true, "helpfulness": "0/0", "author": "glenndon"}]