[{"rating": 2.0, "review": "none of the apps work like netflix or prime. Everytime, i tired to play video, it says content disabled. I know that i did not put it on parental control. I tried to reset it like 3 times.", "verified": false, "helpfulness": "1/1", "author": "Mamduda Rijuana"}, {"rating": 4.0, "review": "The Fire Stick works great, the only thing I had a problem getting it to work with my TV. Just because your TV has a HDMI port doesn't mean it's compatible. My TV was over five years old so I had to purchase a new one. It would be very beneficial if this info was included in the product description", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Yeah...so firestick - like the idea, but basically Netflix does not work on it. You can connect to prime (in low def), but netflix not at all. sucks. We're on xfinity and on the same WiFi streaming to a PC is no problem...but firestick  - no workie.", "verified": false, "helpfulness": "2/2", "author": "Jeff Mathers"}, {"rating": 5.0, "review": "I did not know what to expect and was very pleased with the apps to services we already subscribe to.  It works brilliantly.", "verified": true, "helpfulness": "0/0", "author": "Larry B"}, {"rating": 5.0, "review": "Best alternative to a Smart TV", "verified": true, "helpfulness": "0/0", "author": "L.S. \"Tineka99\""}, {"rating": 3.0, "review": "Good but it is rather item for someone who is good at computer or electronic devices. Not for normal person.", "verified": true, "helpfulness": "0/0", "author": "khd"}, {"rating": 1.0, "review": "First stick was easy to set up and worked so so for a few days with WiFi connections becoming progressively worse until it would no longer connect.  Amazon tech replaced it after ascertaining I had done all the trouble shooting recommendations to no avail.  Received a replacement stick and it also had WiFi issues out of the box.  I put my old RokuLT back on and it works fine.  I moved the stick to a tv next to the router and it is useable but still buffers frequently where the old Roku had no problem and occasionally disconnects.  Very disappointed as I have a Fire TV on my main TV and love it.  We have kindle 3 different Fires and all are great products but the Fire TV stick just sucks; can't believe they are selling this with these problems.", "verified": true, "helpfulness": "1/1", "author": "J. Anderson"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Roz \"rosalind allen\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 5.0, "review": "Easy setup, works flawlessly. Some third party apps freeze (NFL) but the rest are great.  I didn't want to wait for amazon to have this hot selling item back in stock so I paid 60 on eBay.", "verified": true, "helpfulness": "0/0", "author": "kammi"}]