[{"rating": 5.0, "review": "Works great. Its just what I was looking for, and does what I wanted it for.", "verified": true, "helpfulness": "0/0", "author": "christian jones"}, {"rating": 5.0, "review": "We have the fire stick and 2 rokus. We now prefer the fire stick. Great integration with the kindle and nice interface.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 4.0, "review": "Works great to turn a basic TV into a quasi smart one. Interface and remote are good.You have to push a button on the remote to wake it up when you shift sources (TV to HDMI where it is plugged in) otherwise you just get a black screen on your tv.I didn't do my research well enough and didn't realize you need the box type Fire TV to play most of the better games so make sure this unit is what you want.My units software doesn't recognize that it is plugged into the wall so says it reduces it's functionality as if it was plugged into the USB port for power but I haven't noticed anything so no big deal.", "verified": true, "helpfulness": "0/0", "author": "Dave G"}, {"rating": 5.0, "review": "Good!Thank you!", "verified": true, "helpfulness": "0/0", "author": "Valeriy Mekhanik"}, {"rating": 5.0, "review": "Good deal, easy to install and use.  Especially like the freebies with prime", "verified": true, "helpfulness": "0/0", "author": "Richard S."}, {"rating": 5.0, "review": "Works great very happy", "verified": true, "helpfulness": "0/0", "author": "william s"}, {"rating": 5.0, "review": "Love it, only thing missing is the nfl sunday ticket app, otherwise its great!", "verified": true, "helpfulness": "0/0", "author": "MattyHeff \"Matty\""}, {"rating": 3.0, "review": "I like the firetv but not the remote. The remote worked 1 day, new batteries, 1 day and so on. Now i have to use my phoneapp, but sometimes my phone is on another wifi, and then it does not work.", "verified": true, "helpfulness": "0/0", "author": "Maria van Daalen"}, {"rating": 5.0, "review": "Finally we don't have to drag the xbox up and downstairs to watch Netflix. This plugs into the USB port of your tv and is ready to go in literally less than 5 minutes. We are now able to watch Netflix, HBO Go, and play games. I can't believe I didn't get this when it first came out. (One thing, you cannot play things from your computer like you can with ChromeCast.)", "verified": true, "helpfulness": "0/0", "author": "Kymbal Roley"}, {"rating": 5.0, "review": "Fantastic device!", "verified": true, "helpfulness": "0/0", "author": "Jen R."}]