[{"rating": 4.0, "review": "Works great. Got it free with 3 months of sling TV.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "I've only used it for a week but I love it. Makes prime video easy to watch. Only downside is does not have a Google play app.", "verified": true, "helpfulness": "0/0", "author": "lin2261"}, {"rating": 4.0, "review": "Works great. Not at many free movies as I thought", "verified": true, "helpfulness": "0/0", "author": "daniel vogel"}, {"rating": 3.0, "review": "It works perfectly for what it was designed to do. However, I thought it might have more of the features found in Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Tahri Molifua"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "GILLIE"}, {"rating": 4.0, "review": "Thanks to the Phone support group, I was able to get my Netflix account to work with your device !", "verified": true, "helpfulness": "0/0", "author": "Marsha Jacklitsch"}, {"rating": 1.0, "review": "Constant buffering makes it difficult to use. I have 2 and both buffer excessively.", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 5.0, "review": "I bought 4 Fire TV Sticks to cut the cable and save over  $100 per month.  The Fire TV Sticks  couldn't have been easier to install and use.  I signed up for Netflix and Sling TV, and we haven't missed any of the junk programming you pay for on cable, but never watch.  With a Fire stick on each TV,  I can go from room to room and pick up where I left off on a program.  I am very pleased with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If you have 5ghz then this will get a better signal than a chromecast, otherwise they are both very similar and it is a toss up on which is actually easier.  If you use Prime and/or want the remote, then this is probably better.  I find chromecast to be easier to use for non-prime apps as the apps are on your phone and tablet.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 4.0, "review": "Love it. Couldn't have been easier to set up. Don't like I wasn't aware that it needs to be plugged in at all times but I think that was almost foolishness on my part. Duh how does it get power? Strongly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Ryan luedtke"}]