[{"rating": 5.0, "review": "I luv it. I was gonna go with the Chromecast but this one had more options such as the remote. It also has the option like the Chromecast to control and mirror as well.  The 5.1 audio option which the other sticks do not have was a big buying point. All in all alotta bang for $39 bucks.", "verified": true, "helpfulness": "0/0", "author": "William McDonough \"billman1205\""}, {"rating": 5.0, "review": "Works great just like advertisedEasy to install and directions were great", "verified": true, "helpfulness": "0/0", "author": "Blomdahl Donald L \"Don Blomdahl\""}, {"rating": 1.0, "review": "Don't waste your money.  Out of the box everything ran smooth in the setup, but once we tried to actually play a video it would not work. Fought with it for over an hour and would never load and play anything. So we boxed it up and sent it back.", "verified": true, "helpfulness": "1/1", "author": "cdmom2004"}, {"rating": 5.0, "review": "use it all the time.  I wish you could just select prime free only.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This has virtually replaced my Roku and my ChromeCast.  My only complaint with this is the reason it can't fully replace those devices yet.  Amazon allows for Netflix and Hulu, which is great, but they don't allow for other competing products.  I have movies I've bought in TargetTicket, VUDU (because of buying DVDs at WalMart) and freebies from Google Play Movies, but none of these apps are available on the FireTV platform.  If I could access all of my media, then it's be 4+ stars, but the walled garden/no competitors thing is a big drag.", "verified": true, "helpfulness": "0/0", "author": "Michael H \"Father, Cook, Retailer\""}, {"rating": 5.0, "review": "Good price.  Good quality.  Good service.", "verified": false, "helpfulness": "0/0", "author": "John Nanni"}, {"rating": 5.0, "review": "Absolutely love it", "verified": true, "helpfulness": "0/0", "author": "Amanda Daigle"}, {"rating": 5.0, "review": "Great. Good price.thanks", "verified": true, "helpfulness": "0/0", "author": "Lawrence J."}, {"rating": 4.0, "review": "The amazon fire stick was easy to set up and easy to use. Very seldom do i have problems with bufferg.", "verified": true, "helpfulness": "0/0", "author": "Richard Clegg"}, {"rating": 5.0, "review": "The Amazon Fire Stick is better than I could have ever hoped. I had been trying to talk my wife into a streaming device for the last couple of years and she finally relented. I also purchased Amazon Prime and now we watch great movies almost every night instead of reruns on network television and my wife loves it.", "verified": true, "helpfulness": "0/0", "author": "B. Entrekin"}]