[{"rating": 5.0, "review": "I like the features.  Easy to set up an use.", "verified": true, "helpfulness": "0/0", "author": "heather"}, {"rating": 1.0, "review": "I will not but a fire stick because the monthly cost is not mentioned.", "verified": false, "helpfulness": "3/8", "author": "Jim Watts"}, {"rating": 4.0, "review": "I like firetv but is only english.", "verified": true, "helpfulness": "1/1", "author": "Eduardo Hernández"}, {"rating": 5.0, "review": "Absolutely wonderful.  I have this on my second TV the first TV has smarthub that will access Amazon, Netflix, Web, etc. and the Fire stick is MUCH faster, the picture quality is great and the setup is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It keeps loosing the wifi signal upon startup.  I have to reconnect every time.  I have a Roku, Apple TV, and a Smart Tv.  None of these have the problem.  Also, it will not work with my Harmony IR remote.  Plex is charging a $4.99 fee to use there app.  Roku does not.  I will keep it for traveling, but will not be using it in my home.", "verified": true, "helpfulness": "0/0", "author": "K. Sheehan"}, {"rating": 5.0, "review": "I love my Fire TV Stick. I am so happy we got one. It is easy to use and easy to set up. I have a 4 year old and a 7 year old and both of them use it and love it.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Gibson \"Elizabeth Gomez\""}, {"rating": 1.0, "review": "Got really disappointed when noticed the device does not allow the network connection DNS to be configured. I hope they add this feature to this unit soon.", "verified": true, "helpfulness": "0/1", "author": "Nariman"}, {"rating": 1.0, "review": "I will be returning mine.I am one to give products the benefit of the doubt.  I do not have expectations other than what they are described as being capable of doing.  While the Netflix and Hulu apps run alright, the live streaming apps (WatchESPN) are junk.  I have 50 Mbps internet and never have interruptions when I run WatchESPN through my Chromecast but with the Fire TV stick it is constantly losing connection.  I re-started my router and modem 10 times, made sure I had the latest firmware, and did my best to give this a chance, but it keeps cutting out every 20-30 seconds.Needless to say, I am back to streaming from the laptop through my Chromecast.  I am extremely disappointed.  If all you want is to run paid subscriptions on your TV, this works OK, but I would get a Chromecast and run it through a laptop instead.", "verified": true, "helpfulness": "0/3", "author": "Steve Anderson"}, {"rating": 5.0, "review": "It fir d", "verified": true, "helpfulness": "1/1", "author": "Rusty B \"Rusty\""}, {"rating": 4.0, "review": "I have not had tv for 15 years (there's never anything good on!), but it has gotten to be a hassle to stream everything from my Mac.  So got a little flat screen and the fire stick.  Has been great, not much hassle to connect (have all those passwords ready, including my 20 character modem password).  Haven't gotten Amazon Prime yet, I use Netflix and Hulu, but plan to get Prime.  Remote control easy to use... haven't found how to 'search' on Netflix yet, but over all... very cool.", "verified": true, "helpfulness": "0/0", "author": "Michelle Young"}]