[{"rating": 5.0, "review": "Excellent for viewing prime video", "verified": true, "helpfulness": "0/0", "author": "Macro"}, {"rating": 5.0, "review": "great product I personally like it over chromecast", "verified": true, "helpfulness": "0/0", "author": "Yulson Tsai"}, {"rating": 5.0, "review": "Awesome interface finally allows me to comprehensively access amazon prime and VOD and netflix.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 4.0, "review": "The best purchase of 2014!", "verified": true, "helpfulness": "0/0", "author": "elena"}, {"rating": 5.0, "review": "Love this product. Just hooked it up to the back of the tv and away I went. It is wonderful to be able to connect to movies, apps, games, even photos right on my tv.  The remote is easy to use and the layout on the screen is fool proof.  Enjoy this product because it does not take up a lot of space and it is easily moved to any tv in the house with an hdmi port.  Thank you Amazin!", "verified": true, "helpfulness": "0/0", "author": "Gavin Finefield"}, {"rating": 5.0, "review": "Really works well. Ideal for watching Prime movies and programs.  love it!", "verified": true, "helpfulness": "0/0", "author": "Jose E. Nanin \"drjnanin\""}, {"rating": 5.0, "review": "Great device for the money.  Easy to set-up and works very well.  But to really enjoy it, you should be a \"prime member.\"  We are so it meets our needs just fine.  If you have an older tv that has an hdmi port, It is a great and economical way to add streaming convenience without having to purchase a new television.", "verified": true, "helpfulness": "0/0", "author": "Smchanan \"Mochan01\""}, {"rating": 5.0, "review": "I was fortunate enough to catch this when it was announced, for $19. This is easily one of the best Amazon purchases I have made. The firestick was ready right out of the box; I plugged it in, connected it to wifi, and now I'm watching Netflix. No wonder smart TV prices are dropping, they are essentially useless.", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 4.0, "review": "Good Product. Could have been awesome, but Amazon forgot to add Volume Control in the remote. :(", "verified": true, "helpfulness": "0/0", "author": "Harshal Indane"}, {"rating": 5.0, "review": "My Firestick is so easy to use. I love it.", "verified": true, "helpfulness": "0/0", "author": "Ellissa Geary"}]