[{"rating": 5.0, "review": "I had a couple chromecasts and then got the fire tv stick, I love this thing, gave my chromecasts away. I mainly got it for the sling player function, but I love all the extras.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's amazing was is packed in such a small object", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"bookworm\""}, {"rating": 5.0, "review": "Works really great. I am still exploring what it has to offer. So far it is great!", "verified": true, "helpfulness": "0/0", "author": "Linda A. Hill"}, {"rating": 5.0, "review": "Absolutely awesome! Kids love the games, great Amazon exclusive shows, and such a reasonable price. Way better than Netflix!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"lactau\""}, {"rating": 4.0, "review": "The Fire Stick itself was easy to install, and works perfectly with the remote. The only reason I didn't give it 5 stars is because Netflix doesn't have the full seasons of Longmire. They are in production on Netflix for a new season, so you would think they would want to gain more viewers by having last year's episodes online.", "verified": true, "helpfulness": "0/0", "author": "Kym Hansen \"yumi\""}, {"rating": 5.0, "review": "Great HD tv streaming easy to use Netflix, Hulu, Amazon prime or other streaming services from the Fire Stick. Everything is at your fingertips with the included remote control. Much better picture than using the Wii for Netflix.Highly recommended and very satisfied with my purchase.", "verified": true, "helpfulness": "0/0", "author": "T. Pell"}, {"rating": 5.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 4.0, "review": "Most of the negative reviews I have seen are people that are angry about some functionality that they expected to exist that doesn't (ex. Someone gave Fire TV a 1 star because they weren't happy with the sling TV app) or what sounds to be user error.The fire stick is great.  I've had it for many months now and the family loves it.  I'd recommend, if you get it, that you have at least 2 services to streams.  Amazon prime and Netflix, for example.  Prime and Hulu.  Otherwise, you may be displeased with lack of choices.The device itself is fast, responsive, intuitive.  You can download a fire TV app for IOS and android devices that allows you to do voice search.  You can let pandora stream in the background while you have photos streaming on screen with no performance issues.  For the price, the device works great.  I'd give a 5 star rating if Amazon simply made the remote a fully functional game controller as well.  There's little reason why the couldn't do this other than to make you purchase another device (which arguably makes revenue sense). That said myself, nor anyone in my family, is going to buy the separate game controller.  As a result, we are not going to purchase any games that require the controller.  For us, if the remote doubled as a fully functional game controller, Amazon would be making more money off us.  Don't misunderstand me, there are games that can be played with the standard remote, they are limited however.  Some games can only be played with the designated game controller.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Jim\""}, {"rating": 5.0, "review": "I love this device,  so many apps and entertainment locked up in a little stick, definitely recomendamos this device from low cost entertainment", "verified": true, "helpfulness": "0/0", "author": "Rev Rock"}, {"rating": 5.0, "review": "Great to watch movies.....good selection, we really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Karen Schlegelmilch"}]