[{"rating": 2.0, "review": "I really wanted to like this product.  The idea of it is really great but unfortunately it just doesn't work.  If the TV you are putting this on is not very close to your WIFI source you will be very disappointed.  I have a small house and my modem is downstairs.  I wanted to use this on my upstairs bedroom TV so I could watch Netflix and Amazon Prime, etc.  It installed easily but the reception was terrible.  Constant buffering and dropping of signal would occur.  Couldn't even watch one half hour episode of The Office without it stopping dozens of times.  And this bedroom is almost directly above where the modem is on the floor below.  So I cannot recommend this product.  If they can come up with a better receiver on the stick itself, then I will give it a try again.  Otherwise I'll have to try one of the competing products.", "verified": true, "helpfulness": "2/2", "author": "B.T."}, {"rating": 5.0, "review": "This is a great gadget.  The remote works great and the device is easy to use.  Thank you!", "verified": true, "helpfulness": "0/0", "author": "Cynthia Rankin"}, {"rating": 5.0, "review": "Love it! Saves a lot of money not buying a blu ray player and dvd player. Watch movies, shows, videos, and play games all on a hdmi stick", "verified": true, "helpfulness": "0/0", "author": "Rod Morgan"}, {"rating": 5.0, "review": "Love it!  So much better than any of the other sticks out there.  You dont have to sling etc.  Everything is right there.  You can even use your phone as a remote instead of the remote that comes with it ( which is much easier because you can speak to the phone app and it brings up what you want!", "verified": true, "helpfulness": "0/0", "author": "vickie judkins"}, {"rating": 5.0, "review": "Love it, there is a lot to choose from if you have Amazon Prime along with the Fire TV stick.  Many movies, TV shows, games and music to select.", "verified": true, "helpfulness": "0/0", "author": "Donna C. Howell"}, {"rating": 4.0, "review": "Very convenient.  But I can use my phone instead.  Save the cost.", "verified": true, "helpfulness": "0/0", "author": "Angie Neely Penn"}, {"rating": 4.0, "review": "complicated to purchase movies, even when having a prime account.", "verified": true, "helpfulness": "0/0", "author": "stefany"}, {"rating": 4.0, "review": "wish the mirror option for the iPhone was available. like make a legit app that works with mirroring iPhone to the tv screen.", "verified": true, "helpfulness": "0/0", "author": "Elliott L."}, {"rating": 5.0, "review": "This was the single best purchase I made this year.  I can't believe all the entertainment that I was missing.", "verified": true, "helpfulness": "0/0", "author": "Language Teacher"}, {"rating": 4.0, "review": "The easiest and most inexpensive way to make any TV a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]