[{"rating": 5.0, "review": "Works great. Replacing the Apple TV!! Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"justmacman\""}, {"rating": 4.0, "review": "So far I'm enjoying my fire stick and prime membership. It's really pretty cool how you can access lots of movies right on your Kindle or choose TV.", "verified": true, "helpfulness": "0/0", "author": "Doris"}, {"rating": 5.0, "review": "I love the fire stick.  I have it set up in my office and use the music aps (Pandora and Iheart) all the time.  I am also rediscovering all my favorite shows.  Once I got the fire stick set up, I have ever had to reset it or do anything again to make it work.  I only wish I had purchased it when it first came out at $19!", "verified": true, "helpfulness": "0/0", "author": "Tracy Devine \"crochet godess\""}, {"rating": 5.0, "review": "Works as advertised, which is unusual these days.  Very easy setup. I am actually very pleasantly surprised!", "verified": true, "helpfulness": "0/0", "author": "Jeffery A Toth"}, {"rating": 5.0, "review": "Goood!!", "verified": true, "helpfulness": "0/0", "author": "Joonwoo Oh"}, {"rating": 5.0, "review": "I'm so loving it better than expected", "verified": true, "helpfulness": "0/0", "author": "sharon"}, {"rating": 5.0, "review": "Fire Stick was so easy to setup.  The app worked on the first try.  I almost like it better than Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Ant"}, {"rating": 5.0, "review": "Easy to set up on TV with a great remote. I just set it up today and have not seen any TV with it yet, but I will start using it tonight. The battery compartment was a little difficult to open to insert the batteries.Looks like a great bunch of apps on it.", "verified": true, "helpfulness": "0/0", "author": "James H Kilburn"}, {"rating": 4.0, "review": "It does what is supposed to do. It works fine .It could do more  at supporting more app from android store .", "verified": true, "helpfulness": "0/0", "author": "hectorite"}, {"rating": 4.0, "review": "The Fire stick did setup easily. It has several apps and you can watch the Amazon prime videos as promised. This is why I ordered it. But you need a subscription for some apps like Netflix or Hulu plus. I gave it a four stars due to the menu is hard to get thru to find what you want quickly. The app for your phone is worth downloading to speak what you want to watch quickly. I am looking forward to use this when we go on vacation.", "verified": true, "helpfulness": "0/0", "author": "Mommadamiri"}]