[{"rating": 5.0, "review": "I love that I pluged it in and it was ready to go. It knew who I was and the quick tutorial was very helpful, and before it was over I had already downloaded the remote app for my phone that is awesome. the app lets you use the keyboard to type in passwords and emails... no more on screen jumping around and I have access to all my music, and movies,and with the app you can upload your pictures from your phone to the cloud than to your TV. I have not played any of the games but I am sure that I wont be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Andrew Thorman"}, {"rating": 4.0, "review": "Loved the price on this and we use it all the time now.", "verified": true, "helpfulness": "0/0", "author": "C.I.T. \"C.I.T.\""}, {"rating": 5.0, "review": "gift", "verified": true, "helpfulness": "0/0", "author": "PB&J"}, {"rating": 5.0, "review": "Easy to use.  Love it.", "verified": true, "helpfulness": "0/0", "author": "DirectorMaryMack"}, {"rating": 4.0, "review": "Easy set up, simple to use!", "verified": true, "helpfulness": "0/0", "author": "THOMAS MULHERN"}, {"rating": 5.0, "review": "mad that I didn't get it sooner. a wonderful alternative to expensive cable and you have a wider variety of movies and TV shows.", "verified": true, "helpfulness": "0/0", "author": "A. Winding \"hopeless romantic in Chicago\""}, {"rating": 3.0, "review": "I want to start off by saying that I've had this stick for over three months now and I use it daily. When it works, I love it! Having the apps in one place is wonderful and I like having the remote so if someone wants to change the show/movie, I don't have to hand over my phone or stop what I'm doing with it. I must also admit that I'm not very picky; I also find some of the free games entertaining. Aside from the games, I use the Fire Stick for Netflix, Hulu, and Amazon prime instant video. I also like if, for example, I come across a link for a youtube video while I'm checking my email, I can get it on my TV with just one touch.Why isn't my rating 5 stars? Every day, sometimes multiple times per day, I cannot connect to the Internet. Now, the stick registers my internet connection and says the strength is \"very good\" but the stick is \"connected with problems.\" Sometimes this will rectify itself within a few moments (such as the time to finish reading an email or article found while skimming Facebook) but most of the time, this error requires getting up, unplugging the stick from the power source, and restarting it. Now, that doesn't sound like too big of a pain, but when it is an every day issue, and for someone who tends to have TV/movies on for background noise while doing work/homework (like me), it can become frustrating. I'm hoping there will be an update coming out, since this didn't happen for the first few weeks.Also, there is frequently a problem where the video with freeze completely while the audio will continue, though this may be a Hulu problem, as it doesn't happen in any other app and my internet connection is always good.Lastly, if you scroll to the right using the remote, if you click right say, four or five times, the system will launch you forward at superspeed past several pages of options on Netflix/Hulu/Amazon. I'm not sure if that's a defect with my remote or what, but it too can become frustrating after a while.", "verified": true, "helpfulness": "0/1", "author": "Sam"}, {"rating": 5.0, "review": "I am very impressed with the fact that I needed help and clicked my phone number and was instantly called back and very courteously assisted.I have other streaming devices and none offer anything comparable.My one complaint would be that to load my Amazon music, it counted as one of my ten devices to activate, which since the Fire TV Stick is an Amazon product, the music should have been automatically included the same way as the Video library, I do hope you'll consider changing this in the future.Overall, I am delighted with it, and would highly recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Valerie Ann Young"}, {"rating": 1.0, "review": "Do not purchase.  Only works half the time, wifi is incredibly weak and always says \"connected with problems.\"", "verified": true, "helpfulness": "1/1", "author": "Vic Young \"boater Vic\""}, {"rating": 2.0, "review": "Returning to Amazon.  I purchased to do mirroring with my Android tablet.  Mirroring connection was a hit or miss.  Took multiple tries and would drop mirroring.  Remote and Aps seem to work well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]