[{"rating": 5.0, "review": "Love the fire stick. so convenient and easy to use.", "verified": true, "helpfulness": "0/0", "author": "J. Geiger \"yafine\""}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "D. Digiovanni"}, {"rating": 4.0, "review": "Really like in Amazon integration, that shows all Amazon content in a somewhat organized manner. If you have Amazon prime this should be in your home.", "verified": true, "helpfulness": "0/0", "author": "StrongCar"}, {"rating": 5.0, "review": "Its products like Fire TV Stick that continually set Amazon above other retailers (If you can limit Amazon to a retailer).  Typical Amazon excessive user-friendly(ness).  I'm confident even the most non-technical user could be up and running with this in minutes.  I have Chromecast as well but based on a friends recommendation I decided to pick up the Fire TV Stick and I'm glad I did.  I didn't realize Fire TV Stick worked with so many service providers (Netflix, Hulu etc) so that was a nice surprise.  Everything is centrally located on a clean, responsive interface.  Even the remote app for the iPhone works great.  Fire TV Stick, as with most Amazon products, exceeded my expectations and I will be sending a dozen of these as gifts to my family.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "We've purchased 3 of the First TV sticks and we love them!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I good stick for streaming content, however I don't like that it forced me to plug into an actual outlet because it wasn't receiving enough power via the USB. There is lots of \"content\" available via Amazon, but a lot of it that they are advertising at \"top, new, popular\" are obscure / not current / not that great in regards movies. A lot of content that is current / popular / well received is available to stream but is not included in Prime and you must purchase, which begs the question, \"what am I actually getting of quality viewing with my Prime membership?\" Content wise I'm on the fence, product wise (the stick itself) it seems pretty capable and easy to use.", "verified": true, "helpfulness": "1/1", "author": "E. Preston"}, {"rating": 4.0, "review": "This thing is great!I use this almost exclusively for watching TV.I love all the apps and I love the speed of this device.My only beef is that I have had to restart the device a little more than usual.If Amazon is able to help out, and I can get a device that doesn't need to be rebooted frequently, I will give 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Jordon Fiske"}, {"rating": 5.0, "review": "Just what I needed.", "verified": true, "helpfulness": "0/0", "author": "Liyana"}, {"rating": 2.0, "review": "this is not very good when streaming movie from the phone", "verified": true, "helpfulness": "1/1", "author": "Bernard Bailey"}, {"rating": 5.0, "review": "It is a great investment, finally able to get rid of the ridiculous cable bill!!", "verified": true, "helpfulness": "0/1", "author": "Rosemaie Hodge"}]