[{"rating": 5.0, "review": "worked fine", "verified": true, "helpfulness": "0/0", "author": "Janis Berman"}, {"rating": 5.0, "review": "It works great but still like the Roku better. I gave it 5 stars because of the price. You can't beat the price tag for what you get.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "No complaints so far.", "verified": true, "helpfulness": "0/1", "author": "Elizabeth"}, {"rating": 5.0, "review": "best ever.", "verified": true, "helpfulness": "0/1", "author": "Denis"}, {"rating": 5.0, "review": "I just got my fire stick two days ago and I am very very happy with it. I thought it had VUDU on it but it has flickster which I could link them together and see all the movies that I have on VUDU. It has a lot of things to see. I found tv shows I like to watch and some free movies. It came already programmed with my amazon account and was very easy to hook up. It turned my regular flat screen to a smart TV. Still finding things to watch. Great buy.", "verified": true, "helpfulness": "0/0", "author": "itsasuiter"}, {"rating": 1.0, "review": "Using the Fire TV Stick used too much of my wireless Data. I have no use for it.", "verified": true, "helpfulness": "1/3", "author": "Lonnie Monroe"}, {"rating": 5.0, "review": "Great product. It was everything I wanted and more.", "verified": true, "helpfulness": "0/1", "author": "terry"}, {"rating": 5.0, "review": "Cable? What's that? Surely not this nifty little stick. I love it!Who needs cable when you literally have just about every show ever downloaded onto the net at your fingertips. If that's not enough then you can buy Hulu, HBOgo, Amazon Prime/Videos/Music/(Free)Games*** or a plethora of other tv programs that allow maximum viewing capabilities, or just try the free trials. But my all time favorite is Youtube for free.Cable is like $20-30 the first year then it skyrockets up to like $30-60. This is $40, and you get some free programs. If that's not enough then you can do like me and get a tv app for under $10. The best part is you don't have to wait for regular programming and can watch whatever whenever you want, given you don't have to share it with several freeloading sisters, four children, and a doting mother. Anyways, I don't have to watch everything on my computers anymore if I don't want to.All you need is wifi.So $20/mos for wifi, w/WOW + $40 (one time payment) + $8.25/mos for Amazon Prime bringing my yearly expense to $380 this year and $340 every year after rather than the $600 I was paying. That's almost $300 in savings, and I just use the free apps like Youtube then that's another $100 off. But that's just me.I definitely recommend this innovative device. It's the future of tv.", "verified": true, "helpfulness": "1/1", "author": "K.B"}, {"rating": 5.0, "review": "I like this but I don't like the ideal that you have to pay for everything", "verified": true, "helpfulness": "0/0", "author": "Tenetia Perrin"}, {"rating": 2.0, "review": "Probably works well. I live in a very rural area and my internet is probably not up to par.", "verified": true, "helpfulness": "0/1", "author": "A. Gillette"}]