[{"rating": 3.0, "review": "Plex playback on this thing is horrible.  I can't really believe Amazon let this happen.  I play a movie through Plex in my browser;  fine.  I play the same movie on the same server through Plex on my Roku stick; fine.  I play the same movie on the same server through Plex on the Fire Stick; stutter, freeze, disconnect from server, \"connecting to server\", \"can't play this movie\" garbage.  This thing has already failed the wife test; now if we want to watch a movie on Plex she immediately goes for the Roku stick.  She will not even consider the Fire stick.  Complete fail.  I've done research on this thing, tried a bunch of different settings, put my wifi on 2.4/5.  Everything else on the stick plays great, I must say; Netflix, Prime, YouTube.  Plex is complete fail.  If Plex means anything to you, get the Roku stick or something else unless you read at least 50 reviews saying that Amazon has fixed broken Plex on the Fire stick.", "verified": true, "helpfulness": "1/1", "author": "Carl Sampson"}, {"rating": 4.0, "review": "I do not own a smart TV and normally access my Netflix and Amazon Prime on our PS3. We recently gave the PS3 to the kids to keep at Grandma's house, thus cutting off my TV access. This TV stick fixed that. It was easy to set up. You attach the plug, plug it in, pop the stick in your TV on. You have to turn your TV to the appropriate screen, mine would be HDMI3 and you then use the included remote to navigate through the menus. I easily accessed my Amazon Prime and Netflix accounts and was watching in minutes. The kids are able to use it just as easily. I really love this but had to knock a star off due to it not being cordless. I have to plug it in across from the TV and I hate having the wire running across the walkway into the room. So, if they ever make a rechargeable version I will definitely purchase.", "verified": true, "helpfulness": "0/0", "author": "NYCPickyMom"}, {"rating": 5.0, "review": "i love the fire stick.  about to sell my roku's", "verified": true, "helpfulness": "0/0", "author": "Tauron Lawrence"}, {"rating": 5.0, "review": "Great device! The connection is spectacular and great fluidity on the actual software and maneuvering around the apps. The only thing I think could be improved would be a wider range of apps. A particular app would be Vudu which is very popular on all devices and services. I know that Flixster can link with some of the movies, but the interface of the app isn't as friendly and not all of the movies are included such as Disney selections. But all in all great device and I would suggest it to family and friends.", "verified": true, "helpfulness": "1/1", "author": "Justin Millard"}, {"rating": 5.0, "review": "GREAT  WELL  WORTH  THE  MONEY", "verified": true, "helpfulness": "0/0", "author": "BILLIE CURRENCE"}, {"rating": 4.0, "review": "Was hoping more movies would be available especially when I go into search mode. I can understand the New Releases having a cost, but movies from the 60's, 70's, 80's, 90's and pre 2010 movies you would think be more readily available.", "verified": true, "helpfulness": "1/1", "author": "Marvin Jarvis"}, {"rating": 5.0, "review": "Awesome product! Works great!", "verified": true, "helpfulness": "0/0", "author": "matthewryan9"}, {"rating": 5.0, "review": "Finally, this just works!! remote is GENIUS. Prime Members just order one already!!", "verified": true, "helpfulness": "0/0", "author": "R.Texan"}, {"rating": 1.0, "review": "Poor product.  Remote control goes through a set of batteries every week.", "verified": true, "helpfulness": "0/1", "author": "Scott in Surprise"}, {"rating": 5.0, "review": "The fire stick was easy to install and use. We are able to use it on the tv in the game room or move it to the bedroom TV very easily.  I'm super impressed on how easy it is to use.", "verified": true, "helpfulness": "0/0", "author": "Kimkbs"}]