[{"rating": 1.0, "review": "Worked well for a few days then it kept saying that the network was connected with problems. Sometimes it works for a few minutes and sometimes it doesn't work at all even though two other devices in the same room work perfectly. Going to return it.", "verified": true, "helpfulness": "0/1", "author": "K. J. Lewis"}, {"rating": 5.0, "review": "Works perfectly. Easy to operate. May go for the Fire tv next time.  I will never run out of movies to watch or music to listen to.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Grandma Barb in MO"}, {"rating": 5.0, "review": "I'm in tv heaven! I'm so glad I purchased.", "verified": true, "helpfulness": "0/0", "author": "Dorian Madrid"}, {"rating": 4.0, "review": "It is an impressive little device, but I was under the impression that the apps available for the kindle were absolve on the fire stick and they are not. Whle they do have many to choose from they don't have my main music app RDIO. I got a prime membership for Christmas. So the stick works well for me. Hoping they get more apps soon though....", "verified": true, "helpfulness": "0/0", "author": "a. strickland"}, {"rating": 1.0, "review": "This sucks! I tried to watch a movie I rented and couldn't. It kept telling me my internet connection was too slow. I had no problems watching the movie on my laptop. But would have rather used the fire device.", "verified": true, "helpfulness": "1/2", "author": "Clayton M."}, {"rating": 3.0, "review": "Not bad. I run android, and a chromecast ended up being much better overall, so I end up using the fire stick only for amazon prime video or when I want to rent a video that's only available from amazon. Seems uninspired on the whole, but functional. If you had a roku I'd say it's probably not worth bothering with fireTv.", "verified": true, "helpfulness": "0/0", "author": "Chris Peterson"}, {"rating": 5.0, "review": "Very easy to work with. I will def recommend this product to my friends and family!", "verified": true, "helpfulness": "0/0", "author": "Anoulack Sitthisack"}, {"rating": 4.0, "review": "Great product!  Its very fast and it works so much better than the Chromecast.  The only thing I wish it had was a way to stream media directly from a DLNA server.  Perhaps someone will come out with a program to do that soon.", "verified": true, "helpfulness": "0/0", "author": "J & R \"jesras\""}, {"rating": 5.0, "review": "LOVE IT!!💙💙💙", "verified": true, "helpfulness": "0/0", "author": "Carmen Martinez"}, {"rating": 5.0, "review": "I was lucky enough to pick this up for $19 when it was first released. What a great buy!! I've been wanting a streaming device for my bedroom because I don't have cable in there. It was easy to set up and it works like a charm! No issues with buffering and my prime account was already linked to the device. My mother has a chrome cast which is also a good streaming stick. But I would recommend the fire stick over the chrome cast for a couple of reasons 1) it comes with a remote so you don't have to use your phone or tablet 2) access to amazon prime (this includes video and MUSIC!!) 3) the hardware is just better. $19 was a steal, but I would have gladly paid $39.", "verified": true, "helpfulness": "1/1", "author": "D'A ngelo Ramos"}]