[{"rating": 5.0, "review": "Love it!!  :)", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 3.0, "review": "Its a great deal for the price, but before they changed the verbiage on the site it said it was miracast certified... and im not sure about now, but then it was in fact not certified. Unfortunately i found that out later. I wanted netflix and amazon instant videos in my bedroom and the ability to mirror my surface to it. It does not mirror windows tablets or pcs to it. They have caught some bad feedback on this and changed the way the listing appears now. It came out with half-baked software that ran like s***. took me 3 days to complete the first update. Updates now are much faster but will almost always fail the first attempt.", "verified": true, "helpfulness": "0/0", "author": "Ryan Giles"}, {"rating": 2.0, "review": "Not enough movies included under the Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Julia M. Gillette \"naturelover\""}, {"rating": 3.0, "review": "Has many useful features and is well built, unfortunately I don't have a strong enough bandwidth and  haven't been able to use it.  It would be helpful if it preloaded some of the movie so it wasn't constantly buffering", "verified": true, "helpfulness": "0/0", "author": "Dana M Lindner"}, {"rating": 4.0, "review": "Works great. There are minor latency issues other wise it streams flawlessly", "verified": true, "helpfulness": "0/0", "author": "Stephen dudek"}, {"rating": 5.0, "review": "I spent a couple of months checking out a variety of ways to just get Netflix hooked up to my TV to have something different to watch once in awhile .... local Walmart tried and tried to sell me on their versions of Home Digital Entertainment, all of which cost more than Amazon's Fire Stick! .... once Amazon had it back in stock (because it is such a great seller), I paid for it, received it shortly thereafter, easy installment, added Amazon Prime, switched the Netflix from my computer over to my TV and added WWE network and found my little piece of Heaven on Earth!!", "verified": true, "helpfulness": "0/0", "author": "Craig Belville"}, {"rating": 5.0, "review": "Love both the Fire Stick and TV/", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "It generally works okay, but it doesn't allow you to access the internet.  They say that they haven't worked that out yet.  The look of the movies stutter a little too much for my taste, I'm afraid.", "verified": true, "helpfulness": "0/0", "author": "BFP \"Filmutah\""}, {"rating": 5.0, "review": "Loved, it!", "verified": true, "helpfulness": "0/0", "author": "Frankar"}, {"rating": 4.0, "review": "I like the fire stick but not that u still have to buy some show and movies.", "verified": true, "helpfulness": "0/0", "author": "svfcxgfdccffvdshddxfddghsj rd dggffil f2f hmm jegkdhxbffgdgnhqf2f namksf2f gdhrf2f hfjfhWgas ggedgrg"}]