[{"rating": 5.0, "review": "I enjoy my increased variety of shows.  The installation was easy and only took a few minutes.  Well worth the price if you don't have a smart TV.\\", "verified": true, "helpfulness": "0/0", "author": "Krazy Cat Lady"}, {"rating": 1.0, "review": "The device sounds like a great idea but the wireless antenna is terrible. It will even show your wireless connection strength as being solid, 4/5 bars but still drop the connection. In all, my family has 8 other networked devices, including laptops, tablets, and another set-top device. NONE have network issues in the same room. I do not recommend buying unless your wireless router is in the exact same room.", "verified": true, "helpfulness": "0/0", "author": "Clarey K Stone"}, {"rating": 5.0, "review": "Worth every penny", "verified": true, "helpfulness": "0/0", "author": "parriotbay"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Lovon Williams"}, {"rating": 1.0, "review": "Insanely slow. Returned it after two days. Chromecast is so much better.", "verified": true, "helpfulness": "0/0", "author": "Chris A."}, {"rating": 4.0, "review": "Good product, sometime would be very slow while streaming \"sling\" or \"netflix\" but unplug it and then plug it back in again, it works fine after that.", "verified": true, "helpfulness": "0/0", "author": "K. Tong \"K-han\""}, {"rating": 4.0, "review": "I bought a fire tv stick a couple weeks ago.and i really love it:) it was really easy to plug into the back of my tv and it took a very short time to set up, after i signed into my account it seemed like minutes later i was able to watch movies and tv shows and play fun games like crossy road which is like old time frogger but more fun:) and it has an excellent picture: )It may not have the same Facebook app that roku has but it has an app that for i think just a dollar it gives notifications on the tv screen from Facebook and also shows texts messages from your phone on the screen too:)", "verified": true, "helpfulness": "0/0", "author": "Stephen leidy \"electronics addict\""}, {"rating": 5.0, "review": "Bought it for cottage tv in maine.  The price was right and it's perfect to catch up on my movies on a rainy day in maine.  Hopefully their won't  be  too many of them", "verified": true, "helpfulness": "1/1", "author": "Robert Pinkham"}, {"rating": 3.0, "review": "It's okay.  I would like a better selection of movies you did not have to pay for.", "verified": true, "helpfulness": "0/1", "author": "Robert Chartier"}, {"rating": 3.0, "review": "Good: Price, Size, Convenient, Video Quality, Amazon Prime, HDMI Commands (I.e. Turn on TV)Bad: Glitches, Lags, Display Artifacts, and did I mention a heaping ton of Ads?!Comments: Terrific for the price. I was delighted by the Amazon-Sling deal a few months back so I thought I'd give it a try. After 3 months, I've had a good, solid run with the Fire Stick, and come to the conclusion that I like the Apple TV better. In comparison to the AppleTV, there appears to be a bit of stuttering, lag, and overall glitching this with the Fire TV stick.Personal preferences aside, there does tend to be a lot more advertising that I'm comfortable with.", "verified": true, "helpfulness": "1/1", "author": "JuanGuapo"}]