[{"rating": 4.0, "review": "I love it, easy set up and boom tv is a smart tv. The only thing I dont like is that the screen is really big so when searching for movies on netflix cuts off titles, but as soon as you pick the movie and watch it, its fit to the screen", "verified": true, "helpfulness": "0/1", "author": "amanda rice"}, {"rating": 1.0, "review": "Does not work with Apple computers.", "verified": true, "helpfulness": "0/2", "author": "Abundance"}, {"rating": 5.0, "review": "Wonderful, wonderful, wonderful!!!!!  Great price; Lightening fast shipping; Easy to use; Works like a charm.  The simplicity of it all is terrific -- Just plug it in & enjoy yourself!!!!! :)", "verified": true, "helpfulness": "0/1", "author": "William Attridge"}, {"rating": 5.0, "review": "Love It!  So easy to install and use.  Was hesitant to try it until my neighbor told me how wonderful it was.  Changed my Netflix account to streaming.  No longer have to mail discs and wait to receive them.", "verified": true, "helpfulness": "0/1", "author": "Linda Rose"}, {"rating": 5.0, "review": "I love this fire tv stick.", "verified": true, "helpfulness": "0/1", "author": "Tamika Collins"}, {"rating": 5.0, "review": "Better than I expected.  Love it", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product.  I can not believe how fast it load the Apps and stream's the movies.I highly recommend it.", "verified": true, "helpfulness": "0/1", "author": "Rohi"}, {"rating": 5.0, "review": "I have owned this for a month now. The Amazon Fire TV Stick works excellent. With HBO Go added and Pluto TV, not to mention all the other apps, it is a must buy. I had one issue with blue screen error. I unplugged it for 10 seconds and plugged it back in and it has worked seamlessly for two weeks. Now if Pluto TV would add more channels, I could disconnect from cable.", "verified": true, "helpfulness": "0/1", "author": "Ron G."}, {"rating": 5.0, "review": "Verrrryy easy to install! And love the options. I definitely should've bought this long ago.my family and I travel and use time share which gives us very little options to watch. It's useful for when you travel and want to either watch a movie/latest shows or play a video game.", "verified": true, "helpfulness": "0/1", "author": "Anna Marie liddle"}, {"rating": 5.0, "review": "Well worth the $39.  We use netflix and amazon prime on here as well as the awesome little games they have on there when were bored.  Crossy road and flappy birds family really remind us all how much NES and older classic arcade games will never die and will never cease to amaze!", "verified": true, "helpfulness": "0/1", "author": "cooksalot"}]