[{"rating": 1.0, "review": "I got this as a gift to replace my Roku.  It will not stay connected and buffers every minute or two. I did not have this problem with the Roku, which I unfortunately gave to my daughter.  Don't waste your money.  Roku may cost a bit more, but at least it works.", "verified": false, "helpfulness": "1/2", "author": "Stacyj"}, {"rating": 5.0, "review": "amazing", "verified": true, "helpfulness": "0/0", "author": "michael"}, {"rating": 3.0, "review": "When it works it is good. Disappointed in how many shows need to be purchased separately. Also that the connection to my wi-fi has failed for two days with the stick yet my tablet picks up signal just fine. A lack of technical support also seems to be present leaving the stick useless to me at this time.", "verified": false, "helpfulness": "0/0", "author": "Bronwyn Hawke"}, {"rating": 5.0, "review": "I tried the Google Chromecast, I didn't like it one bit. I bought one of these, and then I bought 2 more! I love this product! Excellent job Amazon in providing one of the best streaming television platforms ever!!", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "Super easy to use. Love it.", "verified": false, "helpfulness": "0/0", "author": "Pamela J Bourke"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Chad Stewart"}, {"rating": 5.0, "review": "This item is more convenient than the original Fire TV.", "verified": true, "helpfulness": "0/0", "author": "?"}, {"rating": 4.0, "review": "nice to have as a companion to Prime - slightly sluggish to use", "verified": true, "helpfulness": "0/0", "author": "Mike Markot"}, {"rating": 4.0, "review": "Very fun and easy to use", "verified": true, "helpfulness": "0/0", "author": "Diane Krebs"}, {"rating": 2.0, "review": "The whole point of having this is to be able to connect while on-the-go.  Nowadays nearly every wi-fi access point while traveling requires some kind of usage agreement or other web page entry such as a hotel room number.  Therefore, this thing is useless while traveling unless you're just visiting friends/family.", "verified": false, "helpfulness": "0/1", "author": "lb in St. Paul"}]