[{"rating": 5.0, "review": "I don't know how the cable company is going to survive with the fire stick on the market. I love it and I got rid of cable.", "verified": true, "helpfulness": "0/0", "author": "kjanai"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Beverley Massey"}, {"rating": 4.0, "review": "In my opinion, this product loses a star for not allow certain ISP customers to configure the HBOGo app and others alike.  I am aware that this a contractual disagreement issue, however, it directly affects the consumer's decision making process when comparing other media hub technology services.", "verified": true, "helpfulness": "0/0", "author": "Peter Z."}, {"rating": 4.0, "review": "Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "J. Norton"}, {"rating": 4.0, "review": "Powerful and inexpensive, this is a great addition to any TV.  Installed this on a 27\" LCD primarily for use with Amazon Prime and Netflix.  RedBull TV, Hulu and YouTube round out a great selection of apps.  Mirroring could be a bit more intuitive.  Unfortunately the TV's USB port can't power the device, which is probably operating outside the USB standard of 500mA to 900mA power delivery.  This necessitates the use of the wall-wart and is definitely a design deficiency, otherwise this would be a 5 star solution.", "verified": true, "helpfulness": "0/0", "author": "Joseph Cornwall"}, {"rating": 5.0, "review": "The User Interface is very responsive, and I can get to the apps I want.  Also, makes it really nice to rent shows directly from amazon - my new favorite rental option.  We've moved off of our Xbox360 and onto this for our family entertainment center.  We only keep the 360 around for old DVDs or the very occasional game.", "verified": true, "helpfulness": "0/0", "author": "L. Jordan Bickel \"Technomonk\""}, {"rating": 1.0, "review": "It can read that I have a good internet connection but it doesn't work at all anymore", "verified": true, "helpfulness": "0/0", "author": "David Hibberd"}, {"rating": 3.0, "review": "The Stick was really easy to set up.  I was able to up load my pictures and videos. I was able to download the app for the controller.  However I Can only connect to Prime and Netflix.  Having trouble with everything else.", "verified": true, "helpfulness": "0/0", "author": "Bankable Family"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Catherine Saunders"}, {"rating": 5.0, "review": "Works great. No complaints.", "verified": true, "helpfulness": "0/0", "author": "Lee"}]