[{"rating": 4.0, "review": "My family is enjoying the fire stick", "verified": true, "helpfulness": "0/0", "author": "Helen Brooks/Odom"}, {"rating": 5.0, "review": "Plays Amazon video well. I can't play Sev Zero on it which is the only advantage of the Fire TV box in my case. And the remote was a bit nicer but I only paid 20 bucks for this and am very happy with it.", "verified": true, "helpfulness": "0/0", "author": "radioman2014"}, {"rating": 5.0, "review": "On demand entertainment with a simple remote. The streaming is clear and consistent. The app selection is just okay but the key players are there Instant Prime, Netflix, Hulu, Pandora, PBS, and ESPN. As long as app selection keeps growing this smart tool is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I was very much excited to receive this. I have had to use a PS3 for all my streaming services and have been looking for an affordable alternative. Unfortunately the Fire Tv Stick has only worked correctly about half the time. It has become so unreliable and annoying that I have discontinued use and will consider something tried and true like Apple TV.", "verified": true, "helpfulness": "2/3", "author": "Charles R Waychoff IV"}, {"rating": 3.0, "review": "I compared this product to the Roku stick and the Google Chrome stick.  The Roku won (didn't charge for additional apps like Plex and has way more free channels).  The Fire Stick came in a close second and the Chrome stick went back to the store day 1.  I based my decision on portability (I travel for work and hotel tv is horrible), channel and viewing options, charges for additional apps, ease of use, clarity of pictures (HD streaming options) and other requirements like, wifi connections, computer or tablet.  I used them all on my MiFi device on the hotel room 42\" LG tv and the Roku stick had the clearest picture, more channel options, and the most consistent stream with minimal download interruptions. The Fire Stick also had a great picture but it took longer to download the same movie from Prime????? and it kept getting interruptions.  I thought it may have been just a bad MiFi/WiFi connection so I plugged in the Roku stick.  It worked much better.  Sorry Amazon!  I'm thankful for the return policy.", "verified": true, "helpfulness": "1/1", "author": "LPG \"LPG\""}, {"rating": 4.0, "review": "Easy to install and use. Doesn't easily post how much the different sites charge monthly.", "verified": false, "helpfulness": "0/0", "author": "Margaret Vermillion"}, {"rating": 2.0, "review": "The more I use this Fire TV Stick, the more I hate it. And the more I compare this to my Roku 3, the sadder I get.I bought this when it had its introductory $19 sale price. If that's all the money you have to spend on a streaming device, then by all means go for it, but now that it's $39 and not going down anytime soon, I strongly suggest you don't buy this piece of garbage.The interface is absolutely terrible. Whichever product team developed this should be fired and forced to navigate through the Fire Stick Menu for the remainder of their lives.The lag on this is driving me insane. I couldn't even enter my Email into Netflix without yelling at the screen and giving up. Besides being $19, I have absolutely nothing positive to say about this product. Buy a Roku Stick or even a Chromecast for all I care, just don't think about buying this.", "verified": true, "helpfulness": "0/1", "author": "Sam Olson"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "D. A. Blount"}, {"rating": 4.0, "review": "Excellent device for the price. The best navigation of any streaming device (including AppleTV and RoKu). It's very user friendly, intuitive and quick to process. Worth buying for sure.", "verified": true, "helpfulness": "1/1", "author": "PR212"}, {"rating": 5.0, "review": "This works really well with high speed internet. So far, since we have Prime, we're enjoying using it to watch instant videos on our tv. We also can look at our pictures! We haven't done too much other than that, but so far so good.", "verified": true, "helpfulness": "0/0", "author": "Lydia Johnston"}]