[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Wendy Kari"}, {"rating": 5.0, "review": "it works perfect! Thank you...", "verified": true, "helpfulness": "0/0", "author": "boston"}, {"rating": 5.0, "review": "Easy to install, and will save us lots! Now that we have this, we can cut our cable bill tremendously!  Easy access to Netflix and Amazon Prime content. Love the Amazon Music playlists I set up.  It has made our TV more functional.  We are still trying out all the different apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome Product", "verified": true, "helpfulness": "0/0", "author": "carrie mcgee"}, {"rating": 5.0, "review": "perfect for low cost television viewing...and movies galore.", "verified": true, "helpfulness": "0/0", "author": "otway9811"}, {"rating": 5.0, "review": "Greate! Fast", "verified": true, "helpfulness": "0/0", "author": "Gabriel"}, {"rating": 5.0, "review": "I did a ton of research and read a lot of reviews on Fire Stick, Chrome and the Apple version.  I decided on the Fire Stick.  It was so easy to set up.  It took me just a few easy minutes.  Then I easily connected to my Hulu, Nexflix and others.  Prime was of course ready to roll.  I like how easy it is to navigate.  And how my tv is even better than my daughter's smart tv.  Although I can connect with the phone, I prefer the remote it comes with.  I can't see the phone without glasses so the simple to operate remote is convenient.  I love the picture quality and access to so many movies and tv shows.  I finally am canceling the expensive satellite tv!  I am going to get this for the other tvs in the house.  I wanted to try one first to be sure.  I couldn't be happier!", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 5.0, "review": "I Like It!It's so simple to setup and use.I tried a Chromecast first and it was always a hassle. It either couldn't be found or it was slow to respond.And using my phone as the remote sucks for me. Every app has it's own thing.I like that this stick has a remote and it's own interface.It's much easier to navigate around and find the things I want to watch and have play/pause ff/rw buttons.And now that it can be used in hotels and other places you need to login to, it's the only choice.There is even an app that lets me view my office webcams so I can check out what's going on from my TV at home!I haven't used it to play games yet, I'm not a video gamer so that is not a big feature for me, but it's cool to know it's there.Only thing missing for me right now is WatchABC.", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 5.0, "review": "Very easy to install and use......glad I made this purchase", "verified": true, "helpfulness": "0/0", "author": "Sue Matherne"}, {"rating": 4.0, "review": "easy set up. simple to use. really is plug and play. would recommend to others.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}]