[{"rating": 5.0, "review": "Ok. So, I'm a gadget fan, the more tech I own, the better I feel, ...sorta. When Amazon announced this new Fire TV Stick, I was about to pull the trigger on the Fire TV Box with extra remote. I held off on that purchase and ordered the Fire TV Stick instead, that was back in October. It is December and it finally arrived. The delay is no problem, I was told to expect it Dec. 23rd, so it is actually here earlier than I was expecting it. Here is my take on the device after a day of using it:Very simple installation. It came preregistered to my Amazon account, already working with my Prime membership too. I plugged it into the HDMI port and then into USB power port on the back of my Samsung Flat Panel HDTV, but the Fire TV Stick failed to ot to the Home Screen. It kept restarting (just showed me the Amazon and animated Fire TV logos repeatedly). The small instruction booklet that came with the Fire TV Stick recommended using the included square power plug, so I gave that a try. It worked like a charm after that, Home Screen came right up after a brief software update dowload and initialization. So far, so good.I downloaded several apps from the onscreen selections, i.e. Hulu Plus, TuneIn Radio, iHeartRadio, Pandora, Netflix, etc. and input my registration on each app. I also downloaded a Fire photo frame app that I used my Amazon coins to purchase. Onscreen purchases, evidently, worked just fine from the Fire TV Stick as well.Wow. My movies played almost instantly without delay, and other than an occasion split second hiccup during video playback every so often (not even really noticeable but I mention it here for others), the playback was smooth. The menu selections were smooth also, no delays, no problems at all. **Loved it.The remote was simple to figure out, really didn't need to watch the intro video that came up the first time the Fire TV Stick connected. It is all so very intuitive.Next, I wanted to try the mirroring feature between my Kindle HDX and the Fire TV Stick. I went to Settings on my Kindle HDX, then Display, then selected Mirroring. Couldn't have been simpler. After maybe 20 seconds, my Kindle HDX display was now showing on my Fire TV Stick-connected HDTV, big as life. I watched movies I had stored on my Kindle HDX, layed music from the cloud, it worked fantastically. No problems, whatsoever. I wished the Kindle display could be turned off during the mirroring activity, but no worries there. When I rotated my Kindle, the display adjusted to the same orientation.I even read one of my digital magazines and a book on my HDTV during the mirroring. I fell asleep while watching an episode of Doctor Who last night, and when I awoke this morning I noticed that my Kindle was still showing that I was connected in Mirroring mode, but only the Fire TV Stick's Home Screen was showing. I had to Power Off my Kindle HDX and Power On, then reconnect to the Fire TV Stick to continue the Mirroring feature.I have read others' reviews wherein they recommended the Fire TV Box over the Fire TV Stick due to delays in menu selections, but I didn't see any delays. Things went pretty smoothly. Very pleased. Buying another Fire TV Stick for the other room.", "verified": true, "helpfulness": "1/1", "author": "D. ''Cowboy'' Wilson"}, {"rating": 3.0, "review": "I have 2 TVs that I tried this with.  One is an older 46\" and one is newer but smaller.  It works great on the newer TV.  On the older TV I plugged it in and it worked great for a while, but then the screen went to Vertical lines and there was a high pitched noise coming from the TV.  I had to unplug the TV and plug it back in to clear the error.  After this happened several times I decided to go back to the roku box on the big TV and move the fire stick to the newer one.  After changing back I have still had a couple of times where the TV starts putting out a high pitched sound and needs to be turned off and back on again to get it back to normal, so I'm pretty sure it did some damage to the older TV.", "verified": true, "helpfulness": "0/0", "author": "Johnathon"}, {"rating": 5.0, "review": "I think the product is great.  It is simple to connect to Airplay using an apple device, because the Apple process is simple (my 16 and 21 year old daughters connected instantly).  It is a little harder to connect from an Android device, because the Android process has a few more options and steps, which makes it a little more complex.  I really like the product and might even buy another !", "verified": true, "helpfulness": "0/0", "author": "REG"}, {"rating": 5.0, "review": "This thing rocks, it works flawlessly with music, netflix, prime video; even the games are ok; for the money it is really a great deal. the controller works fine and if ypu use your phone its even better. i hide mine beneath the tv and connnected the usb power to a port, you cannot tell it is there", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just got mine in the mail.  Really nice packaging, looks official.  The device itself is nice, wish it could run without the USB lead tho.  The remote feels really good and is very responsive.  This was a steal for 19 dollars!", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 4.0, "review": "Works great. One nit is that currently the wifi passwords can't contain some  characters (forward slash and double quote). This cost me an hour of struggling to figure out why it would not connect to my wifi. I definitely recommend getting the free android app with the voice search.", "verified": true, "helpfulness": "0/0", "author": "J. Norr"}, {"rating": 3.0, "review": "While I like all it has to offer, it is buggy. It reboots in the middle of games and takes a long time to \"wake up\" when not used for a while. I especially don't like that I cannot acces some the games without having the more expensive box. This is just another competitor in the crowded market of entertainment.", "verified": true, "helpfulness": "0/0", "author": "malenightingale31"}, {"rating": 5.0, "review": "Much faster and clearer picture than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Heath"}, {"rating": 3.0, "review": "Not compatible with a TV older than 3 years, so annoying!", "verified": true, "helpfulness": "1/1", "author": "Amanda Bill"}, {"rating": 5.0, "review": "We have a Roku in one room, and now we have this in the other. The Fire Stick works very well, and it is nice to not have a box that we have to stick somewhere. It also seems to be a lot less laggy than the Roku. I do wish it had voice, and we could buy the additional remote, but I think for the price, it is a pretty good deal!", "verified": true, "helpfulness": "0/0", "author": "Taipans"}]