[{"rating": 5.0, "review": "The Fire Stick is amazing. So easy to use with a wide veriety of content.", "verified": false, "helpfulness": "0/0", "author": "Brian P. Buckman"}, {"rating": 4.0, "review": "awesome product, i waited enough time to have it, and it was worth the waiting.", "verified": true, "helpfulness": "0/0", "author": "Luis Herrera"}, {"rating": 3.0, "review": "The WiFi receiver is weaker than I expected, but overall it is designed well and delivers HD content to my TV with the exception of a few apps.", "verified": true, "helpfulness": "0/0", "author": "Bryan Ludwig"}, {"rating": 5.0, "review": "Ok first of all I'm a non-techy kinda Grandma so I'm not sure how to answer this......I got a large tv downstairs which is Grandkid territory -----My youngest son installed the fire stick and I'm told it works fine.....since I don't use it myself that's the best I can do folks.", "verified": true, "helpfulness": "0/0", "author": "KAY"}, {"rating": 5.0, "review": "love it. supper easy to set up and use. couldn't wait for it to arrive so I coukd stream movies. defenitly worth it", "verified": true, "helpfulness": "0/0", "author": "Rhonda"}, {"rating": 1.0, "review": "I'VE HAD IT A WEEK OR TWO AND HAVEN'T GOTTEN TO USE IT YET. I BOUGHT IT TO PLAY THINGS FROM THE COMPUTER TO THE BIG SCREEN TV. I DO NOT THINK IT WILL DO THAT. I ONLY SEE WHERE YOU CAN PURCHASE CERTAIN VIDEOS AND GAMES,TO SEE.", "verified": true, "helpfulness": "0/1", "author": "HAMAND"}, {"rating": 4.0, "review": "Was easy to install. Works great", "verified": true, "helpfulness": "0/0", "author": "Brian McMahon"}, {"rating": 5.0, "review": "Five Stars is NOT enough to say how I feel about the Fire TV Stick.  Once my contract is over with my cable company, it is buh bye to them and HELLO to $175/mo savings on that bill.  All thanks to Amazon's Fire Stick.Update:  I've gone through the apps list and couldn't find a web browser, which would give freedom to watch streaming news from our local stations.  I hope a web browser will be provided in the near future.  Still love the device... :0)", "verified": true, "helpfulness": "0/0", "author": "PuppyWuppy"}, {"rating": 4.0, "review": "Nice. I can cut back off of some cable channel.", "verified": true, "helpfulness": "0/0", "author": "SHARON"}, {"rating": 5.0, "review": "The next big thing is here", "verified": true, "helpfulness": "0/0", "author": "Travis Chapman"}]