[{"rating": 1.0, "review": "How can I review it when it's not even hooked up?  One smart TV and one not so smart and it's not working on either one.  I don't know what to do.", "verified": true, "helpfulness": "1/2", "author": "John Gaze"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is the most  entertainment  I ever experienced.", "verified": true, "helpfulness": "0/0", "author": "oucme2"}, {"rating": 5.0, "review": "The fire stick has been awesome. It is quick to use and the connection to the wireless was seamless and being a Prime member my account was already set up. It has Netflix and access to who if we wanted it it also has access to other games we haven't played those yet. But the variety on it is different than that on the Netflix account so it's great having access to both and having it be so quick. The only thing I might change would be how I can set up an account on it as we had some weird power outage and it had signed me out of my account on the fire stick. But we were you started the fire stick again and it came up like it was supposed to.", "verified": true, "helpfulness": "0/1", "author": "Patricia M. Davidson"}, {"rating": 5.0, "review": "F.Y.I. A complete User Guide is available online. PDF file to save FREE. Amazon Fire+TV+Stick+User+Guide.pdf  Adobe Reader required. Peace", "verified": true, "helpfulness": "0/0", "author": "FAIRYmAMA \"VICCHIC\""}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Olga Rodriguez"}, {"rating": 5.0, "review": "Performed exceptionally in or RV", "verified": true, "helpfulness": "0/0", "author": "Thomas Rodgers"}, {"rating": 5.0, "review": "Wonderful selection of shows.  Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Karen Jensen"}, {"rating": 5.0, "review": "Simply Awesome", "verified": true, "helpfulness": "0/0", "author": "paul hahn"}, {"rating": 1.0, "review": "I bought 3!!!! What a mistake. Amazon knows there's issues with Internet droppings been cause by this fire stick. It's been almost 2 years and they haven't found a solution to this problem. If I was you I would not buy this. You will spend more money trying to get this stick to work. Fetch it to the dogs let them have it. How could Amazon treat there customers like this. And customer service response \"upgrade your 90mb internet speed\"... lol Amazon employee so hilarious.", "verified": true, "helpfulness": "1/1", "author": "Lobo"}, {"rating": 5.0, "review": "Had some problems initially because I was not using the included HDMI extender but once I put that in, no problems.", "verified": true, "helpfulness": "0/0", "author": "Mike Cocchiola"}]