[{"rating": 5.0, "review": "I made sure to take my time before reviewing this one. I bought this during the Prime member special before the item was released. This also was purchased to replace my Chromecast. Let me just say it did just that!The operating system works great and is very easy to use. You can buy/download apps on the device and most work just fine. The nicest part about it is that you can even get an app on your phone/tablet to make it a controller too.During the time I have been using the device I have had only twice where it refused to work properly and it had to be unplugged and reset. And the two times this happened was after an extended time of no use (2-4 weeks).This device really amazes me at how well a simple flash drive sized stick can perform. If you use Plex, Netflix, Amazon Prime, Hulu Plus etc. this is the device for you.", "verified": true, "helpfulness": "0/0", "author": "David McCahon"}, {"rating": 4.0, "review": "nice", "verified": true, "helpfulness": "0/1", "author": "allen dorsey tripp"}, {"rating": 1.0, "review": "Does not let you log into your Netflix account without paying extra for Prime!Don't buy to view Netflix.", "verified": true, "helpfulness": "1/1", "author": "BK"}, {"rating": 3.0, "review": "great when used", "verified": true, "helpfulness": "0/0", "author": "william"}, {"rating": 5.0, "review": "I love it it works great,I have Amazon Prime and I also get hundreds of movies free love it.", "verified": true, "helpfulness": "0/0", "author": "Lynn Wells"}, {"rating": 5.0, "review": "Bought this for my bedroom so I could connect to the internet on my TV - love how easy it was to set up and how easy it is to navigate between the apps.This is my first time owning something like this and I heard great things about the Fire TV, but I did not want something else to clutter my bedroom, so the TV stick solved that problem real quick.", "verified": true, "helpfulness": "0/0", "author": "Danielle Ski"}, {"rating": 1.0, "review": "Still trying to get internet", "verified": true, "helpfulness": "0/0", "author": "debrann fusco"}, {"rating": 5.0, "review": "So far...ok.", "verified": true, "helpfulness": "0/0", "author": "John Paul C. Gamana"}, {"rating": 3.0, "review": "Fire Stick is cool. The apps are not bad either. The only issue I have is that the stick gets too hot. When that happens you have to disconnect it from the power cord for a few seconds for reboot and keep the apps/movies from buffering. Another option is to disconnect until its time use. Why should I have to? Because the fire stick will always get too hot, there should be some R&D; for a newer type in the works.", "verified": true, "helpfulness": "1/1", "author": "DFW0913"}, {"rating": 4.0, "review": "It's better than the apple tv", "verified": true, "helpfulness": "0/0", "author": "Mr. L"}]