[{"rating": 4.0, "review": "Works well, especially for the money.", "verified": true, "helpfulness": "0/0", "author": "Gary Nason"}, {"rating": 1.0, "review": "Would not connect or stay connected to WiFi. WiFi signal strength was full bars, connection still unstable and extremely flakey. Returned f- exchanged or Fire TV box. Now using wired internet connection with the box. All is good.", "verified": true, "helpfulness": "1/1", "author": "Randy M \"rdm\""}, {"rating": 5.0, "review": "really cool!", "verified": true, "helpfulness": "0/0", "author": "Dennis Blazer"}, {"rating": 5.0, "review": "The only thing I can say is that I wish they would add RabbitTvPlus app to the lineup!", "verified": true, "helpfulness": "0/0", "author": "Charles Huelsman"}, {"rating": 2.0, "review": "It almost impossible to use it in south america. Most of the contents are unavailable.", "verified": true, "helpfulness": "0/0", "author": "Juan Lopez Molinari"}, {"rating": 4.0, "review": "This is great and amazing technology.  Shows load fast, play in great quality, and the interface is easy to use.  I never could have expected this kind of performance out of a package as small and inexpensive as this thing.On the downside, occasionally the streaming video does a sort of \"hiccup.\"  It's barely what I would call lag, but noticeable and frequent enough to be somewhat annoying.  I'm not sure if it is the Fire TV Stick or my internet, so this might not be fair.  I HAVE noticed though that the frequency of these \"hiccups\" has decreased over the time I've used the Stick.Further, I wish the remote had more features.  I don't care about voice search, I'm talking about menu and setting options right on the remote.  It's certainly a simple and streamlined remote, but perhaps overly so.I grew up in the pre-internet days of the first personal computers.  Telephones were attached to the wall with a cord in my childhood.  This technology strikes me as something out of the Jetsons.  Now excuse me, I need to find my dentures...", "verified": true, "helpfulness": "0/0", "author": "Douglas Coleman \"Movie Buff\""}, {"rating": 5.0, "review": "It is great so far!", "verified": true, "helpfulness": "0/0", "author": "Bobbie"}, {"rating": 5.0, "review": "Beats cable", "verified": true, "helpfulness": "0/0", "author": "JR Petrella"}, {"rating": 5.0, "review": "Excellent! Easy to connect and use immediately!", "verified": true, "helpfulness": "0/0", "author": "Marsha R."}, {"rating": 4.0, "review": "This is amazing.  My family loves to watch movies without commercials.  This is the best", "verified": true, "helpfulness": "0/0", "author": "Irene Nester"}]