[{"rating": 5.0, "review": "I have 100% replaced my google chrome cast with the Amazon Stick. Very easy too use.", "verified": true, "helpfulness": "0/0", "author": "TigerFan \"Cory\""}, {"rating": 2.0, "review": "Fire stick plugs directly into TV, and uses it's speaker system. If you have an older receiver that links to speakers, and it doesn't have an HDMI input, you can't get sound to work.  Bummer...So I went and tried this on a TV that has issues with picking up WiFi with an existing Smart DVD player. Fire TV stick still couldn't solve that issue, although a Roku 2 box could. So at the end of the day, I'm not impressed.", "verified": true, "helpfulness": "0/0", "author": "Michael K."}, {"rating": 1.0, "review": "Ordered this Fire Stick Dec 1st; It has been working fine till now.The audio has just died; I have restarted this thing twice, checked all settings and connections, but I get NO audio anymore. (Correction: The cute little guy that pops up and talks about the Firs Stick works fine.) The videos, NOTHING!  The unit is plugged into a HDMI switcher; audio output comes from the switcher directly into the audio amp. The fact that the promo audio works tells me that the connections are all good.This should not have a 4-month life cycle. Or maybe an Amazon update just 'bricked' the audio. Can I get a replacement from Amazon? What's the warranty period on the Fire Stick???Disappointed to say the least.", "verified": true, "helpfulness": "0/1", "author": "H. L. Brody \"leehb\""}, {"rating": 5.0, "review": "Very easy to install.  Love Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "David Helget"}, {"rating": 5.0, "review": "I LOVE my Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Jane E. Davis"}, {"rating": 5.0, "review": "I am enjoying my Fire TV Stick. It is much faster and easier to navigate than my blue ray player.", "verified": true, "helpfulness": "0/0", "author": "D. Manor \"stoneman\""}, {"rating": 5.0, "review": "It is awesome!", "verified": true, "helpfulness": "0/0", "author": "theoria burgess"}, {"rating": 5.0, "review": "Love it...I have 2 Fire TV Sticks and 1 Fire TV Box..I am getting ready to order another Fire TV Stick..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I like my mk808 stick a lot better because I can add programs from the app store and can add memory", "verified": true, "helpfulness": "0/0", "author": "Mr. Jacob H. Verhoeff"}, {"rating": 2.0, "review": "so after getting it I went into HBO, ESPN and other tv apps and to my surprise Charter communication is not listed as they don't recognize fire as valid device, rest it's a better stick then roku much better interface and works well.", "verified": true, "helpfulness": "0/0", "author": "Muhammad Tahir \"OT\""}]