[{"rating": 5.0, "review": "A must it you have Amazon Prime. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "John Brothers"}, {"rating": 3.0, "review": "I ordered the Fire TV Stick in early December 2014, on as whim, as a birthday gift to myself.  When it first arrived I found it to be easy to install, useful and easy to use.  I don't watch a lot of TV preferring to read but I do like to have the option to watch shows from Amazon and other sources.  I also have a 3rd generation Roku box but like the interface of the Fire stick better, especially the search function.  I live in a rural area and am limited to 1.5 Mbs DSL for Internet access, this limitation can cause buffering issues but with patience TV shows and movies in SD are watchable, HD material can be a bit problematic.  In February 2015 my Fire Stick developed an odd problem, none of my Amazon content is available but other sources of video content work as expected, including \"Sting TV\" \"Hulu\" \"YouTube\" \"Ultraviolet\" and the like.  My two year old Roku can access all my of my content including Amazon.  I worked my way through the FAQ suggestion to trouble shoot my problem with no improvement.  I suspect the issue is tied to my low bandwidth speed. I plan on giving  the Fire Stick to my son he lives in the city and has 30 Mbs Internet access so he may be able to use it for his Amazon media, if not then into the recycle system it goes life is too short to sweat the small stuff.", "verified": true, "helpfulness": "0/0", "author": "Chiefthom"}, {"rating": 5.0, "review": "Great features for a TV that does not have Netflix, Pandora, Hulu etc..", "verified": true, "helpfulness": "0/0", "author": "Rafael A. Baronio"}, {"rating": 5.0, "review": "SImple to setup, simple to use! Has all the features I needed. Now, a voice controlled remote!", "verified": true, "helpfulness": "0/0", "author": "Alan Avriett"}, {"rating": 1.0, "review": "Slow even when powered through outlets. Apps crash tons of times daily. No active support  or patches / fixes on firmware or apps. Not sure if I would recommend this device if app support is not significantly improved.", "verified": true, "helpfulness": "0/1", "author": "Mamta Bhasin"}, {"rating": 5.0, "review": "Love It!!! It was easy to install and I can enjoy watching movies or tv shows anytime that I want to.  My 7 year old granddaughter uses it and I didn't even have to show her how to use it.", "verified": true, "helpfulness": "0/0", "author": "Debra Harbin"}, {"rating": 3.0, "review": "most of the movies i cant acess", "verified": true, "helpfulness": "0/0", "author": "newton ambrose"}, {"rating": 5.0, "review": "Good product, better than the wi fi in the tv", "verified": true, "helpfulness": "0/0", "author": "Anthony Sciacca \"avstony\""}, {"rating": 5.0, "review": "Finally! A solution for not have a $130-$200 per month cable bill. AMAZING! Save your money and get this fire stick, you wouldn't even miss cable. Internet connection is all you need!", "verified": true, "helpfulness": "0/0", "author": "ASHLEY HARRIS"}, {"rating": 5.0, "review": "Giving it a five but still working with it, so this may change.", "verified": true, "helpfulness": "0/0", "author": "bp"}]