[{"rating": 5.0, "review": "Easy setup, so many choices. So glad I got it.", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 4.0, "review": "Streams fine. Read the tips first.", "verified": true, "helpfulness": "0/0", "author": "Lloyd A Barnhart"}, {"rating": 5.0, "review": "Works great! Can watch Netflix in the bedroom now. The remote is a great addition over the Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "JimV"}, {"rating": 1.0, "review": "This thing has to be plugged in while in use. Doesn't that defeat the purpose ? Small device great then a giant cable running down the wall ??", "verified": true, "helpfulness": "0/2", "author": "Simon Neilson"}, {"rating": 4.0, "review": "I love that for $19.99 I was able to make my tv a smart tv. Works great with my newer tv, but not with my 3 year old Tv. I get tons of static and popping noise with my living room TV and that one is more expensive tv than my other TV. I would give it 5 stars if it worked on my other TV's", "verified": true, "helpfulness": "0/0", "author": "Grl...wishing for fall \"Momx23\""}, {"rating": 4.0, "review": "Gave as a gift.  So far, no complaints.Update - Decided to keep it. Great but no TWC app really hurts this. ROKU still up one because of the TWC app.", "verified": true, "helpfulness": "0/0", "author": "Jose Sanchez"}, {"rating": 2.0, "review": "It freezes all the time. Plus remote doesn't like to work. Changed the new batteries out that came with it but same issue. Really regretting my purchase.", "verified": true, "helpfulness": "0/0", "author": "Cristy M. Russell"}, {"rating": 4.0, "review": "So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 4.0, "review": "Nice features...Pros:1)  Prime videos are super easy to navigate and view.2)  Sends HDMI signals to automatically change TV input to Fire Stick when you press remote.3)  Convenient access to Netflix and remote control of YouTube with your phone.4)  Options to install existing and future applicationsCons:1)  Need separate remote for TV and Fire to control power and/or volume; otherwise, not needed.2)  Remote is easy to lose (small)3)  No quick way to put it back on Stand By (at least I haven't found a way)The primary reason I purchased the Fire TV Stick was to avoid turning on my PS3 to watch Prime or Netflix.  Goal achieved and using the Fire TV Stick is quicker and easier with a wide range of added features.", "verified": true, "helpfulness": "0/0", "author": "BoMan"}, {"rating": 4.0, "review": "Could use newer movies....", "verified": true, "helpfulness": "0/0", "author": "Martin Sampson"}]