[{"rating": 5.0, "review": "This product is amazing. It streamlines everything into a nice little stick. The remote is really user friendly and easy to handle.", "verified": true, "helpfulness": "0/0", "author": "Ratchet"}, {"rating": 5.0, "review": "The Firestick is pretty cool, I like being able to use Netflix as well. The only thing I don't like is the organization of shows/movies, as well as finding out which ones need to be bought to watch.", "verified": true, "helpfulness": "0/0", "author": "L. Pattison"}, {"rating": 3.0, "review": "Not a lot there for all the hype.Would be nice if they would put the cable channels that you can stream on it.", "verified": true, "helpfulness": "0/0", "author": "Larry Tomovich"}, {"rating": 5.0, "review": "Grate. Easy to operate. We love it", "verified": true, "helpfulness": "0/0", "author": "Kesh"}, {"rating": 5.0, "review": "Love this item! It let's me mirror my MS Surface tablet screen to any HDMI input wirelessly! plus all the great streaming video tools. Only thing I don't care for is the power supply connection. Would like to have a little battery back-up on board for short presentations.", "verified": true, "helpfulness": "0/0", "author": "Newdayjones"}, {"rating": 4.0, "review": "I love this thing.  I don't need a cable box any longer. I just plugged it in, set it up quickly, and I was watching Netflix and Amazon Prome and listening to Pandora in no time. Highly recommend. Worth the money.", "verified": true, "helpfulness": "0/0", "author": "David Katz"}, {"rating": 5.0, "review": "Works great for my application.", "verified": true, "helpfulness": "0/0", "author": "Wendell Hartley"}, {"rating": 5.0, "review": "Works great.  Very happy with the product.", "verified": true, "helpfulness": "0/0", "author": "Greg Seaman"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 2.0, "review": "I got this fairly cheap being Prime.I feel gullible for buying into the hype, but then realized what all these devices really are: platforms for spending more money.If you're looking to cut the cord on cable, you'll still need an ISP, then this device, like others, is just there for your paid accounts on HBO, MLB, Netflix, Hulu+, etc.There are probably like 5% of apps that aren't paid so know what you're getting into...it is like razor & razorblade for those who use that comparison.", "verified": false, "helpfulness": "0/0", "author": "Mr. Middle \"Put it into Context\""}]