[{"rating": 5.0, "review": "Freaking love this thing. Super small and doesn't add anything to my entertainment center, just plugs into the tv and that's it. I showed it to my grandparents and parents and they loved it. I bought then one also. I'll be buying one for my master bedroom and my kids room also. It's great once you install kodi on it.", "verified": true, "helpfulness": "1/1", "author": "carlos"}, {"rating": 4.0, "review": "This is really easy to use and works really well for the price. The interface is a little confusing and definitely showcases amazon over all of the other channels, which may be annoying if you don't have the amazon prime video service. Great if you do have prime though, as you can see all of the videos you can watch for free. I don't really like that you can't power it just with the usb plugged into the tv and that you have to plug it in to an outlet but it's not that big of a deal. I really appreciated that it came with batteries for the remote and the remote is really easy to use.The quality of the video is pretty good but it requires a really strong, reliable wifi source. That may mean that you need a wifi extender even if you can connect your computer or phone to your wifi without it. I'e found that this is true of other streaming devices too though, roku, google stick, etc. so maybe that's just how these things work. If you have trouble connecting this to your wifi or keeping it connected, I recommend changing your wifi channel and/or buying a wifi extender.", "verified": true, "helpfulness": "0/0", "author": "meg"}, {"rating": 2.0, "review": "I'm very disappointed, most of the movies, an TV shows you have to rent. Movies like Them, creature from the Black Lagoon, Kolchak. I have all these on DVD but they r just an example. I have Netflix, an tho it costs 7.99 or so a month, u rent to movies on the fire an its about the same, anyway bottom line is to many movies an TV shows, you must rent so, I give you a negative review.", "verified": true, "helpfulness": "0/0", "author": "Michael Parris"}, {"rating": 5.0, "review": "Excellent unbelievable", "verified": true, "helpfulness": "0/0", "author": "evkarsojo"}, {"rating": 5.0, "review": "Great.  Easy for my kids to use after I easily set up parental controls.", "verified": true, "helpfulness": "0/0", "author": "Pamela K. Calig"}, {"rating": 5.0, "review": "Worked as advertised.", "verified": true, "helpfulness": "0/0", "author": "Jesus V."}, {"rating": 5.0, "review": "I love u", "verified": true, "helpfulness": "0/0", "author": "Mz. Dreddz"}, {"rating": 2.0, "review": "The device gets awfully hot, and it gives me crap for not using the given power adapter (5.0Volt 1.0Amp) even though my TV has a 5.0V 1.0A USB port (it's labeled on the TV). I also don't like the idea it is always on (I know it goes to sleep.) If it didn't warn me about using the TV USB power I wouldn't have that concern because when I shut my TV off it would kill the power to the Fire TV Stick.If I didn't get it 'free' with my 3 month Sling TV purchase I'd likely send it back.", "verified": true, "helpfulness": "0/0", "author": "Reptyle"}, {"rating": 2.0, "review": "Doesn't work as I expexted", "verified": true, "helpfulness": "0/0", "author": "D. Head \"me2chic\""}, {"rating": 5.0, "review": "ITS REALY GREAT. I THINK THE SHOULD UPGRATE TO MOST RECENT MOVIES LIKE THE ONES YOU GET IN THE RED BOX", "verified": true, "helpfulness": "0/0", "author": "Linda Tousignant"}]