[{"rating": 2.0, "review": "We love the firestick but have been having a problem where we have to unplug and wait a few minutes then replug it back in EVERYTIME we shut off the TV! This is super annoying... Also, we have a huge lag time when using HBO GO or SHowtime anytime.  No issues with the Amazon prime shows... Odd.  Can anyone tell me why these issues are occuring?", "verified": true, "helpfulness": "0/1", "author": "jessica schultz"}, {"rating": 1.0, "review": "It seems to me, compared to ROKU, the Amazon Fire TV Stick is missing the point of giving up Dish, Direct, Time Warner or any of the other \"pay for watch\" providers...everything should NOT have a fee attached to it. If we pay to participate with every offering we will spend more than we did with our previous provider...??? Really? I don't think so...Being able to already have subscriptions to Netflix, Amazon (not Prime...yet) and a few other commonly used providers is the only thing that even puts the Fire Stick in the same neighborhood with ROKU...oh yeah, the clarity of the picture and quality of sound is very good.", "verified": true, "helpfulness": "0/1", "author": "Randy King"}, {"rating": 5.0, "review": "This was affordable, easy to install and user friendly. Expecially since we were using the Wii to stream netflix before. The Wii is a pain.", "verified": true, "helpfulness": "0/1", "author": "Hildysmith"}, {"rating": 5.0, "review": "Very easy to install  and works great!", "verified": true, "helpfulness": "0/1", "author": "Maureen A Rose"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV stick primarily so I could run Kodi and access the media I have stored on my NAS devices. Installation of Kodi on the Fire TV stick was a breeze using adbFire. This is a great price for a device able to run Kodi and although you can only connect wirelessly, the 5GHz dual band connection still allows me to stream HD content from my NAS. As an added bonus, I can watch Amazon Prime instant videos (I am a prime member)", "verified": true, "helpfulness": "0/1", "author": "W. Lee"}, {"rating": 5.0, "review": "Love it! Easy to setup.", "verified": true, "helpfulness": "0/1", "author": "Kelley G."}, {"rating": 5.0, "review": "Love this so much that we bought a second one for the basement TV instead if moving it each time we wanted to watch something.  Love it even more because we can watch all of our Prime shows as well!", "verified": true, "helpfulness": "0/1", "author": "Janice L. I. \"Jan Isaacs\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Michael price"}, {"rating": 5.0, "review": "It's  so much better than Roku", "verified": true, "helpfulness": "0/1", "author": "Tim"}, {"rating": 4.0, "review": "The Amazon Fire TV Stick has worked perfectly for me.I bought it primarily because I travel for work and was tired of using my laptop for watching my Netflix and Prime.  It worked exactly as it was supposed to and I was very pleased.  I also use it in the master bedroom to take the place of my playstation.The only con is that I wasn't aware that it still needed a power cord to power it.  It's not a big problem, but you need a power source pretty close by because the cord isn't that long.", "verified": true, "helpfulness": "0/1", "author": "dusty miller"}]