[{"rating": 2.0, "review": "Completely disappointed in the Fire TV stick. It was very slow and stopped streaming during every single thing we tried to watch. We have a fire box and LOVE it, and loved the idea of having an even more mobile version of it (to move to other TVs in the house). It was pretty much useless. That said, our Fire Box is great, and if you are in the market for a device, skip this and go right to the box.", "verified": true, "helpfulness": "2/7", "author": "Caitlin"}, {"rating": 5.0, "review": "Easy streaming", "verified": true, "helpfulness": "0/1", "author": "Nathan Welch"}, {"rating": 3.0, "review": "Picture not real clear", "verified": true, "helpfulness": "1/3", "author": "James R Free"}, {"rating": 4.0, "review": "Very good. Easy to install.", "verified": true, "helpfulness": "1/2", "author": "Zodobon"}, {"rating": 1.0, "review": "This thing is horrible.  It connects to the things that it says it will, but straight out of the box I've had nothing but playback issues. I tried deleting data caches and restarting. Everything I stream via the Fire stick is absolutely unwatchable because it keeps pausing every few seconds.", "verified": true, "helpfulness": "1/5", "author": "M. Clemens"}, {"rating": 5.0, "review": "great device!", "verified": true, "helpfulness": "0/2", "author": "michael bell"}, {"rating": 5.0, "review": "It's amazing so many things to watch!!!", "verified": true, "helpfulness": "0/1", "author": "Jessica Quilty"}, {"rating": 2.0, "review": "I couldn't get HD reception for Netflix to work so we sent it back after discussions with customer service", "verified": true, "helpfulness": "1/2", "author": "Elizabeth Koehler"}, {"rating": 3.0, "review": "thought this was going to be on the 20th anniversary sale... so far the Amazon Prime Sale is a Bust", "verified": false, "helpfulness": "13/23", "author": "Lynn Sawyer"}, {"rating": 5.0, "review": "This product is  so much easier to use than the more expensive one.  Better than the Roku.  Totally would recommend it", "verified": true, "helpfulness": "0/0", "author": "reggie"}]