[{"rating": 5.0, "review": "The fire stick is amazing it does everything.", "verified": true, "helpfulness": "0/1", "author": "Cory Ross"}, {"rating": 5.0, "review": "Very easy to install and setup - straightforward. Ease of access to Netflix, games, etc. is great.", "verified": true, "helpfulness": "0/1", "author": "Kimberly Clayton"}, {"rating": 5.0, "review": "Love it! And love that I can use my phone to control it.", "verified": true, "helpfulness": "0/1", "author": "Megan Avis"}, {"rating": 5.0, "review": "Love it.. No need for a smart tv as long as you have this!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the fact I can travel with my fire stick and use it anywhere. Very easy to use. If you own or are familiar with the Amazon Fire box than the usb is just the same thing. Offers, Netflix, hulu, Yahoo, Facebook, Amazon, vudu, etc...", "verified": true, "helpfulness": "0/1", "author": "Kate"}, {"rating": 4.0, "review": "The interface is a bit confusing and ill organized, but I enjoy what it's capable of. I wish it were easier to use (the way it's set up is a bit confusing, like compiling a place where all of your apps are neatly organized), but I use this all of the time. It has a really great selection of apps, though I only ever use Netflix, Prime, YouTube, and MLB.tv.It's a bit expensive, that's my only major dislike.", "verified": true, "helpfulness": "0/1", "author": "Rachel"}, {"rating": 5.0, "review": "Amazon fire stick is so much better than I thought it would be. I have WII and google chromecast and neither of them compares.  The streaming movies are much easier with this than any other product.", "verified": true, "helpfulness": "0/1", "author": "Richard Viers"}, {"rating": 4.0, "review": "wish it also streamed HBO NOW (not HBO GO), but love it! Thinking about buying another one!", "verified": true, "helpfulness": "0/1", "author": "H. clay \"ms sailor\""}, {"rating": 5.0, "review": "WOW, you cant beat it for the price.", "verified": true, "helpfulness": "0/1", "author": "Izaak M."}, {"rating": 5.0, "review": "Love it, so easy to install. LOVE the shows, games, movies it has it all.  We got it for streaming, works great. We have Dish TV and Comcast Internet.  My only regret was I waited so long to get one. In fact I got 2, one for each tv. Wished I had done this a long time ago.", "verified": true, "helpfulness": "0/1", "author": "JMA"}]