[{"rating": 5.0, "review": "WOW!PROS:1. Easy to install/setup  (IF you have Wi-Fi, a TV with an HDMI port, and a CLOSE easily accessible power outlet)2.  The interface is clean, streamlined, easy to figure out.3.  Stick can easily be switched/registered to different users and the menu item to do so is easily found.  I ordered two - one for myself and one as a gift.  The one for me came attached to my Amazon Prime account.  The gift item did not.  That's exactly the way I wanted it.4.  Streaming quality is fantastic and I now am able to have HD on my HD tv.  *does happy dance*5.  The HDMI extender cable is very useful as if you have other ports close by with items plugged into them, the fire stick is a little wide if plugged directly into your port and will push against adjoining items.  The extender addresses that issue.CONS:None that I have noted yet.However, Suggestions to Amazon -  1.  The \"sleep\" feature is down in the submenus and works immediately.  I thought this was kind of weird.  Perhaps this feature could have (a) a timer aspect and (b) be located on the main menu?  2.  The setup guide is very brief and limited in information.  Would be helpful to include specs for the system with regard to how it uses Wi-Fi as well as some troubleshooting suggestions should there be a problem with immediate connection.  I needed to reset and revamp my friend's Wi-Fi router in order to enable the Fire Stick connection.  I'm pretty sure it's an issue with her router as this is not the first time we've had connecting problems with it, however, for those that are less tech savvy or this may be a first time issue, it would be nice to have information about the Fire Stick to narrow it down faster.  *What's up with every hardware producer assuming their product will always set up perfectly every time?  Hello, real world!!  :)", "verified": true, "helpfulness": "0/0", "author": "Bredwell"}, {"rating": 3.0, "review": "Easy to use, great content but buggy.  I have to periodically reset (reboot by unplugging the power) my Fire TV Stick which is a disappointment.  In particular, the netflix app often hangs up.", "verified": true, "helpfulness": "1/1", "author": "Qwaters \"eigen\""}, {"rating": 5.0, "review": "WAY better than my Chomecast.... lots of added and better features!", "verified": true, "helpfulness": "0/1", "author": "NGrow"}, {"rating": 5.0, "review": "Love it.  Love the mirroring with your television", "verified": true, "helpfulness": "0/0", "author": "C. Bledsoe"}, {"rating": 5.0, "review": "Awesome.  This turned my computer monitor into a tv!  I can now watch Amazon Prime, Netflix, etc, at work without my boss knowing ( he thinks it is a powered USB stick ).  I use Picture in Picture so it looks like I am working really hard.  House of Cards, is more fun to watch that to code PHP all day.", "verified": true, "helpfulness": "0/1", "author": "Josh Sostek"}, {"rating": 4.0, "review": "This is a review of the fire tv stick for a specific use case: to watch video on a projector. I bought it together with the following projector: iDGLAX HDMI 720p Video Projector (Native 1280 x 768) 1080p HD Compatible for Home Theater, Movie and Game (DG-757), but it can of course be used with other projectors. The combination gives a cheap way to watch movies on a really big screen. The Fire TV stick makes a 'dumb' projector smart. At least with the projector I bought, the Fire TV stick can be powered from the USB port, so the whole setup is very convenient with only a single power cable to connect.The Fire TV stick is no-brainer choice for someone like me who is a Prime member, but otherwise does not subscribe to other services. It is fast, streams without glitches, and I like the user interface. Very easy to use.The only negative for using the Fire TV stick with a projector is that the Fire TV stick cannot connect to a bluetooth speaker [the same is true for Apple TV]. The above projector, and probably most projectors, have poor built in speakers. Without bluetooth the only way to connect an external speaker is through cables, making the whole setup cumbersome. This is the reason I cannot give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "A. Host-Madsen"}, {"rating": 5.0, "review": "Easy setup, perform well, nice addition to spare TV.  Easy access to my online content.", "verified": true, "helpfulness": "0/0", "author": "Michael P"}, {"rating": 5.0, "review": "I love my fire stick after I was able to connect to my network.  The functionality of the device is great. I really like the screen savers when you walk away or pause the device. A lot better than Netflix and I can also put parental controls on the device.  I recommend this device to others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Murder Mysteries\""}, {"rating": 3.0, "review": "Works okay but not as good as \"non-stick\" Fire TV. The USB module heats up a bit which I expected and dont know the impact of the heat on its life expectancy. It doesnt sync very well and some applications (hulu+ in particular) often require re-entering of the device code. This is probably a conflict caused by using Fire TV and Fire Stick from the same account. It doesnt seem to have the same memory capacity of Fire TV and loads/updates slower. I would suggest going with Fire TV, not the Stick If you have a choice, otherwise if you need a smaller profile solution go with the Stick. Voice search isnt available on the Stick but the type in search works without hesitation.", "verified": true, "helpfulness": "0/0", "author": "Wesley"}, {"rating": 3.0, "review": "Overall it is a good device, however it lags at times. the stick does not respond to the remote.", "verified": true, "helpfulness": "0/0", "author": "Furman"}]