[{"rating": 1.0, "review": "Using the remote to log in to my Netflix and Amazon accounts is a pain in the neck. I wish I could use it like the Google ChromeCast and just route my choices to the Fire TV Stick. I was also expecting to have free movies and TV episodes, but so far all the movies are pay only.", "verified": true, "helpfulness": "0/0", "author": "Pete"}, {"rating": 4.0, "review": "love it so far.....I dropped my cable so I am having trouble getting Lifetime. *(One day I can get it the next I can't - I have no cable)", "verified": true, "helpfulness": "0/0", "author": "D Foote"}, {"rating": 1.0, "review": "This thing is junk! Constant connectivity issues. Installed exactly as instructed (with the power cord,) router is less than two (2) feet away, and it still drops connection and has to be reset (hard reset.) Will purchase a Roku and solve the problem.  Save yourself the aggravation and go with another brand until Amazon sorts out the bugs, offers solutions, and offers some type of support for this infernal device other than telling you too hard reset the darn thing EVERY time.", "verified": true, "helpfulness": "0/0", "author": "r3p5t1"}, {"rating": 5.0, "review": "Affordable entertainment!! Good bye cable!  Great product!", "verified": true, "helpfulness": "0/0", "author": "Sally"}, {"rating": 5.0, "review": "Best purchase I made ! I luv it!", "verified": true, "helpfulness": "0/0", "author": "Dominique Desiree Solomon"}, {"rating": 2.0, "review": "When it's working correctly, I love my FireStick...unfortunately, it has a major problem. The stick frequently loses Internet connection. I've read other reviews and troubleshooting tips which suggest unplugging the device from the power source for approximately 30 seconds. This works, but it's annoying to have to do this 3-4 times while watching a movie. I returned my first FireStick thinking it was a faulty device, but when the replacement did the same thing, I'm thinking it's a systemic error. Fix this design flaw (and give me an improved version) and I'll happily award five stars!", "verified": true, "helpfulness": "0/0", "author": "Alineal"}, {"rating": 5.0, "review": "Glad I have it!", "verified": true, "helpfulness": "0/0", "author": "Lucy Roach"}, {"rating": 2.0, "review": "I am so frustrated with this product.  I mainly watch Netflix using the Fire Stick and there is a 'glitch' that randomly prevents Netflix from loading.  You'll get different error messages but basically the app won't load or your show won't load.  Sometimes this happens when you are already in Netflix. A nice poster on an Amazon forum about this issue gave a workaround (clear the memory in Amazon video app & unplug), but it is a pain and Amazon should be fixing this problem via a software update.  The first star is for easy setup and the second star is because it was $20 when I bought it; so at least it was cheap!", "verified": true, "helpfulness": "0/0", "author": "AMC"}, {"rating": 2.0, "review": "Doesn't work very well in my house and I have Comcast Internet so it is fast enough to work well.", "verified": true, "helpfulness": "0/0", "author": "Z.P."}, {"rating": 5.0, "review": "I wish the price comes down again soon, because everyone in the family wants one for each television.  It's a great product!", "verified": true, "helpfulness": "0/0", "author": "Brooke"}]