[{"rating": 3.0, "review": "It does the job. To bad I have to purchase almost everything I want to watch.  I was hoping it was going to save me money, but.....  I guess nothing in life is free.  Not even TV.", "verified": true, "helpfulness": "0/0", "author": "Candace"}, {"rating": 5.0, "review": "Amazon Fire Stick was more than I expected, my family and I are really happy and enjoy all the shows and movies. I have recommended it to all my friends. Amazon keep up the good work.", "verified": true, "helpfulness": "0/0", "author": "Rosemary Arrington"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "HiFi"}, {"rating": 5.0, "review": "I love it so far.but having things come up fast is not very good.but this product offers a lot.", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 3.0, "review": "i was expecting more like actual tv channels not just tv shows and in most shows that i like I have to pay for them example the simpsons, american dad and family guy even with my prime membership i have to pay for them separate if I want to watch them soo \"IS OK I GUESS\"", "verified": true, "helpfulness": "0/1", "author": "Noe Guzman"}, {"rating": 3.0, "review": "I got the Fire TV stick last week. I have an XBox 360 and an order Blueray and needed some sort of update to take advantage of current apps. The Fire TV stick seemed like the best low cost solution. It is - love the interface, plays all the latest apps, easy installation, etc. - but you need a very fast, strong and consistant wifi. My only available internet is not-so-great cable.  My computer and other devices work okay, although sometimes not great.  When the signal isn't the best Fire TV stick doesn't work at all. If you read all the one star reviews you will see it's the same thing; hanging, video stops, black screen, etc.  When my signal is good it works fine.Of you have strong, reliable wifi I think you'll be very pleased. If not, I suggest waiting for later versions where, hopefully, Amazon will have addressed this weakness and fixed the issue.Bottom line - 5 stars for constant, 1 stars for function.", "verified": true, "helpfulness": "0/0", "author": "H. Roach \"helen_r\""}, {"rating": 5.0, "review": "Have Google Chromecast and this is far superior. The remote control is faster and easier than using my iPhone, and it includes Netflix as an app. The search function is fast, intuitive, and easy to use. Great device, especially at this price point.", "verified": true, "helpfulness": "0/0", "author": "Larry Glidewell"}, {"rating": 5.0, "review": "We have an older flat screen without any \"smart\" features so we got this so we could access Netflix and our Prime movies. Plugged it in and set up took just a couple minutes. Have been watching Netfliix for a few hours on it now and no issues. I love it.", "verified": true, "helpfulness": "0/0", "author": "El Chupacabra"}, {"rating": 5.0, "review": "Only thing I can say LOVE IT! LOVE IT! LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "Barbara Minnis"}, {"rating": 4.0, "review": "Navigation 3/5 - Pretty good navigation, but not exceptional. Finding movies, etc. could be streamlined. The cast feature for prime instant video would be very well received. Take advantage of the phone's navigation, rather than relying on the device's menus.Streaming Quality 4/5 - Great quality, although I ran into some WiFi compatibility issues when used on the same network as the Roku 3, as well as a few other circumstances where I have had network drops.Music 2/5 - Could benefit from some serious enhancements to navigation. Would be awesome if the Amazon Music app could cast to the FireTV stick and could be used as a remote. Navigating artists alphabetically with the remote is terrible. Playlists are acceptable.Value 5/5 - I got this when it initially went on sale for $10 off. It's been a good product. I have both a Chromecast and Roku as well, and this has features I like and others I don't enjoy.Overall 4/5 - Having a remote with a dedicated pause button is the biggest win this gets over chromecast (besides streaming Prime Video), but otherwise, nothing has really wowed me in comparison.Note: I plug my device into the USB port of my TV, and it works fine. I had more trouble with WiFi connectivity when using the included adapter. I think this is merely coincidence rather than causation, though.", "verified": true, "helpfulness": "0/0", "author": "Jon O"}]