[{"rating": 5.0, "review": "Best thing I every bought I also got the box and there both good if you ant got $100 to buy the box buy the stick it's just as good", "verified": true, "helpfulness": "0/0", "author": "russ"}, {"rating": 5.0, "review": "I love my Fire TV Stick. I like the movies, great selection but the music selection is even better. My niece and I spent a whole evening just listening to the different playlists and believe me there are tons!! Best product I've purchased in a long time and well worth the money. Not to mention that with Prime I don't pay shipping fees for purchases. It's awesome! Way to go Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Genny"}, {"rating": 5.0, "review": "We're having a great time with it! Easy to use and everything at our fingertips.", "verified": true, "helpfulness": "0/0", "author": "Anna Chavez"}, {"rating": 5.0, "review": "Five stars for price, ease of use, and program accessibility. Bought it from an Amazon rep at local Fred Meyers. Best $39 spent for entertainment!", "verified": true, "helpfulness": "0/0", "author": "flatfield"}, {"rating": 5.0, "review": "Works great I'm impressed", "verified": true, "helpfulness": "0/0", "author": "luke mcwilliams"}, {"rating": 5.0, "review": "Works great and it has tons of movies an stuff when I get tired of netflix", "verified": true, "helpfulness": "0/0", "author": "nick hoagland"}, {"rating": 5.0, "review": "No need for a cable bill when you've got one of these!!", "verified": true, "helpfulness": "0/0", "author": "Renee Levin"}, {"rating": 5.0, "review": "Definitely buying another for my home in Jamaica", "verified": true, "helpfulness": "0/0", "author": "Ziddy"}, {"rating": 3.0, "review": "It is an ok device. I bought it when it was heavily discounted (around $20 I believe), and that's about what it is worth to me. Now that it allows access to HBO GO and I've owned it for around 6 months, I feel like I can give it a fair review.First, it was easy to install and easy to connect to the wireless network. I like that it comes with a remote which some of the other \"sticks\" don't offer. Amazon Prime (and Amazon non-Prime) content is heavily featured, but the search mechanism also includes results from other applications.As for content, I use Amazon Prime, Netflix, PBS Kids, Youtube, Flixster and HBO GO on this device. Everything *except* Flixster and HBO GO works great. HBO GO is ok, but the UI runs very slow right now on my fire tv stick. I am able to view content though if I'm patient. As far as I can tell, Flixster is the only platform available to watch your ultraviolet movies if you have an ultraviolet collection. The application doesn't work very well. I don't want to turn this into a review of that application, but suffice it to say that I go to the bedroom where the Roku 2 is if I want to watch a UV movie.Another big problem for me is the complete lack of any way to watch movies on my \"Disney Movies Anywhere\" account. There is no DMA app, and the other providers (Chrome, Vudu, and ITunes) also don't have an app. I was able to watch 1 DMA movie on Youtube, but that has since been disabled apparently (by Amazon or Google, I don't know).For a streaming digital device, the inability to access paid digital content defeats the purpose and completely ruins the device for me. I realize this is an Amazon device and if you only purchase movies from Amazon, it will probably work for you. I don't want a device that locks me into 1 provider though when there are other options available.Another somewhat annoying problem is that the remote sometimes \"sticks\" when I push an arrow key. So instead of fast fowarding by 5 seconds, it goes 10 minutes ahead as if I held the button down for 10 or 20 seconds. That is just a minor inconvenience though. Occassionally, the stick freezes up or \"gets confused\" and I have to unplug it and plug it back in, but that is also a minor issue for me.If the fire tv stick had a VUDU application which allowed access to UV and DMA movies, it would be a 5. If my Amazon account connected with my Ultraviolet and DMA account, it would also be a 5. For now, I'd say to skip it and go with a roku. My roku 2 is still going strong and I prefer it much more than the fire tv stick. That said, if you don't need access to your ultraviolet or DMA account, it is a decent device at a decent price. If you've never used a streaming device before and have an account with Amazon Prime and/or Netflix, it should do the job for you.", "verified": true, "helpfulness": "1/2", "author": "Zack M"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Robert A Casper"}]