[{"rating": 5.0, "review": "This is a great product and much better than others that require a computer hookup. No issues so far. Hookup was easy and it is speedy over my internet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Honestly, within minutes of connecting to my WIFI it commenced to disconnect from it...over and over and over again.If my iphone 6 disconnected, then it would connect easier, but still was slow.My media PC streams movies and live TV flawlessly, so I am 100% confident it's not a network speed issue.", "verified": true, "helpfulness": "0/0", "author": "Clint"}, {"rating": 5.0, "review": "Great buy, this basically turned my old tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Rodney"}, {"rating": 4.0, "review": "Everybody, if you are looking for a live TV feature, it doesn't come with the box. Go to the App Store and download Sling TV. It's basically like Netflix, except it's live TV. It is $20 a month, which is the only downside.", "verified": true, "helpfulness": "0/0", "author": "Drake Vostrejs"}, {"rating": 1.0, "review": "It is taking wayyyy too long to ship I ordered this product 3 days ago", "verified": true, "helpfulness": "0/0", "author": "kaleb"}, {"rating": 1.0, "review": "DIRECT TV subscribers BEWARE!  Cannot activate premium Fire TV Apps for easy viewing.  Amazon Fire TV does not recognize DIRECT TV customers. Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Todd Carlin"}, {"rating": 5.0, "review": "Best decision I've ever made! I got rid of cable and signed up for Hulu and Netflix. If you mainly watch tv at night or on the weekends do yourself a favor... Save $100 per month and go with a fire tv stick. The only thing I'm going to miss is the NFL package but directv was just out of control expensive.", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 5.0, "review": "Loving it", "verified": true, "helpfulness": "0/0", "author": "Andrea Goldberg"}, {"rating": 5.0, "review": "The best! I love that you don't have to watch via your computer or tablet. It connects direct through your internet and you control it with the remote provided or your phone. I bought the Cromecast stick first. You can really only play Netflix and YouTube. The worst part is you have to go through your computer. It would never pause or stop when you want it to. I ended up unplugging it to get it to stop. The Fire TV remote makes the product superior than the Google version.  Amazon Fire TV stick is the way to go. I'm not sure about Apple TV, but it costs a lot more and does about the same as the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Heather Eve"}, {"rating": 5.0, "review": "Works great so far!", "verified": true, "helpfulness": "0/0", "author": "Twig J. McKinney"}]