[{"rating": 5.0, "review": "Easy set-up. Easy to use. Fast. Way cheaper than buying a slow smart tv or having to turn on a blu-ray to access wifi.", "verified": true, "helpfulness": "0/0", "author": "Bendy Rivera"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick has opened a great big world of quality TV.  The only caveat I have is it is not as easy to install as the directions lead you to believe.  After a chat with a FIOS tech, I was able to unlock the secret and was up and running and I am very glad I stuck it out.", "verified": true, "helpfulness": "0/0", "author": "Anne Perzeszty \"Brooklyn Reader\""}, {"rating": 5.0, "review": "We are loving our Fire TV Stick.  Finally cut the cord with the cable company and will not go back. Enjoying all the movies available to us as Prime members.  We've added Hulu to further customize our viewing choices.  Works great with many additional apps.", "verified": true, "helpfulness": "0/0", "author": "Janet B."}, {"rating": 5.0, "review": "I enjoy it very much", "verified": true, "helpfulness": "0/0", "author": "melinda s laird"}, {"rating": 1.0, "review": "Will not stay connected to WiFi", "verified": true, "helpfulness": "0/0", "author": "Mike Lane"}, {"rating": 5.0, "review": "If I had known I could watch the WWE Network on it I would have bought it sooner! I LOVE this thing. I have a subscription to Amazon Prime, WWE Network, HBO Go, Netfilcks, and a few others. I can watch them all on my TV with this stick. I have it hooked up on the TV in the bedroom, But when there is a WWE pay per view on, we move it to the living room for viewing in there. We used to have to run a cable from the computer to the TV to watch the WWE Network on the TV, but not anymore. Now we just plug in the stick and we're good to go. It's super easy to install, super easy to get it started out of the box and super easy to move from one TV to another. I'm not crazy about the game apps available on it. I put a couple games on it and ended up deleting them. But I do LOVE the music. I transferred all of my MP3s from my computer to my stick. Many of them show the words on the screen as they play just like karaoke. My son just LOVES this. He puts on my music and goes crazy singing and dancing. I'm sure there are more features I haven't figured out yet. But the more I play with it, the more I absolutely LOVE it. I'm not a techie, and my main concern was that it was going to be difficult to get set-up and to use. But it arrived with all of my Amazon info already loaded on it, and I was watching Prime movies on it 10 minutes after taking it out of the box. Also, it is a pre-order deal. When I ordered it, I wanted it NOW and was not happy that the expected ship date was a month out. But it got moved up, and I had it within a week of ordering. I assume the pre-ordering was so that they could pre-load my info on it, which was totally worth the week's wait. All I can say is I used to watch Prime movies and TV shows on my computer. I used to watch HBO Go and WWE Network on my computer, or I had to run a cable from the computer to the TV to watch on the big screen. Now I watch it all directly on my TV using just this tiny little stick and I couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Jenn Reed \"Jenn Reed\""}, {"rating": 3.0, "review": "Pretty good ,but not as many apps as I would've liked.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Simple and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Daamin"}, {"rating": 5.0, "review": "It is surprising that you can get so much in such a small package. I really like the ability to search by voice although you have to order a separate remote for that function. It was very easy to set up and apparently you can take it with you and plug it in to anymTV with an HDMI outlet. Much cheaper than the box set, and works very well.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Matthews"}, {"rating": 4.0, "review": "For some reason,it is not very easy to navagate.  I wish it had a shortcut button on the remote for netflix and Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "J. Wolfe"}]