[{"rating": 5.0, "review": "Simply put. The best thing I've purchased.", "verified": true, "helpfulness": "0/1", "author": "Canglemyer"}, {"rating": 5.0, "review": "Was leary when I purchased this, as I already have Netflix, and didnt know that this would provide much that I couldnt already get. Boy, was I wrong. If it wasnt for some new series that I love on Netflix, it would be history. This is my go to product for series and movies.  Well worth the price, since all programming on it is included with your Prime subscription.", "verified": true, "helpfulness": "0/1", "author": "ZonovX"}, {"rating": 5.0, "review": "Fire stick is GREAT. Pops into my TV and easy setup, it is SO EASY. Took only a few minutes to get so many movies. Thank you  AMAZON!!!", "verified": true, "helpfulness": "1/2", "author": "Ira"}, {"rating": 5.0, "review": "We love this product!! Our family now has two of them. Awesome!!", "verified": true, "helpfulness": "1/2", "author": "Della Naese"}, {"rating": 5.0, "review": "BUY IT, STOP READING THE REVIEWS!!!", "verified": true, "helpfulness": "1/2", "author": "KoKuTanLuFi"}, {"rating": 5.0, "review": "Straight up love it... 5 stars all day 😆", "verified": true, "helpfulness": "1/2", "author": "missboss25"}, {"rating": 5.0, "review": "I cancelled cable because the bill kept going up and getting less... So I ordered the Firestick for the Netflix, hulu, and my Amazon prime. Absolutely love it and so easy to use. Plan on getting another one for the guest bdrm. The quality of the pictures are clear and I think actually comes in better than cable.", "verified": true, "helpfulness": "2/3", "author": "superpee Susie"}, {"rating": 1.0, "review": "Does not work as good as the other Amazon stick I used before. For some reason it is very slow. I would highly appreciated if I receive a new one and better one", "verified": true, "helpfulness": "0/2", "author": "tim"}, {"rating": 4.0, "review": "Love it.. Btter than the bigger counter part..perfect size perfect product", "verified": true, "helpfulness": "0/1", "author": "Jerry"}, {"rating": 5.0, "review": "Love the Fire TV Stick!", "verified": true, "helpfulness": "0/1", "author": "Tami Davison"}]