[{"rating": 5.0, "review": "I got the fire stick to go on a second TV because we have Prime and the kids watch their own programs.  It is a lot easier to use the home theater on the main TV.  May have to get a second fire stick to replace that.  Amazon had also set up prior to delivery so it was a plug and go.", "verified": true, "helpfulness": "0/0", "author": "Norma Lindsey"}, {"rating": 4.0, "review": "I'm worried that it gets so hot after only just 30 minutes of streaming. But no problems so far. No freezing, no excessive buffering, great picture quality. Just wish it had an off button. Seems like a waste of energy.", "verified": true, "helpfulness": "0/0", "author": "Marc"}, {"rating": 3.0, "review": "The FireTV stick is great if you have a cable subscription. For someone who doesn't have cable (like me), it's not user friendly. I was hoping for ABC and CNN (amongst other apps) – but as I don't have a cable subscription, it's pointless. The FireTV is amazing quality, and I know they have potential. If Amazon were to set up a deal with all the big content providers so we can watch everything without cable, BAM.Also, you need Prime for this. Without Prime, it's pointless!", "verified": true, "helpfulness": "0/0", "author": "Josh K. \"Josh Kallmeyer\""}, {"rating": 5.0, "review": "My only complaint is that it can't use the USB port on my TV for power, which is minor.", "verified": true, "helpfulness": "0/0", "author": "The Monkey King"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Kathy W. Barker"}, {"rating": 5.0, "review": "Fire TV Stick + Plex = best media streaming out there.", "verified": true, "helpfulness": "0/0", "author": "Philip J Doll III"}, {"rating": 2.0, "review": "This is a pain to use. First my TV, a Samsung UN60D8000 would boot up on my normal signal from Verizon on HDMI1 and they switch over to the stick on HDMI4 without me doing anything. I had Samsung help deal with it but they had no solution. But, hours later it stopped doing that. But, then I found that when I switched inputs to get to the stick my TV showed a blank screen and I had to power down and back up before it would go to the stick. Real pain. I got this to watch Bosch but now that I've done that I won't be using it any more. Too much of a pain and I can get Netflix and others through Samsung's apps on the TV. Wasted $40 and I'll be cancelling the free trial of Prime.About the only time I see myself using the stick is if Amazon ends up producing another Bosch story, or some other equally good movie.", "verified": true, "helpfulness": "0/0", "author": "Plano Mike"}, {"rating": 5.0, "review": "The ease of use is awesome.  I had hoped to see more opportunity for Prime movies than I have.  Seems to be only a few.  Since we love to watch old movies, I thought a lot more good ones would be available.", "verified": true, "helpfulness": "0/0", "author": "Katherine Bell"}, {"rating": 5.0, "review": "This little baby is awesome!", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Great product great price", "verified": true, "helpfulness": "0/0", "author": "Earl A Leahey Jr"}]