[{"rating": 5.0, "review": "Enjoying the ease of watching shows I've not had access to! Set up and use is SO simple!", "verified": true, "helpfulness": "0/0", "author": "Cyndi Daman"}, {"rating": 4.0, "review": "My daughter loves it.", "verified": true, "helpfulness": "0/0", "author": "Junebug"}, {"rating": 3.0, "review": "Would not work on my 40\" 4 year old tv.", "verified": true, "helpfulness": "0/0", "author": "Sherry"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "sheila spencer"}, {"rating": 1.0, "review": "Well, I guess my bad for not doing the research. Bought this fire stick to take to my summer home in Canada only to discover it is not licensed to work here.", "verified": true, "helpfulness": "0/0", "author": "Judy Redd"}, {"rating": 1.0, "review": "We've now had this item for 6 weeks, and we have had issues with it from the get go. We thought at first that it was our TV or internet connection; however, after extensive trial and error, the issue lies within this device. Every minute or two after the device powers on, the display goes out and the tv no longer recognizes that the device is plugged in. We have used both the HDMI adapter and just plugging the stick into the TV itself. There is definitely something wrong with the HDMI connection. I understand that these things happen, so we were just hoping to get a replacement. Unfortunately, the customer service is HORRIBLE. The device has a 1 year warranty; however, when I call, I just get transferred to 5 different people who all ask me the same questions and try to diagnose the issue. Nobody has ever offered to replace the faulty item.", "verified": true, "helpfulness": "0/0", "author": "AE"}, {"rating": 4.0, "review": "This was just delivered. It seems good, having trouble connecting to WiFi in the room I want it in. Nothing else has trouble connecting in that room.", "verified": true, "helpfulness": "1/1", "author": "Sabresfan"}, {"rating": 2.0, "review": "Everything I want to see, cost .........", "verified": true, "helpfulness": "0/0", "author": "Kelvin Garner Sr"}, {"rating": 4.0, "review": "Excellent!!! I have been using this for 2 months and this has been a impressive ways to access unlimited movies, TV shows and songs. i am loving it!!", "verified": true, "helpfulness": "0/0", "author": "Srivaths"}, {"rating": 4.0, "review": "I am still testing this unit out but so far i am pleased with this product. Response is very fast with lots of material to choose from. Expect to make more use of the viewing experience during the winter time. High 5 to Amazon for a really nice product.", "verified": true, "helpfulness": "0/0", "author": "anthony thompson"}]