[{"rating": 5.0, "review": "I love this product, I wish I would of ordered it sooner. The options it offers are awesome. Theirs something for the whole family. Not sure why the game controller takes longer to receive, wish it was part of  two day shipping. Overall it's a great product, especially for prime members. I would recommend this product to everyone.", "verified": true, "helpfulness": "0/0", "author": "Jessy"}, {"rating": 4.0, "review": "I like my Roku better but I like the fact that this is so portable.", "verified": true, "helpfulness": "0/0", "author": "grapes911"}, {"rating": 5.0, "review": "Love it... Kids get to watch all their favorite shows", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "For $40 this is a great product.  We use it to stream Netflix and Amazon Prime material. We have had no problems with it at all. So happy with this.", "verified": true, "helpfulness": "0/0", "author": "Lindsay C."}, {"rating": 5.0, "review": "Love it! So easy to pull up and watch my video library plus the recommended choices!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super easy to set up.  Worked perfectly outside US.", "verified": true, "helpfulness": "0/0", "author": "Mary T."}, {"rating": 5.0, "review": "This is very easy to use and we have not have any problems with it.", "verified": true, "helpfulness": "0/0", "author": "Esther Neumann"}, {"rating": 3.0, "review": "good product but the remote is so small i spend more time looking for it in the cushions of the couch and for me the home button is in the wrong place always hit it by accident", "verified": true, "helpfulness": "0/0", "author": "walter"}, {"rating": 5.0, "review": "Easy to use and simple to set up! I should of bought two!", "verified": true, "helpfulness": "0/0", "author": "nicholas correa"}, {"rating": 5.0, "review": "navigation and keypad are a little bit difficult but after you get used to it works nice.", "verified": true, "helpfulness": "0/0", "author": "robert peters"}]