[{"rating": 3.0, "review": "I already have a Smart TV however the apps or limited, so I needed a streaming box. I picked the fire stick as I have a prime membership and can take advantage of the movie/music streaming very easily.The problem with this stick is the storage. I loaded two apps (DS Video and DS Audio for my Synology NAS) and now only have 300mb of space left. I can not delete any apps to free up space and can't see what is using up the 5GBs of storage I apparently have on the stick.I also found the connection a bit wonky at times. Wireless connection stops randomly for the fire stick when it is still running fine for other devices and even other networks through my TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works perfectly.  So much nicer to watch on the big screen versus my Kindle Fire.  Love my Fire and this item just makes it better.", "verified": true, "helpfulness": "0/0", "author": "Gwamma"}, {"rating": 5.0, "review": "Works great and fast and smooth. Remote is very responsive", "verified": true, "helpfulness": "0/0", "author": "paul dermenjian"}, {"rating": 5.0, "review": "Why need cable, this stick is pure awesome! This is definitely the new era of television. All it needs now is news apps for the users local areas.", "verified": true, "helpfulness": "0/0", "author": "Steven Lawrence Hill Sr"}, {"rating": 5.0, "review": "One of the best purchases I have made. It allows me to watch old favorites and new ones any time. The choices on my TV were limited since I and the price to increase them was high. I already was and Amazon prime member so this worked out great. I have a much larger choice of what to watch and it did not increase my monthly bills. I'm not technically inclined and this was EASY to install. I had it up and running in no time and have been enjoying the movies I want to watch since.", "verified": true, "helpfulness": "0/0", "author": "shopper"}, {"rating": 5.0, "review": "Great device. I just loved it.", "verified": false, "helpfulness": "0/0", "author": "R. Beal"}, {"rating": 5.0, "review": "Easy to set up, travel with and it's amazing having everything in one place!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great little gadget and even works with our internet which is really slow.", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "I wish I had gotten this sooner", "verified": true, "helpfulness": "0/0", "author": "Joe DeLauriea"}, {"rating": 3.0, "review": "Doesn't seem to keep up. Cuts out a lot. Moved to a TV we dont use much.", "verified": true, "helpfulness": "0/0", "author": "Scott Robins"}]