[{"rating": 5.0, "review": "Just plug and play. My kids use regularly and works fine!", "verified": true, "helpfulness": "0/0", "author": "Julison"}, {"rating": 5.0, "review": "Love it! Easy to install..remote is ok but there is an app for smartphone that you can control with.", "verified": true, "helpfulness": "0/0", "author": "Shawn's List"}, {"rating": 2.0, "review": "It freezes a lot when I'm watching netflix or hulu or anything really. Sometimes it's just a very quick delay, but still rather annoying. Sometimes the video freezes, but the sound continues. It's a pretty neat little device when it works, especially for only $20, so I'm going to replace it and hope that this one is just defective.", "verified": true, "helpfulness": "1/1", "author": "Matt Pettis"}, {"rating": 5.0, "review": "Cool product. I have been using it for a little while now and have had no problems. Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Harry Stahl"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "LGibson"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Natalia Guida"}, {"rating": 5.0, "review": "I bought this for my daughter for Christmas and she loves it, maybe a little too much.  I don't think we have watched anything other then what is available to Amazon Prime members since Christmas.", "verified": true, "helpfulness": "0/0", "author": "Lynda L. Forvour"}, {"rating": 5.0, "review": "I picked this up after I saw it was on sale for Prime members a few months back. I got an email letting me know I'd get it sometime in January. To my surprise, it showed up at my front door before Christmas. I had picked this up in case I could repair an old TV. That ended up working out and I was able to give a fixed TV and this Fire Stick together for Christmas. Kudos to Amazon for the early ship.On to the Stick itself. I don't have any experience with any of the other HDMI media players (Roku, Apple, Google, etc.) So having no experience with any of the competitors, I have to say this things pretty cool for the right person. For someone who doesn't have cable and wants to watch Netflix, Hulu plus, or uses Amazon for their media purchases, this thing is perfect. If you fit all of the above and don't mind waiting for it to go on sale, even better.The remote works pretty well and I was able to navigate well enough with it. It doesn't do any crazy voice searching or anything, but you can download an app for your smart phone that lets you control AND voice search. I don't have a ton of experience with the app itself, but from what I've use on the Android version, it worked pretty well and didn't give me any headaches.Setting this thing up is pretty easy if you've got a TV made in the last 7 years or so. Basically, you plug in the fire stick to an HDMI port and plug in the power adapter. You'll connect to your Wi-fi network from there and you're all set.I've rented some movies on it, was able to access my stored shows, and downloaded Netflix without any issues. I did have a massive stuttering issue during the tutorial video (which you can't skip) which made the whole thing just an annoying slideshow that took way longer than it needed to. I'm hoping that was just a fluke and not a sign of things to come. If it turns out this stick wants to turn all of my shows into flip book versions, I'll post an update.Time will tell to see how much content comes to the stick. For now, I'm happy that I'm able to watch Netflix and Hulu without having a big box attached on the wall. For the right kind of user, this thing is awesome. For anyone who watches a lot of TV and has cable, uses Apple or Google play store for their media, doesn't have Wi-fi, or (obviously) doesn't have an HDMI port, I'd recommend something else. If you're flexible and want to rent via Amazon or already pay for Netflix, this things great for the money.", "verified": true, "helpfulness": "1/1", "author": "Mick1986"}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Ken Lucas"}, {"rating": 1.0, "review": "I have been using this device for a month and it's horrible. First off it lags like crazy. Shows I watch jump around, lags, freezes and load/buffers a lot. Also I am kicked back to the home screen frequently because of this. And this is not due to my network connection either. I've tried it on several different strong network connections and it does the same thing. And I have also tried the same applications on different devices like Roku LT, Playstation 3, Xbox One...etc and the same applications (Netflix, Hulu) work just fine on those devices. So that rules out my network connection which has a speed of 50/5, more than enough to watch streaming apps.Second, having it powered by USB is awesome but it has a serious flaw. When you power your TV off, what ever apps you were signed in (Netflix, Hulu) will sign you out, and you have to sign back in to them each time you turn your TV back on. This is a serious design flaw. The only fix for this is to plug the device into a power receptacle which defeats the whole purpose of the device being small and mobile.I hate this device and do not recommend it to anyone. The Fire TV does a much better job than this half baked device.", "verified": true, "helpfulness": "17/20", "author": "Kevin D. Furlow \"Toph The Earthbender\""}]