[{"rating": 5.0, "review": "We love it! Now we can watch movies through Netflix and Amazon. It was so easy to setup and simple too use!", "verified": true, "helpfulness": "0/0", "author": "Rose Sorendo"}, {"rating": 5.0, "review": "We got rid of our cable subscription some time ago, and while having Netflix (disks by mail) and a Prime membership helped, it really wasn't the most convenient option since there are two of us and we don't always want to watch the same thing. When the Fire TV Stick showed up as a preorder, the price was so good I decided to give it a go. I'd avoided the Roku due to price, and I hadn't tried the Chrome Stick due to reviews.The Fire TV Stick arrived in time for Christmas and has turned out to be a great little device. It was dead simple to set up (though I do wish the USB cord was one or two feet longer). I switched Netflix from disk to streaming and now we have access to Prime and Netflix for just about all the movies and television episodes we could want. My dad will be able to watch baseball on a large screen now with the MLB app. The only disappointment is the stupid ESPN app which requires a subscription to a cable company to use it - kinda defeats the purpose. That's not the Fire TV Stick's fault though, that's just ESPN/cable company greed.Overall, the \"stick\" has been a huge boon for us. Recently we both came down with the creeping crud and had no energy to do anything. Having access to tons of movies and television episodes through streaming was a sanity saver.", "verified": true, "helpfulness": "0/0", "author": "Lee Dunning"}, {"rating": 5.0, "review": "Awesome for basic use. Use this to watch Netflix and Hulu in my bedroom. Have used it every single night since getting and and not had a single issue.", "verified": true, "helpfulness": "0/0", "author": "Ryan Fruechte"}, {"rating": 5.0, "review": "perfect, no issues!", "verified": true, "helpfulness": "0/0", "author": "Burt Tabora \"Burt Tabora\""}, {"rating": 5.0, "review": "Unbelievable! How does this stuff work? Very convenient and mostly easy to set up. The only glitch I had was that I had to switch the plug in to a different HDMI port, then it was fine.", "verified": true, "helpfulness": "0/0", "author": "Breathe Deeply"}, {"rating": 4.0, "review": "Works great, I've used it in two different televisions, in different parts of the house.The only challenge I had was when using it further from the router, I had a few times where it lost signal. Power cycling it (unplugging the power and re-plugging it in) fixed the issue each time.", "verified": true, "helpfulness": "0/0", "author": "Scoutergreg"}, {"rating": 5.0, "review": "Easy to install. Love it.", "verified": true, "helpfulness": "0/0", "author": "EAS"}, {"rating": 3.0, "review": "why DTV is not available for showtime anytime as a provider? and the EWTN", "verified": true, "helpfulness": "0/0", "author": "dax"}, {"rating": 1.0, "review": "has had connection issues since day one. The router is right across the room and streaming is still. The idea is marvelous, unfortunately the product does not do what is promised. By the way streaming works fine in the entire house with any other device. Do not waste your money!", "verified": true, "helpfulness": "1/2", "author": "Jennifer Mikka"}, {"rating": 5.0, "review": "Good price. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jody Boisen"}]