[{"rating": 4.0, "review": "Easy set up and works great so far. Pretty awesome for the price", "verified": true, "helpfulness": "0/0", "author": "SSJr"}, {"rating": 5.0, "review": "I like the fire tv we have in the other room, I got this for free with sling tv.  The stick was for our guest bedroom, it's better than roku, but spend the extra money and get the fire tv for your main television", "verified": true, "helpfulness": "0/0", "author": "L.S. Hart"}, {"rating": 5.0, "review": "This product has allowed us to consider dropping cable services saving us a huge amount of money on a monthly basis.  The programs are great and I can even listen to my amazon music through it.  I have watched several movies for my graduate degree courses on the device also.  It turned my older Samsung TV into a smart TV for a fraction of the cost!", "verified": true, "helpfulness": "0/0", "author": "Shawn Chisholm \"flitemedic01\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Alan D"}, {"rating": 3.0, "review": "I like what it does but I expected a more.  It should function as a wireless connection between the TV and the computer,  so I can have the computer content on the TV and don't need a separate cable for that purpose.  Instead it apparently only interfaces with amazon devices.  Also despite being in the same room as the main Internet connection, modem a router it keeps losing the network connection.", "verified": true, "helpfulness": "0/1", "author": "Russell Smith"}, {"rating": 3.0, "review": "I had much higher hopes for the fire tv stick.  It tends to freeze and has to be reset.  It also sometimes says that home can't be found and won't go anywhere even when it shows a strong internet connection.  I got a Roku and it works much better.", "verified": true, "helpfulness": "0/1", "author": "cathy"}, {"rating": 5.0, "review": "Good on time delivery.Iam very happy with the product.", "verified": true, "helpfulness": "0/0", "author": "Richie D Johnson"}, {"rating": 5.0, "review": "Will be ordering a second one in the very near future.", "verified": true, "helpfulness": "0/1", "author": "Happy"}, {"rating": 5.0, "review": "Easy to install, great connectivity!  Much better than Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Angelica M. Silvero"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Hussein Zaza"}]