[{"rating": 4.0, "review": "Good product, good value, No surprises and easy to install. I would recommend it.", "verified": true, "helpfulness": "0/1", "author": "Anthony D Serva"}, {"rating": 5.0, "review": "Love it.  Price is awesome and I can imagine why everyone wouldn't have one or two of these.", "verified": true, "helpfulness": "0/1", "author": "Jennifer M"}, {"rating": 5.0, "review": "This is great! I am a PRIME customer and have been for years. Love the convenience of getting my prime benefits on my flatscreen. This adds tremendously to my Uverse cable.  I actually shop the best rental prices between ATT's Uverse and Amazon for movies.", "verified": true, "helpfulness": "0/1", "author": "HTurner"}, {"rating": 4.0, "review": "Easy", "verified": true, "helpfulness": "0/1", "author": "John briggs"}, {"rating": 4.0, "review": "It was hard getting used to it. But my kids figured it and now they are enjoying using it for watching movies and playing games.", "verified": false, "helpfulness": "0/1", "author": "Azza"}, {"rating": 4.0, "review": "When I first tried to use the Fire TV Stick it was sticky. My 5 year old came to stay with us and let me know that my internet was slow. He said \"your internet is bad really bad\". After my grandson went home I called my internet provider, they sent out a technician, now my Fire TV Stick works very well. I am still learning what it can do.", "verified": true, "helpfulness": "0/1", "author": "Ken \"Ken\""}, {"rating": 3.0, "review": "WiFi, buffering issues due to low memory and bloated preloaded apps", "verified": true, "helpfulness": "0/1", "author": "Eric H."}, {"rating": 5.0, "review": "Great especially if you don't have a smart TV. Love the fact that it has a remote control but if you misplace it you can use the app to control it. You definitely need to be a prime member to make the most of it.", "verified": true, "helpfulness": "0/1", "author": "Brooklyn79 \"Ricardo R\""}, {"rating": 5.0, "review": "Worked like they said.", "verified": true, "helpfulness": "0/1", "author": "Martin Pitsitck"}, {"rating": 5.0, "review": "Not sure don't know how to use it", "verified": true, "helpfulness": "0/1", "author": "june  heefner"}]