[{"rating": 5.0, "review": "Dropped cable, went to slingtv @$20 per month but samsung does not have sling app so I paid for 3 months of sling and got free fire stick which does have the sling app. Has all the cable stations my wife and I usually watched. Fire stick works great and I love its integration with Amazon.works perfect for all our needs. Clear menus and fast response on my samsung 4K tv. Great product for what it does.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "exellent", "verified": true, "helpfulness": "0/0", "author": "Tyndorf Sylwia"}, {"rating": 1.0, "review": "Choppy no where near the quality of the Roku Stick.", "verified": true, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 5.0, "review": "Love it, love it, love it", "verified": true, "helpfulness": "0/0", "author": "Kristal Adams"}, {"rating": 5.0, "review": "This stick is much more user friendly than using an android tablet as a streaming device.", "verified": true, "helpfulness": "0/0", "author": "phil samuelson"}, {"rating": 5.0, "review": "great product east to set up and use", "verified": true, "helpfulness": "0/0", "author": "larry adams"}, {"rating": 5.0, "review": "Fire Stick is great!  My wife loves it.", "verified": true, "helpfulness": "0/0", "author": "mario"}, {"rating": 4.0, "review": "Most of the time, however I find if I pause for extended period, and go back it will freeze up. Then I have to re-boot by holding center button and (Play-Pause Button) That is frustrating. Other than that, it works the way I want it to with my \"Prime\" movies and Netflix. I'm glad you have the trouble shooting available so many of these problems are easily solved.", "verified": true, "helpfulness": "0/0", "author": "Bonnie \"BJS\""}, {"rating": 5.0, "review": "Love!", "verified": true, "helpfulness": "0/0", "author": "Christina ann kidd"}, {"rating": 1.0, "review": "I'm not really inpressed at all with the fire stick.  I have a roku as well and I have found the fire stick more complicated with less viewing content.  I have it stored in a box.", "verified": true, "helpfulness": "0/0", "author": "B. Armstead \"keyrup\""}]