[{"rating": 4.0, "review": "Loving the Firestick so far! And this week I canceled my cable! Ha! There are some usability issues with the remote/screen display - like the ability to sort within your Wishlist by Prime, Genre, Newly added, etc. I do wish there were more free movies, however I love how many classics there are that I can rent for $2.99-$4.99! Overall it was easy peasy! Great buy & I am gonna buy a 2nd one for my bedroom TV!", "verified": true, "helpfulness": "0/0", "author": "nmshopgirl"}, {"rating": 4.0, "review": "has lived up to expectatiions", "verified": true, "helpfulness": "0/0", "author": "Edward Abbott"}, {"rating": 5.0, "review": "I bought this at Best Buy and got a bundle deal with a HDTV leaf antenna, Mainly got this for Netflix so did not sign up for Amazon Prime but you do need an Amazon account just to use Netflix or other apps. Netflix has everything I need except for Game Of Thrones (HBO Now is coming to fire stick in a couple of weeks) lots of other apps also like Hulu Plus etc. The stick works well and set up was a breeze it even had a tutorial video which was nice. Buying one of these and HDTV antenna for local stations was the best thing I did to cut cable and highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Awesome!!!!!", "verified": true, "helpfulness": "0/0", "author": "Gyorgyi E Mezovari"}, {"rating": 5.0, "review": "I love it. Works great !", "verified": false, "helpfulness": "0/0", "author": "Dianne Schwartzkopf"}, {"rating": 5.0, "review": "Fast and awesome.", "verified": true, "helpfulness": "0/0", "author": "Lester,J"}, {"rating": 5.0, "review": "Ok!", "verified": true, "helpfulness": "0/0", "author": "Diego Vellaio"}, {"rating": 5.0, "review": "Very easy to set up! I might even like it better than the Apple TV. Unfortunately, we have apple products so the main TV has the Apple TV and the others have the fire stick. The fire stick doesn't buffer as much and just seems to run smooth.", "verified": true, "helpfulness": "0/0", "author": "Angela Vasquez"}, {"rating": 5.0, "review": "This is my second Fire TV Stick. I UAE it on a secondary tv.  It works well, as I've come to expect from my first one.", "verified": true, "helpfulness": "0/0", "author": "R. J. King"}, {"rating": 5.0, "review": "The fire stick with Kodi.tv side loaded makes this an awesome device", "verified": true, "helpfulness": "0/0", "author": "CM"}]