[{"rating": 5.0, "review": "Easy to use and provides lots of new  viewing and listening opportunities!", "verified": true, "helpfulness": "0/0", "author": "Charlotte Aiken"}, {"rating": 3.0, "review": "Didn't realize that you can't search the web to watch free web shows.  Really would like to see an outdoor channel (like Carbon TV) since this is what my husband likes to watch.  If the reviews comparing Fire TV and Chromecast would've made it clear about the web shows not being available - I would've bought the Chromecast", "verified": true, "helpfulness": "0/0", "author": "Lori E"}, {"rating": 5.0, "review": "We love it!  Easy to set up, absolutely amazing", "verified": true, "helpfulness": "0/0", "author": "Debra M Fields"}, {"rating": 5.0, "review": "I love this thing ! Soon good bye cable 🐒", "verified": true, "helpfulness": "1/1", "author": "Bill A. Brown"}, {"rating": 4.0, "review": "Works great I love it! Would recommend.", "verified": true, "helpfulness": "0/0", "author": "charla cain"}, {"rating": 4.0, "review": "One major complaint...We are unable to watch anything on CBS unless I connect my Kindle to the TV.", "verified": true, "helpfulness": "0/0", "author": "mjrose26"}, {"rating": 5.0, "review": "I am completely useless when it comes to technical stuff.  Truly.The setup for the Fire TV stick was clear and so easy I couldn't believe it.  I have not explored all of the opportunities that are available to watch, but have enjoyed Prime video - movies and TV shows.This is excellent, I couldn't give a better review.", "verified": true, "helpfulness": "1/1", "author": "Deborah Way"}, {"rating": 3.0, "review": "Well, a work in progress.  But so far,kinda cool. Okay so update.  I like the service, but this thing keeps happening.  My service keeps shutting down and telling me that my wi-fi access is great but that my connectivity to amazon is bad.  So then I have to reboot my computer, and then everything is fine.  This has happened almost everyday that I have had the firestick connected to my computer.  I like the service and I like it connected to Prime, but please, figure this out.", "verified": true, "helpfulness": "0/0", "author": "Greg T Long"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Grim Sorrows"}, {"rating": 5.0, "review": "works fine", "verified": true, "helpfulness": "0/0", "author": "Marilyn Lee Baranyi"}]