[{"rating": 5.0, "review": "Great Product... Definetly will buy again", "verified": true, "helpfulness": "0/0", "author": "Jose Romero"}, {"rating": 5.0, "review": "Great little gadget. Easy to install and use. I love the remote.", "verified": true, "helpfulness": "0/0", "author": "Gratis"}, {"rating": 4.0, "review": "Very simple to install and use . I would recommend it  .", "verified": true, "helpfulness": "0/0", "author": "ariane \"ariane\""}, {"rating": 2.0, "review": "I was disappointed with it. It looks like a pen drive but it needs to be plugged in (all the time - not just for charging), which is very inconvenient. I wanted something cordless and instead I added to the wire mess I already have.", "verified": true, "helpfulness": "1/3", "author": "ShoppingGirl"}, {"rating": 5.0, "review": "Very easy to install and operate!!", "verified": true, "helpfulness": "0/0", "author": "Frances"}, {"rating": 5.0, "review": "Met expectations.  We are now able to watch Netflix on TV that is not a \"smart TV\".  Device offers other TV options, Amazon Prime, etc.  The device is very easy to install and operated with a remote.  We have no regrets at all with Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Frances"}, {"rating": 3.0, "review": "I've owned the Fire TV Stick for over six months, and it's just ok.  My biggest complaint is that the picture stutters when watching with subtitles on.  I only watch certain shows with subtitles (for example True Detective season 2... just to have a chance at understanding what was happening). The picture then freezes momentarily at least once per second.  When I want to use subtitles, I switch to my older apple TV.  I should not have to do that.The interface is a little unnecessarily complicated.  The categories on the main page contain both individual recent shows, as well as recent apps, all mixed together.  The icons are both square and rectangular.  There is a category called Recent apps, and when you click on an app like Netflix, it displays an information page on the Netflix app containing descriptions and ratings, etc.  Then you click ANOTHER button to open Netflix, why is this necessary? Just open Netflix.Seems a bit over engineered.  However for 30 bucks it's nice to be able to watch Prime content on my TV.", "verified": true, "helpfulness": "0/0", "author": "J Fisher"}, {"rating": 5.0, "review": "This is the best and most versatile tv addon in the world. Very fast and easy to upgrade.", "verified": true, "helpfulness": "0/0", "author": "vato"}, {"rating": 5.0, "review": "Easy set up.  Exceeded expectations.  No issues.", "verified": true, "helpfulness": "0/0", "author": "Willard Paul"}, {"rating": 5.0, "review": "It's awesome! !", "verified": true, "helpfulness": "0/0", "author": "Jim Caldwell"}]