[{"rating": 4.0, "review": "I am very pleased with the firestick. So far I have only used it for movies, but will be exploring it for other goodies.", "verified": true, "helpfulness": "0/0", "author": "Paul X. Geary"}, {"rating": 5.0, "review": "fire stick is the  bomb.", "verified": true, "helpfulness": "0/0", "author": "R. Shaw"}, {"rating": 3.0, "review": "very cool device that is super user friendly and full of awesome apps... but for some reason it will not work in the room down the hall from the wireless router bur works fine in the same room as the router. The Internet will not work even with a good connection. All my other wifi devices work fine. would love to change my review if there is a known good fix for this.", "verified": true, "helpfulness": "0/0", "author": "Matthew Goodwin-Mitchell"}, {"rating": 3.0, "review": "Great stuff!!", "verified": true, "helpfulness": "0/0", "author": "Justin Cheng"}, {"rating": 3.0, "review": "okay", "verified": true, "helpfulness": "0/0", "author": "Karima Gari"}, {"rating": 1.0, "review": "Bought it originally because it said it supported Miracast. Doesn't work with my computers, doesn't work with my Samsung tablet.Even if it did work, the experience is totally broken and awkward, requiring you to go into settings each time to activate it.", "verified": true, "helpfulness": "0/0", "author": "Maneki Neko"}, {"rating": 4.0, "review": "Very easy to get started.  The interface is a little sparse, but everything good takes some learning.  Picture is very clear.  I think we will like it.", "verified": true, "helpfulness": "0/0", "author": "D Peacock"}, {"rating": 3.0, "review": "It's a great device. Once I hooked it up I notice freezing. Other than that I like the device for myself.", "verified": true, "helpfulness": "0/0", "author": "Kristine Dubose"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Alexis Quijas"}, {"rating": 5.0, "review": "Very easy to install and use. Great variety of everything you want to watch! Even popular new releases!", "verified": true, "helpfulness": "0/0", "author": "Cynthia Rabe"}]