[{"rating": 5.0, "review": "Love my Fire Stick. We ended up buying it at Best Buy since it wasn't in stock through Amazon. We haven't had any issues with the Wi-Fi as others have reported. Netflix does freeze occasionally but we have Amazon Prime so we mostly stream Prime Videos. My only complaint is that I feel like browsing on the TV is pretty limited. I find it easier to look at the Prime video available online and then add it to my to-watch list.Aside from Prime Video - we love the Vevo app for watching videos. It's almost like MTV is back (like what we old folks remember from the 80s and 90s.) I love the photo slide show. I have my phone set up to upload all my pics to the Amazon Cloud and then I can set the tv to play a slide show of all my pics. And we also use the tv as a \"radio\" and stream Pandora. We've already gotten a lot of use out of the fire stick. It's pretty awesome.", "verified": true, "helpfulness": "0/0", "author": "J. Harding"}, {"rating": 5.0, "review": "The fire stick is wonderful.  It was easy to install (my son says), arrived as promised and the remote and instructions were easy.  He did have a little difficulty sliding the back cover off the remote.  And be sure to have triple AAA batteries on hand because they weren't included.  However, everything went fine and I'm glad I ordered it.  As a matter of fact, I'm going to order a second one for the bedroom because I'm not tech savvy enough to remove and install in different rooms.", "verified": true, "helpfulness": "0/0", "author": "lili"}, {"rating": 5.0, "review": "Great product. Extremely easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Dimosthenes Valkanos"}, {"rating": 4.0, "review": "I love it, I can get all my shows without having to go out and buy a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 5.0, "review": "Excellent  product", "verified": true, "helpfulness": "0/0", "author": "George Weeks"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Joseph Brownfield"}, {"rating": 5.0, "review": "the Fire TV Stick is great to have.  Love watching Netflix, Amazon and other shows that I could only watch on my computer.", "verified": true, "helpfulness": "0/0", "author": "R. Scott"}, {"rating": 5.0, "review": "Since I have Amazon prime it is the best choice for me. It also has alot of different options for me if I want to go that way.", "verified": true, "helpfulness": "0/0", "author": "Matthew Panks"}, {"rating": 4.0, "review": "Pretty handy little device that can make a \"non-smart\" tv \"smart\". It is not just a stick though, which is kind of misleading. You have to use an adapter and you also have to plug it into the wall. Came with a free month of Netflix which is nice. Overall, it was worth the money.", "verified": true, "helpfulness": "1/1", "author": "Nicholas Jones"}, {"rating": 5.0, "review": "Love it !!!!watch Netflix etc and its easy to use", "verified": true, "helpfulness": "0/0", "author": "Jason Dempsey"}]