[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Karen Ann Wieland"}, {"rating": 5.0, "review": "Love it awesome little device.", "verified": true, "helpfulness": "0/0", "author": "Mr.Chris Healy"}, {"rating": 5.0, "review": "My wife and i love the fire stick. We used the fire stick while on vacation. We connected the stick to our hotel tv snd watched orange is the new black all 3 nights. If you have access to free wifi @ your hotel I recommend you take it. Overall we love our amazon fire stick", "verified": true, "helpfulness": "0/0", "author": "Andre King"}, {"rating": 5.0, "review": "One of my best purchases.  Very happy with the purchase and service.", "verified": true, "helpfulness": "0/0", "author": "Glenn England"}, {"rating": 5.0, "review": "great  love it especially for music", "verified": true, "helpfulness": "0/0", "author": "barbara stanbrough"}, {"rating": 4.0, "review": "Good for on-demand TV viewing. I was expecting a bit more selection with Prime membership...", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "We've owned and used the Fire TV Stick for several months. It has worked flawlessly on all of our TVs. The only limitation we have noticed is some shows or series are not included with our Prime membership, which is to be expected. Even so, the availability of programming is impressive and we are totally satisfied with our $39 Fire TV purchase as well as our $99/year Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Running Man"}, {"rating": 1.0, "review": "Premier internet package...yet, frozen screens, CONSTANT buffering. Beyond obnoxious. Switch HDMI ports occasionally to get about 10 min of uninterrupted streaming. Thanks god this was a gift and I didn't waste my own money.", "verified": false, "helpfulness": "0/0", "author": "Shaun B"}, {"rating": 4.0, "review": "Slick. Easy. Especially good for older flat screens. If you're a prime member there are some things to watch. Otherwise, prepare to be nickeled and dollared on every episode of every show.", "verified": true, "helpfulness": "1/1", "author": "E Fry"}, {"rating": 3.0, "review": "Amazon needs to get more/better movies!  A waste.", "verified": true, "helpfulness": "0/0", "author": "Corey R"}]