[{"rating": 5.0, "review": "Very cool device. I  don't have a smart tv and was connecting my pc to my tv for many of the fire stick options. The  convenience of it along with the remote has been a welcomed upgrade to my old option.", "verified": true, "helpfulness": "0/0", "author": "daniel birmingham"}, {"rating": 5.0, "review": "I love it I haven't had no problems with it", "verified": true, "helpfulness": "0/0", "author": "giannina"}, {"rating": 5.0, "review": "Fantastic!!!!  We have two Samsung Smart TV's and are using this instead for Netflix streaming.  It does pretty much everything faster - cache, fast forward/rewind/scroll, etc.  I highly recommend getting one of these, we couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Matt L."}, {"rating": 5.0, "review": "easy to use and the Amazon prime exclusives are really good", "verified": true, "helpfulness": "0/0", "author": "Eileen Rae"}, {"rating": 5.0, "review": "Love it. Greatest product I ever used !!! Beats all other devices in the market. I Highly recommend it AAA+++", "verified": true, "helpfulness": "0/0", "author": "Jack naj"}, {"rating": 5.0, "review": "What a great way to stay connected.  I have Amazon Prime and Netflix - just plug this in and you are connected to a world of movies, TV programs and much, much, more!  We play games, watch old TV series and catch up on Movies we like to watch.  It is portable and very easy to use.  Price point is cheap and sales are incredible for it.", "verified": true, "helpfulness": "0/0", "author": "kirstinbe \"kirstinbe\""}, {"rating": 5.0, "review": "Best!!", "verified": true, "helpfulness": "0/0", "author": "Stacey-Ann Shaw"}, {"rating": 3.0, "review": "This is no Apple TV. The available apps are limited, but the Fire stick does the job well.", "verified": true, "helpfulness": "0/0", "author": "John Vargo"}, {"rating": 1.0, "review": "Bought for Hulu app, does not work.", "verified": true, "helpfulness": "0/2", "author": "aimee m lalande"}, {"rating": 5.0, "review": "Only have had it for a few days but we LOVE IT! So many cool features and we can play Sling TV through it, which was the main reason we bought it!", "verified": true, "helpfulness": "0/0", "author": "Jacquelyn"}]