[{"rating": 5.0, "review": "Love it! I use it in my bedroom, so while I don't use it a lot it was the perfect choice. Once(if) they sync with vudu or add on vudu as an app it will be perfect. Still, best option available for its size.", "verified": true, "helpfulness": "0/0", "author": "Nena Hug"}, {"rating": 5.0, "review": "I bought this product to replace using my xbox 360 all the time, I didn't have a high expectancy or anything fancy of it, as I also own a chromecast. While the chromecast is good this is fantastic in comparison. I absolutely love that it has a remote which was my primary buying point, it looks fantastic, plays netflix well and is tiny and doesn't require a block that sits next to my tv! I am absolutely in love with it.My only complaint is the video at the beginning you're forced to watch, my recommendation if you are okay with figuring out devices on your own, just walk away go make a sandwich, cup of tea or something else.", "verified": true, "helpfulness": "0/0", "author": "David Fletcher"}, {"rating": 4.0, "review": "Excellent product. I have two fire tv consoles and this works as well as they do (which is awesome).", "verified": true, "helpfulness": "0/0", "author": "mrjoeyman"}, {"rating": 2.0, "review": "Can't stay connected to Wi-Fi.  When it started up, it readily found my network (I have been running my own home/office networks since there were done on coax cable, so I know how to make Wi-Fi work, how to test it, etc.).  The signal at the Fire TV stick is moderately strong, rated \"very good\" by the Stick.However, it would not connect using my password.  After many tries, I rebooted the Stick.  It hung up during the restart.  Third time, I got connected, just like it was supposed to.Then when going to \"Home\" it said \"Home is not available\" and it shows no connection.  After a time, the connection is back.  On and off.I haven't tried to stream yet.  I tried to connect the AllCast program, downloaded to the Stick and to my Android phone directly from Amazon.  I got a picture on the screen, then it hung and when I went to Home, once again I was not connected.As I said, I am disappointed.  I can stream to my Sony surround to the TV with no problem via the same Wi-Fi and with the antenna in the same location with no drops.This thing just seems like it has a serious software issue.  Hopefully with probably a million of them shipping early, Amazon sorts it out quickly, but if I hadn't been able to buy it at half price a few months ago, I don't think I would get it right now.  It needs work.It is impossible to troubleshoot or find help.  Amazon has a beautiful box to ship this thing in, but there is no effective help on their website when something doesn't work.  This is the opposite of other companies that push customer support rather than sales.I suppose I'll get a switchable cord so that rebooting is easier and just keep rebooting, but this is getting old.  This may end up being another tech trinket that ends up never being used.", "verified": true, "helpfulness": "0/1", "author": "Ronald Holland \"HollandLaw\""}, {"rating": 4.0, "review": "My daily driver to watch pretty much all my media.  I enjoy entertainment via Amazon Prime videos, Netflix, personal movies via Plex, Photos via Amazon Cloud Drive (my phone automatically uploads all the pictures I take via the app).  I was even able to install XBMC and many other apps from Google's Play store.  I own an Apple TV, Chromecast, Roku, and PS3.  They are all plugged into my TV via an HDMI switcher.  I use all of these devices but prefer this Fire TV Stick over the others as of this review.  We'll see if it stays on top.  As long as Amazon keeps supporting this device, I'll be happy for quite some time!", "verified": true, "helpfulness": "0/0", "author": "Daniel Cho"}, {"rating": 1.0, "review": "As a prime member I was so exited about this product, but now I'm just disappointed.  Netflix and all the video streaming keeps freezing and i have to restart the stick and router, it works only for little while.  I have a smart tv, Netflix works great with my tv, so is not my internet connection.  I bought it for my bedroom tv because is not a smart.  So frustrating when I try to watch  something...worthless.  Should have bought the Roku.", "verified": true, "helpfulness": "0/1", "author": "Betzaida"}, {"rating": 5.0, "review": "best 20 bucks ive ever spent", "verified": true, "helpfulness": "0/0", "author": "Carsten de Wolff"}, {"rating": 5.0, "review": "I just got mine in the mail today and this thing is awesome.I can watch just about anything I want using this thing. Having Twitch.tv and the WWE Network were HUGE PLUSES! I can finally watch my WWE Pay Per Views or CS:GO Tournaments on a big screen instead of all of us huddling around my computer. How cool is that? (Or nerdy/lame, I guess it depends on your tastes, right?)There's also a massive collection of movies and TV shows, which I'm sure you're familiar with if you already have Amazon Prime.There are also a ton of other apps (History channel, a lot of food and recipe channels, there's an entire indie cable app that looks just like real cable).Protip: If you want to stream videos from your computer, the app you're looking for is PLEX. You'll also have to download the PLEX Media Server onto your computer. The app costs $4.99, but it's totally worth it if that's what you're looking for (and oh was I looking for it).Basically... I've barely scratched the surface and we're well into 5 star territory. I wish I could give it 10 stars.I'm very excited to keep exploring this thing. Maybe I'll even get to cancel my cable. We'll see.", "verified": true, "helpfulness": "1/1", "author": "Stephen Cosgrove"}, {"rating": 5.0, "review": "This gives me all the flexibility I want to see Netflix, Amazon Prime Movies, Pandora Radio etc. without purchasing expensive products or a fire compatible tv.  I spent about 10 minutes setting it up (maybe less), logged into my favorite apps, and had my tv as an extension of my virtual world.  I love this.  The fire stick already knew who I was, so the amazon connection was almost instant.", "verified": true, "helpfulness": "0/0", "author": "Dotty Dear Old Thing \"Barb\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "keith williams"}]