[{"rating": 2.0, "review": "Stupid design.  The problem is that I wanted to be able to use it when traveling on the hotel televisions.The problem is, that it provides no interface to \"log in\" to a secured network that requires you to \"Accept TOS\".  YOu know, like when you log into a hotel's wifi, and the first web page you go to gets redirected to the TOS contract that you must click yes/accept on before it will let your device use the wi-fi.  Well, this does not let you do that.  Stupid!", "verified": true, "helpfulness": "0/0", "author": "Straight Shooter \"Big Daddy Chad\""}, {"rating": 2.0, "review": "There is very little free content through Fire TV, something that is not clear when you are researching about this product. It is basically hardware to deliver Amazon Prime content. The Netflix and Hulu apps did not work for me and could not understand what was wrong with it. On the plus side the onboarding experience was super easy.", "verified": true, "helpfulness": "0/0", "author": "Costas"}, {"rating": 5.0, "review": "LOVE LOVE! Easy to use, came quickly in the mail. Love that it offers HBO Go, Netflix plus so many others! The price is reasonable and the design is sick. I'd recommend this to anyone!", "verified": true, "helpfulness": "0/0", "author": "Camris Clark"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "R. Hernandez \"me\""}, {"rating": 5.0, "review": "I love this i have a kindle and love that so buying the fire TV stick was alot cheaper then buying a wireless blue Ray player. I like you can take it from TV to another with out any issues it came with my account info already in installing it was easy and with Amazon prime I got mine in two days I will be ordering another later down the road but it is a must buy", "verified": true, "helpfulness": "0/0", "author": "robyn scrimger"}, {"rating": 5.0, "review": "Item was exactly as described and delivered promptly.", "verified": true, "helpfulness": "0/0", "author": "Joseph D Trettel"}, {"rating": 2.0, "review": "While the concept is great, the execution struggles. Even with 20MB service, far to many stutters and stops - even on things like prime movies - to make it comfortably watchable.  Disappointing.", "verified": true, "helpfulness": "0/0", "author": "Joyce"}, {"rating": 5.0, "review": "just perfect", "verified": true, "helpfulness": "0/0", "author": "Sunghyun J."}, {"rating": 5.0, "review": "Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Lori J Stevens"}, {"rating": 5.0, "review": "a great piece of tech.", "verified": true, "helpfulness": "0/0", "author": "John C Manale"}]