[{"rating": 4.0, "review": "Just getting to know it! Looks good so far!", "verified": true, "helpfulness": "1/1", "author": "Mary E Kinsman"}, {"rating": 4.0, "review": "The amazon TV Fire Stick is almost everything I expected. I am not sure if it’s the connection with the stick or is it just my internet but my hulu app freezes all the time. I tried to download the cable station apps like Lifetime or A&E; but I guess amazon is not a supporter of Xfinity because I did not see it listed as a provider for any of the apps I tried to download. Other than that I am pretty pleased with it. I just wanted it so I could  use the radio, Hulu and Netflix. And when I saw the cable channel apps I got excited and come to find out I can’t use them.", "verified": true, "helpfulness": "0/0", "author": "Alexis"}, {"rating": 3.0, "review": "Bought this soley to mirror my kindle hdx to my tv and am very dissappointed in it. The kindle rarely connects, usually just hangs on connecting so I'm very unsatisfied. The rest of the features work fine (netflix, amazon prime video), but i already have several streaming devices.", "verified": true, "helpfulness": "0/1", "author": "Annette J. Devereux"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "vedra"}, {"rating": 5.0, "review": "Love the selection of British mysteries", "verified": true, "helpfulness": "0/1", "author": "JAMES C."}, {"rating": 2.0, "review": "I bought this to supplement my Apple TV. I believe the device is under-powered. It struggled greatly playing anything via Plex, even over my local WiFi network. All my other devices with Plex (iPad, PS4) worked fine with no streaming issues. The WWE Network app also seemed to struggle at times. And navigating the interface as a whole seemed sluggish. I picked up a Roku 3 and everything is running perfectly.", "verified": true, "helpfulness": "1/2", "author": "Stephen Ott"}, {"rating": 3.0, "review": "It took almost 2 weeks to arrive. I realize I chose standard shipping, but that seems a long time for such a little package. Set up was easy. However, as other reviewers have stated, it felt as though I needed a crow bar to open the battery compartment. It works pretty much as advertised. I like the remote. This is replacing a Google Chromecast which had to be operated from an ipad. I find the remote much easier and more intuitive. The problem lies in the reception. It seems to lose the wifi signal fairly often and have had to restart it several times. If I put on Netflix, it will rebuffer more than a few times. We have a strong router, less than a year old, sitting only about 25 feet from the stick's location. It seems to be doing a little better so maybe there's a \"learning curve\" (?) with it. I'll try for a little while longer, but it may be headed back.", "verified": true, "helpfulness": "0/0", "author": "Lionel E. Lomax \"biscuit's dad\""}, {"rating": 5.0, "review": "Total satisfaction. Was told by sales person at major etailer that Roku was superior but I've been with Amazon for a long time and have faith in their products.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My wife and I recently purchased this product as Prime and Netflix are the two main sources of entertainment in our home. This is a wonderful product, which is very easy to set up and to use, it practically sets itself up for you, once you insert it into your TV. It’s very functional, easy to find things and reliable. Since owning it I have only had one occasion where it was not accessing media like it should, but after turning it off and on, it fixed itself.I haven't owned or used any other devices like this one which are currently available. But I am very satisfied, and can say this is well worth the price, especially if you are an amazon prime member!", "verified": true, "helpfulness": "1/1", "author": "G. Ridgeway"}, {"rating": 3.0, "review": "Product ran good when I first got it but after couple months the device just stops working. 3 star cause when it works it O.K for the price. Thanks to  Amazon they shipped me a new one next day. 5 stars for service from Amazon but as for the device I can only give it a 3 star.", "verified": true, "helpfulness": "0/0", "author": "bill"}]