[{"rating": 4.0, "review": "Good but I should have bought fire TV", "verified": true, "helpfulness": "0/0", "author": "Dan Greto"}, {"rating": 5.0, "review": "Very happy with this purchase.  Had it \"up and running\" in no time.  Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Judy Wellington"}, {"rating": 5.0, "review": "Amazing what this little stick can do. I love that you can control everything with your cell phone by downloading the app.", "verified": true, "helpfulness": "0/0", "author": "Angry Mom"}, {"rating": 3.0, "review": "I love the idea of the Fire TV Stick, and it works well most of the time.  Too often it spins the loading symbol of delay and death of fun.", "verified": true, "helpfulness": "0/0", "author": "CampbellSoup \"City Lady\""}, {"rating": 5.0, "review": "Great device  - so much better than Roku", "verified": true, "helpfulness": "0/0", "author": "MG"}, {"rating": 5.0, "review": "This works Perfectly!  I am not tech savy at all and this was a breeze to set up.  In a matter of minutes I was looking for movies on Prime and Netflix!  It is great, better than I expected for the money.", "verified": true, "helpfulness": "0/0", "author": "skrose \"Suzette Rose\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "NAJMAH"}, {"rating": 2.0, "review": "I just don't like it, it's not for me. I can't customize the home screen with apps that I like. The best apps out there are not available. You can side load apps but you have to jump through hoops to do so and again you can't place them front and center where you would like them.", "verified": true, "helpfulness": "0/0", "author": "TechGeek"}, {"rating": 1.0, "review": "This is a rip off! Movie rentals for $3.99?/ Old tv show episodes for $2.99? This thing is a waste of time and money. I'll stick to cable and netflix.", "verified": true, "helpfulness": "0/1", "author": "oscar m. hernandez moreno"}, {"rating": 5.0, "review": "Very user friendly and a great way to reduce cords in the house. Good purchase.", "verified": true, "helpfulness": "0/0", "author": "jamie bruce"}]