[{"rating": 1.0, "review": "Doesn't work. Typical ... just like the Kindle Fire...clunky, unresponsive interface that always locks up...", "verified": true, "helpfulness": "1/2", "author": "Tamim Parsa"}, {"rating": 5.0, "review": "I love my Kindle, but the Fire Stick has easily become my favorite Amazon product. I even like the menu and the interface, which seems to be the one hang-up seen by others.", "verified": true, "helpfulness": "0/0", "author": "RT"}, {"rating": 1.0, "review": "I 'm a  flight attendant so I bought the fire stick to take with me while I'm on the road. While it worked fantastic at home it does not work in any of the hotels which is the reason I bought it. I'm very disappointed. I would recommend it for home use but for hotels its useless. I understanding they are trying to resolve the issue but there's not a time frame for when that will happen.", "verified": true, "helpfulness": "1/2", "author": "Debbie Wheeler"}, {"rating": 5.0, "review": "great quality product", "verified": true, "helpfulness": "0/0", "author": "ALVARO MARTINEZ"}, {"rating": 4.0, "review": "I have two of these, and they both suffer a slight buffering on occasion. Not sure if it's the sticks or the WiFi.", "verified": true, "helpfulness": "0/0", "author": "R. Hunter"}, {"rating": 5.0, "review": "i got this mainly because for the sling tv, but this product works great! navigation needs a little improvement, but still not bad at all.", "verified": true, "helpfulness": "0/0", "author": "Eug Liao"}, {"rating": 3.0, "review": "i would definitely purchase the fire tv box instead. the stick works sometimes but not all this time and has a hard time connecting to wifi. i purchased a firetv box and a stick, for two different rooms and i like the box much better.", "verified": true, "helpfulness": "1/1", "author": "Nicole Sidoti"}, {"rating": 4.0, "review": "though it was great would recommend it to most people I talk to!", "verified": true, "helpfulness": "0/0", "author": "Jim Messick"}, {"rating": 4.0, "review": "I love the Amazon Fire Stick for it's price, ease of use, and access to programming.  I will limit my review to limitations of the Amazon Fire Stick since it does essentially the same thing as the Roku, and Apple TV, but is less expensive.  I have tried both a Roku and this product and they are virtually the same, except as noted below.  I gave it only four stars for four reasons: 1) There is no way to show only the Amazon Prime Free Programming.  You can put a PIN prompt on it so that you will not inadvertently rack up charges, but there is no way to filter the programming only available for purchase out.  2) The voice search and search seems to only index Amazon's offerings.  Why would I want to pay for a program that I can can get for free through my Netflix or Huluplus memberships?  3) The organization of the entire channels/apps is Amazon centric and it is difficult to configure for an older person to use (my 80 year old mother is now using a Roku, since she had issues with this since it kept prompting her for payment for Amazon programs when she was trying to use Netflix).  You cannot place only the channels/apps in an order that works for you.  Everything always is directed back to Amazon products.  4)  The search and programming with the remote is letter by letter and annoying, there should be the ability to use a laptop or keyboard to search different apps/channels (same as Roku).  This review may seem critical, but I do like/love the Amazon Fire TV stick and would love to see these improvements to have it rise above its competitors.", "verified": true, "helpfulness": "0/0", "author": "Toshie"}, {"rating": 5.0, "review": "All I can do is praise this device! It arrived already setup for my account, and I just plugged it in I am now able to take better advantage of amazon prime instant video! The performance is fast and generally works well! Thank you Amazon for bringing more entertainment into my home! There is even an app that let's you do airplay from an apple device!One Hardware Suggestion: the power transformer, while beautiful in design, is a little too large to fit well on a standard power strip/surge protector. Also, the cord comes out of the bottom making hard to use an adjacent plug on the surge protector. I swapped it with an Apple USB Charger which is smaller and that fixed my plug problems!Also, Bring HBO Go to Fire Tv!", "verified": true, "helpfulness": "0/0", "author": "GisMofx"}]