[{"rating": 5.0, "review": "So far so good it is very fast.  Good quality hd can't beat it for the price.  Great selection of movies and television shows", "verified": true, "helpfulness": "0/0", "author": "David Bushong"}, {"rating": 5.0, "review": "Later Comcast.", "verified": true, "helpfulness": "0/0", "author": "RollingVideoGamesDenver"}, {"rating": 5.0, "review": "Works great, sometimes we want to watch a movie together and this fire stick is perfect for that vs. trying to watch a movie on a n iPad or kindle", "verified": true, "helpfulness": "0/0", "author": "Kim Anderson"}, {"rating": 5.0, "review": "awesome!!! well worth the price.  no need for cable for me.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "works great.small footprint.well worth the money.", "verified": true, "helpfulness": "0/0", "author": "darrell schliepp"}, {"rating": 5.0, "review": "I absolutely love the Fire Stick. It has exceeded all my expectations. My husband and I got it as a gift and we are so happy. So many feechers that we still have to explore.", "verified": true, "helpfulness": "0/0", "author": "linda mullan"}, {"rating": 4.0, "review": "I bought this device so I could watch Amazon Instant Video on my TV. It does exactly what it is supposed to do at an inexpensive price. I like the fact that the remote is radio based so I don't need line of sight to the device. The only thing I didn't like was having to plug in a wall adapter to properly power the device.", "verified": true, "helpfulness": "0/0", "author": "Steve \"s_brune\""}, {"rating": 4.0, "review": "I would have given it a full five stars because it is an amazing device!  We have two of them, plus a Chromecast!  The only drawback is that it needs to be relatively close to your Wifi, or it doesn't work that well.  My Chromecast is at the other end of the house and works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Captainpooopypants"}, {"rating": 5.0, "review": "Love it! So easy to use.  I will definitely buy a 2nd one soon.", "verified": true, "helpfulness": "0/0", "author": "Sylvia Cline"}, {"rating": 5.0, "review": "LOVE IT.  Easy to use.  If you already have Amazon Prime, just plug into TV and power and you are done.  Very easy.  Now I can watch Netflix, Amazon shows, etc. all in one easy click.  Previously had another system for Netflix, etc., and this is much better.", "verified": true, "helpfulness": "0/0", "author": "RangeQueen"}]