[{"rating": 5.0, "review": "I love the fire stick. It works great and has a lot of capabilities.", "verified": true, "helpfulness": "0/0", "author": "Laura Trice"}, {"rating": 5.0, "review": "I have bought three of these over the last month, and I couldn't be happier with them. Coupled with Amazon's prime  content library, I look forward to interesting viewing each evening. Most important however, is this device will enable me finally to \"cut the cord\" with my current cable TV provider, thereby saving me  approximately $100 a month when coupled with a free airwaves HDTV indoor antenna to pick up the main four networks (which I really do not watch) and, most importantly, three PBS  channels which I do watch every day. The firestick is easy to install and set up and I've also given one as a gift to a friend.  I highly recommend this item and it's time that the public strike back at the ongoing  and accelerating centralization and monopolization of the cable and broadcast entities.", "verified": true, "helpfulness": "0/0", "author": "David Atlas"}, {"rating": 4.0, "review": "Easy to set up , the most difficult thing was getting the back off the remote to put the batteries in.i have a chromecast and this , i prefer the amazon stick", "verified": true, "helpfulness": "0/0", "author": "veronica smith"}, {"rating": 5.0, "review": "Better than expected", "verified": true, "helpfulness": "0/0", "author": "Gary F Arruda"}, {"rating": 2.0, "review": "Not what I expected.", "verified": true, "helpfulness": "0/0", "author": "Sammy De La Rosa"}, {"rating": 4.0, "review": "i like it but if i used more long time it's hot.but any way i give 4 stars", "verified": true, "helpfulness": "0/0", "author": "hung nguyen"}, {"rating": 5.0, "review": "Using it for my netflix & hulu plus accounts", "verified": false, "helpfulness": "0/0", "author": "Stephen M. Rabinowitz"}, {"rating": 4.0, "review": "This thing works pretty well...it's handy for travel and pretty straightforward on the controls. What I don't like about it is the short cord they give you to plug it in. It should have at least a 3-4 ft. cord so you can reach an outlet without using an extenstion cord. Also, you have to be aware of the different setttings on the stick itself. If you leave the factory settings on it, it will download content on it's own which takes up storage space and eats bandwidth on your router.", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 4.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 5.0, "review": "So far I am loving my Amazon Fire Stick. I haven't had any issues with lagging or connection. Very happy customer.", "verified": true, "helpfulness": "0/0", "author": "Terri Pacheco"}]