[{"rating": 4.0, "review": "Great item. Be sure to set up the remote app on your phone in case you lose the remote.", "verified": true, "helpfulness": "0/1", "author": "Cold in Cleveland"}, {"rating": 5.0, "review": "Loving the amazon fire stick. I am able to watch my prime movies on my tv now and not just on my kindle fire", "verified": true, "helpfulness": "0/1", "author": "Adrena D."}, {"rating": 5.0, "review": "This was a great purchase. I love the Fire TV Stick and it is so easy to use. Amazon definitely pushes their content over others, but in the end it's a great and inexpensive streaming device.", "verified": true, "helpfulness": "0/1", "author": "Ian Joyce"}, {"rating": 4.0, "review": "Easy to setup and use. Netflix and amazon Prime stream pretty seamlessly. Radio apps and Youtube are great too. I may never leave the house again. Wish it had an off button. It also sometimes freezes and I must unplug and re-plug in order for it to work again. Sometimes has problems connecting to the internet.", "verified": false, "helpfulness": "0/1", "author": "Priscilla Andrzejewski"}, {"rating": 5.0, "review": "Good product.  You need a high brand to get good quality.", "verified": true, "helpfulness": "0/1", "author": "Mitre, BJose"}, {"rating": 5.0, "review": "This is an awesome product!", "verified": true, "helpfulness": "0/1", "author": "cindys"}, {"rating": 2.0, "review": "We moved from Roku to Amazon Fire Stick on a recommendation and really wish we hadn't. The connectivity speed is terrible. Our shows skip and freeze constantly, and it takes forever for shows to load. The Home screen, too, is not as user-friendly as Roku. About the only thing I like more about it than our old Roku is the screen saver. I do not recommend this product.", "verified": true, "helpfulness": "0/1", "author": "Alabama Reader"}, {"rating": 5.0, "review": "Works better than expected.", "verified": true, "helpfulness": "0/1", "author": "David Halladay"}, {"rating": 5.0, "review": "Love it so easy to use and install!", "verified": true, "helpfulness": "0/1", "author": "lisa"}, {"rating": 1.0, "review": "I am really unhappy with this product. Before I received the Amazon fire stick I was so excited to take advantage of all its capabilities with such a low price. However, if you don't have Amazon prime be ready to become a member. It signed me up for Amazon prime with out my permission because I ordered a movie for $12.99 which you don't have to be a member to do.The wifi strength on this device is terrible for me. I have barely been able to use it because every time I want to watch something or use an app it takes me about 15 minutes for it to load correctly with out saying \"network error\". By the time I get it working, that is IF I do, then I'm too frustrated to continue use.The device blames my network connection but every other device in this house is working. Cell phones, tablets, and laptops. It is not because too many devices are connected either because I never had this problem with my Google Chromecast. Even when the device is running properly it still has very long loading times.I'm not one to make a huge fuss on a review I have just never been so disappointed with a piece of technology. I would not recommend this to anyone.I am very upset and I will be making a return.", "verified": true, "helpfulness": "0/1", "author": "Stephanie"}]