[{"rating": 5.0, "review": "We love it. Works fast and easy and it is just what we wanted.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "The Fire TV stick is amazing.  It has completely removed the need for me to have a laptop near my tv.  I can do everything I need to with FireTV + Plex!  I will be a repeat customer.", "verified": true, "helpfulness": "0/0", "author": "David Rundle"}, {"rating": 4.0, "review": "Haven't had time to review it fully but it looks great with lots of options.", "verified": true, "helpfulness": "0/0", "author": "DORA BOURGAULT"}, {"rating": 4.0, "review": "I just use it to watch my Amazon Prime videos on my Samsung TV and it works great for that. I can't speak to the other stuff it can do but it is pretty nice to watch Prime Instant Videos on a big screen instead of an iPad.", "verified": true, "helpfulness": "0/0", "author": "LDP3"}, {"rating": 5.0, "review": "Fast, easy and for the money the best streaming for me. This is a great buy.", "verified": true, "helpfulness": "0/0", "author": "ed winchester"}, {"rating": 5.0, "review": "Fire tv stick works great. Couldn't be happier with a purchase. Had it going sense Christmas and everything is great. Recommend it 100 percent.", "verified": true, "helpfulness": "0/0", "author": "Everett Harrison Jr."}, {"rating": 5.0, "review": "I have a few streaming devices and the Fire Tv Stick is by far the easiest to use.", "verified": true, "helpfulness": "1/1", "author": "lawrence zonenshine"}, {"rating": 5.0, "review": "A MUST HAVE ITEM", "verified": true, "helpfulness": "0/0", "author": "Winkey"}, {"rating": 5.0, "review": "i just got  it  work great", "verified": true, "helpfulness": "0/0", "author": "Darrell"}, {"rating": 5.0, "review": "This thing is awesome.  I got it to replace my Roku 3 and it is so much faster.  Plus I love the addition of screensavers to help protect my plasma tv screen.  It is very fast and being able to add my Netflix and HuluPlus pleased me to no end.  I love this little thing!  So thankful that Amazon even included the adapter because without it I would not have been able to use it.  Well Done!", "verified": true, "helpfulness": "0/0", "author": "R. GIBSON"}]