[{"rating": 4.0, "review": "excellent device", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "kevin"}, {"rating": 5.0, "review": "It's awesome; great to have on any TV that's not already connected. I like it better than my apple TV too.", "verified": true, "helpfulness": "0/0", "author": "Mike Ramsager"}, {"rating": 4.0, "review": "I absolutely love this product and all that it allows me to do.  However, it does seem to have one glitch that I'm not sure what's causing it.  Every so often I will go into use it and it will tell me I've lost my internet connection, but won't actually let me reconnect. I've found that if I unplug the device from power, not just the TV, and then plug it back in everything is fin.  I think it's just one of the bugs from buying at the initial release.  I would think newer versions would be less likely to have this issue.", "verified": true, "helpfulness": "0/0", "author": "Nicole Largo"}, {"rating": 2.0, "review": "My internet did not support this device.  I have only been able to listen to the radio.", "verified": true, "helpfulness": "0/0", "author": "brenda fuller"}, {"rating": 3.0, "review": "Nice little stick, but when will you add CBS all access??? Come on Amazon, get with the program!", "verified": true, "helpfulness": "0/0", "author": "Steven A. Casper \"Srgrounds\""}, {"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "pdfloresj"}, {"rating": 4.0, "review": "I haven't had it very long but so far I enjoy it.  You have more control of what you watch as opposed to cable.  And no commercials.  Very reasonable price.", "verified": true, "helpfulness": "0/0", "author": "K. Franson"}, {"rating": 5.0, "review": "Great product. Very easy set up. No longer use cable or dish to watch my favorite programs. This was a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Nicholson"}, {"rating": 5.0, "review": "use this everyday", "verified": true, "helpfulness": "0/0", "author": "Jerome Crihfield"}]