[{"rating": 2.0, "review": "Not enough channels", "verified": true, "helpfulness": "0/2", "author": "Carla Gray"}, {"rating": 4.0, "review": "Fire TV Stick. We bought these for a couple bedrooms in the house that can not get cable in them due to the build of the house.The kids love them so easy for them to use to watch shows on Amazon and Netflix as well as others they also have found a couple games to play on it too. It was really easy for my 13yr old to hook up and get running for us and the quality is so much better then when they try to watch from their nintendo.", "verified": true, "helpfulness": "0/0", "author": "lovinglife \"lil\""}, {"rating": 5.0, "review": "Simply put \"I love this device\" best thing ever.  I can watch my Netflix and Amazon prime for free! What's not to love!! sure there are a few little hiccups (what doesn't) but over all I am extremely satisfied!", "verified": true, "helpfulness": "0/0", "author": "p.m."}, {"rating": 5.0, "review": "I bought this to replace a Chromecast - wanted a remote and the ability to use in a hotel - and have not looked back since.  Interface is good, a little cluttered but manageable and everything seems to be getting better and better with every update.  I use it mainly for Plex and Netflix (no hard feelings Amazon...)", "verified": true, "helpfulness": "0/0", "author": "J. Miller \"jmiller0526\""}, {"rating": 1.0, "review": "I got the Fire TV Stick from a Sling TV-Amazon promotion. I was as happy as a clam, but happiness lasted less than a month. The stick started showing some problems and restarting continually until one day stopped working. I contacted technical support but to no avail. I spent more than 30 minutes plugging and unplugging stick, internet, and TV.BE AWARE of Tech guy named RICK W. ( If you got problems with your Fire TV Stick and the tech guy is Rick W. , please ask for another technician)  He told me he would contact me in 7 seven days because their engineers would check your stick history. He also told me he would keep me post during the week. This guy never called, on the other hand, I called during the week, and the same story plus plug and unplug. My fingers hurt after so much plugging and unplugging.Today, I decided to return the Fire TV Stick and to my surprise I got a call from Rick W. saying I should change some settings on my TV. Really?No way.( I also tried the Stick on another TV but it did not work either).Wrapping up, I am not buying any device made by Amazon anymore.", "verified": true, "helpfulness": "0/0", "author": "Manuel Diaz"}, {"rating": 4.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "P. Mishra"}, {"rating": 1.0, "review": "All provider aside from Amazon require separate apps that don't always function well with the remote interface. Get a Roku", "verified": true, "helpfulness": "0/2", "author": "Mark East"}, {"rating": 5.0, "review": "It works well.I'm satisfied.", "verified": true, "helpfulness": "0/0", "author": "Becky chen"}, {"rating": 1.0, "review": "Constantly drops wifi.  I bought this to replace my Roku because they claimed to have better wifi reception.  I'll be going back to Roku.", "verified": true, "helpfulness": "0/0", "author": "Tammi"}, {"rating": 5.0, "review": "Great little device.... with kodi loaded...makes it awesome", "verified": true, "helpfulness": "0/0", "author": "dan hawco"}]