[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Melvin D Jones"}, {"rating": 5.0, "review": "It arrived already registered to my Amazon account, it was super easy to install & super quick on screen set up... I love my Fire TV Stick!!!", "verified": true, "helpfulness": "0/0", "author": "Marisol Fuentes"}, {"rating": 5.0, "review": "Excellent product, very responsive and fast. I also have a Fire TV and, except for the no vocal option on the remote, I don't see a significant difference between the two. Tried chrome cast and roku stick and at its current price the fire TV stick is the best bang for your buck!", "verified": true, "helpfulness": "0/0", "author": "Sorin M"}, {"rating": 4.0, "review": "Works pretty well.  Fairly easy to set up according to my wife who set it up.  She does have fair electronics knowledge.I am disappointed with the price of TV shows. I did not expect to have to pay for a lot of the really good stuff. i.e. \"The Walking Dead\" is like 14.99 a season.  From the ad I assumed these were included (free) in the monthly Prime fee. I am also disappointed with the music as I seem to already have much of this on my Amazon Music app (free).  I have not yet tried the music stations although these were one of the reasons for purchasing Prime.", "verified": true, "helpfulness": "0/0", "author": "mach1"}, {"rating": 5.0, "review": "Amazing! Easy set up and great programming.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Still looking through it but so far, I love it.", "verified": true, "helpfulness": "0/0", "author": "tina rackley"}, {"rating": 5.0, "review": "Great product- streams VERY fast and without issues.  Seems to be a little more responsive than the Roku streaming stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is a lot better than Chromecast. It has its own remote which is a necessity for me. The only problem(s) I have is the sound sometimes doesn't sync with the actors' mouths and sometimes there are skips or hesitations in the audio & video...", "verified": true, "helpfulness": "0/0", "author": "Jerry Hargrove"}, {"rating": 4.0, "review": "Got the first on for $19 and loved it, no issues at all, so I ordered a second one and even though it's near router, seems to be a few issues. Very jumpy during hulu etc, and stick isn't on tv, no electro interference. Needs a little more work.", "verified": true, "helpfulness": "0/0", "author": "DB"}, {"rating": 5.0, "review": "Wide selection of movies great for rainy days.", "verified": true, "helpfulness": "0/0", "author": "Daryl Yuuki"}]