[{"rating": 5.0, "review": "Bought this for my college bound son...works great and can't beat the price.  Prime Day was great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I like it very simple to use.", "verified": true, "helpfulness": "0/0", "author": "Davey"}, {"rating": 5.0, "review": "It's our second Fire stick. We cut the cord and this helps fill the gap.  Better than the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Christopher DeBolt"}, {"rating": 4.0, "review": "I'm pleased with my Fire TV Stick overall.  It streams content nicely even though my internet connection speed is less than 6 mbps.  Resolution and performance are good.  I'm not experiencing any buffering issues, nor have I experienced any problems with my Fire TV Stick losing its connection to my network.I'm an avid Netflix and Chromecast user.  But Amazon Prime has some quality programming that isn't available on Netflix, and I wanted to access that more easily.  My Blu-ray player has an Amazon Instant Video app, but I'm not pleased with the app's interface or performance on that device and rarely use it.After months and months and months of asking Amazon to make their Android Instant Video app Chromecast enabled, I finally broke down and purchased a Fire TV Stick on sale.  I'm glad I bought it.  I find that I do watch more of Amazon's programming now.  But I still wish they would make their Android Instant Video app Chromecast enabled.Personally, I much prefer using my phone to view my choices, make my selections, and operate my streaming device.  Even though Amazon's TV-displayed interface is much improved, I still prefer using my phone and my Chromecast to watch Netflix or YouTube or most other apps that have good Chromecast apps.  Chromecast doesn't out-perform Fire TV Stick, but the interface is superior -- easier to see, easier to navigate, much faster to use.  Further, I don't like being forced to have multiple remotes.  It's much easier to turn on my TV and then do everything else with my phone.That said, the little remote that comes with the Fire TV Stick is pretty slick.  It's simple, it works well, and you will be able to easily use it in the dark in a very short time after taking it out of its packaging.  You have one large button up top for selecting, and a ring around that large button for directional navigation.  Then there are only 6 other buttons to learn...And you don't have to point the remote at anything to use it either.  As far as remotes go, it's an excellent design, in my opinion.  But due to no fault of the remote, navigating the Amazon Instant Video app can still be a little clunky at times.The Fire TV Stick and Chromecast have some of the same apps, and each has some good apps I like that the other doesn't offer at this time.  I don't game much, so the availability of all the games on Fire TV wasn't a selling point for me.  But some of the apps that I get on Fire TV and  not with Chromecast were a pleasant surprise.I suppose this was ignorant on my part, but when I read that I could operate the Fire TV Stick with the Fire TV phone app, I was expecting an interface akin to what I experience with my Chromecast.  I had envisioned opening something similar to the Amazon Instant Video Android app and being able to play programming from there to my Fire TV Stick.  But that Fire TV phone app is only a digital remote that operates the Fire TV stick in place of the physical remote -- only not as easily.  That was disappointing.  Having that Fire TV app on my phone hypothetically allows me to put the physical remote away in a drawer and forget it.  But so far, my experience with the physical remote far exceeds my experience with the app.  I'll keep working with the app to see if that opinion changes.7/29/2015 Update:I was pleasantly surprised that the Netflix Android app allows me to cast to Fire TV Stick exactly the same way that I cast to my Chromecast.  That means I can use my phone to quickly look through, read about, and select my entertainment from Netflix. Once the program begins playing, I'm free to use my phone in any way I wish.", "verified": true, "helpfulness": "0/0", "author": "Pam"}, {"rating": 5.0, "review": "I have a Roku, and an Xbox one that will have a lot of the necessary apps you need.  We do not have Cable or DirectTV and rely only on our internet connection for entertainment.  With Netflix, Sling TV, Hulu, and Amazon Prime its hard to justify spending the extra money on anything else because there is something to be watched.  I highly recommend this product, set-up is easy, pretty much hook up to your Wi-Fi and away you go.  I would recommend this or a Roku Stick for anyone looking for an option other than Cable/DirectTV.", "verified": true, "helpfulness": "0/0", "author": "Ryan Kochert"}, {"rating": 5.0, "review": "Snagged it for $24 during Prime Day and it was more than worth it! Loved that it already came registered to me and the unboxing/peeling process was satisfying.  Big upgrade for me since I was using an older roku that didn't have autoplay options", "verified": true, "helpfulness": "0/0", "author": "Keaton"}, {"rating": 5.0, "review": "Easy to install, and lots of choices.", "verified": true, "helpfulness": "0/0", "author": "Margaret lach"}, {"rating": 1.0, "review": "I am getting lot of errors and getting struck very frequently..I am planning to return...", "verified": true, "helpfulness": "0/0", "author": "mrudula"}, {"rating": 5.0, "review": "Love it, and so easy to install.", "verified": true, "helpfulness": "0/0", "author": "Dorothy A. Vastola"}, {"rating": 4.0, "review": "Ok, for the price (thank you Prime day!) this thing is the bomb.  I can't quite give it 5 stars, but I'm glad I bought it.  Prime video works awesome.  Netflix does really well, but will have periods of low picture quality.  However, the MLB app runs like crap- it isn't even watchable.  But, like I said, for the price it's awesome to have the extra options.", "verified": true, "helpfulness": "0/0", "author": "Lyssa \"Elisabeth\""}]