[{"rating": 5.0, "review": "So far so good. Pretty happy. Has a lot of apps.", "verified": true, "helpfulness": "0/0", "author": "Troy V"}, {"rating": 3.0, "review": "When paired with Amazon Prime it's a great deal.  Lots of free (with Prime) content.  Great that you can unplug it and take it with you or move to another room.  Seems to drop connectivity occasionally or say my internet is too slow to stream (it's not).  unplugging the poser to get it to re-link to the home network brings it back on line.Makes renting easy - will never need to go to RedBox again.", "verified": true, "helpfulness": "0/0", "author": "Steven Pavelitz"}, {"rating": 5.0, "review": "Loving the fire stick", "verified": true, "helpfulness": "0/0", "author": "Edwin Spencer"}, {"rating": 5.0, "review": "fantastic devicevery handy", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "Not being a \"technologically savvy\" person, we literally plugged this in and it worked. THE FIRE TV STICK is FANTASTIC! \"It is EXCELLENT, FUN AND WELL WORTH THE MONEY' my husband is quoted as saying. Just watched an entire series of Bosch that would have cost more if we had rented one video at a time. So anything from here on out is \"clear profit\" as they say!!", "verified": true, "helpfulness": "0/0", "author": "Joyce Wexler"}, {"rating": 5.0, "review": "Wake up your tv! Just add WiFi.", "verified": true, "helpfulness": "0/0", "author": "Neil"}, {"rating": 5.0, "review": "Move effortlessly thru the menus much faster than through the TV application. Especially love the phone app that let's you search via voice which is highly accurate. Tried John Wayne and it immediately came up with 100 different shows. Also don't have to try to find items we watch constantly, just tell it to search for Glades or Downtown Abbey and it pops right up. Best $40 we have spent lately. TV WiFi broke.", "verified": true, "helpfulness": "0/0", "author": "Roy Cleveland"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Scott Baker"}, {"rating": 5.0, "review": "Just love it and it is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Edna Favale"}, {"rating": 5.0, "review": "Great interface! Have Chromecast and this knocks it out of the park.", "verified": true, "helpfulness": "0/0", "author": "john lemke"}]