[{"rating": 5.0, "review": "arrived when it sai it would no problems at all.", "verified": true, "helpfulness": "0/0", "author": "Dennis A. Boyer \"DAB\""}, {"rating": 1.0, "review": "I have a slow internet connection. The fastest I can get in my building is 10mb (or whatever it is. I'm not a scientist). With hulu, netflix, etc. nothing plays smoothly without skipping. Don't get this stupid stick thingy if you have a slow internet connection and there's nothing you can do about it.", "verified": true, "helpfulness": "0/0", "author": "Gabrielle Neuberg"}, {"rating": 5.0, "review": "I have a TV in my guest room but no cable. So I got the Fire TV stick for my guest to have a choice of many options.Thank you.", "verified": true, "helpfulness": "0/0", "author": "smokey"}, {"rating": 2.0, "review": "Loses connection information and need to power off and power on again. It is frustating sometimes. Youtube casting doesn't work always.", "verified": true, "helpfulness": "0/0", "author": "Sundeep"}, {"rating": 4.0, "review": "Excellent product. The only thing it needs is an instruction manual. The screen savers are fantastic. I could watch them all day.", "verified": true, "helpfulness": "1/1", "author": "Curtis M."}, {"rating": 5.0, "review": "way better than roku with more choices and better reception", "verified": true, "helpfulness": "0/0", "author": "paula tripp"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Lynette"}, {"rating": 5.0, "review": "When you are on Social Security and funds are limited, you are very careful in your purchase habits.  When we can afford to we rent a movie.  Since we are \"Prime\" members we tried this product and have been very pleased.  Now we can watch a movie anytime we want and we have completely forgotten renting same.Ken & Helen", "verified": true, "helpfulness": "0/0", "author": "Cap't Ken \"Kenneth F. Boula\""}, {"rating": 5.0, "review": "I love it, what a great product", "verified": true, "helpfulness": "0/0", "author": "Anne Fetherston"}, {"rating": 5.0, "review": "It's as good as advertised  simple to install and very easy to navigate.  I have not identified any negative!  Great product.", "verified": true, "helpfulness": "0/0", "author": "Edward Surette"}]