[{"rating": 3.0, "review": "It just ok.", "verified": true, "helpfulness": "0/0", "author": "Rene"}, {"rating": 5.0, "review": "works good love it", "verified": true, "helpfulness": "0/0", "author": "William D. Wyke \"Bill\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Ghiz"}, {"rating": 5.0, "review": "Very easy to use.  I'm happy with this product.  The interface is straight forward, and the remote puts it above the Chromecast, in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Christopher Hunt"}, {"rating": 2.0, "review": "Maybe I should've done a little more research on the fire stick TV but it seems all the good movies you have to rent pay money to watch they aren't Maybe I should've done a little more research on the fire stick TV but it seems all the good movies you have to rent pay money to watch they aren't  included with prime.  So you have to lay out more money to watch stuff through Netflix and also HBO.", "verified": true, "helpfulness": "0/0", "author": "Scott Hughes"}, {"rating": 5.0, "review": "This was awesome.  Better than Roku", "verified": true, "helpfulness": "0/0", "author": "Karen F M"}, {"rating": 5.0, "review": "Fire TV is very easy to use for music and movies photos and more", "verified": true, "helpfulness": "0/0", "author": "Mike Kennedy"}, {"rating": 5.0, "review": "Does not get Vudu but still very happy with this product. I have Roku also. One system stopped working after three months. The other has remote problems. I have no problems with fire stick. Will upgrade very soon.", "verified": true, "helpfulness": "0/0", "author": "anthony johnson"}, {"rating": 5.0, "review": "Works right out of the box, easy connection, I didn't buy it from Amazon cause I needed it immediately, but I paid the same $39 price. It was easy to link it with my Amazon account. No issues here putting in the batteries. The mirroring feature with my Kindle HD tablet is awesome. I even installed an app on my tablet that allows voice commands to the Fire Stick TV. Great purchase", "verified": true, "helpfulness": "0/0", "author": "Atlmomof2boyz"}, {"rating": 5.0, "review": "Works great for streaming all my favorites. HBO Netflix plus with a prime membership you can get tons of instant video which is great. I wanted something that I could use for streaming entertainment. This stick is perfect!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Ellison"}]