[{"rating": 5.0, "review": "My Great Grandson loved it.", "verified": true, "helpfulness": "0/1", "author": "yellow shoe"}, {"rating": 5.0, "review": "Very easy to set up", "verified": true, "helpfulness": "0/1", "author": "Janekg"}, {"rating": 5.0, "review": "Item delivered on time, was as described. Trusted seller. Thank you....", "verified": true, "helpfulness": "0/1", "author": "Citylights"}, {"rating": 5.0, "review": "I absolutely love this. It's easy to use, barely has any lag, and it's a powerful little stick. Well worth the money. Hulu, Netflix, and Twitch work excellent. Streams really well, and tons of apps to get.", "verified": true, "helpfulness": "0/1", "author": "Josh"}, {"rating": 4.0, "review": "Love the fire TV stick. Wish I could get more games but it's literally everything you could need for streaming.", "verified": true, "helpfulness": "0/1", "author": "Kristina McKennon"}, {"rating": 1.0, "review": "Unable to get the internet on this item", "verified": true, "helpfulness": "0/1", "author": "Thomas C. Vought II"}, {"rating": 3.0, "review": "I was a little disappointed.  I guess I was expecting more from this product than what I got.  I did not realize I would have to pay for most everything I want to use on here.  The product itself is excellent just didn't realize I couldn't get more from it.", "verified": true, "helpfulness": "0/1", "author": "Stacey Stockman"}, {"rating": 5.0, "review": "I installed this on my bedroom TV. So far I have only used it to watch Netflix. It's easy to use and works great.  Definitely worth the price!", "verified": true, "helpfulness": "0/1", "author": "Amy S"}, {"rating": 5.0, "review": "Best purchase ever! I pay 1/3 what my cable used to be and I get customized content. The set up was simple and the picture is great.", "verified": true, "helpfulness": "0/1", "author": "john hubbard"}, {"rating": 5.0, "review": "Love it, had Chromecast already. The interface is nice, very easy to navigate. The remote is a huge plus. I would say this is better than Chromcast due to that interface and the integration of Prime movies, tv, etc. Only function I like from Chromecast that I miss is being able to stream content from my phone directly to the TV. Still, very happy with the purchase", "verified": true, "helpfulness": "0/1", "author": "J. Forsythe"}]