[{"rating": 5.0, "review": "I love my Fire Stick!  It is great for streaming Amazon Prime movies and tv shows!  It is also great for Netflix, YouTube, Hulu Plus, and Pandora!  I am obsessed!The only downside is that it needs to be plugged in to work, but as long as you have an outlet near your tv it is a great product!", "verified": true, "helpfulness": "1/1", "author": "K. Cunningham"}, {"rating": 5.0, "review": "Finally have this connected to my new to me network wi-fi wireless router. It is very important to do your research when considering this device for your setup as it needs an active internet to connect with. If you do not have a wi-fi wireless capable computer like me, you can purchase a separate wi-fi wireless router and switch its internet address to 192.168.2.1. The more expensive way is to just purchase the Fire TV which is wired and wireless capable. My setup works with a total of $52.97 ($39.00 for the Fire TV Stick and $13.97 for the wi-fi wireless router) for the compared to the Amazon Fire TV ($99.00)Either way your internet speed is related to what else is sharing your ISPs internet connection based on my personal experience...", "verified": true, "helpfulness": "1/2", "author": "llponce \"llponce\""}, {"rating": 5.0, "review": "Love it. I'm so glad I bought this when it was on sale for $20 because this is so awesome.  I put it on my guest TV and I've watched movies from Amazon prime account and I'm going to setup my Netflix too.", "verified": true, "helpfulness": "1/1", "author": "Cutie"}, {"rating": 5.0, "review": "Works great. All as promised.", "verified": true, "helpfulness": "0/0", "author": "Michael R Rubin"}, {"rating": 5.0, "review": "I got this when they offered it for $19. It performs 95% as well as my Fire TV Box.  The only difference I notice is a VERY SLIGHT delay in response as compared to the Fire TV. But for an HDMI dongle, it is AMAZING. It has so much more functionality than Chromecast.  I use it in my downstairs (basement) but the wifi works perfectly and I have never had any buffering problems. It is lightning fast and well worth the money.", "verified": true, "helpfulness": "0/0", "author": "russ5811 \"russ5811\""}, {"rating": 4.0, "review": "Useful gadget if you have prime", "verified": true, "helpfulness": "0/0", "author": "M. Turton \"mitchly\""}, {"rating": 3.0, "review": "It is okay for what it is.  Glad I bought it at the $20 pre-releease price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"jgh1204\""}, {"rating": 5.0, "review": "Love it, love it, love it!!  Setup was so easy and we are enjoying our Prime Videos.", "verified": true, "helpfulness": "0/0", "author": "Patricia"}, {"rating": 5.0, "review": "Advantages vs. Chromecast:* Actual remote. Chromecast uses your phone. If it disconnects from the WiFi for any reason, you're left without any way to control content. Not a problem with this device.* It includes Amazon Prime as well as pretty much all the services included in Chromecast.* It was 1/2 price when I bought it.Disadvantages vs. Chromecast:* No Comedy Central casting via app. Need to use Hulu Plus (add'l $$)", "verified": true, "helpfulness": "0/1", "author": "Menashe"}, {"rating": 5.0, "review": "LOVE my Fire TV stick.  I turned my dumb TV into a smart TV instantly. And the stick is small, like the size of a regular USB drive.  It doesn't stick out at all or get in the way. No one even know's its there. The remote comes with batteries. It comes packaged in a great little box. This was such a great deal. You can give it as gifts!The stick itself works great so far. I love the easy to use/navigate user interface. When I plugged it into the hdmi input on my flat screen tv and powered it on, it was already linked to my Amazon Prime account. I guess it came that way and it made set up even easier for me. I can access and stream all the digital media that I bought on Amazon, even play my music on my TV. It was also simple to log-in to my other accounts (Netflix, Youtube, etc.) I was up and running in less than 5 minutes.I get great streaming when my internet is working well, but where I live, I'm only offered Time Warner wh ich is not that great. But that is not the Fire TV stick's fault at all. I would get more to upgrade my other TVs. Just make sure the TV you want to install this on has a HDMI input.I haven't tried to use the other capabilities just yet (like \"flinging\"). I can't wait to try. However, I will say that the Fire TV Stick is already a great deal for what I'm using it for. I would recommend this and buy more.I would recommend this.", "verified": true, "helpfulness": "1/1", "author": "molu"}]