[{"rating": 5.0, "review": "I am so glad I bought this. It connected after three tries, mainly because I had password trouble. However, it works just fine. I have been on YouTube and watching that on a full size screen is fabulous. The content available to Prime members is vast. This is a wonderful purchase.", "verified": true, "helpfulness": "0/0", "author": "L. Schad \"lschad\""}, {"rating": 5.0, "review": "I LOVE LOVE LOVE this thing!!!! I was already a Prime member and bought it when it was on special for members. I have to admit it wasn't sent out right away. I think I had a month or more to think about whether I really needed/wanted this thing. I  almost cancelled it on more than one occasion. I had originally purchased it for the bedroom because I have the newest Roku for the living room but the more time that passed the more I thought I really didn't need it and probably wouldn't use it. I was wrong. I like it better than the roku with the only exception being that the Fire TV Stick doesn't carry Acorn TV. I'm hoping they will soon. Amazon if you are reading this please please add Acorn TV ASAP. I know I'm not the only one who watches it. As I said other than that I love it. I didn't buy the voice activated remote because I have a smart phone and downloaded the remote app which does all the same things so I saved money there. The games are better than Roku, the remote is way easier and just overall my whole family enjoys it more. And lets face it for the money how can you beat it. I mean even for the Prime itself it's a deal! We get the music, the movies, the two day shipping which I use the heck out of around Christmas and birthdays (well and way too much all the rest of the year). Amazon as far as I'm concerned goes out of it's way to treat it's customers well in most ways and Fire TV Stick is another great service.", "verified": true, "helpfulness": "3/3", "author": "P. Schuhmacher \"Mom 2 four\""}, {"rating": 5.0, "review": "Love the Fire Stick.  Took 2 minutes to install. I'm going to order 2 more for my kids rooms. Cheaper then buying a smart tv.", "verified": true, "helpfulness": "0/0", "author": "jill jones"}, {"rating": 5.0, "review": "Very simple to install, had it up and running in less than 30 minutes.  It was better than I had expected, think I am goingenjoy it for a long time.", "verified": true, "helpfulness": "0/0", "author": "NOT K"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "ROBIN H."}, {"rating": 5.0, "review": "It is incredible!  The movies we now get are fantastic.  We don't have to pay for them, go to the store, just point the clicker and watch.", "verified": true, "helpfulness": "0/0", "author": "Lucy"}, {"rating": 5.0, "review": "after taking all the little components out of the very nicely boxed Fire TV Stick... the hardest part was opening the back of the stick to put in the batteries. Once I had it plugged in to my TV, connected WIFI and set it up it took 15 minutes total.unlike my Samsung Smart TV I have to switch to input 3 to view the Fire TV.", "verified": true, "helpfulness": "0/1", "author": "M. Boxer \"SSGMIke.Ivy\""}, {"rating": 5.0, "review": "We just expected there to be more free movies. So far everything we've wanted to watch has been at least $3.99. As far as how it works, it's fine.", "verified": true, "helpfulness": "0/0", "author": "M. Lounsbery"}, {"rating": 5.0, "review": "I couldn't believe how easy it was to install.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 4.0, "review": "I think this page is incredibly misleading.  We like our Amazon stick, but to be clear: it has to be plugged in to an AC outlet.  I guess I could have figured that out from the fact that it shows that it comes with an AC-adapter.  But none of the pictures show them using the AC adapter and it's not mentioned in the section describing its portability, which implies that all you have to do is plug it into the TV.", "verified": true, "helpfulness": "2/4", "author": "Noah Rosenthal"}]