[{"rating": 4.0, "review": "I am loving it so far. I think it is a hands down winner vs my Roku (which is no slouch either)", "verified": true, "helpfulness": "0/0", "author": "John in O Town"}, {"rating": 4.0, "review": "What's not to like?", "verified": true, "helpfulness": "0/0", "author": "HDP \"Geocacher\""}, {"rating": 5.0, "review": "I got this when it went on sale for $20 as a backup to my computer system which is connected to my TV. Pretty cool little device, lots of great features, and even at $39 it is a good dea.", "verified": true, "helpfulness": "0/0", "author": "Michael Harrington \"msharrington315\""}, {"rating": 5.0, "review": "Excellent product... I will buy a couple more for my kids...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works as it should and for the initial Prime offering price is very nice.  There is an adapter if you need to get it into an HDMI slot with cramped access.  The problem is that adapter causes problems.  With it, I couldn't connect to accept my LAN's security.  Without the adapter, it worked perfectly.  Let's remember though, the basis of these things is that you have to pay for service from a source, like Netflix or Hulu plus, etc.  If you have Prime, you can get some of their limited media, but very often, they have the first year of a show for free, but not the second, or something like that.", "verified": true, "helpfulness": "0/0", "author": "GG \"gg reviews\""}, {"rating": 5.0, "review": "Plugged it in as directed and everything works great", "verified": true, "helpfulness": "0/0", "author": "leket"}, {"rating": 5.0, "review": "Arrived very late from Best Buy.Otherwise, an awesome device. Smooth access to all media, including Home Server with XMBC.Want another.", "verified": false, "helpfulness": "0/0", "author": "MHguy"}, {"rating": 5.0, "review": "One of the best things I've purchased.", "verified": true, "helpfulness": "0/0", "author": "Granny"}, {"rating": 3.0, "review": "Works great just wish it had more apps like vudu and etc", "verified": true, "helpfulness": "0/0", "author": "Liza Cobb"}, {"rating": 4.0, "review": "I was using the instant video app from the xbox 360 but this is really the way to get the full value from Prime and the device. Kind of annoying my Samsung smart tv is one of very few that don't have the Amazon app for download but $25 on black friday i just got the stick and problem solved.", "verified": true, "helpfulness": "0/0", "author": "Jcmedia918"}]