[{"rating": 5.0, "review": "Works great and with no lagging. I recommend it,  Very easy installation.", "verified": false, "helpfulness": "0/0", "author": "chaz"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "RENEE GASKILL"}, {"rating": 5.0, "review": "The Firestick exceeded my expectations.  First, it was easy to setup.  Second, the selection of movies through Amazon's streaming video compares to both cable and Netflix.  Last it is preloaded with apps to get you started right away. The interface is very organized and easy to use, making it easy for most. I'm super super happy I made this purchase.", "verified": true, "helpfulness": "0/0", "author": "Cameo Moorefield"}, {"rating": 1.0, "review": "i really liked it but I have to rent the movies,i  was under the empression  the films where free to  watch ,it took me  3 mo nths to buy the fire stick.", "verified": true, "helpfulness": "0/0", "author": "thomas hartzell"}, {"rating": 4.0, "review": "so far i really like this gadget", "verified": true, "helpfulness": "0/0", "author": "Angelo de la Torre"}, {"rating": 5.0, "review": "Good job on this", "verified": true, "helpfulness": "0/0", "author": "A.SANTOS"}, {"rating": 2.0, "review": "Terrible Internet reception wish I had not purchased 2 of them. All of my other devices work great this is the only one that doesn't work.", "verified": true, "helpfulness": "0/0", "author": "Kara"}, {"rating": 5.0, "review": "Greattttt", "verified": true, "helpfulness": "0/0", "author": "dee wright"}, {"rating": 1.0, "review": "I bought this because the description said it could host MLB.TV. However, I have yet to watch a single game, because the processor is so slow, the games pause and buffer for 30 seconds every 15 seconds. This is NOT truth in advertising. Had I known it wouldn't have the bandwidth to process a MLB game (same for the replays), I would have never bought this thing. Total waste.", "verified": true, "helpfulness": "0/0", "author": "MMiller"}, {"rating": 5.0, "review": "It's cool, and definitely more diverse than Apple TV since it allows you to run your amazonprime.", "verified": true, "helpfulness": "0/0", "author": "Booker Edder"}]