[{"rating": 5.0, "review": "The Fire Stick has turned our old TV into a new smart TV! At the tip of our fingers we have access to unlimited shows with our Prime membership! Every night after we get the kids to bed, we jump in bed and browse all the goodies and with a click start watching shows and movies. Best purchase we've made in a VERY long time!", "verified": true, "helpfulness": "0/0", "author": "Gabby"}, {"rating": 5.0, "review": "Works great.  Better than ATT Uverse for reliability.", "verified": true, "helpfulness": "0/0", "author": "John - Automotive Engineer"}, {"rating": 5.0, "review": "I love the fire stick. Its easy to use (very intuitive), has snappy search results, and great HD picture quality. I gave away both my Roku player and chromecast on the tv where the fire stick, knowing that this is the best to use with Amazon prime. My only complaint now is that I can't get HBOgo yet. I'm a very impatient guy so this waiting is killing me. I know its coming so when it gets here it will be like getting a whole new fire stick to play with. Buy this item. You will not be disappointed.", "verified": true, "helpfulness": "0/0", "author": "lewsurfer"}, {"rating": 4.0, "review": "It works as aspect-ed. Too Bad I can't include the stick operation on my universal remote TV control", "verified": true, "helpfulness": "0/0", "author": "B Kuler"}, {"rating": 5.0, "review": "Love it!!! Can stream my Netflix and more now!!! Plus amazon prime has so much to offer!", "verified": true, "helpfulness": "0/0", "author": "Firefighter in Florida"}, {"rating": 4.0, "review": "Super fast shipping!! Great price, easy to install and works great!!", "verified": true, "helpfulness": "0/0", "author": "tracy stewart"}, {"rating": 5.0, "review": "Didn't know what I was missing!  I now get to watch some of my favorite shows and movies anytime I want.  And so easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Nighthawk \"Nighthawk\""}, {"rating": 5.0, "review": "Apparently there are a lot of \"lemons\" in this device. I guess I got lucky. I haven`t had any problems at all.I was up and running in no time. Also Amazon went out of there way to help me with another issue with the shipment of this device. So five stars there also. I hope their quality control improves. When I see almost 2000 one star reviews that worries me.", "verified": true, "helpfulness": "0/0", "author": "Norm Brooks"}, {"rating": 5.0, "review": "We have 5 of these, and they are fantastic. We just have these plugged in to each TV, and the TV is mounted on the wall, very simple and low power. The phone app is fantastic as well.", "verified": true, "helpfulness": "0/0", "author": "John Palmer"}, {"rating": 1.0, "review": "I wanted to love this product! I am a serious Amazin fan. It is the only site I but off of! In comparing this to my Roku it is much slower and loses connection frequently. Which is frustrating! The remote makes loud clicking noises when it is used which wakes up my husband when sleeping at night. The fast forward buttons don't really tell you how fast it's going and if you're watching HULU I find myself watching a lot of commercials because of trying to find where I left off. I will be selling this product in craigslist and buying another Roku for my bedroom. It just isn't worth all the trouble.", "verified": true, "helpfulness": "1/1", "author": "Jennifer Michael"}]