[{"rating": 5.0, "review": "Love it! We also got the voice activated remote. Works great!", "verified": true, "helpfulness": "0/0", "author": "Mr. and Mrs. VV"}, {"rating": 5.0, "review": "Great little product for Prime members! Streaming quality of amazon content is surprisingly good. Convenience of the remote (compared to tethering my Kindle via HDMI cable) is a welcome addition to our viewing experience. Love the screensaver slide show, too. Haven't tried it with Netflix or any other providers/games.", "verified": true, "helpfulness": "0/0", "author": "Constance J Claffy"}, {"rating": 5.0, "review": "Worth every penny. I have used Amazon streaming video for a couple of years now thru a PS3, but this is so much better, easier & completely reliable & it's a breeze to set up. Watching Youtube on an HDTV is worth the cost, but there is so much more! Can't recommend highly enough.", "verified": true, "helpfulness": "0/0", "author": "John Feehan"}, {"rating": 5.0, "review": "Addicting, started watching shows that I usually never watch. Finished several seasons of a couple of shows.", "verified": true, "helpfulness": "0/0", "author": "Keith Honaker"}, {"rating": 4.0, "review": "Great to use in lieu of a smart tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's a great item to have finally able to get out of all the cable b.s. and watch the movies and programs I want to watch when I want.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow, what a cool little device.  I've been paying for Prime for years, so adding this was like getting an entire movie service for free.  Highly recommended for Prime members.", "verified": true, "helpfulness": "0/0", "author": "Michael Michel"}, {"rating": 3.0, "review": "Purchased to specifically access WatchESPN's live streaming web broadcasts.  Can view archived broadcasts, etc., but live streaming of current games is not accessible unless you have already purchased either cable or satellite TV, defeating purpose of purchase.", "verified": false, "helpfulness": "0/0", "author": "Steve R. Wright"}, {"rating": 4.0, "review": "I like it a lot but I have trouble downloading apps", "verified": true, "helpfulness": "0/0", "author": "jamie joy huff"}, {"rating": 5.0, "review": "Best purchase!", "verified": true, "helpfulness": "0/0", "author": "Amanda J. Miller"}]