[{"rating": 5.0, "review": "Amazing! Makes streaming easier than ever. I am going to buy another for my other TV!", "verified": true, "helpfulness": "0/0", "author": "Mel A"}, {"rating": 5.0, "review": "This thing is amazing... hands down better than my ChromeCast and outgoing Roku 2 XS!  Check out the XDA Forums for this (http://forum.xda-developers.com/showthread.php?t=2793823) there's so much you can do with this!", "verified": true, "helpfulness": "0/0", "author": "Matt C."}, {"rating": 2.0, "review": "The remote is quite light and cheap. The Firestick would not play Netflix even though that service workedperfectly on any of my other devices including a first generation Ipad. I spent a good 20 minutes on the phone with an Amazon techwho could not fix the problem. Was sent a replacement stick and that also did not work.", "verified": true, "helpfulness": "0/0", "author": "scenepainter"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Megan Middaugh"}, {"rating": 5.0, "review": "great product - happy with my purchase!", "verified": true, "helpfulness": "0/0", "author": "Tyla V."}, {"rating": 5.0, "review": "Works great and has lots of options", "verified": true, "helpfulness": "0/0", "author": "sabrina"}, {"rating": 5.0, "review": "Everything as promised", "verified": true, "helpfulness": "0/0", "author": "Jamison Jaworski"}, {"rating": 5.0, "review": "I really like the fire tv stick, I was looking for something else to watch all my Amazon prim shows and found it with the fire tv stick, along with other great at apps..", "verified": true, "helpfulness": "0/0", "author": "tara bath"}, {"rating": 2.0, "review": "I have found the Fire stick to be way too complicated for me.  Probably just me but in order to watch anything I have to go into the keyboard and type, slow and hard to do, heaven help you if you make a mistake.  I am sorry I bought this and don't recommend it to anyone.  I even spent a long time on the phone with a very nice lady trying to help me.  She helped with some of the issues but not the latest ones.", "verified": true, "helpfulness": "0/0", "author": "B. Hamilton"}, {"rating": 5.0, "review": "Ditched those ridiculous cable fees and I have no regrets. This is a great product and with prime membership it has replaced cable for my family.", "verified": true, "helpfulness": "0/0", "author": "lightdays"}]