[{"rating": 4.0, "review": "the control is a bit touchy  and when returning to a show half finished after several hours seems to start the show at the beginning.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 4.0, "review": "Really simple to setup, takes less than 1 min to setup. I have been using fire stick for over  year now. Works great to stream Netflix, Hulu, etc but just does not work to stream You Tube. Amazon has nailed this, as soon as you start the setup, fire stick knows who you are, your account info, etc. etc.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm totally in love with my fire stick. I would recommend everybody get one. You'll love it.", "verified": true, "helpfulness": "0/0", "author": "Sandi Blaylock"}, {"rating": 5.0, "review": "Very convenient. Glad I bought it", "verified": true, "helpfulness": "0/0", "author": "Sean kelty"}, {"rating": 5.0, "review": "Smooth and easy to set up and operate. Great play back. Easy to use menu. The remote app for smartphone makes it even easier to use.", "verified": true, "helpfulness": "0/0", "author": "2coldbeers"}, {"rating": 5.0, "review": "I was only going to give this four stars but then I decided it deserves five. I love this way better than my chromecast. A dedicated remote makes it fantastic. The only reason I was going to give it four stars is because it doesn't have Gary Busey saying \"Amazon fire TV stick, YEAAAH!!\" When it turns on.  Otherwise it's an amazing feat of technology.", "verified": true, "helpfulness": "0/0", "author": "Ryan Malek"}, {"rating": 5.0, "review": "Excellent works great", "verified": true, "helpfulness": "0/0", "author": "steven gabrielli"}, {"rating": 5.0, "review": "Extremely easy to set up.  You are watching great TV/movies in no time.  Previously Bought and returned the Chromecast one because it was taking forever to set up and never did work.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"juliasbooknook\""}, {"rating": 5.0, "review": "I really do like my Amazon Fire TV Stick. it is so quick & easy to use. Thank-you for making TV watching more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "arlene"}, {"rating": 5.0, "review": "I love watching tv on here. Great channel options and the picture is perfect hd. Makes me wish I cut the cord years ago.", "verified": true, "helpfulness": "0/0", "author": "Jennifer06"}]