[{"rating": 5.0, "review": "WOW!  Totally blown away by how easy it was to set up and use.  It's also faster than my DVD player that was streaming the internet.  The ONLY drawback is the round button on the top of the remote, which is the surf button.  It blends in with the remote so, darn, I then had to read the instructions on what that button was for.", "verified": true, "helpfulness": "0/0", "author": "Marcia Sliger"}, {"rating": 5.0, "review": "Fantastic", "verified": true, "helpfulness": "0/0", "author": "joseph lasky"}, {"rating": 5.0, "review": "I wish I had gotten it sooner!  I love it. Easy to set up with on screen instructions.", "verified": true, "helpfulness": "0/0", "author": "N. Darrow \"NY Nan\""}, {"rating": 5.0, "review": "The Fire TV stick has truly impressed me. I bought a non-smart TV with the intention of buying the fire stick, and I'm so glad I did. The stick basically turns your TV into a smart Tv for 40$. I absolutely love all the options. I'm still exploring, but thus far, I am SO pleased! GREAT purchase!!", "verified": true, "helpfulness": "0/0", "author": "Kirsten Massey"}, {"rating": 5.0, "review": "I love my Fire stick since getting rid of cable. But some app have a tendency to freeze. mainly hulu. Netflix constantly buffers and I have great internet service so that is not it.", "verified": true, "helpfulness": "0/0", "author": "Cherise Brown"}, {"rating": 1.0, "review": "I really regret buying this. I bought it in January and these problems occur EVERY TIME I have used it from now back to January. I have an HDX tablet and I thought this would be a good way to increase the accessibility of my Prime access so that I am not just watching it online or through the tablet. Unfortunately the Fire TV stick is really bad. Constantly stopping streaming, or just shutting down completely because it says there's no internet access. With my smart TV there are no problems like this with Netflix or Pandora. The Fire TV stick can't even work with my smart TV USB in. I have to alternate them. Don't buy this. It's honestly a waste of money.", "verified": true, "helpfulness": "1/1", "author": "Annapurna Raichur"}, {"rating": 5.0, "review": "Love the capabilities and for such a low price", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 4.0, "review": "We save a huge about of money not having cable/satellite and so far really enjoy Amazon TV", "verified": true, "helpfulness": "0/0", "author": "D. Lariviere"}, {"rating": 2.0, "review": "This stick was underpowered. It froze several times in the first few hours I used it. It's wireless antenna also seemed weak. I returned it and bought an Apple TV which I have had no trouble with.", "verified": true, "helpfulness": "0/0", "author": "Andrew Littrell \"IsaacDrewton\""}, {"rating": 5.0, "review": "INTRODUCTION :Honestly, I had heard about the Chromecast before this device. I also believe the Chromecast came out BEFORE this device, allowing this product to \"be better\" than the Chromecast, because they knew exactly what the Chromecast came with, and they could improve it.And that's exactly what Amazon did.Here is an honest opinion on the Fire TV Stick.BUILD :I will be completely honest here, I hate how this one looks. It's too blocky and long, and it's harder to place in the HDMI slot, especially if there is barely any room between the HDMI slot and the next blockage like my TV. The Fire TV comes with an HDMI extender, which is fine.The build quality seems okay, it's heavy just like the Chromecast.SOFTWARE / HARDWARE :Here's where this device shines. According to Amazon's comparison, this beats the crap out of Chromecast. Now, the extra $40 price tag on this device compared to the Chromecast's $35...well. It wouldn't be worth it if the Fire TV didn't come with a remote. That's where the steal comes from on this device, and honestly what makes it so much better than the Chromecast. This really seems like a Chromecast 2.0, because of the remote capabilities as well as the \"other\" features that come with this one that doesn't come with the Chromecast.CONCLUSION :So, is this worth the money? Yes. Honestly, if you were going to purchase one of these, I would highly recommend this one. This is like a Chromecast 2.0, because it comes with a remote and updated hardware.", "verified": false, "helpfulness": "0/0", "author": "Damion"}]