[{"rating": 4.0, "review": "Amazon Prime offers free movies with its Prine membership.  Firestick is perfect for a TV conversion to a smart TV.  AC cord is too short in length.  Good signal and clear picture.", "verified": true, "helpfulness": "0/0", "author": "ALP"}, {"rating": 3.0, "review": "It worked poorly with my broadband wireless Internet connection, albeit it faster than the required minimum.", "verified": true, "helpfulness": "0/0", "author": "Tim Baker"}, {"rating": 5.0, "review": "This is GREAT!", "verified": true, "helpfulness": "0/0", "author": "Kaylan Stahlsmith"}, {"rating": 1.0, "review": "We went through two. The first one overheated and locked up while trying to use it. We called customer support and they sent us another, agreeing that this was a problem. The second essentially did the same thing. We called the customer support line, and they said \"it must be something wrong with your system.\" The word system I feel would imply a setup more complex than taking a Fire stick out of the box and plugging it in to your HDMI port on your television. What is this \"system\" they spoke of? Either way it seems as though the product should've been tested more before releasing, and the customer support line needs to be more consistent with their support.", "verified": false, "helpfulness": "0/0", "author": "S. Ayres"}, {"rating": 5.0, "review": "best thing I ever did in my life, hands down!Love it!", "verified": true, "helpfulness": "0/0", "author": "C. McAuliffe"}, {"rating": 5.0, "review": "The Fire stick is amazing. I have used other products like the chromecast and i can tell you nothing compares to the fire stick. So far i have watched two complete seasons of a show and a few movies and not once did it stop to buffer. So not only do you get speed but you get other great options like being able to download apps and games, keep a list of things you want to watch, and find other shows that are like the show you are watching. I just cant believe that i wasted all that time and money on other streaming devices.", "verified": true, "helpfulness": "0/0", "author": "Eric Smith"}, {"rating": 5.0, "review": "Very nice as we don't have cable tv just the internet.", "verified": true, "helpfulness": "0/0", "author": "clf"}, {"rating": 5.0, "review": "Amazing, fun device at an affordable price.", "verified": true, "helpfulness": "0/0", "author": "Janice Hill"}, {"rating": 5.0, "review": "Very user friendly!", "verified": true, "helpfulness": "0/0", "author": "Kelsey"}, {"rating": 5.0, "review": "Opened up a whole new world.", "verified": true, "helpfulness": "0/0", "author": "Shirley Scott"}]