[{"rating": 5.0, "review": "Easy setup and great video image.", "verified": true, "helpfulness": "0/1", "author": "Kathy Grady"}, {"rating": 5.0, "review": "The Firestick was easy to set up and so simple to use. I would definitely recommend this to anybody who streams movies and games.", "verified": true, "helpfulness": "0/1", "author": "lisa welsh"}, {"rating": 5.0, "review": "I love having so many movie options at my fingertips. Easy to connect. Pleased with purchase.", "verified": true, "helpfulness": "0/1", "author": "Sunny D"}, {"rating": 3.0, "review": "here in Chile dont work fox and hbo go channel, but if for web work it", "verified": true, "helpfulness": "1/2", "author": "Felipe Ramirez"}, {"rating": 5.0, "review": "Very easy to hook up and instal", "verified": true, "helpfulness": "0/1", "author": "Aaron Murphy"}, {"rating": 1.0, "review": "This first one I ordered did not work. I have cable internet through X finity and my signal is strong. It works with all my other devices but not this one. I was on the phone with tech support for at  least one hour trouble shooting. Nothing worked. It kept saying it could not recognize my account and password for my internet. They sent me a new one. The second one was never delivered. It said it was delivered and never made it to my mail box which caused me to waste my time with customer support again. They then sent me a third one. The third one had the exact problem as the first one. I would not recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Nicole Despines"}, {"rating": 5.0, "review": "Really nice with good internet speed.", "verified": true, "helpfulness": "0/1", "author": "Peddi Raju. Pedda"}, {"rating": 5.0, "review": "Fabulous!!!", "verified": true, "helpfulness": "0/1", "author": "Willie Harper"}, {"rating": 1.0, "review": "They dont tell you upfront that its $99 a year and each channel cost at least $13 a month", "verified": true, "helpfulness": "0/1", "author": "Dennis A."}, {"rating": 5.0, "review": "I like it better than the old Roku that we replaced this with. We have so much more options with it. Had no problems with it except when we first set it up it was set in German. Since I don't know German, I couldn't understand the on screen instructions to finish setting it up. I had to call Amazon customer service which was awesome. It took about 10 minutes to find the number to call but when I did, I got through immediately and they walked me through resetting the language to English. It took about a few minutes to set up and the rep. was patient and helpful! He waited on the phone until he was sure that everything was working well.", "verified": true, "helpfulness": "0/1", "author": "John F"}]