[{"rating": 5.0, "review": "Tons of storage!", "verified": false, "helpfulness": "1/1", "author": "Leah Gross"}, {"rating": 4.0, "review": "I don't have cable so I'm enjoying my fire stick", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Yeah...no more fascist cable & dish providers for me. Love the firestick. Still finding new stuff every time I use it!", "verified": true, "helpfulness": "1/1", "author": "Joel"}, {"rating": 3.0, "review": "This is the first review I have written about a product. I bought this a month ago. Every time I try to watch something (hulu, sling, etc) videos will hang when playing. Sling dosen't have many channels to choose from. I like the apple tv much better", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this!  Now I can actually use my Netflix on any t.v.! I originally bought it for my daughter to be able to watch movies instead of renting OnDemand movies, but she had to plug in her Playstation to use it.  Now I can use it too!  Anywhere!", "verified": true, "helpfulness": "1/1", "author": "sunny"}, {"rating": 5.0, "review": "Great device and love all the HBO movies I can now watch", "verified": true, "helpfulness": "1/1", "author": "JoAnna K."}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "1/1", "author": "kap"}, {"rating": 5.0, "review": "Best thing since sliced bread, we got this for Christmas and didn't use it a ton. However, the more we used it, the more we needed it. Now we cannot live without it!", "verified": true, "helpfulness": "1/1", "author": "Kristi"}, {"rating": 5.0, "review": "This 72 year old grandmom is not from the dark ages but, not a techie, was a bit nervous about hooking up the Fire TV Stick. I need not have feared. Thank you Amazon, it was easy. During a visit with our 16 year old grandson, I hooked it up; registered my WiFi password; Peter zoomed through the movies (showing me how easy it is); and we watched Steve Martin! My only problem was my Comcast WiFi signal kept going weak; stopping the movie for a couple minutes each time. Annoying but we managed to laugh and get snacks during the interruptions. I will have to deal with Comcast over this issue but as far as the Fire TV Stick, we are sure to watch a lot of movies.", "verified": true, "helpfulness": "1/1", "author": "Carol"}, {"rating": 5.0, "review": "Works good, Must have good wifi!!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"gmilbrat\""}]