[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Anj"}, {"rating": 5.0, "review": "Best investment", "verified": true, "helpfulness": "0/0", "author": "Darren Schokman"}, {"rating": 5.0, "review": "Works perfectly well. I got my money's worth. I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Mitch Littlefield"}, {"rating": 5.0, "review": "I love this thing. Canceling my cable.", "verified": true, "helpfulness": "0/0", "author": "Alexis Lindberg"}, {"rating": 4.0, "review": "Great product and Amazon Prime has great shows and movies. The only issue I've had with this product, is that suddenly it would not pair with my wireless network. It would see the network and give me signal strength, but no connection. Amazon replaced the stick promptly and I have not had another issue.", "verified": true, "helpfulness": "0/0", "author": "Clyde J. Corbin \"CJ\""}, {"rating": 5.0, "review": "Works incredibly well. Lots of apps to chose from both free and paid as well as the Prime video library. I haven't looked at my satellite TV since receiving the stick. I am seriously considering cancelling my satellite TV subscription.", "verified": true, "helpfulness": "0/0", "author": "H. Lawson"}, {"rating": 3.0, "review": "I swapped out a Chromecast for this because I liked the idea of having a remote, and was hoping Plex performance would be better. Not only does Plex perform far worse than the Chromecast, Netflix also skips and stutters far more than the Chromecast did. For the 25 bucks I paid for it on sale it's alright. I will probably put it in the guest room, being it has a remote it is much simpler to explain to guests how to use than a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Cory \"Cory Simpson\""}, {"rating": 4.0, "review": "Great.  So much bang for your buck in this stick. Just wish there was a usb connection available on it.  Was using a android tv box with an annoying blue light on the front. This works just as well and is hidden behind tv. Also wish it had volume controls on remote.", "verified": true, "helpfulness": "0/0", "author": "Les Hoff"}, {"rating": 5.0, "review": "My third one...can't beat the price!", "verified": true, "helpfulness": "0/0", "author": "minty"}, {"rating": 4.0, "review": "Love the price. Setup couldn't have been easier.  Software is somewhat clumsy though, especially trying to find your saved list of movie choices or trying to use the Kindle software version of the remote control. Very satisfied with the hardware for such a low price.", "verified": true, "helpfulness": "0/0", "author": "Moonjazz \"Moonjazz\""}]