[{"rating": 5.0, "review": "Just love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Better than Chromecast. The remote control makes all the difference, the smartphone-app use of streaming sticks gets old really soon.It uses any settings it receives from your wireless router, unlike the Chromecast, which only uses Google's DNSs, overriding your preferences for DNS-masking.You can't travel overseas with the Chromecast if you need particular DNS servers, but you can with the Fire Stick.A con could be that the USB power of many TVs is somewhat not enough for the Fire Stick, while you don't have that issue with the Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Ramiro Ferrer \"Ramiro\""}, {"rating": 5.0, "review": "Love the stick! It's more than what I expected it to be.", "verified": true, "helpfulness": "0/0", "author": "Aida B \"so many things, so little time\""}, {"rating": 5.0, "review": "Love this product. Small to travel with we bring it to the hotels with us.", "verified": true, "helpfulness": "1/1", "author": "T. Smith \"BZMAMA\""}, {"rating": 5.0, "review": "Awsome!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "joseph"}, {"rating": 5.0, "review": "Amazing product.", "verified": true, "helpfulness": "0/0", "author": "Erik K"}, {"rating": 5.0, "review": "Fire TV STick gave me more options than I anticipated. It has been wonderful.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "This little device works great. Make sure you have an open power outlet because the USB from some things isn't enough voltage to power it.", "verified": true, "helpfulness": "0/0", "author": "daniel gilbert"}, {"rating": 1.0, "review": "I cannot recommend this device AT ALL if you are a sports fan.  I was watching MLB in what I THOUGHT was \"real time\" and my sister got on her iphone and kept teasing me because I was 2 outs behind, due to constant buffering issues.  Traded the Amazon stick in for the Roku Streaming Stick and it is BETTER, but STILL the games lag behind on television vs. watching on my laptop.  Trying Roku 2 next...because no one wants their SISTER to be ahead of them by up to half an inning due to buffering issues.", "verified": true, "helpfulness": "0/0", "author": "Wayne Randall Morrison \"BOOTPUNK\""}, {"rating": 5.0, "review": "it is great. I had to buy one for every room in my home.. no kidding..", "verified": true, "helpfulness": "0/0", "author": "Orlando"}]