[{"rating": 5.0, "review": "Got the stick to turn my dumb tv into a smart tv. I love being able to stream my shows and movies on my big tv.", "verified": true, "helpfulness": "0/0", "author": "brock"}, {"rating": 5.0, "review": "Set up & navigation are a breeze.  Now I can get full benefits from my Amazon Prime membership. I like having viewing choices visible on TV screen instead of having to use my tablet as with Chromecast device.", "verified": true, "helpfulness": "0/0", "author": "HKSS"}, {"rating": 5.0, "review": "Fabulous product. Easy setup and wifi connectivity is excellent.  Access to Amazon prime, Netflix, Crackle, et.al. gives me the ability to cut the  cable-cord forever!", "verified": true, "helpfulness": "0/0", "author": "nyc2gf"}, {"rating": 5.0, "review": "Love Love Love", "verified": true, "helpfulness": "0/0", "author": "sfc"}, {"rating": 5.0, "review": "works really well just one more step to eliminate cable", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 3.0, "review": "I've had a chance to play with this and here are a few things to think about.This looks like a loss-leader for Amazon Prime but Amazon has to do a few things to make it really a good buy.1. The cost of this device is a little on the high side.2. The cost of Prime has to stop going up (or at least it has to go up in smaller steps).3. Amazon has to get some other networks to get on-board. Big Ten 2 Go would help a lot.4. An App for the iPhone/iPad that allowed you to use the phone or pad as a remote with a real keyboard is needed.* You have to use the charger that comes with it. I tried a regular iPhone charger and it doesn't provide enough power.The charger takes up a lot of space on your power strip.* It is easy to set up and there are lots of apps for it.* Navigation is easy and as you get your apps registered (Netflix etc.) they work well. Almost as good as the Apple TV.* Dual band WIFI is excellent. Works seamlessly. 5 Gig and 2.4 Gig.* We are an Apple house so the Apple TV still wins but I couldn't resist buying this when Amazon was selling them at a discount before they were released. I'm not sure I would pay full price for it yet but if Amazon keeps adding capability and Prime doesn't go up a lot (like it just did!!!) it could be a good buy. If you have Prime and like to watch the content on it, this is your device. Buy it.* Very compact.*This is the future people. In a few years, today's Cable and Satellite feeds will be history.", "verified": true, "helpfulness": "0/0", "author": "Kim from IA \"Kimo from IA\""}, {"rating": 5.0, "review": "I love it  ! It's all I watch !!!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer L. Baker"}, {"rating": 3.0, "review": "Pro:  Fast and good responsiveness, easy to setup, and amble number of apps.Con: Can't customize, Netflix video not playing with my 5 years-old 720p Samsung TV.Good price for the unit but if you have Netflix with an older TV you may receive an \"HDCP Unauthorized\" error.", "verified": true, "helpfulness": "0/0", "author": "Phi Nguyen"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amy Norton"}, {"rating": 5.0, "review": "It was exactly what I thought it would be. You need to be a prime member to have free access to a lot of the movies,tv shows,music and games. Everything else you have to pay for.", "verified": true, "helpfulness": "0/0", "author": "Howard Lee"}]