[{"rating": 1.0, "review": "Do not buy the amazon fire stick.A more worthless piece of garbage has yet to be invented. None of the apps (Netflix, Hulu plus, etc) work. They will not download and therfore will not function. Constantly drops wifi network, then when it picks it back up, excellent signal strength. No other device in my home does this. The amazon fire stick is an exercise in frustration with no end. It is truly sad. Avoid at all costs, I repeat, do not under any cirumstances purchase this item if you value your sanity or your relationships with your spouse or your children. Avoid.", "verified": true, "helpfulness": "0/0", "author": "truesubmariner"}, {"rating": 4.0, "review": "Overall I am happy with the Fire Stick. I do get a lot of buffering which makes it difficult to enjoy at times.", "verified": true, "helpfulness": "0/0", "author": "Kelli Roncancio"}, {"rating": 3.0, "review": "If you have Charter Communications for your cable provider you may want to think twice about buying this. HBO to Go and Showtime will not work on this as they do not have a contract with this cable provider, consequently you can't activate it....very disappointed. Everything else works well and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "SSGmail"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "carmen dupote"}, {"rating": 4.0, "review": "Works great while the chromecast was no good", "verified": true, "helpfulness": "0/0", "author": "Anne Bischof"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "john escobedo"}, {"rating": 5.0, "review": "So happy with it!  Learning more about it everyday!", "verified": true, "helpfulness": "0/0", "author": "S. Richards"}, {"rating": 2.0, "review": "Video streaming lags on Netflix application and response of controller gets slower the more I use it", "verified": true, "helpfulness": "1/1", "author": "Juan E Ayala"}, {"rating": 5.0, "review": "I am so glad I became a Prime member.  There are so many good movies available and tv shows.  The Amazon Fire Stock is easy to set up and easy to use.  I would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Kara K. Kasnias"}, {"rating": 4.0, "review": "Very easy to install, compares well with similar devices.  Offers more entertainment than Chromecast right now, at least of the things I want to watch.  No monthly fee required.  Unable to stream shows outside the USA, though.", "verified": true, "helpfulness": "0/0", "author": "Clarissa's heir \"Clarissa\""}]