[{"rating": 1.0, "review": "I received the UPS shipping label yesterday and will be returning product* today. When I adjust the volume on my vizio remote, it actually displaces the streaming, believe it or not. Note: if you've no internet, don't buy this device. It's required for its function but this piece isn't blatantly clear or disclosed. Phone calls only (not e-mail replies) to Amazon and Fire Stick customer service have been positive but it stops there. Weird to me that without Prime membership, this is the most outlandish costly gimmick. If you can't afford Prime or are not interested in it, don't buy this device. Prime Membership is not for everybody.* just the stick replacement only as the initial delivery included a faulty stick and it's been my hassle ever since", "verified": true, "helpfulness": "0/2", "author": "Michele Koppinger"}, {"rating": 5.0, "review": "This is a great little device. We've been Prime subscribers for several years now, and when I had the chance to pre-order this, I jumped at it. I like how easy it is to set up, and with the iPhone app we can even use voice search for free! My one little gripe is that it's not self-powered; it needs to be plugged in and therefore takes up one more outlet space along your media wall. I would think with a device this small it would be easy to self-power, especially over HDMI. Unless that's part of the planned cycle of forced obsolecense. But bottom line, great little device, and worth the money.", "verified": true, "helpfulness": "0/0", "author": "MFonz77"}, {"rating": 5.0, "review": "awesme", "verified": true, "helpfulness": "0/0", "author": "Stephen M. Strassner"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "pr0toKoL"}, {"rating": 5.0, "review": "It is great, we love it.  We were able to reduce out cable bill by over 50.00.  Love PRIme, too.", "verified": true, "helpfulness": "0/0", "author": "Janlyn"}, {"rating": 3.0, "review": "A lot of the value of this product depends on your broadband stability and speed.", "verified": true, "helpfulness": "0/0", "author": "GPops"}, {"rating": 4.0, "review": "I love this amazon fire stick. It is exactly what I was looking for because I wanted something to let me watch Netflix and Hulu and listen to Pandora on my TV. The only reason why I didn't give it 5 stars is because I don't like that I have to keep it plugged into the wall to keep it working. Just an extra wire to add to all the other crap I have hooked up. Other than that.. Great product", "verified": true, "helpfulness": "0/0", "author": "J. Gonzalez"}, {"rating": 5.0, "review": "Easy install and I love it", "verified": true, "helpfulness": "0/0", "author": "marjorie martinez"}, {"rating": 5.0, "review": "Overall really statisfied except for the fact they made me wait 2 months or so after I ordered it to finally receive it. What's 2 day shipping when it's on back order lol but ok I love it", "verified": true, "helpfulness": "0/0", "author": "rampaige"}, {"rating": 5.0, "review": "WHAT A GREAT LITTLE GADGET WORKS WELL I HAVE PRIME SO THERE'S THOUSANDS OF MOVIES TO WATCH...HAPPY WITH MY PURCHASE", "verified": true, "helpfulness": "0/0", "author": "gary gregorio"}]