[{"rating": 2.0, "review": "This device has potential, but it would be nice to able to see the \"free\" Prime videos that Amazon has without wading through all of them. Maybe it's just my internet, but the videos are constantly buffering, and they don't play through like on my Apple TV. For now, I think I will stick to my Apple TV. I love that thing. If Apple had the Prime Instant Video it would be unstoppable. Since I have both, I would highly look into an Apple TV if you are going to be a cord cutter. Hopefully, Amazon updates the UI in the future to be able to go straight to the free videos.", "verified": true, "helpfulness": "0/0", "author": "Ryan Lee"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Shawn"}, {"rating": 4.0, "review": "Looking at the specs I'm sure these will be a perfect gift for my parents who watch Netflix and want to do it without hooking up a PC to their TV. I can't believe Best Buy is selling these for less than Amazon and they are in stock!", "verified": false, "helpfulness": "2/4", "author": "Jeremiah P"}, {"rating": 5.0, "review": "This thing is great! Only thing I didn't like was the process of setting up the netflix app being that there were no directions on doing so. Other than that, loved how I got it for the price of $19.99 bc of being a prime member so Im really happy about that😁. I have the chromecast and the Apple tv. All are good in there own little ways but for the price of $19.99, Im most pleased with the fire stick!", "verified": true, "helpfulness": "0/0", "author": "Huey Le"}, {"rating": 5.0, "review": "Fire TV Stick Arrived just in time for Thanksgiving family get together.  Super easy to instal and connect to my wifi network.  Lots of free content from Amazon because I am a prime member.  However in the games, the FreeCell sucks, does not allow some moves.  But I did not get the Fire TV Stick for FreeCell and the rest works intuitively.  Glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Ralph Wheeler"}, {"rating": 3.0, "review": "A fine device but really doesn't do significantly more than the Roku I already had, unless I'm missing something.", "verified": true, "helpfulness": "0/1", "author": "Kevin Brown"}, {"rating": 3.0, "review": "Give us VUDU and I will love this!!!", "verified": true, "helpfulness": "1/2", "author": "mom of 3"}, {"rating": 2.0, "review": "I bought first one during prime promotion.  Frustrated to find out that shipping date is Jan 5, 2015 after purchased. BUT, it was available at Staples and BB last week. I can't wait and purchased another one. I was hoping since it is Miracast certified device, I could 2nd screen my Windows notebooks or Tablets. But I could not add as a 2nd screen from 4 different Intel based mirror cast capable Windows notebooks, tablets.", "verified": true, "helpfulness": "2/4", "author": "Ninjago_4445"}, {"rating": 5.0, "review": "Wonderful system", "verified": true, "helpfulness": "0/0", "author": "O's Ma \"Lisa\""}, {"rating": 4.0, "review": "What a pleasant surprise!  This stick actually made viewing movies on TV much more enjoyable - almost no buffering.  Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "MARC R TURGEON"}]