[{"rating": 5.0, "review": "I luv it!! Easy to install and very fast!!", "verified": true, "helpfulness": "0/0", "author": "maria rojas"}, {"rating": 5.0, "review": "I purchased this item, actually only because I seen it on the Amazon Prime Day event. I used this to replace the Roku in my front room. My large screen HDTV TV (older) did not have the right plug, but was able to plug in using an adapter, which I actually previous purchased for my son's gaming TV, but were not using. ( This is the one I have- https://www.amazon.com/gp/product/B00HXB73KE/ref=cm_cr_ryp_prd_ttl_sol_31)  Easy to plug in and use. I LOVE that I could use my Amazon Prime Music on my TV with this, I was unable to use Amazon Prime Music with my Roku. The app even will show lyrics if available for songs. Told my son, we could do karaoke night when his friends came over. (He did not like this ideal... teenage boy... who would think karaoke with mom would not be fun...LOL ) He did however LOVE the GAMES he could play on the Amazon Fire Stick. Games where cool enough, that he said, \"Wish there was a controller for this.\" HAHA Looked it up and guess what? There is a controller... that will be one of my next purchases... Many of them are FREE apps. It linked to my Amazon Prime Account- so that is a SUPER bonus.", "verified": true, "helpfulness": "0/0", "author": "Kissmyhalo"}, {"rating": 5.0, "review": "We love the fire stick. Much faster, and better quality streaming, than our Sony PS, Wii and Xbox.", "verified": true, "helpfulness": "0/0", "author": "Kristen Knutson \"savvyk10\""}, {"rating": 5.0, "review": "Love it! Easy interface and many apps to use.", "verified": true, "helpfulness": "0/0", "author": "Van B Huynh"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Patricia Fields"}, {"rating": 5.0, "review": "I haven't watched my satellite TV since getting this! I've had prime for over 2 years and watch shows and movies on my laptop or kindle and now to watch on my TV!  Very easy to set up and the streaming is great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Why didn't I buy one sooner. We don't have cable and after we bought this who needs cable. This thing is awesome.", "verified": true, "helpfulness": "0/0", "author": "Megan"}, {"rating": 2.0, "review": "Good reception but it really stinks that unlike my Roku it will not allow access to any news,weather, or business info other than a view bloomburg 2 minute clips", "verified": true, "helpfulness": "0/0", "author": "chick"}, {"rating": 4.0, "review": "Great for the cost and has tons of apps/movies!", "verified": true, "helpfulness": "0/0", "author": "Jones2026"}, {"rating": 5.0, "review": "Excellent time. Just as advertized..", "verified": true, "helpfulness": "0/0", "author": "Joe Randy"}]