[{"rating": 4.0, "review": "Easy to use, easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "Trudi Aase"}, {"rating": 1.0, "review": "Program dropouts. Add I have comcast Blast internet.So far it's not worth it. Plus price drop after I purchased.", "verified": true, "helpfulness": "0/0", "author": "Toby H"}, {"rating": 5.0, "review": "Excellent!Surpassed all expectations! Fire TV Stick installation is so easy!  The quality of streaming is incredible and without interruption -no buffering.  I purchased it for my husband for Fathers Day. He loves it and is enjoying it immencely.The Stick does everything expected and more.", "verified": true, "helpfulness": "0/0", "author": "Sunshine"}, {"rating": 2.0, "review": "Does NOT work with NetFlix.  Have tried every troubleshooting technique suggested on Amazon and on the user forum (clear Amazon Video, force stop, clear cache, delete data, unplug for 2 minutes, log out, log in, reset to factory settings, etc. etc. etc.  I have done all of the above multiple times.  Nothing works to get Netflix loading.  Netflix works on every other device in my home, so it is a Firestick problem, not a Netflix problem.  It worked for about a day, hence the 2 stars. If you are purchasing to use for Netflix streaming, beware.", "verified": true, "helpfulness": "1/1", "author": "HLM10028"}, {"rating": 5.0, "review": "Simple to set up, includes clear instructions, and is easy to use. My only regret is that I waited so long to enjoy my Amazon Prime Instant Video and Netflix on my big screen TV!", "verified": true, "helpfulness": "0/0", "author": "Vicki K. Schneider \"miss_vicki\""}, {"rating": 4.0, "review": "Could be better with less unnecesary content and more space for cache", "verified": true, "helpfulness": "0/0", "author": "Manuel M."}, {"rating": 5.0, "review": "So far I love the fire stick. I have both it and Google Chrome cast. This is much better to use like a television for watching netflix, HBO go or any other downloads.", "verified": true, "helpfulness": "0/0", "author": "curtis pauli"}, {"rating": 5.0, "review": "This thing beats my Roku hands down!  The interface is easier and quicker.  I love how easy it is to set up.  The remote works simply and easily.  The screen saver photos are beautiful too.  This is a great product I would buy over a Roku any day.", "verified": true, "helpfulness": "0/0", "author": "Cheree Carlson"}, {"rating": 3.0, "review": "We have just retired.  We purchased the Fire TV Stick because we now expect our lives to be very mobile, seeing the United States from an RV.  This means the input will be cellular data.  The Fire TV Stick is small, easy to set up, and plenty fast for our desire to watch movies, etc.  We don't play games.Sadly, for this purpose, the Fire TV Stick isn't usable.  Cellular data is limited and expensive.  There are two things the Fire TV Stick must have to be useful as a mobile device:1: An across-the-board governor to allow the user to select image quality/bandwidth no matter what you are watching.  This would allow the user to choose standard or low if desired.Most streaming services will choose the best quality/bandwidth supported by the data service.  Cellular data service can be very fast.  The first (and only) TV show we streamed selected HD and used 3G per hour.  That translates to $30 per hour.  Way too rich for our budget!2:  The option to turn off ASAP.  This one is so obvious that Amazon should have considered it.  When using cellular data, you sure don't anything downloading other than what you are watching.Sadly, we cannot find a use for the Fire TV Stick since we cannot control the image quality and the amount of data it uses.  If Amazon fixed the above two items, I would give this product 5 stars.", "verified": true, "helpfulness": "0/0", "author": "ElaineJ"}, {"rating": 5.0, "review": "So easy to use and takes up no space!", "verified": true, "helpfulness": "0/0", "author": "Debra Smith"}]