[{"rating": 5.0, "review": "It's Great I love it", "verified": false, "helpfulness": "0/0", "author": "Richard Wiggins"}, {"rating": 4.0, "review": "Seems to keep dropping the wireless connection (only device in the house with that problem).  Otherwise seems to work OK", "verified": true, "helpfulness": "0/0", "author": "John T. Weigelt"}, {"rating": 4.0, "review": "Works great!  Only issue is it doesn't have a very fluid motion when streaming netflix, and it loses wifi connection sometimes.", "verified": true, "helpfulness": "0/0", "author": "n_charpy89"}, {"rating": 4.0, "review": "Overall I'm quite happy with the fire stick. My biggest complaint is that it doesn't support the CBS app. Since a large portion of what I watch is CBS, it's disappointing to have to watch those shows on my computer. Had I done a little digging before, I might have purchased a Roku instead.", "verified": true, "helpfulness": "0/0", "author": "Britt I Nygaard"}, {"rating": 1.0, "review": "High expectations. Did follow instructions and tried it with a windows laptop, a windows tablet and an android tablet. All rather new. None of them allowed me to mirror my computers on the TV'", "verified": true, "helpfulness": "2/2", "author": "Max Winkeler"}, {"rating": 5.0, "review": "love this.....it should be good for traveling and keeping my amazon video's convenient.  Glad they included the extender cable as my tv needed it.", "verified": true, "helpfulness": "0/0", "author": "alldancergirl"}, {"rating": 5.0, "review": "plug in play was easy downloaded the app for the phone Android and it works as advertised very good product I recommend it", "verified": true, "helpfulness": "0/0", "author": "r garcia"}, {"rating": 1.0, "review": "It wasn't what I expected!! It keeps freezing up.", "verified": true, "helpfulness": "1/1", "author": "Deadra Shelton"}, {"rating": 5.0, "review": "The Fire Stick has so much available content. I would give them out as Christmas gifts, but they won't be back in stock until January.", "verified": true, "helpfulness": "0/0", "author": "Footdoc"}, {"rating": 1.0, "review": "I am totally disappointed in Amazon customer service when it comes to this device.  My stick keeps giving me \"can't connect\" when entering my Wi-Fi password, and yes, I know, it's case sensitive and yes, I know I input it correctly.  I spent an enormous amount of time with a tech who concluded the stick was defective and sent another.  Same problem with that stick.  This time, customer service bounces me back and forth between countries, with each level of assistance more clueless than the one before it.  I can see from the questions posted that I am not the only one with this problem.  I guess I will just return these pieces of garbage and get a second Roku box- never had any problems with Roku and it is  actually much cheaper if you factor in the hours of time I have wasted troubleshooting the firestick.", "verified": true, "helpfulness": "5/6", "author": "Lidgemeister"}]