[{"rating": 1.0, "review": "it works great on my kindle-does not work on my galaxy s5 or my verizon tablet, can't find any phone numbers for help-might return", "verified": true, "helpfulness": "0/1", "author": "joseph musso"}, {"rating": 5.0, "review": "No need to buy a keyboard remote, just download the app.", "verified": true, "helpfulness": "0/0", "author": "amanda graham"}, {"rating": 1.0, "review": "Didn't work for our television.Returned for a full refund.Don't waste your time or money, invest in Hulu and or Netflix.", "verified": true, "helpfulness": "0/1", "author": "Hannah Morgan"}, {"rating": 3.0, "review": "I have a Chromecast, and I recently got the Fire TV stick. So far, I like the stick better, because it allows access to Amazon Prime content I'm already paying for as a Prime member.The biggest downside to the Fire TV stick that I've seen so far is a lack of volume control. The Chromecast app for Android (and I assume iOS) can control your TV's volume. The Fire TV stick remote (hardware or software) can't, for some reason.", "verified": false, "helpfulness": "1/1", "author": "Alan"}, {"rating": 4.0, "review": "easy to install, almost as good as the amazon fire.", "verified": true, "helpfulness": "0/0", "author": "annette leach"}, {"rating": 3.0, "review": "Streaming issues with Plex.  For higher quality streams, constant buffering and occasional stopping.  I have one of the fastest wi-fi dual band routers on the market and never experienced this with my Roku or Fire TV Box so I am fairly certain it's a hardware issue with the Stick.", "verified": true, "helpfulness": "0/0", "author": "J. Anderson"}, {"rating": 5.0, "review": "Best thing I ever did....brought my first generation HD big screen back to life with brilliant color, ease of access and unlimited viewing capabilities, wow  then it stop working", "verified": true, "helpfulness": "0/0", "author": "Alan Duncan"}, {"rating": 5.0, "review": "Works well through wifi, never an issue, good variety of shows, easy to upload photos", "verified": true, "helpfulness": "0/0", "author": "Chris Bell"}, {"rating": 3.0, "review": "The first Fire TV Stick I received had some sort of glitch - after working with 2 tech support people for around 2 hours they decided to send me another Fire TV Stick. The new Fire TV worked right away. It is very nice to have my netflix available on my TV screen. So far I am not that interested in the Amazon Prime movies.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "This is a fantastic streaming device... When it works. Do a search on \"Amazon Fire TV Stick HDCP.\" This device has a ton of problems with this blue screen of death that says \"HDCP unautherised. Content disabled.\" The worse part is that the menus displays like nothing is wrong. I can load Netflix or any streaming app on the Stick but once you go to stream content the blue sceen of HDCP shows up. So imagine you get home from work, you boot up the Stick, browse for 5 minutes until you find something to watch. Then you go to stream it and BAM blue screen of HDCP. Now you have to get up, walk over to the tv and unplug it, because that is so far the only sure fire solution. This is unacceptable. Every time I unplug my tv I risk damaging it and frankly it's not convenient.If it did not have this blue screen issue I would easily give this a 5 star rating but until Amazon patches this issue I can't give it more then 2 stars.", "verified": true, "helpfulness": "3/3", "author": "Chris J Fox"}]