[{"rating": 5.0, "review": "Only used this a few times, but it seems to work well and seems to load up faster than our old Roku did.", "verified": true, "helpfulness": "0/0", "author": "Ken Stults"}, {"rating": 4.0, "review": "I love it. As part of my goal to cut cable, the Fire Stick is great. So far with Sling TV as an add on, it's only costing me $20/mo. to get as much if not more TV than I want.  Great products.", "verified": true, "helpfulness": "0/0", "author": "Larry Resnick"}, {"rating": 5.0, "review": "This was our second fire stick and we love them!", "verified": true, "helpfulness": "0/0", "author": "Natalie Carroll"}, {"rating": 5.0, "review": "Enjoying", "verified": true, "helpfulness": "0/0", "author": "MKL"}, {"rating": 5.0, "review": "Easy to install and works great!I am not tech savy.  This was easy and I can now access Netflix on my TV instead of watching it on my pc.", "verified": true, "helpfulness": "0/0", "author": "Rita Cavataio"}, {"rating": 5.0, "review": "Great Product.", "verified": true, "helpfulness": "0/0", "author": "Doug K"}, {"rating": 5.0, "review": "Works as intended.", "verified": true, "helpfulness": "0/0", "author": "H. David Hill"}, {"rating": 5.0, "review": "love this thing!..download the app for your phone ..plug it into an hdmi port and enjoy an instant very quick and responsive smart tv!", "verified": true, "helpfulness": "0/0", "author": "adam"}, {"rating": 1.0, "review": "Not happy have had this for a week it shows network connected then when I go to access apps says I got no connection have restarted it doesn't fix it maybe got a defect one returning it", "verified": true, "helpfulness": "0/0", "author": "Sumer"}, {"rating": 5.0, "review": "Amazing. I have had Rokus in the past and still use them, but since we set up a den with no cable I didn't want to give up the plug in on my tv so I bought this. I ended up using it on the master bedroom television and it's my favorite. I typically watch more Prime so it just made sense to have the amazon stick in the bedroom. Really quick load up and super easy to use.", "verified": true, "helpfulness": "0/0", "author": "rae"}]