[{"rating": 4.0, "review": "Love it only downfall is having to keep the power cord plugged in.", "verified": true, "helpfulness": "0/0", "author": "Nicholas John"}, {"rating": 5.0, "review": "Yes it met my expectations and really love that it has a lot to offer.  The streaming is great, no interruptions and I can pick up where I left off at anytime.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Hood Martinez"}, {"rating": 1.0, "review": "We have the highest Internet we can have in our area and the fire stick is always lagging .. The picture quality is awful. Even tho I have a Samsung tv with 1080 60hz.  When I switch from the fire stick to my blu-ray player that has Internet on it, I have no problems what so ever.. I just don't like the lay out of it, I'd rather use the Fire stick.. Does the Fire tv work better ? Or is there a update on it?", "verified": true, "helpfulness": "0/0", "author": "carissa"}, {"rating": 1.0, "review": "No decided to not go with it.", "verified": false, "helpfulness": "0/0", "author": "Ayanna Swann"}, {"rating": 5.0, "review": "This is just what I was looking for to use with my Kindle Fire HD.  It was easy to install on my TV and easy to mirror the movies to the TV.I have had it less than a week and love how easy it is to maneuver the home page and find the movies that I want.  The movies are really close to the clarity that you see in the theater and the sound is wonderful.  Anyone who is a Prime member of Amazon and has a Kindle Fire HD will love this Fire TV Stick", "verified": true, "helpfulness": "0/0", "author": "Kathryn Diamond"}, {"rating": 5.0, "review": "Quite a bargain.  Easy setup and good pcture quality.", "verified": true, "helpfulness": "0/0", "author": "Sandra Folgers"}, {"rating": 5.0, "review": "Small, simple to use and easily transportable to use elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love this, because it eliminates the wiring hanging from my TV.  It is easy to set up and works with my prime and Netflix as well.", "verified": true, "helpfulness": "0/0", "author": "Silvia Solis"}, {"rating": 4.0, "review": "The Amazon Fire TV Stick is a very good value.  However, if you do not have Amazon Prime, or do not want to subscribe to it, this product is not for you.  The picture quality is good--better than it was by hooking up my laptop to the TV with an HDMI connector.  I would recommend this product to anyone who has Amazon Prime.  I am happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "I was pleased with how easy the set up was. The directions were clear and the video well thought out.I looked at another model but the fire stick was able to connect with more sites and programs.", "verified": true, "helpfulness": "0/0", "author": "dzreads"}]