[{"rating": 5.0, "review": "Great deal", "verified": true, "helpfulness": "0/0", "author": "Peter Galvin \"Pete G\""}, {"rating": 5.0, "review": "Amazing little piece of technology.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Karen Creech"}, {"rating": 5.0, "review": "I love my Fire TV Stick!  I watch Hulu and Netflix all the time!", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 2.0, "review": "I got this as a replacement for an older Roku that I primarily used for watching Amazon Prime videos and TV shows.  I had been happy with the Roku but it was taking up space and I thought the new Fire TV Stick would save some space on my shelf and that the Amazon application would probably be nicer than the app on the Roku.I was wrong about that; I found that there were several TV shows or specific episodes of series that, although included in Prime, would not play on the Fire TV Stick.  They would play on the Amazon Instant Video iOS app on my iPad, and they would play in my browser, but not on the Fire TV Stick.  Instead I would get a 'Available on Hulu Plus' link requiring me to subscribe to Hulu Plus to continue watching.I was halfway through  one series when I switched from the Roku to the Fire TV and even some of the episodes that I had already watched were no longer available or would give obscure error messages when I tried to watch those episodes.  Going back and watching them on my old Roku worked fine though.  I'm only speculating, but it seemed like the application was confused about whether to 'upsell' me to a Hulu Plus subscription or allow me to watch shows that were included in prime as well as being available on Hulu Plus.I did contact support via email, but they asked that I set up a call to help work out the problem with them on the phone and I really don't have time for that.  I ended up sending the Fire TV Stick back, spending an extra $10 for the Roku stick and am satisfied with that.The Roku Stick works out of the box without issues and if you just want to watch Amazon Prime Videos, the Amazon Instant Video app is simpler and its interface works better.", "verified": true, "helpfulness": "1/1", "author": "Patrick"}, {"rating": 5.0, "review": "Love the Firestick! Was so easy to connect to my television. It's great having prime and Netflix on bedroom tv.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Love the convenience of moving the stick from TV to TV.  Also that I can use my phone as a remote", "verified": true, "helpfulness": "0/0", "author": "pamela stewart"}, {"rating": 1.0, "review": "Huge dissapointment.  Device has worked once.  I can stand right next to it and stream on my phone or laptop using wi-fi but firestick says I have no internet connection  or that it is not strong enough.  Sad for a device specifically designed for streaming.", "verified": true, "helpfulness": "0/0", "author": "Jill"}, {"rating": 5.0, "review": "I had a Samsung BD player that died and I saw the Fire TV Stick and thought I might try it to go completely streaming for movies and TV. For the price you can't beat it. It was really easy to setup and I had it working 5 minutes after I plugged into my AV receiver. The interface is well done, easy to navigate, and very responsive. There's some great content on Amazon and as a Prime member it's even better. I'm very satisfied with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Phindog"}, {"rating": 3.0, "review": "When it works it's great, but half the time it shows up that I'm connected to the internet but yet still won't work.", "verified": true, "helpfulness": "0/0", "author": "Derek B."}, {"rating": 5.0, "review": "Fire TV Stick works very well.  It seems pretty easy to navigate.  Typing on the remote is a minor challenge, but better than some control units I have used.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]