[{"rating": 5.0, "review": "Love this thing.  Going to buy another to for the kids room and possibly a third to travel with.", "verified": true, "helpfulness": "0/0", "author": "RQuinn4 \"Mr. Q\""}, {"rating": 5.0, "review": "I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Eddie Parraga"}, {"rating": 5.0, "review": "Very pleased with my Fire TV Stick! Really easy to use from the start - I'm streaming Pandora, Netflix, and Amazon Music currently, and plan on using it more!", "verified": true, "helpfulness": "0/0", "author": "Marceline Dyer"}, {"rating": 5.0, "review": "I bought this for my sister, she likes it so much I think I will buy one for myself. easy to use and set up", "verified": true, "helpfulness": "0/0", "author": "tonyd"}, {"rating": 5.0, "review": "I love to listen to music as I clean, cook or just curl up with a book and I love watching the screensaver scrolling the most beautiful pictures as I watch. I wish they wouldn't stop till you turned off the tv instead of lasting only about 15 minutes. Please fix this so the screensavers keep scrolling till you turn off the music!! I also love the variety of choices and how easy it is to use.", "verified": true, "helpfulness": "0/0", "author": "D Jones \"Dot\""}, {"rating": 5.0, "review": "very handy device!", "verified": true, "helpfulness": "0/0", "author": "M. E. Murphy"}, {"rating": 5.0, "review": "Well worth the money and I have have cable, but still found it easierand cheaper to add this to my basement TV for the $40 instead of pay $10 a month for an extra cable box.", "verified": true, "helpfulness": "0/0", "author": "gibsontrout"}, {"rating": 4.0, "review": "We like it a lot and it has given us an alternative to paying crazy cable bills to watch shows that aren't in the normal timed, line up.  It could be a little more intuitive, but it's still worth it.  Now that we've got this, I'd like to cut my cable service.  A good purchase!", "verified": true, "helpfulness": "0/0", "author": "Jennifer L. Argentieri"}, {"rating": 5.0, "review": "It is almost like having cable! I love the fact I can pause a movie during the many interruptions I experience.", "verified": true, "helpfulness": "0/0", "author": "John L Hearn"}]