[{"rating": 4.0, "review": "I have a fairly quick internet service. its good enough to use 8 devices over wifi, but when this was added, and all other devices wifi was off, it still kept losing the signal. Finally, after moving the t.v. and taking the extender off and just having the stick plugged in to the hdmi, it finally works properly.", "verified": true, "helpfulness": "1/1", "author": "Mary Remington"}, {"rating": 5.0, "review": "great addition to my TV I was able to cancel pay channels from my cable company", "verified": true, "helpfulness": "0/0", "author": "harry"}, {"rating": 5.0, "review": "Makes everything so convenient.", "verified": true, "helpfulness": "0/0", "author": "Joseph Paul Freebairn"}, {"rating": 5.0, "review": "much better than the TV music stations plus there are TED talks, movies as a prime member its a must!", "verified": true, "helpfulness": "0/0", "author": "jan kummerr"}, {"rating": 4.0, "review": "I purchased this item because of the mobility to take it with me when I travel.  Although I like the product very much,  I was a little let down that I cannot connect to it in hotel rooms.  That was the whole point of it for me.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "S. Hill"}, {"rating": 5.0, "review": "Fire TV Stick is great.  It uses your wifi to connect your TV to Amazon Prime Video.  It is easy to use and works great.  I love my Fire TV Stick.  There are shows and movies for my wife and I and tons that my kids love as well.  5 Stars!", "verified": true, "helpfulness": "1/1", "author": "Caleb Lang"}, {"rating": 5.0, "review": "Love the Fire Stick.  It's easy to use. Lots of movies to choose from. I like that it's portable.", "verified": true, "helpfulness": "0/0", "author": "LaWanda Scrol"}, {"rating": 5.0, "review": "We are enjoying our Fire TV Stick. It does everything it says it will do. We are not gamers, so we havent tried that. Great item at a great price.", "verified": true, "helpfulness": "0/0", "author": "R. Jones \"Retired&LovingIT;\""}, {"rating": 5.0, "review": "Very smooth, intuitive navigation. Many more abilities than most streaming sticks, and affordable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]