[{"rating": 5.0, "review": "The Fire Stick is awesome! We pretty much only use it now. It kicks ass! Way to go Besos and whoever is getting underpaid so Besos can reap the Shizzdingle!", "verified": true, "helpfulness": "0/0", "author": "Chris R. Hatton"}, {"rating": 5.0, "review": "I love this product.  Im getting rid of my cable cause i can stream all my shows from amazon prime and youtube.  It was super easy to set up.", "verified": true, "helpfulness": "0/0", "author": "bigdchiwawa"}, {"rating": 5.0, "review": "It's awesome.  Admittedly a little bit glitchy from time to time, but rarely, and easily sorted out with restarting it....and TOTALLY worth the minimal hassle as compared to dealing with customer service from most cable TV providers, plus you can get near infinitely more shows and movies compared to TV.  Big thumbs up Amazon, you guys are awesome.", "verified": true, "helpfulness": "0/0", "author": "Gordon B."}, {"rating": 1.0, "review": "Slow when scrollingAfter using chromecast didn't dint it to be very user friendly", "verified": true, "helpfulness": "0/1", "author": "dappu"}, {"rating": 5.0, "review": "Easy to set up. Easy to use. I love it.", "verified": true, "helpfulness": "0/0", "author": "BJ"}, {"rating": 5.0, "review": "Great to catch up on my shows.", "verified": true, "helpfulness": "0/0", "author": "Dwight Sullivan"}, {"rating": 5.0, "review": "I works better than our smart tv...", "verified": true, "helpfulness": "0/0", "author": "Lucy"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "DawnKOStrutter"}, {"rating": 1.0, "review": "The potential is great, the operation is not. After five weeks of multiple calls to Fire support and my cable/wifi provider, I was told my Fire TV Stick had to be 5 (Five) feet from my wifi modem.Now the Fire TV Screen always said I had a \" very good \"connection and my cable company could \"see\" it was operating... But no streaming, no YouTube, Hulu, or BBC ( the latter two freebies).", "verified": true, "helpfulness": "1/2", "author": "Film Fan Scot"}, {"rating": 4.0, "review": "Works great just slow if you download a lot of apps", "verified": true, "helpfulness": "0/0", "author": "Chuck Johnson"}]