[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Motakaka \"kaka\""}, {"rating": 5.0, "review": "Better than most of the devices of the market.", "verified": true, "helpfulness": "0/0", "author": "Manuel F."}, {"rating": 5.0, "review": "Works great. Love that it runs android os. I have a 3TB hard drive that I have been using to watch movies on my ps3 for awhile now, however more and more my ps3 was giving my cinivi errors, and cutting movies off because I don't \"own them\" I got this because not only can I watch netflix and prime instant video on this rather than the ps3, but my router has a USB port, so I networked my 3TB hard drive to it, so its accessable over the network, and than sideloaded XBMB onto the firestick and now im watching all my movies wirelessly over my network in HD without anyone butting in saying I don't own them. This was a big issue when I was trying to watch Jurassic World!! It works great on the FireStick!!", "verified": true, "helpfulness": "0/0", "author": "Adam Alderman"}, {"rating": 5.0, "review": "Very user friendly .", "verified": true, "helpfulness": "0/0", "author": "silvia"}, {"rating": 4.0, "review": "Easy to install and use with the exception that no instructions accompanied how to open the battery case on the remote. I had to go online to solve this problem. Even then the picture of the remote battery cover was different than mine. It was only the instruction online that you have to use considerable pressure that finally solved the problem.", "verified": true, "helpfulness": "0/0", "author": "Niessie \"Truth Seeker\""}, {"rating": 5.0, "review": "Still having trouble with Fox download but everything thing else is great", "verified": true, "helpfulness": "0/0", "author": "marci ostroski"}, {"rating": 5.0, "review": "Awesome- good bye very expensive Comcast!!!!!", "verified": true, "helpfulness": "0/0", "author": "Brian D Ellwood"}, {"rating": 4.0, "review": "We love it. But would like to know how.to get fox news live on it and sports.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it works great", "verified": true, "helpfulness": "0/0", "author": "wayne brelsford"}, {"rating": 5.0, "review": "This product is excellent and was very easy to set up and worked well.  I watched movies on both amazon prime and Netflix without difficulty during a recent family trip.  For any future travel I'm taking this with me.", "verified": true, "helpfulness": "0/0", "author": "Gregory A Moffitt"}]