[{"rating": 5.0, "review": "This is an upgrade from the original Fire TV. It works very well, and is compact. Further, it plugs into the HDMI port, thus saving a lot of hassles. I have tried Netflix and it works very well. I had a Samsung blue dvd player which can also perform many functions like this one, but it does not have Amazon prime built in (it was an older model with many streaming channels missing). So must say I am very happy about it.My Fire TV broke down just after one year.  I hope this one will last.", "verified": true, "helpfulness": "0/0", "author": "Math Twain HY \"gij\""}, {"rating": 5.0, "review": "Works great and provides us with options. Love it!", "verified": true, "helpfulness": "0/0", "author": "Kimberly A Slater"}, {"rating": 5.0, "review": "Just started to use the Stick and find it fairly easy to use.  Just learning what is available to me and what has to be paid for is the trial!", "verified": true, "helpfulness": "0/0", "author": "Jerry McGhghy"}, {"rating": 5.0, "review": "Why have I been spending $130 on Direct TV?!?!?!?", "verified": true, "helpfulness": "0/0", "author": "rizz"}, {"rating": 3.0, "review": "The stick itself is pretty easy to set up and has quite a few apps on it, but it suffers from problems. The app lineup is pretty weak in some ways with some apps lacking features that are absolutely required for them to be useful.I've noticed that in some cases, I will be watching something,and the picture will get stuck. It happens a few times a day.", "verified": true, "helpfulness": "0/0", "author": "Samuel P"}, {"rating": 5.0, "review": "Very simple to work.  Had no problems using my Amazon Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Randall Tincher"}, {"rating": 3.0, "review": "Love the idea but it buffers all  the time  Very frustrating", "verified": true, "helpfulness": "0/1", "author": "sandy"}, {"rating": 3.0, "review": "I think the Amazon launcher is pathetic.  What were they thinking?  It's pretty aggravating to navigate.  This is really nice hardware.  A new launcher called firedtv sort of cures the launcher problem.  A guy shouldn't have to replace the stock launcher with something a kid cobbled together.  Boo on your launcher.", "verified": true, "helpfulness": "1/1", "author": "Sinistar"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Frances W. Vasquez"}, {"rating": 5.0, "review": "As Described, Thanks!!", "verified": true, "helpfulness": "0/0", "author": "Keith"}]