[{"rating": 4.0, "review": "Product works good. Lots of variety for shows and movies.", "verified": true, "helpfulness": "0/0", "author": "jimi3321"}, {"rating": 1.0, "review": "Package came open with nothing in it!", "verified": true, "helpfulness": "0/0", "author": "Nakiah"}, {"rating": 5.0, "review": "I love love love this device! We can now cut our satellite in half because of all the wonderful channels we have access to including music, movies, etc! We are going to up our internet speed so that the streaming doesn't hang or buffer too long. I can't say enough good things about this stick. Buy it!", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 5.0, "review": "Works great and is a good extension for TV programs and books.", "verified": true, "helpfulness": "0/0", "author": "Flora Dierbach"}, {"rating": 5.0, "review": "Awesome little gadget!~  Clear picture and easy navigation.  Much better than running Prime through my XBOX.", "verified": true, "helpfulness": "0/0", "author": "Yaskjustdo"}, {"rating": 5.0, "review": "Five minutes and it's done! Follow the simple directions and you're in Amazon land with many choices to pick from. I have a Vizio smart tv that I have had no end of problems keeping Netflix running. Constantly rebooting and endless buffering. No more! Fire Stick is fast and I can watch all the Netflix programs without any issues. I haven't delved into the other options for my Amazon Prime but I am looking forward to exploring them. I did bring up my playlists in my music on the Fire Stick and found I get lyrics with them now! Photos are next. May buy more for the other tvs that aren't \"smart.\"", "verified": true, "helpfulness": "0/0", "author": "Richard Braddock"}, {"rating": 5.0, "review": "Met my expectations!  Turned my pre-smart tv into a \"smart tv\" for now.  Now I can take my time purchasing my new tv while I wait to see what the market will offer over the next year!", "verified": true, "helpfulness": "0/0", "author": "A. Cerruti \"Music and Sew\""}, {"rating": 5.0, "review": "Perfect size, easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "Niko"}, {"rating": 2.0, "review": "Fire stick has several flaws honestly. Adjusting the screen ratio is a pain. Automatic app update doesn't work and the connectivity can be spotty from time to time. Have since purchased a Roku and have yet to have any issues.", "verified": true, "helpfulness": "0/0", "author": "Nikolas Blankenship"}, {"rating": 4.0, "review": "Nice that it's already set up with your prime account!  Only downfall is no vudu :(", "verified": true, "helpfulness": "0/0", "author": "S. Keiling \"bosox fan\""}]