[{"rating": 5.0, "review": "Awesome and very smooth interface. I was pleasantly surprised with everything except the stupid intro video.", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 5.0, "review": "Perfect addition to a second tv.", "verified": true, "helpfulness": "0/0", "author": "Kingwood Judy"}, {"rating": 4.0, "review": "very cool product, eliminated having to use my PS3 to stream amazon and netflix.  my only gripe is that they tuck netflix into a separate menu rather than it being instantly available.  i'll reserve judgement since they obviously want to promote use of their own streaming service first.  I wish I didn't need to plug it into a power source either.  it would be much more convenient if it could power from the tv.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "Good implementation with a polished UI.  Makes watching Amazon Prime video much easier given the streaming services isn't available on a host of other devices.  Very easy setup.  Bought one as a gift as well - and they love it.", "verified": true, "helpfulness": "0/0", "author": "ARLeggett"}, {"rating": 5.0, "review": "I love this thing! I asked for it for Christmas and it was my favorite gift. I love that its portable and has access to some useful apps already. The price is affordable and totally worth every penny compared to other options. Definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "ARS1709"}, {"rating": 5.0, "review": "I mostly use it for amazon prime videos and running the Plex app on my bedroom TV.  Both work great over wifi.", "verified": true, "helpfulness": "0/0", "author": "D. Gibson \"dobs\""}, {"rating": 3.0, "review": "It has a poor signal to our router. I have yet to figure it out. I'll update when I do.", "verified": true, "helpfulness": "0/0", "author": "Morgan O'Neil"}, {"rating": 5.0, "review": "Oh I love my fire stick.  I'm about to take it on a trip for the first time this week and I am excited to have amazon with me.  So far at home it is working great.  I'm not sure how it does it, but movies start instantly when I want to watch them and I have zero latency issues even with my slow internet.  This stick is wonderful and it will be what I buy if I need another multi-media box.", "verified": true, "helpfulness": "0/0", "author": "Derek C. Bernard"}, {"rating": 2.0, "review": "Not really sure yet but so far I like the roku better!", "verified": false, "helpfulness": "0/1", "author": "Leona Thompson"}, {"rating": 4.0, "review": "Still learning what all I can do with Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Billc44"}]