[{"rating": 5.0, "review": "good as always", "verified": true, "helpfulness": "0/0", "author": "Robert M Simmons"}, {"rating": 4.0, "review": "Easy set up - decent movie selections - for the price best value.", "verified": true, "helpfulness": "0/0", "author": "Kevin Kubota"}, {"rating": 5.0, "review": "Great product and easy set up. I would recommend to everyone.", "verified": true, "helpfulness": "0/0", "author": "C. Mckamie"}, {"rating": 4.0, "review": "Is fast and small to carry but wi-fi antenas can't pick a good signal if router is more than 40fts", "verified": true, "helpfulness": "0/0", "author": "Juan Rivera \"flaco\""}, {"rating": 5.0, "review": "I thought as usual I'd need someone to help me set this up right. Nope. Easy. It's my 'magic stick'!.", "verified": true, "helpfulness": "0/0", "author": "Christine M Durkin"}, {"rating": 5.0, "review": "Easy to Use.  Great show options.", "verified": true, "helpfulness": "0/0", "author": "Joseph A. Bischof"}, {"rating": 4.0, "review": "Way better than Roku and Roku Stick!", "verified": true, "helpfulness": "0/0", "author": "Vinicius G Vidigal"}, {"rating": 5.0, "review": "I am enjoying it on my TV . Don't anticipate downloading to my phone but perhaps will change my mind", "verified": true, "helpfulness": "0/0", "author": "Nancy B Webster"}, {"rating": 5.0, "review": "easy to use, and my girl friend likes being able to watch amazon and Netflix without turning my xbox on.If you don't have a smart tv, your gonna want this.", "verified": true, "helpfulness": "1/1", "author": "Daniel B. Reynolds \"Danny Reynolds\""}, {"rating": 1.0, "review": "It never works! And I mean it NEVER works, I haven't been able to watch a single thing for 2 days now because it keeps telling me it's not connected to the internet. My internet is just fine it's this peice of junk thats not! WASTE OF MONEY! DO NOT BUY!!!!! unless you want to pay money to stare at a screen that tells you network connection has been lost. I cant put into words what a truly peice of garbage this thing is, even when it \"works\" it still buffers non stop, and the video quality is terrible. A TRUE PEICE OF GARBAGE", "verified": true, "helpfulness": "1/1", "author": "Jason O Haan"}]