[{"rating": 5.0, "review": "Love this product, easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "cynthia"}, {"rating": 5.0, "review": "Fantastic! Roku and Apple TV have no web capability so they are useless when we travel. You figured it out!", "verified": true, "helpfulness": "0/0", "author": "William Harris"}, {"rating": 5.0, "review": "This is awesome & I love it!!!", "verified": true, "helpfulness": "0/0", "author": "JENNIFER M MARSHALL"}, {"rating": 1.0, "review": "very slow. apple tv is faster", "verified": true, "helpfulness": "0/0", "author": "viper"}, {"rating": 5.0, "review": "BEST THING EVER!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Hooked on \"the Vikings\" and \"Catastrophe\". It is an addictive watch for now. So much fun. Will it grow and become a need? I don't know. But I'm dreaming about episodes.In Catastrophe the humor is delightful, witty and adult. In Vikings there is humor to be had but in between lines and hard to come by. But it is not why I watch. It seems a period piece. The sets are as authentic as the artists can get them. The houses, boats, costumes, outbuildings, corrals and barnyard beasts appear like they are all one and belong to the scenes.  Language is English and some Scandinavian (when necessary). English domiciles are authentic as well as the Cathedrals. It is well researched. The boats are on the deep and waves crash on rocks. Each episode is preceded by a dream scape uniquely Norse. There is a spooky seer with black lips and tufted eyes. Lots of blood. Lots of action - fighting is with swords, hatchets and shields. Mano a- mano prevails. The men have period hair-dos  and the women are gorgeous, for the most part. There be tats on the men, head, arm and face. Cuts from edged weapons occur often and the harm becomes apparent in the action following. Women are free to be whatever they want to be although this message is not clear. Children are revered. Boys maybe a little more so. They know who their parents are even though they may be separated for years. There appears to reverence for one another. Leaders are respected and their rulings are set in stone. Individual leaders can be evil but with a reasoning which becomes part of the story.All in all I am enjoying the Fire Stick immensely.", "verified": true, "helpfulness": "0/0", "author": "elius yanakis"}, {"rating": 4.0, "review": "The stick is great. Streams prime programming flawlessly. HBO Go app is a little choppy, some rubuffering. Could be my internet speed.", "verified": true, "helpfulness": "0/0", "author": "Michael Schoenberg"}, {"rating": 5.0, "review": "Very fast.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey S Stein"}, {"rating": 5.0, "review": "Perfect. My grandkids love to play  my games on the tv.", "verified": true, "helpfulness": "0/0", "author": "402Shona"}, {"rating": 5.0, "review": "It is great to see Amazon Prime shows and movies on our HD TV!", "verified": true, "helpfulness": "0/0", "author": "Susan G. Bergstein"}]