[{"rating": 4.0, "review": "it would have been nice to know I needed  wi fi before I bought it", "verified": true, "helpfulness": "0/0", "author": "markturpin"}, {"rating": 5.0, "review": "Using the remote easy work. Love the device", "verified": true, "helpfulness": "0/0", "author": "Carroll walls"}, {"rating": 5.0, "review": "First off paying 99 for a year of prime is a steal the ordering online is nice but I like it for the tv shows and videos and games are fun as well it let's me stream Netflix as well the video quality is great being all in hd for the movies and shows. Its portable to take on the go as well as mirror my smart phone or fire hex tablet to it so many apps and music is even better as well. It with the money I have 3 of them it makes your normal tv into a smart tv. If I was you I would already stop reading and buy one already.", "verified": true, "helpfulness": "0/0", "author": "Crystal"}, {"rating": 5.0, "review": "Absolutely LOVE this!  Best thing ever...", "verified": true, "helpfulness": "0/0", "author": "Darlene Hudeck"}, {"rating": 4.0, "review": "So far works fine", "verified": true, "helpfulness": "0/0", "author": "mia"}, {"rating": 3.0, "review": "does not work well. all other wireless items in home work but not this one. does not connect to netflix youtube etc.. waste of money for me..", "verified": true, "helpfulness": "0/0", "author": "egg head \"frank 02\""}, {"rating": 5.0, "review": "Simple to install and use.  Will likely purchase additional Fire Sticks for other TV's.", "verified": true, "helpfulness": "0/0", "author": "J. Campbell \"Bookwormdrive\""}, {"rating": 1.0, "review": "After many attempts I have only been able to get it to work once on my TV.  So I probably will never attempt to use it again.", "verified": true, "helpfulness": "0/0", "author": "Gary Matherne"}, {"rating": 5.0, "review": "It's fast, sleek, easy to use & super easy to install. HBO Go would be awesome, but that update will come later this year, so no worries. What I would love would be a Time Warner Cable app, but I don't know if that will ever happen.", "verified": true, "helpfulness": "0/0", "author": "Maurice Alban"}, {"rating": 5.0, "review": "I bought this for my hubby for Valentines Day...and hes ADDICTED to it. He says \"forget cable...this thing is awesome!\". It was super easy to install, super easy to use and you can take it anywhere...LOVE it!", "verified": false, "helpfulness": "0/0", "author": "Rebecca Richards"}]