[{"rating": 5.0, "review": "Works as well as the fire TV box that I have in another room. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "William Owens"}, {"rating": 4.0, "review": "I am very impressed, for such a small device it is extremely powerful.  I have a smaller TV, that is not a smart tv and no cable so I thought it would be perfect and I was right.  I am so happy!!  Its comparable to the apple tv but has easy access to the amazon prime as well as aps for Netflix, Hulu, among other things.  One thing to note was for best performance it must be plugged in.  Other than that its great.", "verified": true, "helpfulness": "0/0", "author": "Jillian"}, {"rating": 2.0, "review": "Eh. It’s fine for the $19 I got it for, but I will more than likely return it. I would steer clear at $39, but that is just me. I have a Roku 3 and the UI is much more streamlined and easier for the entire family to use. You can actually see your apps on the Roku and access them with ease. The Fire UI is just one big Amazon Ad. It makes it cumbersome to find the apps you have installed compared to the Roku. I realize this is an Amazon device, but it is cluttered with TV and Movies to purchase from Amazon, the Roku streaming devices are not like this. Therefore, this should be cheaper as you are getting a discount for having to shift through advertising. To me listing movies on the home page that are not included in prime, which I would have to purchase, and having a TV and Movie section I have to move past, is advertising. I don’t want to buy movies or TV from Amazon. I want to use Netflix, Hulu, Amazon Prime, PBS Kids, Discover, Disney, Pandora, and other apps that I already pay for. Unfortunately, these are buried in the UI. Yes, after you use an app it will appear in recently used (or something similar) at the top, but you still have to cycle through them, or if you haven’t recently used an app you own, you have to scroll through the “ads” find your apps, then cycle through them. Again, this is a cheap device, and does its purpose, but coming from a UI that is not geared to sell a specific brand, it’s is not ideal for me.", "verified": true, "helpfulness": "4/5", "author": "Shopping Fan"}, {"rating": 5.0, "review": "I was a bit skeptical buying this for the promotional price but it ended up being a steal,  there is so much content to watch it mind-boggling.Pros- clean interface,  fast,  the screen mirroring is flawless at 1080p on note 3 (but you must use the right app and play mpg4)Cons- you need a subscription to utilize all the apps like hbo,  showtime,  etc...For the $20 bucks I paid.... How can you possibly go wrong.  Even for 40, you get a massive media library and the touch of a button.", "verified": true, "helpfulness": "0/0", "author": "Solo"}, {"rating": 4.0, "review": "Works great - faster than Chromecast.  Just needs HBO support.", "verified": true, "helpfulness": "0/0", "author": "Jody Oster"}, {"rating": 4.0, "review": "What I like, Amazon Music Service is great for a prime member, I especially like how the lyrics scroll as the music is played. With that said, before I would recommend this Amazon either needs incorporate Ultraviolet support into Amazon Instant Video or they need to add the VUDU app. They do have Flixter, but I found the quality of the stream to be horrble as if it only allows you to stream in Standard Definition, which maybe it does. 4-15-15 I am upgrading the review to 4 stars based on the ability to side load apps and the lates firmware version. It is getting there.", "verified": true, "helpfulness": "0/0", "author": "tapersmith"}, {"rating": 1.0, "review": "I've been using a Chromecast for some time now, and this Fire TV Stick looked like a good upgrade. I was wrong. The only integration with Android is the Fire TV Remote app which just acts like, well, a remote. I can't open a YouTube video on my phone and \"cast\" it to the Fire Stick like I can with YouTube. Speaking of YouTube, I can't even find the app! I'm technically savvy, but I spent a good 15 minutes looking through the menu and App section for it.Don't waste your time on this, get a Chromecast instead, especially if you have an Android phone.", "verified": true, "helpfulness": "0/3", "author": "J. Nipper"}, {"rating": 1.0, "review": "This is disappointing and Amazon should be ashamed that they have produced this.  It took three days to get it connected.  Finally, when it connected, it said that there were connectivity issues and no videos would load.I know that this isn't the case considering that I use my roku to watch Amazon videos all the time and I've NEVER had any issues with it.  Also, both devices are close in proximity to the router so I know that the connection is good.I'm going to attempt to return this and get another one.  Wish me luck.", "verified": true, "helpfulness": "0/1", "author": "Andy"}, {"rating": 5.0, "review": "Works great.  I am very pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "J. Johnston"}, {"rating": 1.0, "review": "as a current owner of amazon fire tv I was happy to see that there was a smaller  version so when it came available i bought one that was october 28th so now I see they are being sold on black friday and in stock but mine has a delivery date of december 24th.... whats wrong with this picture I have been a prime member for several years thanks for the loyalty to your current customers.", "verified": false, "helpfulness": "0/1", "author": "masterofnone"}]