[{"rating": 2.0, "review": "I don't particularly face for the Fire TV Stick mainly due to the fact that Amazon TV is lacking.  Also the Plex app requires a purchasing from Plex.  finally I knew the unit was controlled only by the bluetooth remote.  Some sort of IR converter would make the unit more functional in a home theater setup.The price is great.  What it has available works well.  Their is just not much to use.", "verified": true, "helpfulness": "0/0", "author": "D. H."}, {"rating": 5.0, "review": "Easiest that I have installed,all done on the tv screem", "verified": true, "helpfulness": "0/0", "author": "charles m."}, {"rating": 5.0, "review": "LOVE, LOVE, LOVE it....", "verified": true, "helpfulness": "0/0", "author": "pam  walker"}, {"rating": 1.0, "review": "Could not get Netflix to even load on it.  Had it for a month and every time I try to use it, I can't.  I guess our internet must be too slow for it.  Needless to say, I haven't gotten any use out of it.", "verified": true, "helpfulness": "1/1", "author": "Erin83"}, {"rating": 4.0, "review": "The stick works great, but I was disappointed that I was unable to buy it at the discounted prices during Amazon's Prime Deal day.  I really didna't find any \"deals\" that day.", "verified": true, "helpfulness": "0/0", "author": "Stone13"}, {"rating": 5.0, "review": "Very easy setup, easy to use, great price, bringing a world of entertainment to your household. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Bill G. \"banshee\""}, {"rating": 5.0, "review": "No problems.. works very well with Plex and is small enough to be easy to conceal behind my TV.", "verified": true, "helpfulness": "0/0", "author": "P. SOO"}, {"rating": 1.0, "review": "At first I absolutely loved it. Then while watching a show it paused for 85 seconds for an ad. Later during another show same thing happened. I bought this so I could stream stuff without ads! This frustrates me to no end!! I am considering returning it and getting something else!!", "verified": true, "helpfulness": "0/0", "author": "Panda_12 \"To improve is to change; to be perfect is to change often -Churchill\""}, {"rating": 5.0, "review": "Excellent. Work perfect and it is very easy to follow the instructions. It take only few minutes to install it.", "verified": true, "helpfulness": "0/0", "author": "Alex Djuro"}, {"rating": 2.0, "review": "One extra star for Miracast, which makes the dongle worth the money.  I guess as a Miracast dongle it is well worth the money, and if the screen casting worked smoothly I'd be tempted to give it more stars just for that.  But it is very flaky and doesn't like to connect to most of my devices the first time.  Probably because of the flaky WiFi...speaking of which, the WiFi connection is horrible.  Some times it drops every few seconds.  No other devices, including Smart TVs, phones, laptops, tablets, etc. have any problems.  It will be showing Very Good signal strength one second and drop the connection the next. I have to reboot it when it gets bad, which sometimes helps. Also probably explains why movies keep dropping into low resolution.  I mean LOW resolution!  As in FUZZY.  I gave up on the first movie I tried to watch and haven't tried again.  Music is not too bad.  Apps are lame.  No Web Browser, so you could not use this with a WiFi that requires a web page to activate.  No mail client.  Can't pair BlueTooth keyboards, etc.  LAME LAME LAME", "verified": true, "helpfulness": "0/0", "author": "DrHenley"}]