[{"rating": 5.0, "review": "We love it. It's great for streaming and so small.", "verified": true, "helpfulness": "0/0", "author": "Jessica Plummer"}, {"rating": 4.0, "review": "This works well, and it was a really good deal through the initial offering promotional.", "verified": true, "helpfulness": "0/0", "author": "Sarg \"Critical\""}, {"rating": 5.0, "review": "Very cool if you don't have a game console with wifi hooked up to your tv! Works as well as your wifi", "verified": true, "helpfulness": "0/0", "author": "Ashley Cline"}, {"rating": 5.0, "review": "I luv this product.....very easy to use...Lots of choices...can't wait to get rid of my satellite bill!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "kim tuttle"}, {"rating": 3.0, "review": "We have an older HD TV and the USB adapter doesn't fit properly.  Is there a solution for an older television?", "verified": true, "helpfulness": "0/1", "author": "Margie Miles"}, {"rating": 5.0, "review": "Love it! Easy to install and download the different sites!  Like the way it is set up on the screen as well, much nicer than Apple TV or Roku!", "verified": true, "helpfulness": "0/0", "author": "lisa cowan"}, {"rating": 2.0, "review": "Slow speed & slim memory makes for a lethargic forgettable device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"lwyrmoyer2\""}, {"rating": 5.0, "review": "This is an awesome product!! I was excited to take advantage of this when they dropped the price for amazon prime day! This shipped so fast that I got it in my mail box the next day! This is so easy to set up and used. I bought this for my husband who loves to watch netflix and hulu. This is great for my children as well! The stream quality is great and I am able to get it up and running fairly fast! This only takes a few minutes to set up and is really easy to use!!! I would highly recommend this fire stick!", "verified": true, "helpfulness": "0/0", "author": "Ashley Brown"}, {"rating": 1.0, "review": "The Amzazon fire stick is tooooooooooo slow. Pay a little bit more ,get the Amazon Fire TV and it will be worth it.", "verified": true, "helpfulness": "0/0", "author": "Adam Rodriguez \"ar\""}, {"rating": 5.0, "review": "I love my fire stick I would def recommend it to my friends and family it's easy to use and Convenient And you can take it anywhere", "verified": true, "helpfulness": "0/0", "author": "sp"}]