[{"rating": 2.0, "review": "tired of punching in my password every time I PICK A SHOW", "verified": true, "helpfulness": "0/0", "author": "Bruce Patrick"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Awesomeness"}, {"rating": 5.0, "review": "wish i had seen this sooner! Perfect for a kids room or the person who only needs netflix hulu and wifi tv apps! Love this product", "verified": true, "helpfulness": "1/1", "author": "Kita"}, {"rating": 5.0, "review": "love it as much as my roku... I bought three of them", "verified": true, "helpfulness": "0/0", "author": "gauge_08"}, {"rating": 5.0, "review": "Easy to install.....great to turn any tv into a \"smart tv\" viewing Amazon Prime variety of shows.", "verified": true, "helpfulness": "1/1", "author": "Elizabeth Wheeler"}, {"rating": 5.0, "review": "This is the s***!!! I love it,5 mins to set up and i never need to leave home again..lol...seriously,for the price and all i got you cant go wrong!", "verified": true, "helpfulness": "0/0", "author": "nancy benvenuti"}, {"rating": 4.0, "review": "This thing is fantastic.  I used a Chromecast on my bedroom tv for a few months and found its interface cumbersome.  I got frustrated and decided  to give the Fire TV Stick a try, and I won't be going back.  The remote is small, yet capable.  I highly recommend this!", "verified": true, "helpfulness": "0/0", "author": "Rick Guy"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Saturn"}, {"rating": 5.0, "review": "We love it!!!", "verified": true, "helpfulness": "0/0", "author": "Moriah Guild"}, {"rating": 4.0, "review": "This is a lot faster than trying to connect through the T.V.  It is easy to navigate and the set up walks you through everything.  I brought this on vacation though and attempted to use this in our hotel. I was able to connect to the WiFi but the hotel also had a web page that needed the terms accepted, and I could not do this (or access any web page) with the Fire TV stick.  It was very unfortunate since we had planned on watching Netflix for the three weeks we were gone.", "verified": true, "helpfulness": "0/0", "author": "Shamulove"}]