[{"rating": 5.0, "review": "Nice, Lots of content options.  Quality resolution.  Ordering a second one today.", "verified": true, "helpfulness": "0/0", "author": "rlewisd"}, {"rating": 3.0, "review": "The Fire TV Stick is working well now, but it almost made it back to Amazon. I have a very powerful modem and router in my home because that is where my office.is for my job in sales. Even having the Fire Stick just about on top of the router, this Stick had lots of trouble connecting and kept dropping my network. Every thing else in my home was working just fine to include the $100 Amazon Fire system. It lost the network constantly when  first being installed. After 10 times trying to download all of the information, I gave up and started to wrap up the Fire Stick to send back to Amazon. Luckily, I had time to sleep on it to get a  better handle on things and I tried it one more time and it worked fine. Go figure. I guess threatening the little stick was all it took. I am sure it will work fine now. I'll give it 20 days. No problems for now.", "verified": true, "helpfulness": "0/0", "author": "Dante Capriotti"}, {"rating": 5.0, "review": "Works great- easy to use.", "verified": true, "helpfulness": "0/0", "author": "mrandmrsk2"}, {"rating": 4.0, "review": "Hmmm.... the Fire TV Stick, what a handy little gadget. I am a Netflix watcher who use to use my son's Play Station 3 for streaming.  The commercial for the Fire TV Stick left me curious about it's functionality so, I purchased it.  First, I like how compact it is.  The small device attaches to my television HDMI port.  There's also a cord that attaches to the stick which has to be plugged into outlet.  There's so much less space used around the tv than Fire TV Sticks bulky counterpart Play Station 3.  Second, this little device streams programs other than Netflix, but also Hulu, ESPN, etc.  Kudos to Amazon and the inventor of this compact, innovative little streaming device.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 4.0, "review": "I haven't had much time to check it out but it looks like it will do what you said it would do. There are a lot of movies and tv shows on prime that i will enjoy. thanks", "verified": true, "helpfulness": "0/0", "author": "Calvin Brown"}, {"rating": 3.0, "review": "I was hoping the Fire Stick would provide for a better picture than the ROKU but it is about the same. Also the Stick was out of Stock (which was noted at time of purchase via Amazon.com) so it took about 8 days to receive instead of the promised 2 days. Also remember the 2 days is based on Monday through Friday.", "verified": true, "helpfulness": "0/0", "author": "cleve fikes"}, {"rating": 4.0, "review": "pretty good little shtick.", "verified": true, "helpfulness": "0/0", "author": "geezer"}, {"rating": 5.0, "review": "More than I expected.  Thank you", "verified": true, "helpfulness": "0/0", "author": "skywench"}, {"rating": 1.0, "review": "so far I cannot maintain a connection to the internet,", "verified": true, "helpfulness": "0/0", "author": "George Love"}, {"rating": 5.0, "review": "Easy setup, works great, love it!", "verified": true, "helpfulness": "0/0", "author": "Hasan Zaidi"}]