[{"rating": 4.0, "review": "so far so good.  now you have to get showtime and hbo so that I can cancel my TWC contract", "verified": true, "helpfulness": "0/0", "author": "Valentina Remijio"}, {"rating": 5.0, "review": "I really like the fire stick and all it has to offer with Amazon prime!!!", "verified": true, "helpfulness": "0/0", "author": "Neva E. Jones \"Elaine\""}, {"rating": 4.0, "review": "Great device. It essentially is just like having your kindle on your television. The only thing that I dislike and was a bit misguided on was that it does have to be plugged with a power cord. I was under the impression that itt only had to be plugged into the USB port of the TV and that was it. I hate having cords cluttered and having the stick was what I looked forward to the most., having a cordless device. Install and set up was easy. It was a bit of a struggle getting the back off of the remote but once it was off then back on after the batteries were put in, I had no troubles. If you can get passed the cord plug in, it is perfect to have!", "verified": true, "helpfulness": "0/0", "author": "whitney jones"}, {"rating": 5.0, "review": "It's terrific, but we are having satellite band-width problems which keep us from usiing it as much as we'd like.  Maybe that's a good thing for two retired folks who would probably watch it night and day!  We do love it!", "verified": true, "helpfulness": "0/0", "author": "P. Silva"}, {"rating": 5.0, "review": "Excellent device....exceed expectations", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great companion to our Amazon Fire .. Travels well", "verified": true, "helpfulness": "0/0", "author": "Tammi Conner"}, {"rating": 2.0, "review": "I am not able to stream from mobile to TV when I use Youtube. apart from this, i use only Netflix and so not sure other apps.", "verified": true, "helpfulness": "0/0", "author": "Basavaraj Mannikeri"}, {"rating": 4.0, "review": "Easy to use, very pleased so far.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 4.0, "review": "Fast and compact. Very easy to set up! With that said the negatives are a very cluttered home screen, limited apps, and prime video not very user friendly. Would also like to see a slide show of my pictures for the screen saver mode. Also they need to make the remote more finder friendly in the dark. For example your watching a show with the lights down and you need to pause it. good luck finding your black remote with out turning up the lights", "verified": true, "helpfulness": "0/0", "author": "mntowguy"}, {"rating": 4.0, "review": "That's so good", "verified": true, "helpfulness": "0/0", "author": "justin"}]