[{"rating": 1.0, "review": "Couldn't sign on to my passowrd protected wifi, needs to be plugged into power to work well, which is as convenient as it looks.", "verified": true, "helpfulness": "0/0", "author": "GI"}, {"rating": 4.0, "review": "Way better than Chromecast - across the board. Don't need another device to get a service like Netflix. Love the clicker.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Works great! I like it waaay more than my chromecast.", "verified": true, "helpfulness": "0/0", "author": "Ben S"}, {"rating": 5.0, "review": "Love it so far, especially for the price!  Remote works well, powered fine by my TV (a Seiki SE39UY04) via USB (it does complain about low power, but runs fine).  Seems plenty fast to me!  I debated between this and the Fire TV box and, while I often buy the nicer option (for that cost difference especially) I haven't regretted the Fire TV Stick at all.", "verified": true, "helpfulness": "0/0", "author": "Peter Porter"}, {"rating": 5.0, "review": "Great buy", "verified": true, "helpfulness": "0/0", "author": "Alexander Gauntlett"}, {"rating": 5.0, "review": "Completely met expectations!", "verified": true, "helpfulness": "0/0", "author": "Barnard71"}, {"rating": 5.0, "review": "This has been a life saver for us with our toddler. We can watch shows and movies on netflix, amazon prime, disney go, xfjnity tv app and youtube. it's so easy and fast to set up and to learn. Everything loads quickly as well.Hands down one of the best purchases we have ever made.", "verified": false, "helpfulness": "0/0", "author": "amber"}, {"rating": 2.0, "review": "When I first got the fire stick months ago, it was great and I wrote a 5 star review for it.  I love the interface, but it's continually gotten worse and worse at buffering (that little 3-5 second pause) while watching Netflix or Hulu.  I've tried the 'tricks' of clearing the caches for the apps, and even reset to factory settings once trying to get it to work better.  Finally I've went back to my xbox, which has it's own issues as far as buffering, but at least it's at the start of the show and doesn't interrupt dialog.A friend at work bought a Fire Stick based partially on what I'd originally told him, he immediately had the buffering issues and sent it back.It really feels like a software update should be able to fix this issue, but after months I don't want to spend any more time attempting to get it to work correctly.", "verified": true, "helpfulness": "0/0", "author": "Robert B"}, {"rating": 3.0, "review": "Wish it didn't lose Wi-Fi signal in the middle of streaming (netfliix) It's Pretty good, but it does get pretty hot sometimes and lose Wi-Fi signal, which requires me to unplug it, restart it. My other wireless devices do not lose their Wi-Fi signal at the same time, proving that it is indeed just this one product losing the Wi-Fi signal at that time. Once I restart the firestick, Wi-Fi comes back, I think it may be getting too hot. Not sure why. But feels very hot to the touch. Don't know if the fire TV box would perform any better or with less heat?", "verified": true, "helpfulness": "0/0", "author": "rockwilder"}, {"rating": 5.0, "review": "FABULOUS", "verified": true, "helpfulness": "0/0", "author": "koko"}]