[{"rating": 3.0, "review": "The only real issue I have had with the fire stick is the continual problem of getting the error message, \"HDCP Unauthorized Content Disabled\" every couple of days.  The only way I have found to get rid of it is by unplugging the TV and Fire Stick for 10 seconds then restarting.", "verified": true, "helpfulness": "0/0", "author": "JDR"}, {"rating": 5.0, "review": "Actually I hate the FireStick (Prime only works in the US and the remote screen does not work with Mac), then only good thing about it is the Android apps support. I sideloaded Kodi (XBMC) and now I enjoy movies and streaming without even turning on my PC. Best thing ever happened.Note that you have to update the settings for Kodi using the recommended settings for 1GB RAM devices (check their website). Before that Kodi was pretty much unusable, movies loaded very slow and were almost impossible to watch.", "verified": true, "helpfulness": "0/0", "author": "Jose V"}, {"rating": 5.0, "review": "Love this device!", "verified": true, "helpfulness": "0/0", "author": "LeeBetsy"}, {"rating": 5.0, "review": "The Fire TV Stick was so easy to set-up and start using.  It is compact and light weight for travel.  Super happy with this product!", "verified": true, "helpfulness": "0/0", "author": "MizGma"}, {"rating": 5.0, "review": "This has been a great purchase! Netflix loads faster on the fire stick as opposed to the Wii. Picture and sound quality is outstanding!", "verified": true, "helpfulness": "0/0", "author": "BKWitt \"NAVIGATOR\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "kiona harris"}, {"rating": 5.0, "review": "Comparable to Apple TV.", "verified": true, "helpfulness": "0/0", "author": "pmack"}, {"rating": 5.0, "review": "Easy to install, easy to use, with all of your favorite apps, Netflix, hulu plus, Amazon prime, on one page....it doesn't get easier than this. It's so easy to install, my golden retriever could do it.", "verified": true, "helpfulness": "0/0", "author": "New Era Goldens"}, {"rating": 4.0, "review": "The only reason I did not give 5 stars is for spotty streaming from our cable provider. I wish there was a way to better buffer TV shows or movies to prevent the jerky atop-and-start of the videos.Otherwise we love the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "E. O'Neill"}, {"rating": 5.0, "review": "This item is great", "verified": true, "helpfulness": "0/0", "author": "Josephine Borkowski"}]