[{"rating": 2.0, "review": "Pros. It seems to work fine with Netflix and Amazon Prime although it crashed several times with Hulu.Cons. You cant turn it off. I have been unplugging it when not in use which is a pain. However, I have to because for some reason some of my TV channels will not work when this device is plugged into the TV and is plugged into the power outlet. I fond this to be very odd since I have cable TV which should not be interfered with by this device. For the price I will keep it but I wish I didn't have to unplug it all the time.", "verified": true, "helpfulness": "0/0", "author": "CY \"CY\""}, {"rating": 1.0, "review": "I thought this would be great, having loved my FireTV box, even though I'd miss the easy voice search on the remote a little.  Well, I miss it more than I thought, but that is the least of the issues.  I mainly use this FireTV Stick for Hulu, but a fair amount on Amazon Prime video.  But, on both Hulu and Amazon prime the screen sometimes goes black, while Audio continues.  Not too often for AP Videos, but a lot for Hulu.  And on top of that, while watching Hulu videos, the Fire TV Stick goes into screen saver mode and starts showing shots from the built in photo gallery.  Pretty disappointing.  I need to check the return period, but I'm pretty sure I\"m sending it back and will just live with Amazon on one TV, and use my Roku and Netflix on my main one, that I was trying to add amazon to.  Maybe if the main Fire TV Box one day gets upgraded to handle my Amazon Music, I'll buy a second, for now, I can't recommend this.  Going blank, and going into screen saver mode on a very common major app like Hulu is a non starter.", "verified": true, "helpfulness": "1/2", "author": "Roger D Albert"}, {"rating": 3.0, "review": "First of all, I normally wouldn't buy a gadget on its first generation. Sometimes I get lucky, like my first Gen TiVO. But with the FireTV Stick, it was the $20 price tag I couldn't pass up. Now, I'm regretting that decision.When I first plugged it in, the instructions insist I plug in to the AC adapter. Probably due to background updates over the network. Then I noticed the stick got really warm, and I suspected it's going to cause problems. Sure enough, a couple of days later, the WiFi connections would drop, sometimes making the stick so unusable. I did verify it's not my ASUS Access Point because my other iOS devices and laptops work just fine.Oh, speaking of iOS, it doesn't do YouTube mirror from my iPhone nor iPad. Worked fine with my Android tablet, though.  And forget about Miracast. My MS Surface Pro 3 won't connect to it!On the plus side, the GUI is nice and simple. Integration with Amazon is smooth (obviously). Watching Prime movies were a snap. I always hated Amazon's web interface for Instant Videos.The remote is OK but it sometimes glitches When I tap the key multiple times, it would end up sending the cursor to scroll way too fast, as if the button was being held down.Overall, this introduction to media sticks is dissapointing. I will stick with my flexible and reliable HTPC.", "verified": true, "helpfulness": "0/0", "author": "Rudy Amid"}, {"rating": 2.0, "review": "I've only watched one video so far, and I'm getting what I was expecting, very little more.  I wasn't really wow'd but it works as expected.  I will update as I get to play with it more.  But here's what I know so far.It is pretty fast, but there is a bit of lag between button presses on the remote and the corresponding action on the device. I found myself hitting a button more than once only to find out it did get it the first time, just took a second to respond.  This is unacceptable in today's devices.Update, downgrade to two stars (4/30/2015).  Now that I've had this a while and had plenty of time to use it.  I figured it was time to update the listing.My biggest complaing!  Netflix and Hulu videos glitch!  I can very seldom make it through an entire episode without at least one glitch, usually several.  The sound keeps playing while the video stops for several seconds. Then the video starts and plays real fast to catch up to the audio.  It's extremely annoying when I'm really enjoying a show.  Amazon prime video works fine, but both netflix and hulu both have this problem.Pros:--- Works great with amazon video so if this is all you need, you will like it.--- Seamless integration with the fire remote app on fire phone/tablets.  You can see the xray information while watching a video, instantly jump a video from playing on fire stick to phone and back to tv if you need to talk out of the room and keep watching.  This part is absolutely seamless (with prime video only of course).  This is why I gave it two stars instead of 1.--- Allows Kodi/XBMC install.  I believe this is the ONLY device you can currently do this with except maybe one of the crappy google tvs?  Not sure, but kodi works great on it, even though there is no shortcut to it on the home screen. It was a pain to install, but there are some pretty easy to follow instructions online from smarter people than me.--- It integrates hulu with video listings when searching with a link that will take you to the video in hulu. Pretty cool.Cons:--- Layout is really pretty bad. I much prefer my roku for ease of use.--- Glitching issue as discussed above.--- Need for separate power cord. I was hoping to be able to just plug it into the back of the TV without another cord handing off of it. Since it has a cord, I wonder if it would just be easier to get an hdmi extension cable and run that to the TV.  Kind of defeats the purpose of the stick with a cord hanging from it.In summary, if you have a fire tablet or phone you plan to use with this and primarily watch prime video, or kodi you will love this stick as it really is seamless with their other products.  If you primarily use netflix or hulu, I would suggest a roku as it works much better and is much more friendly and enjoyable to use.With glitches fixed, I would rate 3 stars.  With also a major interface redesign, I would rate 4.  It just isn't quite ready yet.Original Review: Most things are pretty fluid and smooth though and the videos stream fine.  I didn't have a single interruption for the entire show which unfortunately my roku is incapable of doing many times.  I have an older one though.  I have this connected via wi-fi and the roku just doesn't like wi-fi as well.  This seems to eat up wi-fi flawlessly so far so definite plus.Another disappointment is I thought that this didn't need a power cord since it plugged straight into the HDMI port on the tv.  I was hoping I could avoid this.  I got this for $20 on a deal though so I still can't complain.  Definitely worth $20 or even $40 for what it does.  I will update more later.", "verified": true, "helpfulness": "1/1", "author": "Cap'n"}, {"rating": 2.0, "review": "Works well, easy to set up and use.No hbo go?!?!No voice controlNot having hbo go was a deal breaker for me , thought I could go without it but I cant, I returned and got roku streaming stick", "verified": false, "helpfulness": "0/0", "author": "HelloFallAllergies"}, {"rating": 4.0, "review": "Great little device! Setup was easy. Thankfully it came with an HDMI extender, otherwise it wasn't gonna work. I'm using my TVs USB port to power the device and haven't experienced any problems.  Love that it was already setup for my account out of the box. Wish the USB cord was a bit longer and I wish the plug didn't take up two spots on my surge protector. Other than that, pretty much replaced my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Justin M Sepulveda"}, {"rating": 2.0, "review": "not as good as i thought for me i just wasted my money, chrome is much better", "verified": true, "helpfulness": "0/0", "author": "massawe"}, {"rating": 5.0, "review": "I've been using The Stick for about a week now and love it.  I use it only for Netflix so I can't attest to its other functions.  Setup was easy and I appreciate that it came linked to my Amazon account.  I am in Netflix about 15 seconds after pushing a button on the remote, light years quicker than my Xbox or PS3.  That remote is what I appreciate most, I don't need my phone to control what's on.  While it doesn't have the quality feel of say the Apple Tv remote it gets the job done.  No matter where you point it the signal always finds its way to the stick.  A couple of minor gripes though, I have noticed it stumble a couple of times while watching video and I would really appreciate control over the sleep timer (it goes to sleep after 30 min. of inactivity or by finding the sleep button in the settings menu).  Other than that I am very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "A. Montoya"}, {"rating": 2.0, "review": "Started out fine, with a relatively friendly interface and quick responsiveness. After the first few hours, it started developing constant connection problems with the router and now is unable to sustain a connection stating at first there were issues and now authentication problems. Only useful to display an HD Screensaver that was preloaded. Very disappointing.Edit: The solution was to reboot the Fire TV stick. It routinely has buffering issues in the Netflix and Hulu apps (when none of my other devices nor my computer has an issue with our 1MB+ connection) and occasionally go through short periods of times where it will emit (through the TV)  weird electronic/static sounding beeps/buzzes.After figuring out the reboot issue, it's been a livable problem, but still leaves me unhappy. I basically unplug/plug it in once every 2-3 days, because it will start lagging after being in use for a few hours. There are a lot of happy customers, so I'm not sure how isolated this is to my situation, but it strikes me as weird. An update to allow for a remote controlled reboot or off/on would be much appreciated.", "verified": true, "helpfulness": "6/7", "author": "Jennifer H Yang"}, {"rating": 5.0, "review": "Wow! That's all I can say. I can watch Amazon prime, prime music, photos. I love that I can pair my iPhone and watch YouTube on my big screen. Wish they made an app for the iPhone for the remote. I am uber impressed! Best gift I've gotten myself.  Picture quality is great! Can't wait to see what else this little gadget can do.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}]