[{"rating": 2.0, "review": "Really dissapointe in this product.  Picked this up while it was on sale during Prime Day, was looking to have something easier to travel with than my aging Roku 3, I also have an Apple TV that stays at home.  When looking at the technical specs, this should run circles around both the Apple TV and Roku 3, but it simply does not.  All too often the interface would lag and freeze, sometimes even requiring me to pull the plug on the device.  It works great for streaming Amazon content naturally, but when you get into the other popular choices like Netflix, Hulu, and WWE Network the streaming quality just does not seem to be there and many of the apps are clunky and slow (though that is not down to Amazon.)All in all my Roku 3, despite being much older and underpowered compared to the Fire TV Stick, is a much better and smoother device.  The interface of the Fire stick is also bloated and difficult to navigate, Amazon content is easy to get to, anything else and you'll be going on a scavenger hunt.", "verified": true, "helpfulness": "0/0", "author": "MarkS"}, {"rating": 4.0, "review": "Works great it's apps are top notch.  I had an apple tv for a while and this seems to function better and apps seem more up to date.", "verified": true, "helpfulness": "0/0", "author": "AR Packer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Joyce A. Bell"}, {"rating": 5.0, "review": "Great item for the price", "verified": true, "helpfulness": "0/0", "author": "Steven B. Cohen \"flash\""}, {"rating": 5.0, "review": "Love it. So easy to move from one room to another.", "verified": true, "helpfulness": "0/0", "author": "Kk"}, {"rating": 5.0, "review": "I have two words: In Love! Seriously! I got this during Amazon Prime day, and don't regret it one bit! In fact, I'll probably buy one for each TV in the house, (I only have 3 that have an HDMI port). Oh... And we decided to cancel our cable because anything that we want to watch can be streamed.", "verified": true, "helpfulness": "0/0", "author": "Beautiful_Tragedy"}, {"rating": 5.0, "review": "As an avid movie watcher, I am very pleased with the Amazon Fire Stick. It has exceeded my expectations for streaming movies and TV programs. Three of my friends were impressed with the device and have each ordered one for themselves.", "verified": true, "helpfulness": "0/0", "author": "Barbara J. Moorhead"}, {"rating": 3.0, "review": "It's been freezing up too much.", "verified": true, "helpfulness": "0/0", "author": "jewel  hauser"}, {"rating": 2.0, "review": "I have been a prime member for a couple of years, and watch movies on my Roku. I purchased this for a second TV.Installing was fairly simple. The problem came when I inadvertently purchased a show not included with prime. I was always asked for a pin when watching on my Roku and I thought that setting would carry over to the new device.After much aggravation and a call to customer service, it seems the only way to do that is to initiate parental controls. (Trying to figure out how to enter my pin was another hurdle. There was no onscreen keyboard as there was in the initial setup. What was there was confusing to use.) But by doing that I have to enter a pin for EVERY show, even those included with prime.I didn't block any programs.I removed the parental controls, and hope that I don't accidentally buy something again.I'm glad I kept the Roku on my living room set.I don't think I'm going to like this. I don't care for the remote either.", "verified": true, "helpfulness": "0/0", "author": "Jean"}, {"rating": 2.0, "review": "Does not want to run Netflix or HBOgo, very intermittent,(any surprise there)  I have two and both behave the same...  and I cant get it to link to my amazon music.  Cumbersome user interface.", "verified": true, "helpfulness": "0/0", "author": "Lowdown"}]