[{"rating": 5.0, "review": "Easy to install. Met expectations.", "verified": true, "helpfulness": "0/0", "author": "Carly Byrd"}, {"rating": 5.0, "review": "Fantastic device for the money. I was using a gaming console for Netflix and hulu which used 300+ watts of power. Now I get the same apps plus amazon prime (totally worth the money) and it's faster and uses as much power a's a smartphone charging.", "verified": true, "helpfulness": "0/0", "author": "Johnathon Timmerman"}, {"rating": 5.0, "review": "I have a Ruku , this fire stick is far superior and lot better quality and performance.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "This bad boy is awesome... Took it to the beach and I'm glad I did!! Nothing bad about it... Well worth the $39!!!", "verified": true, "helpfulness": "0/0", "author": "C. Moore \"boogie\""}, {"rating": 5.0, "review": "I got it on sale during the pre orders. For the price I paid, pretty happy with it. Very fast and responsive, does not get in the way. My only compliant is the USB power input sticks out of the side, which can sometimes show on the other side of the TV.", "verified": true, "helpfulness": "0/0", "author": "Misa"}, {"rating": 4.0, "review": "It works perfect.", "verified": true, "helpfulness": "0/0", "author": "Pablo"}, {"rating": 5.0, "review": "love it, easy installation, easy to maneuver around, first time I have tried a product like this and have suggested it to others", "verified": true, "helpfulness": "0/0", "author": "vsunfish"}, {"rating": 4.0, "review": "Works well.  Wish there were more opt. Buttons to get to certain apps. Other then that a recommed.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I am so happy with the Fire Stick that I am buying a second one for another TV that our family owns.  Now daughter can watch Prime videos while wife watches Netflix.", "verified": true, "helpfulness": "0/0", "author": "Modupe Hendricks"}, {"rating": 5.0, "review": "Fire TV stick is easy to hook up and use. All of my most favored apps are available on it. Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]