[{"rating": 3.0, "review": "Having issue connecting home network on basement TV.", "verified": true, "helpfulness": "0/0", "author": "John Mazza"}, {"rating": 5.0, "review": "Bought this since i moved my PS3 out of my room, and was missing all the apps and services i used to have, but now with the Fire TV Stick i get all my old apps and more.  This thing is amazing, it has super fast connectivity and the picture is great.  Really easy to navigate through the menus as well.  I wish i would have bought one of these for my other tvs instead of the smart dvd players.  To make searching a little easier you could possibly have some sort of keyboard that will work with this, but i'm  not sure it's possible other than using the fire stick app on your phone.  Definitely recommend this product though.", "verified": true, "helpfulness": "0/0", "author": "E❤E827"}, {"rating": 3.0, "review": "I won't write an extensive review of this item because others have done enough in this area. I am using this to watch Prime Videos while I exercise and it does the job well. I have had an issue with the unit buffering during playback and telling me that the WIFI connection isn't strong enough, even though the signal is very good. When this happens (it has happened 2 or 3 times in a month) I reboot the device and it works fine.", "verified": true, "helpfulness": "0/0", "author": "Deem"}, {"rating": 5.0, "review": "A very useful device for turning an older TV into a smart TV - especially if you have an Amazon prime membership.  The small plug-in design eliminates an extra box on your TV table , and makes it portable as well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love IT!!!", "verified": true, "helpfulness": "0/0", "author": "Oscar"}, {"rating": 5.0, "review": "One of our families best purchases! we use it regularly with our amazon prime for movies and tv shows.  great for when we are traveling too!", "verified": true, "helpfulness": "0/0", "author": "N. Kulhawy"}, {"rating": 5.0, "review": "I love it! I got rid of cable and thought it would be a hard transition but I don't miss cable at all and I certainly don't miss the outrageous prices they want to charge after the promotion has ended. It was super easy to install, really just plug one end into a power source and the stick itself into the tv...that's it...it does the rest for you. I like this so much that I really regret spending the extra I did on another more expensive unit. I will definitely purchase again for the other tvs in my home.", "verified": true, "helpfulness": "0/0", "author": "Camille Gullap"}, {"rating": 4.0, "review": "While I haven't been able to fully delve into the capabilities of the unit, I must say that so far I have been very impressed with its speed, content, and overall performance.  Yes, it is true that the UI is specifically geared toward Amazon products.  However, I would say that with any Amazon product you need to be a Prime member in order to fully take advantage of how the unit (Fire tablet, Fire TV, etc).  That is why I have to give it four out of five stars.  If you are a Prime member than it would be five out of five.  Now, I also haven't explored the gaming aspect yet either.  I am hopeful to get a game controller so I can start to put on emulators and get my retro gaming on so that is something no other streamer, outside of the Nexus player, has.  May update my post if and when I can delve more into gaming with this.", "verified": true, "helpfulness": "0/0", "author": "Hwlngmad"}, {"rating": 5.0, "review": "Absolutely as easy to set up and use as the description said. I am completely satisfied.", "verified": true, "helpfulness": "0/0", "author": "cheryl marking"}, {"rating": 5.0, "review": "We like our Fire TV stick. We use it to view Amazon Prime and Netflix movies and TV series. Our cable package offered very little viewing other than reality and trash shows so we like this better. Had to increase our internet speed but it's worth it.", "verified": true, "helpfulness": "0/0", "author": "Ann Thompson"}]