[{"rating": 5.0, "review": "Its great", "verified": true, "helpfulness": "0/0", "author": "Yonis Godoy"}, {"rating": 5.0, "review": "Works very well.", "verified": true, "helpfulness": "0/0", "author": "Nolan J Venso"}, {"rating": 5.0, "review": "Awesome. Very happy. No reason to spend  $$$$$on a smart TV is you have a perfectly good flat screen. Just get this, plug it in, and voila.", "verified": true, "helpfulness": "0/0", "author": "Klara Renteria"}, {"rating": 5.0, "review": "It's awesome and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Someone told me about this product, but I didn't believe it was as good as they said. I received it, plugged it in & I was amazed. I have access to my favorite shows right at my fingertips for an awesome price. I love the Amazon Fire Stick!!", "verified": true, "helpfulness": "0/0", "author": "Adelia"}, {"rating": 5.0, "review": "My husband wanted to try this especially to order the MLB subscription. Easy to install and hook-up-just follow the instructions on the screen. Since we also have Amazon Prime, it was a good way to use what Amazon prime has to offer.", "verified": true, "helpfulness": "0/0", "author": "Joie"}, {"rating": 3.0, "review": "Great little device. I discovered that it works seamlessly with my Sony Bravia remote also. It doesn't need supplied remote for the TV.Edited: 6/21/2015It doesn't work in India. I bough this device because I got one month of free prime with Amazon fire phone purchase. All I can do with this device is to watch YouTube and my TV already has YouTube inbuilt - this is an effective waste of money for me. Amazon should warn users registered with India address of this fact - all the videos give some license errors.", "verified": true, "helpfulness": "0/0", "author": "Aloke Tiwary"}, {"rating": 4.0, "review": "K", "verified": true, "helpfulness": "0/0", "author": "Josue Gomez"}, {"rating": 2.0, "review": "I bought two fire sticks. when they work they're awsome. very user friendly with many options.I only gave it two stars because it would not stay connected to my internet. my internet signal strenth is at 85% in  used the adapter and had everything placed properly and it would not stay connected for more than 5 minutes. I took it to my parents house and the same thing happend with both of my fire sticks.Great idea, poor product.", "verified": true, "helpfulness": "0/0", "author": "Johnathan Peters"}, {"rating": 4.0, "review": "I really like this stickThough I would like to change the controller a bit it's really sensitive and can go easily to the home pageWish was there a wish to continue back home button page so it doesn't automatically jump back", "verified": true, "helpfulness": "0/0", "author": "aces28"}]