[{"rating": 2.0, "review": "It is usable with very limited apps and stations.  Narrow field of choices with overt pressure to view Amazon Prime video and token nods to Hulu and Netflix.  I wish I had bought a second Roku.Stick is difficult to navigate through other apps except for prime.  There is currently no connection to Vudu or M-go where past purchases for me are", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Nice item,  hope in future more options", "verified": true, "helpfulness": "1/1", "author": "sayed hashim"}, {"rating": 5.0, "review": "Love this thing. I can turn any tv into a smart tv and can even use kodi. Great purchase.", "verified": true, "helpfulness": "0/0", "author": "cris"}, {"rating": 5.0, "review": "Just got my fire TV stick. I definitely like it better than my Roku.", "verified": true, "helpfulness": "0/0", "author": "Gerardo Barajas"}, {"rating": 3.0, "review": "You need to create a way to search for apps only on the fire TV every time I search for an app only movies come up. Also some of the apps you have for android I would want on my fire TV yet they don't transfer.", "verified": true, "helpfulness": "0/0", "author": "Just saying"}, {"rating": 5.0, "review": "I am using it outside usa and wished I could access more content but anyway I love it.", "verified": true, "helpfulness": "0/0", "author": "ERP"}, {"rating": 2.0, "review": "It strikes the same chord as iPhone vs Android phones. The Apple TV may have less widgets and apps, but the user interface is far superior to the Fire TV. I find this product to have confusing controls, cluttered menu, and the navigation is a pain compared to the simplicity of an Apple product. The benefit is not having to aim the remote directly to the receiver, and a ton of networks to choose from. However, if given the choice between all the on-demand media boxes, I would go with Apple.", "verified": true, "helpfulness": "0/0", "author": "FXguy"}, {"rating": 2.0, "review": "Been using a Roku for a few years, but it died recently, and also happened to receive one of these Fire TV Sticks as a birthday gift.I expected a much better product - most of my Amazon experience has been very positive.So here's the comparison:1) Why would something meant to get power from the HDMI port still require being plugged into the wall? I've done so, but how much juice does this thing need?2) Whatever I happen to be streaming at any given moment on it randomly either freezes, or the screen freezes with the sound continuing. It happens often enough that I am planning on ditching this device and purchasing a new Roku, which never had that problem.3) If I want to watch something from Amazon that's not available for free, it doesn't give me the option of renting it, only buying it outright - so I have to go to another device (computer or mobile) and rent the movie using that medium instead. You'd think a device built by Amazon would function with as much fidelity as their website does - but it seems designed to get you to spend more money by not allowing some options.", "verified": true, "helpfulness": "1/1", "author": "Mason J. Rourman"}, {"rating": 5.0, "review": "Love it! but i don't want membership lol", "verified": true, "helpfulness": "0/0", "author": "Natalee Fogarty"}, {"rating": 5.0, "review": "A.maz.ing. love amazon, love the fire stick. I will never buy a smart tv. The fire stick is better, easier and cheaper to fix (i.e. replace), less tech to break (who knows how much a broken smart tv costs to fix), and works just the same !", "verified": true, "helpfulness": "0/0", "author": "Agamemnon"}]