[{"rating": 5.0, "review": "For the cost, it does exactly what I need. My kids love it as it is easy for them to use and maneuver. I won't do  a technical review as I have nothing to compare it to, but the simplicity is a deal breaker compared to other products I've read review for. I'm very satisfied, and after the first one worked out so well, I bought 2 more for our other TVs.", "verified": true, "helpfulness": "0/0", "author": "Shannon McCarrick"}, {"rating": 5.0, "review": "I liked my Fire TV Stick so much that I bought the Fire TV. In fact, I liked them both so much that I ported one of my iPhone games so that it could be played using the remote. Feel free to download Lost Balloon for free after you get one of these cool devices.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Tony Kulla\""}, {"rating": 5.0, "review": "Great add on for your TV", "verified": true, "helpfulness": "0/0", "author": "Tisha Moon"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "PAUSE002"}, {"rating": 5.0, "review": "Oh my god i love it who would have thought it's so easy to work. i now watch what i want when i want this is great", "verified": true, "helpfulness": "0/0", "author": "Ruth Ellen Butcher"}, {"rating": 5.0, "review": "I have only had it for 2 weeks but I LOVE IT!!  It seems to \"trip\" once in a while, but not too bad.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Niddlediddle\""}, {"rating": 1.0, "review": "This device freezes up more than actual shows are streamed.  I spend more time resetting it than I actually spend enjoying watching anything.  When it actually is working and I utilize my promo subscription of Sling TV (on the rare occasion it will load) I am constantly waiting on programs to buffer or am kicked out.  I subscribe to both HULU and Netflix and have never had any issues, so I know this is not a network problem.Very poor quality device partnered with even poorer quality tv streaming subscription ( SLING TV). I will be returning this device, canceling the subscription and spending the extra money on an Apple TV.  What they say is true \"you get what you pay for\".", "verified": true, "helpfulness": "1/1", "author": "Jessica"}, {"rating": 5.0, "review": "I love my Fire TV Stick so much that I purchased a second one. We can watch prime on both floors. It's small and easy to set up, and no wires showing.", "verified": true, "helpfulness": "0/0", "author": "Fran57"}, {"rating": 5.0, "review": "It was everything I wanted and easy to use which is the big thing to me the controls get me confused but not these", "verified": true, "helpfulness": "0/0", "author": "linda"}, {"rating": 1.0, "review": "Disappointing.  Not sure what I expected, but cannot watch live tv or HD programming, or maybe I didn't give it a fair shake.  If not for movie library or 2 day shipping, it would be returned.", "verified": true, "helpfulness": "0/0", "author": "Michael E McCarthy"}]