[{"rating": 5.0, "review": "Have Firestick and Chromecast. Both are great but the stick performs better.", "verified": true, "helpfulness": "0/0", "author": "jimz"}, {"rating": 5.0, "review": "This device was very easy to set up and use. I have been using it for about a month now, and have had no problems with it. The user interface is very intuitive and straightforward.", "verified": true, "helpfulness": "0/0", "author": "andrew randall"}, {"rating": 5.0, "review": "I'm not so technical so I was surpised that it still had to be plugged into and electrical socket. But all in all, this has been a wonderful experience. We love it!!!Dez", "verified": true, "helpfulness": "0/0", "author": "Dez"}, {"rating": 4.0, "review": "Working great on my other tv.", "verified": true, "helpfulness": "0/0", "author": "Kevin Yang"}, {"rating": 5.0, "review": "works great. Was a bit hard to get started with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"kessmd\""}, {"rating": 4.0, "review": "I like it.", "verified": true, "helpfulness": "0/0", "author": "Anita J."}, {"rating": 5.0, "review": "Awesome! I can now share my son's Netflix account and listen to Pandora.", "verified": true, "helpfulness": "0/0", "author": "mka356"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Theodora A. Siegel"}, {"rating": 5.0, "review": "Works great and fairly easy to setup.  If you have a issue - use the built in HELP - and they will call you direct.", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "You will need to plug in the 'stick' part if you want the best performance. The wire is a bit short so you will need to be close to an outlet.Other than that, the remote is very smooth and simple to use. Both the stick and remote are very lightweight and small, making it easy to carry with you for travel or simply move it to different rooms. Since it is a bit small, it can be easy to lose so keep it in a safe place. The actual program interface is very clean and favors Prime's material (obviously). If you want to use Netflix, you will need to access it as an 'app' along with Hulu Plus, etc.If you buy it for a friend, it will come logged in with your account, but this is easy to change. Still learning it, but overall I would definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Delphi"}]