[{"rating": 2.0, "review": "It is hard to find the programs you once seen, not easy to get them back up later.", "verified": true, "helpfulness": "0/0", "author": "paul dorion"}, {"rating": 5.0, "review": "Awesome! Best streaming device on the market!  The wireless works much better than my Roku.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "Small and smooth. The performance is good, much better than Roku at the price point, I've been using it over my Apple TV (3rd generation). I enjoy having the new app interfaces for apps such as Netflix which still hasn't made it to Apple TV (design). For the first few days for some reason it deemed my 5Ghz wifi band as out of range and then suddenly showed it as very good signal. Bugs like this I'll assume will be fixed through future updates. The interface could use some work, like adding the ability to arrange apps as you please. It does push Amazon content which is to be expected. It's nice to have direct Amazon prime video access as opposed to using AirPlay to push the content. Overall satisfied with purchase. Great value.", "verified": true, "helpfulness": "0/0", "author": "DisDudeIsFly"}, {"rating": 3.0, "review": "I enjoy all the content, however the unit seems to have a hard time staying connected to my wifi.", "verified": true, "helpfulness": "0/0", "author": "Bill Starken"}, {"rating": 1.0, "review": "Got 2 on pre-order. One for my lovely kid and one for my lovely wife.Installed the first one the day I got them in my kid's bedroom (it was a Tuesday, I think). Everything worked like a charm. He didn't use it (tried to use it) till the weekend. Surprise! It wasn't working: First of all, the remote controller is totally misconfigured, Most keys have their intended action swapped with other keys. After a while, I manage to figure out the \"new layout\" of the keys only to find out that it can't get connected to the previously authorized network. It keeps reporting Authentication problem and, obviously, got disconnected. Device reports signal as strong although it got down to poor when authenticating. I've tried \"forgetting\" the network and re establishing it to no avail.Yes, you guess it. Now my lovely boy is an angry boy.I gave up and tried the second one (which was still in its box). This time I installed it in the kitchen. Same thing: It got connected perfectly by the time I installed it. And it kept working like that for a few days. Woohoo!Until it couldn't authenticate anymore. This is showing exactly the same behavior except for the controller: It is -still- working fine.Yup, now my lovely wife is mad at me. Thank you Amazon! What a way to start this Xmas season!I tried to convince her telling that now she has a nice 32\" digital photo frame thanks to Amazon but it didn't work either. She told me that she couldn't even change the pictures.", "verified": true, "helpfulness": "3/4", "author": "Williams Castillo \"Will\""}, {"rating": 4.0, "review": "The interface is put together well. The only thing that I would appreciate is the ability to que videos as some times I receive a bandwidth error when watching a season of a show.", "verified": true, "helpfulness": "0/0", "author": "infoteknerd"}, {"rating": 2.0, "review": "It works, barely. Makes a lot of audible noise as it pauses frequently during streaming. Works poorly with mobile devices as controller. Buying a second Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Benjamin C. Finley \"bf1255\""}, {"rating": 5.0, "review": "It's an easy and compact way to get the streaming services.  We encountered a problem early on when we turned on the fire TV: only to find the TV displaying a blue screen message of \"HDCP unauthorized. Content disabled\" whenever we tried to play a movie/show on Netflix or on Amazon video.  After trying to replug the fire TV stick and testing it out again, and having the same error message, we went to the Amazon support link.  Customer service was extremely helpful and patient.  He (the Amazon customer representative) had us force stop each application in the fire TV's settings menu and then doing a content clearing of our data, which resetted everything and made the streaming display correctly again.", "verified": true, "helpfulness": "2/3", "author": "Mel Bridges"}, {"rating": 5.0, "review": "This is by far my favorite electronics purchase in years. It takes your ordinary TV and turns it into a smart TV without having to use your laptop or phone to cast things like you would with the Chromecast. I like be not having another box by my TV like a roku or apple TV. I also downloaded the remote app for my phone and I LOVE it. Great buy, highly recommend.", "verified": true, "helpfulness": "1/1", "author": "KJ914"}, {"rating": 4.0, "review": "**Updated Review on 12/8/14**I originally only gave the stick 2 stars.  I am still unable to get the Fire Stick to work in the East side of my 2nd floor but was able to use it on the West side.  I have moved the router and did all the trouble shooting but it just will NOT accept a signal through that wall - My Roku works fine on the East side though.  The reason I have updated my review is to be fair to those who are looking at this product.  I have two smart TV's one in the basement and one on the main floor - The fire stick is quicker and has a smoother transition from screen to screen (especially with photos on the cloud)than the smart TV's do.  If you have a clean line of site with minimal obstruction between your television and router I highly recommend buying the Fire Stick for $39 before buying a Smart TV for $800.  I was amazed at how quick the stick was and how much it can do.  I have uploaded over 3 thousand photos and videos to the Amazon Cloud service and can view them on any TV in the house, and on the TV with the stick the photos transition as smooth as if you were watch them on a DVD. I believe this is worth the money and quite cost effective... Just be aware of the limitations when it comes to homes of certain construction (thick concrete, ICF, Brick and so on).**Original Posted week of 12/1/14** I was excited to get this at just $19 on the pre-order special.  It finally got here yesterday.  I bought it for a bedroom on the second floor.  On the second floor all of our devices work on wi-fi.  I have a roku in the spare bedroom, we have used laptops, and the wifi works on our phones on the second floor.  I even have my desk top computer working off wifi on the second floor.  However the Fire Stick does NOT work on the second floor.  At first I thought it was a faulty stick so I took it to the main floor and put it into that TV and it works great there.  And I would love to use it but I have a smart TV in that living room so I don't need it there.  So I guess I will have to either use the fire stick as a very light paper weight in the office or move my wifi router up a floor.  I haven't decided which I will do yet.  So this was a big disappointment.  Even with the HDMI extender (which they say boost the signal) the stick would say connected but with problems.  If you do not have a smart TV or other streaming the fire stick would be a very cost effective device for you (even at the $39 price range) but if you already have something that works well for you then don't bother with this.", "verified": true, "helpfulness": "1/1", "author": "Gerald Weis"}]