[{"rating": 5.0, "review": "Set up was easy,made my dumb TV smart!", "verified": true, "helpfulness": "0/0", "author": "Double D"}, {"rating": 5.0, "review": "Great reception & easy organization.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Inexpensive replacement for Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Huong Luu"}, {"rating": 4.0, "review": "I have a Roku 3 that I'm comparing this with.  I like it but it's a little pokey.  It sometimes sutters when navigating the menus.  I like it, but I just use it for the TV in the dining room.  I'll leave the Roku in the living room where I want something smoother.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "So far I'm very happy with the Fire TV Stick. I actually have 2 now and I don't see myself swapping them out anytime soon. I've used Roku (1st-3rd Gen), Chromecast and some lesser known/off brand devices. All had their strengths and weaknesses. The Fire TV stick plays the \"Big 3\" streaming services (many lack Prime Instant Video), and I got it during the pre-order sale for $20. Here's my rundown:Pros:- Playback is smooth- WiFi connection is solid- Remote is easy to use- Good/easy to use Interface- Unbeatable price when on saleCons:- Remote buttons are a little loud when clicking- Doesn't support MHL for power so it needs to be plugged in", "verified": true, "helpfulness": "0/0", "author": "AC2MO"}, {"rating": 5.0, "review": "Got it for the sole purpose of side-loading XBMC, to not have to hook the computer or tablet up to the TV. Remote works great with XBMC.", "verified": true, "helpfulness": "0/0", "author": "amanda r."}, {"rating": 5.0, "review": "This device is awesome, who needs cable or direct TV when you have a Amazon.com Fire TV Stick. The 30 day prime trial was just icing on the cake. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Joseph D. Carta"}, {"rating": 5.0, "review": "Very good and affordable product.  My 12 yr old loves it and doesn't use the chromecast any more.", "verified": true, "helpfulness": "0/0", "author": "swimbikerun2010"}, {"rating": 5.0, "review": "No more going to just one room to watch Netflix!", "verified": true, "helpfulness": "0/0", "author": "Susan G. Daniels"}, {"rating": 4.0, "review": "control is easy to use - I only wish it worked for Plex, I love this thing though - nice to be able to view all Amazon Prime, Netflix (and other) programming all in one spot", "verified": true, "helpfulness": "0/0", "author": "Wilcox"}]