[{"rating": 3.0, "review": "Im a cord cutter since 2009, I have two of these, decent range, video quality on prime video is very good, Sometimes there is lagging on Netflix and YouTube, using my other devices to browse and then cast the show to my TV does not work, its available in netflix, youtube but never works, the fire tv hulu interface doesnt have this feature. you can still watch them but you have to browse on the more cumbersome TV menu using the remote. (the whole interface with other devices, using phones or tablets as remotes could be greatly improved with a simple update, hopefully the good people at amazon will get around to it soon)Good quality device at a good price, not as easy to use as chromecast, the reasons id recommend over chromecast is that it does have a better wifi range and most importantly it works with PRIME VIDEO.", "verified": true, "helpfulness": "0/0", "author": "Jose E. Gonzalez"}, {"rating": 5.0, "review": "Had this for about 2 weeks and I love it for all the reason it was said to do and it does it well..would recommend to everybody", "verified": true, "helpfulness": "0/0", "author": "saverio rimi"}, {"rating": 5.0, "review": "Plugged it in, works great.  What more is there to say.  Actually bought a second one!", "verified": true, "helpfulness": "0/0", "author": "SRK \"Happy in Cal\""}, {"rating": 5.0, "review": "Wanted Netflix and YouTube on my TV which does not have options like smart TVs have now a days. Worked well !", "verified": true, "helpfulness": "0/0", "author": "Sourabh K."}, {"rating": 1.0, "review": "Definitely not up to my expectations bad connection hard to follow", "verified": true, "helpfulness": "0/0", "author": "Sara"}, {"rating": 4.0, "review": "The Amazon Fire TV Stick was given to me as a gift. It is easy to install and operate but occasionally it loses connection and service is interrupted for a short period.", "verified": true, "helpfulness": "0/0", "author": "John E."}, {"rating": 5.0, "review": "Love it.  Use it more often than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Billie Jo Repsher"}, {"rating": 5.0, "review": "Awesome, speed, easy and great!", "verified": true, "helpfulness": "0/0", "author": "Ramee Al-maqssod"}, {"rating": 4.0, "review": "Few problems are the remote, the extention cord, and big screen tv's. The stick behind a big screen tv seems to loose communication with the remote, so you press ti button once then when in the sling tv app the stick will think multiple presses have been made. So thinking use the extension short cord that comes with it to get it away from the tv so it can get a better signal still no help. So the stick is a great buy with smaller tv's or better placed HDMI ports, i have a 50 in Vizio UHD.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "5 stars nuff said", "verified": true, "helpfulness": "0/0", "author": "Brian Myers"}]