[{"rating": 3.0, "review": "I like the Fire stick.  I am able to watch Netflix movies with no problem.  However, I am a prime member and cannot watch prime movies without waiting for them to download.  It says my internet broadband is too low, but I do not have an issue with Netflix.  It is a little frustrating and ironic since I chose the Fire stick so I could watch prime movies specifically.", "verified": true, "helpfulness": "1/1", "author": "Tammy D."}, {"rating": 4.0, "review": "Lack of youtube app.... the substitute app keeps buffering quite a bit., same with the official netflix app too. tested with other devices where youtube official app did not have the problem on the same bandwidth.May be the wireless reception / connectivity on fire tv stick needs to be improved.", "verified": true, "helpfulness": "1/1", "author": "Maverick"}, {"rating": 5.0, "review": "Love Amazon Fire Stick t.v.  With Amazon Prime, this is the greatest bargain going in the tech world.  My wife and I used to watch (and pay for) all the premium cable channels.  Now there is more than enough good choices for us to watch with this inexpensive and easy to use little device.  Got one for my son and he loves it too.  I have  a smart t.v.  My son does not.  Smart t.v. is not necessary to enjoy this.", "verified": true, "helpfulness": "1/1", "author": "Mark Price \"Laborman\""}, {"rating": 5.0, "review": "One word \"Awesome\"", "verified": true, "helpfulness": "0/0", "author": "William Griffith"}, {"rating": 5.0, "review": "Works great, easiest install I have ever seen.  I love it.  Getting one for every tv in the house.", "verified": true, "helpfulness": "0/0", "author": "Ronald P Livingston"}, {"rating": 4.0, "review": "Works pretty well. I have a roku for my boys and honestly; wifi on both fail randomly, you have to re-login on each once an app is uodated and the fire stick has more to offer over all. Not surprisingly, sure everyone knows that, but I definitely recommend this to roku any day. Too many perks to even compare the two.", "verified": true, "helpfulness": "1/1", "author": "michael"}, {"rating": 5.0, "review": "Easy to install and easy to use. What a great product#", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "awesome invention!! who needs cable anymore?!:)", "verified": true, "helpfulness": "0/0", "author": "Jodi Baker"}, {"rating": 5.0, "review": "This thing is awesome. Received it faster than they said.", "verified": true, "helpfulness": "0/0", "author": "MelissaC"}, {"rating": 5.0, "review": "Really amazed at what amazon has created, best money I've ever spent and recommend it to everyone.", "verified": true, "helpfulness": "1/1", "author": "Mike"}]