[{"rating": 5.0, "review": "We put this upstairs in the guest room. it sets up quickly and is easy to use . Thank you!", "verified": true, "helpfulness": "0/0", "author": "Turtle Kientz \"Buzzy\""}, {"rating": 5.0, "review": "If you have amazon prime, Netflix and HBOgo you'd be stupid not to buy this.  We cut out a cable box and have this on the less used TV and it's great.  No cable line,  sets up to WiFi in a few minutes. Excellent.", "verified": true, "helpfulness": "0/0", "author": "MIKE"}, {"rating": 3.0, "review": "its a little slow...and not many programs to offer unless you join prime......I would probably get the roku stick if I were to do it again...", "verified": true, "helpfulness": "0/0", "author": "matte"}, {"rating": 2.0, "review": "I ordered two Firesticks for my family. I love the fact that it is portable and easy to use. That being said, I mainly watch Netflix.  There is a known issue with the Firestick and Netflix compatibility. I began researching this issue after I had trouble connecting to Netflix. Apparently, the fix is to clear the cache and data multiple times, unplug the unit & then it works. I don't have time to jump through hoops to get this device to work.. I really wanted this to work. Hopefully, Amazon works out the Netflix kink soon.", "verified": true, "helpfulness": "0/0", "author": "Paula Springer"}, {"rating": 1.0, "review": "The Fire TV Stick keeps dropping the Wi-Fi signal.  We keep getting the error message \"not connected to the internet\" but when we check the system says connected.  Very disappointed with this device.", "verified": true, "helpfulness": "0/0", "author": "Serene"}, {"rating": 1.0, "review": "NOT WHAT I EXPECTED IT TO BE I THOUGHT IT WAS AN ANTENNA THAT WOULD GRAB STATIONS OUT THE AIR I ALREADY PAY FOR CABLE", "verified": true, "helpfulness": "0/4", "author": "jerry w boyd"}, {"rating": 4.0, "review": "My wife and I love the device, the only thing we wish it had was the ability to \"fling\" content to it from something other than a Fire Tablet.  If we want to watch a YouTube video or something from our tablet or phone, it doesn't work on our larger screen.Otherwise, it works great for streaming video from many services including Netflix, Amazon Prime, Hulu and more.It makes our \"Dumb\" Plasma TV \"Smart.\"  But, it doesn't work as well as the inherent basic abilities of our newer Sony TV that has everything built in already.  (Including the ability to watch a YouTube video from a tablet.)If this had cross platform interaction (In this case apple devices) it would be a 5 star without question.", "verified": true, "helpfulness": "0/0", "author": "Julian Goldblatt"}, {"rating": 5.0, "review": "Works really well.", "verified": true, "helpfulness": "0/0", "author": "David Leuck"}, {"rating": 5.0, "review": "I initially thought I would be able to start a fire by striking the to components together and creating a spark.  My 9 year oldson informed me that it plugs into the HDMI port of the television and allows us to receive a lot of free online televisionprogramming.  I like free and I like television, so this thing is good.  Although, I also like fire, so the name is a little misleading.", "verified": true, "helpfulness": "0/1", "author": "Harry Seaward"}, {"rating": 5.0, "review": "We already have a Netflix account. Why am I being asked to purchase Netflix?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]