[{"rating": 5.0, "review": "LOVE IT! Super easy to set up.  The movie quality is great.  Also love that I can play my Prime Music on it as well. I'm so glad I purchased this Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Tracy Hopkins"}, {"rating": 5.0, "review": "use it all the time!", "verified": true, "helpfulness": "0/0", "author": "Michael and Elizabeth Bottino"}, {"rating": 2.0, "review": "I thought I was having a problem with my Roku stick. I have a Fire HD tablet that I really like so I have been wanting to try out Amazon's Fire TV.  So I ordered one of these Fire Sticks. Installation and setup was super easy and it had the channels I watch...BUT...I had a serious problem with it because it kept dropping my WiFi signal. It was very intermittent...sometimes a minute, sometimes 15 minutes, and sometimes 15 seconds. I never had that problem with my Roku stick. I should have given it a 1 but I know the problem had to be a hardware issue. So I rated it the way I would have if I hadn't had the problem. What I discovered was that I like the Roku better. The Fire stick was just too...Amazon. That's what makes the Fire HD so GOOD but it just didn't work for me with the Fire stick. I understand why it is because it IS Amazon! The Roku is so much more generic. I like the operator interface that Roku has much better. And it's just not in your face Roku. The Fire stick was in your face Amazon. If it had the same or similar user interface as the tablet I probably would have tried another one. I sent it back and ordered a Roku 3.I just posted a 3 star review a few minutes ago. Since then I read some of the other 3 star and lower reviews and I found that quite a few folks experienced the same issue with the WiFi that I did. There were a LOT of complaints about that. I guess it's like Russian Roulette...I'm changing my review to 2 stars.", "verified": true, "helpfulness": "0/0", "author": "George E. Stratton"}, {"rating": 5.0, "review": "Excellent purchase. Does exactly what it says it will do. Extremely easy set up.", "verified": true, "helpfulness": "0/0", "author": "SLY"}, {"rating": 5.0, "review": "works great ...Lots of movies if you are a Prime member", "verified": true, "helpfulness": "0/0", "author": "Fit4life \"SPA\""}, {"rating": 5.0, "review": "Easy to setup and use!", "verified": true, "helpfulness": "0/0", "author": "iact Account"}, {"rating": 2.0, "review": "Keeps glitching,  pops & shows red lines throughout TV screen,  will not stream very well. I have to constantly go back to the home screen.", "verified": true, "helpfulness": "0/0", "author": "Tonya"}, {"rating": 5.0, "review": "I am delighted with the performance and the selection of programming that is available.  Has not seemed to have any issue with the speed of the internet connection.  Sometimes a very short pause when selecting a new episode in a series.", "verified": true, "helpfulness": "0/0", "author": "R. Duncan"}, {"rating": 5.0, "review": "Absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Rebecca R"}, {"rating": 4.0, "review": "I've had steaming Blu ray players with app capabilities but the load rates were terrible. The Fire stick is always on, you simply change the input on your TV to access it. I don't have the best internet service but I haven't experienced any kind of crashes or failures yet and the picture quality has been great, for the most part.  The remote is very responsive and simple to use. The only reason I'm not giving this 5 stars yet is because the lack of a few Apps. Don't get me wrong, all the biggies are there and they add new stuff all the time. I'm just waiting for them to have Starz play. Add that and I'll add that final star!!", "verified": true, "helpfulness": "0/0", "author": "Brian J. Silvers"}]