[{"rating": 5.0, "review": "Did not show video for 1hr. Then started to work. Only had sound at first with some error. Since then it's been great.", "verified": true, "helpfulness": "0/0", "author": "steven johnson"}, {"rating": 5.0, "review": "Works great. Easy to use.  Great companion to Prime.Should be able to use power from TV.  Required power source is a bit cumbersome and limiting.", "verified": true, "helpfulness": "0/0", "author": "Popcorn fanatic"}, {"rating": 5.0, "review": "I was very impressed that such a small device could work so well.  It was very easy to set up and my daughter loves that she can use her phone as a remote.", "verified": true, "helpfulness": "0/0", "author": "Pam Friedman"}, {"rating": 5.0, "review": "I purchased this to see if it would perform better than the Roku 2 XS as it was constantly stopping and reloading. Roku said it was the internet and ATT said it was the Roku. The Fire TV Stick fired right up and has performed perfectly at half the price. It is fast and easy to use. I am planning to buy another one for the spare tv.", "verified": true, "helpfulness": "0/0", "author": "robert holtzclaw"}, {"rating": 3.0, "review": "Works great! The only negative is that it doesn't allow Kids Time on the stick!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "david carreon"}, {"rating": 5.0, "review": "I like it so far", "verified": true, "helpfulness": "0/0", "author": "DENISE COUGHLIN"}, {"rating": 5.0, "review": "Works perfect!", "verified": true, "helpfulness": "0/0", "author": "Barbara Z. Church \"slugchurch\""}, {"rating": 3.0, "review": "I want to give it a higher rating but can't because I can't use it like I want too. I received it as a gift and I know it is awesome because I have seen it work but it does not work on my TV. My TV is only a year and a half old and it works on another TV in our house that is older. So yes I can use it in another room but I don't need it in there I wanted it for the room that I could not have the abilities of the fire stick. Just frustrating because basically I have to buy a new TV and end up spending money that I thought I would be saving by buying a $40 item.", "verified": true, "helpfulness": "0/0", "author": "Megan"}, {"rating": 1.0, "review": "It just gives me access to for fee networks.  It was a gift so I had no expectation.  Not impressed.", "verified": false, "helpfulness": "1/2", "author": "Jennifer Etheridge"}]