[{"rating": 5.0, "review": "Love it so far fast to get installed and lots of movies with my prime membership", "verified": true, "helpfulness": "0/0", "author": "Orley Setterington"}, {"rating": 1.0, "review": "Bought it prerelase two months ago for one purpose, to use it at hotels.  When buying the unit, that feature, called captive portal access said coming soon.  It is more than two months later and the feature still says coming soon.  The stick has been laying in the box while I wait.  Read the more than 100 reviews of customers upset about this.  Giving it another two months before I attempt to return this useless crap.  Amazon, fix this already.", "verified": true, "helpfulness": "2/4", "author": "Reviewer"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "MrSkipper"}, {"rating": 5.0, "review": "Excellent! Easy to use, works with all my online movie services and no streaming delays.", "verified": true, "helpfulness": "0/0", "author": "LindaFae"}, {"rating": 5.0, "review": "It's super!!!!!!!  What a great gadgets $39.00", "verified": true, "helpfulness": "0/0", "author": "Carolyn S. Thomas"}, {"rating": 5.0, "review": "Works great.  Easy to set up.  I downloaded the app for my Droid phone also .. and it works great as well as the remote that came with the stick.I've already recommended buying one to 3 close friends", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Charles LABADIE"}, {"rating": 5.0, "review": "Very nice and functional unit. I have received and replaced my Roku TV units and Apple TV unit with Fire sticks. Excellent feature set and speed, nice form, good to receive all necessary parts in the box (including the HDMI extender - nice touch!).  I do hope the UI becomes cleaner and less cluttered over the next several releases.", "verified": true, "helpfulness": "0/0", "author": "Tej Dhawan"}, {"rating": 5.0, "review": "Very easy to install and then navigate.", "verified": true, "helpfulness": "0/0", "author": "Sue Wu"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Suzanne Semones"}]