[{"rating": 5.0, "review": "Easy to install plug and paly", "verified": true, "helpfulness": "0/0", "author": "Pam Brickman"}, {"rating": 5.0, "review": "Good transaction.  Made the mistake of sending it back because I didn't have wireless, which I didn't know.  Then a month later, I changed my cable provider and now have wireless but Iwon't get the stick again since I put out the money once and don't want to do it again.", "verified": true, "helpfulness": "0/0", "author": "Mabel C."}, {"rating": 5.0, "review": "Enjoying our gift & not too bad booking up either!", "verified": true, "helpfulness": "0/0", "author": "Richard L. Brumm"}, {"rating": 5.0, "review": "Works great!!", "verified": true, "helpfulness": "0/0", "author": "R. Connelly \"Good Nite\""}, {"rating": 5.0, "review": "So simple to set up. Excellent picture quality. Much better than broadcasting via a tablet. Hands down better than Chromecast.  Love it!!", "verified": true, "helpfulness": "0/0", "author": "Debra L. Banford"}, {"rating": 3.0, "review": "Ads made me believe I had access to everything; turns out I have to pay additional for a lot of content.", "verified": true, "helpfulness": "0/0", "author": "Chance Walgran"}, {"rating": 3.0, "review": "I really could not use this as I had expected.  A customer service person had told me that this would communicate with the Kindle Fire HD 6, but it did not, so I ended up having to return it.  Other than that it may be useful to someone that likes a device that is almost solely based on pay per view capability.  Almost every choice on the menu that it presents is commercial and not based on communicating with the web/internet directly.  Some of you may be interested in an item like this if you have a device such as a tablet that will communicate with the web/tv combination, but other than that it seems sort of commercial and in some ways based on membership to services.", "verified": true, "helpfulness": "0/0", "author": "Casey G. Jones"}, {"rating": 5.0, "review": "Probably the easiest install I've ever done. It already knew my account and was ready to go.When Amazon raised prime rates, I was going to not renew because I just don't watch TV on my computer. Now it works really easily on my bedroom TV.I can see where the selection of free videos could get boring, but I'm OK for now since I so far behind on watching new movies.", "verified": true, "helpfulness": "0/0", "author": "Douglas Tatelman"}, {"rating": 5.0, "review": "Had this a week and so far we love it! Our t.v. is on the first floor and the internet router is upstairs. I was worried that may be too far away based on other reviews, but we've had no issues. I literally was in Netflix within 10 minutes of taking this out of the box. Great, well priced, product.", "verified": true, "helpfulness": "0/0", "author": "E. Duran"}, {"rating": 5.0, "review": "Good product.", "verified": true, "helpfulness": "0/0", "author": "Mary K. McSweeney"}]