[{"rating": 4.0, "review": "Love it. Thanks", "verified": true, "helpfulness": "0/1", "author": "Ace"}, {"rating": 5.0, "review": "Love it!  Great price.  Item shipped on time and was easy to install.", "verified": true, "helpfulness": "0/1", "author": "Wanda Smith"}, {"rating": 5.0, "review": "I am enjoying Amazon Tire TV Stick immensely! I haven't accessed all additional apps.  just Netflix for now.  Fun, fun, fun!", "verified": true, "helpfulness": "0/1", "author": "Cyn Minn"}, {"rating": 5.0, "review": "Was a snap to install.  Watch the youtube.com installation video - great.", "verified": true, "helpfulness": "0/1", "author": "Vicki King"}, {"rating": 5.0, "review": "Very cool.  I was disappointed that HBO GO is not part of the deal but I'm very happy with it refardless.", "verified": true, "helpfulness": "0/1", "author": "Linder"}, {"rating": 5.0, "review": "We like how easily it was to set up, how small and unobtrusive it is, and how well we can connect to Amazon Prime as well as Netflix and other options.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"BLM\""}, {"rating": 3.0, "review": "Has a tendency to have buffering issues quite frequently.  Not able to watch the majority of streaming video without multiple pauses.  Not as good as I hoped.", "verified": true, "helpfulness": "0/1", "author": "J. BROOKS \"living life to the fullest\""}, {"rating": 5.0, "review": "I like this a lot more than I thought I would...I highly recommend !!", "verified": true, "helpfulness": "0/1", "author": "Lovin My Kindle"}, {"rating": 2.0, "review": "It's an okay device, but INCREDIBLY slow at times! The YouTube app being one of the biggest culprits. It randomly lags when the internet is great! Restart Fire Tv Stick, but issues are still there. Very laggy and slow. Would want to buy a Fire TV Box, but I don't know if that will be much better.Used Chromecast before this and might actually switch back :/", "verified": true, "helpfulness": "0/1", "author": "Caleb Whitlow"}, {"rating": 5.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/1", "author": "kathryn moore"}]