[{"rating": 4.0, "review": "I've become a fast fan of the Fire TV products. We initially bought the Fire TV box and have been very happy with the functionality and performance. All of the available apps are what did it for me - we use Prime, Netflix, and Plex frequently, so Fire TV has been perfect for us. Once we decided the Fire TV platform met our needs, I bought the Fire TV Stick for my office TV. I'm thrilled with the performance. I have a slight concern that there would be lagging due to the lower specs compared to the box, but didn't need to worry - it performs just as well, with no noticeable performance problems.We used a couple of Apple TVs for a few years and never really felt like they met our needs (no Prime or Plex capability). Being able to search for and add new apps has been great. Looking forward to new apps being developed as the platform matures.I only have 2 complaints:1. Sorting - This is a problem with all the video services/platforms. It would be incredibly simple for all these services to provide a TV/Movie list view based on the rating. Netflix at least has a Kids section that is helpful for families. I just want to be able to sort and show a single rating and view the shows available. It's frustrating to have to scroll through the Hangover movies when I'm trying to find a family-friendly comedy. This is a simple fix that would go a long way towards customer satisfaction.2. Prime Music - Amazon's implementation of Prime Music has been mediocre, at best. I pretty much refuse to use the service because the functionality is so poor. Sadly, the Prime Music experience on Fire TV is even worse. You have to go to the Prime Music web UI on a computer, add music to your favorites, then you can see and play that music on the Fire TV. What a horrible experience. I should be able to search the Prime Music library from the Fire TV and manage playlists and play music directly from the Fire TV. I'm not sure if Amazon did this on purpose, or if it is just a work in progress. Either way, it's frustrating and continues to push me to use Google Play Music All Access.", "verified": true, "helpfulness": "0/0", "author": "Russell Babcock \"drbabcock\""}, {"rating": 5.0, "review": "Real nice product", "verified": true, "helpfulness": "0/0", "author": "Logan Bennett"}, {"rating": 5.0, "review": "I'm very satisfied with this small stick wonder. Even though it's hidden at the back of my TV, there's no communication problem between the stick and the controller when I need to search for movies or videos from my library. Even my preschooler easily figured out how the control works in playing games. I would recommend it to my friends.", "verified": true, "helpfulness": "0/0", "author": "Curious George"}, {"rating": 5.0, "review": "Awesome little tool.", "verified": true, "helpfulness": "0/0", "author": "Rudolf \"Avid Historical Fiction Reader\""}, {"rating": 5.0, "review": "We initially bought the fire TV and LOVED it- so I but one of these for all the other TVs in the house- so glad I did!  I feel I could cancel my cable bill if I wanted to.  I also love how on the amazon music portion it lists the words of the song so you can sing along :)", "verified": true, "helpfulness": "0/0", "author": "Loves to Bake"}, {"rating": 5.0, "review": "Love my firestick! I have the chromecast as well and the firestick just has way more apps plus a remote...I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Seleste Cardoza"}, {"rating": 4.0, "review": "Still gettIng used to it but easy to set up and navigate", "verified": true, "helpfulness": "0/0", "author": "Phyllis Moore"}, {"rating": 4.0, "review": "Super simple to use", "verified": true, "helpfulness": "0/0", "author": "krystle iverson krystle"}, {"rating": 3.0, "review": "The picture is beautiful but somewhat difficult to use sometimes the pic just goes dark and remote don't respond", "verified": true, "helpfulness": "0/0", "author": "Michelle McLain"}, {"rating": 2.0, "review": "It is ok and works like it says but I was expecting the voice command feature.  Would have paid for it too.  They also don't give you much of a tutorial on how to use it to its fullest.  Would like to see about using this instead of cable.", "verified": true, "helpfulness": "0/0", "author": "AZ"}]