[{"rating": 5.0, "review": "Awesome! Great price for what you get.", "verified": true, "helpfulness": "0/0", "author": "Ellie O'Gara"}, {"rating": 5.0, "review": "It was very easy to install and very simple to get around!", "verified": true, "helpfulness": "0/0", "author": "Paula Proia"}, {"rating": 2.0, "review": "It's a great idea but maybe not powerful enough? It got kinda wonky after just a week or two; it would freeze up or just not load something.", "verified": true, "helpfulness": "0/0", "author": "Brian Q."}, {"rating": 5.0, "review": "We are very happy with the Firestick, HOWEVER, when you had the special deals with Prime members and the Fire Stick was greatly reduced, when I went on the website at 9:30 a.m. to buy onr more, there were none left.  I had been waiting to order another one for you SPECIAL PRIME MEMBERS, but was shut out when I tried and not allowed to be put on a waiting list.  That is just plain not acceptable and very disappointing.  I look forward to your response.", "verified": true, "helpfulness": "0/0", "author": "Avra Shapiro"}, {"rating": 1.0, "review": "Have not had enough time to go through the device.", "verified": true, "helpfulness": "0/0", "author": "Daniel Chintersingh"}, {"rating": 5.0, "review": "Great deal I will buy one for each room. The family loves it", "verified": true, "helpfulness": "0/0", "author": "pdj"}, {"rating": 4.0, "review": "Great little device. Cannot play a lot of the good games w/o buying the controller for $35.", "verified": true, "helpfulness": "0/0", "author": "C. Pounds"}, {"rating": 1.0, "review": "I was very disappointed in the amazon fire stick. In fact I really had planned to return it but so far I haven't had the chance to get it to the post office. I have tried several movies but every one of them will stop and get the spinning symbol and then say that it is not connected to the internet when there is a perfectly good signal. I also put on the app for my ipad and experienced the same problems from there. I finally had to watch the end of the movie on my ipad since I could not get it to be reliable on the fire stick connected to my TV. I had read on the forum about the same problem happening to others with the fire stick. I tried the same solutions that they had tried but did not have success. I also was upset that the price of this item was on sale for $10 less a few weeks after I had purchased it. As a prime member I think some type of price protection especially for amazon produced items should be given. I will probably try google chromecast to replace the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Christine Mitchell"}, {"rating": 5.0, "review": "I love the fire stick!  Lots of options to choose from.", "verified": true, "helpfulness": "0/0", "author": "BL"}, {"rating": 5.0, "review": "Cable TV?", "verified": true, "helpfulness": "0/0", "author": "Aaron"}]