[{"rating": 5.0, "review": "Smooth and easy to install. The prompts made it so quick, I was done and using it within 20 min.", "verified": true, "helpfulness": "0/0", "author": "MARIA MARTINEZ"}, {"rating": 3.0, "review": "Works mostely, if you use a galaxy tab 4 get the chromecast instead, the galaxy won't mirror through the fire stick", "verified": true, "helpfulness": "0/0", "author": "Chance m Bittner"}, {"rating": 1.0, "review": "Will not keep a internet signal!  All my other devices do? Very Unhappy.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Jones Reed"}, {"rating": 5.0, "review": "Easy to install, easy to use and a must have for watching prime movies on your tv.", "verified": true, "helpfulness": "0/0", "author": "Gary Driscoll"}, {"rating": 5.0, "review": "VERY easy to set up. Love, Love, LOVE the Amazon Fire TV Stick!!", "verified": true, "helpfulness": "0/0", "author": "Donna G"}, {"rating": 3.0, "review": "Make sure you have the internet to sup[port this.We live very rural and only have a DSL line and it would not work for us. Sent it back the day I got it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Giving this 3 stars because It was fabulous while it worked. Great apps, easy to set up and use, excellent connection to my wifi, and I loved it. Here goes the problem..If you have an older TV the fire stick will eventually stop working. Constant software updates will render it incompatible with older TV's. I have a 2006 Samsung. Fire Stick worked great for 3 months then suddenly last week got the blue screen of death \" hdcp unauthorized content disabled\". After calling customer service, they decided it was a defective stick and sent out a new one. New one plugged in fine, and as soon as the software updated I got a black screen only. Called tech support and after trying it on my 2012 Samsung ( it worked)  was told about the incompatibility with new software and older TV's. My bedroom TV ( 2008 Vizio) survived the update. I will say that customer service was fantastic. Very thorough, and easy to work with. They truly did try to do whatever they could to help me and in the end, wound up refunding my purchase even though it was past the 30 days. It may be in the fine print, but I really think that Amazon needs to make this issue a little more widely known. I purchased a total of 3 Fire Sticks, two were gifts, and luckily the others still work on old-ish TV's. I'd hate to give someone a gift that would eventually stop working, and I refuse to buy a $200+ TV to operate a $39 device.", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "brian"}, {"rating": 5.0, "review": "This absolutely works great.", "verified": true, "helpfulness": "0/0", "author": "patty"}, {"rating": 5.0, "review": "Work great. Would get the five TV next time for the faster processor", "verified": true, "helpfulness": "0/0", "author": "JRV"}]