[{"rating": 5.0, "review": "There was much more to the Amazon Fire Stick than I ever imagined.  Only had it two days but we'll need to get more familiar with it so we can decide how much we can cut back on our Comcast cable package.", "verified": true, "helpfulness": "0/0", "author": "Norman F Workman"}, {"rating": 5.0, "review": "This think is awesome. So easy to set up, just plug in the power cord, then into the tv and it just works. Love that it comes already connected to your amazon account. Saved me alot of money over getting a smart tv to stream services like netflix.", "verified": true, "helpfulness": "0/0", "author": "Jenna Goncalves"}, {"rating": 5.0, "review": "does it turn off?", "verified": true, "helpfulness": "0/0", "author": "Su Waldron"}, {"rating": 5.0, "review": "This is handy as a pocket in a shirt!! I now have access to my Netflix account (9$ a mth.!) through my Amazon Prime/Fire Stick subscription! I am also considering dumping my 160$ a month Direct TV bill because I barely watch 30 of the 200 or 300 mind numbing channels I pay for....AND the commercials!!!! GAHHHHH....I hate a commercial to interrupt a good movie...that should be a sin in my book..I think I should be set after ordering Sling TV, having Amazon Prime's awesome selections, music, and games, and Netflix!!! Netflix=100$ yr, Amazon Prime Student=49$ yr, Sling TV=200$ yr with a total of 349$ a year compared to 1,920$ a year for crap satellite!! That is a 1,570$ yearly savings for us....THANK YOU!!", "verified": true, "helpfulness": "0/0", "author": "Wendy1970"}, {"rating": 4.0, "review": "I didn't see anything about the stick needing plugged into an electrical outlet.  That was disappointing.", "verified": true, "helpfulness": "0/0", "author": "xxxxxx"}, {"rating": 2.0, "review": "I've watched four movies,When working it's great, but after the first two viewings, the screen locked. I called for assistance  and was told to unplug and restart which did work, but after the next movie, it locked again. I finally got a message about weak batteries, so I replaced them and it worked fine for another 2 or 3 movies. I tried again today and found the screen again locked. I again replaced the batteries and it now works. Basically I have to replace the batteries about every two weeks even though I may not use it for more than a few hours.", "verified": true, "helpfulness": "0/0", "author": "Gerald P."}, {"rating": 3.0, "review": "After house sitting for my sister and enjoying her AppleTV, I came home and looked in to the Fire TV Stick. I had really enjoyed watching Netflix on a screen bigger than my laptop and not having to hook up my laptop to the TV via HDMI. Set up is very simple, but I can't say I'm very happy with it. It is amazing when it's working, but it seems like at least once an episode (I'm a Netflix binge watcher) it has to stop to load. Sometimes it does it up to five times an episode, ranging from 30 seconds to five minutes for it to start up again. Many times I just get fed up and go back to watching on my laptop. For how much it cost me, it is great. But I think I'd rather just spend a little bit more just for the comfort of knowing that I will be able to get through one episode of Psych without constant buffering.", "verified": true, "helpfulness": "0/0", "author": "Cassie"}, {"rating": 4.0, "review": "Needed some help from my son to connect.  However, once connected the system works fine.", "verified": true, "helpfulness": "0/0", "author": "First contact"}, {"rating": 5.0, "review": "wasn't compatible with my tv so had to attach it to another tv & it worked fine", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 5.0, "review": "this is a really nice tool.  Be even better who HBO Go is added.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]