[{"rating": 5.0, "review": "I love it  works well easy to set up", "verified": true, "helpfulness": "0/0", "author": "Michael Wright"}, {"rating": 5.0, "review": "Great product, portable and can be connected on any of the newer TV's.", "verified": true, "helpfulness": "0/0", "author": "John D'Occhio"}, {"rating": 5.0, "review": "Working as expected", "verified": true, "helpfulness": "0/0", "author": "Debbie Janson"}, {"rating": 5.0, "review": "I'm loving it so far!", "verified": true, "helpfulness": "0/0", "author": "Marvin Castro"}, {"rating": 5.0, "review": "Loving it!", "verified": true, "helpfulness": "0/0", "author": "ogidigirl"}, {"rating": 5.0, "review": "I love Amazon Fire TV Stick. I'm not into games and all the other gadgets and all I need is the Fire Stick. I can watch and catch up on movies and television shows that I've wanted to see.", "verified": true, "helpfulness": "0/0", "author": "Valencia Miller"}, {"rating": 4.0, "review": "Love the stick itself, but it has a hard time holding the wireless signal at my home.", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "good entertainment investment", "verified": true, "helpfulness": "0/0", "author": "vj1865"}, {"rating": 3.0, "review": "I bought the Fire Stick and I like it, there is just one thing, it has a mind of its own. Not only does it work when it wants, it will either change to something else when you are watching tv, freeze for minutes on end, or it will just go black on the screen and not come back on at all. Amazon needs to send me a new one ASAP!!!", "verified": true, "helpfulness": "0/1", "author": "lenny"}, {"rating": 5.0, "review": "Really impressed with this little device. I decide to got it just to try it and take advantage of the amazon instant video of amazon prime and now i really like it! It works really good, it practically converts my regular hdtv tv in a smart tv. I can use youtube, amazon instant video, netflix, and some free apps like lifetime, vimeo ...  is awesome affordable, I got it in the amazon prime day with a great discount. I don't need a smart tv anymore. I really recommend it!", "verified": true, "helpfulness": "0/0", "author": "lakiky18"}]