[{"rating": 4.0, "review": "It's very similar to hulu and I love them both. But the fire stick makes u go thru ur provider if u want certain stations downloaded like lifetime. And my cable provider isn't listed on thr list for me to complete it, ugh bummer", "verified": true, "helpfulness": "0/1", "author": "carmie coates"}, {"rating": 5.0, "review": "OMG BEST THING EVER. Set up in less than 5 minutes.", "verified": true, "helpfulness": "1/2", "author": "Peanut"}, {"rating": 5.0, "review": "So far the Fire TV Stick is awesome. Enjoying it!", "verified": true, "helpfulness": "1/2", "author": "Kathy A Krause"}, {"rating": 5.0, "review": "2nd one I have great product", "verified": true, "helpfulness": "0/1", "author": "jeff smith"}, {"rating": 5.0, "review": "It works just like they say. I love it and it is very easy to use and navigate.", "verified": false, "helpfulness": "1/2", "author": "Rpbert M. Fenster"}, {"rating": 5.0, "review": "Who needs apple when you have the fire:)", "verified": true, "helpfulness": "1/2", "author": "Grace Cioba"}, {"rating": 5.0, "review": "The Amazon Fire TV stick delivers all it promises. I gave Chromecast 2 chances to work (purchased twice in hopes they would work out connection kinks...returned both...neither could connect!). Fire TV Stick connected immediately and every function worked perfectly. I highly recommend the Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "J. Durow"}, {"rating": 5.0, "review": "Easy to set up and it works well", "verified": true, "helpfulness": "0/0", "author": "Nancy Lovallo"}, {"rating": 4.0, "review": "This works as advertised.I had some initial problems getting it to work with my router; but Amazon help was able to get it functioning (it was as simple as restarting the router, but I had tried everything else with it working, and was ready to send it back as not functioning properly).Directions for use could have been better.  I miss the days when a small booklet accompanied products and described exactly how to use it, and included a troubleshooting section.Connecting to my Kindle Fire HDX requires an additional step not covered in the instructions.You must use the alternate power source if you want it to work properly; which means you are going to need access to an electrical outlet.  This may not be a problem on your home TV, but it can be a challenge when you find yourself in a hotel room with all the cords neatly hidden out of site.", "verified": true, "helpfulness": "0/0", "author": "Randall Barron \"randallbarron\""}, {"rating": 5.0, "review": "I love the Amazon Fire stick. We currently own this and the Apple TV. We've had the apple for a couple of years now and our \"wish list\" of apple fixes were answered by Amazon. No more waiting 5 minutes for the system to stop clocking. One button takes you to the home screen unlike Apple where you have to continuously hit the menu button over and over and over again toEven think about going to the home screen. And it hides behind the tv. One less appendage hanging off of the television. Well done Amazon.", "verified": true, "helpfulness": "0/0", "author": "JR"}]