[{"rating": 3.0, "review": "Works good.  Problem is you can never get it off the network without unplugging it.  Not a good way to do things.", "verified": true, "helpfulness": "0/0", "author": "J. Paul"}, {"rating": 1.0, "review": "It is good for an hour's watch and then it claims it is no longer connected to internet.  No immediate recovery with most reboots. A terrible disappointment as I think your content is excellent.", "verified": true, "helpfulness": "0/0", "author": "Robert Horan"}, {"rating": 5.0, "review": "We really enjoy this! We had Google chrome but figured it was worth trying out since I was offered the initial discount pricing for it when it was coming out. I love all the apps it offers, that I can have Hulu, prime, and Netflix all included along with history channel, ect. We actually cancelled our cable because of this thing!! I didn't like that with the Google chrome I had to stream things from my phone or tablet to watch them and my boyfriend couldn't get the hang of that (he doesn't do tech stuff). This is simple to use, has a remote, and functions very well! We haven't had more than 1 issue with connectivity and I think that was our internet.Overall it's a GREAT BUY, you can get rid of cable, includes a ton of apps, and has a wonderful interface. The only change I would make is if they could set up Netflix a little more like the iPad and desktop apps where you can search for things. The search feature on the home page only seems to pull up Amazon prime stuff- and sometimes the things you have to pay to watch on prime are free on Hulu or Netflix,", "verified": true, "helpfulness": "0/0", "author": "Jessica Meagan \"girl_w_style\""}, {"rating": 5.0, "review": "I love this. I have both the stick and Fire TV. I love them both and have canceled my home cable. Everything I want to see is there. The remote is tiny and I am forever trying to find it. For the money this is great. The Fire TV seems to capture a stronger signal but it's minimal. The set up is simple. You'll enjoy this.", "verified": true, "helpfulness": "0/0", "author": "NancyB"}, {"rating": 5.0, "review": "Reasonable price. received well. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 1.0, "review": "So upset! Went this route thinking I can cancel my cable & I can say I am truly disappointed.  Not only does it cut in & out while watching or listening to anything.  Being a mother of a toddler I was looking forward to having watchdisneyjunior.com and it's not compatible with my network. Haven't been able to use hulu plus.", "verified": true, "helpfulness": "0/0", "author": "Leticia Montano"}, {"rating": 5.0, "review": "This is a great product.  Easy to install and easy to use.  I think it is better than others that are on the market.", "verified": true, "helpfulness": "0/0", "author": "M. Thomas"}, {"rating": 3.0, "review": "It would be 5 stars if it didn't always disconnect. When i first plugged the Fire Stick in the back of the TV, it would not work unless I used the power adapter that comes with the unit. It is not just a plug and play device.I bought this for my girlfriend so she could easily watch Neftlix and Amazon Instant Video. She didn't have a device to watch AIV before using the Fire Stick. She used a PS3 which she only used for Netflix and not too play video games. I figured a Fire Stick would be the perfect solution to simplify her movie and tv watching. And it is when the Fire Stick works. I helped her get it setup, but while watching Netflix, a lot of the time the Fire Stick loses connection and the movie stops playing. This is very annoying as you can imagine. Especially bc  I was trying to something nice for her and make her life easier. She never had a problem with the wireless using the PS3. I have reset the router and tried a ton of things to make the connection work.I have done research and I am not the only one with this issue. If this didnt happen this would be a 5 star product. Until this problem is fixed, (hopefully via a software update) I would wait to buy it.My 2 cents.", "verified": true, "helpfulness": "0/0", "author": "Birdknowsbest"}, {"rating": 5.0, "review": "I abs.love my fire stick.satisfied 100%", "verified": true, "helpfulness": "0/0", "author": "Joan kennedy"}, {"rating": 4.0, "review": "We are really enjoying the Amazon firestick. We love movies and hav found many TV series we enjoy.", "verified": true, "helpfulness": "0/0", "author": "Avid reader"}]