[{"rating": 4.0, "review": "Excellent which I would have brought it before know, really enjoying it", "verified": true, "helpfulness": "0/0", "author": "Thomas Miller"}, {"rating": 5.0, "review": "This fire stick went beyond my expectations ... what a great set-up !", "verified": true, "helpfulness": "0/0", "author": "Ronald Delgado"}, {"rating": 5.0, "review": "Perfect.  Saved me from buying another COX receiver and the grandkids love it on their TV when they visit.", "verified": true, "helpfulness": "0/0", "author": "David J. Ball \"Diver Dave\""}, {"rating": 5.0, "review": "Loving it so far. Gives me the chance to use my smart tv without having to have a computer or gaming system attached to watch Netflix and Amazon Prime. Plus you can even watch youtube.com and many more apps and options. Thanks Amazon for another great product!", "verified": true, "helpfulness": "0/0", "author": "MaeBea"}, {"rating": 3.0, "review": "It only works in the room  where the wireless router is located. I owner the Roku 2, 3 and Google Chromecast and they all work in the bedrooms using the same wireless router. The Fire Stick works perfectly when using in the same room as my router.", "verified": true, "helpfulness": "0/0", "author": "Loubert Alexis \"Lou\""}, {"rating": 5.0, "review": "Painless setup.  Easy to use.  Makes the Roku Stick look like a joke, which I never was able to setup.Love our Amazon Firestick", "verified": true, "helpfulness": "0/0", "author": "Stephen H. Treadway"}, {"rating": 5.0, "review": "Love this little gizmo.  I take it with me everywhere because it is so easy to set-up.  It has everything you might need to establish a connection including an extra long power cord and a HDMI extender.  Amazon thought of everything in designing this device.  Get one now!", "verified": true, "helpfulness": "0/0", "author": "JP in Atlanta"}, {"rating": 5.0, "review": "this works great. I wish the voice feature was on the remote instead of having to use my phone all the time.", "verified": true, "helpfulness": "0/0", "author": "Darlene Moore"}, {"rating": 4.0, "review": "Very nice packaging... works just as it should", "verified": true, "helpfulness": "0/0", "author": "Stuart"}, {"rating": 1.0, "review": "Slow in download but might be my service otherwise great for watching moviesWhy does it take 1.5 hrs to watch a 45 min show.", "verified": true, "helpfulness": "0/0", "author": "Thomas Tesla"}]