[{"rating": 4.0, "review": "The Fire TV Stick is great.  All around a great devices and works well compared to other brands similar to it.  However, there does seem to be some lag (latency) on some games and shows - as though the stick has to work harder to put items on the screen.", "verified": true, "helpfulness": "0/0", "author": "ST"}, {"rating": 3.0, "review": "I ordered this device when it was on presale before Christmas. We got it so we could utilize our prime instant video feature which we couldn't use with our chromecast.The signal strength seems poor. The picture goes out of focus occasionally and sometimes it refuses to connect all together. We haven't been able to use this in a few weeks due to the fact that is says the network requires set up all of a sudden. Usually this can be remedied by unplugging and plugging back in the modem/router and fire stick, but nothing has worked so far this time.A couple months ago I was getting an error message that the content I was attempting to view was not authorized. After searching online for quite some time I found that this was not an uncommon issue. Luckily I was able to get it to stop through some trial and error fixes suggested by other users and didn't have to wait for some software update like other users stated they were told to do by amazon.It is an ok product when it works. I just wish is worked more often. Definitely glad we got it for presale price, it definitely wasn't worth full price to us.", "verified": true, "helpfulness": "0/0", "author": "dmc"}, {"rating": 5.0, "review": "I LOVE LOVE LOVE it!!!  Easy to set up, easy to use, so much programming...it's just fantastic.", "verified": true, "helpfulness": "0/0", "author": "Matt \"superpootie\""}, {"rating": 3.0, "review": "Really haven't had a chance to use it as I have it up stairs and my signal must be weak because it isn't picking up my Wi Fi so I don't know if I need another Router for a better signal or not?thank you", "verified": true, "helpfulness": "0/0", "author": "Robear5"}, {"rating": 2.0, "review": "The offerings thru the Stick were amazing, but the buffering and skipping made most programs unwatchable, so it's back to the blue ray. The music playlists only play for a short time and then stop whereas through Pandora, you can get hours of play. No radio play stations, which are available on your phone but not through the tv.", "verified": true, "helpfulness": "0/0", "author": "BC Lauderdale"}, {"rating": 1.0, "review": "I knew $39 was too little to purchase an item that would meet my expectations! This thing worked 1-2 days and quit. No recommdation on this item. Lesson re-learned yet again.  LSC", "verified": true, "helpfulness": "0/0", "author": "Lawrence S. Cassidy \"blc@tellink.net\""}, {"rating": 4.0, "review": "Works well right out of the box. Easy to install and get up and running. One thing that was unclear, however is that not just any device can sling its screen to your TV through the Fire TV Stick. Only \"Fire TV Devices\" are able to do that, and if you are agnostic in your streaming technology, this device will limit what can be streamed to your TV. Overall I like it, but if I had researched more carefully, I probably would have gone with a different device that lets me stream ALL of my devices and content to my TV. Also, unless you are an Amazon Prime member, your options are limited.", "verified": true, "helpfulness": "0/0", "author": "Roger Stapleton"}, {"rating": 5.0, "review": "The Fire TV Stick is Awesome!  I bought it just for SLING TV (Since most Smart TVs don't decode it).  The presentation of the apps and the speed of scrolling is amazing.  I just purchased a 2nd stick for my bedroom!  I highly recommend the Fire TV Stick to everyone!", "verified": true, "helpfulness": "0/0", "author": "MOPC"}, {"rating": 5.0, "review": "I have the fire TV and the fire stick both are incredible!  The portability of this is awesome!", "verified": true, "helpfulness": "0/0", "author": "M. Braun \"My 3 Sons\""}, {"rating": 5.0, "review": "Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "jg \"JG\""}]