[{"rating": 5.0, "review": "A beautifully designed OSD makes navigating between multiple sites (like Hulu, Netflix, Amazon...) brilliantly smooth and easy. It's fast, simple, and has a great remote. If you've ever used a streaming bluray player or smart tv, most of the time the navigation is awful. This thing even works nicer than my computer.I only have one minor gripe with the remote design: it's a slick little unit, but I think the \"home\" button is too close to the \"pause\" button. I hit it accidentally all the time. I wish they'd change that.", "verified": true, "helpfulness": "1/1", "author": "R \"sir_rob79\""}, {"rating": 5.0, "review": "Works well. A great buy.", "verified": true, "helpfulness": "0/0", "author": "Onezipcode"}, {"rating": 5.0, "review": "There is a big difference. Roku allows Amazon as just one more content provider, but lacks the control and management, and the ease of use that comes from Amazon, for Amazon Instant Video. As just one example, you cannot remove recently viewed movies from the screen of Roku. This and many more management tools are automatically part of the Fire TV Stick user experience. Small, works perfectly, excellent quality images and Instant Prime - centric. Returned Roku and never been happier with a replacement product that better meets my needs.", "verified": true, "helpfulness": "1/1", "author": "D. J. Donaldson"}, {"rating": 5.0, "review": "Love it - does just what it says.", "verified": true, "helpfulness": "0/0", "author": "jeff johnson"}, {"rating": 1.0, "review": "Worked fine at first, now cannot watch even Amazon Prime shows without multiple buffering lapses; sometimes even loss of connection entriely. Not sure if technology is overloaded, or what.I would sure like an explanation from Amazon, as to what has changed??????", "verified": true, "helpfulness": "1/1", "author": "Dave K."}, {"rating": 1.0, "review": "you still have to \"pay\" to watch videos and tv episodes they misclaim over 400,000 movies and shows to watch, I mean it is possible but you have to pay for every single movie or show you want to watch. I should of never had ordered this product.", "verified": true, "helpfulness": "2/7", "author": "Jorge Garza"}, {"rating": 5.0, "review": "Received before stated time. I had difficultly putting the batteries in the remote, but after that it was a breeze to setup and use. Will buy an additional unit for my lake cottage. When I say it was easy to setup and use, I am in my earlier 70s and I did not have any problems other than the battery installation. Thanks amazon for a well made and easy to use product.", "verified": true, "helpfulness": "1/1", "author": "Robert C. Jones"}, {"rating": 5.0, "review": "I paid $100 for an apple tv and cant even watch Amazon prime on it because apple doesn't like amazon.  Shame on them for putting out a crappy product.This product, which is a fraction of the cost of the apple tv, lets me watch both amazon prime and netflix.  I love it.", "verified": true, "helpfulness": "1/1", "author": "Steve"}, {"rating": 5.0, "review": "Shipping=EXCELLENTPRODUCT=EXCELLENT", "verified": true, "helpfulness": "0/0", "author": "Alberto Ong"}, {"rating": 1.0, "review": "Slow and didn't pick up wireless as well as chromecast which worked every where.  Kind of disappointed purchased mainly because it played amazon prime but never got a good feed.I have not given up yet but for now I would not rrecommend this product.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]