[{"rating": 4.0, "review": "Yes I'm enjoying my fire tv I love the quick access to my movies and how easy you can navigate from one application to the next. The only thing I love to have is to be able to access more applications.", "verified": true, "helpfulness": "0/0", "author": "Terryl Carter"}, {"rating": 5.0, "review": "It does everything it's suppose to. My internet system sucks!! I can't enjoy the total experience of Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "jennie cage"}, {"rating": 1.0, "review": "NOT SATISFIED AT ALL!!!! i am so disappointed, at first i couldn't  wait t get this fire TV stick but when i installed it i'm realizing that none of the movie are playing. Its like its not supported in my country.  AM SO DISAPPOINTED. JUST WASTED 39.US", "verified": true, "helpfulness": "0/0", "author": "peaches"}, {"rating": 5.0, "review": "Nice new way to watch TV and movies.", "verified": true, "helpfulness": "0/0", "author": "Robert D. Graham \"Davids Book\""}, {"rating": 5.0, "review": "The Fire TV stick was easy to setup and begin using.", "verified": true, "helpfulness": "0/0", "author": "Angela G. Casey"}, {"rating": 5.0, "review": "No better way to watch TV, never going back to cable. The mirroring doesn't work well, but apps are great, and sideloading applications also helps. Great little device, and certainly worth the price", "verified": true, "helpfulness": "0/0", "author": "Max Levy"}, {"rating": 1.0, "review": "I thought this stick was going to be a great addition to my internet viewing pleasure. Boy, was I wrong. It is a piece of crap! Streaming with it is a nightmare. It constantly starts and stops blaming low connectivity on my wifi. Odd, how I don't have that problem with my blu-ray DVD players or computer. I have high speed with century link which provides great service for all my other electronics. My advice, don't waste your money until they build a unit with storage capability that can handle your wifi load.", "verified": true, "helpfulness": "0/0", "author": "P. Harry"}, {"rating": 5.0, "review": "Just like my 1st Amazon Fire. Plug and play - my office TV has never had such a good picture.", "verified": true, "helpfulness": "0/0", "author": "Victoria Lippmeier"}, {"rating": 4.0, "review": "good product; on time delivery", "verified": true, "helpfulness": "0/0", "author": "Gary L. Cooper"}, {"rating": 5.0, "review": "Can you connect more than one Tv in your house if yes how.  Thank you. Ps with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Michele"}]