[{"rating": 3.0, "review": "My Roku 2 XS was getting fussy, and there were a number of options at my fingertips when deciding on its replacement. Ultimately I bought the Fire TV stick because of its early preorder discount price, and right away I'm noticing differences between this and my old Roku. Both good and bad.I'll start with a pet peeve. With my nearly 3 year old Roku XS, when I download a channel for which I have a registered account, to set up on the box it would display a short code of about 5 digits, give me a website to go to, enter the code, and everything worked. On this considerably newer and more powerful device, though, I have to enter email addresses and passwords, and if you're like me and use password generators to make long and difficult passwords, entering these for every app is quite a chore.Second, the available app library is SO MUCH smaller than the Roku's. It's got Netflix and Plex, my favorites, but many old favorites are missing. Crunchyroll, MLS, HBO Go, and so on are nowhere to be foundGetting those two problems out of the way, I love the speed, it seems much snappier than my Roku 2.But ultimately...its issues with ease of use and library size mean this is merely going to be a stopgap device for me until either a Roku 4 or a new Apple TV. I would recommend waiting, unless you only ever plan on using Netflix, Hulu, Plex, etc. And you don't mind taking a year to enter your passwords...", "verified": true, "helpfulness": "3/6", "author": "Zack"}, {"rating": 5.0, "review": "My biggest concern was that fire stick would be sluggish/laggy. Not the case. It responds in a snap. The interface is intuitive. All of the Amazon content is easy to access, and the add-on apps and games are a big plus. I handed the control to my six-year old, and he was able to load his favorite cartoon in under a minute. The price is fantastic at $19 or $39 or whatever Amazon is charging now. Honestly, I can't think of a reason to buy a real set-top box. Maybe if you want an Apple-centric experience or absolutely have to have some app that isn't on the fire stick. I don't fall into either category, and for my family, this is perfect.I did have trouble getting one of my fire sticks to connect to the wireless router on the first run through. I tried several times last night before finally giving up. I tried again in the morning, and it immediately connected, downloaded/installed a firmware update, and started streaming with no trouble. Not sure what happened last night, but all is well now. My other fire stick worked flawlessly out of the box.", "verified": true, "helpfulness": "1/3", "author": "S. H."}, {"rating": 4.0, "review": "Received and set up last night.  Set up was easy and the software update took about 15 minutes.  Ran through a few of the options and all seems to work well.However, the HUGE disappointments are that the remote control app is not available for the Kindle and, although, I can \"fling\" my HDX 7 screen to the TV, I cannot mirror as the Kindle just hangs on discovering.I'm going to give it a few days but I may be returning both that I purchased as I specifically bought the Fire TV stick for use with my HDX 7.  I'm a bit miffed with Amazon with not providing support for their own Kindle products.Update 11/23/2014  I received a v-mail Friday night from someone with Amazon stating that they would like to troubleshoot the mirroring issue.  She stated that she would send me an email with information on how to contact them and call again on Saturday.  Guess What???  No email and no call.  I know they have my correct email address as I get umpteen emails from them each day.  I am now on vacation until after Turkey day and my confidence in Amazon is diminishing rapidly.Also, the Parental controls do suck.  I would like to set the PIN for purchases only but that option does not seem to be available for the Fire TV Stick.Changing my review to one star.Updated:  Review changed to 4 stars.  Mirroring now working on the HDX 7 and I'm happy.  Love it!", "verified": true, "helpfulness": "3/10", "author": "Privrat"}, {"rating": 5.0, "review": "Ok, I never write reviews but I am compelled to write one here.  I just got done setting my fire stick up and I have to say this is one of the coolest things I have ever purchased.  The setup is incredibly easy, they provide on screen instructions.  Then a tutorial comes up walking you through some of the features.  I have connected it with Prime Account (which was done automatically) and NetFlix.  I have just scratched the surface of all the features but based off my experience so far this item is a must purchase!", "verified": true, "helpfulness": "1/3", "author": "Joseph Costello"}, {"rating": 5.0, "review": "Please vote YES if you find my review helpful!In short,  this is the best TV stick you can possibly buy with the Amazon Prime subscription at a ridiculously low price. Its a watered down fire TV but retains all the core function that makes Fire TV alsoI am a gadget geek and went through numerous TV devices. Fire TV stick overall has 90% of what Fire TV has at a quarter of the price. Accessing Amazon Prime Video and Music is just as easy and straight forward on Fire TV stick. For the casual users, the Fire TV stick is more than enough.When compare to Chromecast vs Fire TV Stick, Chromecast offers superior flexibility in mirroring screen and throwing popular apps such as YouTube on your TV. TV stick still lacks these sort of YouTube convenience and I doubt this will happen anytime soon.If you have a Fire TV already, then you can skip this one as TV stick is a slower version of Fire TVFor contents, I still can have all the most popular apps such as Netflix on TV with the TV Stick.Internet connection between tv stick vs between fire tv is just as good.  Given you can extend the stick to different corners near your wifi hotspots, the tv stick is much better.Personally I think the interface on tv stick is more convenient than roku and chromecast. Everything is in a well organized menu that sorts very well and have all relevant contents on screen. Voice control with app is possible but not with the included remoteI also synced up the Amazon controller with no problem and played some games too. Now makes me realize I can get this stick and it should bbe sufficient for most stuff. Fire TV is to handle the heavy duty gamesPlease vote YES if you find my review helpful!", "verified": true, "helpfulness": "6/12", "author": "Amazon Reviewer \"Reviewing is my greatest interest\""}, {"rating": 3.0, "review": "*** Update 12/8/14 ****After using the device for a few weeks now I have changed my rating. This has become a good product for the prices I paid ($19/$24) but not yet 5 stars. I like it way more than my Chromecast, but not nearly as much as my AppleTV.First off, they finally opened up the remote control app compatibility with my Galaxy Tab Pro 8.1 but unfortunately the IOS app still hasn't been released.Second, I finally figured out how to do remote screen mirroring from my Galaxy Tab Pro and Nexus 7. It turns out you have to go in to the menu and pull up the screen for remote mirroring and leave it there while the device connects - that feature does not actively run in the background. I'm glad I figured that out, but it seems kind of lame that it's something you have to activate every time. And despite what the product page says about DIAL compatibility and the ability to 'fling' YouTube from IOS or Android, that's not working as of right now. It's disappointing to see them advertise features that aren't yet available.Third, I've noticed that every so often the audio will get a hiccup while watching Netflix. By hiccup, I mean a digital skip, sounds like 'eeeeeenk'. It might happen 3-4 times in 45 minutes. A little annoying. Not sure if it happens in other apps too, I've only been using Netflix lately. Hopefully they'll fix this in the next update.I'm still really liking the remote control, although I do wish it had directional detents.Looking forward to the next software update.Original review: Nov 20, 2014Got the Fire TV Stick today, I've owned/used a few generations of Apple TV, a Roku 3, several Chromecast and even one of the first WDTV devices.With that in mind, here are my Day 1 notes:- The advertised Fire Stick remote controller companion app is listed as not compatible with current generation Samsung Galaxy Tab Pro 8.4 - this is happening on both Amazon App store and Google Play. There's no reason that it should be listed like that since it has a 2+Ghz processor, 2GB ram and latest Android release. The Apple app is also not yet available. Fortunately I have a Nexus 7 device which it is compatible with and can say it works, but not nearly as good as say the Xbox Glass or Apple TV app.- As others have mentioned, the power connector location on the side of the unit is kind of weird and for me prevented it from being plugged directly in to one of my TV's HDMI ports. Fortunately Amazon included an extension cable so it can be managed. Chromecast wins in its design with the power connector on the very end.- The included controller needs up/down/left/right nubs or some kind of detent on the directional circle to give a tactile indicator of where your finger is pressing. Maybe I'll get used to it in time, but I've hit the wrong direction several times now and this is something that should not require any thought. I do like that it's a little bulky and has some heft with the batteries. Compared with the Apple TV remote, which is sleeker but also so easy to lose in the couch or a pocket, I already prefer the Fire Stick remote. Also, it's either RF or Bluetooth so it's nice not to have to point it the TV.- It lost my wifi settings after first software update. Not sure why it's not saving them. Maybe this is just a day one glitch.- Screen casting / mirroring not available for Nexus 7 or Samsung Galaxy Tab Pro devices. I guess it's only going to work with Kindles?Other than that, the interface is pretty decent and the included animated tour is a nice touch. It does seem built around Amazon Prime offerings, no surprise there, but there are plenty of other options too. I tend to stick with Netflix/Hulu/Pandora for 99% of my use.", "verified": true, "helpfulness": "9/27", "author": "B. Crawford"}, {"rating": 2.0, "review": "UPDATED: It froze too much. sent backI have had a ROKU 2 for 2 years and I also have ROKU sticks for the waiting rooms of 12 of my business locations, so I am a big fan of ROKU. The $19 charge for Prime members allowed me to take a look at the FIRE TV Stick without much gamble. My initial impression today is that it def for if you want to focus on Amazon video and music. The other apps are there, but it takes too many click to get to them. You can't sort the apps you have so you can't make your favorites closer for less clicking. It froze a few times. It weirdly wouldn't stop playing Pandora even though i loaded a Prime video.It was easy to setup and def makes access to your Prime membership benefits easy, but just getting to Netflix takes too many clicks. I know that is their competition but come on, 1/3 of all internet streaming is Netflix. Lets deal with reality Amazon, people are buying this to stream Netflix.And no HBO GO leaves me unable to part with my Roku, so this Fire TV Stick is already a 2nd choice device.", "verified": true, "helpfulness": "3/5", "author": "M.P.G. \"MPG\""}, {"rating": 5.0, "review": "Very impressed with Amazon's fire stick. Android app with voice search works great and is also useful while inputting user names and passwords using my phone's keyboard rather than the remote. Great packaging and included accessories. Love that Amazon included a HDMI extender, any stick would have been very difficult to use on my TV without an extender cable.", "verified": true, "helpfulness": "11/13", "author": "Brad Copeland"}, {"rating": 5.0, "review": "Let me start with my frame of  reference:  I have is Visio smart TV, an older Panasonic “smart” Blue Ray player,  and two Roku’s, a Roku 2, and Roku 3.The Roku 3 is a great little piece of hardware, easy and simple to use.  The Roku 2 is very similar, just a little slower.  The Visio “smart” features are not real good, and the Blue Ray player is just OK.The most challenging thing for me with the setup was removing the back cover of the remote to install the batteries.  This was a very easy logical setup.  And I even like the box it came, and the Amazon branded batteries.  After a software update we were ready to go.I found the Fire TV Stick great, with my Amazon information already preprogrammed into the device… it was very simple to just plug in and it worked.The general layout was very logical, and didn’t take a learning curve to figure out how to use the product.The speed is good, with no lag between screens and the loading time was very quick.I really like this little stick, and it seems to do everything I need it too, for a price point that is better than the competition.", "verified": true, "helpfulness": "5/8", "author": "Michael Holcombe"}, {"rating": 5.0, "review": "Loving this little guy so far. If you're a Prime user, this should be a no-brainer. Instant access to all of your Prime videos, plus Netflix, Hulu and all that good stuff. Not to mention games, apps and photos. Prefer this one over my Chromecast for sure.If you're on the fence, don't be. Jump over and get one — you won't regret it.", "verified": true, "helpfulness": "5/6", "author": "Adam Z."}]