[{"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Cindy Richards \"booklover\""}, {"rating": 5.0, "review": "What a bargain!  We belong to the Prime program, we get to watch thousands of videos at no extra cost.", "verified": true, "helpfulness": "0/0", "author": "Ron Hoag"}, {"rating": 5.0, "review": "Love it.  Easy to set up and use.  I see cutting the cord in our future.", "verified": true, "helpfulness": "0/0", "author": "Kneeps"}, {"rating": 5.0, "review": "love it  you would not be disappointed just plug and play download movies play games, songs  and the price i can say no more", "verified": true, "helpfulness": "0/0", "author": "ian ward (clear image sat guy)"}, {"rating": 5.0, "review": "Use it all the time! It's so fantastic! Best purchase.", "verified": true, "helpfulness": "0/0", "author": "Kristin Campbell"}, {"rating": 2.0, "review": "I love what it does but HATE that it can barely do it!!! It has the Most issues connecting to my Fios wifi while everything else in the house (cell, laptop, ipad) connects and Stays connected without Any interruption. It either barely connects to the signal (and buffers and stops if so) or doesn't at all siting 'Network_error' or some other lame excuse. Needless to say, this is a birthday present gone wrong and I'm pissed. If it doesn't get it together I'm sending it back ASAP! Any input from Amazon on this would be greatly Appreciated!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Fallon Loving"}, {"rating": 5.0, "review": "This was a purchased that I thougt was a mistake. Well it turned out to be a very happy mistake! Our family love it. Getting 3 more for the other TV's then bye bye Netflix, and Hulu Plus!!", "verified": true, "helpfulness": "1/1", "author": "marie5330"}, {"rating": 4.0, "review": "This is a great product. The only thing that keeps it from 5 stars is it sometimes is a little buggy and takes a little bit to switch screens. I also dont like that it doesnt have an off button.", "verified": true, "helpfulness": "1/1", "author": "dickey1331"}, {"rating": 5.0, "review": "I bought it as a $20 pre order as a Prime Member and have had it since early December. I can honestly say that even at $40, this would be a good value.Our Sony blu ray player has streaming, which was used primarily for our Amazon Prime streaming. I really bought the Fire TV Stick just to play with and also to try the phone mirroring feature.The phone mirroring first... This is the main reason I am writing this review - to let others know...I have a Galaxy S3 from Verizon with Android KitKat (4.4.2). I have only seen a few reviews talk about phone mirroring form an S3, and it seems they say it did not work...  Not sure why, as I have used it multiple times and it has been flawless. Simply turn on mirroring on the fire TV (settings menu, must be done each time you want to mirror) and then turn on screen mirroring on your S3. Let them find each other, and all is good. Both steps need to be done each time...As for my Sony blu ray streaming, compared to the new Fire TV stick. The Fire TV Stick is, without a doubt, faster to load and start programs. Amazingly so, actually... And, for what it's worth, the Sony blu ray is wired to our network, and the Fire TV Stick is, obviously, wireless. And still the Fire TV Stick easily outperforms the Sony.In case you care (and even if you don't...) I am not using the included USB power block but rather have the USB plugged in to the Sony blu ray's USB port since it is also the sound system for our setup. It works fine and starts up when we turn on the TV and sound system. We did not even get any type of warning message that other reviews have mentioned.Finally, it is small enough to move easily to other TV's if the need / desire arises...So... In summary...A) Screen mirroring DOES work with the Galaxy S#B) the thing is fast and is worthwhile even if you have other streaming optionsC) portability is another plusAll in all, easily 5 stars....", "verified": true, "helpfulness": "0/0", "author": "Mildewman"}, {"rating": 3.0, "review": "The internet connection isn't great with this device. Even with a wifi range extender, I have a lot of aggravation trying to watch prime video or streaming music. I'd recommend the regular Fire TV box. I may be returning this soon.", "verified": true, "helpfulness": "0/0", "author": "Peter A"}]