[{"rating": 2.0, "review": "They don't really tell you that you'll have to be a prime member to watch stuff and even if you are, you have to buy the majority of everything you'd want to watch.", "verified": true, "helpfulness": "0/1", "author": "Ariel Clark"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Doris"}, {"rating": 4.0, "review": "Easy to install and set up. I am waiting for the USB Power cable to arrive because my power outlet is far from the TV so I am using an extension cord. (not very high tech )Only reason I didn't give it five stars is I feel the video set up guide could be a little more specific. It does not explain clearly what streaming and other services are included , how to access what you subscibe to already and what is an additional purchase.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Sanders"}, {"rating": 5.0, "review": "Amazing!! The fact that can access Prime videos, Hulu, and Netflix all from my \"non-smart\" tv without having to plug my laptop into it is just awesome!  Definitely recommend 40 mbps internet at a minimum though. Have Time Warner 70 mbps and there is rarely even a hint of buffering except with YouTube...but always seems to suck no matter what device or whose internet i use.  Kudos to Amazon for not trying to be overly territorial and restrictive with the Firestick like they were with the first Kindle Fire!", "verified": true, "helpfulness": "0/0", "author": "Amazon Addict"}, {"rating": 4.0, "review": "its fine but i should give 5 Stars if do not get frozen too often..this drive me nut..", "verified": true, "helpfulness": "0/0", "author": "tony mercado ventura"}, {"rating": 4.0, "review": "I like it so far...Still trying to learn all the in's and out's...", "verified": true, "helpfulness": "0/0", "author": "Sean OFlannery"}, {"rating": 4.0, "review": "Works great as long as you have a decent Wi-Fi signal.  We use it with our fifth wheel camper when there is no cable service available or too may trees to set up our satellite dish.", "verified": true, "helpfulness": "0/0", "author": "Jerry Botdorf"}, {"rating": 4.0, "review": "it needs it's own power outlet. I thought it was self powered. other than that, it works fine.", "verified": true, "helpfulness": "0/0", "author": "MIKE B."}, {"rating": 5.0, "review": "Meets expectación And is simple to use", "verified": true, "helpfulness": "0/0", "author": "william"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tenaya"}]