[{"rating": 2.0, "review": "Cheaper than other options but falls far behind Chromecast and Roku. The Pandora interface (as well as other interfaces) are very basic looking. The apps are limited and there is currently no remote control app available for iphone. Also, you cannot do a desktop/browser share like Chromecast.", "verified": true, "helpfulness": "1/1", "author": "prakthad \"prakthad\""}, {"rating": 2.0, "review": "Unsure about this product at this time.  Love the fact that I can run Plex on it but not sure what else to do with it.", "verified": true, "helpfulness": "0/0", "author": "Kin Ming Wong"}, {"rating": 1.0, "review": "took out the audio on my tv the second day we had it !  amazon said they will replace the fire stick, but the tv is my problem!!!!!! GOOD LUCK", "verified": true, "helpfulness": "1/2", "author": "james jeffrey sutherlin"}, {"rating": 5.0, "review": "This has freed me from TV inanities. You can choose your entertainment. Very pleased. Suggest you provide a longer cable. Mine was a close call", "verified": true, "helpfulness": "0/0", "author": "james coniglio"}, {"rating": 4.0, "review": "It is nice but. Roku3 is so much better more of everything", "verified": true, "helpfulness": "0/1", "author": "Frank Calarese"}, {"rating": 5.0, "review": "Works Great, easy to set up, fast operating, and reliable, works so well that I am ordering another one for my grandsons room :)", "verified": true, "helpfulness": "0/0", "author": "highlife"}, {"rating": 3.0, "review": "The Stick itself is really good. Easy to set up and great performance. The problem is the Android app. Can it really be that one must have the Amazon store app also installed and running in order to use the Fire TV control app? How weak!", "verified": true, "helpfulness": "0/1", "author": "KC \"KC\""}, {"rating": 5.0, "review": "Kids love it", "verified": true, "helpfulness": "0/0", "author": "Hahn"}, {"rating": 4.0, "review": "Not as zippy as some claim. Great for $19.99, but not $40. Voice control dicey, as you still have to click OK to launch request. Seems to be an Amazon-o-tron machine for all things Amazon. Does not remember for long, pairing with the Amazon bluetooth controller. A lot of unexpected extra costs for apps and services. But otherwise, a potentially great value.", "verified": true, "helpfulness": "0/0", "author": "Madfranklin"}, {"rating": 1.0, "review": "VERY Disappointed with this product.  Remote would not work properly, even after changing the batteries.  Wifi kept disconnecting, even with a strong signal.  There's a reason why Apple products are twice the price - they work!", "verified": true, "helpfulness": "1/1", "author": "M. Fox"}]