[{"rating": 5.0, "review": "Absolutely love it!!", "verified": true, "helpfulness": "0/0", "author": "Regina M Ware"}, {"rating": 1.0, "review": "After purchasing it, I find out it has problems with compatibility with some Samsung TV's.  It constantly drops out and I have to re-initialize it.  I had the same problem with the Kindle.  Both the Fire Stick and the Kindle work well with other brand TV's.", "verified": true, "helpfulness": "0/0", "author": "Virginia Smith"}, {"rating": 3.0, "review": "It would not connect to the Internet for a long time.  After spending hours Googling for a fix, I found that the problem was a security setting on my router, which required me to log on as admin and play around until I found the correct setting.  Once that problem was resolved, it worked great.  However, Amazon could have given some notice or a heads up that this problem can occur and how to remedy it.", "verified": true, "helpfulness": "2/2", "author": "Gregory M."}, {"rating": 5.0, "review": "Installed in minutes, maybe just seconds, it was quick. Works flawlessly and easy interface. Too bad Directv in not a participant in some of the apps like History Channel. Don't know why that is as DISH is a participant. Don't know if that is on Directv or Amazon. No matter, as it is not a deal breaker. Lots of cool apps and especially like viewing our pics from the cloud on TV, which is the main reason for getting the Fire TV Stick. But there was so much more that I did not expect to get that made it even better. Streaming is almost instant and is probably due to our IT provider. Sling TV is a nice app, but don't really need it as we use Directv and I got voted down on dropping Directv. Today got Directv's over 20 buck a month increase, which may make it easier to drop them and use Sling TV. I'll see if I get voted down. Enjoy.", "verified": true, "helpfulness": "0/0", "author": "Sonoguy"}, {"rating": 3.0, "review": "Decent product but so limited by the weak wifi antenna that it makes it useless unless it is right next to the router. Using it with the power cord of course. I get a network error a few times every time I try to watch WatchESPN on it, no matter the time of day. I'm just glad I got it for $20", "verified": true, "helpfulness": "0/0", "author": "Brock Neilson"}, {"rating": 5.0, "review": "This tiny gadget is so easy to use I'm not sure why everyone hasn't ordered one.  If you subscribe to Netflix, Hulu or other services accessible through the Fire Stick, you need this device. We also have the Fire TV box but I have yet to find a reason to dump the Fire Stick in favor of the box for additional televisions. The remote control also has great connectivity even when mounted behind a flat screen TV. So far I love this little guy.", "verified": true, "helpfulness": "0/0", "author": "Cocktails by the pool"}, {"rating": 5.0, "review": "The Fire Stick exceeded our expectations It was a gift and what a great gift it was !!!", "verified": true, "helpfulness": "0/0", "author": "carol sauer"}, {"rating": 5.0, "review": "I really like this product. It is very reliable and convenient. Thanks Amazon for the great product", "verified": true, "helpfulness": "0/0", "author": "Rafael Santamarina"}, {"rating": 4.0, "review": "This was well packed and in packaging of high quality and app parts are seemingly of high quality. One design feature that is pretty stupid, however, is that the power cable hangs off the bottom edge of the fire stick, weighing it down so that it stresses the HDMI port. It is not loose or anything, but it just bothers me to have connectors under any sort of real, physical stress. Of course, had the cord come from the end it would have created *more* stress and would have made routing the power cord a PITA.It is not able to be played via USB - you MUST use an HDMI port on your television. Mine has four, so home theater, AppleTV and the Fire Stick - I still have one left. The interface is *not* AppleTV. It is its own thing and is easy to understand and (so far) to navigate. I have not yet discovered how to access Netflix. I have only used Amazon's own video library. (If I have an issue with using this I will update this review to reflect that.)The interface has built-in sounds for clicks and such, like AppleTV. I am a diehard Mac person (since 1987) and will nearly always use an Apple product if given a choice. To me this interface feels snappier and has sounds that are more subtle but give the experience a false sense of precision. I cannot really describe it, but the stupid sounds seem to actually improve the user experience.The remote is decent. It has more button than it needs, much like my Google Nexus 7 has more \"button\" icons for navigation than that excellent UI really needs. Apple has the edge on minimalism that works well. This menu and the remote buttons have a slight clunkiness to them. I like the extra buttons and they seem to work well, but I have become used to my Apple aluminum remote that is so beautifully simple. I see a massive remote with 40 buttons and I see some guy swilling beer in his recliner yelling at his wife to get him a \"sammich\" while he watches ESPN. The Fire Stick remote and aspects of the interface fall somewhere between this guy and the supremely simple Apple stuff. I like it, though, so despite having what I consider to be superfluous mechanical buttons (each being a part that could fail at some time in the near future) I rank it very close to AppleTV. It is as good, perhaps better in some ways, and is sleek despite the step backward in design.Setup was easy and fast. I really dislike the face that such a small device has a full-sized plug. In fact, the plug is absolutely crappy. It seems to be well made, but it is huge and will take up two or three spaces on your power strip, depending on how tightly yours is spaced. No excuse. Four stars specifically for this STUPIDLY DESIGNED plug. I have to see if there is any electrical difference between the same plug that the iPhone uses. It is very slick and fits neatly into a single space. It is USB and the Fire Stick's cord also is USB. I have to look into this as I have no more spaces on my strip because this unit took up two on mine - the one at the bottom where it lives as well as the one above it: there is no way to use that plug because the HUGE, square plug base covers up a LOT of the adjacent socket. Hey, Amazon! The nitwit who believed that a SQUARE plug fitting over a RECTANGULAR socket space needs to be fired, and the nitwit who APPROVED this idea needs to be beaten and locked in a room filled with Betamax tapes and VHS machines! Seriously?The user experience of this is pretty good. I would say it easily rivals (though does not really quite best) AppleTV at about half the price. If you have prime video and one of these you have a very cost-conscious way to have something very much like AppleTV and Netflix. No iTunes, though. Too bad that Amazon and Apple cannot play nice-nice and work out a deal so that Amazon can stream via AppleTV or even view Amazon content on my television at all. This is a bit of a \"kludge\" to remedy this, but it is a *very* high quality kludge that I will use often.Four stars only because of the idiotic size and shape of the USB plug unit. It would have been five, Amazon. Please fix this absolutely stupid plug and you will have a great piece of tech here!I recommend this highly, especially if you have Prime.", "verified": true, "helpfulness": "0/0", "author": "Pachyderm"}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/0", "author": "Justin Kallenbach"}]