[{"rating": 1.0, "review": "This device was reccomeded by a Best Buy assoc. Had to contact Amazon support for help registering the device since it did not like ANY Amazon account. What a hassle.! Once the device was registered and working it kept losing its network connection, changed router channels and various settings with no avail. Returned item. Bought a Sony BDP-S3500 and it works flawlessly compared to the Fire TV Stick. I do not reccomend the device.", "verified": true, "helpfulness": "0/1", "author": "Ray Long"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Karen Anne Nori"}, {"rating": 1.0, "review": "Worthless without highspeed internet. Also, when I purchased, I was told I would be given a 30-day free trial of Amazon Prime, which I was not. I am totally displeased with this product and with Amazon in general.", "verified": true, "helpfulness": "0/1", "author": "Janice F. \"Janice F.\""}, {"rating": 2.0, "review": "OK..... But the mobile or device mirroring literally is no good. Its Scripps and freezes up on and off.", "verified": true, "helpfulness": "0/0", "author": "Robert LaPann"}, {"rating": 5.0, "review": "It's very user friendly, I bought it for my elderly parents and they don't have any problems with it", "verified": true, "helpfulness": "0/0", "author": "Angela Williams"}, {"rating": 4.0, "review": "Netflix is abit jittery overall good interface. Have 2 of them and am satisfied other than the Netflix app is bad.", "verified": true, "helpfulness": "0/0", "author": "charles"}, {"rating": 5.0, "review": "AMAZING product! Made my life so much easier.", "verified": true, "helpfulness": "0/0", "author": "Samarmi"}, {"rating": 5.0, "review": "Love this thing", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome device. Better than the Roku stick valued at $50. Remote doesn't have App buttons but is smaller and more convenient. Apps load faster and picture is crystal clear!", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Sharon Matuszkiewicz"}]