[{"rating": 5.0, "review": "I was on the fence about cutting to cable cord but I am beyond happy with my purchase of the Fire Tv Stick and the apps for watching shows and movies. I haven't even scratched the surface of all that it offers and I am thrilled with it. The initial set up is so easy a child could do it, and I love the remote..", "verified": true, "helpfulness": "1/1", "author": "Catherine Dana"}, {"rating": 5.0, "review": "This device is awesome!  Its amazing how much content is available.  We just cut our satellite services and I am completely amazed by the Amazon Fire TV Stick.  I only wish I would have bought it sooner.", "verified": true, "helpfulness": "1/1", "author": "SeanMVIA"}, {"rating": 4.0, "review": "Great streaming item, and I must say--an upgraded streaming device when compared to chrome-cast.", "verified": true, "helpfulness": "1/1", "author": "jorge"}, {"rating": 5.0, "review": "It was everything I heard it would be.", "verified": true, "helpfulness": "1/1", "author": "Christine L Edwards"}, {"rating": 4.0, "review": "The fire stick has added a whole new dimension to our TV entertainment. A great deal....", "verified": true, "helpfulness": "1/1", "author": "Bob G."}, {"rating": 1.0, "review": "This thing is a scam first of all you have to plug it into a power source they sure don't advertise that secondly you have to pay to rent all the good movies. You're better off with netflix it's basically the same thing", "verified": true, "helpfulness": "1/3", "author": "chris pirkle"}, {"rating": 5.0, "review": "Love it!  Couldn't be easier to install and use!  Best entertainment value around, especially if you already have a Prime account!!!", "verified": true, "helpfulness": "1/1", "author": "coltr"}, {"rating": 3.0, "review": "The only complaint I have is the $4.99 for new release movies.  Redbox is much cheaper!", "verified": true, "helpfulness": "1/1", "author": "countrygirl"}, {"rating": 3.0, "review": "Good product based on the price.  The only issue I have is that Netflix takes a while to load or will not load at all.  It may have been that Netflix was busy that night with lots of people watching. However other programs such as hula worked perfectly.  Also the picture doesn't seem to be as clear as when I use my apple TV. But again, you can't beat the price.", "verified": true, "helpfulness": "2/2", "author": "mercedez67"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "1/1", "author": "Cheapdude"}]