[{"rating": 5.0, "review": "Quick and easy", "verified": true, "helpfulness": "0/0", "author": "Ron Jacques"}, {"rating": 5.0, "review": "So far,  for our needs we prefer it to the Chrome cast.  The remote is a nice feature.", "verified": true, "helpfulness": "0/0", "author": "gts"}, {"rating": 5.0, "review": "I have really enjoyed this thing.  We hooked it up in the bedroom and it has a lot of apps and channel options.  I am pretty sure we have barely scratched the surface of what it has to offer.", "verified": true, "helpfulness": "0/0", "author": "Christopher Alan Graham \"Fezzik\""}, {"rating": 5.0, "review": "Very nice:-)", "verified": true, "helpfulness": "0/0", "author": "gaylord jamerson"}, {"rating": 3.0, "review": "Very user friendly but when streaming shows, content often seems to buffer for a second.  Doesn't last long but can be annoying.  Do not have similar problems when streaming on other devices so do not think it's related to the wifi connection.", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "James P. Daniels"}, {"rating": 5.0, "review": "Love it!!  Who the hell needs cable or dish anymore.", "verified": true, "helpfulness": "0/0", "author": "matthew  Seese"}, {"rating": 1.0, "review": "keeps freezing up.returned it", "verified": true, "helpfulness": "0/0", "author": "Arrujoe"}, {"rating": 5.0, "review": "We have two Rokus in the house and couldn't decide if we should get a Fire Stick to go with one of the few TV's without a current internet-based streaming option.  In the end, we made an impulse decision to purchase it on Prime Day.  It did not end up working on the TV we had originally intended it for since the power wasn't accessible as easily on that TV.  So, it switched out with a Roku and went on a different TV.  This does mean we use it more often than we would have on the originally intended TV.  I have found it easy to navigate and use it multiple times a week to access exercise content either via Amazon Prime TV or a Fitness app that we downloaded.  A pleasant surprise for us was that it had access to our Cloud Drive.  (Admittedly, I did not do a whole lot of research on it assuming it would be enough like our Roku that we would be happy with it since we primarily use our Roku for Amazon Prime access)  So, it was a big joy to be able to flip to our Cloud drive and show our now 7-year old a video we had on our Cloud Drive of his first laugh.Overall, very happy with our decision to purchase.  My only negative feedback was the reliance on the power and that the cable was specific and too short for our original TV - but, again, I hadn't researched that piece of it, and so that's as much on us as it is on Amazon!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 5.0, "review": "Easy to set up and has added to our viewing pleasure.", "verified": true, "helpfulness": "0/0", "author": "Joe Grayson"}]