[{"rating": 5.0, "review": "Very cool. Use it in the kitchen.", "verified": true, "helpfulness": "0/0", "author": "D.B. Lewis"}, {"rating": 5.0, "review": "Great to be able to access movies and tv shows from prime and other accounts.", "verified": true, "helpfulness": "0/0", "author": "Susie P."}, {"rating": 4.0, "review": "This is a really neat device....The only thing I didn't like about it is when there is alot of internet usage going on, the show you're watching just freezes up.", "verified": true, "helpfulness": "0/0", "author": "Corrine Kay Wiege"}, {"rating": 5.0, "review": "Amazing. Honestly, I wasn't expecting that much more than a Chromecast but the fire stick is phenomenally versatile. A ton of useful apps and big potential", "verified": true, "helpfulness": "0/0", "author": "Rob Fox"}, {"rating": 5.0, "review": "All good", "verified": true, "helpfulness": "0/0", "author": "Art \"Art\""}, {"rating": 4.0, "review": "It works perfectly, is easy to set up.", "verified": true, "helpfulness": "0/0", "author": "DEguy"}, {"rating": 5.0, "review": "Very quick access to Netflix and the like", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "Far exceeded my expectations.  Works seamlessly with Amazon Prime and Netflix.  Easy to set up and use.  Very fast, and the picture seems much clearer than what I use to get through Chromecast.  Only problem was that I had to go to the store to buy it as it would have taken a month through Amazon.  Great product.", "verified": true, "helpfulness": "0/0", "author": "Chuck K."}, {"rating": 5.0, "review": "Simple to hook up, best purchase all year. Lots of free content with my prime membership. I tell everyone I know about this little miracle. The only flaw is the print  , it is small for reading  summaries  of movies .Amazon will probably correct this as it is a first effort. It is a home run and considering the price a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Buy the Bay"}, {"rating": 4.0, "review": "Love it. Makes watching shows so easy.", "verified": true, "helpfulness": "0/0", "author": "Audrey"}]