[{"rating": 3.0, "review": "It  works for a little while then it stops due wi fi disruption", "verified": true, "helpfulness": "0/0", "author": "Bryon Ingalls"}, {"rating": 5.0, "review": "The Fire TV Stick was a great value with higher Specs for memory than the competition. The video that starts the install was very helpful. Watching our picture collection on our large screen TV is a treat", "verified": true, "helpfulness": "0/0", "author": "jack a eling"}, {"rating": 5.0, "review": "I am sorry that it took me so long to decide to buy the Fire TV Stick.  I was looking to cut costs and I am already a prime member so I gave this a try.  It is actually saving me money in several ways as my family wants to stay home and watch \"TV\".  The amount of programs available is really amazing.  We didn't have any problem setting it up.  Although getting it to sync with my IPad is a hit and miss thing - I am not sure what I am doing wrong.  We only have 1.5mb internet speed in a very rural mountain area and have only had a problem once with streaming.  It was the Aviator movie and it is very long, so the break was welcomed.", "verified": true, "helpfulness": "0/0", "author": "peggy johnston"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 5.0, "review": "Works very well", "verified": true, "helpfulness": "0/0", "author": "Brett Bussing \"splicer\""}, {"rating": 4.0, "review": "It was great. I don't think I will use cable anymore. I can watch almost anything and pay hardly anything, You won't believe what you can do and watch with \"Fire Stick \" . It took me 2 minutes to setup and to realize how much money I will be saving from now on.", "verified": true, "helpfulness": "0/0", "author": "Claudius Ram"}, {"rating": 5.0, "review": "It's works great. Great buy! !!!!", "verified": true, "helpfulness": "0/0", "author": "theron reynolds"}, {"rating": 5.0, "review": "We absolutely love it!!!  So very happy that we made this purchase!!!", "verified": true, "helpfulness": "0/0", "author": "Kathleen A. Snyder"}, {"rating": 5.0, "review": "Awesome device.", "verified": true, "helpfulness": "0/0", "author": "Tomás Rosario"}, {"rating": 5.0, "review": "So far I am very pleased with the quality of the Fire TV Stick,was very easy to set up and get running not counting the video that started as soon as i was connected took less than 5 minutes and i wa up and running", "verified": true, "helpfulness": "0/0", "author": "Timothy Clarey"}]