[{"rating": 5.0, "review": "I find it very easy to use, however the remote could be a little larger for larger hands.", "verified": true, "helpfulness": "0/0", "author": "Ruth Habich"}, {"rating": 5.0, "review": "Thank you AMAZON. Use my fire stick a lot. Y'all are the best...", "verified": true, "helpfulness": "0/0", "author": "Vicky Clayton \"Vicky C\""}, {"rating": 5.0, "review": "Works Great! Just make sure you're aware you still need to plug it in to the HDMI AND a wall or usb outlet", "verified": true, "helpfulness": "0/0", "author": "Tyler Conlin"}, {"rating": 1.0, "review": "Firestick is very disappointing!  It keeps buffering!  It will buffer several times while viewing shows or movies. It it not my internet provider as I hooked up a RoKu to the same TV and internet connection and have had NO problems at all with the RoKu.", "verified": true, "helpfulness": "1/2", "author": "Sandy L \"Sock-it-to-me\""}, {"rating": 5.0, "review": "I'm debating selling my apple tv to get one of these. The interface is smooth and i like how the home screen is integrated. Buy it the price is too good.", "verified": true, "helpfulness": "0/0", "author": "Claudio Villani"}, {"rating": 5.0, "review": "We love it and we ARE NOT techno-geeks.  The only disappointing thing was that we didn't realize you have to have a preferred provider for the Watch ESPN program.  Direct TV, OF COURSE, is not on the list.  So if you are trying to get rid of Direct TV (which we are) you will have to \"borrow\" friend or family id from other provider (U-verse, TWC, etc.).  We have family members with U-verse who were willing to provide their info.  It's not the same as satellite quality....there are a few blips..when watching shows, but it's way worth it for us.  We were around when TV was free and we could choose what we wanted to watch.  This was our answer for affordable TV series, movies, and ESPN.  Be bold!! Cut the cable/satellite cord and go ALA carte!", "verified": true, "helpfulness": "0/0", "author": "Kelly Szalanski"}, {"rating": 5.0, "review": "This product gives me hope that technology is realizing that some of need a dictionary of tech words to \"hook-up\" anything electronic and handled the problem!!!  So easy to install, and enjoy!", "verified": true, "helpfulness": "0/0", "author": "Susan D."}, {"rating": 5.0, "review": "Awesome, steam videos, rent videos, buy videos. Its pretty fast, so fire tv must be even fast. Watch youtube, listen Pandora its a great little device. I would buy this over RUKO and Chromecast any day.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "It works exactly as advertised!", "verified": true, "helpfulness": "0/0", "author": "Stan"}, {"rating": 5.0, "review": "With 22,000 reviews of the Fire TV Stick already posted, I'm coming to the party late, but better late than never, I guess. My wife and I bought the Fire TV Stick to replace an old, ailing Roku box, and we're very pleased with it. Set-up and connecting to our home wi-fi was very simple and took only a few minutes, after which the device checked for software updates, then we were ready to go. We're using the Fire TV Stick primarily for streaming Amazon Instant Video to our TV, and it works great. I installed the Fire TV app on my Kindle Fire HDX 7\" tablet, and it also works very well. I especially like being able to search for movies and TV shows with voice commands from the app, which you can't do from the Fire TV remote control.I haven't used a Google Chromecast or Roku Streaming Stick, so I can't compare the Fire TV Stick to them, but so far I'm very pleased with the Amazon product, which is ideal for anyone who's heavily into the Amazon environment of instant video, music, and games.", "verified": true, "helpfulness": "0/0", "author": "J. Chambers"}]