[{"rating": 2.0, "review": "I didn't know just how this product workout for me. I didn't know that you had to pay for moves on the fire stick. I thought that when you pay for the device the movies was included.", "verified": true, "helpfulness": "0/0", "author": "GARY  GEORGE"}, {"rating": 5.0, "review": "I love it! We have an HD TV that isn't a smart TV but with this we can have access to our Amazon prime and Netflix on that tv. Now we don't have to fight for the smart tv.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Beyond my expectations.  Absolutely love this device. I can move it from TV to TV and watch the shows that I love.  LOVE THE AMAZON FIRE STICK.", "verified": true, "helpfulness": "0/0", "author": "Karen R."}, {"rating": 5.0, "review": "Love this thing!!!! Easy set up. Connected quickly to my router. Great picture quality. Awesome!", "verified": true, "helpfulness": "0/0", "author": "Armando Gonzalez"}, {"rating": 3.0, "review": "I am amazon prime subscriber so I wanted to try the fire after moving out of a place that had apple TV hooked up.  I have decided to go back to the Apple TV because it just performs better, plus apple TV's selection of apps are better.", "verified": true, "helpfulness": "0/0", "author": "Zachary Thormann"}, {"rating": 5.0, "review": "Great product! I love ith", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Enjoy my music, pictures, videos, games n movies in 1 device to share with the whole family.  It's easy to use.", "verified": true, "helpfulness": "0/0", "author": "danq"}, {"rating": 5.0, "review": "We are enjoying the convenience of the Fire Stick. I should have gotten one sooner. Thanks for this outstanding product.", "verified": true, "helpfulness": "0/0", "author": "Robert Robinson"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Jonathan"}, {"rating": 5.0, "review": "Works great! No issues. The system has been a pleasant surprise in speed and quality.", "verified": true, "helpfulness": "0/0", "author": "adam sellers"}]