[{"rating": 5.0, "review": "I am trying to wean myself off of satellite TV with its $70+ monthly cost. I had my bedroom TV just using an antenna, which gives you a lot of local channels, but is somewhat restrictive. I have another system similar to Fire TV, but it had to be plugged into the router to work. This was wireless, so I had Prime and the other service, both will work on it. It took a little doing at first to get the software to update, as I had misplaced the instructions, but the Fire TV site gave me the info to fix it. Once up, there are no problems. It gives a large selection of movies and other shows that provide more hours than I think that I will ever be able to watch. It is nice to have a system that provides this much for so little. Prime costs about less than two months of what I am paying now, and I can watch when I want rather than recording it. Outside of one plug to a wall outlet, there is not a tangle of wires. Please be advised that your set must have an HDMI port to use this, so check that you have one, most newer sets do, but make sure.", "verified": true, "helpfulness": "0/0", "author": "Arthur R."}, {"rating": 4.0, "review": "processor is noticeably slower and laggy vs the full unit. adb sideload would be better if the apps showed in the main apps page. My final gripe is coming from loving the Roku interface. Having to use the funky menu's sucks. You have to scroll all over the place to find what you want. They try to focus you into the amazon products before all else, as they want more money from you since they are offering this device for basically cost in some instances. Roku is so popular because its easy. It may not look as polished as the apps do on the fire whatever's but they are dead simple. I don't want 100 paths to what I want. If i want amazon video you should go into a amazon app on the main screen. That would simplify life tremendously. Like on a Roku. Finally voice search works well but it should be fixed to the app you are in. Say Netflix, Hulu or Plex. Not trying to find me content to buy from amazon when I am in a app from a totally different party which I am already giving my money to. I don't mind finding content from amazon but only when I'm in your menus. MAJOR SELLING POINT WAS HOTEL WIFI LOGIN MENU. THIS IS NOT YET AVALIABLE, COMING IN FUTURE UPDATE. some hotels require you to accept terms and conditions to use the wifi, if so you can not currently use this there. Fyi disney wifi works with this device currently as they do not require authentication in room. Thank god because im sick of the MUST DO channel.", "verified": true, "helpfulness": "0/0", "author": "J4Real \"J\""}, {"rating": 2.0, "review": "Just average streaming device. I am a home theater / music enthusiast. I have a Western Digital Live TV. The Fire Stick sound quality pales in comparison to the WD TV Live. I like the idea of convenience so I put the device in the bedroom where I listen with plain old flat panel TV speakers. The plus side to the Fire is that it is very fast with little lag time. I just can't accept the poor HDMI sound quality in my home theater.", "verified": true, "helpfulness": "0/0", "author": "Joseph W. Pirosch"}, {"rating": 5.0, "review": "Totally happy.  Our kids do not have cable in their rooms because of the cost to run the cable throughout the house.  This product allows them to watch Netflix and all the other stuff the kids want to watch.  Very easy to install and use.  We got one to test it out definitely considering more.  Son who has it uses it daily.", "verified": true, "helpfulness": "0/0", "author": "OldBookworm"}, {"rating": 2.0, "review": "The remote doesn't always work. For example, hitting the down button once will sometimes cause the screen to just scroll through the menu. It is also extremely delayed sometimes (10-15 seconds between pressing the button and seeing the change).", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We got our fire stick about a month before it was expected to get here and we are THRILLED with it! We had an Apple TV (past tense, because it was kicked to the curb once we got the fire stick), and the Apple TV just wasn't laid out good, the remote was an app on the phone and that app on the phone hardly EVER worked! We were constantly having to unplug the Apple TV and re-plug it in just to get our app remote to work. It was SO frustrating. But now, with the Amazon Fire Stick, no more hassle, no more stress, it just WORKS and the apps are awesome. I love the auto-play feature on Hulu and Netflix. The apps on the fire stick work like the websites, which is greatly appreciated. So far so good....loving it!", "verified": true, "helpfulness": "0/0", "author": "Morgan"}, {"rating": 1.0, "review": "I have tried to find a list of approved providers anywhere on the fire stick page...and I cannot.  There is a single mention, buried in small print that it doesn't work with all providers.  But I had to focus and dig to find that.  Clearly Amazon doesn't want customers to know this so they'll buy it anyway.  I'm giving this one star because this is horrible treatment of the customer.  I guess the stick works fine.  But it will be a very cold day in h*** before I buy another Amazon product.", "verified": true, "helpfulness": "0/1", "author": "Keifer Alan Meeks"}, {"rating": 1.0, "review": "I give it two stars because of the design.  If not for the design, I would give it zero.  I also have a fire tv console and compared to that, stick is ultra sluggish.  The apps load and close slowly.  The USB cable that comes with it is good if the power loutlet is 3 inches away from the stick.  Yes, I am exaggerating but seriously the cord is short.  Overall, it is better to save some money and get a full console than go for the stick.  The remote is nice and there is no microphone search available.", "verified": false, "helpfulness": "2/2", "author": "Amazonian"}, {"rating": 5.0, "review": "It's a fantastic device and you're getting a great value for the price.Pros:Fantastic processing power and streaming speed (I have 100 Mb/s down : 50 Mb/s up Verizon FIOS connection, and my smart tv doesn't stream stuff NEARLY as quickly as this little wizard).Very simple to use.Versatile.Price.3-5 minute setup...if you're working slowly.I've never seen a Netflix or Amazon \"loading\" screen for more than 3 seconds, and NEVER had a stream interrupted, which happened frequently on my smart tv (which was reasonably high end at the time of purchase). It never happened on my PS3, xbox 360, or PS4 either though...which tells me the Fire TV Stick has more than enough processing power to stream 1080p...exactly what I bought it to do.Cons:I've had a couple little audio *blips* here and there, but they are rare and I suspect firmware fixable.The video they force you to watch on 1st setup. It's a bit counter intuitive, because they designed the controller and use to be so simple, and yet take several minutes (maybe 7-10) to explain the obvious. I'm sure it's just a CYA video, but it should be skippable. However, it's a petty inconvenience to knock them a full star for, still a 5 star device IMO.Other thoughts:If you're looking to this as a primary gaming console, well, look elsewhere. This plays fairly \"light\" games very well, it's not on par with consoles or gaming rigs...it was never intended to be, but I've heard complaints trying to compare the 2...they are too dissimilar to compare. Fantastic streaming device, great for casual or light gaming, and actually quite powerful for the price.I might get one for each tv...they really are fantastic.", "verified": true, "helpfulness": "1/1", "author": "D. Stells"}, {"rating": 4.0, "review": "Easy set up, easy to use interface.  Needs a better search function for apps, but other than that no complaints.", "verified": true, "helpfulness": "1/1", "author": "Justin D Jolly"}]