[{"rating": 5.0, "review": "love this new gadget.", "verified": true, "helpfulness": "0/0", "author": "sillyshyme \"Dave\""}, {"rating": 4.0, "review": "It works well but has problems connecting properly. I internet is fine but the stick doesn't like netflix a whole lot.", "verified": true, "helpfulness": "0/0", "author": "India Thompson"}, {"rating": 3.0, "review": "Good doing business with", "verified": true, "helpfulness": "0/0", "author": "James Bradley"}, {"rating": 1.0, "review": "Fire TV , Work its in my country Nicaragua? Because video prime its not working", "verified": false, "helpfulness": "0/1", "author": "Geronimo Valle \"chombo\""}, {"rating": 4.0, "review": "After speaking with Amazon help who did a great job and were very friendly, I am very happy with how this product works.May buy additional for other TV", "verified": true, "helpfulness": "0/0", "author": "SUSAN"}, {"rating": 2.0, "review": "Glitches very frequently", "verified": true, "helpfulness": "0/1", "author": "Travis Severson"}, {"rating": 5.0, "review": "Well worth the money, especially compared to competitors. Highly recommend, especially if you are a prime member.", "verified": true, "helpfulness": "0/0", "author": "KBlack"}, {"rating": 5.0, "review": "Great system for the people like me that don't have a gaming system or smart tv. I bought my flat screen right before the smart tv hit the market. Oh well. For $40 you can watch Netflix, Amazon Prime, and YouTube. I am going to waste so much time with this.", "verified": true, "helpfulness": "0/0", "author": "C Mikles"}, {"rating": 4.0, "review": "I expected great things from this device and for the most part I have not been disappointed. I like how small it is and well the remote works. I like how quickly I can access Amazon streaming as well as my list of things to watch. Additionally, it loads Netflix much faster than my blu-ray player did. However, it has one nagging problem. It seems to have a small cache. I have noticed on Sunday afternoons that it repeatedly needs to rebuffer in the middle of watching a show or movie. Sometimes to the point that it sticks at 25% I need to stop play and restart. I've confirmed that my blu-ray player does not do this. I'm concluding that the cable network is busier on a Sunday afternoon than when I usually watch streaming vids and that the Fire TV Stick needs a larger cache to store buffered video.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 2.0, "review": "Constantly loses connection and is 20 ft from the router. Hardly use it, anyone want a used one cheap?", "verified": true, "helpfulness": "0/1", "author": "Mike B."}]