[{"rating": 4.0, "review": "I bought cheap, and considering what I paid, I think I'm mostly getting my money's worth. The WiFi can get hiccup-y at times and the apps don't always work perfectly - ESPN, I'm looking at you. Like, directly at you. Straight into your soul. - but it's hard to know what end that particular problem is on. Needless to say, I'd recommend taking the plunge here, especially if it pops up on sale.", "verified": true, "helpfulness": "0/0", "author": "Sam Wilkinson"}, {"rating": 4.0, "review": "Works very well on my TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works as it should be. Easy to use and no bugs encountered so far", "verified": false, "helpfulness": "0/0", "author": "Norma Endress"}, {"rating": 5.0, "review": "Starting with the Package design... really beautiful presentation and form factor. Connecting the device was a cinch, especially b/c they thought a step ahead and linked it to my Prime account. It's the little things that make the biggest impact. In terms of usability, the remote is naturally intuitive to use and it's smooth sailing. I replaced the Roku 2 unit for the Fire TV Stick and so very glad I did. It was just time for an upgrade and at this pricepoint, I couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Alex Boogie"}, {"rating": 5.0, "review": "Great gadget", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I expected it to have the same voice remote as the box. I'm disappointed that amazon was so misleading about it. You present it as the same functionality as the box then want me to spend another 30 bucks each for a voice remote. I think you should send me the proper remotes for both of the sticks I purchased. Then its a great deal. If I'd known I wouldn't have ordered them, just got a couple of more boxes with the right remotes for practically what it will cost to order them separately. This is a misleading advertisement.", "verified": true, "helpfulness": "0/0", "author": "Eric Brady"}, {"rating": 5.0, "review": "Works great easy to install and set up. Love it", "verified": true, "helpfulness": "0/0", "author": "Maleia"}, {"rating": 1.0, "review": "BEYOND disappointed! I purchased this for my daughter's room - IT WILL NOT stay connected to the internet (other devices have no problem staying connected) AND it got so hot it was almost uncomfortable to touch - certainly a fire hazard. I will be returning this ASAP. Amazon, please care about ALL of the products you manufacture. We will be getting purchasing an Apple TV instead.", "verified": true, "helpfulness": "0/0", "author": "Niryana"}, {"rating": 5.0, "review": "easy to set and use very good product", "verified": true, "helpfulness": "0/0", "author": "Elliot Yeske"}, {"rating": 5.0, "review": "Love it!!!  Great shows at the touch of a button.", "verified": true, "helpfulness": "0/0", "author": "Teena"}]