[{"rating": 1.0, "review": "The unit only offers expensive choices and if I knew before that was the way it works I would not have ordered it.William Weiss", "verified": true, "helpfulness": "1/1", "author": "bill 3"}, {"rating": 2.0, "review": "I Can't seem to fix the problem. It doesn't connect to my wifi anymore.", "verified": true, "helpfulness": "0/1", "author": "VwrudeboyGli"}, {"rating": 1.0, "review": "Bought this over it's competitors because it said it was Miracast(TM) Certified. It's not, and Amazon knows it's not. It is Miracast compatible, but does not support all devices and therefore is not certified.I was a victim of false advertising, Amazon's bait and switch, which is sad because I've been such a big Amazon proponent in my circle of friends & family up until this point.", "verified": true, "helpfulness": "1/1", "author": "Adam Cloud \"CloudyOne\""}, {"rating": 3.0, "review": "Don't see alot of content with this that you don't have to pay for.  Guess I was kind of hoping for that.  Also YouTube and Pandora are nowhere to be found on the menu. At least I didn't spend a pile of money on it.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "I love this thing! Simple and effective way to upgrade my TV's smart TV system. So much better. And the fact that I can move it from TV to TV, bring it with me, etc. I love it.", "verified": true, "helpfulness": "0/0", "author": "Jeremy L. Smelski \"Jeremy\""}, {"rating": 4.0, "review": "Great Product. I replaced a Chromecast with this because I can watch Amazon Prime videos with this. I cannot with the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Paul Tippin"}, {"rating": 5.0, "review": "exactly what I expected", "verified": true, "helpfulness": "0/0", "author": "S. Lynch"}, {"rating": 4.0, "review": "This is a great addition for me.  I watch Netflix, and not a whole lot of modern television.  I don't think I would have this on it's own, but as an added form of entertainment.  The prices of the movies are very high, and even rentals are high compared to Hulu and Vudu.  I also wish that the selection of \"classic\" movies (Carey Grant, Lauren Bacall, etc.) was more extensive.  It's very limited right now, but I'm sure there are coyright and other issues to contend with.  The interface is very easy to use, and the speed is excellent.  I'm also enjoying some of the original programming Amazon offers.  All in all, a worthy tool.", "verified": true, "helpfulness": "1/1", "author": "mapolson"}, {"rating": 5.0, "review": "Fantastic a great buy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I replaced my Roku stick with this. Hands-down, this is the way to go. Great picture, great UI and all that apps I love are on it.", "verified": true, "helpfulness": "0/0", "author": "Mark Pilipczuk \"Managing Director, MAP Consulting LLC\""}]