[{"rating": 4.0, "review": "Works as expected and the Amazon music is great. Provides words to song on tv screen, nice features.", "verified": true, "helpfulness": "0/0", "author": "michael jackson"}, {"rating": 5.0, "review": "I am able to watch all of my shows and movies so easily. I take it with me to my mom's house and watch programs with her every weekend. It is so simple to use and with my Prime membership there are so many shows/movies to watch. Love it!", "verified": true, "helpfulness": "0/0", "author": "Jeanette Edmiston \"jmemath\""}, {"rating": 5.0, "review": "Our best purchase in a long time!", "verified": true, "helpfulness": "0/0", "author": "Pamela Roosa"}, {"rating": 1.0, "review": "If I had known that every channel cost I would never ha", "verified": true, "helpfulness": "0/0", "author": "Bruce Jacobs"}, {"rating": 5.0, "review": "I recieved this  Fire TV Stick in the mail yesterday.  I opened the package, read the extremely short directions, plugged my Fire Stick into the wall, plugged it into the TV, connected it to my wireless LAN, started a subscription to Netflix, downloaded the Netflix App and watched my first HD movie on my HD television.Pros.  Other than one problem, everything worked like a charm.  The setup was simple, and the visual quality of the movies are outstanding, its too early to tell but so far it seems to work flawlessly.  My initial opinion is I love it.Cons.  There were no instructions for setting up the stick for Netflix, which requires the down load of the NetFlix APP. As a matter of fact there was no mention of any APP at all.  I think this is poor since a new user wouldn't have a clue that an APP of any sort was necessary.  I'm a first time user so I had no idea how to set up Netflix.  I got on the NetFlix home page and read the instructions for setting up with an Amazon Fire Stick.  This is where I first discovered there was such a thing as an App that needed to be downloaded.  I followed the instructions but as you might guess the instructions were dated did not match the screens provided by the Stick, so I could not download the Netflix app.  I had to resort to the old tried and true technique of  fat fingering and trial and error using the screens provided by the Stick.  Much by accident I finally navigated from point A to point B so to speak, downloaded the APP and now everything operates very smoothly.", "verified": true, "helpfulness": "1/1", "author": "Richard N"}, {"rating": 5.0, "review": "Only way to prime gets the most out of the membership", "verified": true, "helpfulness": "0/0", "author": "Mark J"}, {"rating": 5.0, "review": "This stick was out-of-stock when I first ordered it about 2 months ago, but the wait was worth it. Easy to set up and use. I mainly use Netflix with the Fire Stick, but I am open to trying out other channels in the near future. For the price of $39.00, it's worth the investment.", "verified": true, "helpfulness": "0/0", "author": "Maise888 \"Chicago888\""}, {"rating": 4.0, "review": "90% works fine but the fire tv in the main room never glitches. Thinking a fire tv in the bedroom and the stick in the garage and workout room would be best for streaming. You make some compromises for convenience. Amazon needs to go full bore with content if they are serious about this concept. It's good but they should be the world leader", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "A M Navarro"}, {"rating": 5.0, "review": "Love it , only had for two weeks and ....LOVE IT", "verified": true, "helpfulness": "0/0", "author": "still waiting"}]