[{"rating": 2.0, "review": "Very Disappointed. You can't use it  really unless you sign up for prime ($99.00)", "verified": true, "helpfulness": "0/0", "author": "DEACON KIRK"}, {"rating": 1.0, "review": "complete pain to install; tell others to find their MODEM password!!", "verified": true, "helpfulness": "0/0", "author": "Steven Bates"}, {"rating": 5.0, "review": "Love it !! We use it everyday. May not need cable anymore", "verified": true, "helpfulness": "0/0", "author": "M. L. Red"}, {"rating": 3.0, "review": "Needs to have SDK and API So as to change the menu Structure Needs more thought put into it.  For Example Netflix (web based) has a better view of all movies that you can look through instead of yours where you have Suggestions, dah dah dah. User Experience but for now its the best choice so far compared to the google chrome I tried before. Slow and Hard to Setup.  Yours has the Register which should be in the Apps and able to placed on the Home where other apps maybe a good starting point. To Register to access it is just plain stupid. you track us just like NSA tried and probably does.  Please don't say it is for our own good, we should be left up to the choice and know exactly what you are collecting. We paid for the device and we should at least be able to decide and you pay us for the information and I would be glad to allow information to be shared.", "verified": true, "helpfulness": "0/0", "author": "Sherman Hunter"}, {"rating": 5.0, "review": "I haven't really used it a ton yet but what I have used it for has been great...going to downsize my Directv after baseball season is over!!!", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "avion burks"}, {"rating": 4.0, "review": "We've had the stick for about 3 weeks. We love how easy it was to set up and how easy it is to integrate our own media. After watching several shows for 2.5 weeks it has started forcing ads just in the last couple days. At first it started just between show choices now it's inserting them like commercials. No thanks amazon, no thanks. I'd like a no ad choice.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutely love the fire stick.  Access to so many apps makes it worth it.  Bought it for my workout room and have been using it daily.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this product! This is the third fire stick I have bought. If you are an Amazon Prime member, then you will like this even better than the Chromecast stick! There are so many TV shows to watch for free. Movies aren't as current, but you can still find some. If you have kids, you will love that the shows will play one after another, unlike On Demand where you have to put a new episode on for them when their show is over. As far as the actual device, it works great without any lag time, and moves from one TV to another with ease.  Buy one and you won't be disappointed!", "verified": true, "helpfulness": "0/0", "author": "Kara B."}, {"rating": 4.0, "review": "This thing works great and is very fast compared to the Roku and Chrome cast I have", "verified": true, "helpfulness": "0/0", "author": "Robert L Hill"}]