[{"rating": 3.0, "review": "It took me over a hour to get it set up... As soon as I plugged it up, it had updates to install. I have a nice size tv but the font is very small... Still trying to figure out everything..", "verified": true, "helpfulness": "0/1", "author": "AGilbert"}, {"rating": 5.0, "review": "Great Product.  Working in Concert with my Kindle Fire to search for the right show and then play through the Fire TV Stick is a great feature.  Very Satisfied and recommend this product.", "verified": true, "helpfulness": "0/1", "author": "Amazon Fanatic \"G. L.\""}, {"rating": 3.0, "review": "Here are my thoughts after giving this a spin and though of replacing Chromecast because of some \"con\" experiences with Chromecast while playing/streaming on my mobile devices.Cons:- lags badly for Youtube, Hulu and Netflix (appears Amazon may be throttling 3rd party services)- took a while to setup as it had to download software (like it didn't come updated! SMH)- Wifi keeps disconnecting while I had full barsPros:- Cheap (got it for $19 for Prime)- Can play Amazon Prime Videos (whiles others don't that's because Amazon is a hater and fears competition).Other thoughts:I did not play any games or other apps as this was not my purpose.  I did test Chromecast again and HULU does not even lag, so this led me to believe Amazon is purposely throttling 3rd party services in order for people to simply have to rely on Amazon Prime Video.  I did not see any lag on the Amazon video service.  hmmmmm...Returned for my $19 bucks back.", "verified": true, "helpfulness": "1/2", "author": "Jon Waynes \"Frotto\""}, {"rating": 5.0, "review": "We have already begun using the Fire TV Stick and we absolutely love it! We cannot believe how easy it is to locate shows and movies that are available.", "verified": true, "helpfulness": "0/1", "author": "VM Brown"}, {"rating": 3.0, "review": "Just got this yesterday.. Looking forward to setting it up. Though maybe I did not read enough.. The commercial shows it just GOING into the HDMI port by itself.. In reality it has a power cable and power transformer (very small one) and the instructions say for best performance they highly recommend that it be plugged into power. If it indeed struggles without being plugged in I will be disappointed as power outlets are pretty hard to come by where I have my setup. and elimination of wires was one reason I wanted to dump apple TV for the fire stick.UPDATE AFTER INSTALLATION.I have a Panasonic Viera Plasma TV.. Without the power cord the Firestick would not even power up on ANY of my HDMI ports. I got no picture at all.. Once I plugged in the provided power cable it did indeed power up. So as far as Amazon (strongly recommending the power supply) I in fact was incapable of using it on both my Panasonic and my smaller bedroom TV with out external power.Setup was simple. Though the device was just released there was already an update to it which required about 10 minutes and the update seemed to erase my WIFI settings as I had to enter the WIFI key a second time. The device already knew which Amazon account I had and it was already programmed in (never had to enter a password so I guess Amazon just activated it before shipping)I watched about 3 episodes of falling skies.. The picture was very good. The sound good. No stuttering or choppy blocky pics at all. I have not used any other apps like netflix or espn yet but plan on it.I have a harmony one remote. I tried to add the Fire Stick to it and it said it used bluetooth so it walked me through the process of getting the amazon Fires Stick to recognize my harmony via bluetooth. It never did work. I am sure with time and tinkering and probably an update or two by Harmony and Amazon and this will get ironed out but for now I have to use the included remote.I wish it worked without the extra wires but so far it is a nice device and I am glad I got it at the intro price.", "verified": true, "helpfulness": "1/2", "author": "Shawn"}, {"rating": 5.0, "review": "Very easy to use. Was able to side load XMBC which made this worth getting!", "verified": true, "helpfulness": "1/2", "author": "Alexander Castañeda"}, {"rating": 1.0, "review": "Just got my stick today -- and I'm pretty disappointed.Pulled it out of the box -- packaging is nice (as amazon's stuff always is). Came with all of the potential required dongles/etc.Plugged it in, was told that my TV's USB port didn't supply enough power. No problem, hooked up the AC adapter.Went through the initial boot up process -- seemed normal, that is, until I tried to interact with it at all. Selected my WiFi - and was asked to enter my wifi passphrase -- and I spent the next 5 minutes trying to wrangle a terrible remote into entering my simple wifi password.Button presses would be not received, or a single button press would register as multiple - sending the cursor clear across the keyboard. It's worth mentioning that I was standing literally 4 feet away from the stick, with no obstructions (other than the TV it was plugged into).Eventually, I got the password in, and it 'seemed' to join my wireless network. However, the main menu showed that in fact, it hadn't successfully connected to my wifi. I went back into my network settings, and apparently it couldn't see my wifi connection (the access point is 10 feet away from the stick at this time). Multiple other devices are working perfectly.At this point I suspect I was given a defective stick (maybe bad antenna?), a defective remote, or both. Definitely killed the excitement of opening a new piece of tech.Going to do one last test with the HDMI extender dongle -- supposedly it 'improves wifi signal'.", "verified": true, "helpfulness": "21/27", "author": "Justin Kimball \"justin kimball\""}, {"rating": 4.0, "review": "It arrived quicker than I anticipated. it was easy to get it up and running. works great my only complaint is last night it froze on me and then would not connect back to my internet. I had to unplug the device from the tv and plug it back in and then it reconnected just fine. I guess only time will tell if it will be an ongoing occurrence, but so far I'm pleased with it.", "verified": true, "helpfulness": "0/1", "author": "Jennifer R."}, {"rating": 5.0, "review": "Works great haven't had any issues so far other than wanting to skip the introduction.", "verified": true, "helpfulness": "0/1", "author": "Cap'n Skiz"}, {"rating": 3.0, "review": "Had a few initial problems after set-up (\"HDCP\" blue screen error, a couple of apps frequently freezing up while watching), but otherwise a good product for streaming video.", "verified": true, "helpfulness": "0/1", "author": "CD"}]