[{"rating": 5.0, "review": "Absolutely marvelous, A must-have", "verified": true, "helpfulness": "0/0", "author": "jeffrey jimenez"}, {"rating": 5.0, "review": "This this is phenomenal! I love it better than my Apple TV (which feels like a total betrayal) because I'm able to access my Amazon Prime. We can't watch HBO Go, but it's a good trade off in my book. I definitely would recommend a Fire TV Stick to anyone. It's so easy to use and set up as well.", "verified": true, "helpfulness": "0/0", "author": "Alesha"}, {"rating": 5.0, "review": "Best tool for a true core cutter.", "verified": true, "helpfulness": "0/0", "author": "Larry Austin"}, {"rating": 5.0, "review": "It's everything it says it is. You'll get the max experience if you have amazon prime. I love that you can play games too", "verified": true, "helpfulness": "0/0", "author": "sofija mlakic"}, {"rating": 5.0, "review": "I love the Fire TV Stick! It was so easy to install, and the options for viewing are great--so much to choose from, I don't know where to begin! Also, the quality of video is so much better than our cable, which keeps sputtering and skipping and telling us \"this channel will be available shortly.\" We are using the Fire TV Stick with WiFi, from our cable company, but we will probably be discontinuing the cable tv. For the ease of use, the quality of the watching experience, and the huge selection of movies, television shows, etc., available through by Prime subscription, the Fire TV Stick is an amazing value. If you are a Prime member, what are you waiting for?", "verified": true, "helpfulness": "0/0", "author": "Elizabeth P. Gregory \"eliza1558\""}, {"rating": 5.0, "review": "Super duper!", "verified": true, "helpfulness": "0/0", "author": "xl33tgamerx"}, {"rating": 4.0, "review": "Enjoying the Fire TV Stick, Works great when connected, but drops connection to Wi-Fi then wont reconnect at times and when scans foravailable networks wont recognize any. Have to completely shut down Fire Stick and reboot to re-establish network connection.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This is the second one. I had to return the first one because it would not play any audio. This one, since I got it a few months ago, has needed to be factory reset several times to get it to work. The technical support people don't know anything. They just read from a list of steps to try and don't listen to the customer. Now any time I try to watch anything on Prime, of which I am a member, I get an \"unauthorized content\" screen, but I can hear the movie or tv show playing in the background. This thing is a joke.", "verified": true, "helpfulness": "0/0", "author": "Jason S. Jameson"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "So easy to install and when I had a question the person I dealt with was wonderful. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "james Carbone"}]