[{"rating": 4.0, "review": "I haven't used the fire tv stick as much as I wanted to because I've been busy. But so far I like it. Hopefully I will update later.", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 5.0, "review": "Luv this so much. Excellent product. Easy to use, can move from any room so I can keep up on shows I'm watching. Luv the remote that's included. Thanks so much!  :-)", "verified": true, "helpfulness": "0/0", "author": "Ann I."}, {"rating": 5.0, "review": "I went ahead and purchased this even though amazon customer service told me it would NOT work and/or do what I wanted it to do.  Of course, that depends on which agent I connected with, as it was, several times.  I bought a Fire HDX tablet, hoping to be able to choose a prime video and then throw it up to the big screen.  I have a Samsung tv that is made after 2013, being one of the criteria to make that happen, but no such luck.  It needs to be a \"smart tv\".  I bought a Belkin Miracast video adapter, and I was able to mirror my tablet screen to the tv screen, but no audio.I am pleased to say that the Fire TV Stick joins your wifi network very easily, and works with the Fire HDX tablet, both the remote app, and the \"second screen\" feature.  You can sort through videos on the tablet, choose one, start it, and then touch the icon to transfer it to the tv or use the remote app to control the Fire stick itself.  You can then close the tablet and put it away, while continuing to watch your program.  I even plugged the Fire TV Stick into a hdmi port of my audio receiver, and it works perfectly.  I can now use the TV stick remote or the tablet to choose something to watch, while enjoying it through the surround sound.I just wish I could have gotten someone at Amazon who knew their products.  I'm out $60 on a Belkin adapter that I didn't need.  I almost didn't buy the Fire stick as I was told it wouldn't work, but it does.", "verified": true, "helpfulness": "0/0", "author": "scott e roberts"}, {"rating": 5.0, "review": "should have bought this sooner, love it!!!", "verified": true, "helpfulness": "0/0", "author": "Dawn clay"}, {"rating": 5.0, "review": "Great gadget, has all apps I wanted except HBO Go.", "verified": true, "helpfulness": "0/0", "author": "Amber Sanders"}, {"rating": 5.0, "review": "I am very happy with the Amazon fire stick it's a great product for the price. It does everything that it claims to", "verified": true, "helpfulness": "0/0", "author": "matt shearouse"}, {"rating": 5.0, "review": "totally worth it", "verified": true, "helpfulness": "0/0", "author": "Thor Allen"}, {"rating": 2.0, "review": "When it is connected works well. Constantly saying there is a connection problem or log in info problem. Have to reset it many times throughout the day just to use. Sling works great on my phone though.", "verified": true, "helpfulness": "0/0", "author": "Sean Pontow"}, {"rating": 1.0, "review": "I cannot get it to stay connected.  It shows very good internet reception, but then when loading a show, it stops working.  Tried all the usual tricks - still doesn't work - for 3 months now.  Chromecast and Roku are working fine.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!  I have 3 roku sticks, however decided to try the fire stick.  Wish I had 4 fire sticks instead now.", "verified": true, "helpfulness": "0/0", "author": "Rock Mutchler"}]