[{"rating": 1.0, "review": "Dead on arrival. Didn't work on both TVs I tried it on, with or without power plugged in. Nothing would show up on the screen at all.", "verified": true, "helpfulness": "1/1", "author": "James"}, {"rating": 5.0, "review": "I have enjoyed watching Amazon content on something bigger than my Kindle!  Easy for a non-tech person like me to understand!", "verified": true, "helpfulness": "0/0", "author": "Ictkaren"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Peggy"}, {"rating": 5.0, "review": "I have had the fire stick for 2 to3 weeks.  It was very easy to install and start up.  Remote is easy to operate and I have had no problems with playing the videos.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up and great price", "verified": true, "helpfulness": "0/0", "author": "SciFi Girl"}, {"rating": 4.0, "review": "I am anxious to put this to use. It seems to take alot of broadband width and I have not called my Internet provider to see if we can improve ours- so really to be determined if we can use it as we should- so no comment", "verified": true, "helpfulness": "0/0", "author": "Jean C Smith"}, {"rating": 5.0, "review": "The fire stick rocks, super easy to use, our 5 yr old loves the kids shows on Netflix & can operate the simple remote herself.You can move to different rooms if needed easily as well.", "verified": true, "helpfulness": "0/0", "author": "Super Shopper"}, {"rating": 5.0, "review": "The Amazon Fire TV stick works great and since I am also an Amazon Prime member, it works seamlessly.  A great product for a reasonable price.", "verified": true, "helpfulness": "0/0", "author": "R. Crotts"}, {"rating": 5.0, "review": "Works great for me, faster than wired, didn't expect that it would, I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Hollis Clark"}, {"rating": 2.0, "review": "This is a heads up/warning for anyone considering buying the Stick. The design or firmware is seriously flawed. As of today there are 224 posts on the customer discussions page (http://www.amazon.com/gp/r.html?http://www.amazon.com/forum/kindle/ref=cm_cd_pg_pg1?_encoding=UTF8&cdForum;=Fx1D7SY3BVSESG&cdPage;=1&cdThread;=Tx2CDOG0K31UBSB), all complaining about the Stick's inability to maintain a network connection. Amazon may fix the problems and soon, because if they don't, they will have a failed product on their hands. I suggest that if you're interested in getting one, WAIT until you hear that the problems have been fixed.BTW, when it works right, it's glorious and the content is enormous (200,000+ movies/videos/etc.), much of it free to Prime members.****************Update 7/2/15: I became so frustrated with the Stick's inability to maintain a network connection (despite System/Settings saying the connection was \"VERY GOOD\" and \"Connected\"... not \"Connected with problems\". . . \"Connected\") that I e-mailed Jeff Bezos about the Stick's problems. This eventually led to Amazon sending 4 tech support engineers from Sunnyvale to my home in Delaware on May 1. They spent 4.5 hours taking spectrum measurements and trying numerous things. When they left, they had made only 2 changes: (1) Moved the Stick to HDMI 1 and my DVR to HDMI 4, thereby separating the 2 connections by the maximum distance, presumably to minimize electronic \"noise\" close to the Stick. (2) They left me with a new Netgear 802.11ac router (thank you!) and put the Stick on its 5GHz signal (the D-Link N router I had only provided a 2.4GHz signal). Since May 1, the Stick has worked FLAWLESSLY.The question is, which of those 2 changes had the most to do with the Stick's now perfect performance? IMO, it is the 5GHz signal. The Stick remains subject to interference from other devices in and around my home. Most of them...probably all of them...send out 2.4GHz signals. By moving the Stick to a 5GHz signal, most if not all of the interference is of no concern. THAT DOES NOT SOLVE THE STICK'S PROBLEM; it's just a workaround to avoid its inability to reject stray signals. Amazon still needs to redesign it so it performs like Google's Chromecast, ROKU sticks, etc. Until that's done, many people will have problems with it.", "verified": true, "helpfulness": "0/0", "author": "DKT \"Don\""}]