[{"rating": 5.0, "review": "Awesome! I love this and use it everyday. I no longer have a cable bill and use this to watch Netflix, Hulu, and Amazon Prime video.", "verified": true, "helpfulness": "0/0", "author": "Boardwalksailir"}, {"rating": 5.0, "review": "I'm just beginning to play with the new unit, but so far I'm impressed by the ease of accessibility and the variety of things that are accessible through Amazon Prime. So far, its my favorite Christmas gift to myself.", "verified": true, "helpfulness": "0/0", "author": "Sandy Heiss"}, {"rating": 4.0, "review": "This thing had to update before it could be used, but the update continued to fail for the first couple of days.  Other than that, it has a pretty smooth operating interface.", "verified": true, "helpfulness": "0/0", "author": "Richard S"}, {"rating": 5.0, "review": "LOVE", "verified": true, "helpfulness": "0/0", "author": "Katie Lavelle"}, {"rating": 5.0, "review": "It's amazing. Bravo Amazon!  Works with my Slingbox.  Clearly worth twice the price.  Buy it!  It's easier to use than Apple TV!  just as good, if not better than Chromecast!  I have all of them.  Fire TV Stick is a great value.  Comes with remote too.", "verified": true, "helpfulness": "0/0", "author": "Amazonian"}, {"rating": 4.0, "review": "UPDATED:  After  few hours, I did get them to work, but not in the rooms/location that we bought them to work in.Bought 2 for Christmas presents for my kids...NEITHER WORK!!!!!! Thanks :/  One will not load at all...the other actually gets to the connect page but then is stuck. How about you not sell inferior, not ready products. I'm sure these were rushed to be done in time for Christmas, but what good are they if mine and MANY, MANY others don't work :/", "verified": true, "helpfulness": "0/0", "author": "Andrea Jones \"carebearandrea\""}, {"rating": 5.0, "review": "Awesome! Very fast! The iphone app controller is cool as well. This is much faster than the Chromecast that i use on my downstairs tv. I am very surprosed about the speed of the GUI and ease of use. IF you buy this, you will not be disappointed!", "verified": true, "helpfulness": "0/0", "author": "Gray B. Moore"}, {"rating": 1.0, "review": "Bought early, did not even work. Spent hours on phone with 3 reps who said customers had similar problems and I should return it. Plugged into TV with no signal. Was told I can return it at my pre-order discount price and buy again when its available in future at full price! Don't waste your time, use Amazon to buy things but not if they make it, go with Google Chromecast - its simple and works.", "verified": true, "helpfulness": "1/1", "author": "A. Humad"}, {"rating": 5.0, "review": "Works flawlessly for our needs.  Beats the built in app on the TV hands down in terms of ease of use.", "verified": true, "helpfulness": "0/0", "author": "Big Al"}, {"rating": 5.0, "review": "Love it Love it ---- truly a  plug and play device", "verified": true, "helpfulness": "0/0", "author": "Susan Adelle"}]