[{"rating": 5.0, "review": "Received as a gift.  I like it ALOT.", "verified": false, "helpfulness": "0/0", "author": "Janice A McConnell"}, {"rating": 5.0, "review": "Many movies and TV shows on the big screen.  Easy to use and set up.  Games also.  Great value.", "verified": true, "helpfulness": "0/0", "author": "Swede Rock"}, {"rating": 5.0, "review": "Fire TV stick is the best! Great price and super easy set up! Best purchase I have made in years!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love my fire stick! I had chromecast and fire stick is leaps and bounds ahead of chromecast. Much faster and easier to use. I am definitely a happy customer.Ray", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 2.0, "review": "It works overall, however, the search feature is poorly designed and the app that is supposed to work off of the cell phone or a computer is not working properly to search.", "verified": true, "helpfulness": "0/0", "author": "buratino"}, {"rating": 5.0, "review": "a lot better then chromecast", "verified": true, "helpfulness": "0/0", "author": "edwin ortiz"}, {"rating": 4.0, "review": "I have Chromecasts. The somewhat integrated interface of the Fire Stick is better than them by far. I havent used the device app so far but the onscreen navigation is really nice.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "Truly the future of TV", "verified": true, "helpfulness": "0/0", "author": "Martin Ahlijanian"}, {"rating": 5.0, "review": "The setup was very easy. I am happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Marie J Quinn"}, {"rating": 4.0, "review": "It pretty much worked as advertised.  Some issues were not major at all.  When installed about 10-15 minutes to update software, put in your amazon info and you are running. All in HD except for older TV shows originally broadcast in 4:3.  One con I knew about was did not yet work with HBO Go but is supposed to work shortly.  The item I was not aware was that you needed to use the AC power cord instead of the USB connection.  The box includes both connections but I had to provide power strip.  No big deal for me since the alternative was Chromecast where I needed to bring a PC, tablet or cell phone to watch the provided apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"joelpps\""}]