[{"rating": 5.0, "review": "enjoying using this baby!", "verified": true, "helpfulness": "0/0", "author": "creazyb"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Irving Feder"}, {"rating": 5.0, "review": "Love it and it's so easy", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "James M."}, {"rating": 3.0, "review": "This is great device to put in the family play room , but the parental controls are nearly non-existant and really need to get updated.The parental controls are simply a pin you put into the setting and that's it. It locks down viewing and purchases. So it works. However, you have to enter the code on each viewing.  Its a ham fisted approach and seems to be lacking a lot of refinements.the device itself is excellent, It would be better if it did not require a separate power line or there was an option for low power.", "verified": true, "helpfulness": "0/0", "author": "Jeremy A. Cobert"}, {"rating": 2.0, "review": "The sound is so far off of the video that everything looks dubbed.  Expect a full 3 second sound pause when you start a video or push play after pausing before you hear anything.  Constantly tells me that I can't watch a movie because it is locked due to parental controls (even though I haven't set any) and this is after pausing something I have been already been watching for 30 minutes just to go to the bathroom.  Piece of crap.  Save your money.  I only gave it two starts because I can watch Firefly if I'm patient enough.", "verified": false, "helpfulness": "0/0", "author": "Elizabeth Barton"}, {"rating": 5.0, "review": "Wow, it does a lot of really great things. Much more than I expected.  I particularly like the way it allows me to put my photo images on my big tv.", "verified": true, "helpfulness": "0/0", "author": "Howard Law"}, {"rating": 3.0, "review": "Handy little device, but with two drawbacks.1) Netflix refused to work until I set the video quality on the Netflix website to auto and turn the test participation off. Multiple online feeds say that this is due to the FireTV stick not liking the netflix setup.2) my second issue with this device is that even with the router set up in the same room, the device is constantly having connectivity issues. Even with the extender cable, I was still having problems; maybe if the cable was a little longerOther than this, the FireTV stick has the potential to be a great device.", "verified": true, "helpfulness": "0/0", "author": "Evan"}, {"rating": 2.0, "review": "only a few of the apps work consistently, Netflix stopped working all together which is basically the reason I bought it. Hulu still works, and pandora works when it wants to. careful of paying for any apps on the fire stick menu, as many of them are crap and don't work.", "verified": true, "helpfulness": "0/0", "author": "John G"}, {"rating": 5.0, "review": "Great entertaining tool.  Has all the apps installed in itself, unlike chromecast, where you have to use your mobile device.  The remote is very useful.  Make sure you plug it in a wall outlet, instead of your tv usb port, otherwise it won't work.", "verified": true, "helpfulness": "0/0", "author": "Harry G"}]