[{"rating": 4.0, "review": "Very nice product, it is faster than google chromecast as reviews say, there are two aspects that are lacking, first the stick mostly needs to be connected to a power outlet instead of the usb port from tv on most cases, and second, a big downside is that if you're planning to use it outside US, there aren't many viewing choices due to region restrictions, this issue should be display in advance so no one feels dissapointed, otherwise this is a great product.", "verified": true, "helpfulness": "0/0", "author": "Rudolph Glen"}, {"rating": 5.0, "review": "Am enjoying my firesticks", "verified": true, "helpfulness": "0/0", "author": "Desi"}, {"rating": 5.0, "review": "I was getting so agitated with the long process of loading and hang-ups from Chromecast that I didn't want to use it.  I ordered the Fire Stick and was shocked at its speed.  Goodbye Chromecast, you slow poke and jammer!", "verified": true, "helpfulness": "0/0", "author": "Beverly Gunter"}, {"rating": 5.0, "review": "Great PriceEasy to useCompact (was able to bring it on vacation and it plugged in easily to the TV in our rental home)Use mostly with Netflix, Amazon Video, and YouTube with easy to use interface.", "verified": true, "helpfulness": "0/0", "author": "Amy C"}, {"rating": 1.0, "review": "The fire stick was completely worthless.  It worked fine for about a month.  Then, it stopped working.  I did all the 'fixes' I could find on the Internet and on Amazon, still nothing.  I contacted customer service and they were not helpful at all.  I wasted my money on this and was beyond the 30 day window when it stopped working.  It makes me angry that I spent money on something that does not work at all.  I noticed when trying to figure this out, that many, many people have had the same 'connection' issues with the Fire Stick.  Amazon, if you are going to sell something like this, fix the glitches.  It's obvious from a quick search on the Internet that there are so many people that have connection issues, so fix it.", "verified": true, "helpfulness": "0/0", "author": "Alison M."}, {"rating": 5.0, "review": "I had to use the plug to get it to work but after setup, it has been smooth sailing. The remote is pretty convenient as I had my roommates chromecast which i always needed my phone and would slow my phone down if I wanted to do other things on it while I watched a show. Hopeing for HBO Now soon", "verified": true, "helpfulness": "0/0", "author": "s. bern"}, {"rating": 5.0, "review": "Awesome gift", "verified": true, "helpfulness": "0/0", "author": "Amanda P."}, {"rating": 5.0, "review": "I got this for my daughter to be able to stream Amazon Prime, Netflix and Hulu, she loves it, easy to use, easy to set up, unlike our smart TV there is no interruption in the movie/show due to buffering issues.  Our internet connection can be very slow at times, but no issues with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "MHend"}, {"rating": 1.0, "review": "We really wanted to love the Fire TV Stick.If you only use Amazon Prime Instant Video, then this is the device for you! Amazon Prime Instant Video runs like a dream. Absolutely no issues until you start using third party apps. It freezes in Hulu, Netflix, and any other third party app. These freezes can occur every couple of minutes all the way up to 10-20 seconds apart. Also, the remote seems to go into some sort of hyper mode where one click will register has 5 - 10 clicks, almost as if you were holding the button down.At this point we only use it for Prime Video. I regret buying and should have returned it when I had the chance. There are much better streaming choices for cable cutters.", "verified": true, "helpfulness": "0/0", "author": "Scott Vaverchak"}, {"rating": 5.0, "review": "Do yourself a favor. Buy this and ditch your satellite or cable provider. Your wallet will thank you.", "verified": true, "helpfulness": "0/0", "author": "MykDnm"}]