[{"rating": 4.0, "review": "I bought this for my 16yo daughter for Christmas.  She absolutely loves this!!!", "verified": true, "helpfulness": "0/0", "author": "Kathleen mabry"}, {"rating": 4.0, "review": "Works really well!  Faster than a Chromecast and has the remote to boot!  Love that the remote is RF rather than IR.  Easy interface, not sure why you'd need the full fire TV package.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"presidentsdad\""}, {"rating": 4.0, "review": "This is a good product. While not as advanced as the Fire TV Box it is portable and makes a great travel companion!", "verified": true, "helpfulness": "0/0", "author": "mcpopp \"Marti\""}, {"rating": 2.0, "review": "It's a great gadget, but have had issues booting it up. Very frustrating. For that, I give it 2 stars. We have Roku and Xbox.", "verified": true, "helpfulness": "0/1", "author": "S. Rivera \"Sher\""}, {"rating": 5.0, "review": "If you don't have a gaming console, smart TV, cable, etc. this is a great alternative! It's much cheaper than the full sized Fire TV but does practically the same thing! Watch/rent movies, even watch movies from Amazon Prime through it. You can also play various games as well as view photos that are linked to your account and listen to music.This is really a must have if you have Amazon Prime because it brings the Prime experience to your TV. I really suggest buying this product directly through Amazon because it will come automatically linked to your account so all you have to do it plug it in and start using it. It's really an easy set up and it doesn't take up much room at all.", "verified": true, "helpfulness": "0/0", "author": "Bellatricks"}, {"rating": 5.0, "review": "Very easy to use and have been enjoying watching the programs with Prime.", "verified": true, "helpfulness": "0/0", "author": "Kimberly White"}, {"rating": 3.0, "review": "Not as thrilled with it as I thought I'd be. It's for a guest bedroom that can't be put on our DirecTV system. It doesn't pull the wi-fi signal as well as I had hoped, which can cause jerky streaming at times. Sometimes it's fine.", "verified": true, "helpfulness": "0/0", "author": "Living The Dream \"Stitchintime\""}, {"rating": 5.0, "review": "So far, exceeds my expectations. Beats all, similar products.", "verified": true, "helpfulness": "0/0", "author": "Chiabuli"}, {"rating": 5.0, "review": "I received the Fire stick as a gift. I know nothing about any other streaming devices. The Fire does what it should. It brings together most streaming sources into one convenient location. You sign into your accounts and there is all the content available, no muss, no fuss. The only small glitches were a game or two that either didn't download or took a long time. I'd also like to see more free games, although the main purpose of this is not games, but media, they are a nice diversion. We are not big gamers in our house,(we own zero game systems) so  this is a way to at least have some options. The remote is perfectly sized and not hard to use, a big plus. All in all a winner!!", "verified": true, "helpfulness": "0/0", "author": "MKersey"}, {"rating": 4.0, "review": "I'm having difficulty with its wifi capability.  I've used a Roku and iPod touch while the router was on a floor above the television.  The Fire Stick periodically rebuffered, which was annoying! Otherwise, it's pretty simple to use and very portable.  Amazon needs to improve its wifi ability.", "verified": true, "helpfulness": "0/0", "author": "Philip A. Deluccia \"pdrph\""}]