[{"rating": 5.0, "review": "I. LOVE. IT!!!!! :D", "verified": true, "helpfulness": "0/0", "author": "Curtis Brown \"Curtis Brown\""}, {"rating": 5.0, "review": "From an owner of the full size Fire TV.  I got this one for a second bedroom expecting the same interface and same ease of use in a cheaper smaller package.  That's exactly what it delivers.  I am running the power for mine off the USB \"service\" port on my TV with no issues at all.  The interface seems to be the same as the Fire HD full size box.  The only difference is the remote so far.  I did not opt for the more expensive microphone remote.  Otherwise it's just fine.  What's a big plus, is they give you a small 3-4\" HDMI \"dongle\" cable in case you need it.  My TV needs it as the back has low clearance.  With the dongle I can bend the stick to hang down flush with the back of the TV.  Response and speed seem OK, I haven't had enough time with it to say if it's much different than the Fire TV.  Video quality was excellent on both Netflix and Amazon Prime videos.  It synced up to my \"N\" wireless network with no issues at all.  Truly a plug-n-play install.  One note, the default video resolution was set to 720p on my TV.  I bumped it up to 1080p 60hz with no problem.  Just keep this in mind if your TV is 1080p, you might have to set this manually.A really nice feature, is that all of the Apps that I had downloaded on my existing Fire TV were shown and click able .  When clicked they downloaded and installed on this device.  Very convenient!This TV used to have a ChromeCast on it, which while nice, lacked a proper remote.  I found it much easier to control the Fire TV with the nice small remote rather than having to mess around with my tablet or smart phone.  Also the Fire TVs have a much wider app selection than what ChromeCast currently supports.The Fire TV Smartphone app is nice, if you would like to use a \"keyboard\" to perform searches.  Controlling the screen with slide / touch / tap is neat, but I personally prefer the remote's hard buttons.", "verified": true, "helpfulness": "0/1", "author": "SJGreg"}, {"rating": 5.0, "review": "Amazing. was tired of streaming netflix on my Nintendo Wii this fire sticks offer HD streaming everything so amazing and this fun stupid little games on it too also TwitchTV is nice and plex need i say more chromecast is good but not as good as this", "verified": true, "helpfulness": "0/0", "author": "Clayton Collins"}, {"rating": 5.0, "review": "I love Amazon Fire TV Stick better than Roku!!", "verified": true, "helpfulness": "0/0", "author": "Igi M."}, {"rating": 1.0, "review": "The sound and picture doesn't match. It's very annoying.", "verified": false, "helpfulness": "1/2", "author": "Alex T"}, {"rating": 1.0, "review": "I am employed in computer technology, and have set up at least a dozen Roku and Chromecast devices. The Amazon FireTV Stick has been impossible to use. It did not have my Amazon Prime account preloaded (as I ordered it directly from Amazon), and trying to put in my true credentials (note that I am able to correctly log on to my Amazon account here) goes in an endless prompt where I have tried every possible combination. Troubleshooting by changing my account password and wireless networks have been done, I've lost hours to just get started using it.", "verified": true, "helpfulness": "2/4", "author": "IBMMuseum"}, {"rating": 5.0, "review": "Got 2 when they were on sale for $19.  Great buy!  Used one to replace a bedroom roku that started buffering all the time.  No buffering issue at all with the Fire Stick.  The menus are better too on Netflix and Prime.  No problems at all so far but will update if any issues arise.  I also have a chromecast dongle and is great for casting from my computer to the tv but the Fire Stick has it beat if you are going to use it mainly for watching movies etc because of the remote it comes with.", "verified": true, "helpfulness": "0/0", "author": "fatcatdeals \"fatcatdeals\""}, {"rating": 3.0, "review": "I'm giving this stick 3 stars why because its not really wireless it really needs to be plug in to really work well other then that its pretty fast it out beats roku and Chromecast 100%", "verified": false, "helpfulness": "0/1", "author": "noah"}, {"rating": 4.0, "review": "I thought I would give this a try. At the pre-order price of $19 I figured I couldn't go wrong.  I always take my Kindle Fire and a HDMI cable when I go to a hotel, so that I can watch my selections from Prime, Netflix, PBS etc. instead of the junk that is on regular TV.  I have an older Kindle Fire that doesn't \"fling\", so I have to be tethered to the TV with a cable.  I thought the Fire TV Stick would allow me to leave the HDMI cable at home.  What isn't clear in the pictures or the description is that the Fire TV Stick has to be powered from an electric outlet.  Not every hotel room has an electrical outlet (that you can reach) close enough to the TV to allow the Stick to be plugged in.  So, I would not be saving any room in my suitcase because I would have to bring along an extension cord in case I need it.  No worries,  the way I do it now works for me.I have been using ROKU at home for years, ever since it came out and it works fine.  I have been using the Fire TV Stick at home since I received it and I really like the interface, once I got used to finding my way around.  The Fire Stick has some things that ROKU doesn't, like some interesting apps, games and the ability to view my own photos that are stored on Amazon cloud.  You can even use your photos as a slide show and/or screen saver.  You also have access to any of your music that is stored on Amazon cloud.ROKU has a ton of channels, but face it, most of them aren't anything that you want to watch.  The Fire TV Stick comes from Amazon, so it is geared towards Amazon content.  Other \"channels\" are apps that you have to add, but it is easy to add them.  Just make sure you have all your username/passwords handy when you go through set-up.Since I was one who got in on the pre-order special, I am sure that all of the early released sticks were beta versions because mine had to update software for about 20 minutes when I plugged it in.  It has worked fine since then.I think that if I was new to streaming video, I would get the Fire TV Stick over ROKU.  I have not tried Fire TV, so I can't compare it.  At $39 the Fire TV Stick is a great way to stream for very little money.", "verified": true, "helpfulness": "0/0", "author": "Buzzard"}, {"rating": 3.0, "review": "Overall works decent, additional power source is somewhat annoying and wifi antenna feels lacking.I purchased it for the promotional $19.99 so overall I'm happy but if you're looking to purchase this at the price point of 39.99 don't.Spend the extra money and get the full size Fire TV box minimum or look at other products.Also just a side note, I have the full size Fire TV box as well and it works flawlessly, no regrets there.", "verified": true, "helpfulness": "1/1", "author": "Matt Moore"}]