[{"rating": 5.0, "review": "If this device supports the Arabic language will be the turnout is too much .. I hope that this will soon be achieved", "verified": false, "helpfulness": "0/1", "author": "nrs1403"}, {"rating": 5.0, "review": "Awesome device, streams all my movie and tv episodes without having to be subjected to annoying commercials.", "verified": true, "helpfulness": "0/0", "author": "V. Weiser"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Andrew Johnson"}, {"rating": 3.0, "review": "I do like very much but so many of the movies amd television shows are not free, why is that?", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Len Fontes"}, {"rating": 5.0, "review": "LOVE this little thing!! Easy to setup, easy to use, so many choices (being am a Prime member) of movies etc. Then throw in it's not another bulky thing taking up real estate. What's NOT to love?!! It's very convenient to turn the iPhone into a remote... you know, for when the real one gets lost in the cushions... plus the added benefit of voice recognition. Also so darned handy to transport to another TV in the house. All & all, couldn't be happier!", "verified": true, "helpfulness": "0/0", "author": "L. M. Dambold"}, {"rating": 5.0, "review": "Fire you cable! This it cheap and great!", "verified": true, "helpfulness": "0/0", "author": "Matt Marshall"}, {"rating": 4.0, "review": "It was easily set up and with some experimenting I was able to select the movies I wanted but some of the movies are not yet available on prime so you can select them and place them on your wish list but I have no idea how long it will take until they are available.  It is nice to find a movie that I haven't seen in a long time and watch it again.", "verified": true, "helpfulness": "0/0", "author": "Denise Winslow"}, {"rating": 1.0, "review": "the accessibility to programs and movies is fantastic however the sound does not come through my surround it only comes from the television speaker it kind of sucks to watch a movie and knowing it's an 5.1 surround and all I get is sound from the small speakers in my television. I have one online I've asked people I've contacted cable company to find out is there anyway I can get it to run through my surround and doesn't seem like that's possible so anyway it is what it is maybe the next generation f havI'll fire stick will have that  capability......", "verified": true, "helpfulness": "0/0", "author": "R.J.Vance"}, {"rating": 5.0, "review": "Completely awesome.", "verified": true, "helpfulness": "0/0", "author": "Matt Lillig"}]