[{"rating": 5.0, "review": "Fantastic... Now I use the upstairs tv instead of my laptop... Priced affordable enough for every room!!", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 5.0, "review": "Very Good!", "verified": true, "helpfulness": "0/0", "author": "Forrest H."}, {"rating": 4.0, "review": "The Fire Stick is easy to set up.  It is very self evident and you get it right almost immediately.  I only give it 4 stars because the interface requires a bit of work. You have to Google or search in the Amazon site for directions to access apps, games, and other programs.  I found that the Apple TV was much more user friendly but liked the small size for using when I travel.  With practice, it is not difficult to access programming but the search bar/key needs to be fully outlined at the top and not hiding somewhere in the programming lines. Further, setting up a pin code requires you to use the remote to access what you purchased and the directions for that are not immediately easy to understand.Overall, a I like the Fire Stick but you need to play with it to use it without wanting to throw the remote at the tv.", "verified": true, "helpfulness": "0/0", "author": "Electronics gal \"Vicky\""}, {"rating": 5.0, "review": "Excellent. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Cherylgirl"}, {"rating": 1.0, "review": "I would avoid this product at all cost. The sticks performance was the worst of any streaming device I've usedYou will spend more time watching it buffer than you will a program, and that is if you get the remote control working.Amazons brilliant support department suggested I change the batteries. Thanks Amazon, what would I do without you?", "verified": true, "helpfulness": "0/0", "author": "Rhett O'Donnell"}, {"rating": 5.0, "review": "If you have Amazon Prime (or even Netflix and others) this is the easiest way to enjoy those services.  I simply plug it in to my receivers' front panel input (and front panel USB power with a short power cable), and go.  I can take it to any of my 4 receivers in the house and do this.  Great for guest rooms as it is easy to select with a receiver input and then easily use by most people.", "verified": true, "helpfulness": "0/0", "author": "Kitty"}, {"rating": 5.0, "review": "Love the firestick! Easier to use than Smart tv choices!", "verified": true, "helpfulness": "0/0", "author": "Janet Kennedy"}, {"rating": 4.0, "review": "Offer a variety of TV shows.", "verified": true, "helpfulness": "0/0", "author": "Milton Abram"}, {"rating": 5.0, "review": "Nothing but The BEST!!! Amazon done it again! I have two of these fire sticks one in our bedroom the other outside under our porch. The one for the porch is awesome! We have no cable for our outside porch just our fire stick two thumbs up! The one in our bedroom just as good as the one out in our porch. Great movies great entertainment", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "I just love it. I do not have cable where I live in the country but I do have dish satellite.  I just bought the fire stick and with a 30 day free trial of prime I can watch all my favorite programs now.  I am disable at home and having decent TV to watch is heaven.", "verified": true, "helpfulness": "0/0", "author": "Daveena K. Michael"}]