[{"rating": 3.0, "review": "Slow to load compared to our Apple TV, not very intuitive remote commands, and worst of all, EVERY time I turn the tv back on to watch I get a blank grey screen. I have tried all the troubleshooting suggestions with no avail - the only solution I've found is go unplug the power to it. Super bummed about this product.", "verified": true, "helpfulness": "0/0", "author": "meschatts"}, {"rating": 5.0, "review": "Works great,easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Fantastic little gizmo, you get so much just plug and play. Connected with Prime it's the best TV deal out there.", "verified": true, "helpfulness": "0/0", "author": "Lotus Factus"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "harriet zamudio"}, {"rating": 5.0, "review": "A few minutes to set up and off you go. Intuitive controls and ease of use.", "verified": true, "helpfulness": "0/0", "author": "Tom M."}, {"rating": 3.0, "review": "I love all the choices however I don't like when weather is bad the stick continues to buffer.", "verified": true, "helpfulness": "0/0", "author": "Eva Phelps"}, {"rating": 4.0, "review": "I would rate higher if it would allow for my tuners to be available just as in \"Windows Media Center\" with the \"Recorded TV available to me as well as the TV Guide.  The remote is superb.", "verified": true, "helpfulness": "0/0", "author": "Goobz34"}, {"rating": 4.0, "review": "I would prefer not to plug it into an outlet.  Roku products do not have to.", "verified": true, "helpfulness": "0/0", "author": "John R Lindley"}, {"rating": 5.0, "review": "I absolutely love my Fire TV stick! I have owned several Roku's and recently purchased an Apple TV in order to access HBO Now. My favorite device between them all is this simple and powerful device. The streaming quality that this product provides outperforms all of the other devices I own because Amazon managed to pack 4x the storage and 2x the memory.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Received it for father's day, and I love it. Very easy to setup. Lots of movies and TV shows. Definitely worth it. Only downside is you have to pay for some of the shows, even if you have a Prime account.", "verified": true, "helpfulness": "0/0", "author": "james coerper"}]