[{"rating": 5.0, "review": "This makes the fact that we only have one cable box a non-issue. We can watch TV and movies from a television that's plugged into the wall only. Big fan of the technology. I have a prime membership which is a must so that you can get all the free movies/shows.", "verified": true, "helpfulness": "0/0", "author": "Anna Childson"}, {"rating": 5.0, "review": "Easy setup and great content.. It works with 5.0 wireless so if you have a 801.11ac router it is very fast. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Walter Shoup"}, {"rating": 5.0, "review": "Love it. I kicked cable to the curb over a year ago. Just got tired of paying up over $140/MO for tv.....I am completely satisfied with the choices I get from Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "gerard c torchio"}, {"rating": 5.0, "review": "OMG..... This is the best thing ever. I am so addicted to this fire stick.I  have even taken off a day of work to get extra time and was late to church. I was not expecting it to be so user friendly. I am technology stupid. I feel empowered. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "taunya Looney"}, {"rating": 3.0, "review": "We got this as a Christmas gift.  I thought we would get a lot more movies for free.....there are free movies but they are ones that are typically available with cable or on the network stations.  If you didn't have cable, I am sure I'd feel differently but we haven't cut the cable cord yet.  So, I would rate it OK.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "When watching a movie it will stop to refresh 5-15 times.  When that is not happening I get messages  like \"You are not connected to the internet\" and others.  I know it is not my equipment because I also have Chromecast on  and I have none of the same problems.", "verified": true, "helpfulness": "1/1", "author": "Donna Stull \"loosing\""}, {"rating": 5.0, "review": "We love it!  Easy to install and user friendly!", "verified": true, "helpfulness": "0/0", "author": "Marilyn Gartley"}, {"rating": 3.0, "review": "It advertises hundred of thousand of movies available; however, I have only found a few (less than 100) available without a charge.  There are lots of TV  series but I am not interested in viewing these.  I was hoping for more movies without a charge", "verified": true, "helpfulness": "0/0", "author": "jan sallee"}, {"rating": 5.0, "review": "What a neat product!  The size of a usb stick, but contains apps and images and a good solid program!  My only complain is some of the menu layout and function, but it's still completely usable and fairly user friendly.  I bought this as a pre-order, so it was super cheap.  Cannot beat the quality for the price.  It allows me to use Amazon video and iheartRadio  a lot more now that I can use it on my tv.", "verified": true, "helpfulness": "0/0", "author": "A. Shepard \"Rural Art Mom\""}, {"rating": 4.0, "review": "I am a ptime member and think they should put out a book on how to operate ,it took me 2 days to download music,and i still dont know how to delete my mistakes.", "verified": true, "helpfulness": "0/0", "author": "Ed"}]