[{"rating": 5.0, "review": "This product is great! It was easy to set up to remotely control via my Android phone, easy to setup in the first place, and has a great interface for viewing Amazon Prime videos. I have used it for YouTube videos too, but mostly bring them up on my phone then have it broadcast on the FireTV stick. That seems to be the quickest method. We got a free Chromecast and I like it less than the FireTV stick. Note that Chromecast can only watch Amazon Prime videos via a hack of playing it on the Amazon Video app and broadocasting what's on your phone/tablet screen. That was per Google's instructions! Keep that in mind if you're comparing the two for your streaming needs. We also happened to get this product during the $20 sale and we have gotten a ton of use out of it with my daughter.", "verified": true, "helpfulness": "0/0", "author": "Sean T. Martin"}, {"rating": 5.0, "review": "Right out of the box it worked. I would recommend purchasing Prime for the free movies and TV shows. We have not purchased any movies but have used our Prime account. There are several recent movies available to watch. If you are looking for an alternative to watching TV. it works fine. There are several movies and TV shows on Prime. You also have the opportunity to watch movies that would normally not be in movie theaters locally.My wife and I are watching more on the Fire TV Stick then we are watching on cable. We get to pick and choose what we want and watch when we have availability.", "verified": true, "helpfulness": "0/0", "author": "Shannon Lennie"}, {"rating": 2.0, "review": "I get bad connection all the time. Is there a way to boost signal", "verified": true, "helpfulness": "0/0", "author": "Rick Joyce"}, {"rating": 5.0, "review": "I love this little stick. Easy to use and the interface is nice. Connecting to my network was really easy. I received package before expected date which was a plus too.", "verified": true, "helpfulness": "0/0", "author": "Allen A. Manansala"}, {"rating": 2.0, "review": "I've had problems with the antenna from day one.  It works most of the time if it's in the same room as my wifi source, but one room over and it drops completely.  Lately it's even been dropping occasionally from the same room.  Features are nice, but I would trade for reliability.  My Apple TV works flawlessly", "verified": true, "helpfulness": "0/0", "author": "Warriorpoet"}, {"rating": 5.0, "review": "I love it...I am truly enjoying watching my Netflix movies with it..", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great for tv in kitchen.", "verified": true, "helpfulness": "0/0", "author": "VA Steven"}, {"rating": 5.0, "review": "Very good product...worth every penny...very fast ..does what it says it does....", "verified": true, "helpfulness": "0/0", "author": "Richard Smith"}, {"rating": 5.0, "review": "Easy, Affordable and Wonderful!", "verified": true, "helpfulness": "0/0", "author": "Diana Mera"}, {"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Jo Ellen Schmid"}]