[{"rating": 5.0, "review": "By far it's the one of the best chose I made today. The Amazon Fire TV Stick is great for someone like that travel but still can make a good use at home.FastClear picturegreat price", "verified": true, "helpfulness": "0/1", "author": "RedSOX"}, {"rating": 4.0, "review": "My only couple complaint is that the remote is a bit flimsy, and the fact that they should include a small broshure of what all you can do with the fire stick. BTW who ever wrote in their review that it's difficult to get the battery compartment open, they were 100% correct. I had to resort to using the point of a steak knife to slide the copartment door back.", "verified": true, "helpfulness": "0/1", "author": "Rene Triay \"Rene\""}, {"rating": 5.0, "review": "I'm really enjoying my Fire TV Stick. I usually just have my older laptop hooked up to my TV instead of cable so never really saw the need for an  internet TV device. Since I have Prime anyway & wasn't using the TV/video portion, I figured why not check it out. Also Netflix has started running crappy on my old model laptop and now with Fire TV Stick, it runs great. I'm only a week in, and I don't have previous experience with other internet TV devices, but so far I can say for the low cost, this device is great!", "verified": true, "helpfulness": "1/2", "author": "Randi B"}, {"rating": 5.0, "review": "Outstanding Product !! Very convienant when Traveling im never without good TV to Watch..", "verified": true, "helpfulness": "0/1", "author": "Richard Doctor"}, {"rating": 1.0, "review": "I've never felt compelled to write a review for anything, but here we are. After my PS3 crashed and burned on me, I was in desperate need for an affordable device to do all of my streamings. After asking around and doing minor research, I figured this was the best bet. I now have a $39 paperweight. Except I don't think it will weigh down any paper. To be fair, I primarily only use 3 apps and here's what I encountered with them:Hulu Plus: Video Playback freezes up every few minutes, but the audio keeps playing. Thinking it was my internet connection, I tried various methods of stick/router positioning and even went far enough to upgrade my internet speed and it made no difference at all. Of course, I've never had problems streaming anything on other devices before, so that probably wasn't the problem. It's the stick.MLB TV: Literally unwatchable. Framerate drops every 10 seconds. You can't even follow anything. I've gotten better streams out of an original Roku. I'm actually better off patching my laptop through the TV, which is something I didn't think I would EVER have to resort to.HBO GO: For some reason, my cable company is one of the few that doesn't support this on the Fire Stick, which makes no sense. Oh wait, they must really hate the Fire Stick, too! Okay, that does make sense. Never mind. No it doesn't.So I have absolutely no use for this stupid thing. If only I could return this back to Amazon under the clause of it having no worth. Congratulations. You took more of my money. I didn't think that a company that I've respected after all these years would endorse something so terrible, but hell, maybe I should re-think my life choices.", "verified": true, "helpfulness": "0/0", "author": "TeeCoZee"}, {"rating": 5.0, "review": "Exceeded my expectations", "verified": true, "helpfulness": "0/1", "author": "llewellyc"}, {"rating": 5.0, "review": "Way better than other makers", "verified": true, "helpfulness": "0/1", "author": "Kerry P."}, {"rating": 5.0, "review": "Excellent...thinking of ditching cable!", "verified": true, "helpfulness": "0/1", "author": "Rebecca G. Flynn"}, {"rating": 4.0, "review": "I enjoy watching more movies and mini seires. I don't understand why old movies like Midway cost money.", "verified": true, "helpfulness": "0/1", "author": "barbara sherman"}, {"rating": 5.0, "review": "It's a good tv box to start with.  I used it on my kid's TV so they can watch neflix kids movies.", "verified": false, "helpfulness": "0/1", "author": "Mark Robertson"}]