[{"rating": 4.0, "review": "We cut the cable, we are using it with sling TV they're new so there is a lot of bugs still. But for the price it is an excellent choice for me.", "verified": true, "helpfulness": "0/0", "author": "Rene Hernandez \"ranarene\""}, {"rating": 4.0, "review": "We like it.  Seems to do the job.", "verified": true, "helpfulness": "0/0", "author": "C. Olofson"}, {"rating": 5.0, "review": "Had a Netflix account and just did not find what I liked on it.  This is so much better and if for some reason I would like to get my Netflix account back the Fire TV Stick is compatible.  The whole family enjoys it.", "verified": false, "helpfulness": "0/0", "author": "Clara Peck"}, {"rating": 5.0, "review": "The firestick is awesome!  Between my prime account, netflix and hulu plus I get all the tv I want for less than $30 a month.  Bye bye high cable bills!", "verified": true, "helpfulness": "0/0", "author": "Sherry S."}, {"rating": 3.0, "review": "It seems to spend a lot of time rebuffing(I think thats what its called), the picture just stops until it seems to catch up to itself.", "verified": true, "helpfulness": "0/0", "author": "putback"}, {"rating": 5.0, "review": "Easy setup - works as advertised. Happy to have it.", "verified": true, "helpfulness": "0/0", "author": "Long time User"}, {"rating": 2.0, "review": "Device seemed cool nice and snappy but the problem comes when you plan to watch a movie it freezes after around 30 min of play time.", "verified": true, "helpfulness": "0/0", "author": "david"}, {"rating": 5.0, "review": "This is a more convient way to watch my favorite shows and movies from Prime. Great idea, and simple to use! It has many different add one as well. The only one I seem to have a problem with is Netflix .. It seems to have issues with the internet. Thank you for making my TV time more enjoyable!!", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 4.0, "review": "Almost perfect!", "verified": true, "helpfulness": "0/0", "author": "R. Smitherman \"Mr. Reads too much...\""}, {"rating": 5.0, "review": "Easy to plug in and get it to work.", "verified": true, "helpfulness": "0/0", "author": "Bernard Luscans"}]