[{"rating": 3.0, "review": "I'd give the Fire TV Stick 5 stars in a heartbeat but for one problem: it is nearly impossible to slide open the battery cover on the remote control. I can easily open the battery cases on all the other remotes I own, but I actually bruised my thumb trying repeatedly to slide open the battery cover in vain. I actually had to take the remote with me when I went shopping and ask a large, strong stranger to open it. It took him a solid 5 minutes of working at it before he was finally able to force it open. I can't be in a situation where I have to leave home to find someone strong enough to slide open a simple battery cover. I even returned the original Fire Stick and remote, thinking that the remote must be defective, but I've just received my brand new replacement and I'm having the same problem with the new remote. Clearly it's a design problem. It's a shame; other than that, the Fire Stick is wonderful: the setup is quick and easy, the user interface is intuitive and simple to use, and the price is right.", "verified": true, "helpfulness": "0/1", "author": "wolfemom"}, {"rating": 1.0, "review": "Sadly my experience was completely different than those with a successful streaming through the Fire stick. I was truly looking forward to see Amazon's original content which is the main reason why I bought this instead of going with Apple TV. The first stick didn't work so after troubleshooting while on the phone with a customer rep, Amazon decided to replace it. 2 days later same issue but different stick. 1.9 hrs on the phone was not enough to fix the issue. Both sticks have been returned with no clear explanation from Amazon about why none of the sticks worked. Disappointed mostly because you bet for company like Amazon to deliver and offer a more affordable option but sadly I just confirmed that by paying the extra buck for Apple TV will give me the quality that Fire Stick lacks.", "verified": true, "helpfulness": "1/1", "author": "iDork"}, {"rating": 5.0, "review": "I love my Fire Stick Not only do I use it at home but at work, I work at a Country Club and when we have children activities This is so convenient to plug into the TV and watch free movies. Love it..Oh and if you have children its definitely A must have.", "verified": true, "helpfulness": "0/0", "author": "Lizabeth Snodgrass"}, {"rating": 5.0, "review": "Great device I'm glad I ordered it.  Thanls", "verified": true, "helpfulness": "0/0", "author": "Jerry Smith"}, {"rating": 5.0, "review": "I bought this to use at my parents house. I personally own several other \"stick\" style casting devices and I feel the Fire TV Stick has a level of ease that some of the others don't. For me, a tech savvy person, it doesn't really matter. But, for my parents, the easier it is to use the better and they are happy with this little stick.", "verified": true, "helpfulness": "0/0", "author": "R. J. Wilson"}, {"rating": 5.0, "review": "works better than my chromecast. I have a smart tv but the Amazon app sucks on it. Everything works better on the stick", "verified": true, "helpfulness": "0/0", "author": "Tryan42"}, {"rating": 2.0, "review": "I was really looking forward to this device, and will probably end up keeping it and hoping for a firmware upgrade.  I bought it because I liked the idea of having one stick that would let me cast my windows 8.1 tablet's screen onto a hotel TV, and let me use my Netflix and Amazon Prime accounts in hotels too.  It works great at home, but despite the labeling it is NOT Miracast capable at this point. It is also no good on any wifi account where you have to open a web browser and sign in (hotel rooms for instance).  It works great on a home Access Point where you simply furnish a password.", "verified": true, "helpfulness": "1/1", "author": "Bob Musser"}, {"rating": 1.0, "review": "I removed it from my tv because it conflicted with my Apple TV", "verified": true, "helpfulness": "0/0", "author": "DaKind"}, {"rating": 1.0, "review": "I just can't get the Fire Stick to maintain a wifi connection.  I think the Wifi sensitivity in the stick is very poor.  I have an Apple TV (under some shelving) within two feet of the stick and there have never been any problems with that device getting on either of my wifi routers.  For the longest time I couldn't get ANY wi-fi connection on the stick.  Finally, and intermittently, I got one of the routers to appear, but it lists the connection as \"Fair.\"  Also, the one time I was able to stream an Amazon Instant video the quality wasn't that good (probably because the wifi connection wasn't that good).  Considering this device is usually plugged into the back of a TV and has to stay there (because the included adaptor is only a few inches long) you would have thought that the wi-fi sensitivity would be much much better.  There are enough complaints on Amazon forums to make me realize that I don't think I just got a one off defective stick.  I was on a combination of Amazon customer chat, email, and phone calls and they couldn't help.  They basically kept telling me to reset it and unplug it.  None of which really helped.  I wish I hadn't bought it, but there's just not many accessories to get Amazon instant to your TV since Apple TV and Chromecast don't have the Amazon app.  But I'm surprised that so many people like this and have reported no problems.", "verified": true, "helpfulness": "1/1", "author": "Flatfooted"}, {"rating": 5.0, "review": "Amazon has really stepped up their game with the Fire Stick, always works better than my Apple TV", "verified": true, "helpfulness": "0/0", "author": "N. Serrano"}]