[{"rating": 5.0, "review": "Awesome device. Got rid of my high priced cable and enjoying SlingTV", "verified": true, "helpfulness": "0/0", "author": "Nancy Ramsey"}, {"rating": 5.0, "review": "Love It, best way to watch TV the way you want. Every thing at your fingertips.", "verified": true, "helpfulness": "0/0", "author": "SRose"}, {"rating": 5.0, "review": "It is the best!!!! I can take it from television to television and enjoy it where ever. I'm thinking about purchasing another one!!", "verified": true, "helpfulness": "0/0", "author": "Tony Mayers"}, {"rating": 5.0, "review": "perfect fit", "verified": true, "helpfulness": "0/0", "author": "Rick T."}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Orlando"}, {"rating": 4.0, "review": "Bought two of these while they were on sale for my kids rooms.  They like them, but there doesn't seem to be as many channel options as roku.  I myself prefer the roku, but maybe that's because it's what I'm used to.  The kids have had no complaints.", "verified": true, "helpfulness": "0/0", "author": "invible girl"}, {"rating": 2.0, "review": "Great product when it works. Very aggravating when it doesn't, which is often. Have to restart approximately every 40 minutes. Authorization to play content continues to fail. Overall, great specs, great idea, terrible execution. Very disappointing. Will be returned.", "verified": true, "helpfulness": "1/1", "author": "Bill Stafford"}, {"rating": 4.0, "review": "I have both the Fire stick and Fire TV. They are great for kid shows on Amazon instant video and Netflix is great. Hulu is terrible and it's what we watch most! Please fix the issues with Hulu!!", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 5.0, "review": "Best thing I've purchased from Amazon!", "verified": true, "helpfulness": "0/0", "author": "Ida Perez"}, {"rating": 5.0, "review": "Love love love  it!  Step by step instructions make it's so easy!", "verified": true, "helpfulness": "0/0", "author": "cherylrunyan"}]