[{"rating": 5.0, "review": "Got it today. For some reason Comcast stopped working. Go figure. Easy setup. Remote awesome.  Love the interface. Was wondering how this could be better than Chromecast and it is due to the remote. Already used Netflix and watch Espn.", "verified": true, "helpfulness": "0/0", "author": "TallyShaitan"}, {"rating": 5.0, "review": "Feels as fast as my apple TV. I am an amazon prime subscriber so it was a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Barbara Gomez"}, {"rating": 5.0, "review": "Wow.  Simple to use, and makes our streaming content simple to access.  Even the 7-yr old navigates with ease.  Goodbye Charter!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Got my first one and nothing happened on screen. Input... check... usb power from outlet... check... HDMI extension (just in case)... check... Did everything possible to make this work but I got no image from the stick. I know eventually if this doesn't work I'll get my money back, but it was a huge disappointment. Let's see what happens when I get stick #2.UPDATE: Turns out the stick works but not with my TV. I was able to connect it to a TV at work (a 1 year old Samsung) and it works great there. My home HDTV (a 2011 Westinghouse) is not recognizing it. I am giving it an additional start just because I know it works and I think its a really cool gadget but it doesn't do me any good under my current setup. I will not change my TV for a 20 dollar stick.Amazon... you product is great but it sucks :)", "verified": true, "helpfulness": "0/1", "author": "louisvilleguy"}, {"rating": 5.0, "review": "What a great streaming device. I was skeptical about trying a \"stick\" for streaming but this thing is great. It is super easy to set up and is very responsive.  I wouldn't hesitate to get more for other TV's.", "verified": true, "helpfulness": "0/0", "author": "JS \"JS\""}, {"rating": 4.0, "review": "I got the Chromecast when it first came out and really like it. I consider myself a techie but trying to explain to someone like my wife how to use it just doesn't work. The fact that the Fire Stick comes with a remote and an actual interface is a huge thumbs up.", "verified": true, "helpfulness": "0/0", "author": "W. Millett"}, {"rating": 5.0, "review": "My main concern before using the product was its capability to stream from Netflix and other apps. After getting the Fire Stick installed and using it for the first time I am pleased with its speed and I love how it is already linked to my Amazon account. Probably the best $39.99 I have ever spent!", "verified": true, "helpfulness": "0/0", "author": "Rustin Becklehimer"}, {"rating": 5.0, "review": "We bought two and are really happy.  Had some flickering with one until a software update, but after the installation, all was well.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 4.0, "review": "Great product and outstanding value for money. If only the navigation was as easy as Apple TV, this product would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Cymru"}, {"rating": 5.0, "review": "I've had a chromecast which I love for a while. When amazon announced their fire tv stick I was intrigued. When I saw the special pre order pricing, I jumped at it and promptly forgot about it until it showed up.Setup was slightly annoying because immediately there was an update and a video you couldn't skip on how to use it. Once the update and stupid video were done, you are presented with a very nice interface.Now to use it. The amazon prime interface was nice and lets you want free prime stuff as well as order the more premium content. I generally stick with the free content and it seemed to work well. I also use plex a lot to stream things from my NAS and this worked great, though I had to buy the plex app again.The remote is also a nice touch. I have the chrome cast and it's nice to be able to use my phone but it can also be a bit of a pain at times. It's nice that this doesn't require a phone so you can just hand the remote to someone to use rather than use the phone.I don't know how much I'd use all the other features. I think most people have their photos and music in the cloud with google and/or apple so I'm not sure how willing I'd be to also copy things over to the amazon cloud but I may play with it one of these days.Personally, I think if you have amazon prime and use plex, this thing is worth it just to be able to nicely bring both of those to the tv easily in a nice small package. If I want to show people photos, the chrome cast already has access to my google+ photos so that works better than this. However if I want to watch amazon prime videos, this is clearly the winner. Plex works on both. I think I'll still keep them both, especially considering they are both relatively inexpensive.", "verified": true, "helpfulness": "0/0", "author": "Christopher Flynn \"daytona955i\""}]