[{"rating": 5.0, "review": "For starters,  Amazon.com continues to be the gold standard of shopping in this new millennium. After preordering on the day the fire stick was announced,  I was given a delivery date of December 3rd. Not happy about that,  but suddenly the date changed to a week earlier and then to my pleasant surprise, I received a text that my package would be delivered on Sunday and it was!One I plugged the stick into my TV and the updates updated, I was up and running. This device is amazing. I was looking at pictures and videos from my phone in minutes. I downloaded Plex and was watching content from my computer. This little dongle is just a joy to behold.If you are on the fence, grab this and enjoy.", "verified": true, "helpfulness": "3/4", "author": "Derek A. Price \"Art Director\""}, {"rating": 5.0, "review": "It is an excellent buy!  We were unable to connect to Amazon Prime without it.  Now we're able to see the movies on my watchlist without going thru my computer.  My only concern is if the grandkids lose the remote, we'd be dead in the water.", "verified": true, "helpfulness": "1/1", "author": "Zena Beaulieu"}, {"rating": 5.0, "review": "Work great and easy to install if you have amazon prime. Will be getting rid of cable on two TV's.", "verified": true, "helpfulness": "1/1", "author": "d. cookie"}, {"rating": 5.0, "review": "A lot faster than I thought it would be. It's an automatic if you're a prime member and one of your tv's does not support the prime app.", "verified": true, "helpfulness": "1/1", "author": "Nick"}, {"rating": 1.0, "review": "Dead on arrival.", "verified": true, "helpfulness": "4/7", "author": "VincyNick"}, {"rating": 5.0, "review": "It's amazing. It will be perfect only if you're prime member.", "verified": true, "helpfulness": "1/1", "author": "Thao nguyen"}, {"rating": 5.0, "review": "It worked exactly as advertised.  Very easy to get started.  Meets all my expectations.", "verified": true, "helpfulness": "2/2", "author": "Paul E Mitchell"}, {"rating": 4.0, "review": "Excellent, I really love it. This is a very good streaming media, perfect to make your tv a smart tv, and it is very practical; easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Edwin"}, {"rating": 5.0, "review": "We love it. Very easy to use.  Grand kids find it easier to use than cable. You can easily move it from room to room.  Just ordered 2 more!!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Lucky enough to purchase for $19 pre-sale Prime Members. Set-up was very easy: plugged it in the tv and connected the power cord. The fire stick was already pre-loaded with my amazon account and set-up for netflix and youtube was simple. The menu is good and easy to navigate, could use a little streamline work though. Being a dual-core system the stick does suffer from a little lag in the menus, but the faster systems (Roku3 and FireTVbox) are $100. When loading netflix it is still pretty quick for a dual-core. Streaming was good, 1080P signal and had no problems with WiFi signal. For the price this an outstanding media/internet streamer. For those of you that didn't get in on the $19 sale I see it in store at some electronics stores for only $25. For $25 and up to the retail price of $39 it's still the best streaming stick you can get.", "verified": true, "helpfulness": "0/0", "author": "Loki \"V\""}]