[{"rating": 4.0, "review": "GREAT Finally working , the set up took like forever about 1 hour or more , had to put in my internet password 3 times as the update just crashed on me- the update it self is a long process -  and well the fact that amazon prime video is only for the US is a bummer as i am out of the US , but i only really wanted it for NETFLIX and FINALLLLY its working , you have to update your payment with the device through amazon on a web browser as in you need to go back and forth from the computer to the TV, unless you got a Laptop or a phone , wish it was all a bit more easy- but now its working all is good for now", "verified": true, "helpfulness": "0/0", "author": "MR O"}, {"rating": 1.0, "review": "Experiencing many of the same issues others have noted here; it says connected with problems. I can't figure out what that relates to, as every other device I own works without issue. It stops streaming to buffer, and then sits on 25%, repeatedly (every few minutes (2-3)). It does that so often that it is impossible to even follow a movie or tv program. I have tried everything I can think of, and nothing improves the performance. I can only conclude all of the issues are due to the fire tv stick being \"buggy\", as these issues are unique to it alone. I was disappointed that I only ordered one of these for $19, when I could have had two. Now I am glad I saved the other $19. I will probably hold on to it and hope for a firmware update that works the bugs out.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 2.0, "review": "I ordered one the day it was announced hoping to be able to travel with this instead of taking DVD movies when we travel as a family.  It works well at home connected to  home network, but is not able to connect to an active portal.  It does not have a web browser, so it is not able to connect to free WiFi or hotel WiFi that has an open connection , but requires a web login.  He help chat says they are trying to allow this in future software updates, but it is not currently supported.", "verified": true, "helpfulness": "2/3", "author": "Wayne"}, {"rating": 5.0, "review": "I got mine at the prime cost of $19.99 so I think it's a really great deal. You don't need it if you have a smart TV which I have in my living room but it's really great for the smaller TV I have in the bedroom. It's much easier to use than the controls on my smart TV  or my smart Blu-ray player and it has a lot of fun apps. I'm buying two more for my adult children for Christmas.", "verified": true, "helpfulness": "0/0", "author": "K. L. \"traveler\""}, {"rating": 5.0, "review": "So far I'm happy with the over all results, outstanding picture quality, better than expected audio and the remote control functionality is awesome.", "verified": true, "helpfulness": "0/0", "author": "Herman Carmona"}, {"rating": 1.0, "review": "Will not connect to my password protected wifi network. Since this device needs the internet to work it is completely worthless. I tried every thing they said to do to get it to work even with no luck. DO NOT BUY!", "verified": true, "helpfulness": "0/1", "author": "david saindon"}, {"rating": 5.0, "review": "Works great. I love the interface, and find it easier to use than the Amazon on app on my Smart TV. I fear the switcher may give out if I continue to use it for games though.", "verified": true, "helpfulness": "0/0", "author": "BookWorm620"}, {"rating": 5.0, "review": "It's fast and the video is better than my Roku 2 XS. The UI layout is a little strange and does take some getting used to but the over all experience is outstanding.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "Excellent product. Easy installation and comes with all the apps that I need. For the relatively low price it is a much better option than buying a smartTV.", "verified": true, "helpfulness": "0/0", "author": "Eldridge Powell"}, {"rating": 3.0, "review": "Having a wall amounted TV - please note:  there is a power supply cord that powers the unit.  The commercial fails to mention such......therefore you will have to manage the cord from being unsightly. I feel misinformed.", "verified": true, "helpfulness": "0/0", "author": "James R. Williams"}]