[{"rating": 4.0, "review": "After an extensive comparison with other similar devices (Chromecast, Roku) this was the safest bet. And I'm pretty sure I can say it does the job quite well. Yes they put Prime content upfront I mean, it's their product you know? But you can leave with that.The actual device is actually small (length of a credit card). It could use a longer power cord.The interface could use a little help, it's simple but not as intuitive as I expected; think about it as a tablet/smarthphone; in order to watch content other than Amazon's you'll need to download the individual apps from the corresponding service.I think it's the best of the bunch!...stick-wise talking, I still like my second gen Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Rod Urbina"}, {"rating": 5.0, "review": "Easy set up, works wonderfully! I can get Amazon Prime!! Love it.", "verified": true, "helpfulness": "0/0", "author": "Kris"}, {"rating": 5.0, "review": "I love buy atems at Amazon 👍🏻", "verified": true, "helpfulness": "0/0", "author": "carlos ortiz"}, {"rating": 5.0, "review": "Great price and item - !!!!", "verified": true, "helpfulness": "0/0", "author": "5branch"}, {"rating": 5.0, "review": "I have a Visio Flat screen, non smart tv. Now I do.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"GotaLoveAmazon\""}, {"rating": 5.0, "review": "I had a Chromecast and had so many issues with it. Decided to try the Firestick and absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Deena Galloway"}, {"rating": 5.0, "review": "Very easy to set up in your tv. Great gadget for a great price. Now I can enjoy my Amazon Prime video in my bedroom.", "verified": true, "helpfulness": "0/0", "author": "G. R. Toliver \"rntudz\""}, {"rating": 4.0, "review": "Quick and simple instal with easy access,  made more useful with prime account", "verified": true, "helpfulness": "0/0", "author": "J. G. Billingsley MD \"airdoc\""}, {"rating": 4.0, "review": "Has to have a WiFi network to connect and mirror other devices. Was hoping to use it as a mirror to my android devices but will not connect stay connected with my tablet.", "verified": true, "helpfulness": "0/0", "author": "Kristi Matie"}, {"rating": 4.0, "review": "With Amazon Prime, this is a great gift. However, it is a little difficult getting used to it. Some kind of manual would be helpful.", "verified": true, "helpfulness": "0/0", "author": "Bud H"}]