[{"rating": 5.0, "review": "I have been an AMAZON PRIME member for a few yrs now. I just recently cut the cable /satellite and bought 2 of these Fire TV Sticks so we can have movies/ tv shows / music available to me through my Prime membership. It also has a great selection of apps to choose from. The speed of the interface is awesome. I was able to connect in less that 5 minutes after hooking them to my tv. I was connected to Prime and Netflix and the search is so much faster than using my blueray dvd player . Te blueray took much longer just to set up. I would reccomend the FIRE TV STICK to anyone who has AMAZON PRIME. E ven if you don't, give it a try and use their 30day trial membership. I will save about $800 this yr including the cost of Netflix and 2 FIRE STICKS after that its is just like money in the bank . And who likes talking to customer service of DISH/ DIRECT or the cable company. Amazon Associates are much more helpfull. I want to thank AMAZON for a great experience and product.", "verified": true, "helpfulness": "0/0", "author": "charlie Houghnagle"}, {"rating": 5.0, "review": "Wonderful for retirement!", "verified": true, "helpfulness": "0/0", "author": "Patricia Ann Parrish \"Pat\""}, {"rating": 5.0, "review": "Great inexpensive way to add streaming functionality to my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Jason S."}, {"rating": 5.0, "review": "I love Amazon fire and am quite happy I purchased it. I would buy this product again and again!", "verified": true, "helpfulness": "0/0", "author": "b"}, {"rating": 5.0, "review": "Easy to install. Works well with Netflix and Amazon instant video.", "verified": true, "helpfulness": "0/0", "author": "Sandy in Texas"}, {"rating": 3.0, "review": "I thought it was free program on it everything that's on it u have to purchase if i would have known that I wouldn't have gotten it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I got this baby for myself after Christmas after playing with my sister's Fire TV. I've used it at home and taken it with me when traveling. I adore my Fire TV Stick. I have two monitors on my PC, but I decided to plug my Fire Stick into my extra monitor. I have Prime and have purchased some shows and movies through Amazon in the past and now I've got everything all together and I can take it anywhere and plug it in. I've run into issues where it's playing then boom, says I'm \"connected with problems,\" but that's usually when I know I'm in a room of the house that is barely in range of WiFi. Other than that, I love how it starts right where I left off if I have to pause and walk away for a while. I only have one small complaint - so I headed to Dallas and took my Fire TV Stick with me because the room I stay in has a TV but no cable/dish. But, I realized once there, I forgot the remote. Had I thought before I left, I could have downloaded the Fire TV remote app and voila. Unfortunately, I hadn't thought about that aspect, so I had a Fire TV Stick, but no way to connect to the WiFi without a remote, so I had to order another remote and rush delivery in order to use it while I was away. It would be nice if you could access it using the app even if you hadn't synced it before. I would think I could log into the app and pick my Fire TV Stick and boom, it knows - but that's not how it works... Without a remote, it's useless. So now, I have two remotes AND the remote app so no matter where I go, I should be all set.", "verified": true, "helpfulness": "0/0", "author": "TMB"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "R. Graziano"}, {"rating": 5.0, "review": "Amazing!!!!  Not sure why I didnt do this before now.  Bought one for both TV's.  Love this thing!!", "verified": true, "helpfulness": "0/0", "author": "D. Milbauer"}, {"rating": 5.0, "review": "I only use the netflix app for the bedroom TV but I love it. It's simple and virtually no setup required.  I would suggest this product for sure.", "verified": true, "helpfulness": "0/0", "author": "Dana M. Russell \"Dana\""}]