[{"rating": 5.0, "review": "LOVE THIS THING! EASY TO INSTALL... EASY TO USE... SO INEXPENSIVE! :):):):):):)", "verified": true, "helpfulness": "0/0", "author": "linda martino"}, {"rating": 5.0, "review": "I love this, not sure why I didnt buy this years ago.  replaced a chromecast on my main tv.  Side loaded kodi, works great.", "verified": true, "helpfulness": "0/0", "author": "Milton S. Soditch"}, {"rating": 5.0, "review": "Great device!What no one seems to mention is that the stick works like an antenna and needs to be visible. If you have it plugged in behind your tv, you will have streaming problems. Buy an HDMI extension cable so you can route it to sit above, below, or on the side of your tv. Wi-Fi signal has a hard time connecting if it has to penetrate through your tv.", "verified": true, "helpfulness": "1/1", "author": "S. VAU"}, {"rating": 5.0, "review": "I was fortunate enough to receive this using reward points from my job.  This is one of the best choices I could have made.  I watch just about everything on it and if you are going to buy one do yourself a favor and become a prime member.When I first bought it I thought that all I had to do was charge it and stick it into my tv but I watched a youtube video about it and realized that it needed to remain plugged in.  Once I had that part figured out the set up was easy.  The Fire TV stick basically walks you through everything you need to do.  Prior to this I was using my Wii to watch Netflix and Amazon Prime and it seemed to always freeze on me.  With this I do not have any freezing and the picture quality is also good.  I highly recommend buying one!", "verified": true, "helpfulness": "0/0", "author": "Crystal Kessling"}, {"rating": 4.0, "review": "Just purchased the Fire TV Stick (Best Buy). I'm really pleased... video quality is nice... being able to skip ahead/backwards 10 seconds feels like a TiVo (it doesn't tend to stutter/rebuffer like some other boxes). This may be an Amazon Instant only feature... but I like it. I bought it for streaming primarily... though PacMan 256 and Crossy Road are amazingly entertaining. I've issued voice commands from my iPhone app and the results are quick and correct. I haven't tried streaming local content yet (Plex).. I like having that option.The can continue to improve it (search across all services)... but its an excellent start.", "verified": true, "helpfulness": "0/0", "author": "Alan L Sibley"}, {"rating": 4.0, "review": "Not too sure about this yet", "verified": false, "helpfulness": "0/0", "author": "Lalit Bhatia"}, {"rating": 5.0, "review": "I AM GETTING RID OF MY TV CARRIER BILL AND BOUGHT THIS TO ADD ON THE EXTRA BEDROOM TV AS I ALREADY OWN AND LOVE THE AMAZON FIRE BOX LOVE THAT TOO. EASY TO INSTALL KIDS CAN PLAY APPS WE CAN WATCH MOVIES & TV I AM ALREADY A PRIME MEMBER SO THIS ENABLES ME TO TAKE ADVANTAGE OF THE BENEFITS I ALSO BOUGHT THE ADDITIONAL VOICE REMOTE BECAUSE IT IS SO EASY TO USE.!!", "verified": true, "helpfulness": "0/0", "author": "carol"}, {"rating": 5.0, "review": "Lots of programs to see on it!", "verified": true, "helpfulness": "0/0", "author": "BDDDS"}, {"rating": 5.0, "review": "Easy to set up and started to use within minutes.", "verified": true, "helpfulness": "0/0", "author": "Mark Jaeger"}, {"rating": 5.0, "review": "How ironic.  This is arguably the most popular device on Amazon that I've reviewed and it'll get the shortest review from me.I love it.", "verified": true, "helpfulness": "0/0", "author": "Scott"}]