[{"rating": 4.0, "review": "Good addition to my HD Panasonic TV.  Still have some problems with bandwidth when watching shows. I have a very hi speed internet connection and still run into problems with maintaining continuation of program and bandwidth problems arise. Not sure if this is Fire Stick or my internet service. Thought I would eliminate this problem with Firestick!", "verified": true, "helpfulness": "0/0", "author": "robert martire"}, {"rating": 1.0, "review": "Was pretty excited to get this. I pre-ordered back when they were on sale and they just showed up in the mail yesterday along with an Amazon Fire Tv (the larger version). Setup was really easy. I primarily got this to watch my Plex library. Bought the app and started my first movie. Worked for 5 minutes and then the movie froze. No network connection. Tried for 45 minutes alternating between my 2.4GHz & 5GHz network (both with excellent signal according to the Fire Stick) and the device failed to ever reconnect to the WiFi. I was also using the included power adapter. Frustrated, I unpackaged the Fire Tv and set it up on the same Tv and the same WiFi network. Have watched a few movies and there have been no problems whatsoever with the WiFi on the larger Fire Tv. It hasn't lost connection once. I'll hold on to the Fire Stick in hopes that a firmware fix is possible to fix these problematic WiFi problems, but for now its back in the box.", "verified": true, "helpfulness": "1/1", "author": "Joe Hemi"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Richard Jacobs"}, {"rating": 1.0, "review": "I had really high hopes for the Fire Stick.  First off, Amazon never shows it as a product that has to be powered by electricity, It needs to be plugged in.  Actually not the end of the world, but I sort of felt that this was not made clear in the advertising.  Secondly, it keeps dropping the signal.  That is a pretty serious issue for a device that streams video.  Now, I could live with this if I felt I had a dodgy wireless network, I happen to have a good one and the device that the fire stick replaced rarely dropped the signal.  Basically this is a downgrade on a Samsung device I put in 4 years ago. Technology has improved over the last 4 years, so I feel disappointed that the fire stick's performance is not better.When the video is working, the interface is very well designed and easy to navigate and the picture is excellent.", "verified": true, "helpfulness": "1/1", "author": "Mickey"}, {"rating": 5.0, "review": "Fantastic product", "verified": true, "helpfulness": "0/0", "author": "Arthur natvig"}, {"rating": 4.0, "review": "I'm only posting this to try and help those with WiFi issues..If you're having problems getting your Fire TV Stick staying connected to the internet, I recommend trying to move the TV Stick to another HDMI port. This worked for me, I went from having a consistently poor connection to really good just by moving it to another port. I know that many of us are unable to do so with certain setups, I just advise you try this before giving up. I also don't know if this limited to a certain batch, or only a few units, I just know that from skimming through the 1-star reviews, this seems to be a pretty common issue. Hopefully this is something Amazon eradicates in future HW revisions, because from what I can tell, software could not fix this.", "verified": false, "helpfulness": "2/2", "author": "mateo124 \"matthew\""}, {"rating": 4.0, "review": "I ordered two of these during the special rate sale. Out of the box it is very easy to install and I used the included adapter because one of our TVs is very close to the wall.I got this mainly because our kitchen TV is a Samsung Smart TV and Samsung doesn't include Amazon Prime as one of the apps.The Firestick works great and is very fast but the menu system is a pain to use for screen mirroring. You have to navigate to a submenu selection to use it. If Amazon put screen mirroring on the main selection choices it would make this a killer device and far more usable. The same applies for the other apps although I can see for that Amazon wants to direct you to their content first.I use screen mirroring all the time so it makes doing that far more difficult than it should be. I would rate it 5 stars if this was as straightforward as it should be. The screen mirroring does work well and I tired it will a Samsung Note 3 and several different ASUS tablets, each connected quickly and the displays worked just as they should.I really liked that Crackle is an included app. Although I haven't used it much previously, since it's included I will use it more often.Note to AMAZON: If you make the HDMI connection point a swivel that would make it the best stick connector on the market. :)", "verified": true, "helpfulness": "0/0", "author": "Red Lightning \"It isn't impossible, you just can't figure it out.\""}, {"rating": 5.0, "review": "This is an excellent product and it is very easy to install. I normally use my PlayStation console to stream Netflix and Amazon Prime. But now that I have the Fire Stick its much more convenient. So far everything I'm watching is streaming at peak performance with no issues. I paid $20 for mine because of the Prime member pre order offer they had last month and at that price it was a definite steal. For $40 retail, it's still worth the price for what it has to offer.", "verified": true, "helpfulness": "0/0", "author": "Oscar R."}, {"rating": 4.0, "review": "A little glitchy and slow, but great replacement for my old Roku.", "verified": true, "helpfulness": "0/0", "author": "TDO"}, {"rating": 4.0, "review": "Set up was easy and fairly straight forward.  It would help to have arrows on the remote on the circle at the top.  Took me a bit to figure out how that worked.  It had to update information when I first plugged in and it took quite awhile for that to complete but otherwise worked fine.", "verified": true, "helpfulness": "0/0", "author": "Deb C"}]