[{"rating": 4.0, "review": "Works great. Easy install. Very pleased. The only complaint is that I wish the remote was easier to see in dark... a button where you can opt for icons to be backlit, perhaps? There's been a few times I hit the wrong button and had to re-navigate to what I was watching.", "verified": true, "helpfulness": "0/0", "author": "Kristy MacWilliams \"Kristy\""}, {"rating": 3.0, "review": "Works great and is easy to use; however, I purchased this thinking I would watch my HBOGO on my tv through my Kindle Fire and that is not possible because it is not compatible with the Kindle Fire that I own.  Your Kindle has to have mirroring on it and mine doesn't.  I guess you need the Kindle Fire HDX.....in the description it just says Kindle Fire and I assumed mine would work.  It will be more worth my while after they add the HBOGO app which looks like is coming in the spring of this year.  If Amazon had explained in the description and listed compatible devises, I would have given this  5 stars and waited to buy it after they add HBOGO.", "verified": true, "helpfulness": "0/0", "author": "amy kamin"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Chante Bradley"}, {"rating": 5.0, "review": "Great little stick, plugged right in to the open hdmi port I had open setup was a no brainer I mean 0 brains required", "verified": true, "helpfulness": "0/0", "author": "Jaspervan"}, {"rating": 5.0, "review": "You'll need a fast internet connection, a free HDMI port and a power outlet.We \"cut the cord\" 14 months ago and regretted losing access to some programming.The FireStick TV has removed all regret. We will never go back to cable and those  $120 per month bills.If you are a cord cutter or just seeking alternate sources of programming, this little device is a giant leap in the right direction.", "verified": true, "helpfulness": "0/0", "author": "M. Sanders"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Holli Keith"}, {"rating": 5.0, "review": "The Fire TV Stick is very simple to install and very simple to use.  The HDMI extension cord works very well as a WiFi antenna, i.e. you save yourself money because you don't need any HDMI cord.  I like to see Amazon have more FREE apps for the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Bill Lee"}, {"rating": 5.0, "review": "High quality product. Very fun, I enjoy that. I have a lot of options.", "verified": true, "helpfulness": "0/1", "author": "João Wagner Lopes de Oliveira"}, {"rating": 5.0, "review": "Just great!", "verified": true, "helpfulness": "0/0", "author": "jeremy register"}, {"rating": 5.0, "review": "Fantastic,works great and lots of movies ......", "verified": true, "helpfulness": "0/0", "author": "Bill K."}]