[{"rating": 5.0, "review": "i like it", "verified": true, "helpfulness": "0/0", "author": "sam"}, {"rating": 2.0, "review": "Laggy.  Netflix is laggy and stutters.  Vevo stutters. HBO now stutters. The main amazon menu and the remote operation isn't smooth and jumps ahead many options when scrolling through.The chromecast does not.Do not recommend.", "verified": true, "helpfulness": "1/1", "author": "Jimmy \"Jimmy\""}, {"rating": 1.0, "review": "I've had this item since mid December and have had nothing but problems with it .It sees my networkand says the strength is excellent butit won't connect most  of the time. I was told to unplug my router and the fire  stick and then reconnect them both. that worked a few times but  I can't always do that. So most of the time when  I go to use it, I'm out of luck. I've tried to stick with all Amazon products so there would be fewer issues but it doesn't seem to be working. Thankthfully I only paid $19. for it.", "verified": true, "helpfulness": "2/2", "author": "fla-gal \"Louiesmommie\""}, {"rating": 5.0, "review": "We love it, it was very easy to set up and use", "verified": true, "helpfulness": "0/1", "author": "Roxy"}, {"rating": 2.0, "review": "When I ordered this, there wasn't any indication that it was on such a long backorder status. Also, I suppose I have only myself to blame, but I was expecting the Voice activation to be standard, which it isn't. I cancelled my order and grudgingly ordered the $84 upgrade, but feel a bit like I was bait and switched...I love Amazon Prime programming, but I'm not likely to buy any more of these \"extenders\" for the rest of the house....", "verified": true, "helpfulness": "0/0", "author": "GLenn Long"}, {"rating": 1.0, "review": "AWFUL.I've never been less satisfied with a product/service.First off, the fire stick always has to be plugged in. You can't charge it and use it wireless. I paid my electrician to run my cable box and all wires from another room and the fire stick has now made that pointless.On top of that, streaming video always pauses. It often says there's no internet connection while saying the connection is strong (the wifi is 10 feet from my tv).\"Free\" shipping: Free two day shipping is great around Christmas but otherwise it's unnecessary. I will often find items cheaper for non-prime customers. I'll then log in and the price is higher for a prime member.Streaming video: the movie selection is God awful. They claim there's so much of a selection but they design the service so you can't browse the entire collection. TV show selections are great.Kindle library: you can't use this service if you're an ipad owner. I'm not going out and buying a kindle.I'd advise to choose another streaming device like Apple TV or chromecast although I have no experience with either.", "verified": true, "helpfulness": "3/4", "author": "Ea$y \"S\""}, {"rating": 5.0, "review": "Good price!", "verified": true, "helpfulness": "0/0", "author": "DANIEL T."}, {"rating": 4.0, "review": "Wors great should have come a book of instructions.", "verified": true, "helpfulness": "0/0", "author": "francis kubecka"}, {"rating": 1.0, "review": "There is way too much buffering.", "verified": true, "helpfulness": "1/3", "author": "Marilyn S. Pease"}, {"rating": 5.0, "review": "So I'm an Apple guy, and I have an AppleTV on every TV in the house. Why do I have a Fire stick and why do I love it? It all boils to two things.First, I have a Prime membership, and I had not watched one movie or TV episode in the last two years of having Prime. I can't watch it on an AppleTV, but now I have access to all the Prime content from the place I actually want to watch it. All the content I have through Apple I have to pay for, but this is content I have access to bundled into the price of a Prime membership I would have anyway. The range of content seems to be growing, so for now I'm not bored.Second, it works like a charm. The internet speeds in my area are not great, sometimes our access slows way down, which stinks for a family that has all their content in the cloud. The Apple TV will often sit there for a while waiting to buffer before it plays. This can sometimes say the expected wait is 20 or 30 minutes. The Fire Stick however will buffer as it goes, and will display a compressed video until it can catch up to HD, then automatically switches over to brilliant 1080. This is an awesome feature when you want to watch the next episode of How I Met Your Mother, and you don't want to wait for the buffering. One other nice feature, speaking of TV episodes, is that you can hit play once and it will keep playing right into the next episode - Apple makes you select the next episode manually - not a big deal, but super convenient for binge watchers.", "verified": true, "helpfulness": "0/0", "author": "Burgess Family \"Shane\""}]