[{"rating": 5.0, "review": "Ok, came in as described, on time in good shape", "verified": true, "helpfulness": "0/0", "author": "Gerald Ellison"}, {"rating": 5.0, "review": "I previously streamed Netflix and Amazon Prime through my BluRay player.  However the performance was very sketchy, working sometimes, but more times than not there was stuttering and loss of connection.  That is what prompted me to get the Fire TV Stick.  The Fire TV Stick is a breeze to set up and operate.  Out of the box, Netflix streamed beautifully with no issues.  However, Amazon Prime Video had some problems by dropping the connection periodically.  I did some research as to the cause of this and found a suggestion to change the display resolution of the Fire TV Stick from 1080p, the setting it was at, to 720p.  Once this was done, Amazon Prime Video no longer has any issues streaming.  I am very happy with this product and plan to get it for other TVs in my home.", "verified": true, "helpfulness": "0/0", "author": "Lisa Colburn"}, {"rating": 3.0, "review": "The kids love it. Thought there would be more free stuff to watch.", "verified": true, "helpfulness": "0/0", "author": "lori howlett"}, {"rating": 5.0, "review": "There are amazing!  Absolutely love them.", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 5.0, "review": "AWESOMEEEEE!!!!", "verified": true, "helpfulness": "0/0", "author": "Ni Ni"}, {"rating": 4.0, "review": "Firestick has some good and bad points.  It works well and setup was flawless.  However the free shows are still limited, Prime movies are all old or B movies and many of the History Channel shows have commercials which I don't have to suffer through if I stream History Channel shows through my computer.  I still can't figure out what they have commercials on Firestick.I was expecting a lot more free shows using this but I'll give it some time and see if they add new shows later down the road.  It could be a good replacement for a TV set if it had more free shows.", "verified": true, "helpfulness": "0/0", "author": "Real Jeep"}, {"rating": 2.0, "review": "The idea of this product is great- love the small size, convenient and easy-to-use remote, and design of the menu.  However, the function is far inferior to our Roku.  The Hulu app freezes several times during each show, and the stick will often lose contact with our wi-if (the router is in the same room).  We ordered a replacement thinking it was a faulty stick- as our iPads and other Roku (which is far from router) never freeze or lose signal...but sadly, it appears to be a problem with the apps on this product. Will be going back to Roku.", "verified": true, "helpfulness": "1/1", "author": "AGTPC"}, {"rating": 5.0, "review": "Love It!!! Easy to set up and use!! Much better than Google or Roku!!", "verified": true, "helpfulness": "0/0", "author": "Dwayne Bruns"}, {"rating": 4.0, "review": "I have used Roku, Sony's built in apps on their blue ray player, Xbox One, and Xbox 360 to stream video and so far the best are the Roku and Fire TV. Roku is good if you use lots of apps but Fire TV is great if you use Prime and Amazon. Although the Fire TV has other apps they are not as eau to access as on the Roku. Fire TV is streamlined for Amazon but one you figure it out it does work quite well. I have had a few lag problems but out is a very tiny device which means the amount of memory is limited and it had to basically constantly stream without buffering which would help avoid laggy playback. I think it works almost as good as my Roku 3, I'm happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Matthew Anderson \"Robbin505\""}, {"rating": 5.0, "review": "This thing is awesome and suits our needs perfectly! Even though the stick is mobile, we'll probably buy one for every TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Ashley Ferguson"}]