[{"rating": 5.0, "review": "Very pleased with this product.  Would definitely recommend it to anyone looking to replace cable tv.", "verified": true, "helpfulness": "0/0", "author": "Renee Chatman"}, {"rating": 1.0, "review": "Constantly disconects from wi-fi", "verified": true, "helpfulness": "1/1", "author": "Oscar Cobo"}, {"rating": 4.0, "review": "Everything it says it does and more", "verified": true, "helpfulness": "0/0", "author": "Anthony Algee"}, {"rating": 4.0, "review": "Difficult to find easy listening music and big band music.  Have been searching for a week with no success.  Not so bad on the kindle, but difficult on the tv.  Love the movies though.", "verified": true, "helpfulness": "0/0", "author": "Mickey"}, {"rating": 5.0, "review": "I love it - five stars - birthday present and a good one!!!", "verified": true, "helpfulness": "0/0", "author": "niagara"}, {"rating": 5.0, "review": "Better then apple", "verified": true, "helpfulness": "0/0", "author": "Boobi"}, {"rating": 5.0, "review": "I can finally take full advantage of my Amazon Prime Membership by watching on my Firestick! I have a newer Apple TV that did not have the Amazon Instant Video app on it.  I really loved my Apple TV, but I have to say I love the size of the Firestick and its remote.  The best part is the price.  Also, recently my dad was in the hospital long term and with the convenience and size of the Stick, we were able to plug it in and watch some great tv.  Made him forget about his cancer for awhile😊", "verified": true, "helpfulness": "0/1", "author": "ortho assist"}, {"rating": 3.0, "review": "more free viewable TV series and movies with Prime membership would make this a 5 star", "verified": true, "helpfulness": "1/2", "author": "Paul"}, {"rating": 1.0, "review": "Took me for ever to set up !!!", "verified": true, "helpfulness": "1/2", "author": "D.p"}, {"rating": 4.0, "review": "Great to install and so easy to use", "verified": false, "helpfulness": "0/0", "author": "Laura Granger"}]