[{"rating": 5.0, "review": "Love it! So easy to use! Set up easy as can be!", "verified": true, "helpfulness": "0/0", "author": "Sarah Jackson"}, {"rating": 5.0, "review": "We love being able to watch programs without always going back to the computer to look for the next thing to watch. We live in Minnesota, so January and February are big months for watching TV.", "verified": true, "helpfulness": "0/0", "author": "Linda Gridley"}, {"rating": 5.0, "review": "Happy Camper here - recent purchase of new Samsung tv (not smart) with available HDMI port - not being technically savvy - I was able to get this item going and am now enjoying tons of movies, concerts, youtube with $99/yr Amazon prime - if you have kids or want to have access to tons of movies or music concerts (at your leisure) - who needs a smart tv when you can purchase a fire stick that enables your tv to be smart and stream media ... love, love, love it!!  Without Amazon prime - there is still a lot available but adding prime is like having whipped cream on your dessert every day all year long - who wouldn't want that??", "verified": true, "helpfulness": "0/0", "author": "miatagirl"}, {"rating": 5.0, "review": "Just as good as our Fire TV Box. I like the box better but this is just as good.", "verified": true, "helpfulness": "0/0", "author": "rockergirl15"}, {"rating": 3.0, "review": "One thing bad thing I've noticed is doesn't allow me to have \"HBO Go.\"", "verified": true, "helpfulness": "0/0", "author": "Tony Bottom \"Tony B\""}, {"rating": 4.0, "review": "This was a gift for my Wife and she has enjoyed it. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "William Beverly"}, {"rating": 5.0, "review": "Best little gadget Chrome you got competition with this!!!!!", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "If you have WIFI in your home this allows you to stream programming to your tv. Very nice.", "verified": true, "helpfulness": "0/0", "author": "Donald W. May"}, {"rating": 2.0, "review": "Regrettable purchase.  I love Amazon.  I buy Kindles and other Amazon branded items as much as possible.  But... this one should have been a Roku.  I don't like the interface  I've had this long enough that I should have gotten used to it, but it's so different than our internet TVs and Roku's -- almost like everything I've learned is out the window.  But my biggest irk is that it doesn't detect my wi-fi signal as easily as any other device in that exact same spot.  It's bad enough that I don't even get a lot of buffering, it just loses connection.", "verified": true, "helpfulness": "0/1", "author": "Lynn Benson"}, {"rating": 5.0, "review": "Great TV now! I have really enjoyed the Fire TV Stick, especially staying in motels a lot. The motel we stay in right now have HD TVs, but no HD signal. The Fire TV Stick solves the problem. I just wish there was a way to link it to my GenieGo.......", "verified": false, "helpfulness": "0/0", "author": "Sherry Starley"}]