[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Suzan E. Falvey"}, {"rating": 5.0, "review": "Very cool but there must be newer movie demands.", "verified": true, "helpfulness": "0/0", "author": "Roy Villegas"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "robert n weniger"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Terry Phillips Jr."}, {"rating": 5.0, "review": "Very easy to use. Lots of choices what to watch", "verified": true, "helpfulness": "0/0", "author": "sue"}, {"rating": 5.0, "review": "Great Product!  The set up was insanely easy and fast!  I would highly recommend this product.  If there are any complaints it would be 1).  Volume is different while watching shows, especially apps.  2)  When trying to install apps (youtube, pbskids, etc.) you can't search for it in the \"app\" section.  You can find them by doing a search in the \"search\" field.  Took me a while to figure it out, but now that I know, it's really not much of a complaint, just wanted to save you the 15 minutes of frustration so you can rate this product 5 stars too!", "verified": true, "helpfulness": "0/0", "author": "jiowa832"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 5.0, "review": "we use it on our secondary TV and LOVE it.", "verified": true, "helpfulness": "0/0", "author": "LindsayHS"}, {"rating": 4.0, "review": "My only issue is with the remote, I had to use a kitchen knife to get the hatch open and put the battery on after googling it, and saw that many people had the same problem.", "verified": true, "helpfulness": "0/0", "author": "L. Roncon"}, {"rating": 4.0, "review": "I love the quality and the quantity of the movies and shows available but with that said I feel like there are way to many movies that have to have an additional cost to them", "verified": false, "helpfulness": "0/0", "author": "Linda Bell"}]