[{"rating": 5.0, "review": "I love this thing.  I have a ChromeCast and the FireTVStick makes it look sick!  Does everything I hoped it would and more.  I'm going to order another one soon.", "verified": true, "helpfulness": "0/0", "author": "bpro"}, {"rating": 3.0, "review": "Handles Amazon Prime video fairly well, however, the video stream stutters and stops a lot to buffer.  Can not cast from computers - only Android.  The Roku box seems to be a better option at this point.  It has so many more channels/options to choose from and hardly ever stops for buffering once the video is streaming.  It is definitely better than the Chromecast for media options, however, you can cast from Chrome browser.  Hopefully a software update will fix some of the problems and add more media choices.  All in all, not quite ready for \"prime\" time", "verified": true, "helpfulness": "0/1", "author": "Bigness \"GDIBIG\""}, {"rating": 4.0, "review": "I've tried the Roku in the past, and managed to crash it. However, I understand the idea behind Raspberry Pi and all of the devices like Chromecast. It offers an inexpensive way for people to stream media onto their TV's without the clutter and cumbersome use of large computers/laptops or wires. That said, I still prefer my \"media center\" PC that is dedicated for use with my flat screen TV. The Fire TV stick was well made, but it is very limited in functionality compared to my PC. In addition, the Fire TV stick is WiFi only and somehow has pretty poor reception. My Samsung Galaxy S5 has full strength WiFi throughout the house, but the Fire TV stick starts to lose speed and continuously buffers even with it being about 25 feet from my WiFi router. It is also very picky about which AC adapter is being used. The adapter included is a 5W Amazon adapter which it needs. However, when I use a 10W Samsung charger for my Galaxy Note 10.1, it states to use the Amazon adapter as if the 10W adapter isn't as powerful as the 5W adapter.Installation wasn't too bad at all, but I couldn't skip the tutorial. The MAC address is also readily available, which makes signing into Access Controlled WiFi networks very convenient. I wanted to like the Fire TV stick, but it kept buffering my shows and many of them weren't capable of being played in HD due to the slow data transfer speeds. Once in a blue moon, the show would play in HD until it started buffering again.It also focuses on the Amazon Prime / Instant Video ecosystem. It offers the ability to load apps for other services, but many of them require paying for a subscription. This goes back to my recommendation for a dedicated PC. My \"media center\" PC runs Windows 7 and a Core i3 processor with a hardwired Ethernet connection. I can watch Hulu free shows as well as Amazon Prime / Instant Video, and websites that use Flash (such as MotoGP Videopass). As for folks interested in cutting their cable, the Fire TV stick is not your end-all solution. I use free over-the-air HDTV which has limitations during high winds and I am missing a lot of sports channels. I just trained myself to ignore the need for all those extra channels to save on cable bills.The remote control battery cover can be hard to remove, but the key is to depress it harder in the middle seam where there is a plastic tab that clicks into place. There's also a Fire TV app available for Android where you can control the Fire TV stick.Overall: 4/5 stars, meh I wasn't too impressed compared to my media center PC. Granted the PC is about 10 times more expensive than the full retail Fire TV stick, I just don't see the Fire TV stick replacing my media PC anytime soon especially with the pitifully slow WiFi and constant buffering. My WiFi network works fine with the iPad Air, Galaxy tablets, Galaxy S5 phone, etc... Bottom line: At half the retail price I paid for the Fire TV stick (during a 2 day special), it isn't too bad. At the current full retail price, I recommend looking at the full Fire TV instead of the stick. In the meantime, I'm going to stick with my PC.", "verified": true, "helpfulness": "0/3", "author": "Gearhead Mania"}, {"rating": 5.0, "review": "I too was a fortunate Prime member and got it for $19. We love it! We have watched movies, TV shows, played music, played games, etc. since we set it up in only a few minutes. No issues signing into the various app accounts. I'm using my Kindle Fire mostly to control it, but everyone downloaded the remote app on their phones too.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "When it works, it works well. We're using it mostly for Netflix and Amazon Prime video, and ts easy to find what we want to see and the quality is good. But every day or two,it loses the connection to the wifi network, and I have to power it down and restart it (sometimes multiple times) to get it to reconnect to the network. We have a new dual band router, and half a dozen other wireless devices that have had no connectivity problems at all, so I'm sure the problem is with the Fire stick. I've even put one of the tablets in the exact same location as the Fire stick, and the tablet sees the network fine while the stick doesn't.I'd rate this 5 stars if the wifi worked right consistently. But it doesn't.", "verified": true, "helpfulness": "0/0", "author": "S. Hughes"}, {"rating": 1.0, "review": "The concept is nice but almost all of the movies I select are chargeable.  What is the value of Prime and the Fire Stick if I have to pay for all the good movies?Interface to search for movies is clunky.  I can't qualify my search by only the free shows or just TV or just moviesSimple remote is nice but you suffer the consequences on trying to search... spelling a show's name is a pain in the neck.  I guess they do that on purpose to get you to buy a Kindle Fire to do voice searches!", "verified": true, "helpfulness": "0/1", "author": "Scott Redfern"}, {"rating": 1.0, "review": "I bought 2 of these and one of them does not work properly. It will connect with problems or never connects at all. It's only 5 to 10 feet from the WiFi.. wait until the second revision!", "verified": true, "helpfulness": "1/1", "author": "Eddie"}, {"rating": 5.0, "review": "I already own Amazon Fire TV and love that for Amazon Prime Video & TV. I too was fortunate to order one of these as soon as it was announced. As an Amazon Prime member like most of you, I was able to buy the Fire TV Stick for $19 during a two day sale. For that price, I figured, I might as well test it out! - Having said, I must admit for mere $20 this Fire TV Stick is an Awesome value product. Amazon has indeed made an excellent streaming media player for the masses and most cases works better than the Amazon app included in most big screen TVs.What I expected I got - Thank you Amazon for an amazing value product, now I can have the same capable streaming media player experience in my bedroom what I have been using all these days in living room via Amazon FireTV. Granted Amazon FireTV has Optical Audio out which integrates well into my 5.1 surround sound system but this one is perfect for the second TV in your household.PROS[+] Excellent quality product[+] (Advanced Streaming And Prediction) works great in pre-buffering and no lagging or spinning circles for the video to load[+] Better than chromecast in most respects and this one includes Remote![+] Includes all necessary hardware including power adapter, USB cables, HDMI extension cable, AAA batteries[+] PLEX app works great and can be used for streaming personal local media files from PLEX server[+] Netflix works perfectly[+] YouTube works greatCONS[-] No voice search since the included remote is not capable of that (you can always pair a voice search capable remote)[-] Little difficult to open the battery compartment of the included remote (minor quibble)Amazon FireTV stick is a very capable product and has a nicer user interface that everyone in your family can enjoy Prime shows & allows kids to play casual gaming on large screen TV.Overall I am pleased with this product and rating this with Five Stars!", "verified": true, "helpfulness": "0/0", "author": "rbhatta \"A Dinosaur you can trust!\""}, {"rating": 5.0, "review": "This is a great device!  Works just perfect if you have a good internet connection. I really like how I can use my phone to control it also!", "verified": true, "helpfulness": "0/0", "author": "Linda Golden"}, {"rating": 5.0, "review": "Really convenient.  Just plug it into the back of your smart tv and start watching prime movies and TV shows.  I also like the option of taking this with me anywhere especially family members home during the holidays. Watched a few movies on it already and the quality was good. So guess that means it picks up wifi signals well. Happy with the firestick.", "verified": true, "helpfulness": "0/1", "author": "Rivbea"}]