[{"rating": 5.0, "review": "I love it, great replacement for my WII (which was broken and I used only to stream Netflix)", "verified": true, "helpfulness": "0/0", "author": "Nolan's Mom"}, {"rating": 4.0, "review": "wont get til january, but I expect it to be goood", "verified": true, "helpfulness": "0/0", "author": "R. Berger \"rbn190\""}, {"rating": 5.0, "review": "This is great! Seeing the detail that Amazon put into the user interface and the so far flawless performance of this has made me want a full size Fire TV for the living room that much more.", "verified": true, "helpfulness": "0/0", "author": "NPR_Dan"}, {"rating": 5.0, "review": "The set up was very simple. It took only a few minutes to update after connecting to the WIFI. After canceling my cable, figured I would give this a shot. My whole family is very happy. The home screen is user friendly. Easy to search through the Instant Videos and to switch between apps. For the price, the promotion $19, it was well worth it.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Sanders"}, {"rating": 3.0, "review": "Wish the movies were actually free.", "verified": true, "helpfulness": "0/0", "author": "M. Hopkins \"librarychic\""}, {"rating": 4.0, "review": "It is very handy device and worth for it's price.Pros : more apps, more games, fast downloadCons : Not the famous supporting device listed like chromecast, ROKU, etc, need game controller for lot of games.", "verified": false, "helpfulness": "0/0", "author": "sundaram"}, {"rating": 4.0, "review": "Would like a better selection setup for the music selection instead of having to scroll all the way through the artists everytime to choose songs.", "verified": true, "helpfulness": "0/0", "author": "Jason M. Wallace"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Maudi O"}, {"rating": 5.0, "review": "We have purchased six and we are utilizing four with two more for Christmas presents. We love what they do and how easy they were to set up.", "verified": true, "helpfulness": "0/0", "author": "C. Herring"}, {"rating": 5.0, "review": "Product works great and is very simile to operate. Very small and great for taking with you to a friends house or even to a hotel. Not to happy about being offered a free 30 day trial. And then 3 days into being charged for it. And after a week and a half of getting the charges reversed. Losing my free trial membership.", "verified": false, "helpfulness": "0/0", "author": "Ryan Kelley"}]