[{"rating": 1.0, "review": "It has commercials! I never would have bought this had I known. We also have a Roku in the house which I find easier to use and it has NO ADS. I never return things so I am using it for now but I am not happy with this device at all", "verified": true, "helpfulness": "0/1", "author": "Old Nurse \"Goodnurse\""}, {"rating": 5.0, "review": "I bought this for the kids so it has limited use.  I had problems with the blue screen while trying to playback video but that was fixed with moving it to another hdmi spot.  At the moment I have no complaints, very easy to set up.  We use it for netflix and for Amazon prime videos.  I will be buying another one in the future.", "verified": true, "helpfulness": "0/2", "author": "Myers"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/1", "author": "Angel Jimenez"}, {"rating": 4.0, "review": "I like the fire TV box and stick both very much. they work very well and are priced very fairly but the stick I'm not so in love with. First of all why does it have to be a stick? if im going to have to plug a power cable into it what difference does it make if they made it a slightly different design that perhaps put it in a better position to disperse with the great deal of heat it produces. Of coarse everything works flawlessly as amazon is great at and if you need a cheap interface of this type to stream video and audio then you could do much worse and If you have prime then this is your only descent cheap option. compared to the box it is just as you would suspect. everything is less powerful and less swift in it's function. though it absolutely does what it's supposed to do and really rather well or at least well enough to get by if sixty dollars extra for the box will break you.I got one on lightning deal for another bedroom and it works great. despite a couple gripes about it's design and it's rapid production of heat I like it very much and find that it works splendidly. I highly recommend.", "verified": true, "helpfulness": "0/1", "author": "travis deshon"}, {"rating": 4.0, "review": "Overall pleased with the Fire Stick but on a few occasions, it has frozen up on me while on the main menu.", "verified": true, "helpfulness": "0/2", "author": "Jenny867 \"Jennifer\""}, {"rating": 5.0, "review": "So glad we finally \"cut the cable!\"", "verified": true, "helpfulness": "0/1", "author": "Barbara"}, {"rating": 5.0, "review": "Fantastic device, easily moved from room to room, and it even worked in the hospital for access to movies!", "verified": true, "helpfulness": "0/1", "author": "col"}, {"rating": 4.0, "review": "Great purchase! We decided to do away with cable, and we can get everything we need with the apps and streaming capabilities.", "verified": true, "helpfulness": "0/1", "author": "diamondback6161"}, {"rating": 1.0, "review": "So far it meets up to my expectations", "verified": true, "helpfulness": "0/4", "author": "Norman Strefling"}, {"rating": 4.0, "review": "It worked for a few days, then repeatedly displayed NetWork Out of Range. After close to two hours on the line with Amazon and Verizon support representatives, decided to go for the only possible solution (which may not work at all) -- a router extender to bridge the 25 to 39 foot distance between the TV and the router. So why did it work for awhile? Service reps said network congestion; seems unlikely since it happened  on several different days in my undense neighborhood. My Verizon FIOs handles all of my other wireless devices quite well no matter where they are in the house. And the router extender costs more the Stick!So the network extender worked and i am able to use the fire stick.", "verified": true, "helpfulness": "0/1", "author": "Donna Allman"}]