[{"rating": 5.0, "review": "Fire TV is great.  My kids love it.", "verified": true, "helpfulness": "0/0", "author": "John Mancinelli Jr"}, {"rating": 4.0, "review": "My only complaint with this is there is no feature to search only Prime shows and movies. You are able to search through the Amazon catalog, but it gives you every listing. When you go to the screen that is set up specifically for Prime, you do not get the option of searching. Instead they give you a list of what you have watched, What Amazon thinks you might like (usually there is nothing I find interesting on that list), What other people are watching, and what the new Prime shows and movies are.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "Great Product!!!!!", "verified": true, "helpfulness": "0/0", "author": "David Taniguchi"}, {"rating": 5.0, "review": "I bought two at the introductory price for Prime subscribers. What a good deal. Even at the normal price, I highly recommend it.Installation was absolutely painless. The device came pre-programmed with my Amazon user ID, but I had to enter my Netflix account information, which was a little tedious (on screen keyboard).Movies look superb on my Samsung 60\" HDTV. Streaming Netflix is definitely smoother than Amazon Prime Video. That may be due to my location and/or my ISP. I just installed Sling on it and that works well too.The phone app is a nice touch that alleviates the need for a physical keyboard: you can search for movies or TV shows by speaking in the phone. The on-screen keyboard is otherwise painful to use for anything other than entering your account information in the other services.I have not compared to the Chromecast or the Roku, but on its own merit, the Fire TV Stick is a winner.", "verified": true, "helpfulness": "0/0", "author": "Didier Juges"}, {"rating": 5.0, "review": "The streaming has been without interruption, in a part of my residence that my other wi fi devices have trouble. I use it strictly for Amazon Prime movies. I enjoy using so much that I hated to share it with my spouse, so I bought another unit. I wish Amazon would allow you to have more than one Watchlist per account.", "verified": true, "helpfulness": "0/0", "author": "Louis J. Volpi"}, {"rating": 5.0, "review": "Got one for the bedroom, Love being able to stream so many movies in bed. It's so easy to set up, takes all of 5 five minutes.", "verified": true, "helpfulness": "0/0", "author": "T. Roy"}, {"rating": 5.0, "review": "I love the fire stick!  It's so convenient and easy to use.  And the set up was so easy that a pre-schooler could do it.  I think the only negative side to it is that it's made me binge watch even more.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great!!!", "verified": true, "helpfulness": "0/0", "author": "Dave N"}, {"rating": 5.0, "review": "This along with the Android app is awesome! The app provides awesome voice recognition that just wows you! Totally blows chrome out of the water!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "amazing product.  works well", "verified": true, "helpfulness": "0/0", "author": "William Dotterweich"}]