[{"rating": 5.0, "review": "awesome and easy....my brother is buying one for his tv in the bedroom so I can use the one in the living room..THANKS SO MUCH", "verified": true, "helpfulness": "0/1", "author": "chucksgirl43"}, {"rating": 4.0, "review": "We have a small TV in the kitchen/living room of our house and this is just the item I wanted so I could stream shows and movies from Amazon Prime and Netflix. I had been watching shows on the iPad, but when this came along I thought it was a good deal and was pleased to find it was shipping faster than expected. It arrived at my house with no packaging issues and was easy to set up and super easy to learn to navigate.If you're not too tech savvy, you might need some help with the wireless portion, but the rest is a snap.", "verified": true, "helpfulness": "0/0", "author": "Nikki Rau-Baker"}, {"rating": 4.0, "review": "Figured out how to get ESPNU to watch the Iowa State Cyclones, since I don't have that on my Mediacom package. Yeah!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fast, easy set up and great fun especially with Prime. Love it!", "verified": true, "helpfulness": "0/1", "author": "Michael E. Walker"}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/1", "author": "FYA"}, {"rating": 5.0, "review": "Great built qualityMuch faster than Roku and Chromecast", "verified": true, "helpfulness": "0/1", "author": "DeMand Justice"}, {"rating": 4.0, "review": "Easy, Love it", "verified": true, "helpfulness": "0/1", "author": "rlh8141"}, {"rating": 5.0, "review": "Pretty cool. Look forward to using it more. Wish it didn't take so long to ship.", "verified": true, "helpfulness": "0/1", "author": "Stephanie Rabon"}, {"rating": 3.0, "review": "Was excited to purchase. Possibly even get rid of cable. Signed up for prime also. Then days into watching a season or two of a few prime shows I realize to continue watching you need to purchase each episode for $3.99. Or the whole season  $24. So much for prime membership when you can have additional charges on top of that.", "verified": true, "helpfulness": "1/1", "author": "Lorie McGeehon"}, {"rating": 3.0, "review": "The reason this is rated so low is if you would just say plug the stick into the designated spot on the TV and when the keyboard comes up on the screen use the remote, navigate by using the outside circle of the large circle. After trying numerous times to register on line I finally asked customer service for help, it took three representatives to get this done.  Actually was disappointed with the selection of movies available.", "verified": true, "helpfulness": "1/1", "author": "Doggie Mom"}]