[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Merry Dickens"}, {"rating": 1.0, "review": "Worked one day and does not let you watch a full episode of any show without cutting off", "verified": true, "helpfulness": "0/0", "author": "angela annuzzi-rivera"}, {"rating": 5.0, "review": "Because my son and I only have access to basic cable, I bought us each an Amazon Fire TV Stick for our separate TV's.  With our own wi-fi system the transformation of our television viewing has brought us shows and movies that we would never have had otherwise.  So much less expensive than adding the ultimate cable package and all in HD!  I plan on purchasing one for my best friend for her birthday in July!  Greatest thing ever!", "verified": true, "helpfulness": "0/0", "author": "Jan Tomlinson"}, {"rating": 1.0, "review": "AWFUL, I recommend you spend the extra money to buy the Fire TV box instead of the stick, had it just over a month before it started acting up. After an hour with customer service and deregistering and registering the device, it worked again- until the next day. Then every time I went to use it, I would spend an hour trying to get it to work. Tried to return it, amazon said it had been over a month since I purchased it and it couldn't be returned. I DO NOT RECOMMEND THIS DEVICE. I have a Fire TV and have never had any problems with it, it is a better way to spend your money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love every thing I can watch.Was very easy to get up and running.", "verified": true, "helpfulness": "0/0", "author": "geraldine v servedio"}, {"rating": 5.0, "review": "WORKS GEAT", "verified": true, "helpfulness": "0/0", "author": "julio"}, {"rating": 5.0, "review": "Very good device", "verified": true, "helpfulness": "0/0", "author": "yolanda torres"}, {"rating": 5.0, "review": "Can't get the wife off of Downton Abbey....nuff said Gonna have to buy another one for me.", "verified": true, "helpfulness": "0/0", "author": "John Hall \"halls51\""}, {"rating": 5.0, "review": "Works good.", "verified": true, "helpfulness": "0/0", "author": "Maricela Saenz"}, {"rating": 5.0, "review": "This has worked well for me as long as I have good WIFI.  I sometimes stay in places with poor or no wifi.  Needless to say, under those conditions it will not work well.  The selections are good,  Playback has been solid and the software has been updated since my purchase.", "verified": true, "helpfulness": "0/0", "author": "Marshuis E. Bender \"techno nut\""}]