[{"rating": 4.0, "review": "This is a great item.  Very similar to Google ChromeCast.  Only difference is that all the apps are within Fire TV stick vs. for the chromecast, you would need to start movie from individual apps and you would send it to chromecast.  The Fire TV stick is very integrated into Amazon's eco-system. If you purchase the game pad, you can download 1000's of game apps from Amazon and play it right from the TV.  I didn't get the joystick, since I have the PS4 but it is a nice option to have.  Fire TV stick is very easy to setup and the fact that it comes with its own remote control is plus.  I have both Chromcast and the Fire TV stick.  Both has it's pros and cons.  Obviously, one of the strong selling point is having the prime media contents streamed to your TV using Fire TV.  However, one of the missing content that I use a lot on Choromcast is Viki TV, which is not yet available in Fire TV. I have Chromcast in the living room and Fire TV stick setup in the master bedroom.  They both support PLEX so I have no problem streaming my movie collection to either device. Btw, the voice search using Fire TV remote on your android is very nice.  I am now waiting for the same remote app to be published in the iPhone as well.  Job well done.. Amazon!", "verified": true, "helpfulness": "1/1", "author": "D. Jung"}, {"rating": 5.0, "review": "Chromecast doesn't hold a candle to this", "verified": true, "helpfulness": "0/1", "author": "mattbrad2"}, {"rating": 2.0, "review": "Plex does not work. But after reading a bit I found you can side load xbmc and use lama to launch xbmc from the home screen.I am not getting my Plex experience.I am able to stream my content now.Please make xbmx/KODI an app in the store!", "verified": false, "helpfulness": "0/2", "author": "MrJRussell"}, {"rating": 5.0, "review": "Love it!  I've had the Amazon Fire TV for over 6 months and I loved it so much that I decided to try the Fire TV Stick during their promo.  They are both easy to set up and use and they are much faster than my Samsung Smart TV.  In fact I got the Fire TV Stick so I could use that instead of the Samsung's Smart TV features.  The Smart TV was tooooo slow.  So far, I see very little difference in the speed of the Fire TV box and Fire TV Stick, but it might be different if you use it for different things.  Our primary use is for Netflix, Hulu, Amazon Prime, etc.", "verified": true, "helpfulness": "3/3", "author": "UPNorthMom"}, {"rating": 5.0, "review": "Definately worth the $19! Even worth the $40. One big question I had, which I never saw addressed in any of the reviews: Does this work like a Chromecast, where you have to use a laptop or tablet to operate the device? If you are still wondering the same thing, the answer is mostly NO. It works as a standalone device for Netflix, Hulu, etc.", "verified": true, "helpfulness": "3/4", "author": "Beth Ann"}, {"rating": 5.0, "review": "Got this an hour ago and thought I'd set it up before wrapping it to give to my child.  I'm hooked! I loooooooove this compared to my Roku stick.  It's fast, simple, and very easy to set up.  I'm buying a few more for myself and for my friends who I've not shopped for yet this season. Did I say I love it?", "verified": true, "helpfulness": "0/0", "author": "THE Amazon"}, {"rating": 3.0, "review": "Easy to install and use; however, not all the apps I intended to use are available.  It is very disappointing as well that I can only mirror or fling from an Android or Amazon/Kindle device.  Chromecast or Roku is a better choice as of December 2014.", "verified": true, "helpfulness": "0/0", "author": "J. Benzl"}, {"rating": 2.0, "review": "I bought this for a replacement for a roku and to be able to utilize the 5G wifi.  I plugged this in and it connected right up to the 5G, but errored out of the firmware update several times, changed it over to 2.4 and it errored once but then ran it fine.  after the update finished I was no longer able to see the 5G network, looking through the forums, it seems to be a firmware issue.  I planned to use this mainly for PLEX and the plex app works terrible with this.  Not sure if it is the app or the fact that it appears a lot out of date off of the amazon app store, but skips and stutters non stop trying to stream videos.  My 4 year old roku 2 works flawless, I love the interface on this fire tv stick, and the netflix and prime apps seems to work great.  But until I can use the plex app, this is a paperweight, and I wanted to utilize the 5G for better throughput on my video, which I can't.I send an email to Amazon the night I received the fire stick telling them my issues and findings with the 5G wifi and received an email saying I would be contacted in 48 hours and that was 2 weeks ago, and nothing from them yet.  This is my 1st issue with Amazon at all, love the company.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Netflix works fine.  Good device very similar to Roku, for $20 how can you go wrong.", "verified": true, "helpfulness": "0/0", "author": "kjctngy"}, {"rating": 2.0, "review": "I'm a prime member, but got this to watch Netflix as well. Netflix doesn't work. Netflix works on other devices within my network so I am left to conclude that it is something with the Fire Stick device. Amazon Prime videos do work. If you are getting this to watch Netflix, be warned.", "verified": true, "helpfulness": "0/1", "author": "Brad K. Powers"}]