[{"rating": 5.0, "review": "Easy to hook up and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Kelly Athy"}, {"rating": 1.0, "review": "Weak", "verified": false, "helpfulness": "0/3", "author": "Don't trust Jerri"}, {"rating": 1.0, "review": "Wasn't what we were wanting.", "verified": false, "helpfulness": "0/3", "author": "katrena todd"}, {"rating": 5.0, "review": "the item works wonderful..but the delivery was way out of line it took over a month to get it too my home..poor ..but when I got It the unit works great", "verified": true, "helpfulness": "0/0", "author": "RICHARD BUZBEE"}, {"rating": 5.0, "review": "I've been a member of Amazon Prime since it was introduced, and this little stick allows me to take advantage of the movies offered by that service, plus a host of others including Hulu, Netflix, Crackle and so forth. It was super easy to install, and I love that I can move it from one room to another and watch anything I want wherever I am. I got the Fire TV Stick after I got my ASUS RT-AC66U Gigabit Router and they work very well together. Between this and my Direct TV which gives me access to my Pandora and YouTube accounts, I'm all set when it comes to media. This Fire Stick was a fantastic idea. You can bring it anywhere as long as you have access to a high-speed wi-fi network.", "verified": true, "helpfulness": "0/0", "author": "D. Skowron"}, {"rating": 4.0, "review": "Did as advertised  set up easy", "verified": true, "helpfulness": "0/0", "author": "Robert Applebee"}, {"rating": 5.0, "review": "Easy to install. .then BOOM a whole new world opened up on the tv.  Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Walter H. Chappell \"W. Chappell\""}, {"rating": 2.0, "review": "I was a bit disappointed with the selection of available movies. I finally picked one and the connection was lost right on the middle of the movie. I could not get it back to finish the movie nor could I add it to my list to resume later.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Way"}, {"rating": 1.0, "review": "Loses the signal.", "verified": true, "helpfulness": "0/2", "author": "Marvin J Little"}, {"rating": 5.0, "review": "This is awesome...i don't have cable and this along with the Amazon prime membership is a great combo", "verified": true, "helpfulness": "0/0", "author": "Walter A. Palacios"}]