[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Leo Harris"}, {"rating": 5.0, "review": "I love it and I have recommended it to all of my friends and family", "verified": true, "helpfulness": "0/0", "author": "tyesha77"}, {"rating": 3.0, "review": "Bought this as a gift and had to return it. It worked for a bit but most of the time it would lose connection.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "Best investment for my TV yet!!!", "verified": true, "helpfulness": "0/0", "author": "Jessica Jones"}, {"rating": 5.0, "review": "I have been streaming with a Roku since 2010, now they have this thing legacy customers cannot get channels like HBOgo, all to get me to buy the new Roku. I didn't care for this and decided to buy the Fire Stick instead.. well I am so glad I did! this is awesome! I am ready to cut the cord with all of the stuff I get with the Fire Stick, specially with Sling and all of the awesome stuff. Good bye Roku and cable.", "verified": true, "helpfulness": "0/0", "author": "Miranda NYC \"VA\""}, {"rating": 5.0, "review": "Getting one for all my family members for gifts. Awesome!", "verified": true, "helpfulness": "0/0", "author": "Jeff Kaatz"}, {"rating": 5.0, "review": "I LOVE my fire stick. I lived for so long with the crappy wireless in my blu-ray player, the fire stick has been a lifesaver! Yay Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Kathrin"}, {"rating": 5.0, "review": "Really enjoy the ease of use and all the programs available, wished I'd bought this sooner.", "verified": true, "helpfulness": "0/0", "author": "maggie"}, {"rating": 5.0, "review": "Love my Fire TV.The performance on this thing is awesome. Plus you have additional storage, which I give a plus.", "verified": true, "helpfulness": "0/0", "author": "numixradio"}, {"rating": 1.0, "review": "At first I was going to give it 5 starts but I wanted to test it out a while. I'm a loyal customer of amazon but this stick can be very fustrating. I have a Google Chrome and a roku stick, according to the specs of the Amazon fire stick it should beat both other devices yet I have the most issues with the Fire Stick. Besides Netflix, most tv and movie apps buffer way to much. Now I will mention I have a big house but if the chromecast and roku work perfectly at the same location so should the fire stick.As for the layout and functionality Amazon provides a nice operating system and layout but it is catered to people who use Amazon's products. I think if you want something to run well and you are on a budget, get chromecast or roku stick but if you have $100 to buy the actual Amazon Fire TV definitely go with that... but leaves it's lower end stick alone.", "verified": true, "helpfulness": "2/2", "author": "Marky Mark and Not the funky bunch"}]