[{"rating": 5.0, "review": "Finally can watch Amazon prime video on my HD TV.", "verified": true, "helpfulness": "0/0", "author": "quantum fields"}, {"rating": 3.0, "review": "Works well.  Not as many current movies available as I would have expected.", "verified": true, "helpfulness": "1/1", "author": "LeeLee"}, {"rating": 5.0, "review": "Very happy with this purchase.  A great bargain.", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 5.0, "review": "the amazon fire t.v stick is awesome but it lack a little but i stil like it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I used to have a Roku but the Amazon Fire TV Stick is so much easier.  I mainly stream Amazon Prime videos and music, but I also use it to stream Netflix, Pandora, and much more. It is really great.", "verified": true, "helpfulness": "0/0", "author": "Naturesway13"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "roger slaven"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was very easy to install. We are enjoying exploring the many options. We are amazed at the technology.", "verified": true, "helpfulness": "0/0", "author": "sac"}, {"rating": 4.0, "review": "Great little gadget if you have prime. Fast to load stuff from amazon but a little laggy when you use other apps. Got this on sale so it's an awesome deal for a streaming player. It's worth it to get even at original price.", "verified": true, "helpfulness": "0/0", "author": "techshouter"}, {"rating": 2.0, "review": "Well, it sounded too good to be true, and it pretty much is.  Mine works fine on the Amazon Prime feeds, but Netflix, PBS, Bloomberg, WSJ , and almost everything else I've tried is buffering constantly with a good wifi connection.  It's a great idea, but amazon dropped the ball on its execution.  Before buying, search buffering firestick.  Hope they get it right someday...", "verified": true, "helpfulness": "1/1", "author": "T. Roes"}, {"rating": 5.0, "review": "Works well and has good content", "verified": true, "helpfulness": "0/0", "author": "Bill Baird"}]