[{"rating": 4.0, "review": "Very easy setup, large selection of movies just a lot of them or either outdated far as classic that everyone has seen before, wish it was more new current ones available", "verified": true, "helpfulness": "0/0", "author": "Savonia Adams"}, {"rating": 5.0, "review": "For what it is it's perfect for me. I refuse to pay 80 dollars plus for TV. This works great with Netflix , Sling TV, and many more. You can purchase content directly from the market place. I have found everything I watch and cut ties with cable and pay about a third what the average TV service costs. Surely you could use an extra 50 dollars a month for something besides making your cable company richer. Try the Amazon Fire Stick today.", "verified": true, "helpfulness": "0/0", "author": "Sam Wyman"}, {"rating": 4.0, "review": "Really good device for streaming media.... I don't have cable TV but I have hulu Netflix and Amazon prime and my kids love it have one for each of there rooms... I'd recommend it", "verified": true, "helpfulness": "0/0", "author": "frank chavez"}, {"rating": 5.0, "review": "My wife loves it , so that means so do i", "verified": true, "helpfulness": "0/1", "author": "Michael K. Schrader"}, {"rating": 4.0, "review": "So far, we love it - but we haven't tried all the different things it can do yet - so can'treally  give an informed opinion.  I can tell you that we are so glad we got it andwe can't wait to try out all the features!  Very easy to install and very easy to workwith the remote!!", "verified": true, "helpfulness": "0/0", "author": "Jackie"}, {"rating": 5.0, "review": "Love it! Easy to set up- easy to use. I'm looking forward to learning/ using more of the features.", "verified": true, "helpfulness": "0/0", "author": "Nancy Bauer"}, {"rating": 5.0, "review": "This device is amazinggg. I can do practically anything i do on my ipad or laptop on my tv now!! And you can use your phone as a remote if you lose the one thay comes with the stick. (even if you have an iPhone) I've had it for 2 weeks and it hasn't glitched on me yet. $25 well spent, thanks amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Harrison Adams"}, {"rating": 3.0, "review": "This item works most of the time, but still has some problems maintaining connection with WiFi. I have a 25mps modem speed delivered by cable, and it sometimes has trouble maintaining connection. Once it \"grabs hold\" it usually maintains steady streaming of movies on both Amazon and Netflix, the two movie networks I use. When first booted up, it sometimes refuses to connect, seems to loop over and over, and will not play anything; however, it consistently displays the home screen and icons. Unplugging it for three seconds usually fixes the problem and restores steady performance. I find that this \"unplugging\" fix is a nuisance.When I first plugged the stick directly into my HDMI port, I got nothing but problems; almost like it was refusing to get a signal. But when I installed the little \"extender\" cable (about three inches long) it began to give a better response. It gave me the impression that being plugged directly into the back of my TV (it is in a built-in bookcase/hutch that you see in many homes) the WiFi was being blocked by the walls of the bookcase. I began to think that the stick itself needed to be exposed to the open room in order to receive a strong signal. I have no idea why using the 3\" pigtail that comes the the unit provided such improvement, but it did. Still not great, but works okay.Be advised that you cannot use a standard HDMI cable with male connections on both ends to move the stick out into the open so it can receive a stronger signal. It plugs directly into the HDMI port on the back of the TV. If you want to extend it from the back of the TV, be prepared to pay about $20 for a coupler that provides a female end.The remote is a great improvement over the Apple one. It is larger, and feels better to the fingertips. All in all, its not a bad unit, and the price is very good.", "verified": true, "helpfulness": "0/0", "author": "J-Lee"}, {"rating": 5.0, "review": "Easy to use and I do love to binge watch great TV that I'd missed. It's really easy to set up too.  Good investment.....good bye premium channels.", "verified": true, "helpfulness": "1/1", "author": "Kathryn L Davis"}, {"rating": 5.0, "review": "I enjoy the Amazon Fire TV Stick ... in my home it's hard to access regular tv programs and movies .. and I thank you Amazon !", "verified": true, "helpfulness": "0/0", "author": "Rodney Mckee"}]