[{"rating": 5.0, "review": "I own this and the Apple TV. I like them both. The Apple TV however has been very buggy lately, whereas I have not had any issues with the Fire Stick. It is very portable and Amazon ships it to you with your information already on the stick. The only knock is the apps are fairly limited. Remote control is easy to use and responsive. For price/benefit it is one of the best. Can do about everything similar models do but for half the cost. Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Seabass"}, {"rating": 5.0, "review": "Got for introductory price of less than twenty bucks. I have chromecast, apple tv n fire stick. Stick is the one that stick all the time to the TV since I have got it :)Works better than the other two", "verified": true, "helpfulness": "0/0", "author": "ND \"ND\""}, {"rating": 5.0, "review": "Worked fine after a call to tech support resolved a strange error message that kept popping up when I tried to load Apps.", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "In the add, Gary Busey comes to the conclusion that the Fire TV Stick is superior to a sea shell because the sea shell will not plug into the back of his TV.  As it turns out, this reasoning is irrelevant because the Fire TV Stick and a sea shell are virtually identical in their abilities to connect to wifi.Here are five ways that a sea shell outperforms the Fire TV Stick:1) Meets expectations: a sea shell will do everything you expect it to.2) Saves time: you won't waste hours of your time trying to get a sea shell to do something it is incapable of.3) More informed customer service: Amazon customer service CAN tell you why a sea shell can't hold a wifi connection.  However, they do not have information about why a Fire TV Stick can't hold a wifi connection.4) Truly wireless: Because a sea shell doesn't plug into your TV, you can place it anywhere in the room to enjoy the same level of connectivity that the Fire TV Stick offers.5) Less expensive.", "verified": true, "helpfulness": "16/18", "author": "Jeff Cropp"}, {"rating": 5.0, "review": "Simple and very easy to use! Also syncs information from your Amazon Prime accnt before you even use it!", "verified": true, "helpfulness": "0/0", "author": "Tiffany Jen \"TWall1\""}, {"rating": 5.0, "review": "This is an amazing platform for watching movies, watching tv shows, listening to music, and playing games!!", "verified": true, "helpfulness": "0/0", "author": "Adam Gram"}, {"rating": 5.0, "review": "Amazon's Chromecast... comes with prime and will show you the world", "verified": true, "helpfulness": "0/0", "author": "Pelumi"}, {"rating": 5.0, "review": "I plugged it into my TV and followed the instructions.  It was easy to set up and easy to use. All of the shows and movies stream seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Weese"}, {"rating": 3.0, "review": "I purchased this unit to unify my streaming experience on my TV. Between netflix, HBO, and Prime video, this product looked promising. You have to download the apps to the stick which only took a few minutes to install. Streaming from all services except for Plex worked seamlessly.My main complaint is that playing back content from my local Plex server is a constant struggle. I can't watch anything from plex without there being dropped frames or long spans of buffering time. In contrast, I have a Raspberry Pi configured with RasPlex to watch Plex content which works seamlessly with much less hardware than this FireStick has. With the specs of the FireStick, I would have hoped for better playback from Plex. This could be an issue with the Plex app and not the hardware itself, but I want to share my experience with any other users looking for a Plex front end.If you want a cheap Plex front-end, look elsewhere. I am thrilled with RasPlex on a Pi. This product is more intended to stream commercial services.", "verified": true, "helpfulness": "1/1", "author": "Luke20333"}, {"rating": 5.0, "review": "Turned my 6 year old TV into a Smart TV. So easy to install and use it took longer to get the ladder from the garage to reach the wall mount TV.", "verified": true, "helpfulness": "0/0", "author": "John W. Baker"}]