[{"rating": 5.0, "review": "Works as expected.", "verified": true, "helpfulness": "1/1", "author": "Matthew Neu"}, {"rating": 5.0, "review": "excellent gadget for bargain price of $25 at Best Buy.  So many things to watch if you have Amazon Prime or Netflix .  Easy to set up, worked immediately with my home wifi with 5 MBS speed.  I also installed the android Fire Stick app which added voice search for effortless searching.  Somewhat unhappy that some of my old scifi movies were not available or cost too much,  but that is a complaint about Netflix,  not the fault of the Amazon Fire Stick itself..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Amazon ads for the fire tv stick as well as the fire tv stick box feature Plex. So i am pretty tweaked to find I have to pay $5 for the plex app. It's not the cost but the false advertising that i find upsetting.Very limited app library too.  Stick with roku.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!!! For someone who is tired of watching on Laptop, who owns a TV, and doesn't have to listen to commercials is great! If I can install it, anybody can...crazy easy I instruction; simple.", "verified": true, "helpfulness": "2/2", "author": "Cindy"}, {"rating": 1.0, "review": "received one firestick... installed it, connected to my wifi - but after it updated the software, it powered off and never powered back on again.received a replacement firestick - installed it, connected to my wifi - but it kept giving an error that it wasn't able to update.  Did a factory reset, but continued to give the same error.Roku's are so much easier to connect and use... we'll just continue to use the three Roku's we have that don't have any issues.  Just wanted to try the firestick device to have something to compare to - but for this one, there is no comparison.", "verified": true, "helpfulness": "2/4", "author": "Michael Edgerle"}, {"rating": 1.0, "review": "I bought this to replace Roku HD, which was slowing down. Fire TV Stick is even slower. Apps for Fire Stick are limited compared to Roku. Sound comes and goes in all ports on TV.  Product is not ready for Prime Time, just like Fire Phone. Amazon is rushing products that aren't fully baked, which is a shame because shopping on Amazon & Amazon customer service are 5 stars. Screen savers are nice, but I'd rather be able to watch a movie without constant buffering.", "verified": true, "helpfulness": "2/4", "author": "PT"}, {"rating": 1.0, "review": "Purchased this as an add on to our Roku box. The fire stick only offered the same services. We bought for the ability to mirror our tablet and smartphones to the screen. NOT compatible with our products. Please do more research than we did before making the purchase. Took both back to the store.", "verified": true, "helpfulness": "0/3", "author": "c scott smith"}, {"rating": 4.0, "review": "Wifi not the greatest.", "verified": true, "helpfulness": "0/0", "author": "anthony kush"}, {"rating": 4.0, "review": "Weak Wify CD roku", "verified": true, "helpfulness": "0/0", "author": "Luis M. Viera"}, {"rating": 5.0, "review": "Just Love it...easy to use and no commercials", "verified": true, "helpfulness": "1/1", "author": "Debra Martin"}]