[{"rating": 3.0, "review": "eh...  Not too crazy about.  I had basic Roku and comparing between two, me and my kids (9 and 6 yrs old) like the Roku interface better.  Roku was easier to navigate.", "verified": true, "helpfulness": "0/0", "author": "John Lim"}, {"rating": 5.0, "review": "Initially bought two when Amazon was doing discounted pre-orders then bought another two which says how awesome this is.  We have used these in hotel rooms and have one now on every \"non smart\" tv in the house.  They are easy to install.  The only drawback is the remote is light and small and I tend to misplace things so I've had to search for it a couple times.  The device performs smoothly for streaming Netflix and Prime programs.", "verified": true, "helpfulness": "0/0", "author": "Maxie'nMe"}, {"rating": 5.0, "review": "It does exactly what it takes suppose to do with ease.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "Enjoying the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Found I didn't need it", "verified": true, "helpfulness": "0/0", "author": "Anne S. Hohenemser"}, {"rating": 5.0, "review": "Awesome device, this is way better than the Roku I have in my bedroom.  Connecting the Fire TV stick to my living room flat screen was very easy, I didn't even read the instructions.  The price, delivery and product, made this a great purchase!", "verified": true, "helpfulness": "0/0", "author": "BarbbJo \"BJ\""}, {"rating": 5.0, "review": "Very easy to use. The remote is very minimal but has all of the needed options. So far I have mostly used it for Sling and a little bit for Prime videos. I would recommend it for Prime members who want an easy way to watch the Prime videos on their TV.", "verified": true, "helpfulness": "0/0", "author": "Marc \"marc2242\""}, {"rating": 5.0, "review": "Surprised by how good it is.  I bought this during the initial \"Prime members get it half-price!\" weekend for $20, figuring \"what do I have to lose?\"  I already owned several DVRs, Net-capable TV/players, (earlier) Roku, and even a recent Chromecast.  All are functional, but this is my favorite.  I found it significantly easier to setup and use (moving place to place, on home/friend/hotel networks) than any of the others so far.  I haven't had to yet, but I've also read that it has the native ability to \"sign-in\" to hotel networks allowing Wifi access where some can't because of the need to accept local policys for internet access.  I have not tried the listed feature of displaying local PC/tablet devices to the main screen (while that feature was frequently problematic for my chromecast).  Even at regular price, it'd make a good travel streaming appliance (as long as you can get to the HDMI/USB power ports).", "verified": true, "helpfulness": "0/0", "author": "Edward Jaffe"}, {"rating": 5.0, "review": "Great product, nice and compact", "verified": true, "helpfulness": "0/0", "author": "hGarcia"}, {"rating": 4.0, "review": "I was worried my 3mb DSL connection might not be able to handle streaming, but its working great.  Only wish it was possible to browse all free prime content.  But all in all, the fire stick is definitely worth the small price, if you're already paying for Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Trooper"}]