[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Fred A Glasgow"}, {"rating": 4.0, "review": "Amazon should be ashamed of their bait and switch tactics on prime day with this device.  It's not available for their discounted price even though it's a deal scheduled to last all day, but you can order it at the full retail cost.  I have one purchased at the release date for the preorder price of $20, and was looking for a second at $24, but it seems this was your standard bait and switch.Update (7/31/2015): After e-mailing them directly about the issue, they did honor the $24 price.  To elaborate on the product itself, the advantage over the chromecast is the dedicated remote.  Like the Chromecast and nearly every other device out there except the GoogleTV boxes, this requires a separate HDMI input.  I'm still a GoogleTV fan that allows seamlessly moving from your TV/Cable tuner to other apps.  The FIrestick is a nice product and the interface is easy to use.  It's different from Chromecast in that you can go directly to apps and launch them rather than load an app on your phone and cast it to the TV although I believe you have that option on the Firestick.  One concerning item is the stick's insistence on using the AC adapter rather than plugging the USB into something like your TV so that it only runs when the TV is on, I'm not sure why that it is, but it should run (and does) although it indicates it might not be at optimal performance and I haven't actually figured out what that means.", "verified": true, "helpfulness": "9/13", "author": "mikeydubs23"}, {"rating": 5.0, "review": "More than we expected, love it!!!", "verified": true, "helpfulness": "0/0", "author": "Robert  W.  Brown"}, {"rating": 5.0, "review": "Prime's choices aren't so hot yet, not like Netflix anyway IMO, but this machine is remarkable, gives you immediate hook-up access to dozens of apps before you even ask for them, both free and subscribe. I keep the power supply on continuously and have verizon 25/25, tv's about 45 ft across 3 rooms from the server. The Stick's performance has been flawless after the first month both in reliability and in amount of stuff to watch or listen to. We have more shows and movies lined up than we ever had available with cable - 37 bucks for the stick and about a hundred a year for Prime. That's still less than just a month of tv and fees and taxes with Verizon. We're using 6 months of the savings to get a bigger tv woo hoo! Excellent sound from the music apps too. Now if we can just find some sports. But as far as the Stick goes, you're reading this from one very satisfied customer.", "verified": true, "helpfulness": "0/0", "author": "Kurt Smith"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Kim Wester \"scribbles mom\""}, {"rating": 5.0, "review": "Travel a lot. Super easy. Love it", "verified": true, "helpfulness": "0/0", "author": "Rosa Breazel"}, {"rating": 5.0, "review": "Bought it today arrived today, downloading Netflix took less then a minute added music to my library on my comp it immediately showed up on the TV definitely a nice little deal and product for the money. If you have music and movies through amazon and maybe even Netflix def buy this.", "verified": true, "helpfulness": "0/0", "author": "M Tro"}, {"rating": 5.0, "review": "Wonderful super fast all that I expected and more", "verified": true, "helpfulness": "0/0", "author": "ottto"}, {"rating": 3.0, "review": "Once I got it working (so far) after about 4 hours of messing with it, it seems to be a decent little device. I am using it for prime and hbo Go, and as long as it has signal it seems to work okay.My biggest problem with this thing is that it's ability to pick up a WiFi signal sucks. I have a lot of devices connected via wifi with absolutely no problems....until I tried to connect this little guy. I put it on the TV I planned on using it with and installed a WiFi booster near it just to make sure. when doing the network setup, it detected my network with max bars for signal but then immediately disconnected...I retired this repeatedly during the setup with the same results. After I got frustrated with that, I brought it down to another TV about 3 feet from my router, only to experience the same issue for about 3 hours while trying different things and configurations on my router to get it to work, including changing the channel of my router to various channels in case there was some sort of interference that none of the other 9 wireless items near that TV were getting, but somehow the fire stick was (it should be noted that it would bounce back and forth from max signal to no signal repeatedly)...still the same problem with only a brief break where I could actually stream on it for 5 minutes with decent quality.Finally after changing and trying multiple things I finally took it back to the TV I originally started with and plugged in my wifi booster about 3 feet away, figuring what the hell I'll try it one more time on the TV I started with and if it doesn't work, return it....well for now it has worked with high quality for about 30 minutes (which is a record so far by a long shot). If all continues to go well I will leave this at three stars due to the fact it's nice when working, but caused me to blow my entire evening getting it to work. However, if it fails again like it was, I will be returning it and marking it down to 1 star which would be the most anything deserves that doesn't work as it should", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "Works well and fast shipment too!", "verified": true, "helpfulness": "0/0", "author": "Scott99"}]