[{"rating": 5.0, "review": "I purchased a Chromecast shortly after they came out, and I loved it. Then Amazon announced the Fire Stick and had the special for Prime members where it was $19, so I thought, \"Hey, we could use another one for the bedroom, for that price, why not?\" I didn't really expect too much out of it. I was excited by the prospect of being able to watch things on Prime Instant Video without having to hook my laptop up to the tv, but even that isn't much of an inconvenience. I bought the Fire Stick because it was cheap.After having it for a couple of months, I am seriously considering replacing my Chromecast with another Fire Stick. We have already moved the Fire Stick to the living room (where we watch the most tv). I appreciate that the Fire Stick has a remote and an interface. Like the Chromecast, you can control it from your phone, but you don't have to. You don't have to have all of the apps on your phone in order to use them on your Fire Stick. I appreciate this because I don't watch tv on my phone. Netflix, HBO Go, Hulu, etc, are all just taking up space so I can use the apps with my Chromecast. I also appreciate the interface because you can browse through the different apps right on your tv. It is super user-friendly, and I absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 5.0, "review": "It's easy. It works great! Streams fast and consistently.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 3.0, "review": "You must connect to a network before you can do anything with this device. In some cases you need to configure the device or look up information in configuration screens before a network will allow you to connect to it. When this happens you will need to find a different network to connect to, look up the configuration information or make the changes, then return to the network you intend to use to connect with the changes. This is not so much a design flaw as a collision between workflows, with the device and the network enforcing mutually exclusive rules. But you should know this before buying one and trying to connect to (for instance) a hotel wireless network out of the box.Ignore the rating - this review feature requires a star rating to submit the review but I have not been able to access device features to review things like performance, general (non-startup) interface, and so on.", "verified": true, "helpfulness": "0/1", "author": "Stacy Allston"}, {"rating": 4.0, "review": "I like it, but the usuability could be a little more smooth and the remote could be a little less sensitive. I'm happy with it.", "verified": true, "helpfulness": "0/0", "author": "#HXNNXH"}, {"rating": 4.0, "review": "Product very easy to use. The only thing I see that could use improvement is more power as far as wireless signal is concerned. I am getting some buffering issues but very minimal.", "verified": true, "helpfulness": "0/0", "author": "TC"}, {"rating": 4.0, "review": "good, but wish the directional buttons are a bit taller like the fire TV, easier to feel.", "verified": true, "helpfulness": "0/0", "author": "Sapi Mati"}, {"rating": 5.0, "review": "Amazing what this stick can do !", "verified": true, "helpfulness": "0/0", "author": "Christine Grandfield"}, {"rating": 4.0, "review": "Has a mind of its own. When it works it's good. The movie rentals should be free.", "verified": true, "helpfulness": "0/0", "author": "fishingwilly"}, {"rating": 5.0, "review": "this thing is simple and effective. love it so much i bought 2", "verified": true, "helpfulness": "0/0", "author": "brian nichols"}, {"rating": 4.0, "review": "So far, great.", "verified": true, "helpfulness": "0/0", "author": "bob carlson"}]