[{"rating": 5.0, "review": "I really enjoy the free movies and tv showsm well worth the investment.", "verified": true, "helpfulness": "0/0", "author": "thomas gallegos"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Francisco C."}, {"rating": 5.0, "review": "Easy to use!!  Now the kids can watch Netflix and Amazon Prime shows without me paying extra for an additional cable box!", "verified": true, "helpfulness": "0/0", "author": "C. Kloehs \"web shopper\""}, {"rating": 5.0, "review": "The Device I always wait for.", "verified": true, "helpfulness": "0/0", "author": "Oliver Javier"}, {"rating": 5.0, "review": "Great product! Easy to use and has tons of variety as far as what you can do with a gadget like this!", "verified": true, "helpfulness": "0/0", "author": "Leslie"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It doesn't get full stars because I can't get my Google movies, and because I can't get Facebook to work or Google plus I can't sign into flixster. The flixster issue is mostly with them, and because they have horrible customer service. But, because I can't get google... I'm screwed. I have a roku also. That works better. If you only use prime though, you will love the firestick!", "verified": true, "helpfulness": "0/0", "author": "Melinda ince"}, {"rating": 4.0, "review": "I have been trying to fine a easy way to get netflix and youtube in my bedroom.  This is a slick, easy to use way that beats getting a smart blu ray player.  it's easy to use and navigate and  even the simple remote is nice. it responds quickly unlike older apple tv, where the movement on the cursor when using the remote is slow.  For the price you can't beat it. It's to bad that HDMI isn't like USB where it could power a device that would definately give 5 stars.  great packaging and presentation.  Set up is idiot proof.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "Works as advertised. Snap to install. Menu is simple and clean. More importantly, it streams perfectly - assuming you have decent bandwidth.", "verified": true, "helpfulness": "0/0", "author": "JPro"}, {"rating": 5.0, "review": "Really easy to set up and operate. I bought it for it's 2.5G or 5G capability. I'm running it at 5G and my microwave oven does not bother it one bit.", "verified": true, "helpfulness": "0/0", "author": "Keepwell"}]