[{"rating": 5.0, "review": "Very easy to use.  I do have to reboot it sometimes when it has issues during playback on Netflix, but otherwise inexpensive and simple.Bruce", "verified": true, "helpfulness": "0/0", "author": "B. Henry \"Henry\""}, {"rating": 5.0, "review": "Love it! Simple user interface, easy to use. Fast, inexpensive. gives access to all Amazon Prime perks. I like the TV box better, but this works almost the same and is an cheap way to add Prime to a second TV. I may even get a 2nd stick for the TV in my spare bedroom. Wish I had brought it with me on an extended vacation.", "verified": true, "helpfulness": "0/0", "author": "deucecoop"}, {"rating": 5.0, "review": "I love my \"entertainment\" source.For some reason, my remote was not included, but Amazon resolved issue by re-sending me a remote promptly.Would highly recommend to anyone and everyone!", "verified": true, "helpfulness": "0/0", "author": "Gee"}, {"rating": 5.0, "review": "love this product", "verified": true, "helpfulness": "0/0", "author": "Captain Smittles"}, {"rating": 5.0, "review": "Way better than Chromecast. The Fire stick has more functionality & features than Chromecast, and the remote is awesome. I have 2 Chromecasts currently and recently bought the fire stick. If you're choosing between a Chromecast and the Amazon Fire Stick, go with the Fire Stick. You won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Seth T Wilcock"}, {"rating": 5.0, "review": "I will hand it to Amazon with this product, they really did a bang up job.I use this primarily for work as a Paramedic detailed to 3 different stations over the course of the work week. At station 1 we habe a smart tv, but not at the other 2. So I was reduced to watching all my stuff on my iPad. I had experimented with my apple tv but found it to be too inconvenient between constantly moving back and forth.This I just wind up and place in my pocket. No cennectivity issues between home and the other 2 substations. Picture quality and streaming is great. Very simple to use. And the remote works well enough.No complaints at all.", "verified": true, "helpfulness": "0/0", "author": "Andrew Hoyt"}, {"rating": 5.0, "review": "just recently started using this. cant figuere how to add apps i want and not only recommended apps but loving it already downgraded my cable to save money 70 bucks a month cheaper now.", "verified": true, "helpfulness": "0/0", "author": "richard samburgh"}, {"rating": 5.0, "review": "After our house was broken into and out PS3 stolen, I was looking for a new way to watch streaming TV that wasn't as expensive as a new gaming system. I wish I had gotten the Fire Stick much sooner. Very easy to use and has access to all of our streaming apps (Netflix hulu youtube). I love the mobility of it as you can take it from on TV to another. Although the price is low enough to get a couple of them for multiple TV's. I would definitely recommend and would be again if needed.", "verified": true, "helpfulness": "0/0", "author": "Meagan Klutz"}, {"rating": 5.0, "review": "Love it finally something that actually does what it claim it can do.", "verified": true, "helpfulness": "0/0", "author": "Ms. Cora"}, {"rating": 1.0, "review": "I was excited to find an alternative to the other brand streaming device. This product wouldn't pick up a wifi signal until I put it in tha same room as the wifi router. Very disappointed and returned it for a refund. I'll look elsewhere for something that will do what it is advertised to do.", "verified": true, "helpfulness": "0/0", "author": "Jocko \"Leonard Olson\""}]