[{"rating": 5.0, "review": "I've had a chromecast since it first came out and I really like it. I bought this for $19 when it was first announced. Like all Amazon electronic devices I feel like this is a pipeline to get people to buy products from Amazon but I have no issue with that. I've been a prime member for years and I watch movies occasionally. This makes that easier so whats not to like. When you first use it there it there is a \"corny\" intro for people who have never used something like this but it can be skipped. $39 is cheaper than a roku, or Apple tv and while these are not intended to replace those devices I think they can be a cheaper alternative with some of the same features like Netflix and Hulu plus if you just want to stream movies.The remote is handy and you can download an app for your phone so you can use your phone as a remote too. Personally I hate having another remote control but I don't want more crap on my phone either so I just stick it in a drawer.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 3.0, "review": "It Works fine but I see no difference than my firetv. so kind of a waste of space and hmdi port.", "verified": true, "helpfulness": "0/1", "author": "bothreed"}, {"rating": 1.0, "review": "Initially took a long time to download and install updates. This is a \"feature\" of new tech that I do not appreciate.Setup was easy, if annoying. No, you can't skip the introductory video.Unfortunately, it will randomly turn off my TV, and render it incapable of turning back on until the Fire Stick is removed. Moved it around in the HDMI slots, unplugged other HDMI devices, but to no avail.Since I got it with the Prime discount it's not worth the time to return it. Could be a re-gift opportunity.", "verified": true, "helpfulness": "1/3", "author": "401kBoy"}, {"rating": 4.0, "review": "Easy set up; my Internet connection can be slow, so it took a little bit longer (minutes) but was still easy. Hulu+ wasn't part of the set  item so I had to menu through to find it, which was easy enough.My only \"?\" moment was that it had to download new software- it was new out of the box and had just launched. Why was there anything that needed  to be downloaded as \"new\" so soon? Once I got passed that, it's fine.I chose Fire over Chromecast or other options because I like how small it is (unlike another box) but unlike Chromecast, there's an option to plug it into the wall to power it as my TV is just old enough that it doesn't have the port that Chromecast requires to power the device.", "verified": true, "helpfulness": "0/0", "author": "Andrea K"}, {"rating": 3.0, "review": "Seems to work okay.  Have had to unplug it and plug it back in a few times when it freezes up.  Speaking of which, the description is kind of misleading - it needs to be plugged in to a power source.  You have to scroll down to the \"technical details\" to see that info. Maybe I'm the only one who was lead to believe that it only needed to be plugged into the TV.  The only thing I like more about this than my Roku 3 is the price.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Good offering from Amazon for streaming from Amazon Prime, NetFlix, HuluPlus, etc.  Good for a guest room or home office that has a smaller TV that you don't want to connect a cable box to.  Happy with the Fire TV Stick's performance.", "verified": true, "helpfulness": "0/0", "author": "A Gentleman \"Cool Breeze\""}, {"rating": 3.0, "review": "It's really only great if it's all you have to do what it does, and you like spending money on individual shows a lot.Positives:+ It's inexpensive+ It works largely as advertised (exceptions below)+ The controller is simple+ It's tiny, easily hidden and neat+ Lots of shows, movies and songs available if you're fabulously wealthyNegatives:- The controller and interface are simple to the point of madness- Finding and adding shows/etc. that aren't being pushed to you is teeth-grindingly fiddly- Music searches are even worse- Prime movies/etc. are largely drek- The service starts feeling expensive if you don't love drek ($90+ a year and rentals on top)- If you already have a media PC, a gaming console, or a smart TV, you have this thing beat by furlongs", "verified": true, "helpfulness": "0/1", "author": "diskinetic \"Geek translator!\""}, {"rating": 5.0, "review": "The stick works really well and because it is so small, it takes up no space by my TV. The remote is intuitive and the app selection is really good. Now it only needs HBO Go support and it ill be the perfect device. For $40, you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Brent Metcalfe"}, {"rating": 4.0, "review": "I purchased the stick with it's introductory price of $20 and I really like it for the price I paid. I was especially thrilled when I got way before the original estimated delivery date. I used to only have the Apple TV and while that works extremely well with my other Apple products but I have to mirror my iPad when I want to watch any content from the Amazon Prime account and it can get pretty annoying. Aside from the Amazon apps, most of the apps are the same in the Apple TV and the Fire TV stick but I was drawn to this because it is a great way to get more out of my Amazon Prime membership.The only thing I do not like is the home screen. With the Apple TV all my apps are displayed on the home screen. So if I want to switch from Netflix to Hulu or iTunes I just have to go to home and from there I can scroll up or down, left or right until I get to the desired app. On the Fire Stick, it's a little more work than that. What can I say? I'm a lazy person. Other than that the Fire Stick is perfect.Wish they would offer them at that price again. It would be a really good and inexpensive Christmas present!", "verified": true, "helpfulness": "0/0", "author": "ladydi37"}, {"rating": 3.0, "review": "It streams our Netflix more effectively.  I was really hoping for it to help with Hulu.  We can't maximize our internet streaming anymore and I was hopeful this would help.  It didn't.  I need to have more time with it to know its further use.", "verified": true, "helpfulness": "0/0", "author": "BG \"Beth\""}]