[{"rating": 5.0, "review": "Having so much fun! Orange is the New Black and Californication! Fun stuff for the kids too...corrupting them with Pee Wee's Playhouse!", "verified": true, "helpfulness": "0/0", "author": "darbeach"}, {"rating": 5.0, "review": "Revolutionizing movie watching.  I really like this product.  May buy another.", "verified": true, "helpfulness": "0/0", "author": "Welch \"LWWelch\""}, {"rating": 3.0, "review": "Physical review: awful.  The unit is too wide to plug into an HDMI port next to other stuff (shoulders are too wide), so you have to use the included short cable.  So now it's a dangling thing.  Then it DOES NOT WORK WITHOUT USB POWER which plugs into the side of the stick. And if you use the power supply that Amazon includes, it is too wide to plug in to any power without blocking another outlet.  On my two-to-six adapter, it blocked the receptacle above it and the one next to it, taking up 3 spaces.  So now you have a gangly mess: 2-3 receptacles wasted for power to a block dangling from another cable.  The reason I bought it was the $19.95 initial price.  I think it's worth that.  But it's sure not classy like an Apple product!", "verified": true, "helpfulness": "89/98", "author": "Dan H."}, {"rating": 5.0, "review": "Works as I'd expect", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 5.0, "review": "We are really enjoying our new Amazon Fire Stick!  It gives us so any options for what we want to watch and is easy to use!", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "TV, gaming, quick and easy set up....what more could you ask for!", "verified": true, "helpfulness": "0/0", "author": "A. Dinglebunny"}, {"rating": 5.0, "review": "Cool", "verified": true, "helpfulness": "0/0", "author": "Calvin M."}, {"rating": 4.0, "review": "So far I really like the programming that is made available with the Fire Stick.  My main issues (and why I rated it a four star) is in two things.  First, I really wish the power cable would mount in the end vice the side of the unit, this design forces me to use the extension.  Second, would be he big issue I have with the Firs Stick taking over my TV when I turn it on.  I have a Harmony One remote that sets my TV to the correct input (HDMI2 for example), as soon as the Stick powers up the TV jumps to its input.  If there is a way for me to stop this I would love to hear it.", "verified": true, "helpfulness": "1/1", "author": "Scott M. Aldridge"}, {"rating": 4.0, "review": "It is an easy to use logical addition to our family due to the volume of prime videos we stream. It is easy to install and move from TV to TV. We even take it on the road when we travel.", "verified": true, "helpfulness": "0/0", "author": "Shelby Balser"}, {"rating": 1.0, "review": "I must have gotten a lemon. Didn't work at all. Flashed green noise onto the screen, couldn't stream high def even though it was 6 feet from my router.", "verified": true, "helpfulness": "1/2", "author": "Ghezbora"}]