[{"rating": 5.0, "review": "Fastest thing out.", "verified": true, "helpfulness": "0/0", "author": "DEREK D MAYLOTT"}, {"rating": 4.0, "review": "Awesome for the price! It keeps making me re authenticate hulu plus though. I am powering it from the TV USB so that could be the issue.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Hutcheon"}, {"rating": 3.0, "review": "it works really great but its very amazon prime dependant. It would be nice to have the voice search integrated with netflix and vevo.Also i though the mirroring feature was a better solution but it only works for a few devices. I think that extending this to more devices and platforms will help de user to decide to buy this wonderful device. Many of the amazon apps available allow the user to mirror or cast from an apple device, but none of them are working fine, i think amazon could add this feature and make it work properly.The geographical limitation is still a big problem, and that causes many possible customer choose other solution like chromecast or apple tv.", "verified": true, "helpfulness": "0/0", "author": "Lucas Napoli"}, {"rating": 4.0, "review": "Great item,  amazing variety of apps an shows,  I really wish they had more access to apps  an more shows.  Downside if you  don't have fast Internet speed above 20 mbps  your stick will freeze an say there is no Internet connection", "verified": true, "helpfulness": "0/0", "author": "Dennis"}, {"rating": 4.0, "review": "good tv", "verified": true, "helpfulness": "0/1", "author": "Audrey Paul"}, {"rating": 5.0, "review": "This thing works great! Easy to set up. I am very pleased with it so far.....", "verified": true, "helpfulness": "0/0", "author": "Johnny Kenneth Lowe"}, {"rating": 5.0, "review": "Works great! Has officially made my non smart tv as smart as can be. Couldn't be happier", "verified": true, "helpfulness": "0/0", "author": "Megan"}, {"rating": 5.0, "review": "Awesome. Couldn't be more pleased", "verified": true, "helpfulness": "0/0", "author": "John Smeaton"}, {"rating": 2.0, "review": "Needs to have HBO 2 GO to be worthwhile.Constantly stops working and you have to go back into the app, very annoying", "verified": true, "helpfulness": "0/0", "author": "Matthew Richard Elston"}, {"rating": 5.0, "review": "Waited almost 30 days for it to ship but set up was easy and works as expected!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]