[{"rating": 5.0, "review": "Very happy with it.  The remote is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "J. Corby \"Firefighter\""}, {"rating": 5.0, "review": "Love it! It does just about everything a tablet can except on my big flat screen t.v. My daughter loves the games.", "verified": true, "helpfulness": "0/0", "author": "THONE"}, {"rating": 5.0, "review": "AMAZING! Love that I can control from the fantastic remote or my kindle fire. Being a Prime member, my husband and I are catching up on tons of shows and series. Watching and purchasing movies could not be easier. The format and design of the screens is very user friendly. Telling everyone I know to purchase one", "verified": true, "helpfulness": "0/0", "author": "Kim Szalkai"}, {"rating": 5.0, "review": "Works great! Doesn't take up space. I wish vudu and disney movies anywhere were available for fire devices.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I can’t fully rate the Firestick yet because by 2009 Samsung TV – despite documentation to be HDCP compliant and a history of working with an older Roku unit and BlueRay DVD player – does not appear to be HDCP compatible (or at least the flavor employed by the Firestick) which means that I can't view any Hulu, Amazon, or Netflix content. I get the infamous blue screen message on any of these sources with audio but no picture. This problem is not unique to me based on other reviews so I have taken a leap of faith in that adding an HDMI splitter to the equation will effectively strip out the HDCP mismatch and get me working. I did try all other simple recommendations (Firestick firmware / software update, swap HDMI port, full power resets, etc. to no avail).  The HDMI splitter will add $23 to the cost of this solution which depresses the value somewhat. Note that Sling TV, YouTube, and Pandora work fine.I will update this review and potentially star rating after I get the splitter in place and ascertain whether it works or if I will be returning it. Given the frequency of this issue I think Amazon could do a better job is either establishing / publishing device compatibility requirements or ensuring their device was less narrow on what it deemed HDCP compliant. So far this seems to be a much rockier start then I would expected for a media 'appliance'.", "verified": true, "helpfulness": "0/0", "author": "The Gooch"}, {"rating": 4.0, "review": "Worked as advertised - easy set-up", "verified": true, "helpfulness": "0/0", "author": "David Clegg"}, {"rating": 5.0, "review": "Love this device!  If I could control the Stick's product managers, I would ask for two enhancements.1) Control volume from the Stick2) Draw power from its TV to avoid dangling cordsGood job!", "verified": true, "helpfulness": "0/0", "author": "John  James"}, {"rating": 5.0, "review": "It basically makes any TV a smart tv!", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Phil McLain"}, {"rating": 5.0, "review": "I am very happy with my recent purchase of the Amazon Fire Stick. I purchased it as a replacement for a last generation console system I used to stream content. Compared to other streaming devices I own, I don't have the issues with buffering or hanging. The picture quality is great and the interfaces with Netflix and Hulu plus are fluid and not clunky as with other device services. At the time of this review I have not fully explored all the potential within the product but I feel with what I've seen it is a welcome edition to our AV setup.", "verified": true, "helpfulness": "0/0", "author": "William Hampp"}]