[{"rating": 5.0, "review": "Very easy to use.  We probably get more use out of this then any other products we have tried that is similar.  For the price, you get much more value than you would expect.  I am very pleased with our purchase and look forward to using all of the features it offers.", "verified": true, "helpfulness": "0/0", "author": "djlucas"}, {"rating": 1.0, "review": "I bought a fire TV stick to watch mlb.tv and the video was unwatchable on a 30 mbps connection, It was constantly buffering.", "verified": true, "helpfulness": "0/0", "author": "ACE"}, {"rating": 5.0, "review": "I have prime membership and I love the fact I can watch my tv shows and movies so easily. I also like the fact if you loose your remote Amazon has provided an app for your smart phone.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this! My son uses it all the time to watch Netflix. Is a pretty easy way to stream videos and movies! Please click \"Helpful\" if this helped you decide. Thank you", "verified": false, "helpfulness": "0/0", "author": "Johan M."}, {"rating": 5.0, "review": "LOVE LOVE LOVE IT!!!!  It works great and the best part is that you can dowload the app and use your phone as the remote.  No more looking around for that darn remote, I can just use my phone!!!!  I have the Roku on our boat but really like the fire stick better.  When I ordered through my prime account all I need to do was plug it in and it already had all my account information.", "verified": true, "helpfulness": "0/0", "author": "Debbie cito"}, {"rating": 5.0, "review": "Amazing product.", "verified": true, "helpfulness": "0/0", "author": "Rod Richardson"}, {"rating": 5.0, "review": "Plugged it in, and it linked up immediately.  I was browsing for movies literally within 5 minutes.  This is a great device - get one!", "verified": true, "helpfulness": "0/0", "author": "Ghost"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Matilde Morel"}, {"rating": 5.0, "review": "it's just awesome! easy simple to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Sejin Oh"}, {"rating": 4.0, "review": "nice addition and simple to use", "verified": true, "helpfulness": "0/0", "author": "Bob Huffman"}]