[{"rating": 5.0, "review": "I love it!!", "verified": true, "helpfulness": "0/0", "author": "ivich"}, {"rating": 5.0, "review": "Great device.Excellent Value. Easy Setup.", "verified": true, "helpfulness": "0/0", "author": "Nancy A Wiesen"}, {"rating": 5.0, "review": "This was so was to use.  We love it.", "verified": true, "helpfulness": "0/0", "author": "jennifer stokes"}, {"rating": 5.0, "review": "Very pleased.  Great picture.  Easy to use", "verified": true, "helpfulness": "0/0", "author": "Theresa G. Boyd"}, {"rating": 4.0, "review": "This is a great accessory, the fact that I got it for free with a Sling TV coupon helps too! It works great and is very intuitive, I like that it comes with a remote too, and has an interface unlike the Chromecast (which I also own, and plan on returning). What the Chromecast has over this is ease of casting webpages. Since I currently work off a Mac, I can't use Miracast and so that knocks off a half of a star for me. The other half star is because sometimes I'll be watching Sling TV and it will shoot back to the home screen randomly, but it's rare. I would probably buy for $30, at full price the Chromecast still beats it. I would even buy this over Chromecast at $35.", "verified": true, "helpfulness": "0/0", "author": "Daniel Rincon"}, {"rating": 4.0, "review": "I just wish there were more up to date movies on Prime..... there's even a lot of older movies you have to \"rent\" that you would expect to probably be on Prime.  However; we do really enjoy this, it makes renting movies so much easier!", "verified": true, "helpfulness": "0/0", "author": "Joy"}, {"rating": 3.0, "review": "Fire tv didn't work for me at first. After getting the HDCP unauthorized content disabled blue screen when trying to watch prime video I tried the list of fixes. Nothing worked until I found a work around. If you tv is a few years old you will probably have the same problem. If you plug the fire tv into a  ViewHD 2 Port 1x2 Powered HDMI Mini Splitter for 1080P & 3D it work with out a glitch. Once I used that HDMI splitter the firetv has worked flawlessly. If Amazon had alerted me prior to purchase that this was necessary for tvs even four years old I would've given the product 5 stars. A little more disclosure from Amazon would go along way in my book.", "verified": true, "helpfulness": "0/0", "author": "James Brandon Holley"}, {"rating": 5.0, "review": "We all know Amazon Fire Stick is amazing!!!", "verified": true, "helpfulness": "0/0", "author": "Derick Coleman"}, {"rating": 2.0, "review": "There are not many channels on here that you cannot get on Apple TV - if you have a PS3 you can get the Amazon Prime on there to watch shows/movies.  This disconnects from the internet while watching ESPN all of the time, the feed goes in and out.  Does not do it with Apple TV.  For $20 extra bucks buy that.", "verified": true, "helpfulness": "1/2", "author": "brett"}, {"rating": 5.0, "review": "I love my new fire stick! I was using an outdated wii before and I'm so glad I made this upgrade.", "verified": true, "helpfulness": "0/0", "author": "FatZebras7"}]