[{"rating": 5.0, "review": "Great product.  It's simple, cheap and provides me with everything I need for my secondary (non-smart) TV in my bedroom.  The easy to use remote works great and doesn't require me to point it directly at my TV in order for it to work.  I am able to view Amazon Prime, Netflix, ESPN and videos stored on my local network storage (via a free app).  Does everything I need and I have no problems with lag/performance switching apps or with streaming video (local or from the internet).  Couldn't be happier!", "verified": true, "helpfulness": "0/0", "author": "W. Todd"}, {"rating": 5.0, "review": "love it ... works very well ... not hard to set up and comes with your acct info set in ..was great >>>>>", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I totally LOVE it. It's amazing", "verified": true, "helpfulness": "0/0", "author": "Tondy"}, {"rating": 5.0, "review": "Easy to hook up and to get to working. Have not had any time to watch. Will post another review after I use it for awhile.", "verified": true, "helpfulness": "0/0", "author": "David King"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "DEBRA GANNON"}, {"rating": 5.0, "review": "The Fire TV Stick was easy to install and works great. Combined with the Amazon Prime you get free movies and TV shows, plus free shipping.", "verified": true, "helpfulness": "0/0", "author": "sunny in pasadena"}, {"rating": 5.0, "review": "So easy to set up and use.  Just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Schwartz"}, {"rating": 5.0, "review": "It was a great purchase. We aré enjoying everything about it~", "verified": true, "helpfulness": "0/0", "author": "Andria R. B Quintero"}, {"rating": 4.0, "review": "Didn't realize I still have to subscribe to services..know you get a ton load of free stuff. But don't see much difference than buying local on comcast, uverse etc. It may be just me, but don't think I heard ever you had to subscribe..", "verified": true, "helpfulness": "0/0", "author": "NANCY \"N HOLLY\""}, {"rating": 5.0, "review": "Luv it. Especially when traveling. Its convenient and save you on the extra hotel charges to watch movies and subscribe channels.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]