[{"rating": 5.0, "review": "Was very easy to set up right out of the box.  Also much faster than Apple TV.", "verified": true, "helpfulness": "0/1", "author": "Love AZ"}, {"rating": 4.0, "review": "Does what it says it does.", "verified": true, "helpfulness": "0/1", "author": "BK"}, {"rating": 2.0, "review": "The fire stick is great when it works. unfortunately mine seems to overheat and shut itself off every half hour or so. I then half to get up, unplug it from the back of the tv for a few seconds and then plug it back in. that doesn't seem like a big deal until about the fourth time it shuts itself off while your streaming a movie on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I followed instructions included, but fire stick does not work. I have a Samsung tv and Direct Tv with wireless internet. Have checked the batteries, which are ok.", "verified": true, "helpfulness": "0/0", "author": "Sylvia F. Ford"}, {"rating": 3.0, "review": "Good price, decent wireless speed and flexible (Hulu, Netflix and Amazon) but can be a bit quirky and would be nice to have an on/off.  Great travel and second device.", "verified": true, "helpfulness": "1/1", "author": "john a giouvalakis"}, {"rating": 5.0, "review": "Works great. Does exactly what I wanted to do. Can watch on my Amazon videos and Netflix. Perfect", "verified": true, "helpfulness": "0/1", "author": "Nanci Hunt"}, {"rating": 5.0, "review": "Go anywhere there is internet and get a perfect picture.", "verified": true, "helpfulness": "0/1", "author": "Idlehr"}, {"rating": 4.0, "review": "Fire TV stick has far exceeded my expectations. Still learning how to. Use it.", "verified": true, "helpfulness": "0/1", "author": "Ann B. Ridenhour"}, {"rating": 5.0, "review": "Like the product very much but you must have strong Wi-Fi", "verified": true, "helpfulness": "1/1", "author": "Cynthia A. Davis"}, {"rating": 4.0, "review": "Shipped last as normal.  Unfortunately 2 day shipping has been almost consistently 4 day shipping for the last 3 months.  The product itself worked as expected.  Easy to plug in and play.", "verified": true, "helpfulness": "1/1", "author": "Kevin Dailey"}]