[{"rating": 5.0, "review": "great.", "verified": true, "helpfulness": "0/0", "author": "sharon nunes"}, {"rating": 5.0, "review": "This is awesome. Much easier to deal with than a Roku and with more options.  My 7 year old can use it without being given instructions.  Installation is easy.", "verified": true, "helpfulness": "0/0", "author": "MC Spats \"Marie Norcia\""}, {"rating": 5.0, "review": "Bought it as a gift.  It was the hit of the holiday!  Better than Xbox.", "verified": true, "helpfulness": "0/0", "author": "The Arkenstone \"Village Witch\""}, {"rating": 4.0, "review": "Not as good as a Roku, but better than a Chromecast.  The remote is an especially welcome feature and the menu is pretty easy to navigate.  My only gripe is it seems to lose the connection a lot and always reports my internet connection as \"Very Good (with problems)\" but never gives details as to what the problem is.Overall this is great for a spare bedroom TV or a kid's room TV, but I wouldn't want this to be my main go-to in a living room.", "verified": true, "helpfulness": "0/0", "author": "Joey"}, {"rating": 5.0, "review": "Better than chrome, with more to offer and faster.", "verified": true, "helpfulness": "0/0", "author": "Brig5150"}, {"rating": 4.0, "review": "the stick gets hot and then stops working; cool it down and it is back working.", "verified": true, "helpfulness": "0/0", "author": "Katherine Krouch"}, {"rating": 4.0, "review": "I like the Fire TV Stick so far I will update in a few more weeks as I just got mines a few weeks ago", "verified": true, "helpfulness": "0/0", "author": "NDM"}, {"rating": 1.0, "review": "Netfix never loaded-constant server error, even when Netflix loads without any problems on Apple TV and Roku.  Hulu plus loads, but does not play.  Very disappointed.  Thumbs down! Would not recommend this product.  Requires too much troubleshooting to get the sound to play", "verified": true, "helpfulness": "1/2", "author": "Charle"}, {"rating": 5.0, "review": "Best deal ever. We are Prime members so we were able to preorder them before they were released for $20...so easy to use, my 4 and 5 yr old can find their own shows. I wish I would have gotten one for every tv we have!", "verified": true, "helpfulness": "0/0", "author": "amplutz"}, {"rating": 5.0, "review": "lOVE IT... AND THE DEAL I GOT ON THE DEAL OF THE DAY.  IT WAS WORTH THE WAIT!", "verified": true, "helpfulness": "0/0", "author": "Torres \"DT\""}]