[{"rating": 5.0, "review": "The setup was very easy. I am happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Marie J Quinn"}, {"rating": 4.0, "review": "It pretty much worked as advertised.  Some issues were not major at all.  When installed about 10-15 minutes to update software, put in your amazon info and you are running. All in HD except for older TV shows originally broadcast in 4:3.  One con I knew about was did not yet work with HBO Go but is supposed to work shortly.  The item I was not aware was that you needed to use the AC power cord instead of the USB connection.  The box includes both connections but I had to provide power strip.  No big deal for me since the alternative was Chromecast where I needed to bring a PC, tablet or cell phone to watch the provided apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"joelpps\""}, {"rating": 4.0, "review": "It was certainly worth the money.", "verified": true, "helpfulness": "0/0", "author": "Susie Orr"}, {"rating": 5.0, "review": "Easy installation, easy to use", "verified": true, "helpfulness": "0/0", "author": "Diedre Locati"}, {"rating": 5.0, "review": "The Fire TV Stick was easy to set up and provides a great range of options.  I especially love that I could download my music from Amazon Cloud.", "verified": true, "helpfulness": "0/0", "author": "AMANDA F HOWARD"}, {"rating": 4.0, "review": "The Ftre Stick is every thing That I was hoping for. Now I can watch all the movies and TV shows That I missed because I work midnights and can not watch the shows and movies that are on during prim time hours.", "verified": true, "helpfulness": "0/0", "author": "don"}, {"rating": 5.0, "review": "Remote is a great feature.  System is very fast.", "verified": true, "helpfulness": "0/0", "author": "Ron Almeida"}, {"rating": 1.0, "review": "No it use too much wifi , one movie downlow uses about 1G bite not a good deal.", "verified": true, "helpfulness": "1/1", "author": "Harrison F."}, {"rating": 5.0, "review": "We have enjoyed the Fire TV Stick..it has opened many options to us for viewing enjoyment.  It is easy to install, and easy to use.A good buy.", "verified": true, "helpfulness": "0/0", "author": "Joe Carena"}, {"rating": 2.0, "review": "was not what i was looking for i could not,i repeat could not stream video from my laptop to my tv .So i saw not advantage of my cable service.", "verified": true, "helpfulness": "0/0", "author": "Glenn K."}]