[{"rating": 5.0, "review": "Works Great!", "verified": true, "helpfulness": "0/0", "author": "Alexander P. Johns"}, {"rating": 1.0, "review": "do not buy waste of money . bought it indecember it stopped working in march", "verified": true, "helpfulness": "0/0", "author": "jim chandler"}, {"rating": 5.0, "review": "Bought it as a Father's Day present and my dad was so excited when he started using it. Loves being able to watch movies and listen to music while do housework! Great price for a great product!", "verified": true, "helpfulness": "0/0", "author": "steve"}, {"rating": 5.0, "review": "Perfect! Very satisfied. Since I bought it with my Amazon prime, it was already registered, set up and ready to go. I found the controller very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Marcia"}, {"rating": 5.0, "review": "Rec'd this as a Fathers  Day gift. Dirt simple to get up and running.  Idiot proof, thankfully. Just plug in to TV and you're into it. Then, if you're a Prime, HBOGO, Netflix, or what have you, just sign into those. Lottsa other stuff it will do, too. Everything it claims to be. And, it's portable, i.e., just take it with you if you're going somewhere and want to be able to use it on another TV - next room or next state. k", "verified": true, "helpfulness": "0/0", "author": "Kenneth L. Mishoe, III \"Iowa guy.\""}, {"rating": 5.0, "review": "Great product, I love that I can bring my favorite shows and movies anywhere I go.", "verified": true, "helpfulness": "0/0", "author": "Paul J Ribeiro"}, {"rating": 5.0, "review": "Five star", "verified": true, "helpfulness": "0/0", "author": "Mohammad"}, {"rating": 1.0, "review": "Won't log onto my wi if.  It worked Great for a week or so and now it just won't work.", "verified": true, "helpfulness": "0/0", "author": "Jen Mutton"}, {"rating": 5.0, "review": "Easy to use and connect.  No problems :)", "verified": true, "helpfulness": "0/0", "author": "Roderick Jackson"}, {"rating": 2.0, "review": "I don't think it free tv you  still need  dish", "verified": true, "helpfulness": "0/0", "author": "smoises"}]