[{"rating": 1.0, "review": "Crashes all the time. I bought this to take the stress off my ps3. Guess what's running right now yes my ps3 because this system has once again forgotten how 2 run again. Moved it 2 ft from the wifi maybe the Dual band wifi will work. Moved OLD Roku Back in it's place.", "verified": true, "helpfulness": "0/0", "author": "john doe"}, {"rating": 5.0, "review": "Was delivered with all parts. Some assembly but not bad. Placed into humid port and entered my Amazon info and it worked immediately. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Ming18"}, {"rating": 3.0, "review": "I've used both a Chromecast and the Fire Stick TV for about a month. Both were OK in certain ways, and both had problems.The biggest drawback for me with the Chromecast is that it's rarely able to get the correct aspect ratio, so a lot of videos are cut off on the top or edges. The other problem is that without a remote, I have to run to my computer a lot to make changes.The Fire Stick problems are two: it loses the wifi connection if I stop using it for a few hours, so I need to reboot it frequently. Sometimes it doesn't regain the connection at all, and I just give up for a few hours. The other big problem is that the responsiveness of the device sometimes gets terrible; the remote seems to stop responding and commands back up in the queue. After 10-20 seconds, all the commands are run quickly in sequence.The other minor downside of the Fire Stick is that typing out search queries with the remote is pretty irritating. But I hear I can download an Android app that will let me do voice commands, or use a normal keyboard.When it's working, the Fire Stick is pretty terrific. I hope that updates will fix both of these problems.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best bargain around for those of us with Amazon Prime. It's truly plug-and-play, and streaming has been smooth.", "verified": true, "helpfulness": "0/0", "author": "Anita"}, {"rating": 1.0, "review": "It does not work with my hotspot", "verified": true, "helpfulness": "0/0", "author": "jalapeno ranch dressing"}, {"rating": 5.0, "review": "Love it!  This little device is fantastic.  Access to Prime content, video rentals, Prime music, without having to boot up a gaming console or other device.  Perfect for our family and for Prime Members in general.", "verified": true, "helpfulness": "1/1", "author": "Christopher"}, {"rating": 3.0, "review": "Great for watching video available through prime.  BIG ISSUE - Have to reconnect to wifi each time I turn it on.  Unless power to fire stick is on all the time it loses connectivity.  Have not figured out how to mirror my phone or tablet.  Not very intuitive.", "verified": true, "helpfulness": "0/0", "author": "Stephen Chinnery \"stephen chinnery\""}, {"rating": 5.0, "review": "Can't say enough how much I love this! Never had streaming TV before and this was so simple to hook up and use right from the box. I would get this before any other.  If you have PRIME with amazon this is the only one you need. So much great content is free to view!", "verified": true, "helpfulness": "1/1", "author": "Julie Beveridge"}, {"rating": 2.0, "review": "Loses internet connection regularly and then shows no networks in range when trying to reconnect. Cannot watch a show without having to get up and unplug power to reset. I am glad I got this when it was only $20 because I would be upset if I had wasted any more money than that. Great concept, bad execution,", "verified": true, "helpfulness": "1/1", "author": "Sara M. Johnson \"Cheshire Cat\""}, {"rating": 2.0, "review": "I should have researched more before I bought this. I was really hoping I could mirror my laptop to my TV, but the mirroring options are currently limited to a very small number of other Fire products.", "verified": true, "helpfulness": "0/0", "author": "Brett Geissbuhler"}]