[{"rating": 3.0, "review": "Average system", "verified": true, "helpfulness": "0/0", "author": "Tom B."}, {"rating": 3.0, "review": "My IPad, IPhone, and other devices get a strong enough signal from my cisco wifi router, this Fire TV Stick is unable to receive a powerful enough signal.  I am going to try to change my wifi router to see if that works.  However, I feel that I should not have to do so, as my many other wifi devices all connect quite well.  Even my Roku connects well and gives us a seamless viewing experience.  So, unfortunately, either this device is defective, or the radio in the device has a poorly designed antenna.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"healthplans\""}, {"rating": 1.0, "review": "Not as easy to use as the Roku. Fire Stick needs a separate power connection to work, the Roku doesn't. The Roku immediately located my wireless network, the Fire Stick didn't find it and when directed to it, it wouldn't connect. Played with the Fire Stick for 45 minutes and boxed it back up to ship back to Amazon.", "verified": true, "helpfulness": "2/2", "author": "SSD"}, {"rating": 3.0, "review": "It is better if fire tv also supports any similar app like Google Cast. The only drawback of fire stick is doesnt support any web cast app. If any one knows please share the app name to me.", "verified": true, "helpfulness": "0/0", "author": "Amarnadh Gupta Konchada"}, {"rating": 4.0, "review": "works good but there is a constant low pitched beep sound whenever i watch shows or listen to music.its kinda annoying.if this went away i would rate it 5 stars.please fix", "verified": true, "helpfulness": "0/0", "author": "Alvin Acton"}, {"rating": 3.0, "review": "I didn't buy one , so how can I give a review", "verified": true, "helpfulness": "0/4", "author": "Longview Ron \"Ron\""}, {"rating": 5.0, "review": "I love it, made my tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Trina Adams"}, {"rating": 3.0, "review": "While the device plays video with excellent quality, there are a couple things that they can improve upon. The menu really needs a lot of tweaking to streamline it. As it is, it's rather confusing. And the second item up for rating is the content providers. Work on getting more. Otherwise great product.", "verified": true, "helpfulness": "0/0", "author": "Christopher Knight"}, {"rating": 5.0, "review": "Easy setup on a Sony Bravia 42\" LCD that was purchased in 2007.", "verified": true, "helpfulness": "0/0", "author": "Gregory A. Schneider"}, {"rating": 5.0, "review": "Absolutely love it.  It's excacty what we were expecting and more.  Since we like our tv and it works perfectly, we didn't want to spend hundreds or thousands just to get a smart tv.  With just a fraction of the cost, We turned our tv into a smart tv and it has all the apps such as Netflix and hula plus many more.", "verified": true, "helpfulness": "0/0", "author": "dana thomas"}]