[{"rating": 1.0, "review": "Very misleading. This device sold my on its portability. It needs to be plugged in to a wall outlet. Funny how they don't mention this at all. It fits nicely in Gary Busey's hand without any cables", "verified": true, "helpfulness": "2/5", "author": "Amazon Customer"}, {"rating": 3.0, "review": "sometimes it works other time it doesn't, not sure if its internet service or just poor made product will keep trying", "verified": true, "helpfulness": "0/1", "author": "MARIA"}, {"rating": 4.0, "review": "Exceeded my expectations. Nice surprise that it was already set up for my Prime account. Very simple set up.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Wolf"}, {"rating": 1.0, "review": "Beware!  This will NOT work on all HDTV's!  After spending two hours on the phone with Amazon trying to get two different sticks to work, I finally called Sharp Television.  They told me the Fire TV Stick requires MHL in order to work (Mobile High-Definition Link). Check out www.meetmhl.com for an explanation of what this is.  I had never heard of it prior to this issue.  I purchased my 52\" Sharp Aquos HDTV in 2009 prior to MHL existing.  It has plenty of extra HDMI ports.  Nowhere in the Fire TV Stick directions does it mention MHL is a requirement.  The Amazon reps obviously didn't know either.  I will have to \"stick\" with my Apple TV, which works great.  I was looking forward to the Amazon Stick too, as I am a Prime Member.  BTW - I purchased the Stick (and returned it!) at Staples for $24.99, much cheaper than Amazon itself.My biggest complaint is that the directions should mention this and customer support should know this also.  I wasted so much time on the phone and driving back and forth to Staples.", "verified": true, "helpfulness": "4/5", "author": "Travel Passat"}, {"rating": 4.0, "review": "I was pretty impressed with how good this was. I currently have a Roku 2 and Chromecast plugged into my TV. After a few days of trying out the Fire TV Stick, I decided to replace my Chromecast with the Fire TV stick... but then I wanted to show some videos of DVD I had ripped and this is where Chromecast had a major advantage. I love how you can 'cast' any local video from a computer to your Chromecast. Maybe you can run Plex on the Fire TV stick but I didn't want to bother with Plex...", "verified": true, "helpfulness": "0/1", "author": "Peter Kim"}, {"rating": 5.0, "review": "This thing is awsome, I have several chromecast and I definitely like this better.  I am disappointed the slingplayer does not work with my 2 year old slingbox, but that's not the fire tvs fault.  Loaded with games, movies, and apps. I can mirror my iPhone, play my entire movie library and much more.  Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Joe Edmonds \"Joe\""}, {"rating": 5.0, "review": "great product for 19 dollars. I liked it so much that I also purchased the fire version too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Fire TV Stick is AWESOME!  It is everything rolled into one.  I love it.  We don't have cable and my kids have a Television with a DVD in it, so the Fire TV Stick was our best bet for getting Amazon Prime. Netflix, Hulu and all the other great things this little gadget has to offer.  I am going to purchase a couple more for the rest of the house!", "verified": true, "helpfulness": "0/0", "author": "Jodi Edwards"}, {"rating": 4.0, "review": "Easy to set up and better than the google chrome stick.", "verified": true, "helpfulness": "0/0", "author": "Syntax2002 \"Syntax2002\""}, {"rating": 3.0, "review": "I have both this and the Roku 3.  They both seem to stream services I use just fine.  However, the Roku can work with both IR and RF remotes and this only works with RF.  That means you can't use most universal remotes with this product.  So I can't use my expensive Harmony remote with this.  That said, the menu structure really does favor Amazon as you might expect.", "verified": true, "helpfulness": "0/0", "author": "BobV"}]