[{"rating": 5.0, "review": "Love it! Easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This little gem is great, when you get a signal.  My WIFI is not that far away and all my other components work great but I've had trouble with the Firestick.", "verified": true, "helpfulness": "0/0", "author": "Virginia McQuery"}, {"rating": 3.0, "review": "I don't like that you can't do some things on this.  It's not as good as Roku and Chromecast, but for the price that I got it for, it's great!", "verified": true, "helpfulness": "0/0", "author": "Ellie's Mom"}, {"rating": 5.0, "review": "Works great easy install", "verified": true, "helpfulness": "0/0", "author": "WindyOne"}, {"rating": 5.0, "review": "I am very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Maxine Bieber"}, {"rating": 4.0, "review": "Love the Fire TV Stick, easy to install, on screen directions were great.  A little disappointed with Prime, the selection of movies are not what I was hoping for, the selection is a little old and dated.", "verified": true, "helpfulness": "0/0", "author": "Skier8288"}, {"rating": 5.0, "review": "love it, i have a Roku and this so far qaulity wise is far better. doesnt have as many apps, but the ones it has are very user friendly. the remote also much better than the Roku's remote", "verified": true, "helpfulness": "0/0", "author": "Ronnie Smith"}, {"rating": 5.0, "review": "More things than I could possibly watch!", "verified": true, "helpfulness": "0/0", "author": "Douglas S Bett"}, {"rating": 3.0, "review": "Nifty little device, but a bit glitchy.  My biggest complaint is that it's very slow.", "verified": true, "helpfulness": "0/0", "author": "Jordan Hitch"}, {"rating": 5.0, "review": "We really like this little device.  It is a pain you have to have it plugged in but I see now it must be so.  I am sure the format will improve over time but for us right now it is great.  We can 'throw' the youtube on the screen from the laptop.  We can easily find movies, youtube channels and more.  I got a smokin' deal with prime before they made them available and I am so glad I did.  No need for dish or cable now.  It does everything we need it to.", "verified": true, "helpfulness": "0/0", "author": "anonymous"}]