[{"rating": 3.0, "review": "works ok but a lot slower then apple tv.", "verified": true, "helpfulness": "0/2", "author": "tony calabro"}, {"rating": 3.0, "review": "I had some wi-fi connection issues when I first got the stick (i.e. shows would take up to 30 seconds, or longer, to load, and there would be multiple stop and stutters while streaming programs), probably because the TV was blocking the wi-fi signal from the Amazon stick (I was using the dongle provided with the stick that suspended the stick behind the TV, which the online help guide suggested, but it didnt improve the performance), but I've added a wi-fi extender to my TV setup, so now the stick loads tv shows and movies much faster. I wish there were a bit more of a unique library to Amazon Prime TV shows and movies that set them apart from Netflix, but there enough shows streaming on Amazon Prime that aren't on Netflix that make this device worth investing in if you like streaming your entertainment.", "verified": true, "helpfulness": "0/0", "author": "Adam Kantor"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Mike Patterson"}, {"rating": 5.0, "review": "Love it! So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Alec Maki"}, {"rating": 4.0, "review": "the one thing i do not like about this is that if i use voice search it will automatically search in amazon only even if i have Netflix or another program opened first. In addition, i bought the voice remote which is not needed if you have a smart phone. it great to use my phone as my remote no more looking for a lost remote just call your phone if it not right by you to find it lol.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Do no trash your money with this device. I tried to download the software update several times with no success... Apparently the wi fi receiver of the stick is not the best. I will try a few more time and of not work i will return it!", "verified": true, "helpfulness": "1/4", "author": "Francis Cortes \"Francis Cortes Pujols\""}, {"rating": 4.0, "review": "Ok, but was hoping it would mirror screens on tablets and phone.  Easy to use and works as described.", "verified": true, "helpfulness": "0/0", "author": "DM"}, {"rating": 5.0, "review": "I wanted it to stream Netflix and, specifically, Amazon Prime on my roommate's television. It does this perfectly. The picture is clean, it doesn't jam up the WiFi like Chromecast does, and the remote app for Android is super convenient. (Never lose the remote, yay!)", "verified": true, "helpfulness": "0/0", "author": "C. Mabee"}, {"rating": 5.0, "review": "Love it ! It also allows me to use my fire device as a remote too. A total up grade from my app vizio and my roko box. A+++", "verified": true, "helpfulness": "0/0", "author": "Rating My Best Pick"}, {"rating": 5.0, "review": "Amazon did a GREAT job with this product!  I've had an Apple TV for years now and I actually prefer the fire stick over the Apple TV.  Easy to use and plenty to stream.  Great job Amazon!  I also had a Roku and I would say I like this over that too.  My Dad has a Roku as well and also prefers his Fire Stick over that.  It's also cheaper than both Roku and Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Carla"}]