[{"rating": 3.0, "review": "It works OK, but once in a while we've had wireless connection issues with it.", "verified": true, "helpfulness": "0/0", "author": "Snoogit"}, {"rating": 1.0, "review": "Freezes, stops, buffers constantly. Terrible product!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey M Quast"}, {"rating": 5.0, "review": "The gift recipient said she loves the stick.  Amazing price for what it does!", "verified": true, "helpfulness": "0/0", "author": "Nathan Therrien"}, {"rating": 3.0, "review": "a lot of problems freezing up. own another older media player and do not have that problem. Tried moving tv and modem and not any better result.", "verified": true, "helpfulness": "0/0", "author": "mario"}, {"rating": 5.0, "review": "This is an easy review to write.......AWESOME!!!!!! If you have Amazon prime you really need to get the Fire stick. I just got a new TV for the bedroom......plugged in my Fire stick and I am ready to watch EVERYTHING on Amazon prime......plus Netflix if you are a member. Way worth the price and so easy to use. Love, Love, Love the Fire stick!!", "verified": true, "helpfulness": "0/0", "author": "T. Blair \"twintoni\""}, {"rating": 5.0, "review": "this is so easy, and love IT!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Working great love it", "verified": true, "helpfulness": "0/0", "author": "Marie L Boudreaux"}, {"rating": 5.0, "review": "We gave up cable TV about three years ago, and the only real loss was live sports. We've had access to Netflix and Amazon Prime for everything else. We just recently found Sling and took advantage of the offer to get Fire TV Stick free with three months paid subscription to Sling. We're very happy to have ESPN and our favorite college sports again. Fire TV Stick allows us to watch Sling on the big screen, not just the laptop.", "verified": true, "helpfulness": "0/0", "author": "P. Swafford"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "angelo alberty"}, {"rating": 4.0, "review": "It's a very cool product and I love the android app that goes with it. Navigating it can be a bit tricky and it doesn't support showtime if your subscription is through Comcast/Xfinity (!) but it's great overall.", "verified": true, "helpfulness": "0/0", "author": "Dr. Sam Psych"}]