[{"rating": 3.0, "review": "I use the Fire TV stick on a TV that is only WIFI ready and I didn't have a way to sign onto Netflix or Prime easy. Easy to set up and the shows play without delay. It signs on to the internet very fast and without delay. If I had one complaint it would be that I don't like how the prime is set up. It is so much easier to use the button that is on my TV in my living room  for Netflix. It is easier to look for shows and see how many seasons there are etc. But my TV in the bedroom doesn't have this option. One other problem I had was that it doesn't recognize my Netflix any more for some reason and I haven't figured out why that is. We have the Amazon Fire TV in our living room and I had no problem with it. I am not sure what the problem with the Fire TV stick is Prime works just fine, just Netflix doesn't work any more.", "verified": true, "helpfulness": "0/0", "author": "C. Ragels"}, {"rating": 3.0, "review": "Even with Amazon Prime you still have to pay for HD programming - this is a reason not to renew Prime.", "verified": true, "helpfulness": "0/0", "author": "Some guy"}, {"rating": 5.0, "review": "Really easy to set up and to use.  Already hooked on Amazon's Bosch series and Downton Abbey!", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "GREAT!", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "I own a Google Chromecast and now an Amazon Fire TV Stick. The Chromecast doesn't even come close to comparing to The Fire TV Stick. If you are considering the two take my advice and go with Amazon!", "verified": true, "helpfulness": "0/0", "author": "John Belcher"}, {"rating": 5.0, "review": "Literally plugged it in to my TV, up popped my wireless info, typed in my password and that was it! Super easy to install. I did have trouble getting the cover off of the remote to insert the battery. Had to google it and saw lots of others with the same issue. I slid a butter knife into the slot and that did the trick!", "verified": true, "helpfulness": "0/0", "author": "S. Byrd"}, {"rating": 5.0, "review": "Really amazing how much I can watch using it. Still searching and learning. Find more every day", "verified": false, "helpfulness": "0/0", "author": "Gary Miller"}, {"rating": 2.0, "review": "I watch amazon,hull,Netflix on my fire hdx sometimes hit lower buffer I have 1000mbps on my internet . But after setup it told me I am to slow to use so I haven't got to use it. We know about assume but figured it worked on one it would the other. Need to advertise how much speed it takes to use.", "verified": true, "helpfulness": "0/0", "author": "Judy Martin"}, {"rating": 5.0, "review": "This is an amazing little gadget with huge performance.  So glad I purchased it!", "verified": true, "helpfulness": "0/0", "author": "ejlmgrmma"}, {"rating": 4.0, "review": "I am having fun with it", "verified": true, "helpfulness": "0/0", "author": "pat"}]