[{"rating": 5.0, "review": "Very easy to install and navigate on, plus it works great with my xfinity wifi. I'm very happy with it, especially for the price!", "verified": true, "helpfulness": "0/0", "author": "Mary Green"}, {"rating": 5.0, "review": "My kids are loving this fire stick. Especially my 5 yr old.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "My family loves it.  Easy to install and great price.", "verified": true, "helpfulness": "0/0", "author": "D. Giammarino"}, {"rating": 1.0, "review": "My first fire Tv turn off a second week! I order another one and didnt start at all. I'm very disapointed with this product", "verified": true, "helpfulness": "0/0", "author": "Milton Valle"}, {"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "Gareld E. Cox"}, {"rating": 3.0, "review": "Great picture quality!  Decent selection of movies and TV Series.  Needs more selection of games.", "verified": true, "helpfulness": "0/0", "author": "Nathan Emig"}, {"rating": 2.0, "review": "I bought the Fire TV Stick so my wife can watch TV in the extra bedroom which I call her \"Hideaway.\"  She bought Amazon Prime for her Kindle and I thought it would be nice to  watch the free movies offered on Prime. We have a Chromecast  but don't like having to set up my desktop computer in Chrome and having to control it from a remote site away from the source TV. Her Kindle will is not Chromecast compatible. The Fire Stick has a remote where you can control your content right in your chair or bed. Also you can download an Android app to control the Fire Stick on your Smartphone and use voice search without paying extra for a voice search remote.We have a Samsung TV in the bedroom  and the Fire Stick would not work on it. Since the router is downstairs in my home office I figured the router was too far away for a strong enough signal. I put the Fire Stick on our large screen Sony Bavia TV which is in the family room next to my office. It worked great for about three weeks then received an error message for an HDCP error. I called Amazon help and found out that the Sony is not HDCP compatible  Only TVs manufactured  2014 and later use this technology for HD broadcasted from Amazon Prime. The Sony is 2008 and the Samsung TV is 2013. Any content cast by Amazon Prime are mostly in HD. There is no way to change to SD (standard definition) on the Fire Stick The only option is to buy a newer large screen TV which I am not prepared to do for a $39 part. The product description for the Fire Stick is deceptive. It only mentions HDCP compatibility in the  Technical details and does not warn that Fire Stick will not work with TVs older than 2014.I will be going back to Chromecast. I would return the Fire Stick but have a 2014 TV in the table pool room so the Fire Stick will work there. Also I really don't want the hassle of paying return postage, etc for a  $39 part.In you own a TV earlier than 2014 do not buy this product. It will not work. Get a Chromcast for the same price.", "verified": true, "helpfulness": "2/2", "author": "Michele Nelson"}, {"rating": 5.0, "review": "Pretty awesome! Got sling tv now no need for cable with the right streaming speed!!!", "verified": true, "helpfulness": "0/0", "author": "Tim McELroy"}, {"rating": 2.0, "review": "Needs to have off line play. Mircast is a bit glitchy, and the remote is a jerk to open but its really nice to have mircast and future options when opened", "verified": true, "helpfulness": "0/0", "author": "pen3"}, {"rating": 5.0, "review": "Very easy setup, works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Donna Miller"}]