[{"rating": 5.0, "review": "Love it for the money! This cheap little stick does not disappoint. It blows away, and has in fact replaced my Netflix subscription. I have one for each TV in the house and love it. No boxes, no wires. Just a tiny USB stick and wireless signal. Highly recommend!!", "verified": true, "helpfulness": "0/0", "author": "Jeff K."}, {"rating": 5.0, "review": "I received my Fire TV Stick 2 days after I ordered it! This is the second one I have ordered. My daughter took the first one to college to use on her laptop! Easy to install and works great streaming Netflix!", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 2.0, "review": "Good, but way more lag and buffering than expected from all the ads Amazon put out about it. Laptop, phone, tablet... you name it, all noticeably faster on the same wifi connection.", "verified": true, "helpfulness": "0/0", "author": "Jesse Grindstaff"}, {"rating": 5.0, "review": "Love it . Good movies and tv shows", "verified": true, "helpfulness": "0/0", "author": "Rosemary"}, {"rating": 5.0, "review": "very simple to set up. Equally simple to use. Includes sling TV - primary reason we got it. It's one of those things where you start with \"well let's give it s go, it's only $35 so not much to lose\" and a week later are going \"that's the best tech I've brought in a long time, and using it every day\".", "verified": true, "helpfulness": "0/0", "author": "Jonathan D."}, {"rating": 5.0, "review": "Best streaming stick ever", "verified": true, "helpfulness": "0/0", "author": "BigMig \"Be excellent to each other...\""}, {"rating": 5.0, "review": "I love the fire TV stick.  I use it with my Prime account.  It makes watching movies on my TV much more enjoyable than watching on the laptop.", "verified": true, "helpfulness": "0/0", "author": "KATHY MINTER"}, {"rating": 5.0, "review": "Good stuff. I got hooked on The Sopranos right off the bat and watched the entire series in a matter of weeks.", "verified": true, "helpfulness": "0/0", "author": "Tom Miller"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Trader Jack"}, {"rating": 2.0, "review": "It's alright except the Kobi \"Genesis \" streaming on it because when you stream on Kobi \" Genesis\"  I constantly stop its very upsetting other that that the unit works well on everything else.", "verified": true, "helpfulness": "0/1", "author": "Robert Jurasin"}]