[{"rating": 1.0, "review": "Shame on you Amazon! We pre-ordered two of these because we got a deal being prime members. I was excited how small and portable these were! A month later we got them when they rolled them out! Nowhere in the commercial did it say you need to ALSO plug it in to a power source and that it cannot draw power just through the TV! This wouldn't be such an issue, but of course the cord they give you is short! I wish Amazon wouldn't have advertised a \"smaller\" alternative to Fire TV, when really it's a BIGGER pain in a SMALLER package!", "verified": true, "helpfulness": "1/9", "author": "Clownbus"}, {"rating": 5.0, "review": "Love the Fire TV Stick!  We can stream all of our favorite videos and even play some cool apps.", "verified": true, "helpfulness": "0/0", "author": "Carmen McCoy"}, {"rating": 5.0, "review": "So far so good, quite powerful and has the Bluetooth remote over the chromecast for the same price. Plex is awesome on it, most of the apps are great as well, I can honestly say I never run out of things to watch. WiFi range is good and it is fast as well. Wireless dispay mirroring for Intel based laptops as well as any android phone is a plus. Did I mention it's at a better price point than the chromecast?", "verified": true, "helpfulness": "0/0", "author": "bloop"}, {"rating": 3.0, "review": "I like the size the the cost (introductory offer of $20) of the device. Have used it for a month now and I am probably not so happy as I hoped for.Cons:- There are additional clicks and screens when opening/streaming the apps.- Asks me to key in the passcode even for prime videos and for videos that I have already purchased, this just doesn't make sense. When I use the amazon instant watch app on my PS3, it only asks me to key in the passcode only when buying movies/episodes.- Biggest disappointment for me is that the \"search\" only searches within the amazon content. I remember reading that fire tv (bigger device) searches across the apps, guess the fire tv stick does not.I think the device still needs improvement. I would have returned if I hadnt paid just $20 for the device.", "verified": true, "helpfulness": "0/0", "author": "Deeps"}, {"rating": 3.0, "review": "Supposed to be competitor to ChromeCast but how do you show web browser on your tv?", "verified": true, "helpfulness": "2/2", "author": "Ann Peterson"}, {"rating": 4.0, "review": "Beautiful visual of all apps and movies and TV shows. I did not give it 5 stars because I have to pay for some seasons of shows that are on this. With Apple TV I do not have to pay to watch seasons and it gives me more options like HBO 2 Go and Showtime, both which are not available for the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Crystal"}, {"rating": 4.0, "review": "Great unit for Prime Instant Video. I watched True Blood for the first time and the surround sound was as good or better than a DVD.", "verified": true, "helpfulness": "0/0", "author": "Jim Brychka"}, {"rating": 5.0, "review": "Does everything they said it would and does it well. Thousands of movies and TV shows to choose from plus Apps like Netflix. Also, Amazon says it is not through adding more things to entertain you!", "verified": true, "helpfulness": "1/1", "author": "Rob"}, {"rating": 5.0, "review": "Excellent product. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Jack Kelleher"}, {"rating": 5.0, "review": "Easy and effective way to access Amazon Prime programming.  A good value for those of us that have the Samsung Smart TVs that don't access Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Iron Mike"}]