[{"rating": 2.0, "review": "If you don't mind having Amazon make recommendations to your impressionable 4- and 5-year-old boys, this things delivers in aces.Unfortunately, this is a platform designed to shove Amazon content down your throat, and it doesn't seem to have any regard for what exactly it's suggesting.  If you are expecting a clean, non-intrusive list of \"channels\" such as ROKU provides, you will be sorely disappointed.I don't doubt that this will be great for a specific set of users, but it is not practical in our home where we have to monitor TV programs.", "verified": true, "helpfulness": "3/4", "author": "Robert"}, {"rating": 5.0, "review": "We got this as a deal for Amazon prime members and it is worth it. Would be worth it at regular price. We also have roku box and a chromecast stick and all have pros and cons. I have only used it a few times but will say setup was super easy and it definitely is more user friendly than chromecast.  It is nice having the remote, which chromecast doesn't.", "verified": true, "helpfulness": "1/1", "author": "brandihemphill"}, {"rating": 5.0, "review": "Works great. Very fun for enjoying Netflix.", "verified": true, "helpfulness": "0/0", "author": "myrealname"}, {"rating": 1.0, "review": "It does not find Amazon.com using my extender even though its says it has a strong signal. It will pick up my base router but signal is only good and It seems like I can't view anything without paying Amazon $99.00", "verified": true, "helpfulness": "2/3", "author": "William G. Compton"}, {"rating": 5.0, "review": "Easy to use, connect and enjoy. The Fire Stick is one great option, especially if you are a Prime Member... So simple that anyone can enjoy it. The quality of the movies have been great. The music service is also nice as you can listen to entire songs before buying. There are great apps for TV like PBS and many others.  A great choice for anyone..", "verified": true, "helpfulness": "0/0", "author": "Jim Conley"}, {"rating": 5.0, "review": "The Fire Stick was very easy to install I was up and enjoying My Amazon Prime options within 15 minutes! I am so glad I purchased the stick.", "verified": true, "helpfulness": "0/0", "author": "Sarah Emes"}, {"rating": 1.0, "review": "I was very disappointed in this product.Buyer beware! I heard a rumor that if your tv is older than 5 years it won't work. It worked for a day then I got \"the blue screen of death\". I plan on returning this product.But while it worked it was an awesome product! Smooth functioning menus, very clear screen, apps were awesome.", "verified": true, "helpfulness": "1/3", "author": "Danny81"}, {"rating": 5.0, "review": "No more cable!!! The Fire TV Stick was exactly what I was looking for in providing entertainment on my new HDTV.  Love being able to either watch my local channels and then watch other entertainment available on the Fire Stick!!  Easy to install and learn to use.  Never going back to cable!!!", "verified": true, "helpfulness": "0/0", "author": "GD"}, {"rating": 5.0, "review": "I love this thing. I would have given it 5 stars if not for one issue. I seem to have to enter my Netflix account email and password every other time I use it. If I could fix this I would be recommending it to everyone I know. As it is, I am thoroughly irritated.UPDATE:  The Netflix issue seems to have resolved itself. Since then, I have bought another fire stick for my other tv. My husband who is extremely technologically inept was able to figure it out without me telling him anything. It took him many times to understand how to get to Netflix on the Blu-ray player and it was so slow, so I decided to get a second one. I have tried Chrome cast​ which is nice, and Roku which I think has a rather clunky interface compared to the fire stick. I have recommended it to everyone I know and I think I might even let my mom get one since it is so simple to use.", "verified": true, "helpfulness": "0/0", "author": "Sarah Jean \"Srahahui\""}, {"rating": 4.0, "review": "I like it but some of the Amazon prime movies come up unavailable. I paid for a service but can't use it fully. That needs to be fixed.", "verified": true, "helpfulness": "0/0", "author": "M. Roberson"}]