[{"rating": 4.0, "review": "I like it but.......I am always having to reset it. unplugging it, plugging it back in. It gets to became a little bit of a pain.", "verified": true, "helpfulness": "0/0", "author": "Mary Jo Medosch"}, {"rating": 3.0, "review": "The process to set this up was entirely too long!! It took many attempts with passwords and then updates to completely set this up. I finally called for help and wouldn't you know, when the help desk answered the Fire Stick started!! Never fails..... LOLNow I'm having problems getting my Netflix account to work with it......", "verified": true, "helpfulness": "0/0", "author": "Lawrence T. Anderson \"Nanook\""}, {"rating": 5.0, "review": "Great stick. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "JVY44"}, {"rating": 3.0, "review": "I've only been able to use this a couple of times due to the fact it is a wifi data gobbler... All the shows are crisp and the sound quality is very good. The only other negative I can think of is the HDMI extender that COMES with the fire stick doesn't work... Weird.", "verified": true, "helpfulness": "1/1", "author": "Elizabeth Weldon Hunt"}, {"rating": 5.0, "review": "Yes its great it came preload for me an everything", "verified": true, "helpfulness": "0/0", "author": "jeff louis"}, {"rating": 4.0, "review": "This item is excellent, the best thing is you can take it anywhere you go, went to AC and watched Netflix and all my fav channels with the wife.GREAT PRODUCT!", "verified": true, "helpfulness": "0/0", "author": "Stanley Jean-Louis"}, {"rating": 5.0, "review": "So Far, it works great.", "verified": true, "helpfulness": "0/0", "author": "Ash."}, {"rating": 5.0, "review": "So far so good. Just got it a few days ago. Was easy to set up and started enjoying features right away.", "verified": true, "helpfulness": "0/0", "author": "R.E.K"}, {"rating": 2.0, "review": "Instructions were limited & poor (there should be a reference to pdf online that would carefully and fully explain all of the controls and use). I've loaded software, got it to recognize wifi, and tablet, but can not stream anything from Kindle 7\" HDX, after downloading several apps. For a large company, it's surprising how little instruction is supplied. Even the 'position ring' is never explained.", "verified": false, "helpfulness": "0/0", "author": "Harry Poster"}, {"rating": 4.0, "review": "Awesome system ...but needs to list what is available to you with Amazon  Prime separately...", "verified": true, "helpfulness": "0/0", "author": "S. Morgan \"The 'Gotta Have Gadgets Girl'\""}]