[{"rating": 5.0, "review": "I love this thing. Really came in handy last week when a storm fried my cable box. I was able to still watch Game Of Thrones through the  HBO to go app available on this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This works super, I have been using Apple TV but this blows it out of the water", "verified": true, "helpfulness": "0/0", "author": "Peter Wakefield"}, {"rating": 5.0, "review": "Installation was quick and easy.  And, I like having so many choices (no more boring, rip-off cable TV).  Love this device!", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 5.0, "review": "Gave this to my mom for Mother's Day and the whole family loves it! I liked that it does not have to be connected to a laptop, tablet or phone (unlike Chromecast) to work. You just plug it into the HDMI port and connect it to your wifi network. Now my whole family is able to enjoy Netflix and Hulu Plus!", "verified": true, "helpfulness": "0/0", "author": "Llama Coyote \"paperback reader\""}, {"rating": 4.0, "review": "Works fine. Easy to setup.", "verified": true, "helpfulness": "0/0", "author": "ORLANDO E. CANTON JR"}, {"rating": 2.0, "review": "Worked at first but now it does not.  Never hardly any new prime movie additions, those that do get added were available on Netflix or GooglePlay, AppleTV months earlier. I work for a Telecom Company and was given the task of testing out all sorts of streaming devices, including the Roku, AppleTV, WD TV box, the Chromecast and most recently the Fire Stick.  The Chromecast had all kinds of timeout issues, you couldn't pause or stop or cast your screen without issues.  They have since corrected those problems.  For the price I like the fact that the Fire Stick also comes with a remote and the memory is what sold me considering we live in an area with limited bandwidth.  Amazon has the best price for SD current episodes and overall selection.  There were a few minor bugs early on with the Fire Stick and the remote is super sensitive but it worked great at the beginning.  Now after several months I'm asking what memory, preloaded movies...I don't think so.  I might as well be on dial up with the time outs and latency issues.  I thought is was related to my companies broadband but I ruled that out and tried out the Chromecast again for a movies/shows we were trying to watch via Netflix and the Fire Stick and guess what?  perfect picture and audio, no delays, latency or timeouts.  So what good is all the supposed extra advertised\"4x the storage and 2x the memory of Chromecast plus a dual-core processor and 1 GB of memory,\" if it won't play content without freezing up.  I get having problems, limitations up front but this is after the fact.  Stick with Chromecast, Roku or AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Steve White"}, {"rating": 5.0, "review": "Yes, I am very satisfied with my Fire tv stick, easy to handle and use. Love it", "verified": true, "helpfulness": "0/0", "author": "Rosita"}, {"rating": 2.0, "review": "did not fit my TV which works just fine with chromecast", "verified": true, "helpfulness": "0/0", "author": "PV"}, {"rating": 3.0, "review": "I only give this a 3 start because the main reason I bought it was to watch HBO GO and since Comcast, my cable carrier, does not have a contract with Amazon, I cannot use it for that. Don't know if Amazon or Comcast is responsible for this but I am unhappy.", "verified": true, "helpfulness": "1/1", "author": "Catherine"}, {"rating": 4.0, "review": "Performs exactly as advertised - works well with no drama", "verified": true, "helpfulness": "0/0", "author": "Joe Fromm"}]