[{"rating": 4.0, "review": "As advertised  but doesn't get all your favorite shows", "verified": true, "helpfulness": "0/0", "author": "jerrysplace"}, {"rating": 5.0, "review": "Simple to set up and works wonderfully with our TV. We may have to get rid of cable.", "verified": true, "helpfulness": "0/0", "author": "Pjsgram"}, {"rating": 5.0, "review": "Easy as can be to set-up. I love it.", "verified": true, "helpfulness": "0/0", "author": "Dennis"}, {"rating": 5.0, "review": "Easy to install, easy to use, an awful long time between order date and delivery date!!!!", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 1.0, "review": "they made it seem like you would get thousands of movies free, but thats only after you pay...", "verified": true, "helpfulness": "0/1", "author": "Alan Herron"}, {"rating": 3.0, "review": "So far so good.....only had for couple days and still learning hoe to use it", "verified": true, "helpfulness": "0/0", "author": "Charles Long"}, {"rating": 3.0, "review": "The st I can is fine. It's the selection of free movies that is very limited. A lot of the movies are old. Also can't find Spanish language offerings.", "verified": true, "helpfulness": "0/0", "author": "Chispita"}, {"rating": 5.0, "review": "This product does exactly what it says it does, easy to install and get up and running. Big Fan!", "verified": true, "helpfulness": "0/0", "author": "Betty T. Jimmo"}, {"rating": 5.0, "review": "Wow wow wow! What an amazing piece of technology. Easy set up and simple to use, which is right up my alley. Super fast I thought like my netflix you choose you wait maybe it freezes. I've come to accept that but all those glitches seem to be gone with the fire stick. Super fast! And no freezing. This is the way the technology was meant to be. I down loaded the voice activated remote to my I-phone and even that actually works the way the commercial says it does. This is a no brainer get this product and you won't use another. The only issue is now my 3 kids all want one.", "verified": true, "helpfulness": "0/0", "author": "big mike"}, {"rating": 5.0, "review": "I love this thing! We have an Apple TV and a PS3 that we also use to access Netflix/online content from our televisions. The interface on the Fire TV Stick is my favorite. I also really love having access to Prime video. There is a lot of included content that isn't available elsewhere. It's really a fantastic deal, especially if you're already an Amazon Prime member.", "verified": true, "helpfulness": "0/0", "author": "Sandra B."}]