[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "David L crutcher"}, {"rating": 5.0, "review": "Each brand of TV streaming device tends to have a strong point for finding certain kinds of TV programs, whether it's movies or YouTube, etc.  I found that this Fire TV Stick is makes it super fast and easy to find the best educational shows for our toddler, and there tend to be a lot of these high quality shows that are free for Amazon Prime members.  The specialty grownup documentaries (for example: how to learn piano) tend to cost money, even for Prime members.  There are many great free movies with Prime membership of course.  But the highlight for us is how quickly we can locate the best kids shows.", "verified": true, "helpfulness": "0/0", "author": "D. Coral"}, {"rating": 4.0, "review": "Good product, wi-fi is off and on sometimes.", "verified": true, "helpfulness": "0/0", "author": "D. Bailey"}, {"rating": 2.0, "review": "I got this product today. The setup and configuration is very very simple. I do have a Roku as well. However, I believe the Fire TV stick fell short in one particular aspect. I have a synology NAS drive where I have stored all my media files such as video and music. Where Roku has an app to show all the media servers in my home network, there is NO SUCH feature or app for Fire TV stick. There is Plex but then you have to buy and rearrange your stuff etc etc. It is not as simple as Roku which is once connected to wifi, you can browse the music folders stored in my synology media server.Otherwise, most of the apps in this stick are available in a standard blue ray player. I will try and do research for few more days else I will return it.", "verified": true, "helpfulness": "1/1", "author": "Sudheer K. Maharana"}, {"rating": 1.0, "review": "Horrible design with both hardware and software. The cable connector is to the side of the HDMI making it difficult for other devices to be connected in case of receivers. POwer adapter alos has horrible design . It wastes 2 power outlets in an extension box. The remote is very badly designed. Its hard to replace batteries. very tough to figure out how to open the battery slot. Both sides look the same. Will spoil the remote for sure in replacing the batteries. I dont like the interface either. Horrible interface. Worst of all the HD movies all of a sudden do not come in HD they turn to 240p or 480p couple of times while watching a movie. Not sure why. Overall a very horrible product. On the other hand google chromecast is awesome. Returned the product feeling very dissatisfied.", "verified": true, "helpfulness": "2/7", "author": "sam"}, {"rating": 5.0, "review": "Fire TV Stick is Fast . I will recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "DH1193 \"DH\""}, {"rating": 4.0, "review": "How do you disable auto play of the next TV episode?", "verified": true, "helpfulness": "0/0", "author": "Bryan \"originalbryan\""}, {"rating": 4.0, "review": "Incredibly easy setup. Fast processor and downloads. Very good HD picture quality.Two minor knocks. The interface is intuitive but not quite the equal of Apple TV. Requires user to navigate through too many unnecessary categories. Also, the power adapter is illogically designed. It is too large with the chord attachment located on the side. Some room for Improvement", "verified": true, "helpfulness": "0/0", "author": "Dadhertz"}, {"rating": 5.0, "review": "Way better than my Chromecast. Easy to setup. Even easier for my Dad to use", "verified": true, "helpfulness": "0/0", "author": "seanlikespie"}, {"rating": 5.0, "review": "I loved it and found it to be very easy to use! Get one!", "verified": true, "helpfulness": "0/0", "author": "Stacy N StClair"}]