[{"rating": 4.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Diego Casabo"}, {"rating": 5.0, "review": "Its stutters here and there but above all I'm happy with this purchase", "verified": true, "helpfulness": "0/0", "author": "Agustin Quesada"}, {"rating": 5.0, "review": "I love love love this thing it is the best thing around. It has all the things you would want in a smart TV but makes the price come out to be a whole lot cheaper. With things like netflix, Pandora, and hulu you can't go wrong with this device. The only thing is that I wish there was a way that it would completely shut down instead of just sleeping. I guess because I don't really want it using so much power and it kind of gets hot because I watch it soo much.", "verified": false, "helpfulness": "0/0", "author": "ddaniell1987"}, {"rating": 4.0, "review": "Love. Only thing I don't like is that it's only wifi based. My wifi sucks 😔", "verified": true, "helpfulness": "0/0", "author": "amelia jovell"}, {"rating": 3.0, "review": "IF YOU ARE WATCHING PRIME MOVIES IT WILL STALL IF YOU TRY TO WATCH 2 MOVIES", "verified": true, "helpfulness": "0/0", "author": "Brooklyn Kindle"}, {"rating": 5.0, "review": "http://tvboxfire.blogspot.com/ GREAT PRODUCT", "verified": true, "helpfulness": "0/0", "author": "hector chacon"}, {"rating": 5.0, "review": "Exactly as expected.  Product description was spot on and the product functioned as well as it should have.  I would not hesitate to buy again.", "verified": true, "helpfulness": "0/0", "author": "MCJ"}, {"rating": 4.0, "review": "I like this a lot just the button function takes some time to get used too", "verified": true, "helpfulness": "0/0", "author": "John Whitehill Jr."}, {"rating": 5.0, "review": "I bought the Stick because it's the only android based device that has the ability to run Kodi TV even though there isn't an official app for it on the Stick (but it is in the Amazon app store for other android devices?).  With a little bit of searching, it's easy to find out how to install Kodi which provides a huge range of content.We have exceptional wifi - 105mbs so buffering or delays are never a problem with this device.  Amazon Prime video is intuitive and you can actually view your watchlist on this device unlike the Amazon app on our Vizio TV.I hope that as the TV industry moves towards al la carte TV, Amazon will keep pace with the available streaming options.  I think we are only a year or two away from being able to buy only those 10-15 cable channels you actually watch for a very reasonable price and then streaming them via a device like this.  No more paying for 200 channels you never watch because of devices like this.I'm curious at this point if the voice activated remote works well on the regular Fire TV.  While the one that comes with this is simple to use, it does take some time if you have to fill in a search box using the old point and click on screen keyboard.  In fairness, you can avoid all that with the TV app on your Kindle or smartphone and it works quite well but a voice controlled remote that actually understood speech would be so convenient.", "verified": true, "helpfulness": "0/0", "author": "tom4416 \"bookie monster\""}, {"rating": 5.0, "review": "I already have the Roku, which I love , but got tired of in unhooking and hooking up to carry with me.  Was going to order the Roku Stick, but after reading I decide to purchase the Fire TV Stick.  Loving it, like the children Apps, for my nephew.  Probably will order the controller for him.  I ordered the mini extender, so I don't have to worry about the adapter at hotel.  So now I can leave the Roku in it place and carry the Fire TV Stick with me.  Win, Win.", "verified": true, "helpfulness": "0/0", "author": "Cynq1"}]