[{"rating": 5.0, "review": "Love it!!  Waaayyyy better than roku!", "verified": true, "helpfulness": "0/0", "author": "Melissa Ratcliffe"}, {"rating": 2.0, "review": "We have been using roku around our house and we love them, we tried the chrome cast and it was just not for us. Finally a fire stick became available at our local bestbuy so I picked it up. While the home screen and layout is by far more attracting and appealing(interface) than the other 2, the wifi connection is worst  and it picks which video files it wants to play. We run a media server in our house using plex, and that's our main use of any of these streaming devices, the fire stick wouldn't play half the content through plex.  I would go on another tv and try the roku and the same files would play just fine. Maybe after a few more months they will fix that part then maybe I'll switch out all of our rokus for the fire stick.", "verified": true, "helpfulness": "1/1", "author": "Ken Hollins \"FantasyKing\""}, {"rating": 3.0, "review": "The problem I am having is getting access to Netflix. At one time it worked and then not.", "verified": true, "helpfulness": "0/0", "author": "T. Nash"}, {"rating": 5.0, "review": "it's awesome!!", "verified": true, "helpfulness": "0/0", "author": "Kevin Lightheart"}, {"rating": 5.0, "review": "Does what it's supposed to do!  Easy install, great programming, no complaints!", "verified": true, "helpfulness": "0/0", "author": "S. Levitt \"SL\""}, {"rating": 5.0, "review": "Everyone in my house loves the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Candy \"Donna M. Souris\""}, {"rating": 5.0, "review": "The Fire TV Stick is awesome!  I had Google Chromecast, which is great as well, but I wanted to be able to watch Amazon Prime Video which Chromecast doesn't support.  I ordered 2 Fire TV Sticks and couldn't be happier.  I prefer the Fire TV stick's remote controls to having to use my phone or iPad as the remote.  Set-up was simple (and I'm not even a teenager), and there's obviously a lot of content.", "verified": true, "helpfulness": "0/0", "author": "Susan D. White"}, {"rating": 4.0, "review": "I am thoroughly enjoying the Fire TV stick.  I would have liked detailed instructions on how to use it.  I had to find a young person to teach me!", "verified": true, "helpfulness": "0/0", "author": "JOANNE RAWSON"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Jill Weise"}, {"rating": 5.0, "review": "The fire stick was easy to set up, and easy to get going.", "verified": true, "helpfulness": "0/0", "author": "Ted C. Brown"}]