[{"rating": 2.0, "review": "Be sure you aware that this thing has a power cord that needs to be attached. They barely show it in the description and if your TV is mounted on the wall, there will be a cable dangling from the bottom of your TV.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Bakari Dennard"}, {"rating": 4.0, "review": "The initial setup with my television was much simpler than I expected.  As for pairing it with my Kindle Fire, I literally didn't have to do anything.  The Kindle Fire found the Fire TV Stick on its own.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 5.0, "review": "I was a little leery, but I read the reviews and how it is used. Ordered it , plugged it in and la wa ....its great!", "verified": true, "helpfulness": "0/0", "author": "Julia"}, {"rating": 2.0, "review": "Huge issues with connectivity to networks.", "verified": true, "helpfulness": "0/0", "author": "Purchaser \"EGYPTIAN CASTLE\""}, {"rating": 2.0, "review": "OK so i just plugged this in. Seemed OK at first and now all i get is a \"playback fail\" and it stops the program I am watching and there is nothing I can do to fix it. Supposedly i can download an ap to link it to my phone to make another remote and tons of other options but alas it is only compatible with androids? What so now I can't use it and I guess playing games and other options they talk about is't a option. Anyone can you tell me is there a way i can get it on my iPhone, Kindle, iPod or anything I may have? Help... I want to love this but I don't know if it is an option :(", "verified": true, "helpfulness": "0/1", "author": "Jenntastic"}, {"rating": 5.0, "review": "Works very well.", "verified": true, "helpfulness": "0/0", "author": "Mike Poplin"}, {"rating": 2.0, "review": "If it would work better I would be nice. I have to restart this think four times a day.", "verified": true, "helpfulness": "0/0", "author": "Jacked"}, {"rating": 5.0, "review": "Awesome!!! Never use my chrome cast anymore!! Plan to buy a couple more for other TV's", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works pretty well.", "verified": true, "helpfulness": "0/0", "author": "Nick Phillips"}]