[{"rating": 1.0, "review": "Hiii amazone, I just request to cancle my order for fire tv. It display on advertisement that it is free shipping. But when I want to buy it, i have to pay additional for shipping. Could you explain about that?", "verified": false, "helpfulness": "0/2", "author": "agus suswanto"}, {"rating": 5.0, "review": "Very useful", "verified": true, "helpfulness": "0/0", "author": "German Gutierrez De Piñeres Rodriguez"}, {"rating": 3.0, "review": "Not bad with Amazon Prime but still has it's shortcommings.  I have the same complaint that I had with Netflix, movies are not that current and I'm not interested in watchings reruns.  My internet provider says all I need is 5 or 6 mbps to stream but I'm getting about 13 and still have to ocassionally wait through buffering.  I'll give it some time to see how It goes and then update my review.  This stick is cheap, but I think you really have to have Prime to make it worthwhile.", "verified": true, "helpfulness": "0/1", "author": "Catboss"}, {"rating": 2.0, "review": "I sent it back because applications were very limited.I think its' mosty because I was one of the first people to buy the stick and other apps were not fire ready yetI continue to use chromecast", "verified": true, "helpfulness": "0/0", "author": "Pat Edwards \"Amazon Lover Since 1999\""}, {"rating": 1.0, "review": "While I am sure the fire TV stick is exceptional as party to my other Amazon purchases, I am somewhat miffed at the effectiveness of the \"Help\" I received with hooking my unit up to my tablet. One helper told me to purchase the above item and contact them when I was ready to hook it up to my TV. The other person \"Help\" told me I was unable to use the stick  With my TV.  I gave them both the type of TV I had, so now I feel stuck or stiffed with an inadequate purchase.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I think it was an easy setup and great product.  Sometimes the picture isnt very clear.  I use it mainly for Netflix which works great, and amazon prime is lacking some of the shows I like, but great product itself.", "verified": true, "helpfulness": "0/0", "author": "Kim Yacono"}, {"rating": 3.0, "review": "Overall: The device serves its purpose, is cheaper or on the same price point with competing devices, and it was the only one that I knew for sure would play the Instant/ Prime streaming content.Pros: Easily hidden behind a wall mounted TV  Enables you to watch a variety of TV and movies without a cable subscription  Installation is easy, as in it's easy to figure out which pieces should connect where, but I had a hard time getting the plugs to actually go into my TV's HDMI port. Since this could be an issue with my TV and not the device, I'm not considering it a \"con\"Cons: Some streaming apps are constantly stalling or buffering, the Hulu Plus app is especially prone to freezing the picture while the sound continues to play  1-Click checkout is mandatory. Therefore, my dog was able to download an episode of a TV show that I had never heard of, and had no interest in watching. I'm out $3 and stuck with a show I don't even want. I wish I was making that up, but in the 2 minutes she was left unattended, she got the remote and chewed it in just the right places to order a show. If a dog can do that, imagine what a child could do.  Somewhat related to the above point, there is no power off option. There is \"Sleep\" and \"Restart\" but that's about it. So if you want to power it off, you'll have to reach behind your TV and unplug it.", "verified": true, "helpfulness": "1/1", "author": "Amber Stewart"}, {"rating": 5.0, "review": "Love it! No more commercials!!", "verified": true, "helpfulness": "0/0", "author": "Barbara K."}, {"rating": 5.0, "review": "I liked the first one so much I bought a second one. I use one when I stay at hotels and one in my garage.", "verified": true, "helpfulness": "0/0", "author": "Richard J. Pesce"}, {"rating": 5.0, "review": "Fire TV stick..GOOOOOD!  FIRE.....BAAAD!", "verified": true, "helpfulness": "0/0", "author": "Catmandolin"}]