[{"rating": 5.0, "review": "The firestick worked right out of the box. After setting up the wifi connection it worked flawlessly. The only problem I had was with Youtube videos that were cropped, but this seems to be a more general problem that was fixed. I am pretty happy with the device and have been enjoying videos, etc. I highly recommend the firestick.", "verified": true, "helpfulness": "0/0", "author": "H. Takai \"chemariachi\""}, {"rating": 1.0, "review": "The network capabilities are terrible.  I can see why Gary Busey looks so crazy on the commercials!  This thing is terrible.  I returned it and got an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "James Dickey"}, {"rating": 5.0, "review": "I am very happy with this.. I would recommend these to a friend", "verified": true, "helpfulness": "0/0", "author": "D. Chase"}, {"rating": 5.0, "review": "We use this in my kids room. We have not had any problems with it. It works great. We r very satisfied with the product and the price.", "verified": true, "helpfulness": "0/0", "author": "jeri hall"}, {"rating": 5.0, "review": "High quality design, performs quickly.", "verified": true, "helpfulness": "0/0", "author": "Steven Darrow"}, {"rating": 1.0, "review": "Beware!!!!!!!!  If you sign up for Sling TV to receive this for free this thing will devour your data.  If your internet provider puts a cap on your monthly data use, this will use it up in a few days.  I went over 250GB in one weekend watching Sling TV.  Sling TV does not give refunds.  Read the fine print before you sign up for the offer.", "verified": true, "helpfulness": "0/0", "author": "Kirk"}, {"rating": 3.0, "review": "Is stop to more dont leme seed the movies", "verified": true, "helpfulness": "0/0", "author": "yluminada vargas"}, {"rating": 5.0, "review": "Thank You", "verified": true, "helpfulness": "0/0", "author": "jose mercado"}, {"rating": 4.0, "review": "Installing batteries needlessly difficult.  Had to watch a few you tubes since instructions inadequate.  Besides that it worked as expected.", "verified": true, "helpfulness": "0/0", "author": "Victoria L. Petti"}, {"rating": 5.0, "review": "it is our new go to TV entertainment device.  Great quality and easy to use.  Got mine for free by subscribing to Sling TV for 3 months. ($60)  even got 2 friends to buy it.", "verified": true, "helpfulness": "0/0", "author": "CHRIS12B"}]