[{"rating": 4.0, "review": "Overall the Fire TV Stick was a good deal with the special pricing that I was able to get. Two minor problems that I have run into are first, the power cord was about 12\" too short for my closest available power source. Second, the WatchESPN app did not allow me to access the sporting events that I watch. I usually watch all kinds of college sports and I was not able to search by school and find the events that I wanted to watch.", "verified": true, "helpfulness": "0/1", "author": "Jeffrey from Denver"}, {"rating": 3.0, "review": "Remote range is about 6 to 8 feet.Waiting for remote apple app to see if it better.", "verified": true, "helpfulness": "0/0", "author": "Rene Garcia"}, {"rating": 5.0, "review": "A wonderful product. I will definitely buy one for each of my TV's. Very fast and easy to use", "verified": true, "helpfulness": "0/1", "author": "Steve & Robin Stinnett"}, {"rating": 2.0, "review": "My wife bought this for me to use when traveling for work. Unfortunately, it is completely worthless for that purpose because it is not able to connect to hotel wifi networks. However, when we use it on our home network, it's quite nifty. It seems there may have been a rush to get the product on the market for the 2014 holiday shopping season and some bugs still remain.", "verified": true, "helpfulness": "0/0", "author": "Harris429"}, {"rating": 2.0, "review": "I was looking for a way to stream spotify on my tv which is the main reason I bought this but the spotify connect app is never detected by my iphone 6. My phone detects every other pc and mac I own but not the tv. I have updated, restarted, reinstalled, re logged in on both ends multiple times to no avail. Don't buy it if you want it for streaming music wirelessly to your central console in the living room. And yes, I am a US resident and a premium subscriber which is needed by the connect app.", "verified": true, "helpfulness": "0/1", "author": "Rishav Mukherji"}, {"rating": 4.0, "review": "I was watching my prime video on the Kindle before. Now I can watch it on big screen. And the picture quality is very good. Like it very much. Two small things I don't like. First my kid can see my PIN on the screen (it asks me to select the number on the screen). Second it is easier to browse while it is difficult to search using the remote it provides.", "verified": true, "helpfulness": "0/0", "author": "Yumen Li"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/1", "author": "Kazuya Mori"}, {"rating": 4.0, "review": "The Fire TV Stick installed as per the instructions.  My biggest disappointment was the number of TV shows and movies listed that were not free with Amazon Prime as suggested in the sales material.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super deal! Worksgreat!", "verified": true, "helpfulness": "0/1", "author": "Dave McConnell"}, {"rating": 5.0, "review": "Better than many other streaming boxes.", "verified": true, "helpfulness": "0/1", "author": "G. Cooper \"cooptoons\""}]