[{"rating": 5.0, "review": "Getting ready to set it up", "verified": true, "helpfulness": "0/1", "author": "john"}, {"rating": 5.0, "review": "I have Chromecast and Firestick is WAY better.  It basically turns your TV into a Smart TV, which Chromecast does not do (you need a phone or tablet).  It streams in HD over my Charter ISP very well.  I haven't experienced any downtime yet.  I love how it saves where your place in a show/season and automatically resumes.I am a prime member so I also get to stream all the Prime content.  I watch it at least an hour a day.", "verified": true, "helpfulness": "0/2", "author": "RateMaster \"Nate Andrews\""}, {"rating": 5.0, "review": "Awesome! I now have two Fire tv sticks and one regular Fire tv, one for each tv :). The stick is wonderful and they only thing it doesn't have that the regular fire tv has is voice command. Not too big of a loss since the voice command only works on amazon content.We love the Fire tv because it is so easy to use. We can access everything we have subscriptions too: Netflix, Amazon Prime, HBO, etc. My son also likes to play some of the games.Recently I lost the remote (they are very tiny). However, it wasn't a huge deal because I downloaded the remote app on my kindle fire and can now control it from there. Super cool!", "verified": true, "helpfulness": "0/1", "author": "Desiree"}, {"rating": 5.0, "review": "I'm very pleased with the Amazon Fire TV Stick. The TV I use this on is a fair distance away from my wifi, so I was worried that it might flake out due to low signal. On the contrary, it is functioning flawlessly. I just watched an entire season of American Horror Story without so much as a glitch. The streaming is great; the picture is great. I'm more than satisfied. Also, I'm pleased to see several other interesting apps are available. Access to my Prime Music is a bonus, too. Great product!", "verified": true, "helpfulness": "0/1", "author": "Bug"}, {"rating": 5.0, "review": "I am very happy with the Fire TV stick, I can't believe I went so long without it.", "verified": true, "helpfulness": "0/1", "author": "AL"}, {"rating": 5.0, "review": "Very easy to install and easy to navigate menus.  I recommend this to anyone looking for a wifi connection.  The only thing to make sure of is that your wifi router is close enough for a good signal.  I had to move mine from location to location a couple of times. Once I found the sweet spot it works perfectly.", "verified": true, "helpfulness": "0/1", "author": "Dan Stephenson"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/1", "author": "nancy ray"}, {"rating": 4.0, "review": "I bought this for my dad and he love it", "verified": true, "helpfulness": "0/1", "author": "Akachivo"}, {"rating": 5.0, "review": "I bought this for my daughter since she is moving into a new apartment for grad school and will be on a tight budget.  She never watches anything in real time. With all the streaming services she just needs an Internet connection.  Great picture and wireless connection.  She absolutely loves the remote", "verified": true, "helpfulness": "0/1", "author": "MichelleO"}, {"rating": 5.0, "review": "My daughter and granddaughter live with me. My daughter bought HERS at BestBuy (naughty, naughty) but I got my first one from Amazon for my non-smart TV.  Dumb as a brick, that thing.  The Fire Stick changed MY life.  When Prime day came, I THOUGHT I got it for the $25, but didn't, but what the heck, my granddaughter does not have a cable box in her room, and has been unable to watch her TV at all.  I bought this second one for her, and she's delighted.  She can watch her beloved Creative Galaxy, and other Prime Only shows, plus Nevflix, etc. She loves CookieSwirlC on YouTube and that's what she watches most of the time.  She loves it!  I love having her have the ability to watch TV while I am cleaning her room.  This is also good when I wanted to watch a movie not age appropriate for her.  I'll watch one, and she'll be done with hers for the day.  I'm very happy with this!", "verified": true, "helpfulness": "1/2", "author": "Madeupagin"}]