[{"rating": 3.0, "review": "I like the overall idea of the Fire TV Stick (in the past we used our PS3 to access Amazon Prime on our TV) But I am kinda bummed that there is a power cord that plugs into the stick.  I thought the whole point was the portability of the whole thing, and here I am tracing down power cords once more whenever I want to move from one TV to another.  In addition, our main TV only has HDMI ports on the back side, and Amazon solved that problem by providing an HDMI extender cable, but the extender cable is only a few inches long, so it really didn't solve much of anything.  In short, the idea is good, but I am just not seeing much benefit to using it over our PS3.", "verified": true, "helpfulness": "0/1", "author": "Monkey in the Ointment"}, {"rating": 5.0, "review": "Excellent device. Easy to install. Somewhat cumbersome to move within choices - but I may just need more practice. Glad I got it at the special pre-release price too.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is the sixth streaming device that I've used.  That includes four Roku boxes and a Chromecast stick that I took a sledge hammer to.  The Fire stick is the cheapest and the best.The picture is better than the Roku 3 box when you compare them at 1080p resolution.  When I tested it while watching \"House of Cards\", which is also 1080p, the Fire gave as good a picture as my up converting smart Blu-ray player.  I do recommend using the power supply that comes with the stick, even though I was also able to power it from the USB port on my TV.  The Amazon power supply gives a brighter and more reliable picture and will not drop out during system updates should you accidentally power off the TV.The wireless connection is robust and works even when your SSID is not being broadcast (unlike Chromecast).  Setup was easy/  The app selection is not as broad as Roku but I could access 90% of the channels that I actually watch on the Roku.  I think with the momentum that Amazon has these days, the choices will be identical in a year.The unit mirrors seamlessly to my Kindle Fire HDX tablet.  If you are a Prime member, then there is NO reason not to have a Fire TV device.  In fact, get one to just keep in your travel kit to use in hotels.Well done Amazon.  This was my least expensive and most enjoyable Christmas present.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My apple TV doesn't play nice with the watch ESPN app nor does it do instant streaming from amazon so I bought the fire stick on a whim when it was $20 hoping it'd do both well. In reality it does everything so well that I hardly touch the apple TV anymore! And it does games, something I hardly use it for but a cool bonus!!", "verified": true, "helpfulness": "0/0", "author": "Alex Fagan"}, {"rating": 5.0, "review": "Easy set-up.  Workrked right out of the box.  Very pleased with performance,  great hd picture.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kurt Beck"}, {"rating": 5.0, "review": "The crazy thing about the Fire TV Stick is that I really can't tell the difference in speed or anything else from the regular Fire TV that I also have.  The components are similar to the Chromecast but the interface and speed is far better.", "verified": true, "helpfulness": "0/0", "author": "jhelms54"}, {"rating": 4.0, "review": "Sometimes we experience glitches from it, it will delay playing videos or shows or pause in the middle to load, and sometimes it will not open an app because of a malfunction so we have to restart it.  Also we were unaware it somehow syncs photos from your phone and displays them on the TV as a screensaver. It's a cool feature but not if you don't want your pictures displayed on tv!", "verified": true, "helpfulness": "0/0", "author": "A Jenkins"}, {"rating": 5.0, "review": "Love love love this addition to amazon", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very wow. Much nice.", "verified": true, "helpfulness": "0/0", "author": "Stacia Myers"}]