[{"rating": 2.0, "review": "I have a horrible time pulling anything in from the internet. It always locks up and buffers for ages.", "verified": false, "helpfulness": "2/3", "author": "Donna Trotter"}, {"rating": 5.0, "review": "The was the only good thing that I could find on Amazon's \"Black Friday\" deals.", "verified": true, "helpfulness": "0/1", "author": "ronniec"}, {"rating": 4.0, "review": "Trying to log in they asking for Amazon login id", "verified": false, "helpfulness": "0/1", "author": "Raphael winston"}, {"rating": 5.0, "review": "With my ps3 on the fritz and not having the money to replace it. I found that I could watch Netflix and more by just buying the fire stick. AND I didn't have to mess with turning on my ps3 to do so. Within 5 minutes of getting my fire stick I was watching a movie. Yep I'm happy!", "verified": true, "helpfulness": "0/1", "author": "andthegirl"}, {"rating": 4.0, "review": "Four stars is based solely on the recommendation of the instructions manual to have the unit plugged into a normal power outlet and not the USB port on the TV. I mounted my TV on the wall and routed all of the cables through the wall. I'm not going to route this USB power cable through the wall too. It has functioned sufficiently connected to my 2009 Sony Bravia. I may have missed an Wi-Fi downloadable update or something...I've had an issue once or twice where it wouldn't find my Wi-Fi network. To correct I would unplug it and the USB power from the TV, wait 30 seconds, and plug it in again for everything to work out fine.", "verified": true, "helpfulness": "0/1", "author": "A. Neiman"}, {"rating": 5.0, "review": "I have had this for one and a half days and I already feel this was money well spent.  For streaming content online, whether movies, television show, or music videos - this is the easiest by far. We've watched all of the above as well as live baseball games, listened to streaming radio and played a game similar to Mario. I set my television's sleep timer and fell asleep to streaming 80's rock music. :) I recommend this to anyone considering a purchase. I haven't even scratched the surface of what I can watch with it. Since I don't need the storage, it works better than the box for me - especially at this price! LOVE  it!", "verified": true, "helpfulness": "0/1", "author": "Robynne Wildman"}, {"rating": 5.0, "review": "This thing is awesome.  Much quality than using computer linked to TV.", "verified": true, "helpfulness": "0/1", "author": "Michael Miller"}, {"rating": 5.0, "review": "It works great. Wish I would have gotten it sooner. A plus was the video games. Now I have to get one for the kids.", "verified": true, "helpfulness": "0/1", "author": "Trishun"}, {"rating": 3.0, "review": "A little disappointed, thought there would be more prime movie options.", "verified": true, "helpfulness": "0/1", "author": "Lma"}, {"rating": 1.0, "review": "I really hoped this would work and it did perfectly for 10 days or so, then it just stopped. Could not get past the start up screen. Unplugged, switched HDMI inputs, changed the batteries in the remote, etc............There is no technical support online that I can find.  It works great, if it works.", "verified": true, "helpfulness": "0/1", "author": "Kelly W."}]