[{"rating": 2.0, "review": "The device gets awfully hot, and it gives me crap for not using the given power adapter (5.0Volt 1.0Amp) even though my TV has a 5.0V 1.0A USB port (it's labeled on the TV). I also don't like the idea it is always on (I know it goes to sleep.) If it didn't warn me about using the TV USB power I wouldn't have that concern because when I shut my TV off it would kill the power to the Fire TV Stick.If I didn't get it 'free' with my 3 month Sling TV purchase I'd likely send it back.", "verified": true, "helpfulness": "0/0", "author": "Reptyle"}, {"rating": 2.0, "review": "Doesn't work as I expexted", "verified": true, "helpfulness": "0/0", "author": "D. Head \"me2chic\""}, {"rating": 5.0, "review": "ITS REALY GREAT. I THINK THE SHOULD UPGRATE TO MOST RECENT MOVIES LIKE THE ONES YOU GET IN THE RED BOX", "verified": true, "helpfulness": "0/0", "author": "Linda Tousignant"}, {"rating": 5.0, "review": "Wonderful easy to hook up", "verified": true, "helpfulness": "0/0", "author": "Tamara Ropetski"}, {"rating": 5.0, "review": "very good! I have already used it for a month.", "verified": true, "helpfulness": "0/0", "author": "qingyun"}, {"rating": 2.0, "review": "An ok product. Great potential, you have to know what you're looking for in order to find it. And I'm not always sure what I'm looking for costs or is free until I get to the open screen.", "verified": true, "helpfulness": "0/0", "author": "Timothy k Taylor"}, {"rating": 3.0, "review": "I purchased 2 Fire TV Sticks from Best Buy, I have one in my bedroom and the other one in my living room.  The bedroom Fire TV Stick is always, always displaying a message of \"Lost Network Connection.\"  The living room does not do that but after calling Amazon they told me that I have too  many WIFI devices connected to  my router.  They instructed me to disconnect the bedroom Fire Stick then plug it back up after 30 seconds they also instructed to me disconnect my living room router for the same amount of time.  Well, I have performed their given instructions on numerous occasions only to have the problem continue repeatedly.  I am very frustrated with the fact that I have to use my Wii in order to view Netflix in my bedroom.  My plan was to purchase a Smart TV but figured that I would just turn my bedroom television into a Smart TV for a fraction of the price.  I am extremely disappointed in Amazon and now I feel as though I should have followed my first mind and purchased the Smart TV for the bedroom or perhaps I'll just purchase the Apple TV for my bedroom because at this point I would rather not waste time and money on Amazon by enduring another let down from a purchase of their $99.00 Fire TV.  I have purchased several items from Amazon but this is the most disappointed that I have ever been.  I wanted to give the Fire TV Stick 1 star but I wanted to be fair and honest since the one in the living room is working very well.  And by the way, the living room and the bedroom have a shared wall with the router sitting against the shared wall.  And I live in an apartment which means that the walls are very thin.", "verified": true, "helpfulness": "0/0", "author": "Monique"}, {"rating": 5.0, "review": "Great product!! Love it!!", "verified": true, "helpfulness": "0/0", "author": "Shawn Horning"}, {"rating": 5.0, "review": "LOVE THIS THING!!! So easy to use and all you have to do is unplug it and plug it into another tv! I originally purchased this as a christmas gift for my husband but i think i really wanted it and used it as an excuse! I use it in my kitchen tv while cooking and cleaning since i dont have a cable jack in there, not only that i'd rather pay once for this stick and then for the services then pay an additional charge to my cable provider. This links to the wifi in this house and you use your log ins for the apps on the stick. LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Alaura"}, {"rating": 5.0, "review": "Best thing I have bought for myself in along time.  I just plugged it and bam I was watch movie!! Love, love, love it!", "verified": true, "helpfulness": "0/0", "author": "Laura Davis"}]