[{"rating": 3.0, "review": "i am having buffering issues when i play on Hulu or Netflix. I use on the xbox and i don't have the same issues as i do with the firestick.", "verified": true, "helpfulness": "0/0", "author": "alexandra steeley"}, {"rating": 5.0, "review": "Great, just wish it had YouTube, best thing I've purchased and feel really good about it", "verified": true, "helpfulness": "0/0", "author": "erykah butler"}, {"rating": 5.0, "review": "Really like that fact that we can watch shows that we couldn't even get on regular cable TV. Once in a while there might be a little issue with the show, but then later you can pick up and finish watching. Not a big deal to us.", "verified": true, "helpfulness": "0/0", "author": "djcj"}, {"rating": 3.0, "review": "Meets expectations do far", "verified": true, "helpfulness": "0/0", "author": "Anselmo"}, {"rating": 5.0, "review": "I'm loving my Fire TV Stick. It is just awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Master73"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "sarah matthew"}, {"rating": 2.0, "review": "I have Fire TV and two fire sticks. After a month one of the fire stick's stopped working. Can I get it replaced?", "verified": true, "helpfulness": "0/0", "author": "David Stuart"}, {"rating": 5.0, "review": "The minute this black box showed up, I knew this was going to be a truly enlightening experience.  Then I opened the box, and let me tell you, it was beyond enlightening.  The inside of the box is coated orange, but not just orange, I mean orange with the brightness of a thousand suns.  Years ago I went camping and I got lost in the middle of the woods.  Now I'll never go camping without this box - it could light the Valley of the Shadow of Death with it's supernova luminosity.Besides the intensely awesome colors, the FireStick performs wonderfully - especially with the iphone remote control app.  I didn't tell my wife about the iphone app right away.  I kept telling her she was pressing the wrong button when she asked me how to use the included mini-remote.  Even though there's only like 6 buttons.  Meanwhile I was secretly controlling things with my iphone just to mess with her.  So I'm not sure if the app was designed purely for entertainment purposes or not, but I must admit that it was insanely awesome to watch the resulting confusion.", "verified": true, "helpfulness": "0/0", "author": "Joshua N Rayburn"}, {"rating": 5.0, "review": "Love it- works great. Takes a bit of getting used to but after that very nice.", "verified": true, "helpfulness": "0/0", "author": "ICONMAKER"}, {"rating": 5.0, "review": "awesome gizmo. I love it 100", "verified": true, "helpfulness": "0/0", "author": "Cole Deacon"}]