[{"rating": 5.0, "review": "Amazing addition to our home theater!!!  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Rudy Arevalos"}, {"rating": 5.0, "review": "We are.Very happy with the Fire Stick....hooray,hooray!", "verified": true, "helpfulness": "0/0", "author": "Rita DiRico"}, {"rating": 2.0, "review": "It has a leg time between the voice and the talking. It happens mostly if I've been fast forwarding.", "verified": true, "helpfulness": "0/0", "author": "Scott Hoadley"}, {"rating": 5.0, "review": "Excellent performance, easy setup.", "verified": true, "helpfulness": "0/0", "author": "Randall Lair \"Tailspin\""}, {"rating": 5.0, "review": "Great productI only wish the programs were on HD", "verified": true, "helpfulness": "0/0", "author": "joyce stanzel"}, {"rating": 1.0, "review": "Problems with the HDMI signal causing the screen to flicker.  Very unhappy with it.  Don't see any advantage having this over all the other products out there just like it.  It's just another way for Amazon to sucker money from your wallet.", "verified": true, "helpfulness": "1/2", "author": "Neil Moore"}, {"rating": 5.0, "review": "Great product.  I truly enjoy watching shows and movies through the Fire tv stick", "verified": true, "helpfulness": "0/0", "author": "smhunder"}, {"rating": 3.0, "review": "I pre-ordered before it was released and got it for the great price of 19.99.  It's great for your Amazon Prime viewing and there are some cool mini games that you can actually control with this itsy bitsy remote that's a nice feature.  There is also access to your cloud photos which I have none at the time so I can't comment on how that works, but it's a nice feature.  There are some cooking apps available for download, they all suck badly.Outside of Amazon related apps, so products like YouTube, Netflix and some of the other streamed software options run poorly and slowly compared to the Amazon Prime. It is a noticeable step down in performance compared to my PS3, Vizio smart TVs, and even a 10 year old HP Pavilion running on windows XP.There are some cool mini games that you can actually control with this itsy bitsy remote that's a nice feature.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Worked great for a couple of weeks but then stopped working going to replace it with something else.", "verified": true, "helpfulness": "0/0", "author": "Tsaff"}, {"rating": 5.0, "review": "I purchased the fire tv stick to use with my fire hd 6 and Amazon prime.  It works great with wifi (especially when compared to other streaming devices I've tried) and I really like that it can be controlled by my Fire or the remote that came with it.  Also use it with Netflix app which works smoothly on it.  There's lots more that can be done with this device that I'm sure works just as well. I would highly recommend the fire tv stick, especially if someone has a prime account.", "verified": true, "helpfulness": "1/1", "author": "Dwayne Thompson"}]