[{"rating": 1.0, "review": "The fact that you have to keep it powered with the AC Adapter really ruins the whole experience.", "verified": true, "helpfulness": "2/3", "author": "Nathan Hassoun"}, {"rating": 1.0, "review": "USELESS right out of the box. Won't connector to my network except 1 out of 20 tries. Customer Service sends me replacement. STILL won't connect. Then I'm talked to paying even more money for HDMI extension. STILL WONT WORK.  Then the Customer Service tells me I, yes me, needs to call my wireless router manufacturer to figure out why this product doesn't work. None of my other devices.....including Apple TV....have problem connection to my network.  No thanks returning everything, sticking to competitor's product.", "verified": true, "helpfulness": "1/3", "author": "petr malik"}, {"rating": 5.0, "review": "Great little device. Love it so far", "verified": true, "helpfulness": "0/0", "author": "L3NZ3R"}, {"rating": 5.0, "review": "LOVE LOVE LOVE LOVE THE FIRE TV STICK!!", "verified": true, "helpfulness": "0/0", "author": "Kylee Harting"}, {"rating": 1.0, "review": "It worked fine for one week,then... it would lock up,not work. I had to constantly  re-enter wifi name and password. It was not worth the $19 I paid for it. I had to order the regular fire tv box.", "verified": true, "helpfulness": "1/4", "author": "M F"}, {"rating": 5.0, "review": "Easy to hook up and works beautiful.", "verified": true, "helpfulness": "0/1", "author": "BillB"}, {"rating": 5.0, "review": "Beyond what I expected.", "verified": false, "helpfulness": "0/1", "author": "Marcelo"}, {"rating": 4.0, "review": "Faster than our ROKU players.", "verified": true, "helpfulness": "0/1", "author": "niapriv"}, {"rating": 1.0, "review": "I hate this thing.  It constantly drops our wifi connection.  Telling me to rearrange my house so the fire stick can be next to the router seems a little ridiculous to me.  Perhaps a software fix is needed.  Yes, when it is connected it says \"excellent connection\" so the router is not the problem.  Beware this thing still has a lot of issues.  Hopefully the 2nd generation will not have this issue.", "verified": true, "helpfulness": "3/6", "author": "steven t smith"}, {"rating": 5.0, "review": "Great Product !!! Far Far better than Chromecast in terms of Streaming content", "verified": true, "helpfulness": "1/1", "author": "Hareesh"}]