[{"rating": 2.0, "review": "It makes this awful beep whenever the show takes too long to load.  I have 2 chromecasts and a roku stick and the fire tv stick is the only one that has delays on programs.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Rachel\""}, {"rating": 4.0, "review": "Without the voice feature on your remote, searching takes a bit of time. With that said, the interface is user-friendly and intuitive; the available apps are plentiful and exciting; and setup was a cinch.", "verified": true, "helpfulness": "0/0", "author": "Tk"}, {"rating": 5.0, "review": "Love it! Can access all my favorite shows and is easy to use! I have Apple TV and thought that was the best. Fire TV has taken over.", "verified": true, "helpfulness": "0/0", "author": "D. THOMPSON-GARRETT \"Freebird78\""}, {"rating": 5.0, "review": "This is absolutely amazing! The broad categories of entertainment offerings and the ease of access provides something for all members of the family. I am a PRIME member so I have enhanced material from which to select.The stick is now about $40.00 one-time cost. Start with a PRIME subscription at $99.00/year (paid annually) which comes out to $8.25 per month. Hulu and Netflix are each right under $10.00 per month, so for about $30.00 a month (plus your internet fee)  you'll have a lot of entertainment options.So tell me again why I need cable TV?", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "excellent with lots of movies. no hesitation or pauseing while watching movie", "verified": true, "helpfulness": "0/0", "author": "stvn"}, {"rating": 3.0, "review": "It's good when it is connected, but stops streaming a couple times a day with \"connection with problems\" showing on network status. I have to \"forget\" the connection and re-enter my password and reconnect then it's good for another movie or two before it happens again. I have a Chromecast and Roku stick in the same TV, plus 2 android phones that never lose connection to the same wifi router, only the FireTV stick has any problems staying connected.Otherwise it's nice, the interface is fairly smooth, the remote has enough range (barely) to reach my sofa (unlike the Roku remote that has a range of about 4 feet) and it plays Prime Videos and Netflix videos well. It's easy enough to distinguish between Prime content and stuff that costs money. I wish it could change the TV input like Chromecast does, and I *VERY MUCH* wish it had a volume control like Chromecast does. I use powered speakers connected to my TV, and don't have any remote for volume at all, so it's nice to be able to change volume using Chromecast and Roku, and it seems pretty ridiculous shortcoming to me to have a digital content player that can't change audio volume. It gets the job done, and the $20 I paid for it during the sale makes it worth having. If I'm playing something other than Amazon content though, I have other sticks that do a better job.", "verified": true, "helpfulness": "3/3", "author": "James Paul"}, {"rating": 5.0, "review": "Amazon does it again!  This is an awesome tool!  I have a smart TV but is not as fun and easy to use as the stick!  And, if you tell your Harmony Ultimate it is a Fire TV it controls it, vey cool!  This is a great way to get screensavers on your TV also....buy it it's cool!", "verified": true, "helpfulness": "0/0", "author": "Al Sample"}, {"rating": 5.0, "review": "Love it! I wish I had gotten this sooner! Better than a kindle on steriods!!!!", "verified": true, "helpfulness": "0/0", "author": "sbpar"}, {"rating": 5.0, "review": "Works great with myTV", "verified": true, "helpfulness": "0/0", "author": "abilene_m_f"}, {"rating": 4.0, "review": "If youre an amazon Prime member this is a no brainer. Im a roku user, and this wont replace my roku 3 mainly because the roku 3 is so much faster at loading than a streaming stick. But this is great alongside. Now I can stream the Amazon prime music as well as having easy access to everything else. The games look fun for wasting a minute or two so Ive ordered a controller. Plus, like the Fire tablet, you can sideload apps...the roku cannot do that unless youre using a third party like plex which requires a PC/Mac connection. Again $19?? No brainer.", "verified": true, "helpfulness": "1/1", "author": "Casey Earl"}]