[{"rating": 3.0, "review": "The ui is not fluid compare to the fire tv box", "verified": true, "helpfulness": "1/1", "author": "Kuo-hua Tseng \"robert\""}, {"rating": 5.0, "review": "I love the fire stick, it's amazing I bought an amazon gift card and was able to rent movies and I also connected my hulu and netflix account. If your considering to purchase this product do so it is awesome! Beats having a blue ray player", "verified": true, "helpfulness": "1/1", "author": "drew"}, {"rating": 4.0, "review": "We received this just before Christmas and were excited to use it.  We did however find it difficult to start up.When it would not hook up to the internet.  We called customer service and at first the tech was no help what-so-ever.  He did not know what to do, so he graciously insisted on refunding my money.  Which would be fine,but I wanted to use it.  So he handed me over to his supervisor, who work diligently to help us get started.  Wefound that we had to first hook it up to the TV in our home that was already hooked to the Internet to get it toconnect to the internet.  Once we did that, we were able to move it to our not so smart TV and use it.We totally enjoy it...with a few exceptions.  Since there is no shut off, we find that it will turn itself on.  It willflip our TV over to the source it's on, when ever it feels like it.  So we have had to unhook it inbetween uses.", "verified": true, "helpfulness": "1/1", "author": "J. Malley \"dancingangel\""}, {"rating": 4.0, "review": "It works great for Netflix and the like. The games are some lame stuff that was ported over from android or apple. The only problem I have with it is there is no good way to stream video from your computer over your home network.", "verified": true, "helpfulness": "1/1", "author": "B. Webb"}, {"rating": 5.0, "review": "This is a wonderful product.  I have yet to go searching for something to watch without finding something great.  It connects seamlessly with my TV, which is not the newest one around, so it should really do a number with a newer TV.  Setup took about two minutes.  It just slips into your TV's HDMI port.  They even give you an HDMI extender in case it's hard to get the stick into the small space on the back of the TV.  I needed to use it.  It's very easy to use as well.  I'm really pleased with it and am getting a lot of use out of it.", "verified": true, "helpfulness": "1/1", "author": "Linda Abbott"}, {"rating": 4.0, "review": "Didn't realize the stick needed to be plugged into an outlet.", "verified": true, "helpfulness": "1/1", "author": "Laurie Carlson"}, {"rating": 4.0, "review": "Learning curve but love the basis! I am an Amazon Prime fan and it is now my go to place! This just made it much better! Now the kids can have movie night on their TV! All the movies we buy at their finger tips for them to enjoy together. Especially at spend the night parties! One big down side, the popping noise. Would have 5 stars if it weren't for this painful popping. I can't figure out how to stop this popping noise the sick makes through the speakers when making selections. Also another set back we got around.... make sure it is close enough to the WiFi or in an unobstructed area. If not, you will constantly have connection issues. Our port was in back not on the side and was a problem. We solved this issue by using the attachment extender. It then hung below our TV instead of behind and now it gets WiFi signal no problem. Still would highly recommend it though!", "verified": true, "helpfulness": "1/1", "author": "Angela \"The married mama who is always on the move! :D\""}, {"rating": 4.0, "review": "good I like it, sometimes lost the wifi signal but is not all the time, good for the price ..", "verified": true, "helpfulness": "0/0", "author": "Christian Cordon"}, {"rating": 4.0, "review": "Its one of the good product. Only one option I felt missing is streaming any video from any site which can be done in Chromecast. Apart from that it is superior to Chromecast in all aspect.", "verified": true, "helpfulness": "1/2", "author": "Raja Ram R"}, {"rating": 2.0, "review": "I got this through the introductory offer.  I replaced an older streaming device with the Amazon Fire TV stick, and have used it as my sole media device for most of the last month.  When payday comes, I'm planning on replacing this with a device that has broader access to sources of media content outside the Amazon ecosystem.  Not being able to access all of the digital movies I've purchased elsewhere (many, but not all - Disney in particular - are available through the Flixster app) is the deal-breaker.The interface is nice, and would work well for anyone who gets all their content from Amazon, or other subscription-based streaming content sites like Netflix and Hulu Plus, just not other sources of purchased content.  The remote is convenient and works well, and the functionality of the device is sound.", "verified": true, "helpfulness": "1/2", "author": "David"}]