[{"rating": 5.0, "review": "I love it. Thinking about getting another one for upstairs TV so I don't have to keep switching from one TV to the other.", "verified": true, "helpfulness": "0/0", "author": "Linda McCloskey"}, {"rating": 5.0, "review": "I love the Amazon Fire TV Stick....great streaming, ease of use, easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Terri Corthell"}, {"rating": 5.0, "review": "I am moderately tech savvy, but hated hooking up my laptop to my television to watch Prime Instant Video. I read all the reviews on the Amazon Fire Stick and took the jump. I am thrilled with it! It is easy to use and to hook up. I can take it to my daughters house to babysit my grandkids. Best $40 you'll ever spend.", "verified": true, "helpfulness": "0/0", "author": "ggglendale"}, {"rating": 5.0, "review": "AAA+++", "verified": true, "helpfulness": "0/0", "author": "Lina"}, {"rating": 4.0, "review": "This is great! I really like that I don't have to drive to redbox and \"hope a movie is there\". They're a lot of movies available on prime (free for prime customers). The only thing I wish was different is that it's not wireless. All of my other TV cords have already been hidden within the wall. I bought this after and wish the cord was hidden as well.", "verified": true, "helpfulness": "1/1", "author": "Nakida Robinson"}, {"rating": 5.0, "review": "Bought it for my 12 year old and she loves it and it is easy to use!", "verified": true, "helpfulness": "0/0", "author": "Nancy Green"}, {"rating": 5.0, "review": "So easy to hook up and get started. Tons of shows available on Prime. Love it!", "verified": true, "helpfulness": "0/0", "author": "Allison Tooker"}, {"rating": 5.0, "review": "A little slower than the fire tv box we have, but that's to be expected.  But it's quick enough and serves up content without much delay.  All in all though it does exactly what it's supposed to do.", "verified": true, "helpfulness": "0/0", "author": "Daisey Taylor"}, {"rating": 5.0, "review": "easy to use - we like the picture - works well with the wifi - no problems", "verified": true, "helpfulness": "0/0", "author": "c. smith"}, {"rating": 5.0, "review": "I bought a FireTV Stick on Prime Day.  I got it 2 days later and I have been loving it.  It was very easy to set up and the selection of apps is great.  Because it is small, it saves space and I also appreciate how portable it is.  I just unplug it from my living room TV to take to my bedroom when I want to watch things there.  Really happy with it!", "verified": true, "helpfulness": "0/0", "author": "S. Gibson \"ShyGirl926\""}]