[{"rating": 5.0, "review": "user friendly and super easy to install/set-up, great user interface, good selection of apps and content.", "verified": true, "helpfulness": "0/0", "author": "Nicole Vernet"}, {"rating": 5.0, "review": "Cancel my cable now! My whole family loves this. Purchased as a family Christmas present. Got it on January 2, expected it the 9th. We have 3 kindles (2 7\" fire hd, 1 fire 2nd gen) we use all the time. But with the Fire Stick, it's like we turned the tv into a giant kindle we can all use together.  Set-up was super easy, anyone can do it. If you have Amazon Prime this is a must have.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "A Great streaming device with many possibilities to customize. I prefer this over the chromecast because it's possible to sideload apps and the remote is very handy.", "verified": true, "helpfulness": "0/0", "author": "Bernardo Batista"}, {"rating": 5.0, "review": "Enjoying it", "verified": true, "helpfulness": "0/0", "author": "jeanette boyd"}, {"rating": 3.0, "review": "To early to tell. Big problem weak wi fi", "verified": true, "helpfulness": "0/0", "author": "DONALD KNAPPE"}, {"rating": 5.0, "review": "What a fantastic product!! Love all it has to offer and the price (got in on it when it was on sale) can't be beat. I love the interactive features and that I can run it from all our devices. I also love that if I am watching something on my phone or Kindle I can \"throw\" it to my TV and continue watching it", "verified": true, "helpfulness": "0/0", "author": "Jenniffer B. Perron"}, {"rating": 2.0, "review": "3-starsI purchased this device during a  2-day prime sale for $19.99 and loved it...that is until recently.  It worked fine until mid-December when an automatically applied software update broke the ability for the device to connect to WiFi networks with \"special\" characters in the pre-shared key.  For the record my special characters are \" ? , and space\" I contacted Amazon about this issue and was transferred to second level engineering.  After doing all of the normal and even asinine (plug into a wall outlet and not a powerstrip) troubleshooting the result was \"I'll contact you in 2-3 business days\".  Fine, I can wait that long.I received the call back and the resolution was to change my WiFi password.  Um, really Amazon?  That is the solution?  I have 15 other wireless devices (not an exaggeration) on the network using this same password just fine, and I should change it because Amazon broke your device with an update that wasn't regression tested very well.  I promptly asked for a refund and was told that if I'd be willing to wait for 2-3 more business days they would have a resolution for me to fix this issue.  The problem is, HOW WILL THAT FIX IT!?  I still won't be able to connect this thing to my network to download whatever update they come up with anyway!Pretty disappointed with this customer experience.  I've never seen something this bad.UPDATE: 1/15/2014 - Still no update except to say that the development team has amended the ticket I have open to say, \"At this time Fire TV Stick does not support special characters.\"  No update as to repair timeframes and still no information about this issue on the tech support site for this product.  -1 Star.", "verified": true, "helpfulness": "0/0", "author": "Alexander McCoy"}, {"rating": 5.0, "review": "Love the simplicity of setup and usage. Liked it so much got one for my parents.", "verified": true, "helpfulness": "0/0", "author": "Jonathan M. Brennan"}, {"rating": 3.0, "review": "Like the functionality and all the apps available.  Would rate better if only it did not require its own power source.  I assumed it would power when plugged into the TV's HDMI since there is no mention or picture of an external power source.  Also, the power cord supplied is too short to reach an outlet behind the entertainment center.  Does have a USB option if your TV has one, however it is \"recommended\" that you use the power cord instead which is a micro USB that plugs into the Fire Stick itself.Other than that, it's pretty cool, not to mention the portability when traveling!", "verified": true, "helpfulness": "0/0", "author": "Watcher"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Bob Bretherton"}]