[{"rating": 5.0, "review": "My family loves it, this is a great deal especially if you're a Prime member", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"BETHANY LUVS BOOKS\""}, {"rating": 5.0, "review": "I've had this about a week now, and so far, so good.  Don't regret my purchase at all.", "verified": true, "helpfulness": "0/0", "author": "Luke's GaGa"}, {"rating": 5.0, "review": "Absolutely a great gadget.  Would buy it again for one of my family members.  Cannot say anything negative about it.", "verified": true, "helpfulness": "0/0", "author": "Flatbush"}, {"rating": 5.0, "review": "We ordered this to replace out roku which had started presenting with red lines. I also replaced Netflix with Amazon Prime. Netflix movies are so outdated and they do not replace often enough. I am so pleased with the ease of using the firestick and the quality of the pictures. Best of all I am loving the offerings from Amazon Prime. So much better than Netflix. I am now watching The White Queen season one for free. If you are thinking of switching don't hesitate.", "verified": true, "helpfulness": "0/0", "author": "kindle customer"}, {"rating": 5.0, "review": "I ended up with the Chromecast and the Fire TV Stick this Christmas.  I use the Fire Stick every day.  I tried the Chromecast a couple of times - it lives in a box, waiting for me to sell it or re-gift it.  Great product - recommended!  (Using the iPhone app as a remote works great, too.)", "verified": true, "helpfulness": "0/0", "author": "Spiderman"}, {"rating": 5.0, "review": "I have (2), very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Pamela Olsen"}, {"rating": 5.0, "review": "Everybody Needs one of these! Tons of shows and movies and even sweeter if your a prime member!", "verified": true, "helpfulness": "0/0", "author": "D.G.P"}, {"rating": 4.0, "review": "nifty gadget.  we are enjoying it", "verified": true, "helpfulness": "0/0", "author": "Linda Lanting"}, {"rating": 5.0, "review": "I'm very busy and watched more recored tv than anything; and it cost me a lot of money. Fire TV is excellently priced and has more apps than you'll know what to do with. Fire TV turned my smart TV into a Genius! Just get it!", "verified": true, "helpfulness": "0/0", "author": "Fire Fan"}, {"rating": 5.0, "review": "oh my gosh so fricken cool!!  and SUPER easy to install!!  I thank my dad for buying this and sending to me as a gift - I never would have purchased myself, but now I see what it does (makes non-cable tv's like they have SUPER cable!) I'm telling all my friends about it!", "verified": true, "helpfulness": "0/0", "author": "beth1307"}]