[{"rating": 3.0, "review": "Often hesitates when remote is used, picture freezes and loses the wireless signal. When it works it works great. (Should add Slacker to Apps).", "verified": true, "helpfulness": "0/0", "author": "Michael W. Cornish"}, {"rating": 5.0, "review": "It work fine,easy to intall.lot movie and show to chose.great product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I like the small footprint and it automatically configured the device when the device was on the wireless. However, the wireless connection does not stay all the time. The device required power cycle to reconnect to the wireless.", "verified": true, "helpfulness": "0/0", "author": "WBC \"CaptKave\""}, {"rating": 1.0, "review": "Could not make it work no matter how hard I tried or how much time I spent trying.  Had to return it.  A disappointment, no doubts about it.  Maybe the next generation of Fire TV Stick will work better for me.  By the way, I do have a 2014 Samsung TV packed with all kinds of bells and whistles, including Wi-Fi and it picks wireless just fine, so that was not an issue.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I don't really notice much difference than Roku as far as streaming Netflix goes.  I don't really use the other features, such as moblie streaming or apps.  And, Netflix service is probably the biggest problem with it, so the stick doesn't make much difference.", "verified": true, "helpfulness": "0/0", "author": "PLG"}, {"rating": 5.0, "review": "Works like a champ!  Love it!  Just wished I could add HBO to it.  :-(", "verified": true, "helpfulness": "0/0", "author": "E. Benson"}, {"rating": 5.0, "review": "The Fire HD stick just opened up one of our viewing areas to FABULOUS New choices! Earlier this year we purchased a Smart TV to replace one that went out. As one of the features we had access to Amazon Prime Videos. I have had a Prime account for many years but never used any other aspects or features available besides the 2 day Free shipping. When we realized how beneficial the Amazon Prime viewing was I immediately purchased the Fire stick for a different TV in our main viewing area. Besides having access to movies-galore there is a plethora of TV shows to watch especially ones for the Kids. This device , literally, can replace paid broadcasts and programming.It connects quickly and there are absolutely NO complaints from me or my Family.", "verified": true, "helpfulness": "1/1", "author": "Brent Dalton"}, {"rating": 5.0, "review": "More than I expected!", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 5.0, "review": "Awesome!!  If you don't have a smart TV this will bridge the gap.", "verified": true, "helpfulness": "0/0", "author": "SEVER2"}, {"rating": 5.0, "review": "Great value.  Works on the same scale as my Apple TV which cost 5x the price.", "verified": true, "helpfulness": "0/0", "author": "matt altman"}]