[{"rating": 3.0, "review": "I think mine was defective.  The interface looked nice and had a lot of features, but signal quality was so low that it spent more time buffering than playing.  I know it's not my router, I have an RT-N66U, less than four months old, and I have a 1 amp amplifer on it with (2) 9\" antennas and (1) external 3' antenna.  I stream 14Mbps out of my house and across the yard, and into my neighbor's house with no issues.  I stream 28Mbps to the other side of my house, through 3 walls, approximately 65 feet away...but, putting this Firestick only 18 feet away, through just one wall, yields almost no throughput at all.  I stopped using it.", "verified": true, "helpfulness": "0/0", "author": "no comment \"luquien\""}, {"rating": 5.0, "review": "Excellent product at a great price. Good wireless streaming, no issues to report.", "verified": true, "helpfulness": "0/0", "author": "HG"}, {"rating": 5.0, "review": "Love it !", "verified": true, "helpfulness": "0/0", "author": "shelby220"}, {"rating": 5.0, "review": "Works exactly as described! Buying more!!", "verified": true, "helpfulness": "0/0", "author": "Derrick Madison"}, {"rating": 2.0, "review": "Not that great LIKE I thought", "verified": true, "helpfulness": "0/0", "author": "Barbara Perez"}, {"rating": 5.0, "review": "Work's great!", "verified": true, "helpfulness": "0/0", "author": "Pedro"}, {"rating": 5.0, "review": "I just received my Fire Stick today and I absolutely love it. It has so many apps and games. I love that I can access my Amazon Prime, HBO Go and StarzPlay. Now I have to buy the controller so that I can play all the games :)", "verified": true, "helpfulness": "0/0", "author": "Bria Buford"}, {"rating": 5.0, "review": "How did we ever live with out this amazing device.  Portable, easy to use, and it has some really cool games.A++ Amazon, I am actually thinking about buying the FireTV now with the game bundle.", "verified": true, "helpfulness": "0/0", "author": "UncleT"}, {"rating": 5.0, "review": "Easy set and start up very user friendly load with options great buy recommend for all.", "verified": true, "helpfulness": "0/0", "author": "vince"}, {"rating": 5.0, "review": "The best ever entertainment device.", "verified": true, "helpfulness": "0/0", "author": "suzy"}]