[{"rating": 3.0, "review": "I've had time to use this device, and I can only give it three stars. I mostly use it for Netflix, and it's quite frustrating that I have to sign in almost every time I use it. Maybe once I start using more of the apps, I will be able to rate it higher.", "verified": true, "helpfulness": "0/0", "author": "D. Rich \"Expressing myself - one review at a time\""}, {"rating": 5.0, "review": "Fire stick is the best ever of streaming devices I have had other but you get a lot more for your money and it's well worth it.  I must say it's a device that will be put to use I watch a lot of TV and now I down use red box anymore..........", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Does its job!", "verified": true, "helpfulness": "0/0", "author": "Divas"}, {"rating": 5.0, "review": "Very goood guys awesome", "verified": true, "helpfulness": "0/0", "author": "Noe lopez"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Bilal S."}, {"rating": 5.0, "review": "was not for me  i have  fire tv  but worked great", "verified": true, "helpfulness": "0/0", "author": "manuel yniguez"}, {"rating": 5.0, "review": "Love this Stick! Other family members have the Fire TV so I'm used to using it. This Stick works just as well for standard viewing and I haven't missed the voice controls at all. Can highly recommend!", "verified": true, "helpfulness": "0/0", "author": "MJ Harrison \"MJ Harrison\""}, {"rating": 4.0, "review": "I've had a lot of issues with WiFi cutting out, even though the computer and phone sitting next to it can stream just fine. Otherwise, I love it. No regrets.", "verified": true, "helpfulness": "0/0", "author": "Kelly Grantham"}, {"rating": 3.0, "review": "Haven't really checked it out  a whole lot yet ,  but hooking it up was a piece of cake. And unlike my other electronic entertainment ,  all you do is hit the remote and it connects to the right impute itself", "verified": true, "helpfulness": "0/0", "author": "Ann"}, {"rating": 5.0, "review": "I am a Movie and a history Buff. The movies I can see now for free are awesome!!! Thank You.", "verified": true, "helpfulness": "0/0", "author": "Richard D. Bean"}]