[{"rating": 3.0, "review": "I was really excited about this product, however I am disappointed with the connectivity.  My fire stick takes 5 attempts to connect to the wireless network even through it is next to the hub and the menu states that the network connection is very.  Once it is connected, I ALWAYS get a message saying that the connection is slow.  Then it will work perfectly until the next time that I use the fire TV stick.  I even contacted customer service and the problem still exists.  If this was fixed, it would be a 5 star product.", "verified": true, "helpfulness": "0/0", "author": "L. Herron \"quilt maker\""}, {"rating": 3.0, "review": "its od... my daughther loves it...", "verified": true, "helpfulness": "0/0", "author": "Margie Verdin"}, {"rating": 5.0, "review": "Love it. So easy to use and connects faster than connecting thru my blu-ray or laptop.", "verified": true, "helpfulness": "0/1", "author": "Debbie Purdy"}, {"rating": 5.0, "review": "Great product. Easy to use. I bought a Chromcast and returned it after 2 days. The advantage of Fire Stick  over Chromcast:1- Connects to the WiFi (your router). Chromcast does not. With Chromcastyou need to always send anything you want to watch on the TV from your laptop,phone, tablet etc. and control the videos (pause, stop, change) using these devices.2- Has a remote control. Chromcast does not.3- Has a lot of Apps and games on it.In general I am very happy with this product. I bought a 40 inch normal TV (used but in very good condition) and by adding a 30$ Fire stick to it I have a smart TV. Even better that a smart TV!", "verified": true, "helpfulness": "0/0", "author": "Haleh Ramian"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Restrictions about using this product outside USA are not specified in its presentation. Now I am stuck with a useless device while I am outside. I can not even use my HBO GO account or watch videos on youtube. Really disappointed because this restriction wasn't specified.", "verified": true, "helpfulness": "0/0", "author": "Edgar Garcia"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kim Hockensmith"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Yender"}, {"rating": 3.0, "review": "As I would like to LoVE it the way I love Apple TV, I feel like there are a couple of things I wish it had. It does not work with APPLE devices (AirPlay) unless you download a third party app that you might have to pay for. Sometimes streaming AirPlay  takes a long time to connect and by the time you connect, you're ready for bed. I assume the fire stick works well with Amazon products such as Apple TV with iPhones and iPads .Other than the AirPlay issue, everything works good. I wish they had the HBO now app and more Apps with better easier search functions when you are looking for apps.", "verified": true, "helpfulness": "0/0", "author": "latracy"}, {"rating": 1.0, "review": "very disappointing, I followed all the instructions, my WIFI is o and working fine, batteries in the remote, plugged into my HDTV with the extender cable and into the outlet, double checked everything a million times, but absolutely nothing happened! If there were not so many satisfied customers, I'd say it is a worthless piece of junk. As there is no phone customer support, I immediately returned it, won't even bother trying to replace. That is the problem with amazon and electronics, no phone customer support.", "verified": true, "helpfulness": "0/0", "author": "heidinyc7"}]