[{"rating": 5.0, "review": "Great product!!!!  Love using it for my family's TV watching needs.  Easy set up and easy use.", "verified": false, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Love the stick very impressed", "verified": true, "helpfulness": "0/0", "author": "Jessica Karlowicz"}, {"rating": 2.0, "review": "Probably a great product, but they require a signature to deliver, so you better stay home all day on the day you expect to receive it. B.S.", "verified": true, "helpfulness": "0/0", "author": "G. E. Roquet \"Christ is God\""}, {"rating": 3.0, "review": "the Fire TV stick gets very hot and occasionally it freezes, so I have to unplug it for it cool down....", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "Very pleased, no issues getting to work at hotels.", "verified": true, "helpfulness": "0/0", "author": "dectec"}, {"rating": 5.0, "review": "Who knew! We have apple TV and a Wii so we never thought there was a need for this. Boy were we wrong. This is SO much easier to use and has way more to offer than both of those other gadgets. I would watch movies by using my MacBook and connecting it to the apple tv. Then it would pause or jerk. It was never a nice flow when we watched it via the apple tv. I was forced to have to use a projector and it was quite a set up when it was time to have movie nights.This is so much easier. The remote is easy to use and the quality is fantastic. Rather than use the adapter to power this up, I have a USB charging hub near my TV and the firestick plugs right in there. Our family loves the firestick. The apple tv is now ignored and the Wii just collects dust.For a fraction of the cost of apple TV, this has way more to offer..", "verified": true, "helpfulness": "0/0", "author": "Spoiled Rott'n \"MDO\""}, {"rating": 4.0, "review": "Nice having a remote control. Not the nicest being pushed and shoved towards buying amazon content all the time.", "verified": true, "helpfulness": "0/0", "author": "sayuu89"}, {"rating": 5.0, "review": "Love this! Just like having my kindle on the big screen!", "verified": true, "helpfulness": "0/0", "author": "CK"}, {"rating": 2.0, "review": "Not happy that when i clicked on the description of a movie it automatically purchased it for me.  And there was no way to undo or cancel it.", "verified": true, "helpfulness": "0/1", "author": "Moose"}, {"rating": 5.0, "review": "This is by far the best product for streaming video that I have used.", "verified": true, "helpfulness": "0/0", "author": "Chris Thibaut"}]