[{"rating": 5.0, "review": "Well, here is your answer to having an affordable FireTv. This little device is amazing! The ability to sideload apps is simple and fantastic. With Kodi.tv app installed I am able to stream shows that I downloaded to my PC. Most games are fun and free or low priced. The controller works great to play games and control the UI. Speaking of the UI, it is fast, fluid, and responsive. When you press buttons the menu reacts instantly without any pauses. Netflix and Amazon Prime Videos make it so you can watch just about anything without the need for paid cable TV service. I got mine early for the $20 price tag, and consider that almost stealing this device is so good. I couldn't recommend it more. If you have prime and an HDTV, getting this device is a no-brainer. Very simple to hook up for beginners, and if you like to tinker you can sideload apps to test if they work. This continues to get more apps and improve, which is amazing considering how much it does right out of the box. Amazon has a winner here, and I look forward to seeing how it evolves over time.", "verified": true, "helpfulness": "0/0", "author": "Nickels"}, {"rating": 5.0, "review": "Wanted to see Bosch and it worked perfectly.  Great show.", "verified": true, "helpfulness": "0/0", "author": "Maureen Osolnik"}, {"rating": 5.0, "review": "Simple to setup (took only 5 minutes) easy to connect to my services (Netflix, Music, Amazon Prime) The remote is a little clunky but I won't lower my rating because of it. Will be getting one for another TV.", "verified": true, "helpfulness": "0/0", "author": "JoeW"}, {"rating": 5.0, "review": "Great device!! Incredibly quick and easy to install/activate with a simple, user friendly remote. The Fire stick perfectly compliments the Amazon Prime subscription.", "verified": true, "helpfulness": "1/1", "author": "DebH"}, {"rating": 5.0, "review": "Ordered this as part of a discounted initial release.Setup was simple and straight forward.Phone pairing was easy.Love the snappy response and voice search (on mobile only).The remote works great, but the buttons could have been designed with the play button bigger than the rest.Works great, no complaints.", "verified": true, "helpfulness": "0/0", "author": "Mikehill33"}, {"rating": 5.0, "review": "So far, so awesome. I love that i can now stream my movies on the big screen with the added bonus of Pandora and iHeart radio. It was super easy to set up and my 16 year old daughter did most of it as I am not too techy. It took about 10 minutes (might have taken me 15) and we were watching movies that quick! I love that there is not another \"set top\" type of thingy to clutter up my already cluttered TV stand, although another remote has been added to the coffee table collection. For the price, it's totally worth it. Get one!", "verified": true, "helpfulness": "0/0", "author": "Miss Marlie"}, {"rating": 5.0, "review": "quick delivery met all expectations", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 5.0, "review": "Best Price, Straight to your house", "verified": true, "helpfulness": "0/0", "author": "123 Stores"}, {"rating": 5.0, "review": "Just got my Fire Stick in the mail and i love it!!  Very easy to set up and was watching Netflix and Prime videos within minutes.  This is my first experience with streaming videos and i was worried that it would constantly be \"buffering\" but I didn't have any problems!Definitely recommend", "verified": true, "helpfulness": "0/0", "author": "Amanda W \"AW\""}, {"rating": 4.0, "review": "Love it so far. The remote is simple and easy to navigate. Will be using this mostly for Netflix. I don't think there is a YouTube app, but hopefully that'll change soon. Then it'll be really awesome!", "verified": true, "helpfulness": "0/0", "author": "J. Cain"}]