[{"rating": 3.0, "review": "For example \"Swamp people\" you can see just trailers except season 1.Offer too much but the service is very incomplete.The quality of the image is excelent", "verified": true, "helpfulness": "0/0", "author": "Alvaro M."}, {"rating": 5.0, "review": "This thing is amazing!!! Easy as pie to install and run. I just wish they had one of these back in 1985.  It would have saved a lot of time and frustration. Not to mention beta and VHS tapes.", "verified": true, "helpfulness": "0/0", "author": "Christian C."}, {"rating": 5.0, "review": "The Firestick is just what I needed so I could cancel our cable. There is so much to watch and it is so easy to install and use. Great idea.", "verified": true, "helpfulness": "0/0", "author": "Melody Ann Johnson \"Fibermania\""}, {"rating": 5.0, "review": "We have enjoyed many hours of entertainment thanks to the Firestick!", "verified": true, "helpfulness": "0/0", "author": "The Constantess"}, {"rating": 5.0, "review": "a+", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this thing. I have a smart tv that doesn't work at all/ can't connect to wifi. I bought this when it was first released and can plug it right into the side of my other tvs and it comes right on. Netflix and Amazon Video show up instantly and no problems at all with lags or delays. Excellent for traveling to use in hotel rooms. A great gift for anyone.", "verified": true, "helpfulness": "0/0", "author": "julie marie lohner"}, {"rating": 2.0, "review": "Traded it for a Chromecast.  I had four Chromecasts and my neighbor had three Fire Sticks already.  We traded.  Why?  Both of us felt like when we tried the opposite, competing device, it didn't have the feature set required for us to switch over our entire family.", "verified": true, "helpfulness": "0/0", "author": "Joe D."}, {"rating": 5.0, "review": "Great device. It starts fast and runs fast. The ability to side load apps is the best. It is recommended that you use the wall plug instead of the usb on the TV. That takes a little planning but, that's fine. The remote works well and the phone app adds voice search. This has replaced my Chromecast. Installing Kodi is a plus. I have not tried any games at this point.", "verified": true, "helpfulness": "0/0", "author": "Crebon \"Knowledge seeker\""}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Barbara Holmes"}, {"rating": 5.0, "review": "More than I hoped for!", "verified": true, "helpfulness": "0/0", "author": "mike lyon"}]