[{"rating": 5.0, "review": "If you're an Amazon Prime subscriber this is one of the best bangs for the buck out there.  Mine integrated very nicely with my flatscreen TV to the point where I don't even need the Fire Stick remote.  My TV remote controls all onscreen menus automatically.  It even comes configured to your Amazon Prime account out of the box.  What more can I say.  Buy one and you won't regret it!", "verified": true, "helpfulness": "0/1", "author": "Reza Garrow"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/2", "author": "Kristine A. Stephens \"Kristie1957\""}, {"rating": 4.0, "review": "I truly love it. My grandkids love it too! It was a very wise purchase to make. Also, with the Amazon Fire TV Stick it will give me an opportunity to cut my cable bill down tremendously which means I'll be saving money.", "verified": true, "helpfulness": "0/1", "author": "Rhonda Tourner"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/2", "author": "luis"}, {"rating": 4.0, "review": "Not as powerful as the Fire TV box but still great for a bedroom TV.  For the main TV in the house I would recommend the box however. Some apps are noticeably choppier on the stick than on the box (such as Pluto TV).", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "AWESOME!!!!", "verified": true, "helpfulness": "0/2", "author": "brandon reed"}, {"rating": 4.0, "review": "Okay to be clear, I only said 4 stars because I LOVE my amazon tv! So much, that I wish I had just bought a second one instead of this stick. I was obviously confused about the stick, thinking it would be a great option for bedrooms. However it really is better suited for teenagers or people who would take this travelling.  This doesn't really suit us. But again, I really love amazon TV and this does the trick. Just not my favorite set up.", "verified": true, "helpfulness": "0/1", "author": "roberta"}, {"rating": 4.0, "review": "Very cool device.  Love the access it gives you to a lot of current movies and shows.", "verified": true, "helpfulness": "0/1", "author": "Candace Horan"}, {"rating": 5.0, "review": "Love it, works great. I am probably going to buy some more for the other tvs", "verified": true, "helpfulness": "0/1", "author": "candace hudson"}, {"rating": 5.0, "review": "Love how convenient this is. My kids can play games on it as well which was a pleasant surprise!", "verified": true, "helpfulness": "0/1", "author": "shannell"}]