[{"rating": 5.0, "review": "Have used it for a week seems to be really good. I also have Apple TV and I think the fire TV menu is a little easier to navigate through. All and all I am very pleased with it", "verified": true, "helpfulness": "0/0", "author": "AZTrucker"}, {"rating": 5.0, "review": "best purchase i've made in years.  i inherited my mom's very posh HD Sony flat screen this spring.  finally realized I could watch my movies and programs on 36\" instead of 11\".  two days later, i'm stuck in bed for two weeks -- what a blessing the Fire Stick was.  super easy set up.  highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Saraj H. Cory \"MamaRaji\""}, {"rating": 2.0, "review": "Amazon was promoting Starz, but failed to give notice that you needed to subscribe too Starz on  cable tv. !!", "verified": true, "helpfulness": "0/0", "author": "Paul Helland"}, {"rating": 1.0, "review": "I never knew It did not work outside of USA (Costa Rica). So the two units that I purchase was returned also my prime movie and can't be watch here", "verified": true, "helpfulness": "0/0", "author": "cesar carrero"}, {"rating": 4.0, "review": "Works just like it says....being from the 'over the hill' generation, I'm a bit disappointed in the selection of entertainment available.  I may 'gift' one of our kids or grandkids the 'stick'.  They would get much more use from it.", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "Brought new life to an old LCD TV without smart capabilities. Perfect for guest bedroom without having to spend tons of money. Prime Day special pricing. Unit is fast and responsive. Connected without issues. Plenty of access to different apps for videos.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Quick and easy setup. Great picture quality and tons of apps to pick from.", "verified": true, "helpfulness": "0/0", "author": "Kevin Arp"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my Fire Stick. It's allowed me to down grade my cable package and the pricey monthy bill!", "verified": true, "helpfulness": "0/0", "author": "Nanapjs3"}]