[{"rating": 5.0, "review": "Is easy to connect and works well with Amazon Fire Tablet HD7 -- to show movies.", "verified": true, "helpfulness": "0/0", "author": "Genesisman"}, {"rating": 5.0, "review": "I am satisfied so for with my fire TV stick!", "verified": true, "helpfulness": "0/0", "author": "jesse robinson"}, {"rating": 4.0, "review": "Very easy to set up. Remote can be a little jumpy at times. You have to be very deliberate or it will skip all the way down or up.", "verified": true, "helpfulness": "0/0", "author": "Ginny Daiutolo"}, {"rating": 3.0, "review": "Bought it for my husband as a replacement for cable but it has no hunting shows...he doesn't like it.  Otherwise it does what it says it does...", "verified": true, "helpfulness": "0/0", "author": "Corinne Pelletier"}, {"rating": 4.0, "review": "Had some difficultySetting up i m not techSavy  at all calledAmazon the tech was very helpful and very patient", "verified": true, "helpfulness": "0/0", "author": "Charles Rodriguez"}, {"rating": 5.0, "review": "This is a great product! I love the simple yet functional design of the Fire Stick. It's portability for a business traveler such as myself makes it a great device. Being a Prime Member also is a plus, because I have access to all of the Prime Content. If I could have just one wish for the device, I'd want to be able to run off of USB Power from a USB Equipped Television, like it's competitors can.Bottom line: A Great Device at a Great Value!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome", "verified": false, "helpfulness": "0/1", "author": "Matthew Vogelsong"}, {"rating": 5.0, "review": "Outstanding value and so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Connor Barrett"}, {"rating": 3.0, "review": "ok but still need to sign up and pay", "verified": true, "helpfulness": "0/0", "author": "Shamous"}, {"rating": 1.0, "review": "MY WI-FI WORKS GREAT, MY FIRE STICK WILL NOT HOLD A SINGLE, WORTHLESS??", "verified": true, "helpfulness": "0/2", "author": "GARY O'REILLY"}]