[{"rating": 3.0, "review": "Works great whenever it works. Plex and Netflix app are awesome.I can go days working wonderfully with the device, but some days it just cannot connect.Even though I'm 15 feet away from a 105Mbps down wireless connection I still get network errors. No other WiFi device I have gives me problems but this. I am hoping an update will help resolve the issues I have. Due to the issues I have now, I will not be purchasing another one, even though it works great when it works, I don't like dealing with the problems that occur sometimes.", "verified": true, "helpfulness": "0/1", "author": "Billy P."}, {"rating": 5.0, "review": "Fire TV Stick was easy to install and immediately worked properly. I have no complaints about this product.", "verified": true, "helpfulness": "0/0", "author": "YoSa \"Blurry eyes\""}, {"rating": 5.0, "review": "It's everything I was looking for real simple,easy to set up I love it", "verified": true, "helpfulness": "0/0", "author": "ronald williams"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Imafoneman"}, {"rating": 5.0, "review": "Work wellEasy to use and setup n", "verified": true, "helpfulness": "0/0", "author": "Roland Laman"}, {"rating": 5.0, "review": "This is the second fire stick for my second TV. I love the simplicity of use. Turned my TV into a smart TV in a heartbeat. Would recommend for sure.", "verified": true, "helpfulness": "0/0", "author": "C. Owley"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Like a product that they do not know of a better way to bring out that benefits are only the only for those knock-outs alive in the United States.", "verified": true, "helpfulness": "0/1", "author": "Sebastian"}, {"rating": 5.0, "review": "Very easy to set up and navigate! Excellent product and very happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Janice Bergman"}, {"rating": 5.0, "review": "I love my fire stick", "verified": true, "helpfulness": "0/0", "author": "Lori Johnson"}]