[{"rating": 1.0, "review": "Don't waste your money.  It constantly loses connection, and there is zero help or support.", "verified": true, "helpfulness": "0/1", "author": "Candice Conway \"Dessertcrazy\""}, {"rating": 4.0, "review": "I don't always get the best video quality while streaming from the Fire Stick but it does what it's supposed to do which is stream Netflix, Amazon Instant Video, etc., and and I can't complain about that.", "verified": true, "helpfulness": "0/1", "author": "Bearkat07"}, {"rating": 5.0, "review": "The only thing that I don't like is that every time I turn it on I have to unplug it from the outlet first to let the internet reconnect.  I don't know why it does it but it does.Other than that, I LOVE my fire stick!  It is perfect for Netflix and Prime Instant video!", "verified": true, "helpfulness": "0/1", "author": "Holly Johnson"}, {"rating": 4.0, "review": "The Stick performs well, including using Netflix and Prime content.  Basically I am quite satisfied with it.  Cons:  It doesn't seem to add new playlists after I've added them to my Kindle, although I used the sync function; I have to add them separately.  Also, display mirroring seldom works the first time--I have to re-boot the Kindle to get it working.  Apparently this is the accepted fix, per the Help Desk.  (It's not clear if this is a Stick problem or a Kindle problem.)So, while there are a few issues, I'm glad I got it and use it often.  I'm looking forward to the day that CBS All Access adds the Fire Stick to their supported devices", "verified": true, "helpfulness": "0/1", "author": "Chris Woods"}, {"rating": 5.0, "review": "Everything I need or want to watch is in one place.  YEAH!!!!!!!!", "verified": true, "helpfulness": "0/1", "author": "Donna Folino"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "John R DiPaulo"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Scott Ellis"}, {"rating": 5.0, "review": "This is almost as great as sliced bread.  Easy to use and very hand for the whole household!", "verified": true, "helpfulness": "0/1", "author": "Skygod811"}, {"rating": 5.0, "review": "Amazon keeps making great products", "verified": true, "helpfulness": "0/1", "author": "Brian"}, {"rating": 4.0, "review": "Works well but was a bit tricky to set up. I had to repeat the process several times until it finally found my network. I like it for watching Prime and Netflix. Great for such a small device.", "verified": true, "helpfulness": "0/1", "author": "D. Edger"}]