[{"rating": 5.0, "review": "The Fire Stick was so easy to install, we did not have any problems.  Our home theater and tv are a few years old, with the fire stick we can listen to Pandora through the better speakers.  Also Netflix movies sound really good and played smoothly.I'm looking forward to trying more.", "verified": true, "helpfulness": "0/0", "author": "C. Lingo"}, {"rating": 3.0, "review": "As a prime member, I picked one of these up for the $19 initial offer.  At that price, I might edge this up to 4 stars, but at it's current price I don't feel like it's a good buy.  I also have a pair of Rokus (original and Roku 3) for comparison.First of all, I was severely disappointed with the network connectivity.  Granted, I understand it's tough to squeeze a good antenna in such a small form factor, but I wasn't able to even make it through the initial setup in the room I was intending on using it.  The Roku I had been using there had no problems.  So I ended up keeping the Roku in that room and using the Fire Stick in the basement.  Even there, which puts it only about 20 feet from the access point (and it's a good quality access point), it still occasionally drops the connection.The bigger deal breaker for me though is the interface, which has a number of problems.  Navigation through the menus isn't very intuitive.  It's also not very clear what is the currently selected thing on the screen.  I pretty much exclusively use it for Netflix and Prime Video.  Netflix works fine (their interface is standard).  I find Prime Video incredibly disorganized and confusing by comparison.  In particular, let's look at how Dr Who is organized.  In Netflix, all the episodes are in sequence.  It makes it very easy to simply watch from one end to the other.  In Prime, it seems they're arranged by the DVD they were released on.  This means that the \"specials\" which fell between seasons, are not part of the normal viewing order.  This can lead to a lot of confusion when you start watching the next episode, and start wondering what the heck is going on, because you ended up skipping several important episodes without realizing it.I'm also very disappointed with the way Prime Video keeps trying to pry more money out of me.  That show you've been binge watching?  Oh, you caught up to the last season and want to keep watching?  Ok, that'll be $3 per episode now.  It would be one thing if they were just charging for the stuff that was current season (new enough it isn't elsewhere), but they also seem to charge for older stuff.  Stuff that I can just switch over to Netflix and watch.On the positive side, the Fire Stick is nice and portable.  (Of course it just sits plugged into my tv, so that's not really a big deal for me).  I also really like the remote.  It's small, has good range, and is easy to use.  I've also never had any problems with video quality.In the end, for the price it's listed at currently ($39), you'd be better off spending an extra $10 and getting a Roku 1.  Between the better antenna and better interface, it's worth it.", "verified": false, "helpfulness": "0/0", "author": "Robert Wiskow"}, {"rating": 5.0, "review": "we love it", "verified": true, "helpfulness": "0/0", "author": "SANANTONIOBLUESMAN"}, {"rating": 5.0, "review": "I love the remote and tons of options to choose from.", "verified": true, "helpfulness": "0/0", "author": "SheShe"}, {"rating": 5.0, "review": "Best thing out beats cable", "verified": true, "helpfulness": "0/0", "author": "Garrett"}, {"rating": 4.0, "review": "Great product I'm amazed at how much content you can actually stream I even found some old classics...", "verified": true, "helpfulness": "0/0", "author": "Michael Baskerville"}, {"rating": 5.0, "review": "It is everything I thought it would be", "verified": true, "helpfulness": "0/0", "author": "The Don \"The Don\""}, {"rating": 5.0, "review": "The stick was easy to setup.  Enjoying the new access to movies.", "verified": true, "helpfulness": "0/0", "author": "Joyce Jeter"}, {"rating": 5.0, "review": "Expands the capability of my crappy barracks TV.", "verified": true, "helpfulness": "0/0", "author": "klrman"}, {"rating": 5.0, "review": "Works really good once you figure it out. Lots of features . Well worth the money. Best streaming device I own.", "verified": true, "helpfulness": "0/0", "author": "Russell Conner"}]