[{"rating": 5.0, "review": "Very easy to set up and operate", "verified": true, "helpfulness": "0/0", "author": "SUSAN EMERINE"}, {"rating": 4.0, "review": "I am the last of my friends to get a gadget allowing me to watch Netflix on something other than my laptop. I bought the Fire TV Stick on Amazon's big anniversary sale day mostly for this purpose. I then proceeded to binge watch everything I could think of for two weeks before my grad classes began again. I have to say that while the TV stick might not be as well designed as the Roku (it takes multiple clicks to get to the screen of most apps), it is easy to use and a good deal. I also like that while apps like Netflix, Hulu, and youtube are all available, you can also navigate the Amazon Prime selection or buy Amazon movies and TV series (I guess you can do that on other interfaces as well).Honestly, I'm not sure what the best streaming stick is, but I will say that this one was inexpensive and works well for what I need. I definitely recommend it.", "verified": true, "helpfulness": "1/1", "author": "K. Marie Frances"}, {"rating": 5.0, "review": "Great option for our guest bedroom.  Our quests can access their Netflix and our Amazon Prime videos.", "verified": true, "helpfulness": "0/0", "author": "Pat McDonald"}, {"rating": 5.0, "review": "Amazing piece of gadgetry. Simple and easy to use. Simple and easy to install. Wonderful and complex in number of uses and applications.", "verified": true, "helpfulness": "0/0", "author": "N. Y. Richardson"}, {"rating": 5.0, "review": "As a Linux and Android power user, I absolutely adore this streaming media device. It does everything a Roku can do, and more. You have not lived until you have sideloaded Alphabear and used the Mouse Android App to play Alphabear on the big screen!Also, there is a side-loadable YouMap app that allows the Fire Stick to work as a ChromeCast, too!", "verified": true, "helpfulness": "0/0", "author": "theinfamousj \"theinfamousj\""}, {"rating": 4.0, "review": "Great for me because all my TV's are \"non-smart\", but I do have NETFLIX already. A simple and inexpensive way to expand your viewing choices.The little remote is very convenient and easy to use, especially for us senior citizens who may not so \"tech savvy\".", "verified": true, "helpfulness": "0/0", "author": "1-Jazzman \"Hank\""}, {"rating": 5.0, "review": "Great product very happy!", "verified": true, "helpfulness": "0/0", "author": "Mark S. Hurst"}, {"rating": 5.0, "review": "this is great , very easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "Love it!  Easy to use and lots of great options.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Guarnieri"}, {"rating": 4.0, "review": "I like it so far I think this is going to take over my cable TV", "verified": true, "helpfulness": "0/0", "author": "julian ramos"}]