[{"rating": 1.0, "review": "Just got mine today.  I cannot open the back of the remote to install the batteries!  I've been trying for the last 15 minutes.  Poor product design here.  I'll update after I get the batteries in (if ever).Update:  20 minutes later, with the gentle use of a letter opener, I was able to open and install the batteries.  Now the remote won't allow me to select my network--it's stuck at the first one.  The chat rep says I need to get a new remote.  Oh joy!  I waited two months for this stupid thing.  This totally sucks!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Perfect gift for my son in college.  He can move the stick from his TV to his friends room to the common room and enjoy whatever he wants to watch on Prime - love it.", "verified": true, "helpfulness": "0/0", "author": "K. Morrissey"}, {"rating": 3.0, "review": "After months of waiting for this we finally received it in the mail. We were instantly hooked. We have been using it for about a month now and we have to keep unplugging it and plugging it back it to get it to pick up the wifi in the house. It's becoming a nuisance having to get up and reset the fire stick everytime we want to watch Netflix. If it would hold the connection I would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Ali"}, {"rating": 5.0, "review": "This is a must have with a three year old in the house.  She can watch her favorites over and over again.It is easy to set-up, and use.  I am very pleased that we purchased this, and use it every day.", "verified": true, "helpfulness": "0/0", "author": "Kristy Sand"}, {"rating": 5.0, "review": "Excellent item.  Love using it.", "verified": true, "helpfulness": "0/0", "author": "Shari L. Hamilton"}, {"rating": 5.0, "review": "*update-03.08.2015*  So ive started using this alot more often. I really love this. Super easy to \"plug and go\". Even changing wifi routers is super fast and easy. I love how i can order something (video, music, shows) and it is instantly available.  My son has a new favorite show that I am happy he is watching. \"Creative Galaxy\". Full of arts and crafts as well as growing his creativity/imagination without me having to worry.I haven't used this too much, more just played around with it here and there. Really easy to plug in and set up! Super easy to connect to my WIFI (Would say easier than DirecTV). As soon as you turn it on it walks you right thru everything you need to do/know. I pre-ordered and wasn't expecting to get it as soon as I did until I got the \"Great news\" email. I cannot compare it to Amazon Fire Box because I never owned it. Remote is basic and small which is a good thing to me and doesnt have too many or useless buttons. It seems to have the same feel as a blu-ray player thats connected to the internet or Netflix/Hulu app from my Xbox.", "verified": true, "helpfulness": "0/0", "author": "samantha"}, {"rating": 2.0, "review": "These are SO SO... I bought two when they were at 19.99 each... for that price they are acceptable... not a dollar more!I use PLEX a LOT and this actually seemed like a deal because it was cheaper than chromecast when it launced and being able to watch plex was a big plus for me.Nowhere does it say that you have to purchase the PLEX APP in order for it to work which was a let down for me.Also, nowhere is mentioned that you need to plug this thing into an ac outlet, YOU CANT USE YOUR TVs USB port, like you can in chromecast.this is a drawback for some, when your tv is mounted into the wall and you need to have that extra AC outlet.I dont know about other people, but for me, I would not change it for chromecast... it is WAY better for my specific needsBest regards", "verified": true, "helpfulness": "0/0", "author": "Jorge Alberto Reza"}, {"rating": 3.0, "review": "Sometimes the video would stutter  with services like NetFlix or Hulu. On the same network, Google Chromecast works better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Margie baird"}, {"rating": 3.0, "review": "Requires much more bandwidth than its counterparts as the picture quality is better", "verified": true, "helpfulness": "1/1", "author": "elweaselgrande"}]