[{"rating": 4.0, "review": "Worked out fine  It was as advertised", "verified": true, "helpfulness": "0/0", "author": "Cathy Coleman"}, {"rating": 5.0, "review": "Great device to compete with the Chromecast but has a much better UI for regular users.", "verified": true, "helpfulness": "0/0", "author": "Kristopher T. Patke"}, {"rating": 4.0, "review": "It is a great addition when you don't have a smart TV and don't want to pay big money to a cable company", "verified": true, "helpfulness": "0/0", "author": "Lori Newman"}, {"rating": 3.0, "review": "The Stick met my expectations, however the content or options were not plentiful.  I understand that the content will slowly grow so I can be patient.  Diffidently if you are a Prime Member you have many more viewing options but still not plentiful.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Simple and reliable.", "verified": true, "helpfulness": "0/0", "author": "Oscar Ballen"}, {"rating": 4.0, "review": "I really like the firestick. I wasn't able to use Amazon prime video with Linux os so this helped me get the most from my prime membership.", "verified": true, "helpfulness": "0/0", "author": "Rhonda K. Gruber"}, {"rating": 5.0, "review": "I really am more than satisfied with this product, its kind of amazing what all it can do being such a small device. The setup was beyond simple, it came already set to my Prime account so I just plugged it into the TV and was set to go. I currently have rather slow internet service (15mbs) but even with that the operation is snappy and smooth through the screens and with the smart pre-buffering it runs Prime video and Netflix in HD. I am sure it would be an even better experience with a faster connection. The included controller is not voice operated as with the larger Fire TV decive, but that has not been an issue for me at all, and if you want voice operation you can download a free  Fire app for your phone that does the same thing. Overall, very pleased. This has made watching videos and TV series much easier and fun; there are many available apps and options that I have yet to explore as well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just starting using it this weekend but easy to use and works great.", "verified": true, "helpfulness": "0/0", "author": "Daniel W."}, {"rating": 3.0, "review": "Not really happy with this item.  Slow at times, gets very hot, losses pass words all the time.", "verified": true, "helpfulness": "0/0", "author": "michael newberry"}, {"rating": 5.0, "review": "Love it! Ray to setup and fast response. Exceeded expectations.", "verified": true, "helpfulness": "0/0", "author": "Cathy M Naabe"}]