[{"rating": 5.0, "review": "thanks", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love It!  Works well and i love that it's small and doesn't take up any space.  We use it for Amazon Prime and netfix.", "verified": true, "helpfulness": "0/0", "author": "Linda O'Grady"}, {"rating": 3.0, "review": "I liked cutting the cord from Cable TV, but I'm disappointed that the Fire Stick is so hard to Browse the internet with. In fact I've yet to figure out how. Maybe that neat 3rd party book \"How to get the Most from your Fire TV Stick\" could help.  I just think it's crummy Amazon doesn't care beyond the sale to help make it easier to navigate this thing. Speaking of navigating, have you ever noticed how lame and patched-up the Amazon webpage is, all kinds of hidden hyper-texts for the services and groups you really want to go. Some might get a charge out of digging through the thing like a hacker, I don't, the simplier the better.", "verified": true, "helpfulness": "0/0", "author": "Tom McSpadden"}, {"rating": 4.0, "review": "Works great on a non-smart tv. I already am a prime member and this just makes it that much better.", "verified": true, "helpfulness": "0/0", "author": "Chris G"}, {"rating": 1.0, "review": "It doesn't work correctly. It keeps saying there is no internet connection and when I check settins my signal is strong. Constantly rebuffering", "verified": true, "helpfulness": "0/0", "author": "Jeanette A. Turnbeaugh \"jeannet\""}, {"rating": 5.0, "review": "Love this thing!Plays all the things I want to with Netflix, Hulu Plus, and Amazon Prime Video!And with the support of Plex natively what more can I ask for!No lags, no issues, no thing.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "I've had this for a couple of days now. Easy set up and sync with the wireless.  So far so good", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 4.0, "review": "My first product of this type, Works well for me. Takes some practice using buttons. Get Prime if you plan to use it for movies. I wish it had access to TED content.", "verified": true, "helpfulness": "0/0", "author": "john97202"}, {"rating": 5.0, "review": "I was watching shows within ten minutes of opening the box. It works as advertised and is very easy to navigate through the menus. My only negative is that the app store isnt really what I took it to mean. Overall it's well worth the $40.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "sound is not up to snuff I was impressed with the simple easy installation.ilike the watch list feature.", "verified": true, "helpfulness": "0/0", "author": "James Trier"}]