[{"rating": 5.0, "review": "So versatile and easy to move around hoping someday for a wireless version.", "verified": true, "helpfulness": "0/0", "author": "Tina Wyatt"}, {"rating": 5.0, "review": "Simple to use, and worth the money to have Amazon on my TV as well as all the other programs I like to watch.", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 3.0, "review": "We can't get this to work. It would be nice if you had a number for tech support.", "verified": true, "helpfulness": "1/2", "author": "Malea C."}, {"rating": 5.0, "review": "This little device is a piece of genius. Love it: its great!", "verified": true, "helpfulness": "0/0", "author": "Ima"}, {"rating": 5.0, "review": "Rich content with great 1080p quality. Relatively faster response than my roku2. A great way to get any monitor with hdmi into a smart media device. I only wish amazon can have more content on prime vs paid videos", "verified": false, "helpfulness": "0/0", "author": "Brandy Phillips"}, {"rating": 5.0, "review": "so much fun! watching more movies, and series that we couldn't get on cable.very easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Becky Bates"}, {"rating": 3.0, "review": "Not what exspected", "verified": true, "helpfulness": "0/0", "author": "Tonya Purifoy"}, {"rating": 5.0, "review": "Amazon has done it again. They have giving me a choice over other brands for a good product at competitive price. It was easy to set up and is great to use. For the price their is not a better product on the market and I have own different brands over the years.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 5.0, "review": "I love this product !!  I don't know why I didn't get this sooner !!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For as long as I had to wait to get this item, it sure has been worth it so far. Way better than the Chromecast that I chucked out the back door after a month. Setup was a snap, took maybe 5 mins. I hardly ever have issues with the need to buffer videos or movies and the HD quality is MIGHTY IMPRESSIVE!! The remote is small and easily fits in my hand; buttons are intuitive and easy to remember. THE ONLY thing that I would change is the search functionality. When searching for movies and such, if you click on a found title, then go back to search, I'd like for it to remember what I had typed in their previously so I don't have to retype everything again.", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}]