[{"rating": 5.0, "review": "It’s insane how much this thing holds. And I Love the user interface.", "verified": false, "helpfulness": "0/0", "author": "Brian Uzzo"}, {"rating": 5.0, "review": "Hubby loves it!  Better than chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Lonnie Betts"}, {"rating": 2.0, "review": "Not the best product. I had my router right next to the TV and it still would not connect. The Fire TV said the wifi connection was very strong, but it would still not play any movies, ever. I would suggest spending extra money in buying a better product or make sure you have a perfect internet connection.", "verified": true, "helpfulness": "0/0", "author": "Sofia"}, {"rating": 1.0, "review": "Amazon Prime is the worst. It is always buffering it loses connection in the middle of the movies and I have High speed internet. I have tried them all and NEVER have had a problem with (NETFLIX)!!!!! Plus all the good movies and TV shows you have to rent. I would not recommend Prime or Fire Stick.DCTECMO.", "verified": false, "helpfulness": "0/0", "author": "DCTECMO"}, {"rating": 2.0, "review": "its not what I expected for it to be. If you do not have prime don't even bother and the mirroring was horrible", "verified": true, "helpfulness": "0/1", "author": "Luetisher Johnson"}, {"rating": 2.0, "review": "It has frequent (almost every time I use it) problems with streaming video, with video playback often pausing while the audio continues. This is on a fast  (30mb download) connection, only ten feet away from the router (both 5ghz and 2.4ghz, clean channels, free from interference). I don't have this problem with any other PC, laptop, or tablet streaming video in my home. Honestly it doesn't feel ready for prime time.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Williams"}, {"rating": 5.0, "review": "LOVE LOVE LOVEGreat product, easy to use!! Will be buying more soon", "verified": true, "helpfulness": "1/1", "author": "C.S."}, {"rating": 5.0, "review": "So far we have been very pleased.", "verified": true, "helpfulness": "0/0", "author": "Dolores Sullivan"}, {"rating": 3.0, "review": "It is reasonably well designed, the menus work, but this unit is all about selling you content. It has a clunky interface for searching. The phone app that is supposed to go with it to make searching easier, is painfully slow (on my galaxy s4).  I did enjoy watching youtube videos with it (the only thing that was free). I just wasn't expeciting every item that I drilled down on to ask for money.  But hey, I guess we're all in business to make money.", "verified": true, "helpfulness": "0/0", "author": "Chris Wolf"}, {"rating": 5.0, "review": "Love it!!  Just wish they made the PRIME videos/ shows more visable.  There are way to many shows that cost too much money.  Too much to even rent.  I can go to rent them for a dollar.  But the ones i get for free are great, and i have sacrificed and bought a few seasons of certain shows.", "verified": true, "helpfulness": "1/2", "author": "RC Petty"}]