[{"rating": 4.0, "review": "Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Hogan"}, {"rating": 5.0, "review": "A winner, easy to setup, easy to use, great picture, best of all no buffering.  I have two brand \"R\" boxes, this works much better.", "verified": true, "helpfulness": "0/0", "author": "loustrau"}, {"rating": 1.0, "review": "Unpacked and set up the Fire TV stick fairly easily.  Watched some tv shows and it paused to load more than 4 times per episode. Twice it was so bad the streaming stopped and I had to press play again. It is less than 10 feet from the Wi-Fi access and other devices are working fine. I've used a Chromecast as well but it didn't have nearly the same problems.", "verified": true, "helpfulness": "1/2", "author": "Amanda"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Philip W. Gorrell"}, {"rating": 5.0, "review": "Five Star Device if:1. You subscribe to Amazon Prime.  The Amazon Fire Stick without Prime is like taking your dog for a walk in an area with no hydrants.2.  You were able to take advantage of the $19 offer for the Fire Stick.  $19!!!!Without the two above I believe the Roku Steaming stick's vastly superior content makes it a wiser choice.  In my case, the Time Warner Cable channel on the Roku units (and NOT available on the Fire Stick or Fire TV) is the deal breaker.  I have two TV's with Roku units and no cable boxes.  The money I've saved by not having to pay renting the cable boxes has already paid for the Roku's.I have the Fire Stick installed on a seldom used TV in a guest bedroom.  Because I paid $19 for the Fire Stick, and I am a Prime subscriber, I am more than happy with its performance in this environment.If Amazon ever adds a TWC app to the Fire Stick it would become a Five Star device on TV's I use daily.", "verified": true, "helpfulness": "0/0", "author": "Mr. Luigi"}, {"rating": 1.0, "review": "Ordered 2, both do not work.  The first one briefly shows colored vertical lines on the screen then the screen goes blank.  The other one has video, shows it is connected to my wifi, but it never lets me log in to my Amazon account.  I have a regular FireTv box that works fine, and I also have several Chromecasts, Roku boxes, android tv boxes, and an Apple TV box.  No problems from any of my other devices, but these Firetv sticks suck, won't be recommending them to anyone.  Can't get Amazon to send me 2 new ones to replace the bad ones so I'm just going to return them and get my money back.", "verified": true, "helpfulness": "0/1", "author": "Joseph Waitman"}, {"rating": 4.0, "review": "Just got it after a long wait! I love my Google TV Logitech and I love keyboards. In that respect I feel handicapped. I wish Amazon makes a slim dedicated keyboard.Pros:Very easy to navigate and find Amazon Prime videos.Simple remoteFast responseConsUSB cable length should be longer, barely fit even with extension cableGames are not intuitive and did not repondHad difficult time finding youtube .. Let us admit, youtube has largest repository of videosMany apps just hang (newscast for example) on Samsung TV", "verified": true, "helpfulness": "0/0", "author": "rpv"}, {"rating": 4.0, "review": "So far so good. Able to put XBMC on it with a little effort. Got it on sale as a Prime member, and am very pleased with how quick it is compared to my old set top box. Only wish the menu weren't so cluttery and chaotic. But that may change someday w/ firmware update.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Got my fire stick earlier than expected which is always a great thing. So far no complaints! I was using my Wii to stream so now that I have this I'm super excited to have all these already loaded on instead of me downloading. I think it's a great investment and I'm both happy with it!", "verified": true, "helpfulness": "0/0", "author": "AKANYC \"#1AKANYC\""}, {"rating": 3.0, "review": "I purchased this for $20 for their prime sale.  If you asked me, it should be worth half that.  My only desire/advantage for devices like this, is getting content up on a big screen TV.  For that alone, this is a three star and a half experience.For portability, it's not bad, all streaming sticks unfortunately have to be connected to some external power source, which is clunky in itself.  Browsing through this on a remote control alone is a clunky experience compared with using your cellphone.  Searching things by inputting letter by letter is a pain.  In this day and age, a more touchpad/touchscreen based remote with voice search would take the sting out.  I'm not a direct subscriber to Amazon Prime, so much of that content isn't free.  My primary uses for this probably will come from watching youtube,  using plex, and using miracast.If your cellphone/tablet is miracast capable, that's probably the easiest interface.  It's kind of tucked away under the system setting for some reason.  If you play game apps on your phone, however, there is some lag and it is enough to make them unplayable, in my viewpoint.  For youtube, you have to download an app from fire stick.  For the best browsing experience, it's good to use another cellphone/tablet with the youtube android app.  The youtube android app can then cast connect to the stick.  Sometimes it doesn't connect or takes over ten seconds to make the initial connection though.The plex app, which was free when I downloaded it, allows media streaming from remote Internet connected devices.  I use it to stream things from my computer.I wish there was a power/sleep button on it so I can save energy, but if you want it to sleep, you'll have to select that in the settings every time you want it to.Again, by itself, searching on the Fire Stick OS with the included remote is a pain, to input letter by letter.  The remote control doesn't even have a search button.  The native browsing process is rather tedious in terms of discovering good recommendations.  Overall, I'd give it a three star experience.", "verified": true, "helpfulness": "0/0", "author": "m"}]