[{"rating": 5.0, "review": "Great product that works flawlessly. If you have a USB port in your TV you can attach the usb power cable to it, thereby avoiding the need for a power outlet. Especially usefull if your TV is on the wall and you don't want cables hanging. Wasn't able to start it through my Denon amplifier. Seem to only work directly from TV. But I used optical out audio of my tv to attach it to my receiver/amp and got the sound to my speakers that way.", "verified": true, "helpfulness": "0/0", "author": "A mum"}, {"rating": 5.0, "review": "No lag, no buffering, works great!", "verified": true, "helpfulness": "0/0", "author": "Guy R. Cook \"If it isn't tested, it doesn't work.\""}, {"rating": 3.0, "review": "For $20 it was worth it. Purchased it mainly for the reason that it was advertise that it could be used in hotels and their wifi. Have yet to test it though. Waiting for the HBO GO app and iOS app. The Netflix app is buggy. It freezes up constantly while watching movies. I can watch on my tablet without the hiccups. The Amazon demand works without the hiccups.", "verified": true, "helpfulness": "0/0", "author": "J. Davila"}, {"rating": 1.0, "review": "I really wanted to give this product a good review.  Unfortunately, it doesn't work.  It will not stay connected to my wireless even though several other devices, including apple tv in the same location experiences no loss of signal.  My wireless signal strength shows excellent.  Fire TV stick connects, then drops the signal after only a few seconds.  I had to reboot the device by pressing play + select because it was stuck on a screen & wouldn't respond.  Sadly my experience with Fire TV is a complete failure.It took several attempts, with several people to open the battery compartment. I almost gave up & returned it for this issue alone.After I got the battery in, setup was quick & easy (less than 10 minutes).  I bought this product to replace my apple tv for streaming on Netflix & my prime videos.", "verified": true, "helpfulness": "1/2", "author": "D. bordelon \"DeeKajun\""}, {"rating": 4.0, "review": "I haven't used it all that much but it seems a little faster than my Rokus.", "verified": true, "helpfulness": "0/0", "author": "Don Weiser \"dweiser\""}, {"rating": 4.0, "review": "This is a great little device.  I was especially impressed that mine was 100% trouble-free.  I'd also add that the excellent wireless remote uses RADIO, not infrared, meaning it does not have to be pointed in the right direction and will operate through wooden cabinets, glass, or pants pockets (prank your friends),  I disobeyed Amazon's recommendations and powered mine from my TV's USB port, and there's been no problem at all so far.  The only thing I didn't like is that the \"free\" (with Amazon Prime) streaming video seemed to be lower in quality than what I can get using Netflix in HD, which I also have.", "verified": true, "helpfulness": "0/0", "author": "vacuumtubejazzpro \"rich\""}, {"rating": 5.0, "review": "Though I have a bluray player with apps and a WD Live Plus with multi-terabyte drive and wireless keyboard,  I did not have anyway to play Prime content on my tv and entertainment center.  the Fire TV stick does the job very well.  it is smooth and fast with no buffering. I have it plugged into my Pioneer media receiver instead of my tv.  I am happy that the stick does not use an IR type remote. when the Pioneer is off so too is the stick but it does not forget what I watched.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"budweiser4\""}, {"rating": 4.0, "review": "The product is quite good. Load times are quick and the UI works well enough. The remote works quite well and I like the design.The video quality is surprisingly good. No problem streaming in HD.The selection of apps is substantial, but many free apps are low quality. Apps like Netflix and youtube work very well, but be wary of some of the other apps. Any other decent app seems to require a purchase.Surprisingly what I really liked is the music streaming via my prime membership. I've been meaning to check out a lot of music, primarily classical, and Amazon's assortment of overly large classical albums is a godsend. I don't quite why I far prefer steaming the music on the TV stick than on my computer, but I figure it has to do with the remote.I can't find a way to change the volumeMy rating would have been five stars if it was not for the various issues I had with it the first day. It would not connect to my wifi for quite some time, and when it did, it would not download the update. Eventually I got it to download the update, and then kept losing connection. Anyway, it eventually it sorted itself out and works without issue.", "verified": true, "helpfulness": "0/0", "author": "Nathan Pepin"}, {"rating": 3.0, "review": "things i like.when watching TV seasons it will automatically play the next episode.flappy birds.the remote is quite nice... better than my roku remote.pressing and holding next will smoothly flip through tv and movie listings (my roku will not do that)the netflix app on the fire tv stick is easier to navigate for me.things i dont likenetwork frequently drops off and either rebuffers or displays a black screen that says my network disconnected... i can say with a great amount of certainty that it is the fire tv stick's issue and not my network because my chromecast and roku has never done this. and my download speeds average 50Mbps. this issue also occured while watching netflix youtube and amazon videos.the fire tv stick needs a power source which is delivered via a microusb port and comes with a little usb brick to plug into the wall. i first plugged the usb cable into the television (which works for the chromecast). the fire tv stick did turn on but displayed a message saying that the power source is not recognized and that the network connection may suffer because of this. so i used the brick and it displayed the same message... weird.the youtube app bugs out when you press and hold the left or right button to scroll through videos. it will pause and then skip 5 or 6 videos and then lagg and catch up. i found myself having to be very careful to not click left or right too quickly as well because this will cause the same issue.the nice thing about the netflix app is then when you browse titles it will show a large picture on top with a description. the thing i dont like is if you click left or right to browse quickly the large display on top lags terribly and takes a while to catch up.my fire tv stick experience was extremely buggy. it was fun for about 45 minutes because it was new and interesting but that novelty has worn off and i am back to using my roku.", "verified": true, "helpfulness": "0/0", "author": "20mmf17"}, {"rating": 5.0, "review": "So far so good. Makes searching very easy.", "verified": true, "helpfulness": "0/0", "author": "Brook \"Brook RNC-OB\""}]