[{"rating": 4.0, "review": "Good product especially if you got in on the amazon Prime deal. Took a while to arrive but setup a breeze. Yes, screens are skewed towards amazon offerings but it is the AMAZON Fire TV Stick so what do you expect. Still manage to get Netflix easily and awesome for hotels with free wifi when I gotta have my own in-bed movie/TV faves. Other issue is that depending on the TV, screen may not \"fit\" so you may have to adjust screen size repeatedly- means you gotta have the original remote for your tv handy. Also, now that DISH provides free Netflix app for, may not be as handy since I tend to watch more Netflix than Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Ip Lady"}, {"rating": 5.0, "review": "Great item.  Only wish I could plug in headphones like with Roku3.", "verified": true, "helpfulness": "0/0", "author": "Darlene Hall"}, {"rating": 5.0, "review": "I love my Fire TV stick!  It has made my life so much easier.  Why did I wait so long?", "verified": true, "helpfulness": "0/0", "author": "abluesfan"}, {"rating": 4.0, "review": "I have an apple tv as well. The fire stick definitely runs slower than the Apple TV, but well worth the sacrifice to have a whole host of additional apps. Not to mention, the price was fantastic.", "verified": true, "helpfulness": "0/0", "author": "Brent Dibble"}, {"rating": 5.0, "review": "this product is great. and works just as great. thank you amazon", "verified": true, "helpfulness": "0/0", "author": "duke nj"}, {"rating": 5.0, "review": "Cool technology", "verified": true, "helpfulness": "0/0", "author": "Joe Paulsen"}, {"rating": 2.0, "review": "Not really a fan, I've had the Fire stick for a month.  It's so geared towards Amazon that it's hard to find the APP's you want. Most APP's that are on the Roku and not on the Fire. The phone remote voice APP doesn't work.  I have messed with that for hours.The Fire home page never changes.  It's that same old stuff on the HP.  It needs more selection.  It's as if Amazon's trying to push their shows and products. It really needs some variety.***I do have something nice to say about the Fire.  I love how it links to my music prime.  I can play it from my TV while doing dishes or cleaning.  It's not like the Roku which is limited with it come to play AP music.I still prefer the Roku.", "verified": true, "helpfulness": "0/0", "author": "Shar"}, {"rating": 5.0, "review": "great product! easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is actually exactly just as it is advertised ! Wa are elderly & our days of being tech savy are over I was sure I'd have to call a grand kid enstall it. Joy of joy I was able to do the install it myselfAs far as to how it works: it is as easy as installing it was. We love to watch movies, and fire stick allows us to do just that any time we want to", "verified": true, "helpfulness": "0/0", "author": "Pat Gilland"}, {"rating": 4.0, "review": "Works great and easy to setup,great value", "verified": true, "helpfulness": "0/0", "author": "David Gallegos"}]