[{"rating": 2.0, "review": "The Fire TV Stick does not have a lot of memory and freezes up on me quite often and asks me to delete apps in the middle of using a program. I was impressed by the games but I am not as satisfied with this product as I am with my Apple TV. I will stick to my always reliable Apple products from now on. Sorry, but I would not purchase this product again.", "verified": true, "helpfulness": "0/0", "author": "brittany wegenast"}, {"rating": 3.0, "review": "I like it, but it freezes a lot", "verified": true, "helpfulness": "0/0", "author": "Linda Mims"}, {"rating": 5.0, "review": "Like being able to watch old TV and new movies.  Wish there was a larger selection of old movies for Prime.  I paired it with Netflix and that made all the difference.  It was easy to set up, but hard to get the password typed in.  Well, not hard, but time consuming.  Other than that it is great!", "verified": true, "helpfulness": "0/1", "author": "Patricia Little"}, {"rating": 4.0, "review": "The Amazon Fire TV stick works great!", "verified": true, "helpfulness": "0/0", "author": "Brian W Ferrin"}, {"rating": 5.0, "review": "I love it..", "verified": true, "helpfulness": "0/0", "author": "Toni Clark"}, {"rating": 5.0, "review": "Really enjoy being able to watch more movies and tv shows that I missed.", "verified": true, "helpfulness": "0/0", "author": "Betsy Stine"}, {"rating": 5.0, "review": "FANTASTIC...", "verified": true, "helpfulness": "0/0", "author": "RODERICK A. OATES"}, {"rating": 5.0, "review": "So easy to start up and navigate.  Having all of our viewing options in one place is great.  Would definitely recommend.  You do need to make sure that you have an outlet available for it.", "verified": true, "helpfulness": "0/0", "author": "D. Dawley"}, {"rating": 1.0, "review": "Hopefully software updates will make it better with time. Interface clunky, often have to restart it to watch Netflix. Loses connection to wifi often. Power cable requirement less then ideal, better if you could just use TV's USB ports for power.", "verified": true, "helpfulness": "1/2", "author": "Eastcoast Joe"}, {"rating": 5.0, "review": "Works great..Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Susan Lombardo"}]