[{"rating": 5.0, "review": "Love it! Has a great interface, making it great to find shows.", "verified": true, "helpfulness": "0/0", "author": "Sesaonalfall"}, {"rating": 1.0, "review": "Could not get it to connect to my AT&T; WIFI.  Roku, computers and IPads connected just fine.  Sent it back, Amazon promptly sent me another one, this one also would not connect to my WIFI.  Don't know if this is a problem they have had or if it is just me, but I'm going to get an Apple TV instead.", "verified": true, "helpfulness": "1/2", "author": "sherri123"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Frank Kwiatkowski"}, {"rating": 1.0, "review": "No goodWaste of money would never recommend anybody to buy it.", "verified": true, "helpfulness": "1/2", "author": "prakash shah"}, {"rating": 5.0, "review": "I am no longer a slave to pay for TV would highly recommend for anyone", "verified": true, "helpfulness": "0/0", "author": "Bayla Manders"}, {"rating": 5.0, "review": "Love love love having the fire stick. Don't have to have a console or an expensive smart tv to watch our stuff now. Yay!", "verified": true, "helpfulness": "0/0", "author": "Kitty"}, {"rating": 5.0, "review": "OMG when I heard anyone could do it, I laughed and laughed. I finally decided to give it a try ... probably spending an afternoon cursing how no good it was !! WRONG !! I could not believe that I actually got this installed and operational in no time. It was easy. I've tried other electronics that were supposed to be a zip to install  (wrong) well this one really is. I just don't know what else to say except, I did it myself ...yeah !!  I told my friend she could do it too. Well now there are 2 total dummies when it comes to this stuff, that hooked this fire stick up to the tv with no problems, and are now watching  all the great shows, listening to music and soon gonna start playing games. Amazon thanks! Next is the voice remote ......hope that's just as easy. We'll see.", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just what we needed to extend our Prime membership", "verified": true, "helpfulness": "0/0", "author": "kenh \"web man\""}, {"rating": 5.0, "review": "This turned my dumb TV into a smart one. I really love this thing!", "verified": true, "helpfulness": "0/0", "author": "James R. Vaught"}]