[{"rating": 5.0, "review": "Once I got comfortable with it, the Fire TV Stick is great!", "verified": true, "helpfulness": "0/0", "author": "Gary Morimoto"}, {"rating": 5.0, "review": "Only had it for a few minutes but am already loving it.  Going to cut the cable!  Will update if anything goes bad but everything looks really good and super easy to use.", "verified": true, "helpfulness": "0/0", "author": "spoiledrottencotton \"spoiledrottencotton\""}, {"rating": 5.0, "review": "I don't have any experience with competitor devices, but I plugged this one into our Sony Bravia and it has worked flawlessly ever since streaming a large of assortment of Amazon Prime videos.", "verified": true, "helpfulness": "0/0", "author": "AR"}, {"rating": 5.0, "review": "easy to install and works great", "verified": true, "helpfulness": "0/0", "author": "Louise A."}, {"rating": 5.0, "review": "I like it, easy setup.  I was able to sign in to my accounts, Amazon, and Brighthouse.  Streaming is smooth.", "verified": true, "helpfulness": "0/0", "author": "Hank"}, {"rating": 5.0, "review": "So far so good with this super device, giving one access to Netflix, Amazon, Hulu and several other providers of TV shows and films - all in one place. Membership in the various providers is necessary, as is WIFI service. The device can travel (it requires an HDMI port on a TV, and either a USB port or electrical outlet), and remains keyed to your accounts. It's a bit of a gear head luxury but a fantastic addition. And it's only $40. Not bad.", "verified": true, "helpfulness": "0/0", "author": "B. Illes \"bobbygoode\""}, {"rating": 5.0, "review": "EXCELLENT!!!", "verified": true, "helpfulness": "0/0", "author": "Richard A Miller"}, {"rating": 5.0, "review": "Very good product I recommend everybody get one", "verified": true, "helpfulness": "0/0", "author": "Derick johnson"}, {"rating": 5.0, "review": "The Firestick is great, love it. I have a problem, don't know if it's my internet provider or my network connection or why but I love being able to see Netflix", "verified": true, "helpfulness": "0/0", "author": "Bird Man"}, {"rating": 1.0, "review": "Absolutely unreliable, unfortunately.  I so wanted to give Amazon a chance over Google- but not only have I had so many connectivity issues - and the help information is not helpful in this situation- but I see how many other people have the same exact problems I experience with connectivity to my router.  It's frustrating and disappointing.", "verified": true, "helpfulness": "0/0", "author": "SuperK"}]