[{"rating": 3.0, "review": "Let me start by saying I had high hopes for this.  I am slightly disappointed in the performance of the Fire TV Stick.  I bought it primarily for streming Sling TV  Initial setup was a breeze, no issues, connected to my Samsung Smart TV, wifi network and Hulu/Netflix/Sling accounts with no issues.  The first week, it was great, a little lag in response times, but I can live with that.  Then the connectivity issues started.  It will work great and then say that it is connected to wifi but not the internet.  I fought with my network, thinking my modem was almost dead.  Reset everything, and nothing changes, can't connect.I went back to the Smart Hub on my TV and tried connecting there, no issues.  Connected on my laptop, no issues.  Connected on my Fire Stick...still won't work.  I gave up on it at this point as it was late and I was tired.  Came back the next day, ready to call Amazon Customer Service...thing works fine, no issues.  At this point, I'm scratching my head, can't figure this thing out.  So now I've just decided to live with it, it drops quality every now and then, and usually just requires a reset, it loses connection every now and then, so we just bounce back to the Smart Hub.  I plan on buying a second for another TV in the house for Sling, but am waiting for a discounted price and hoping that the 2nd will work a little better.Overall, mine is okay, could be much better.  We'll see how this plays out and I'll update if anything changes.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "haven't run into any issues", "verified": true, "helpfulness": "0/0", "author": "haguet1"}, {"rating": 5.0, "review": "Great interface for Amazon instant video, pretty good for Netflix, etc. Need to be able to voice control from my Echo, though...", "verified": true, "helpfulness": "0/0", "author": "Philo"}, {"rating": 4.0, "review": "Nice to have. Would be nice if they better separated the free prime content and the pay content.Free Disney Channels more then pays for this", "verified": true, "helpfulness": "0/0", "author": "angeline martin"}, {"rating": 5.0, "review": "Simple to setup and works well. This replaces my cable television service.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Needs newer movies", "verified": true, "helpfulness": "0/0", "author": "david meserve"}, {"rating": 1.0, "review": "I don't have a review but I have questions.  In order to use the Amazon Fire Stick do you have to be an Amazon member?  I wanted to buy for a gift but they are not members?", "verified": false, "helpfulness": "0/0", "author": "krista mejia"}, {"rating": 1.0, "review": "I find this difficult to hook up.  I have tried for 2 nights and still don't have it working.  I do have an older HD television, but I have a couple of HDMI ports.  Nothing seems to work.  So far I am very disappointed, and I don't feel that I should buy an instructions booklet.  I think it is misrepresented as far as simplicity.  Disappointed", "verified": true, "helpfulness": "0/0", "author": "Margaret W. Irvin"}, {"rating": 5.0, "review": "Great selection of shows.", "verified": true, "helpfulness": "0/0", "author": "TJ"}, {"rating": 5.0, "review": "Perfect! Does exactly what my originally priced Fire Stick does and for about $10 less! Although I'd appreciate if they added more language features, especifically spanish. I have family that would use it more often if it was in their native language! Anyway, buy refurbished, guys. It's a no brainer!", "verified": true, "helpfulness": "0/0", "author": "Antonio A."}]