[{"rating": 5.0, "review": "Beyond my expectations!!!", "verified": true, "helpfulness": "0/0", "author": "Renato O."}, {"rating": 4.0, "review": "This is my first experience with video streaming and I found this item to be relatively user friendly.  It really makes sense to purchase this if you have a Prime Membership.", "verified": true, "helpfulness": "0/0", "author": "JWM"}, {"rating": 5.0, "review": "Great for streaming", "verified": true, "helpfulness": "0/0", "author": "henry hon"}, {"rating": 5.0, "review": "Good device", "verified": true, "helpfulness": "0/0", "author": "Arnold Sher"}, {"rating": 5.0, "review": "Works as expected... hope to be further impressed!Update: have had it for over a month now, and still working great. I was able to plug it into the tv import of my xbox one. There are many different options for watching shows and movies. Very impressed.", "verified": true, "helpfulness": "0/0", "author": "Randall W Beals Jr"}, {"rating": 5.0, "review": "Yes", "verified": true, "helpfulness": "0/0", "author": "John S."}, {"rating": 4.0, "review": "One of my best purchases!", "verified": true, "helpfulness": "0/0", "author": "14bjackson"}, {"rating": 3.0, "review": "This product is acceptable but not amazing. I was expecting a lot more speed with the dual core chip but it still seamed slower than the Roku stick. The menu software is not the easiest to navigate. The bar menu on the side seems confusing to get to other popular apps such as netflix, crackle, etc. Also, I didn't understand why I have to have this extra 2 inch cable connected between the stick and the TV for \"best performance\" as Amazon recommends. Isn't that that point of having a stick? No extra cable? Also, my TV works great to power the Roku stick from the USB port so I don't have to have a AC cable connected. With the Fire Stick it notified me that my USB port was not an acceptable power source for the fire stick. That was another let down.  The Roku stick is still my favorite for ease of use and functionality.", "verified": true, "helpfulness": "1/1", "author": "jason rozell"}, {"rating": 5.0, "review": "There is no ask question section here so I am posting here, I tried scaling and resolution changes but have hadno font size increse.", "verified": true, "helpfulness": "0/0", "author": "Nels Dahlquist \"tikizone\""}, {"rating": 2.0, "review": "Available movie selection is disappointing.  Nature and travel selections could be beneficial.", "verified": true, "helpfulness": "0/0", "author": "Margaret J. Easley"}]