[{"rating": 5.0, "review": "After trying roku, google chromecast, apple tv, xbox, and a ps3, I'm finally settling on the Fire TV stick for the house. We mainly use netflix, youtube, and streams things on Plex. The biggest deciding factor was the remote. Its truly a pain in the neck to operate these sticks with a cell phone or ipad, and it's almost impossible to explain it to visitors. The apple TV doesn't play well with Plex, and forces you to load everything through iTunes.The Fire TV remote feels solid, and is simple enough that my mother in law can at least get to the you tube playlist when she's watching our toddler. The fire stick responds quickly and navigates menus smoothly. There are times when I have to reload Plex to see my shows, but otherwise I have had few glitches.I don't really use the search functionality or the games, so I can't comment on those things. They have a decent app store selection, particularly for cooking channels.", "verified": true, "helpfulness": "0/0", "author": "Wallace S"}, {"rating": 3.0, "review": "It's been good and clear.", "verified": true, "helpfulness": "0/0", "author": "Katie Mac"}, {"rating": 5.0, "review": "We have both the Roku and this. They are both similar, but with different menus. I like both equally. I use them on different TVs. It is great to be able to watch TV on demand.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "Set up in minutes, easy to use......great programming.", "verified": true, "helpfulness": "0/0", "author": "Ace Nevada"}, {"rating": 3.0, "review": "Good product but doesn't support browser casting", "verified": true, "helpfulness": "0/0", "author": "Shri Joshi"}, {"rating": 5.0, "review": "Best media player I have.  I like it better than the AppleTv and Rokus that I have.  Great price, works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Krdavids"}, {"rating": 5.0, "review": "Very happy with it. Everything I thought it would be and more!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is what Google Chromecast *should* have been.  If you are an Amazon prime member (which I am not - yet) then this is like gold.  Even without Amazon prime there is a lot of functionality built in.  Excellent value for the money.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Lewis"}, {"rating": 5.0, "review": "have the amazon tv box on my main tv. use the stick on my tv in the basement, downloads fast with great picture", "verified": true, "helpfulness": "0/0", "author": "gr"}, {"rating": 1.0, "review": "Worked great for the first 24 hours then everything kept on freezing on me. Nothing was working properly even though my Wifi was fine as I was able to watch on my Ipad and Iphone. Sent this back.", "verified": true, "helpfulness": "0/0", "author": "Blog"}]