[{"rating": 2.0, "review": "Sluggish. The menu sticks, the video seems to be constant buffering. You could try and blame it on my setup, but I have a Fire TV original and that works flawlessly. I love it. This one was worse than the Chrome cast. I am hopeful that Amazon will work out their performance bugs and improve this. Everall, I only give it a two (vs. a one) because I like the layout of the Amazon TV UX and that they included a remote with the stick.", "verified": true, "helpfulness": "0/0", "author": "Michael Villani"}, {"rating": 2.0, "review": "I must say so far I am disappointed in this product. I already was able to see Netflix, Amazon Video, and many of the other services using my PS3. The only reason I purchased this device was to mirror my Galaxy S5 screen onto the Fire TV Stick. I was excited when I received the device well before the promised date (hence the extra star), but that soon turned into disappointment when the mirroring failed. I have seen others complain about the same issue so I know that it is not something unique to my phone or TV Stick. I am desperately waiting for an update resolving this issue because I don't have a reason to use this device otherwise.", "verified": true, "helpfulness": "0/3", "author": "Vahid"}, {"rating": 5.0, "review": "works just fine", "verified": true, "helpfulness": "0/1", "author": "Adrian Fenesan"}, {"rating": 5.0, "review": "Love this, works like a charm.", "verified": true, "helpfulness": "0/1", "author": "Chris S."}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "1/2", "author": "GEORGE CMIEL"}, {"rating": 5.0, "review": "I enjoy this a lot. I can watch Netflix, Amazon Prime, Flixster, and Hulu Plus easier! :)", "verified": true, "helpfulness": "0/0", "author": "Ben L."}, {"rating": 5.0, "review": "Pretty much all the features of a full blown Fire TV.  It's a tad slower but if you've never seen a full blown FireTV you'd never know it.  For $40 you can't go wrong.  Plenty of \"hackability\" as you can sideload standard Android apps (.apk files). But your mileage will vary. I have heard that XBMC/Kodi runs well, haven't tried it yet.", "verified": true, "helpfulness": "0/0", "author": "socos"}, {"rating": 5.0, "review": "absolutely love it.  very easy to set up and looks fantastic", "verified": true, "helpfulness": "0/0", "author": "bob navarrete"}, {"rating": 5.0, "review": "Fire Stick!! Excellent device for televisions that are not \"SMART\". Ease of use. Fun games to play and Basically a Movie Go'ers dream!", "verified": true, "helpfulness": "0/0", "author": "Lucien Battiste"}, {"rating": 5.0, "review": "Great deal for Amazon Prime members. Can't beat the price Amazon offers.", "verified": true, "helpfulness": "0/0", "author": "JIHYE YOO"}]