[{"rating": 4.0, "review": "Kicks butt! Very easy to set up, great to watch shows movies with. Only wish they would make it easier for the color blind, really... yellow on white? Are you making fun of my disability? Fix that and its a 5.", "verified": true, "helpfulness": "0/0", "author": "Herrick Spencer \"ByteRisc\""}, {"rating": 1.0, "review": "This item has serious flaws. The item does not have the capacity to retain Wifi connection for more that 5 min. If you call customer service they will robotically try to troubleshoot it. asking you to do ridiculous things like unplugging it, connecting it to the extender or turning off everything in your house that is connected to Wi-Fi. I had this problem on two devices I bought one, it did not work, the replacement did not work either. Do not waste your money on this Garbage.", "verified": true, "helpfulness": "0/2", "author": "Alvaro G."}, {"rating": 5.0, "review": "Fire tv stick is great. I have one on all my tvs. Easy to use just does not have voice control.", "verified": true, "helpfulness": "0/0", "author": "Kpo"}, {"rating": 5.0, "review": "Thank you Amazon you did it again. You gave me a product that I love. Amazon TV Stick is easy use. It updated and I have been using it immediately. I have my own apps and  I made this my own. i recommend this to everyone.Thank YouMD", "verified": true, "helpfulness": "0/0", "author": "md"}, {"rating": 5.0, "review": "Easy to setup and use.  Used to watch net flicks and other Internet streaming on noninternet ready TV that has an HDMI port for stick.  Nicest feature is ability to use wireless wifi and not have cables running through living room.", "verified": true, "helpfulness": "0/0", "author": "JM"}, {"rating": 3.0, "review": "THE FIRESTICK IS OK  I GUESS YOU GET WHAT YOU PAY FOR. YOU STILL NEED  TO SUBSCRIBE TO MOST OF THE SERVICES AVAILABLE ON THE FIRE TV STICK", "verified": true, "helpfulness": "1/1", "author": "NICHOLAS MELFI"}, {"rating": 3.0, "review": "I like getting my prime video, but still have to use my Chromecast, and in fact my chromecast is used more. Since my TV only has one USB, the chromecast wins. Why? Youtube. Fire TV stick will not play it. I am a heavy Netflix user, light Prime User. If you are a heavy Prime Video User, this is 5 stars all the way for you. The setup is easy and intuitive. The device is sleek. Nice work Amazon. Great product. I bought mine on sale for $39 (pre-release I think). I would hate to pay more than that for this, but again, I like Chromecast better.", "verified": true, "helpfulness": "0/0", "author": "AMG Enthusiast"}, {"rating": 5.0, "review": "Excellent product!!!", "verified": true, "helpfulness": "0/0", "author": "JHAIR U. FOSSATTI E. PTY 41798"}, {"rating": 5.0, "review": "It's even more than I thought", "verified": true, "helpfulness": "0/0", "author": "Connie Federbusch"}, {"rating": 5.0, "review": "i like the ease of converting between tv & fire stick, 2 click switch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]