[{"rating": 5.0, "review": "Arrive and time, work well,", "verified": false, "helpfulness": "0/0", "author": "garfield bradnock"}, {"rating": 1.0, "review": "I can't get it to work properly.", "verified": true, "helpfulness": "0/0", "author": "rella"}, {"rating": 3.0, "review": "Its cool but i have experienced several temporary blackouts while viewing content. I did all the troubleshooting: i checked my connections, reset Netflix. Hulu and Amazon Prime and even rebooted my router and still get blackouts. I was doing better using my laptop connected with an mini display port HDMI adaptor.", "verified": true, "helpfulness": "0/0", "author": "just jay"}, {"rating": 5.0, "review": "Easy install  Being a prime member, I have large choice of movie, series and tv shows.  Maybe my best purchase ever.", "verified": true, "helpfulness": "0/0", "author": "Joan Davidson"}, {"rating": 1.0, "review": "Would not recommend unless you have a new TV.  Here's why: It worked for a couple months and then 'HDCP Unauthorised' messages started appearing. Everything I read online says your TV is too old in this case.  This cannot be the case because it worked perfectly fine for a while. I'm guessing some auto software update to the stick broke it because my Roku still works fine with that TV. Either way, the device now works for games and apps but cannot show any actual video content using Amazon Prime, HBO Go, or anything else.  I searched high and low for an answer to the issue and apparently the only workaround is to get a hdmi splitter that ignores HDCP. Many people point to workarounds like unplugging the tv, unplugging the stick, unplugging your router, etc. None of that stuff worked for me, nor should anyone have to resort to such silliness. I guess I'm going back to my Roku..", "verified": true, "helpfulness": "1/1", "author": "Darin0088 \"Darin0088\""}, {"rating": 3.0, "review": "As long you are not a Comcast/Xfinity customer looking to get HBOGO, it is not supported by this device.  Get the ROKU instead. Streaming from Netflix and Amazon is okay, with just a few dropouts/stuttering.", "verified": true, "helpfulness": "0/0", "author": "Charles Lyons"}, {"rating": 4.0, "review": "Great with the money", "verified": true, "helpfulness": "0/0", "author": "Oscar hernandez"}, {"rating": 5.0, "review": "I really like this device for accessing my prime TV and for hulu. It's easy enough for me to hook up (which is pretty darn easy) if you have a usb port on your TV or monitor, you can hook this up and be watching TV in about 10 minutes. Can't wait to introduce my daughter to fragle rock...", "verified": true, "helpfulness": "0/0", "author": "K.Sell \"KSell\""}, {"rating": 5.0, "review": "All it says it is and MORE,a little disappointed that prime membership gets you so few choices to view, prime should get you all", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Mansker \"Pat Mansker \"60's\" aficionado\""}, {"rating": 4.0, "review": "Great product. I usually don't like Amazon tech products, have tried, owned or tested many of them. But this one is great. Amazon Instant Video, Netflix, Miracast, etc. all work great. The fact that it doesn't have a native YouTube App (only browser shortcut) takes off that one star for me. I know that is a Google-Amazon 'thing'. Overall highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Rakesh Koul"}]