[{"rating": 5.0, "review": "Good streaming device for the price", "verified": true, "helpfulness": "0/0", "author": "Jose L. Flores Paredes"}, {"rating": 5.0, "review": "Works as expected.  Picture quality is great.  I like it.", "verified": true, "helpfulness": "0/0", "author": "medmeone"}, {"rating": 4.0, "review": "Very easy to install. Made my dumb TV smart.", "verified": true, "helpfulness": "1/1", "author": "dave"}, {"rating": 5.0, "review": "Just got it on Tuesday, set it up in minutes and it is a great replacement for the \"smart\" DVD player I was using.", "verified": true, "helpfulness": "1/1", "author": "Papa Joe"}, {"rating": 3.0, "review": "For what you paid it's o.k.", "verified": true, "helpfulness": "0/1", "author": "Norbert Haese"}, {"rating": 5.0, "review": "I absolutely love my new Fire TV Stick!  I would recommend this item to everybody and will probably buy several!", "verified": true, "helpfulness": "0/0", "author": "Dennis Hughes \"early adopter\""}, {"rating": 5.0, "review": "Super easy to set up and it works great!  (From a \"non-techy\" user!)", "verified": true, "helpfulness": "0/0", "author": "Mary J Mitts"}, {"rating": 5.0, "review": "Fast and easy to use.  Have another  type of \"stick\" doesn't respond or work nearly as well.  Would recommend this to anyone, 4 year grandson has it mastered already.  Glad I made the \"pre-sale\" purchase worth every penny and would even pay full price.  Works as fast or faster than our smart TV!", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "It is great easy setup and works without a hitch and the voice activated remote is unbelievableit is better than any smart tv that has ever been thought. It is even a better invention than sliced bread..", "verified": true, "helpfulness": "0/0", "author": "Gaylord P. White \"Brave Fan\""}, {"rating": 4.0, "review": "I finally got my Fire TV all setup.... After days of trying to figure out what was wrong... I replaced my Roku stick with the Fire stick and gave the Roku to my daughter.. Her bedroom is next to my bedroom in the house... I couldn't figure out why the Fire stick wouldn't update when the Roku stick which is further away from the router was playing just fine... I gave the Fire stick the same wireless credit that the Roku has... It doesn't.... The fire stick has a weak wifi in it not as strong as the Roku or the Chromecast at further distances... I ended up buying a wifi extender just specifically for my Fire stick because it's the only device that needs it... After extender setup it plays great...", "verified": true, "helpfulness": "0/0", "author": "L. M. SINGLETON \"Book Nerd !!!\""}]