[{"rating": 5.0, "review": "Works really well with our Samsung smart TV.  Really convenient with Amazon Prime movies, etc.", "verified": true, "helpfulness": "0/0", "author": "John F."}, {"rating": 1.0, "review": "Horrible product. Video often stutters. Roku is so much better than this.", "verified": true, "helpfulness": "0/1", "author": "lxelite"}, {"rating": 5.0, "review": "Works as described, easy to install and easy to use with the included remote.", "verified": true, "helpfulness": "0/0", "author": "Kevin Lee Price"}, {"rating": 5.0, "review": "Works great, i can now stream ALL my music to the TV surround sound.", "verified": true, "helpfulness": "0/0", "author": "BROKENARROW"}, {"rating": 1.0, "review": "can't watch tv shows in full screen like I can with my sony dvd player", "verified": true, "helpfulness": "0/2", "author": "Jerry Hamilton"}, {"rating": 2.0, "review": "Kinda meh?  Not necessary if you have a Smart tv or Tivo.  Very Amazon-centric.  My fault for not doing more research.  Still not really sure what it does.  What I wanted to do was connect my pc, phone and tablet to tv wirelessly.  Bought this only to find I would need to upgrade my tablet to do so.  Not a substantial investment but a waste of money nontheless.", "verified": true, "helpfulness": "0/3", "author": "M. T. Mirabile"}, {"rating": 4.0, "review": "great value", "verified": true, "helpfulness": "0/0", "author": "Roger"}, {"rating": 5.0, "review": "We absolutely love the firestick. We plan on getting rid of our satellite service and will save over 80 per month.", "verified": true, "helpfulness": "0/0", "author": "Ashley S Gilbreth"}, {"rating": 5.0, "review": "I bought two. I knew I would love this device.", "verified": true, "helpfulness": "0/0", "author": "Matthew Presley"}, {"rating": 5.0, "review": "Simple to use and fast loading times. I really like it. If you have any questions just post them and I will respond to them. Please note there is very limited free contet. Crackle is free, but unless you have subscriptions for streaming services such as, hulu, netflix, sling, amazon prime, or etc. this might not meet your expectations", "verified": true, "helpfulness": "0/0", "author": "eric inocencio"}]