[{"rating": 5.0, "review": "I used to use my xbox or ps3 to play netflix or hulu. Ever since I have this, it's perfect.  I couldn't be happier. The best thing is, I can hide it behind my TV without any wires sticking out", "verified": true, "helpfulness": "0/0", "author": "41reviews"}, {"rating": 5.0, "review": "Got it as a Fathers Day gift. Like more than the Riku I was using. Would recommend this.", "verified": true, "helpfulness": "0/0", "author": "Phranch"}, {"rating": 4.0, "review": "Its cool, easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Cathy"}, {"rating": 4.0, "review": "Though had some issues at start & needed to reset, so far has worked as I had hoped.  Thanks Amazon for great customer support!", "verified": true, "helpfulness": "0/0", "author": "Lynn A Rudisill"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "michelle polanco"}, {"rating": 4.0, "review": "I was already a prime member.  However, my HDMI TV was too old to have the Amazon Prime app.  This TV Stick allows me to now view movies and videos on my main TV.  I did not give it 5 stars because I find the remote a little too light for my fat fingers.  It is hard for me to use with one hand.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Austin"}, {"rating": 1.0, "review": "It is kind of a cool concept but unless you have Amazon Prime it kind of sucks.  There are thousands of free movies and shows available on the internet but you can not get to most of them.  I am going to keep looking for a way to watch shows I can watch on my computer but it is not the point to take a half hour to find a half hour long show.", "verified": true, "helpfulness": "0/0", "author": "Anthony Ward"}, {"rating": 5.0, "review": "We have bought two of them, they are very kid friendly. We put them on our 2 main TV's, my children use them all the time.", "verified": true, "helpfulness": "0/0", "author": "Margaret Medcalf"}, {"rating": 5.0, "review": "We love it.", "verified": true, "helpfulness": "0/0", "author": "Arline"}, {"rating": 5.0, "review": "Very easy to use, works great", "verified": true, "helpfulness": "0/0", "author": "bonnie"}]