[{"rating": 5.0, "review": "Awesome ui... Super fast. Bought 2 of them... Wish I would of bought these before my roku stick's", "verified": true, "helpfulness": "0/0", "author": "William fonseca"}, {"rating": 5.0, "review": "I wish I had this a long time ago! I wish there was more good free content but $99/year for Prime and $8/ month for Hulu (the services I subscribed to) are great.I'm still getting use to the system. When I switch my TV to HDMI to watch the Fire Stick TV, the screen is black, I have to press home on the remote which is wierd (maybe it's my TV, idk).The remote is small. It's nice the way it fits in my hand. However, I feel like it's going to get lost A LOT. I downloaded the app on my iPhone so at least I have a backup.So far, I'm very happy. I can't wait to use it more.", "verified": true, "helpfulness": "0/0", "author": "Shawn Barnes"}, {"rating": 5.0, "review": "We are very pleased with the Fire tv Stick.", "verified": true, "helpfulness": "0/0", "author": "george spon"}, {"rating": 5.0, "review": "Works like a charm. Nice little device and simple to install.", "verified": true, "helpfulness": "0/0", "author": "Roderick Logan"}, {"rating": 5.0, "review": "Could not get Prime Music without it.  Got movies/tv from Amz via dvd player but apparently needed this for Prime Music", "verified": true, "helpfulness": "0/0", "author": "jeanne mcdonald"}, {"rating": 5.0, "review": "Happy :)", "verified": true, "helpfulness": "0/0", "author": "Paula Cordova"}, {"rating": 5.0, "review": "It is easy to use and install  except for opening the remote to put in the batteries have it open or easier to open", "verified": true, "helpfulness": "0/0", "author": "julia christ"}, {"rating": 1.0, "review": "I have never been able to make this work. I came on the site to return it but my return window has now closed. I am very disappointed. I wanted it to work! The device located Wi Fi but wouldn't make the connection. I looked up trouble shooting, tried everything suggested. Totally bummed.", "verified": true, "helpfulness": "0/0", "author": "Theresa Kelly"}, {"rating": 1.0, "review": "Meh...", "verified": true, "helpfulness": "0/0", "author": "dan"}, {"rating": 5.0, "review": "I really like this tool. Instead of purchasing a smart tv. I can use my regular HD flat screen.", "verified": true, "helpfulness": "0/0", "author": "Danielle Booker"}]