[{"rating": 5.0, "review": "does  great", "verified": true, "helpfulness": "0/0", "author": "Merle G."}, {"rating": 5.0, "review": "Love it! It was so easy to hook up and to start using right away.", "verified": true, "helpfulness": "0/0", "author": "leeanne bramer"}, {"rating": 1.0, "review": "I have a roku streaming stick that I have been using for a while and I bought the fire tv stick because it seemed like a great deal. I have both the fire stick and the roku stick connected to the same wifi network on the same tv, so they are exactly the same distance away from the router. I have tested both the fire tv stick and the roku stick on many apps ranging from Netflix to streaming movies on my local network through plex. I have found that the fire tv stick is far less reliable than the roku stick. Whether it is on netflix, hulu, or plex the fire tv stick constantly stops to buffer this is not the case with the roku stick (I am not exaggerating). I suspected that the buffering may be due to my wireless router or ISP, but the roku has no problems, and streaming on my laptop also is flawless and I never have buffering problems, even when streaming 1080p video with full dolby sound.The buffering problem has got to a point where I stopped using the fire tv stick completely and rely solely on the roku streaming stick. The fire tv stick is glitchy and has become entirely unusable due to the buffering issues. I strongly recommend getting the roku stick instead. regardless of having far more apps its just a far more stable and streamlined product and you can watch amazon instant video on it. Yes the roku's UI isn't the fastest, but fire tv stick isn't much better even with a faster processor and more ram.", "verified": true, "helpfulness": "1/1", "author": "Dirtdevil"}, {"rating": 4.0, "review": "Works as advertised.easy to use interface. Great for prime video users. Took 1 star off  for wifi range, still descent  though.", "verified": true, "helpfulness": "0/0", "author": "Cathy"}, {"rating": 4.0, "review": "Works like a charm. Would be better if there was more variety of channels to add. But I love it!", "verified": true, "helpfulness": "0/0", "author": "Brenda Ramsey"}, {"rating": 3.0, "review": "We have a little oler tv's and it dowesn't recognize the stick.  Setup isn't as easy (at least on our tv's) as they claim.", "verified": true, "helpfulness": "0/0", "author": "D. Blake"}, {"rating": 5.0, "review": "Great steaming device", "verified": true, "helpfulness": "0/0", "author": "Josiah"}, {"rating": 3.0, "review": "This works OK... It's missing some key services like Vudu where most of my digital movies are stored. The password protection doesn't stop a user from using another app though, only the built in amazon stuff. All of this could be fixed by software updates, so hopefully Amazon fixes it.", "verified": true, "helpfulness": "0/0", "author": "Josh Close"}, {"rating": 5.0, "review": "Like It!", "verified": true, "helpfulness": "0/0", "author": "federico aloe"}, {"rating": 5.0, "review": "The Fire TV Stick is the best purchase I've made this year.  My husband is hard to shop for, but I bought this as a gift for him and he loves it.  The accessibility, variety of shows and music are unbelievable.", "verified": true, "helpfulness": "0/0", "author": "Leomac777"}]