[{"rating": 5.0, "review": "great product and easy to use", "verified": true, "helpfulness": "0/0", "author": "Pamela Palmer"}, {"rating": 4.0, "review": "Great!!!!! But still needs more channels. Crunchyroll.....", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 3.0, "review": "Seems to work almost flawlessly with Amazon Instant Video, Pandora, and Netflix but it gets pretty wonky with other popular apps such as Crackle, Vimeo, and a few others. Many times I get kicked back out to the main Fire TV menu whenever I try to stream movies. It doesn't seem like apps are updated very frequently, if at all. PLEX (which costs $5 on Fire TV, as opposed to free on Roku) is useless ( it freezes when trying to stream videos), maybe because its a really old outdated version. This Fire TV stick seemed to work like a dream when I first got it....but then, after about a month of use, a few apps started bugging out and it would randomly lose its Wi-Fi connection for no reason (when other devices in my home had no trouble at all with the same WiFi signal). Usually unplugging and rebooting the Fire Stick would remedy these issues...for a few days. I find myself switching back to my Roku boxes more frequently instead of hitting or missing with the same exact apps on the Fire Stick. So far, I've not experienced any problems with the games, though the selection of titles is very limited for the Fire Stick. I guess if you're really interested in gaming, spend the extra money for the full sized Fire TV box. Fire TV Stick is nice...when it feels like working. Oh well, I guess this is the very first version. Maybe it will preform better as newer models hit the market....oh, I almost forgot...and this could be the deal-breaker for some...if you own a library of UltraViolet digital movies, the ONLY app available on Fire TV Stick that will allow you to access them is Flixter...but it is TERRIBLE! It ONLY allows streaming in SD, not HD! I was really frustrated with the experience. I have a pretty healthy library of full HD classics in the cloud but they're only available to me via a very weak and pixelated SD stream on Fire TV Stick. There is no Vudu, M-Go, or CinemaNow that I can find. Also, I could find no Google Play app either. So if you happen to have a library of Google Play movies, then Fire TV is not for you. Instead, get a Google Chromecast if you wanna play your Google Play movies OR a Roku if you want to access both your Google Play and UltraViolet movies....also, I keep looking at the clock and calendar...waiting for HBO GO to show up on Fire TV Stick. Hopefully soon...", "verified": true, "helpfulness": "0/0", "author": "Nick Poncio"}, {"rating": 5.0, "review": "Simply Amazing!", "verified": true, "helpfulness": "0/0", "author": "Michael K."}, {"rating": 4.0, "review": "Would like to surf the web", "verified": true, "helpfulness": "0/0", "author": "Nadirah Alexander"}, {"rating": 3.0, "review": "Great idea and concept. However we could not get it to work with our TV. Of course Amazon easily refunded our money without issue so that was nice. Wish it would have worked for us.", "verified": true, "helpfulness": "0/0", "author": "lovesamazon"}, {"rating": 5.0, "review": "I wasn't so sure about this at first.  But I like it better than the other streaming devices out there.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my Fire TV Stick. Lots of TV shows, tons of games! I'm sure I haven't discovered all that it has to offer. Set up was super easy. I just plugged it into the HDMI port and used my TV's USB port for power. It quickly connected to my WiFi and I was on my way to unlimited entertainment.", "verified": true, "helpfulness": "0/0", "author": "Born on a Mic Check"}, {"rating": 1.0, "review": "Not happy with performance . Stick keeps shutting down saying there is a internet issue . Signal is strong when I check the modem . Would not recommend this product at this time", "verified": true, "helpfulness": "0/0", "author": "MARK ROSTKOWSKI"}, {"rating": 5.0, "review": "I love it; so far I have just used it to watch Netflix. It is very easy to use", "verified": true, "helpfulness": "0/0", "author": "tf \"Teresa Fiskum\""}]