[{"rating": 5.0, "review": "Very happy with the Fire TV Stick so far!  We have a roku on our downstairs tv which lets us access Amazon Prime, but we only had apple tv upstairs, so when I saw this special deal for prime member I jumped on it...very glad I did!  It seems to load movies MUCH faster than itunes and the quality is awesome!  I have watched a few college basketball games on the ESPN app also.", "verified": true, "helpfulness": "0/0", "author": "Brian Mac \"maccve\""}, {"rating": 2.0, "review": "I much prefer my Roku.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pretty Awesome! Easy setup! fast and does what it is to do.", "verified": true, "helpfulness": "0/0", "author": "heath henderson"}, {"rating": 1.0, "review": "Nothing exceptional.  It was $20 when I bought it so its hard to complain.  Not worth $40.", "verified": true, "helpfulness": "1/4", "author": "Smith"}, {"rating": 5.0, "review": "The Fire Stick was a gift fromour Son and we love it! So convenient. It connects to the back of your tv and you never see it.No wires. The remote can pick up the signal from anywhere. Behind your back. So there is no holding your arm up or down or side ways to change the options. Great gift! I would purchase the Fire Stick and give it as a gift.", "verified": true, "helpfulness": "0/0", "author": "Sandra"}, {"rating": 2.0, "review": "The Fire TV Stick does have basic parental controls which can prevent access to Games & Apps, Photos, and Music as a whole. However it lacks the granular features of FreeTime which can control access down to individual apps and videos. Also, you may want to get the voice control remote, but by that time you might as well pick up the full featured FireTV instead...", "verified": true, "helpfulness": "0/0", "author": "Sambucka"}, {"rating": 5.0, "review": "I was able to purchase this item as a Prime member when it first came out for $19.  We gave up cable a while ago and have been using Roku's on each of our TVs.  I hadn't yet added a device to the kitchen TV because there is nowhere to put a visible device.This stick is a perfect solution.  I worried that it would stick out too far from the back of the TV to allow it to be properly mounted on the wall, but it comes with an HDMI extender that solves that problem.I set this up in less than 10 minutes.  It came already synched to my Prime account.  I had to log in to Netflix and Hulu and a couple of other apps and we were on our streaming way.The interface is better and faster than the Roku's we have.  Very fast streaming and great picture quality.  I have no complaints yet.  It's working perfectly for our small wall mounted TV.It did take almost 2 months for me to get the stick.  But I knew it was back ordered when I bought it.  For $19, it was worth the wait.", "verified": true, "helpfulness": "0/0", "author": "ndnile"}, {"rating": 1.0, "review": "I love Amazon and was excited to try this product.  Like many others, my wifi connection is continually dropping even though I have Very Good signal strength and unit is plugged into power.  I have other wifi devices that connect fine, including a 1st generation Roku which works fine.This was a frustrating experience and will be returning the product unless an update is released.  Right now the device is useless.", "verified": true, "helpfulness": "0/0", "author": "John Sullivan"}, {"rating": 5.0, "review": "I have an Apple TV and Chrome cast - both are adequate. the Fire TV Stick has leaped over them, I connected the stick to a multi HDMI connection and can jump between Fire and Apple at will. but they have similar content o I will be moving the Apple to another TV.The Fire out performs Apple TV - No more interruptions or waiting for the show to reload.very impressed.", "verified": true, "helpfulness": "0/1", "author": "Henry C. Diem \"HDiem\""}, {"rating": 5.0, "review": "It is very fast! I have them all, Roku, Apple Tv, WD, and this is my new favorite.", "verified": true, "helpfulness": "0/0", "author": "Kayleen Jackson"}]