[{"rating": 3.0, "review": "Looks like it might be pretty good, but if you are a comcast user it's of limited value right now as Showtime doesn't work and my guess is that when  they release HBO Go that it will have the same problem", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my Fire Stick.. It sinks with everything I've already had in my Amazon account At 1080p HD, 8 GB storage, Dual Core 1 GHz Cortex A9, 1 GB RAM, Bluetooth 3.0, what more can you ask for. I've also got to side load KODI for Fire stick and believe me, the movie streams are clean and very unnoticeable buffering (you can also sideload other famous movie apps, if you know what I mean). You can also download the Fire app to have an excellent wireless remote at your fingertips.", "verified": true, "helpfulness": "0/0", "author": "Bruce O"}, {"rating": 5.0, "review": "1000% better than Roku..that's all you need to know", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Ok; great specs for little guy .Does prime media great - movies, music, photos.Interface great.But. You have to continually put in your prime PIN- annoying.Non amazon apps do not work well.Huge dissapointment with Plex client; ig. You planned to get this for that, look elsewhere. Plex stutters like crazy on this znd will lock up.This is not a problem on roku boxes . Lg tv, and roku sticks that are furher away than this from router.Inlusion of hdmi dongle is very nice; use this ho work out hdmi input spacing issues; but care with how it faces- there is huge impact on wifi depending onofietation.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have amazon instant and the fire stick is awesome for it", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "Both my wife and I love this item-no commercials and plenty of content-two thumbs up!!!!  Easy to figure out and operate the system and it has enough content that we are thinking of doing away with cable TV and all its annoying commercials.", "verified": true, "helpfulness": "0/0", "author": "1979 Fiestalvr"}, {"rating": 1.0, "review": "It's great in theory, but never works well. We always have troubling streaming, as the connection seems to fail frequently. The signal strength of my wi-fi definitely isn't the issue either, since we have Apple TV and Wii U both streaming from the same location without any trouble whatsoever.  I don't think we've ever gotten through a single program or movie from start to finish without connection failure. Amazon needs to rethink the technology and makes some improvements for sure.", "verified": true, "helpfulness": "1/2", "author": "Luladelrio"}, {"rating": 5.0, "review": "Kids love it now my turn excellent", "verified": true, "helpfulness": "0/0", "author": "geri callender"}, {"rating": 4.0, "review": "Very easy to set up and picture seems really good. Still learning how it is different.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Disappointed that Xfinity and Amazon do not have an agreement with Showtime Anytime.  What's the holdup?", "verified": true, "helpfulness": "0/0", "author": "Gary Swingle \"CALGAR\""}]