[{"rating": 5.0, "review": "Works great! No regrets so far", "verified": true, "helpfulness": "0/0", "author": "Christian Rosales"}, {"rating": 2.0, "review": "its broken already", "verified": true, "helpfulness": "0/0", "author": "Bonnie Menard"}, {"rating": 5.0, "review": "I bought this when Amazon offered it to prime members at a lower price.  Then I didn't set it up until this past week.  It's great. It is pretty easy to watch prime television and movies.  Not to be distracted, but the quality of the prime shows and numbers has declined and I am not very impressed.", "verified": true, "helpfulness": "0/0", "author": "April W"}, {"rating": 4.0, "review": "Works fine and very fast. The antenna for the Wi-Fi is very powerful also. I'm impressed how good it works with that small size. The only flaw I've found so far is that a command gets \"stuck\", for example, if I move the cursor right and stop, the screen stops a lot further, it doesn't react smoothly.An improvement I would like is to see an app store more accessible, I had kind of a hard time looking for the YouTube app.", "verified": true, "helpfulness": "0/0", "author": "ERIC DI STEFANO Z"}, {"rating": 1.0, "review": "Fire stick did not work properly.  It kept freezing up constantly.  Then trying to reload.  Then freezing, then trying to reload. It was very frustrating trying to watch a movie.  I would not recommend the Fire Stick.", "verified": true, "helpfulness": "1/1", "author": "Cinnamon"}, {"rating": 5.0, "review": "I love my Fire Stick. I have the Fire TV in one room and use the stick in the other that I use less often. It works just as well as the Fire TV, takes only slightly longer to load things, although if you didn't have the other to compare it to you probably wouldn't notice. The only complaint I have is the remote, I like the voice remote I have for the Fire TV better, but this one is obviously functional and does its job, I just prefer the feel of the other more. I would recommend it to everyone just as I would my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Cora Mackenzie \"coramackenzie\""}, {"rating": 3.0, "review": "How do you disable the photo feature app on my fire stick tv?", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "bought as a gift for my cousin who has been loving it", "verified": true, "helpfulness": "0/0", "author": "sam i am"}, {"rating": 1.0, "review": "It is not working anymore.  After watching most of Season 2 of Orange is the New Black, we keep getting a message, \"We are unable to\"  show this feature at this time...please try later.'  We have tried many times.  Tried other than just Netflix.  NOthing.  We tried trouble shooting.  The online help websites did not help.  Will try to call Amazon but am thinking of sending it back.  Grrr!!!", "verified": true, "helpfulness": "1/1", "author": "Nancy K Hinchey"}, {"rating": 5.0, "review": "Wow! Why didn't I get this before? It opened a whole new world of television watching.", "verified": true, "helpfulness": "0/0", "author": "Geo"}]