[{"rating": 4.0, "review": "Excellent device. No issues with streaming. Super easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Cathie Humberger"}, {"rating": 4.0, "review": "You get a lot for your money but it would be even better if it would allow you to sync info from your tablet to the tv.", "verified": true, "helpfulness": "0/0", "author": "anon"}, {"rating": 5.0, "review": "Great product! easy to configure and I love the remote", "verified": true, "helpfulness": "0/0", "author": "A. Mora"}, {"rating": 4.0, "review": "Fantastic product in terms of function.  1 star subtracted due to the remote's battery cover being a poor design.", "verified": true, "helpfulness": "0/0", "author": "Jordan C. Ewing"}, {"rating": 5.0, "review": "Great product.  Only thing that is scary is if you lose the remote the product will not work.", "verified": true, "helpfulness": "0/0", "author": "Brandon Brown"}, {"rating": 5.0, "review": "I love it. Way better than Netflix", "verified": true, "helpfulness": "0/0", "author": "corey carney"}, {"rating": 5.0, "review": "this stick is amazing", "verified": true, "helpfulness": "0/0", "author": "Elise"}, {"rating": 2.0, "review": "Seems like a great catch all for Internet based services like Netflix and Amazon Instant but very disappointed with how it doesn't include HBOgo which is one the best internet based subscriptions out there. I would like a refund and return the product but it's past the return date-- I was waiting around hoping they would start including HBOGo but it never happened. I realize Roku has more functionality and options for alternative programming and will be buying one instead.", "verified": true, "helpfulness": "0/0", "author": "Raina Lee"}, {"rating": 5.0, "review": "all it says it to be", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The fire stick is great for the money. However, there are some hiccups that I hope are addressed when a new version comes out.1. The remote is very cheap. The controls periodically stick and makes me fly by the program I wanted to select.2. When using Netflix, I often do not have the option to start a program from the beginning. If it's toward the end of a movie and I want to start from the beginning, I have to manually rewind it. It's fast - maybe 20 seconds - but frustrating.A huge improvement I've noticed over my older model Rokus is the fact that if you are watching a program, it will automatically start the next one. Great feature when one of your kids wants to watch a short children's program and you're trying to make dinner!", "verified": true, "helpfulness": "0/0", "author": "MP"}]