[{"rating": 1.0, "review": "I have a Roku box and a Roku stick. Both loaded in seconds & months later work w/o effort.  Amazon stick arrived 2 months after ordering, constantly froze & timed out on setup.  Amazon stick keep rejecting my password even though it was entered correctly multiple times.  3 days later it accepted my password, but froze again. 4 days later i still couldn't set parental controls. I tried watching a show to test it & it kept freezing, dropping off my network, etc. This never happened w/the Roku stick on that same TV w/the same ultra fast wifi connection.  I plan to return the Amazon stick & reconnect my Roku stick.", "verified": true, "helpfulness": "0/0", "author": "Sew Perfect"}, {"rating": 5.0, "review": "I thought this would be kind of redundant, as we have a smart tv already - but it is pretty awesome.  I bought it when it was a one day deal to prime members for $19.99 - because I figured why not?  It works well and has a million movie, tv and music options (if you have prime).  We are now getting a TV in the bedroom because we can definitely use this in lieu of cable in a second room.  Really great product - glad I purchased it", "verified": true, "helpfulness": "0/0", "author": "Val"}, {"rating": 5.0, "review": "Very fast! excellent product", "verified": true, "helpfulness": "0/0", "author": "Carlos Ovelar Rojas"}, {"rating": 4.0, "review": "Did everything i needed it to do", "verified": true, "helpfulness": "0/0", "author": "Hilbert Bihn"}, {"rating": 5.0, "review": "Great I love it, can travel to with me also.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"shake52561\""}, {"rating": 5.0, "review": "Best device out there for XBMC sideload. Way better than the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "W L"}, {"rating": 4.0, "review": "I am trying out the Fire tv stick, replaced my Chromcast with itSo far I like it, installed an app on my phone to use as a second remote.Picture good and sound very good on my Bose speakersI think it is simpler to use than the Chromcast", "verified": true, "helpfulness": "1/1", "author": "Joe"}, {"rating": 1.0, "review": "I don't have cable so I mainly get my TV fix from Netflix which was a built in app on my TV. I also had Amazon prime which I never used because the user interface for the TV app was horrible to work with. Installation and set up was quick and easy. The user interface was nice and smooth and I finally started using my Amazon Prime instant video. I also built a Plex Server. The Fire TV stick worked well with steaming TV shows, but had frequent stuttering issues with when trying to play movies or HD TV shows (anything above 420p). I read that the app version of Plex was 4 versions behind the Google Play version. Not sure why that is the case, but eventually I found the uninstalling and re-installing the app fixed almost all stuttering issues. I still get the occasional stuttering once in a while. But other than that, the device works great. I use it daily issue free, but on rare occasions the Fire TV Stick, Netflix app, or Plex app will crash, but I guess something like that can be expected.Update March 1, 2015: The lack of stuttering was short lived as it still happens regularly. Netflix crashing happens a few times a week. The remote will randomly stop working so I'll have to use the phone app to do anything. The OS will also lag regularly. So many bugs, should of gone with another device. But I only paid $20...", "verified": true, "helpfulness": "0/0", "author": "Mike J"}, {"rating": 4.0, "review": "Was fairly easy to install. I thought the Advertisment said I would get a year free Prime but now it says one month. The layout is nice and easy to get around on. Question though, if this is supposed to be prime then why do they ask me for money to watch a tv show series? Well, I use Netflix anyways. 4 out of 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Brian Eckert"}, {"rating": 5.0, "review": "Wow now I can dial up everything who needs cable Anymore. Great site.", "verified": true, "helpfulness": "0/0", "author": "sz"}]