[{"rating": 3.0, "review": "Fire TV Stick works fine and is easy to set up. Purchased to watch Prime shows. Seems like most are very old or B grade movies. Many times you are referred to purchase or rent on Amazon because desired content is not rated PRIME. Can't make the iPhone 6+ app connect/pair with the Stick and can't find a good source for assistance.", "verified": true, "helpfulness": "0/0", "author": "David L. Ellis \"Dellis80134\""}, {"rating": 5.0, "review": "Love Amazon Prime, Fire stick loads right up, connected to WiFi with no problems. Second one I bought for another TV.", "verified": true, "helpfulness": "1/1", "author": "John R Foglia"}, {"rating": 5.0, "review": "pretty amazing device, specially for the 20 bucks I paid.I was able to side load kodi on it too and that ran reasonably well, a bit underpowered for HD but mostly ok otherwise for 720p", "verified": true, "helpfulness": "0/0", "author": "Joseph Fountain \"bobo\""}, {"rating": 5.0, "review": "easy to hook up and more games and movies  for the grandchildren.  Life is good.", "verified": true, "helpfulness": "0/0", "author": "john crank"}, {"rating": 5.0, "review": "Awesome product!!", "verified": true, "helpfulness": "1/1", "author": "George Garland"}, {"rating": 5.0, "review": "Once I got it setup, I really like it. Setup was frustrating because of entry of email and password and no correction button. Love the use of it once it was understood. I would really recommend that people purchase the voice controlled remote.", "verified": true, "helpfulness": "0/0", "author": "LadyJane"}, {"rating": 5.0, "review": "I love this device", "verified": true, "helpfulness": "1/1", "author": "Tameka Kirk"}, {"rating": 4.0, "review": "The fire stick was easy to plug in. We do need to increase the speed of our internet router as movies are delayed for downloading.", "verified": true, "helpfulness": "0/0", "author": "Roberta A. Manis"}, {"rating": 5.0, "review": "Excellent value,especially with Amazon Prime.", "verified": true, "helpfulness": "1/1", "author": "Thomas A. McGarr"}, {"rating": 3.0, "review": "I feel that this might be great if directions on use would have come with it. I have a cable channel selector and the one that came with the stick doesn't work with the other one. I can't get anything to come up when I hit options. I see that Netflex is there and a few other ones but it is not letting me access them. Not really happy with the stick. I am not mechanically gifted so I wish there were more instructions with it.", "verified": true, "helpfulness": "0/0", "author": "boston"}]