[{"rating": 5.0, "review": "Great item!  Keeps my 5 year old niece sitting still.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Jersey Reader\""}, {"rating": 5.0, "review": "This item changes the whole way you watch T.V. I bought two so that TVs in the bedroom and living room are connected.  When you have amazon prime, you watch movies of your choice, on your time. You no longer have to wait for channels to view the movies you want to watch on their time. In addition, all other apps can also be viewed with this devise. You can also view programs on TV when you have the time to watch them. My husband and I love the freedom this devise gives us. I recommend Fire Stick to anyone I talk to, so buy it.", "verified": true, "helpfulness": "1/1", "author": "Phi"}, {"rating": 5.0, "review": "Look into Kodi. Great addition to the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Victoria Fischer \"student\""}, {"rating": 5.0, "review": "The Fire stick far exceeded my expectations.  It's a great device that I use every day to watch, play and exercise.", "verified": true, "helpfulness": "0/0", "author": "Mark Kalaris"}, {"rating": 5.0, "review": "Works great and perfect for getting rid of the dishes and wires.", "verified": true, "helpfulness": "0/0", "author": "Kapilialoha \"Kapilialoha\""}, {"rating": 5.0, "review": "Love my new Firestick.  And the added bonus is my Prime account free movies and tv!", "verified": true, "helpfulness": "0/0", "author": "Monique McKithen"}, {"rating": 5.0, "review": "A wonderful addition to any television", "verified": true, "helpfulness": "0/0", "author": "LJ"}, {"rating": 5.0, "review": "LOVE this product!  We've had Roku for years and it was okay but this is MUCH better.  It's small and easy to use, but also on Netflix it advances to the next program something Roku never did.  The set up took less than 30 seconds and you can move it from TV to TV very quickly.  The interface is super easy too.  Also there is an app for you phone to use your phone as a remote so no more looking for the remote.  Very cool!", "verified": true, "helpfulness": "0/0", "author": "Debaroo"}, {"rating": 5.0, "review": "Worked as advertised.  This is ten times better then chromecast.", "verified": true, "helpfulness": "0/0", "author": "Avid Amazon Buyer"}, {"rating": 5.0, "review": "It was perfect.", "verified": true, "helpfulness": "0/0", "author": "Raphael Thomas"}]