[{"rating": 4.0, "review": "I love it! But I wish I lived in the US.  I hadn't realized I can't access Prime Movies from abroad.  It's an awesome product, though!", "verified": true, "helpfulness": "0/0", "author": "Sara Zomer \"Sara Zomer\""}, {"rating": 4.0, "review": "Awesome device. I got it free with a 3 month subscription to Sling TV (which cost $60). I'm currently in the process of \"cutting the cord\" and the Sling app plus the Fire Stick have allowed me to have access to the majority of content I enjoy. This device gives you access to a ton of apps and runs pretty smooth over my WiFi.I experience occasional buffering but overall it's very reliable streaming. I'm very pleased with it and might eventually buy a second for another TV, but it's very easy to move around since it's plug and play. If you already have Amazon Prime this is a no brainer to access all of the content available to you.It's the bare bones of the Amazon Fire streaming devices, I'd recommend this to those that are just looking to access their streaming content over their TV, the games available are pretty basic and if you're really into games you should buy the box instead.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 1.0, "review": "IF U DONT LIVE IN USA... DONT BUY THIS. PROGRAMS ARE NOT AVAILABLE, NOT EVEN NETFLIX.", "verified": true, "helpfulness": "0/0", "author": "Rod Morales"}, {"rating": 1.0, "review": "Question worth buying or should i go with roku stick? Rating it is just so i can post", "verified": false, "helpfulness": "0/4", "author": "E.Killier"}, {"rating": 1.0, "review": "We found fire stick to be difficult to setup and we would like to receive our money back!! Also, the movie selections were dismal and we have incurred additional expense returning to our overall comp/tv provider!  Many times the movies we chose would not allow us to access them!! The movies are too old or too violent. The other options we could not access. Very frustrating to use! You need to offer or refine the service. KEEP IT SIMPLE STUPID is a good beginning when you offer a service!! At least offer SIMPLE DIRECTIONS to utilize the art of streaming movies andOther media! We are looking for a credit of $75 since we have tried to utilize your program for three months!! WORTHLESS TO US", "verified": true, "helpfulness": "0/2", "author": "Carol Ann Rowe"}, {"rating": 3.0, "review": "I just realized I cannot mirror my iOS devices to my TV via Amazon Fire. That was a deal breaker for me.", "verified": false, "helpfulness": "0/0", "author": "Mauricio Martins"}, {"rating": 3.0, "review": "Product is ok. You have to be a prime member to actually benefit from the product. Had I known that, I probably wouldn't have ordered it. I already have Netflix and a smart tv so the fire stick is just an additional item that I don't need. A lot of the movies that I want to see is not part of the prime package so I still have to pay for those. I should have done more research before I purchased.", "verified": true, "helpfulness": "0/1", "author": "LindaVong"}, {"rating": 5.0, "review": "Great little gadget. Lots of features.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "who needs cable?!", "verified": true, "helpfulness": "1/1", "author": "kristin l dahl"}, {"rating": 5.0, "review": "Works great!  Really impressed with everything it has to offer!", "verified": true, "helpfulness": "0/0", "author": "Abby"}]