[{"rating": 4.0, "review": "Good product and we enjoy using it. Nice to have our netflix on the TV now. One thing I don't like is a lot of the \"free\" apps still require a cable provider login to watch shows on them. But works good with prime and for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Katie Love"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Errick Hildebrant"}, {"rating": 3.0, "review": "The stick is functional, has a few good apps, but my opinion is that the Roku is still head and shoulders above what the fire stick offers.", "verified": true, "helpfulness": "0/0", "author": "SHAWN KERMANI"}, {"rating": 4.0, "review": "Works fine so far, fairly easy to hook up (had a little confusion)-  didn't come with explicit directions for set up and use - only use it to stream NF but it works great. beats buying a smart TV or game console to stream movies", "verified": true, "helpfulness": "0/0", "author": "SE in NY"}, {"rating": 5.0, "review": "Have enjoyed it so far!!", "verified": true, "helpfulness": "0/0", "author": "Carrie Allee"}, {"rating": 4.0, "review": "Really like the convenience of this, but really wish there was a way to add more apps to it.", "verified": true, "helpfulness": "0/0", "author": "tsmith"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Daniel Miller"}, {"rating": 4.0, "review": "Pretty awesome, some slight improvement would be nice... I bought my stick to go with sling TV. Well most apps run rather well, but the one I bought it for works poorly at best... I know its not my Internet, the sling app works great on my tablet, and phone, but on the fire stick very weak.... But besides that it's a no brainer....  Way better than Chromecast.. I might return the Chromecast in fact... I like how it has mirrorcast however the dual core processor on the fire stick is buggy at full resolution... Hope they will make a stick with more power, like its big brother fire TV.  I almost bought the full size, but I like the cameo effect of the stick(less clutter)....  So hope you amazon gods read this... And please check the sling TV app. I prepaid for three months and got my fire stick for free... I like the fire stick.. But I feel cheated because of the poor performance on the fire stick. After all that is why I bought it.... Thanks for reading this.", "verified": true, "helpfulness": "0/0", "author": "MadisonLastrega"}, {"rating": 5.0, "review": "I am very happy about my firestick..I.loved it so much I bought another one for my bedroom..", "verified": true, "helpfulness": "0/0", "author": "arlene hughes"}, {"rating": 5.0, "review": "one word, fantastic", "verified": true, "helpfulness": "0/0", "author": "m morale"}]