[{"rating": 1.0, "review": "It kept dropping my wifi.  Was unusable.  Returned it and got a fire tv.  Working great", "verified": true, "helpfulness": "0/0", "author": "James Freeman"}, {"rating": 5.0, "review": "Awesome and easy to install!", "verified": true, "helpfulness": "0/0", "author": "luz savarese"}, {"rating": 5.0, "review": "Excellent! Saves me hundreds of dollars! There is only one cable provider in reno and they absolutely rape you on cable charges! With amazon tv i was finally able to cut down the brutal cable bill", "verified": true, "helpfulness": "0/0", "author": "Jennifer Souza"}, {"rating": 5.0, "review": "Good.. easy to connect and activate", "verified": true, "helpfulness": "0/0", "author": "Jambugeswaran J."}, {"rating": 3.0, "review": "This was more that I expected for the Fire TV Stick less for Prime.  It was installed fast and no instructions are needed to use.  One area to improve is if you want people to become Prime members you need a better way to search movies and make it clear when you search you are only searching for movies that come with prime Not movies to buy!! also viewing photos from your tablet is harder than expected.  I agree with people that are mad that they can not view movies on their tablet.  Do not fall for yes you can with an android app.  Maybe you can but very hard to do and certainly not user friendly.  I am in a debate to stay with Netflix or swap to Prime??", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The amazon fire stick was a really great set up. Love the layout and speed of navigating the menu was very fast. I give it 3 stars because i MAINLY got it for HBO go and it wouldn't work with my cable provider (xfinity). I had to return it sadly.", "verified": true, "helpfulness": "0/0", "author": "Merrick Dazzo"}, {"rating": 4.0, "review": "I've only had the Fire Stick a few days and so far, so good! Easy setup and lots of viewing options via Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Abbeylaca"}, {"rating": 5.0, "review": "This was really easy to set up. It came on the right date and it was packaged really nice.", "verified": true, "helpfulness": "0/0", "author": "Connie bennett"}, {"rating": 2.0, "review": "Substandard programming. Wait 'til more is offered.", "verified": true, "helpfulness": "0/0", "author": "robert tippett"}, {"rating": 5.0, "review": "its great. Good quality. I love it.", "verified": true, "helpfulness": "0/0", "author": "Kathy"}]