[{"rating": 1.0, "review": "Slow. Slow. Slow.", "verified": true, "helpfulness": "0/0", "author": "Erin Rogers"}, {"rating": 5.0, "review": "awesum", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was quite a nice surprise. I expected laggy menus and a \"basic\" experience, but this provided so much more! Very zippy and quick, and a great selection of movies and music and games. We previously had a chromecast, and this truly blows it out of the water! If you're on the fence, really consider the fire stick!", "verified": true, "helpfulness": "0/0", "author": "Dan Kinney"}, {"rating": 5.0, "review": "Very simple to setup and use! I had it out of the box and playing a movie in under 5 minutes!", "verified": true, "helpfulness": "0/0", "author": "AidanandLiam"}, {"rating": 1.0, "review": "When I received the item the set up was basically easy it worked pretty well for the first couple days after which it started sticking then it was not responding to the remote control until it eventually did not come on at all .the TV screen remained blank I tried all the trouble shooting from the site and the device just never came back on.", "verified": true, "helpfulness": "0/0", "author": "aneisha edwards campbell"}, {"rating": 5.0, "review": "Awesome.  very easy to use, but the controls can take a little getting used to.  Overall, a very useful product for all my TV and movie apps.", "verified": true, "helpfulness": "0/0", "author": "stephen"}, {"rating": 4.0, "review": "Easy to set up and works right off the gate", "verified": true, "helpfulness": "0/0", "author": "BenGi"}, {"rating": 5.0, "review": "I didn't buy it on Amazon, I purchased it at Best Buy.  It was cheaper and I got to take it home that day.  We do love it, almost as much as the xbox one's interface.  Very easy to use and very convenient.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Jayne N\""}, {"rating": 5.0, "review": "Really cool device I added upstairs.", "verified": true, "helpfulness": "0/0", "author": "Joey Deans"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "randy a davis"}]