[{"rating": 5.0, "review": "I'm delighted.Amazon wants more words so this is fill-in and more fill in and more fill in and more . . .", "verified": true, "helpfulness": "3/9", "author": "William Condie"}, {"rating": 5.0, "review": "I own multiple Roku devices, an original, a Roku 2, and this little gizmo.  I also own a Chromecast, a smart tv, and several TiVo units.  In short, I have some experience with Roku devices and streaming devices.I find this device to be just as easy to setup as all of the other Roku devices and in many ways simpler than Chromecast largely due to the remote.I bought this to take with me when I travel mostly.So far I have been very happy with the device.  The channels closely resemble the versions on other devices.Now the \"bad\"I generally like the Netflix channel, it does support profiles BUT it uses a lot of screen to highlight shows.  This is NOT even remotely a deal breaker, and I will be addressing my issues to Netflix directly since they wrote the channel.  The other changes like the episode selection is very nice.I found the initial startup of Vudu didn't finish but after going back to the main menu all was well.All in all a really good device that I am quite happy with!", "verified": true, "helpfulness": "12/16", "author": "C. E. Whitlow \"CEWII\""}, {"rating": 5.0, "review": "I got mine today and it was simple and easy to set up. I have a Roku 3, as well as 2 Apple TVs.  I primarily use my Roku 3, and now having the Streaming Stick, it will be nice to have when traveling.  It's a simple and easy interface. I also have a Chromecast, and right now, Roku has a leg up because it has a great deal of apps available. It's a good.Simple, easy to use and easy setup! Roku is the dark horse company that is giving Google and Apple a reason to be quite nervous!", "verified": false, "helpfulness": "68/83", "author": "Warren M. Williams"}, {"rating": 5.0, "review": "I believe this may be my first online review but I had to spread the word that Roku is now king. Although I am obsessed with Apple products, this affordable streaming portal is a game changer.  Previous owners of any Roku product will find the interface familiar as it possesses the same menu and capabilities as my Roku 3.  The game changer portion with this device is that it's only $50 and prevents the user from adding yet another set top box to their entertainment center.  While chromecast came close in concept and price, Rokus content blows Google's entry away.  From Amazon Prime to Hoopla Kids, Rdio to Showtime Anytime, there's enough streaming options outside what everyone else offers to keep every family member entertained. The only thing that could compete with this stick is if AppleTV added their App Store.  No need to look any further or read another review, buy this stick now!", "verified": true, "helpfulness": "7/11", "author": "Toomanygadgets"}, {"rating": 5.0, "review": "It is very easy to use and have great content. We got one for ourselves. After tried it, we really like it. We bought one more as a gift. It is great price as a gift.", "verified": false, "helpfulness": "13/18", "author": "cynthia"}, {"rating": 5.0, "review": "I just got my Roku stick today. It has the standard Roku style remote works well, no input for the headset on the remote control. I'll try to sell it on eBay for $550.00 :) notUltra high definition picture. I love it.", "verified": true, "helpfulness": "5/23", "author": "Star Sailor \"StarSailor\""}, {"rating": 5.0, "review": "I just got this device this morning very easy to set up and seems to work fine.It sure seems to have a lot more content than my apple tv does on it.I like the bigger remote it is easier to enter info on lots of times I have to retype things on other remotes to get passwords right .The price on this device is very reasonable for what you get.", "verified": true, "helpfulness": "16/21", "author": "Susan Kornblut \"marathon woman\""}, {"rating": 5.0, "review": "These are my thoughts after a few days with the Stick. I will update my review as I learn and experience more if needed but I don't believe I've missed a lot because, as a current Roku 3 and Roku LT and Google Chromecast user, this is an easy to write review.BROAD ASSESSMENTThere are several Roku models out there and then there's Chromecast so one good question that needs to be answered is \"why a Roku Stick and not a Roku 3?\" or \"why a Roku and not a Chromecast?\" or \"why not a Chromecast rather than a Roku?\" As an owner and user of Roku LT, Roku 3 and now a Roku Stick and also a Chromecast, I will try to briefly provide some answers below but, first, let me state what the Stick is about and what it can and can't do.[Roku Stick vs. Roku 3]The Stick does very much everything a Roku 3 does, except that there are no games on it and it doesn't come with headphones. I confess that I never cared about playing games on the Roku because just about anything from a cheap phone to a gaming console beats the Roku gaming experience and I don't care about the headphone attachment either so not having these and paying less for your Roku is a good compromise but anyone who wants Roku games and a mono earbud should order a Roku 3.The Stick lets you access the same enormous amount of channels as the other Roku devices, mostly VOD (video on demand) but also live streams. Almost all the popular 'pay' channels (Netflix, Amazon, Hulu Plus, HBO Go, MLB.TV , PBS, Showtime...) are there and hundreds of streams you never heard of but may end up watching every once in a while. The on-screen channel store breaks it all down into categories and you can easily browse Roku's store on a computer or tablet and order your channels to your device. And if there's something that you can't find in the official store you can always check the private channel listings. When it comes to 'content' Roku 3 and the Stick should be almost indistinguishable.The Stick can pair with Roku's free mobile app to browse and select channels to stream and it should allow for cross-media searches so, for example, you can see where on the (major) channels/services a show or movie may be available and at what price.The Stick features the same 1080p resolution as Roku 3 but browsing through menus appears to be slower than on the Roku 3, more like what you get out of a Roku 2 or a Roku LT. Wi-Fi is as good as on previous models, easy to set and so far stable.And, of course, the Stick costs only half as much as the Roku 3.[Roku Stick vs. Chromecast]As I stated, we have a couple of Rokus around the house and a Chromecast attached to the big TV in the living room. I still like the Chromecast, especially its ability to cast my Windows computer screen but after I temporarily replaced it with the Roku Stick I am inclined to keep it this way, at least for a while and this is why.+ Remote control (Roku): Yes, controlling the Chromecast from a Chromebook or laptop or tablet or phone is fun but the remote is easier and I don't need to mess with my other gadgets. Yes, it's one additional remote and it's not likely it can be easily integrated into a universal remote but it happens to be what I prefer.+ Channels selection: this is were Roku's strength lies overall and it's 'thousands' for Roku vs. dozens or possibly over a hundred by now (and growing) for Chromecast. Notably, Chromecast does not have an Amazon app and, given the Google/Amazon rivalry, it's not likely to have one soon but Roku does.= Screen casting works well with YouTube and Netflix and it's the same quality as what you get out of the Chromecast. Both Roku and Chromecast are likely are supported through a growing number of apps.- Casting off a browser is what may cause some to pick the Chromecast over a Roku. Yes, it only works with Chrome at this time (on Windows or a Chromebook) and the quality is very much affected by your computer's CPU and your Wi-Fi network but it does give you a lot of flexibility, especially with live streams.- Chromecast is slightly less expensive.MY EXPERIENCEIf you've never used a Roku before but decided that you wanted one the Stick is probably the best bet because it's the least expensive Roku now unless you can get an LT on sale.Installation was as easy as attaching the Stick into your TV's HDMI port. Like the Chromecast, the Stick works with a power adapter that needs a wall outlet. Since I already had a Roku account, I used my existing credentials but for those who don't it's easy to create one but you will be asked for credit card info. Then... go to the channel store and order whatever you want from there. For pay services such as Netflix or Amazon you will have to go through additional steps involving separate authentication and access codes but it's pretty self-explanatory and it's only done once.The streaming is exceptionally smooth. I first set the Stick on the second floor which is some 60-70 ft. and two floors away from our dual-band Wi-Fi router located in the basement. Worked perfectly.Remote control operation is generally smooth and the interface is intuitive. I am very familiar with the Roku interface so this is no surprise for me but I found it intuitive even on 'day one' albeit I was using it with a different Roku model then.So far, the Stick was as stable and reliable as our Roku 3. There were no crashes and I didn't have to revisit my Wi-Fi setup after the initial installation. Will update once this changes.The 'universal search' feature I like very much. You simply type in the name of a movie or show even an actor and you will see all your options on all channels and you will know in advance whether it's going to be free or exactly how much it was going to cost. On the Roku 3 all information appears almost instantly._______________________________________________________________THE FAQI will try to keep this section as objective (factual) as possible. Some of the topics concern Roku in general, not specifically the Stick.Q: Why would I want a Roku?A: Roku has, by far, the largest number of 'channels' vs. any other competing product. If you like exploring content beyond the popular services (Netflix, Amazon, etc.) you should consider a Roku?Q: Why would I want a Roku Stick?A: The Stick is the least expensive Roku at this time. It's also the smallest and therefore inherently portable.Q: When I shouldn't pick a Roku Stick over other Roku models?A: The Stick is HDMI only, does not support games and does not come with the earbud attachment. It's also somewhat slower when compared to Roku 3.Q: Can I use a Roku Stick with a TV lacking an HDMI port?A: No.Q: What are the best screen resolution and audio supported?A: 1080p, 7.1/5.1 surround sound.Q: Is the Roku Stick energy efficient?A: The Stick can be powered through the provided AC adapter or your TV's (powered) USB port. Note that there is no on/off switch or button on the remote so it's always 'on' unless you unplug it.Q: Is there an Ethernet (wired) port?A: No. The Stick supports Wi-Fi connections only.Q: Is everything included to make my Roku Stick work besides a TV and an Internet router?A: Yes. You get the remote (batteries included), the AC wall adapter, the Get Started pamphlet.Q: Do I need 'line of sight' to control the Stick?A: No, it comes with an RF remote so you can operate it with the remote even if it's sitting at the back of your TV.Q: Can I stream off a PC?A: Yes through a supported service such as Plex (I know there are others but Plex is the only one I've tried so far).Q: Are the Roku channels free?A: Many of them are but Roku also streams 'premium' channels for which you will require a separate subscription.Q: What are private channels.A: These are channels that, for whatever reason, are not listed by the channel store. You can easily make them 'appear' on your TV by picking them from one of the sites that lists such channels. See the first comment to this review for the URLs of such sites.Q: How much it costs to use a Roku?A: Once purchased, it could cost you nothing. Or you may subscribe to one or more premium services.Q: Can I have more than one Roku tied to one account?A: Yes.Q: Will the Stick get the channels I set on my other Roku devices if I am using the same account?A: Yes.Q: Can I search for a specific movie or show across all of Roku's channel?A: Yes. You can also search for other related information such as movies featuring one specific actor. Only keep in mind that the not all services may show up in searches but all major or popular ones usually do.Q: Can I watch YouTube on the Roku?A: Yes.Q: Are there shortcuts to my favorite channels?A: The remote has dedicated buttons to MGo, Amazon, Netflix and Blockbuster.Q: If I also have Chromecast, will I be able to control which device gets the Youtube stream?A: Yes, tested on a Chromebook.Q: Can I cast from a phone or tablet?A: Yes for Netflix and Youtube at this time but more services should be added later.Q: Can I get live news channels on the Roku?A: Yes. You may be able to find such channels at the store or as private channels listings but most US 'mainstream' news channels only offer a selection of recent on-demand videos.Q: Are non-video streams supported?A: Yes, radio stations and music streaming channels such as Pandora are supported.", "verified": true, "helpfulness": "4/335", "author": "Cthulhu \"Cthulhu\""}, {"rating": 4.0, "review": "I just got my Roku stick today, A day early! The setup was easy and the picture looks great! It has the standard Roku style remote works well. I will go into more detail after having it for a few weeks but at this time it's great! If your thinking of getting one I would recommend it I think it's going to be a hard item to get for a while.Update 4/7/2014I liked the design of this roku but it fell short on some of my exceptions. First the response of the remote and user interface is slow. Second I did not like that the roku had to reboot once I turned my TV back on. Third was wifi connection I have fast internet with a wireless N router, but it seemed like it took longer to load and then make screen HD quality( it could be network bad issues ) but still an issue.Over all it's not a bad design but I did return it and purchased a second roku 3. If your looking for one less power supply on your power strip and you don't mind waiting a few extra seconds for the device to load then this would be a good buy.", "verified": true, "helpfulness": "17/25", "author": "Tom"}]