[{"rating": 3.0, "review": "Pros:-Full featured roku box on a stick-PriceCons:-The user interface has a lag when you press a button on the remote-Wireless range is a fraction of the Roku 3 (Tried the stick on a TV that normally has a Roku 3 and the wireless signal was so bad it couldn't stream anything. On the Roku 3 on that same TV it will stream things in 1080p without a problem.", "verified": true, "helpfulness": "0/0", "author": "Matt S"}, {"rating": 4.0, "review": "Very handy. Only complaint is that sometimes the remote doesn't respond. Very annoying. And yes this is with fully charged batteries in the remote.", "verified": true, "helpfulness": "0/0", "author": "Jenna Baughman \"Sweet Cherrygurl\""}, {"rating": 1.0, "review": "Truly Disappointed. People did not test it at all. The remote was not working at all. Was so excited to see the programs but had to wait for two more days until the replacement product arrived.", "verified": true, "helpfulness": "0/0", "author": "Tejas Bhagat"}, {"rating": 3.0, "review": "It works and I like the easy access buttons on the remote for Amazon Prime and Netflix but it needs to be reset every couple of months as it stops picking up the wifi signal.  I've moved since I got it and have had the same issue in both locations.  But I guess for the price, it might be worth the trouble....", "verified": true, "helpfulness": "0/0", "author": "lvega"}, {"rating": 5.0, "review": "I'm actually a little shocked at how well this works, considering that my internet is pretty slow. Love that I finally have access to HBOGo, Netflix, Amazon Prime, and YouTube on my TV instead of my computer-- and at a much higher quality than I'm used to.For example, on my computer if I wanted to watch a video on YouTube, the highest quality that I'd be able to use without waiting 20 minutes for it to load would be 480p. On the Roku Streaming Stick the video will automatically play on HD with no hesitation or pauses to buffer.I'm feeling very spoiled!", "verified": true, "helpfulness": "1/1", "author": "a"}, {"rating": 1.0, "review": "No work in latinoamerican", "verified": true, "helpfulness": "0/0", "author": "Anibal Villamizar Ochoa"}, {"rating": 5.0, "review": "Thank you for existing to allow me to break away from the money sucking cable monopoly that I had!", "verified": true, "helpfulness": "0/0", "author": "Susiec80"}, {"rating": 5.0, "review": "Roku came in the same condition as advertised by the seller & it works great. I actually heard some bad things about Roku channels but you should do the research for yourself. I, myself, enjoy Roku but the next individual mite feel differently. I suggest checking with someone who has one before buying.", "verified": true, "helpfulness": "1/1", "author": "catherine monroe"}, {"rating": 4.0, "review": "We got it specifically to view TV.JW.org and it works great. The other stuff is tedious to search through and by the time you find something worth watching ,,,its time to go do something in the real world.", "verified": true, "helpfulness": "0/0", "author": "Mark C"}, {"rating": 5.0, "review": "I want to preface this by saying that I ordered a Google Chromecast a little while back and hated it. I'm pretty sure I received a defective device, so I could not do what I set out to do with it. But the lag, skipping and buffering on the Chromecast made viewing virtually impossible. I also called it's customer support and they told me the device isn't loaded with channels, nor will it be able to play many video formats. I thought I'd give the Roku device a try and see how it would go. I must say I am loving this device so far.I see a good amount of reviews saying that the stick went out on them after awhile, so I'm hoping that doesn't happen to me and it'll last. My main reason for buying a streaming device was to do PC screen mirroring/casting. I was a little hesitate about buying this stick because I read, and was told by Roku's customer service, that the mirroring option was only viable through  Windows 8 if I needed to do it on a laptop; all my computers have Windows 7. I found that there are multiple channels that allow mirroring; I am watching a season of American Horror Story right now through my laptop. I will say that Roku has so many paid channels and I wish it had more free movie channels.I am not dealing with the lag and stuttering that I dealt with on the Chromecast. My video does buffer often while playing movies; I don't experience constant buffering while playing tv shows. The \"Loading, Please Wait\" screen is annoying. Other than that, I have no other major complaints. I enjoy this device and recommend it to people who are teeter-tottering between buying this or the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Aubri Nicole"}]