[{"rating": 1.0, "review": "Did not work as easily as expecred.The item did not work as easily as expected. It was not sufficient to our needs.", "verified": true, "helpfulness": "0/1", "author": "Apfel \"Pomme\""}, {"rating": 4.0, "review": "Great and easy to set up! I has no problem. The registration is a little long process but otherwise great product", "verified": true, "helpfulness": "0/0", "author": "Gondal"}, {"rating": 5.0, "review": "I am saving so much money...no more cable bills!!!  Thanks, Roku !  Now I will be downloading other channels, so I have thebest variety of shows to watch.", "verified": true, "helpfulness": "0/0", "author": "Traci Wilson"}, {"rating": 5.0, "review": "works great now that i have ATT.net  Didn't work well with Comcast.. I like roku products...have 3  would recommend to anyone", "verified": true, "helpfulness": "0/0", "author": "Donald O. Lay"}, {"rating": 2.0, "review": "The Roku Streaming Stick: When I got the stick, I found that it was a little to long to fit the HDMI ports on my Samsung TV.  I got an HDMI Swivel Adapter, plugged the stick in, attached the USB power supply (plugged into wall outlet, so it has power 100% of the time). The remote synced right away!  Did a little setup so I was getting the 1080P.  This thing was GREAT!  Then after about two weeks it started having problems, programs were interrupted, error messages on screen, audio out of sync with program and often the remote would not work.  At first I found that unplugging things and restarting fixed it for a while, but it got worse. Contacted Roku Technical Support (e-mail), explained this and was given some suggestions for updating the software, repositioning stick, etc.  Did all that and problem remained.  Decided it might be my router, so contacted router customer service, and updated firmware etc.  Streaming stick STILL didn’t work.  After eight E-mails and two phone conversations with Roku, they suggested I send it back to Amazon for a replacement.Got the new one (Great customer Service Amazon!!) plugged it in, and I think it was even better than the first one…for just over a week…then the same things started happening to this one!  So I am going to send it back for a refund.", "verified": true, "helpfulness": "0/1", "author": "Dale M. Long"}, {"rating": 1.0, "review": "The stick does not hold the signal so it continually searches and or drops what ever it is you are trying launch. Not worth it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have a Roku 3 and purchased this Roku stick and it works great, no problem with setup or use. I recommend it to anyone looking for a Roku", "verified": true, "helpfulness": "1/1", "author": "guy cunningham"}, {"rating": 5.0, "review": "Bought this to replace a Roku 2 device, it much smaller, more convenient to use when traveling. I highly recommend this item", "verified": true, "helpfulness": "0/0", "author": "Donald R. Langworthy Sr."}, {"rating": 4.0, "review": "Unfortunately for this thing it was a bit too hefty to fit into the HDMI slots on the Sony LED TV (both side and rear) I use. It had to be connected through an audio receiver in my case (perhaps an HDMI cable extension would have worked too). Otherwise the device works well and the graphic user interface is a bit easier to manage than some of the other internet TV devices that I have. The remote is a nice addition, though a bit simplistic for my taste.", "verified": true, "helpfulness": "0/0", "author": "Konrad Grabski \"K Grabs\""}, {"rating": 3.0, "review": "If you are seeking perfection look elsewhere. If you are seeking a smooth UI look elsewhere. If you like netflix the way it is displayed online and in other devices look elsewhere. This little device had me very excited until I booted it. I can see this being great for a guest bedroom/kids room or someone on a budget. If you have extra cash to spend on another device I would spend it. If not this is functional and has enough features to provide many happy hours of content.Pros:-Easy to setup-Cheap-Great for kids-Plenty of apps-Plex looks goodCons:-Netflix UI is clunky-Huge Adverts on the main screen-Recommendations that I do not want for apps-Difficult to find the content I wanted on Prime", "verified": true, "helpfulness": "0/0", "author": "online4ever"}]