[{"rating": 5.0, "review": "Love it. Delivered on time.", "verified": true, "helpfulness": "0/0", "author": "Krishan Kumar Ahuja"}, {"rating": 3.0, "review": "Remote is a piece of junk. It stopped working after 6 months no matter how many times I changed the battery. Have to use my cell phone or tablet.", "verified": true, "helpfulness": "0/0", "author": "Penny Pincher"}, {"rating": 1.0, "review": "Let me start by saying I have bought a certified refurbished roku 2 off amazon before and it works great.... This purchase of the referb roku stick is god awful. The roku wouldn't even get past the set up screens before it repeatedly restarted itself... It's as if the people at roku didnt test it out at all. They Received the broken dongle through it back in a box, labeled it \"certified\" refurbished and sent it back out for sale... How could they not even retest the product to make sure it worked first... I could understand it going bad over time, but this thing doesn't work period.", "verified": true, "helpfulness": "0/0", "author": "Robert Keehn"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Luis Moreno"}, {"rating": 5.0, "review": "WORKS GREAT.. GREAT PRICE AND GREAT UNIT!", "verified": true, "helpfulness": "0/0", "author": "Carl Greene"}, {"rating": 3.0, "review": "I purchased this device as a Christmas gift in 2014. I was pretty excited about the streaming stick. Got it at a great price and it seemed like a much better value than going with the Roku 3. Well I guess you get what you pay for because this device is slow. There is too much lag when navigating the interface. I want instant response and you don't get that with the stick. Also, for whatever reason, the stick doesn't always register when I press the remote. Sometimes it even loses connection with the remote which is just annoying and frustrating. My friend has the Roku 3 and doesn't have any of these issues. If I had to do it all over again I would have just saved up and bought the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Rex Martin"}, {"rating": 4.0, "review": "Nice little device, I pack it in a little bag to take on the road.  Software performance is a bit slow, and I have some problems with remote responsiveness, but generally all the good of a Roku in a tiny package.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "BEST INVESTMENT EVER!! (AND CHEAPEST!)", "verified": true, "helpfulness": "0/0", "author": "Clara Carrillo"}, {"rating": 1.0, "review": "This arrived looking new in the package, but would not power on. The power cord had a very sticky substance all over it and smelt strongly of old cigarette smoke. Because it wouldn't light up and power on, I have to return it. What a bummer. I was very excited to try it out.", "verified": true, "helpfulness": "0/0", "author": "Gordon E Cowan III"}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "erik"}]