[{"rating": 1.0, "review": "Not work with all channels in Latin America, for example Netflix and others", "verified": true, "helpfulness": "0/0", "author": "adriana martinezs"}, {"rating": 4.0, "review": "Although it is small in size,  it's a big one beyond our expectations!", "verified": true, "helpfulness": "0/0", "author": "youngchul Jung"}, {"rating": 5.0, "review": "Its awesome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Not as quick as Roku 3 but perfect for bedroom", "verified": true, "helpfulness": "0/0", "author": "William F McGrath"}, {"rating": 4.0, "review": "I purchased one for my grand son for Christmas and another for my mother for mother's day. it great", "verified": true, "helpfulness": "0/0", "author": "Gwendolyn S ullivan"}, {"rating": 1.0, "review": "Need to be very close to router, my smart has better wifi than this product", "verified": true, "helpfulness": "0/0", "author": "Shane"}, {"rating": 4.0, "review": "Works fine bur the remote takes time. Way better to buy roku 2 or roku 3", "verified": true, "helpfulness": "0/0", "author": "Tiago"}, {"rating": 5.0, "review": "Works like a charm.Love it!", "verified": true, "helpfulness": "0/0", "author": "Jorge Panes"}, {"rating": 2.0, "review": "Does not pick up wifi nearly as well as my roku 2.", "verified": true, "helpfulness": "0/0", "author": "T. Crouch"}, {"rating": 5.0, "review": "I bought the refurbished model and it has had no problems yet! I was looking to buy an additional streaming stick because I already have the chromecast. I like that I can leave this on a TV where many people have access to and they do not have to have all of my log-in info to use different services on the TV. While HBO GO works great on a Chromecast if you have the app on your phone and the log-in set up, the Roku stays logged in for any user and it doesn't require anything from your phone. I have Chromecast for my bedroom TV but put the Roku on the TV in the living room so my roommates can also use the services I have.", "verified": true, "helpfulness": "0/0", "author": "Alicia Osen"}]