[{"rating": 4.0, "review": "I love this little device, except for having to visit websites to register. There are a lot of channels-many of them religious themed but also some tech channels and other channels that may be of interest. It's nice to have this in my other bedroom where there is no cable box, I can watch Netflix or other channels.", "verified": true, "helpfulness": "0/0", "author": "Kevin W."}, {"rating": 1.0, "review": "The trouble with this stick started from day one - it must've taken about 20 consecutive attempts at logging into my wireless network before it connected. At first it wouldn't find our wifi at all when we scanned for it; then, mysteriously, it would sometimes find it.  If it found it, it wasn't able to connect. After around 20 tries or so, though, we go lucky and it managed to connect.Good to go from here? Nope! The controller recently stopped working.  It simply blinks, indicating that it's trying to pair with the Stick.  Unfortunately, it just blinks and blinks, never connecting to the Stick.So I downloaded the Android and Windows Phone Roku apps (I have a Nexus tablet, and a Lumia phone).  Neither app finds the Stick.  I tried an online site that you can use to control your Roku, and that also doesn't connect.So I just hard-reset the unit.  This was reluctantly done, since now I'll have to re-add the Roku apps I want.  Unfortunately, we're back at the beginning again - it once again cannot find the wireless!This thing is miserable - I wouldn't recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Matt Roper"}, {"rating": 5.0, "review": "First and foremost I would highly recommend this to any and everyone.It is the easiest to thing to set up and it gives you great quality movies and videos and TV shows as well.Price is good and well worth it.  All you need is a free HDMI and USB port!", "verified": true, "helpfulness": "0/0", "author": "Marlene"}, {"rating": 4.0, "review": "I needed another Roku to use on a second TV.  This plugged into my receiver with no issues and immediately worked.  My 2 biggest complaints is that 1) It seems a little laggy, or slow.  Press a button and there is a slight delay.  Loading certain apps like Netflix, seems inordinately long.  Though once the app loads, It works perfectly.  2)  The remote is high frequency radio, NOT infra red.  This is common sense since the installed unit is located behind the TV or Amp that it plugs into.  Though I'll be honest I never gave it a second though.  But when I tried to program it to my multi remote, I could not.  Thus I now have 2 remotes.All in all it is a great device and enables me to get all my internet programming where I need it.  I would think that it is also portable, though I haven't tried it on another system.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Quite honestly, no issues. It is powered with the AC adapter which I suspect is more reliable than using a USB jack, though it should not matter.Response to remote is never an issue. Sometimes the device is slow to change modes, etc. But never to the point of being a problem.I have a fast internet connection (30-50 Mps) for smooth streaming.It is plugged into an HDMI input in back of my AV processor. It should work the same with other receivers, etc.I have a Sony BluRay player that also has smart features like a very large variety of apps.But it is just as easy to use the Harmony remote to power the stick on with the processor and HDTV.", "verified": true, "helpfulness": "0/0", "author": "dbeshplace \"hdaddikt\""}, {"rating": 5.0, "review": "This is like community college for your non-smart TV. It isn't as fast as their set top boxes but it works nicely and I have no remote control reception issues. We purchased this to help some less tech savvy members of our household reach Amazon Videos and Hulu. Previously we had set up a laptop with Media Center then tried a smart Blu-ray player and the process to start, find and play a video proved too daunting. With the Roku, the interface is simple, the remote is simple, and it works. Set up your favorites or playlists in Amazon and Hulu to make life even easier. Configuration is made simpler if you have a laptop handy to enter device activation codes.", "verified": true, "helpfulness": "0/0", "author": "Cs2CentReview"}, {"rating": 5.0, "review": "I bought this for a smaller wall-mounted TV in my kitchen. It's perfect because there's no need to find a place to put the little set-top box like with the other Roku units I have in other rooms. This little stick plugged right into the HDMI port and the included USB cable plugged in right next to it, so no need to plug in the power cord. As for performance, it's almost exactly the same as the other two Roku units I have (the XD and the Roku 1). Setup, interface, and quality are nearly identical, and all are good. The only noticeable interface difference is with Netflix. The Streaming Stick has a newer version of Netflix that lets you choose which Netflix profile you want to use when you open that channel. The other 2 models don't do that. Last, the remote is pretty much the same too, but it's a tiny bit fatter and the purple \"plus\" navigation arrows are plastic, not rubber like on the other remotes. Not a big deal, except that I'm so used to the feel of the rubber. And, this remote doesn't have the OK button in the center of the \"plus\" like the other remotes. Instead, it's a separate button below it. Honestly, I like the other remotes better and wish that the OK button was still in the center. But, I'm nitpicking now, and the important thing is that it all works great!", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 5.0, "review": "Only complaint is that sometimes the remote is not as responsive as I'd like but could be the location of the device on my tv.", "verified": true, "helpfulness": "0/0", "author": "Meghan"}, {"rating": 4.0, "review": "If you already own a Roku this lil guy works great in regards to adding Roku to a 2nd, 3rd, etc tv in your home without the big square block and wires. With that said, I gave 4 stars because there are 2 things missing from this roku that the standard Roku's have.1. WiFi reception is weak - not sure if this is the device, or if it is where I have this in my home. If your buying this stick, use on a tv somewhat close to your router for best reception. My router is on 2nd floor, TV that this is plugged into on main floor.2. The remote is a standard Roku remote HOWEVER, it does not have the headphone port for listening to tv without disturbing others. My Bedroom Roku Remote has a headphone jack - so I can listen to tv without disturbing my husband after he is sleeping. Since I use this Roku stick in our living room, not a big issue, but do be aware that the remote included - no headphone jack for private listening to tv/music/etc.Neither of these issues are deal breakers - just my personal experience/observations with this stick, vs the Roku 3 (box) I already own.", "verified": true, "helpfulness": "0/0", "author": "kjm27434"}, {"rating": 4.0, "review": "This made a good gift.", "verified": true, "helpfulness": "0/0", "author": "Bill Hasselbach"}]