[{"rating": 3.0, "review": "I bought this for my technology- challenged parents to access Netflix.  They previously used their Wii to stream Netflix but they have difficulty using the remote do they only use it when family is around to help them use it. I opened this and set it up in my house and it worked really well. The remote is so easy to use and easy to add  new channels and such. ROKU has a lot of channels and many are free. I also love that it had HBO go,  Amazon instant video and Netflix. We have. 3 chromecast,  an Apple TV,  and a Vizio smart tv in our home.  Apple seriously limits the apps but is nifty if you are invested in the apple ecosystem. It doesn't have Amazon instant video. My smart tv doesn't have HBO GO so I still have the Apple TV hooked up to it to get HBO.  The chromecast is awesome too but you have to have a device to cast from because there is no remote included so that made the chromecast  a poor choice for my parents. So I chose the Roku because it had all the channels and comes with a remote so it doesn't require Another device to operate it.  Bad news is that my parent's WiFi signal is apparently too weak to use this device. Although all of our tablets, computers, phones and the Wii all stream just fine even though you only get 1 to 2 bars. Will be returning the Roku stock to hopefully find another device that will work for them. In conclusion, if you have a strong WiFi  connection it is a great gadget that works well.  I would steer clear of this device if your WiFi signal is weak.", "verified": true, "helpfulness": "2/2", "author": "nursek"}, {"rating": 5.0, "review": "It's small and does the job. It's so much easier to get Netflix (and other things)using the Roku - rather than going through my computer.", "verified": true, "helpfulness": "1/1", "author": "jen \"james483957\""}, {"rating": 1.0, "review": "I purchased the roku stick because it said that it was the best for wall mounted tvs. When I got it in the mail, the description did not mention that the stick does not have a joint to bend.. Therefore we are unable to use it with our wall mounted TV. :(", "verified": true, "helpfulness": "0/2", "author": "Brett L. Frederick \"brettlynn94\""}, {"rating": 5.0, "review": "Great service! ! Love the roku", "verified": true, "helpfulness": "1/1", "author": "Henry richardson"}, {"rating": 4.0, "review": "I have had a ROKU 2 box for years. Both devices stream Netflix and Amazon perfectly. I got the Stick for my wall mounted TV. It's invisible plugged into an HDMI input; I used the AC adapter rather than the USB power source. After installation it worked great. Until it kept losing remote pairing. My email complaint to ROKU was answered after the holidays, and I have to say the customer service is excellent. Lodging a complaint via ROKU's website resulted in numerous calls FROM ROKU. The persistent, and helpful rep said that because the Stick remote uses my WiFi router to communicate with the device, my router had to remain on its channel 11 to maintain pairing. I am able to use my iPad/iPhone app but prefer the remote. This issue needs a software(?) fix. The only other con - the YouTube navigation is clunky- same as with the box.", "verified": true, "helpfulness": "1/1", "author": "xami"}, {"rating": 1.0, "review": "DOA. Bad luck.Will get Amazon Fire Stick next.", "verified": true, "helpfulness": "0/1", "author": "Brian T. Clem"}, {"rating": 5.0, "review": "Love this thing. For the price it's hard to beat. Loads a little slow.", "verified": true, "helpfulness": "0/0", "author": "Chris Gordon"}, {"rating": 3.0, "review": "Since I am still powering it from the TV, it has to boot up every time.So if you want to get instant access to it, I suggest plugging it to dedicated power.", "verified": true, "helpfulness": "1/1", "author": "Josh Kwok"}, {"rating": 4.0, "review": "Pros:Lots and lots of available channels.  Adding channels to your lineup is easy and the picture quality is very good.  Yes, there are a few pay channels but the vast majority are free.  Streaming Amazon Prime videos is easy.  After getting this, we retired our Apple TV box.  There is no comparison to offerings between the two.  Navigating the menus with Streaming Stick seems to be a little faster than the Roku LT but not by much.  One neat feature of the stick that the LT doesn't offer is that we can mirror our Samsung tablets to the television.Cons:Interferes with our Insignia television.  When this is connected directly to the HDMI port, the digital signal squirrels across the screen.  I added an HDMI cable to get the stick away from the television and the interference stopped but that defeats the purpose of having the stick over a different model.  Other than that, it works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Prepared"}, {"rating": 1.0, "review": "I liked it very much -- for the first hour or so.  After that, nothing would work for more than a minute.  I tried resetting to factory settings, only to be told that *now* I had to sign up for a roku account online, or it wouldn't work at all.  OK, I was willing to play along -- until suddenly they were forcing me to give them a credit card number.  No.  That was the last straw.  I don't give my credit card number to companies that ship out crap.", "verified": false, "helpfulness": "0/0", "author": "dmm"}]