[{"rating": 5.0, "review": "Outstanding!  I use in conjunction with prime and it works very well.  No problems in receiving transmitting signals from wireless router.  Plenty to see  both paid and free.", "verified": false, "helpfulness": "0/0", "author": "Mike Murphy"}, {"rating": 5.0, "review": "works great , easy to use . love it , taking it away to school with me", "verified": true, "helpfulness": "0/0", "author": "Mika Jay 1414"}, {"rating": 5.0, "review": "Great product, simple to install and works as advertised.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "nina"}, {"rating": 1.0, "review": "In my country all roku models worked well. But this model didn't work,", "verified": true, "helpfulness": "0/0", "author": "Eduardo Mora Castro"}, {"rating": 5.0, "review": "Awesome product - nice to go from the little Roku box to the \"littler\" streaming stick. So happy with the change!", "verified": true, "helpfulness": "0/0", "author": "mrscoors"}, {"rating": 3.0, "review": "Practically useless in South America.  Crapy channels are only available here.  All fault of DNS.", "verified": true, "helpfulness": "0/0", "author": "juan ignacio"}, {"rating": 3.0, "review": "This was my first Roku.  I thought it was amazing when I first tried it out, now come to realize, it's just ok.  The nice thing about it, is that it's small and fits behind the TV nicely.  I was surprised by the quality of the picture and sound on the device too!  The WiFi on it, however, doesn't reach very far.  I had to reconnect to the router many times, the load time on the apps takes sometimes up to a few minutes, and the device resets itself constantly.  If you are looking to get a Roku, I suggest the Roku 3, the $30+ dollars more is well worth it!", "verified": false, "helpfulness": "11/11", "author": "Nicholas"}, {"rating": 5.0, "review": "Arrived on time, connected it and start working perfect!!! very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Sanchez Diego"}, {"rating": 5.0, "review": "I purchased the Roku Streaming Stick after my Roku LT died on me. I also own a Roku 2 XD. My immediate draw to the Stick was the price point and portability. It is tiny (about the size of a thumb drive) and plugs right into the HDMI port on your TV and to a power outlet. It is small enough that it is mostly hidden, so if you're opposed to cords running wild on your entertainment setup, this is the product for you.The Stick seems to be slightly faster than my XD. This model comes with a Wi-Fi remote, unlike the older Roku models. It is very responsive and I have had no issues with signal.  In summary, if you're looking for a capable streaming media player and don't want to spend a ton of money or need the convenience of portability this product supplies, the Roku Streaming stick is a  good choice. If you're looking for the most powerful device Roku offers, you'll be better off looking at the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Brandon Nelson"}, {"rating": 1.0, "review": "So far, VERY unimpressed, the lag times between the remote and the stick are overwhelming. I get a better response when I use my android phone, and thats if Im lucky when it finds the Roku device. So far we've spent more time \"retrieving\" programs than actually watching. Some programs dont even load!!! Then theres always a connectivity issue, it doesnt tell you when your wifi/internet is not connected, you spend more time getting re-connected, and then having to go back through the channels to start your program. If this is Roku 1 in a stick, I wish I had gotten Roku 3 box....maybe I will, OR maybe I will go with Chromecast.*", "verified": true, "helpfulness": "0/0", "author": "Cooper \"Cooper ABQ\""}]