[{"rating": 5.0, "review": "works great for watching netflix", "verified": true, "helpfulness": "0/0", "author": "Sin \"Sin\""}, {"rating": 3.0, "review": "It does not give me access to the programs as they are happening. I can only access them later, after they've already been featured. It's not like watching the news right when they're shown. You can't sit and watch TV as the shows are progressing during the day. It's after the fact. If you're trying to save the money from the cable monthly bills, you still have to spend more money buying  HD antenna to give you access to other stations, such as ABC, CBS or NBC. I thought I would have access to them, but I was disappointed when I didn't. Now, I have to buy the other antenna and spend more money.", "verified": true, "helpfulness": "0/0", "author": "Maggie"}, {"rating": 3.0, "review": "So, if you've had experience with the Roku 3 before, and are expecting the same sort of interface and response time; well, I'm afraid I've got some bad news. Smaller processor (of course, given it's a itsy bitsy stick) means slower response time. It can get a little frustrating sometimes, as I'm used to the Roku 3 whiplash like speed. But it will give you access to your favorite apps, and when everything does load, the quality is outstanding and I stream WWE Network's live programming on it, and very little hiccups, if any at all with their live stream.Pros:-Great picture/audio quality-Lots of apps to chose fromCons:-Laggy-First time setup (at least for me) was grueling-Build quality of stick and remote are flimsyIf you just want to watch Netflix, Hulu, and enjoy their apps then you're going to get just that. Just be aware of the lag issues.", "verified": false, "helpfulness": "0/0", "author": "Justin T. Gfeller"}, {"rating": 1.0, "review": "Followed everything on the manual. The remote works sometimes and stop working at times. There are times where I tried standing closer and hoping it was the distance , no luck. Reset it and works...sometimes. Streaming, pauses at times here and there. I may have a bad product, but I'll try out Amazon Fire Stick.", "verified": true, "helpfulness": "1/1", "author": "Xuan Truong Nguyen"}, {"rating": 5.0, "review": "Family loves it, wish I didn't have to log in with my provider to get the Disney channels to work because DirecTV is not recognized by Disney yet so I can't get it on Roku. Kids weren't too happy about that, but they have plenty of shows to watch on PBS Kids. To me the Roku was very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "fluffy"}, {"rating": 4.0, "review": "Although the Streaming Stick is meant to be plugged directly into the back of a TV, I solved all of my issues by using an HDMI cable and a female-to-female adapter.  Now that the stick is beside my TV, I have had no issues with using the remote and the \"Loading, Please Wait\" messages no longer appear.  For those of you who still have problems with the remote, the Stick taking forever to respond or other connectivity issues, try the above.", "verified": true, "helpfulness": "0/0", "author": "Mike From Jersey"}, {"rating": 1.0, "review": "This one did not work. I got sound but no picture.", "verified": true, "helpfulness": "0/0", "author": "Sandra Walker"}, {"rating": 5.0, "review": "LOVE THIS DEVICE!!!", "verified": true, "helpfulness": "0/0", "author": "Jade \"Say something about yourself!\""}, {"rating": 5.0, "review": "The stick has changed how I watch. We have a Chromecast and an Amazon stick - don't ask, I'm crazy - but this is the best. The Apps alone make it worth it. Add an excellent interface (when compared to the Amazon stick) and the remote (as compared to Chromecast) and it's hard to beat. Get one.", "verified": true, "helpfulness": "0/0", "author": "BEC"}, {"rating": 1.0, "review": "Would not stream on any of 3 computers, including one right next to the router. Two experienced Roku users were unable to help.", "verified": true, "helpfulness": "0/0", "author": "Wayne A. Myers"}]