[{"rating": 5.0, "review": "Love this! So simple and easy and has provided hours of entertainment already.", "verified": true, "helpfulness": "0/0", "author": "Carla"}, {"rating": 5.0, "review": "great and easy to use", "verified": true, "helpfulness": "0/0", "author": "L Walker"}, {"rating": 5.0, "review": "Worked pretty well. No complains.", "verified": true, "helpfulness": "0/0", "author": "Mel Vargas"}, {"rating": 5.0, "review": "now my TV is a bit smarter, easy to install and to use, no glitches after a month of use, good deal, very happy with this product, getting ready for the cable trimming shuffle!", "verified": true, "helpfulness": "0/0", "author": "Joseph H. Oyer \"Audible has helped me expand my appreciation for history, science and the arts. The Great Courses series are illuminating. More please!!\""}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Immac"}, {"rating": 5.0, "review": "Very nice no wires and fast", "verified": true, "helpfulness": "0/0", "author": "frank N.C."}, {"rating": 5.0, "review": "I love the streaming stick but had to call Roku because my remote would not sync to stick. Hopefully no one will have to deal with the man I had. You can ask for a person from the states to help you, which I didn't know.And if it would not have been such a long wait time. I would have hung up and started over with not a idiot. He made no clue about his produce and his English was terrible.I have never made this kind of service from Roku.I did complain about it, they say recording call, I told them I hope so because this man should not be working for a great company like Roku.I have 4 Roku's on TV and no cable so I do know that,  that service was not like they use", "verified": true, "helpfulness": "0/1", "author": "LBEAR \"Lbear\""}, {"rating": 1.0, "review": "This stick came bent and then worked for about a month. Now it's a gonner and I had to replace it.", "verified": true, "helpfulness": "0/0", "author": "gigi orsillo"}, {"rating": 1.0, "review": "I wanted to connect my IPAD to my TV but all this thing is good far is getting Netflix and such.I have no use for it.", "verified": true, "helpfulness": "0/2", "author": "Hal cox"}, {"rating": 3.0, "review": "we use roku on all of our TVs and we love it. However the remote on this one does not stay connected and we have to constantly take the batteries out and put them right back in then restart the roku, and yes they are new batteries.", "verified": true, "helpfulness": "0/0", "author": "BRYON S SMITH"}]