[{"rating": 5.0, "review": "I plugged this into a TV in my dining area that is wall mounted.  I have used it only once but am very pleased with it.  So far I have watched a Netflix  program, and can now receive Amazon.  Previously I had Apple TV on another TV which did not work for Amazon.Certainly worth the money. Have a great Apple router so everything streams flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Joan in Metairie"}, {"rating": 2.0, "review": "The biggest problem I had with this was audio syncing.  If you plug it into your TV but want to use surround sound, the audio simply doesn't sync up with the video and I found no solutions OTHER than purchasing a home theater system that has an HDMI IN.  If you don't have HDMI IN on your surround sound system, don't buy this unless you're ok listening to your Roku-streamed content on the TV speakers.Overall, I was very disappointed that it works in such a way.  I had two perfectly fine blu ray home theater systems, and neither had HDMI IN (only HDMI OUT).  The fact that I had to purchase another just to use this device was a major letdown.  Do your research before purchasing.", "verified": true, "helpfulness": "0/0", "author": "R$"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Paul Kuhn"}, {"rating": 5.0, "review": "Did a lot of research before my purchase and I couldn't be happier with this choice. The Roku is the best choice in this category, very easy to set up and use and a seemingly endless list of channels and options.I would recommend it to anyone.", "verified": false, "helpfulness": "0/0", "author": "Matthew Grover"}, {"rating": 5.0, "review": "Excellent product, much faster than my old Roku box. A lot less progression bars to watch with this stick. Highly recommend for any new 'cord cutters' or experienced streaming users. AAA+", "verified": true, "helpfulness": "0/0", "author": "Blessed"}, {"rating": 5.0, "review": "Is amazing! althuogh it does not work well outside US due to ridiculuss restriccions and stupid shits. But paying VPN and IPTV by iks servers it is the future in TVOD. Love it!", "verified": true, "helpfulness": "0/0", "author": "Miguel Sancho Wilson \"M.S. Wilson\""}, {"rating": 4.0, "review": "I bought one of these during Amazon's Black Friday sale. My wife and I wanted a better way to watch Netflix than hooking up my laptop to the TV with VGA and audio cables.Setup was easy, and the improvement in our Netflix-watching experience has been amazing: Thanks to the HDMI connection, movies are genuine HD quality, and we're also getting better sound since we can use an optical digital connection between our TV and powered speakers. (The streaming video is now so clear and sharp that, when we watched a DVD last night, I was annoyed because the image from the DVD player looked soft by comparison.)For me, having a physical remote for Netflix was the main reason to buy the Roku Streaming Stick instead of a Chromecast. I can set my my Netflix streaming list on the laptop, then use the remote to cycle through my choices and control the Streaming Stick with the usual controls (play, pause, etc.).If I watched a lot of YouTube videos on TV, I'd probably prefer the Chromecast, since it isn't very practical to search for things with the Roku YouTube app on a TV screen. (With the Chromecast, I could just search YouTube in the usual way and send my choice to the Chromecast with a click.) if you're a YouTube buff, you might want to consider buying the Roku for Netflix and the Chrolmecast for YouTube.Another minor complaint: Some of the other \"channels\" besides Netflix that come with the Roku are useless. The Blockbuster channel, for example, is nothing more than bloatware that wants to sell you something. Fortunately, only a few of those channels are installed on your Roku screen or remote by default,and you can ignore the ones that are if--like me--you just bought the Roku to watch Netflix movies in streaming HD.Tip: You'll probably want to power the Roku Streaming Stick from an electric outlet instead of using your TV's USB port. That way, the Roku will stay powered up when you turn off your TV, and you won't need to wait for it to reboot when you turn the TV back on. (The Roku draws no more than 2 watts maximum, so you needn't feel like an energy hog if you leave it on.)", "verified": true, "helpfulness": "0/0", "author": "Durant Imboden \"europeforvisitors\""}, {"rating": 5.0, "review": "I love the Roku Stick. The only issue I have is that you still need an outlet to plug it into (to charge). Order the USB attachment if you can.", "verified": true, "helpfulness": "0/0", "author": "Jennifer G"}, {"rating": 5.0, "review": "Works great and in great condition", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 3.0, "review": "In my opinion, for what it is, it is WAY too much money. You need to have all these different accounts and whatnot just to be able to watch the thing. Luckily for me, I already had a Nextflix account prior to buying this. Renting a small handful of OK movies is also a good bonus I suppose as well. All in all, if i could find my stuid receipt, I would definitely bring it back and just move a game console into this room to keep going how I was with just Netflix. But if you are a big movie person with a ton of different accounts and you have a couple extra bucks to spend on rentals, this might just be the device for you. Not me. Hope this helps..", "verified": false, "helpfulness": "0/1", "author": "Astro"}]