[{"rating": 3.0, "review": "As others have said, this is slower than my other ROKU units.  I have a top-of the line dual band wireless router and set this up for fastest speed.  My ROKU 3 is fairly fast.  This Stick is blazingly slow.  I was able to get it to work, but it took patience because every time I pushed a button, it took a minimum of several seconds to get a response.  First, the packaging is horrid - it is not clear as you are opening it that you have to slide an inner carton out of a sleeve.  I wonder if they did this on purpose, to have people believe they have to destroy the box to open it - and then be embarrassed to return it.  I will be using this mostly for Netflix and Amazon prime, both of which queue up on this extremely S-L-O-W...Once running, streaming seems OK.  One final point ROKU, when I already have an account and after you ask me to key it in and then tell me my profile will load automatically (from my other ROKU 3, on-line setup), don't only load some of my preferences, not load others and load a bunch of crap-ware that I may or may not want.  And what is the deal with M-GO (which is my primary preference for movies) not being selectable from the Movie options and not able to put on my Home menu like I have on my ROKU 3?  Overall, a mediocre device and I am sitting here wishing I had purchased a 2nd ROKU 3 when they were on sale for $69 ($30 off) at Christmas.", "verified": true, "helpfulness": "3/5", "author": "over50logic"}, {"rating": 5.0, "review": "Fast, easy to setup and more apps than any other device! I have a Roku 3 at home as well and its very hard to tell any speed difference. While the headphone jack on the Roku 3 remote is nice its definitely not $50 nice.", "verified": true, "helpfulness": "1/2", "author": "Jeff and Andrea Bailey"}, {"rating": 5.0, "review": "I am the happy owner of a few different Roku devices and when this one was announced I decided to try this one out because of the price and then slim design.  I'm really happy that I didThe reason for this purchase was so that my parents would have a way to view different children's shows when my daughters visited them.  We currently watch tons of shows on Netflix and Amazon Prime due to the wide selection available and the ease of use.  They also have a flat screen TV that is mounted on the wall so the design of this stick seemed like it would be perfect to install and could also be hidden behind the TV.I set this up for them this past weekend and even though I was a little nervous at first, it turned out to be very simple and easy to do.  The reason why I was nervous was when I pulled this device out of the box I noticed that it had a power cord with it that has to be plugged into the HDMI portion of the Roku.  When I saw this I worried because having a power cord that had to be plugged into the wall is exactly what I wanted to avoid.  The good news was that after exploring it a little more I noticed that the pronged portion of the power cord could be removed and then what was left was an USB connection.  This was perfect!  The USB portion can be plugged into the back of the TV as well and will provide the power that is needed to the Roku stick.  There is a disclaimer that not all (if any) of the USB ports on back of the TV are guaranteed to be able to provide the level of power that is needed to power the HDMI portion of the Roku device.  Thankfully most new TVs will power this device without a problem.Overall I am very pleased with this Roku device.  I have been happy with all of the models that I have purchased to this point but this one takes the cake because of its slim design, easy set up, and ease of use.I recommend this model do anyone looking to step into the video streaming world.", "verified": true, "helpfulness": "1/2", "author": "Chris DeHart"}, {"rating": 5.0, "review": "I paired the Roku stick with a Samsung UN19F4000 19-Inch LED TV mounted in front of my treadmill and for a wireless system it works great.  Currently the stick is powered off the USB port on the side of the TV (see picture) and seems to be working fine.  I tested the stick for about half an hour with Netflix and Amazon Prime.  The stick unexpectedly reset once after the Roku system update and after setting up Netflix, but after that blip it worked as expected, streaming movies were smooth and the picture and sound quality was good.  I should note it's in the same room as my wireless router so I didn't have to deal with any signal issues.I also own the Roku 3 box for my plasma TV and the Roku 3 is more responsive, which isn't surprising as the stick is powered off a USB port and you wouldn't expect a high end processor.  I'm impressed it has enough juice to render HD video and audio.", "verified": true, "helpfulness": "60/64", "author": "JBinDC"}, {"rating": 5.0, "review": "Similar to other reviews, the Roku 3500R might be a bit slow, but it works great. I was concerned that it would not have line of sight from remote. Not at an issue at all. We use the power from TV USB and it plugs into free HDMI jack.Would definitely buy again.", "verified": true, "helpfulness": "1/2", "author": "Steven Halper"}, {"rating": 4.0, "review": "my first roku is roku 3 so I'm able to compare both of them. roku 3 is more faster from my observation but it still has everything that I need from my roku.", "verified": true, "helpfulness": "0/1", "author": "alphafivefive"}, {"rating": 3.0, "review": "While my newer blu ray disc players stream movies, Netflix and the like, the streaming is choppy, frequently stops and has to restarted. The Roku does not have this problem, but- while it offers 1000 streaming channels, many of them cost extra and the \"free\"channels cost additional money to access the programs. This could all add up very quickly and there does not seem to be any type of \"lock\" ability to prevent unauthorized access to these pay sites.The Roku needs to be directly in a HDTV, plugging it into a splitter to accommodate multiple devices did not work.", "verified": true, "helpfulness": "2/4", "author": "geojamie"}, {"rating": 5.0, "review": "I've used the Roku 3, and I loved everything about it except the price. Thankfully, there's this streaming stick that's similar to Roku 3 except it's half the price, much smaller, and there's no need to plug in anything if you've got a usb port on your TV. This much cheaper streaming stick is identical to the Roku 3 except that the load times aren't as fast, the remote's a bit less responsive, and there's no headphone jack. However, I can't complain considering the price.", "verified": false, "helpfulness": "0/1", "author": "Mark Twain"}, {"rating": 3.0, "review": "We already have the Roku 3 which works great but decided to get the new HDMI version 2014 Roku streaming stick only to find that the stick will not fit into the area at the back of the TV where any of the HDMI ports as the end of the stick clashes with the chassis of the tv. We will have to get an elbow HDMI connector in order to make this fit the tv. And that is without the power cable connected. We could get it to fit the MHL port but that did not power it up. If you have a wall mounted F series Samsung, by the time you fit a 90 degree HDMI elbow connector, then the stick and power cable you'd need an approx 4\" space between the tv and the wall for it to fit ok.We like the Roku product however and I will keep this in the hopes of being able to use it when traveling and it does fit our other Samsung older LED tv.", "verified": true, "helpfulness": "4/6", "author": "Phoodie Phile"}, {"rating": 1.0, "review": "I would like the Roku stick alot if it worked, but it say connecting to wifi, and then when \"connecting to internet\" - it can't get there.  Called Comcast, they were useless, 45 minutes later just me and my stick.  So I have a Roku stick, and I don't know where to stick?  Any suggestions Roku?", "verified": true, "helpfulness": "1/8", "author": "Not sure but \"Grateful to be alive\""}]