[{"rating": 4.0, "review": "Product is as advertised.", "verified": true, "helpfulness": "0/0", "author": "Jerry Pippin"}, {"rating": 5.0, "review": "So far I love it.", "verified": true, "helpfulness": "0/0", "author": "Tiffiny Newton"}, {"rating": 4.0, "review": "Love  the product. Thanks", "verified": false, "helpfulness": "0/0", "author": "FRANCES CAROLINE SCALES"}, {"rating": 5.0, "review": "Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Michael Neuwirth"}, {"rating": 4.0, "review": "XXx movies at 7 bux a month,, sweet!", "verified": true, "helpfulness": "0/0", "author": "Mikeb437"}, {"rating": 5.0, "review": "Everything connected perfectly it was a breeze and fits out of the way neatly on the back of the screen. The streaming stick has no box on display that moves around so just point the remote at the TV and its ready to connect.", "verified": true, "helpfulness": "0/1", "author": "D. H."}, {"rating": 1.0, "review": "Did not work. Took me an hour to set up and another hour with Roku support but it was useless. I returned the item to Amazon", "verified": true, "helpfulness": "0/0", "author": "Kevin Pham"}, {"rating": 5.0, "review": "I love this! It's so awesome that I can use this to view the JW.org broadcast!!!", "verified": true, "helpfulness": "0/0", "author": "Dreamsphere"}, {"rating": 5.0, "review": "So far, SO GOOD!!!  My brother got me this Roku 3500R Streaming Stick for Christmas and let me say this thing is SPOT ON!  I already own a Roku 3 ( which I have in my bedroom ) and I needed another Roku player for my living room TV but so far I was lazy and didn't want to go out and buy one just yet... well, my Brother must have read my mind because they other day he surprised me with this and I didn't have to go out and spent my own money to buy one, he did it for me!  ( Thanks Bro! :)  Now, let me tell you that I don't give TWO CRAPS about games and stuff like that, I just want to watch recorded content on my Roku player like Netflix, Hulu Plus, Amazon TV, WWE Network, and UFC TV and those are all the channels I subscribe to and I get them with crystal-clear definition, 100 percent digital sound and they look great streaming on my TV... as far as the setup goes, boy oh boy let tell you... it's pretty darn simple...if you know how to use a computer, that is, if you don't then you're going to feel a little frustrated by all the things you have to do so it's probably best to get somebody who knows computers and computer-related devices to install it for you.  I myself had some issues with the installation but it turns out my modem was on the fritz so I had to restore my modem to the factory settings and came up with a new password and stuff, and after that installation was a breeze!  All my favorite channels were already preprogrammed on it ( I guess Roku knows which channels I watch because of parity with the service ) and I didn't have to add a single channel.  IMHO this item is much, much better than Apple TV ( which I also own ) even though Apple TV is really pretty and easy to use. Apple TV just doesn't have as many channels available for it's service so you'll be better off buying a Roku player and enjoy streaming all the good channels like the ones I mentioned above...  I am really excited about the times we are living in because TV is now becoming \" a la carte \" and you can subscribe and pay for you WANT, and not just get stuff force-fed to you.  BRAVO ROKU, APPLE, AMAZON, GOOGLE, AND ALL THE REST!!!  However, for the most part... I'd like to thank Roku for being the best and BETTER than all the rest!", "verified": false, "helpfulness": "2/2", "author": "PurplePooh \"Bother!  It All :)\""}, {"rating": 2.0, "review": "Did not work for me. kept stalling out after 4% of update. Sent it back and going with the old and tested trial and true Roku 1.", "verified": true, "helpfulness": "0/0", "author": "Steve H \"Steve in Ohio\""}]