[{"rating": 5.0, "review": "Love it. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this product.  Easy to install and works great.  We get much more programing than with our Apple TV's.  We have three of them.", "verified": true, "helpfulness": "0/0", "author": "Irving Becker \"Irv Becker\""}, {"rating": 4.0, "review": "Second Roku for our kitchen TV.  Easy to use.  Easy to set up.  Took about 15 minutes from opening the box to watching content.  And most of that time was syncing the channels with passwords onto device.  Roku 3 in the living room.  The only difference so far is no headphones and you have to point the remote more precisely.  I don't need those functions for this TV.  We reduced our cable to Starter TV with HBO.  Standard internet and phone.  Reduced our bill by 1/2.  With  Netlix and Amazon and HBO GO we have a lot of good choices.  Other than a couple favorite channels like TCM and MSNBC (Golf Channel for my Husband) we're pretty happy.  Conservatively we're going to save $750 over 12 months.", "verified": true, "helpfulness": "0/0", "author": "Janet Wise"}, {"rating": 4.0, "review": "I like a lot", "verified": true, "helpfulness": "0/0", "author": "Timothy Crawford"}, {"rating": 5.0, "review": "I have a Roku 3 at home ... I miss it when I travel ... now I have a full Roku box in a stick to travel with. When I registered the stick, all my Roku 3 channels immediately initialized on the stick. I'm happy!", "verified": true, "helpfulness": "0/0", "author": "Bruce Neville \"bneville\""}, {"rating": 4.0, "review": "Great product. Remote has been a bit difficult to deal with. Has stopped working and had to look up online for fixes.", "verified": true, "helpfulness": "0/0", "author": "Jenn"}, {"rating": 2.0, "review": "Did not last long at all broke within a few months.", "verified": true, "helpfulness": "1/1", "author": "Cristy"}, {"rating": 1.0, "review": "the remote came broken. the arrow buttons get stuck in all directions. wasn't to difficult to deal with so I didn't bother with a return. I guess its a little my fault too. I should have sent it back right away. its nearly impossible to navigate the Roku with now. forced to buy a new one", "verified": true, "helpfulness": "1/1", "author": "David R"}, {"rating": 5.0, "review": "Perfect. It plugs right into the tv and the usb cord plugs in as well. Love it.", "verified": true, "helpfulness": "0/0", "author": "Tolkiengirl \"tolkiengirl\""}, {"rating": 1.0, "review": "I've had this since Christmas 2014, so 4 months and it's no longer working already. It was plugged into the TV and never touched after that. It was great while it lasted but if I had known it would only work for a few months I never would have bought it.", "verified": true, "helpfulness": "1/1", "author": "Dannielle Thompson"}]