[{"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "parag patel"}, {"rating": 1.0, "review": "Spend the extra money and buy the Apple TV.  Takes a long time to load and the interface is really hard for kids to use.", "verified": true, "helpfulness": "0/0", "author": "Rob W. Barry \"rob\""}, {"rating": 5.0, "review": "Love it would recommend to everyone", "verified": true, "helpfulness": "0/0", "author": "John F. Galloway"}, {"rating": 2.0, "review": "I am incredibly disappointed with this purchase. I was debating about buying this or another Chromecast. If Amazon supported prime content on Chromecast, it would have been a no brainer. Since they don't, I went with the Roku stick. I find it to be extremely slow, buggy and it freezes often. Sometimes the remote doesn't bother to work either.  Really unhappy with it.", "verified": false, "helpfulness": "0/0", "author": "Thomas G Vose"}, {"rating": 5.0, "review": "LOVE THIS PRODUCT! There are so many things it can do. I got this for the TV in my room so I could watch Netflix on my tv mainly. But I found that with a TWC app I can get more cable channels and even get a TV guide like the TV in the living room. It works fast and easy and has so many possibilities of things to do.", "verified": true, "helpfulness": "0/0", "author": "Audrey Greeson"}, {"rating": 5.0, "review": "So easy to set up and use. I LOVE this product and suggest it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Kiersten"}, {"rating": 5.0, "review": "Purchased for Christmas gifts because I love the one I have!  I initially purchased the Roku Stick back in September for the Amazon Prime app that my smart tv did not support.  Since then, we use the Roku much more frequently than cable.  I know the Roku Stick comes with games, but I am not much of a \"gamer\" so my review/rating is strictly in regards to the \"TV watching\" aspect.I have both the Amazon fire stick and the Roku stick (one hooked up to the living room and the other to the bedroom TVs).  Both are easy to set up and come with remotes.  You can also download the apps for both devices and make your iPad and iPhone a remote which comes in pretty handy.  As far as the user interface layout goes I favor the Roku.  The Fire Stick is Amazon brand so the home screen is mainly geared towards Amazon/Prime.  With the Roku, your are able to strategically place your apps anywhere you want on the home screen.  With that being said, both are pretty easy to use and navigate through. The other feature I favor on the Roku is the search feature that pulls up movies/tv series and instantly shows you if its included in one of your subscriptions (i.e. Netflix, Hulu, or Amazon Prime) or how much it costs to rent/buy.  With the Fire stick it brings you first to Amazon then you would have to click on the bottom \"more options\" button to take you to the screen that shows you if its included in any other of your subscriptions.In regards to App options, Roku has more than the Fire.  With that being said, in my opinion, the Fire has more than enought apps than you need.  Both have major apps like Netflix, Hulu, Amazon, ESPN, NFL etc.  The biggest downfall for the Roku is that it doesn't offer the PLUTO app and the Fire does.  The PLUTO is great having multiple channels in the app itself.  The biggest downfall for the Fire is that it doesn't have the TIME WARNER app, so I am unable to use my cable Time Warner subscription that comes on the Roku.With the Fire stick or Roku you could save money by paying for the Netflix $10/mo., Hulu $8/mo., and/or Amazon Prime $100/yr. subscriptions and cancel your cable.  I honestly wanted to cancel my cable subscription since I barely use it, but my boyfriend insisted on keeping it so he could watch football (understandable).Price wise, I believe the Roku Stick is around $50 while the Fire Stick is about $40.  You can definitely get them cheaper, just got to keep your eyes peeled for the sales.  I believe I paid $25 for the Fire Stick and $35 for the Roku Stick around Christmas.Both are great products! Just some user preferences that sets them apart.", "verified": true, "helpfulness": "0/0", "author": "Jana A"}, {"rating": 5.0, "review": "Amazing! Why pay for the roku 3 when this is just as good if not better.", "verified": true, "helpfulness": "0/0", "author": "MUSS Pac 12"}, {"rating": 5.0, "review": "Really love this. It is nice to have something so small for a wall mounted TV. I have family members that have the other versions of Roku and they seem impressed with this. It is great to have something for the spare bedroom/craft room and not have to pony up for another cable converter box!", "verified": true, "helpfulness": "0/0", "author": "Beth Breeding"}, {"rating": 5.0, "review": "Very happy with this product!", "verified": true, "helpfulness": "0/0", "author": "steve miyashiro"}]