[{"rating": 1.0, "review": "I got this product, set it up and watched it for one day before it stopped working. Now I figure if it cost me $57 per day to watch it, I could have every cable and satellite channel available. DO NOT buy this thing.", "verified": true, "helpfulness": "1/4", "author": "Mark"}, {"rating": 3.0, "review": "If you're looking to get roku 3 experience or performance don't bother buying this version of roku. The start up and interface is rather slow compare to the other products. Works well but not what I expected. This is about the same as chromecast performance.", "verified": true, "helpfulness": "1/1", "author": "Jose"}, {"rating": 5.0, "review": "I wanted to buy a Chrome HDMI plug-in device but the Chromecast does not work with my iPad 1 nor with my Kindle Paperwhite so I bought the Roku.First, the setup went exactly as promised. No surprises and no problems. Second, it was easy to begin streaming from my Netflix account. The TV picture and sound were perfect with no buffering and no problems in spite of my relatively slow 6 megabit/sec ATT&T; internet connection.It is a bit tedious to enter long strings of text with the remote but at least it works and is usable. Since I don't use a smart phone and I don't have an iPad3 this is my only option short of the new Amazon device that costs twice as much as the $50 Roku.One major comment on content -- I am very unhappy with the Netfilx streaming library. For example, there are huge numbers of major movies you cannot stream on Neflix e.g.\"The Godfather\" is unavailable for streaming on Netflix! On the other hand lots of TV shows that you can stream on Netflix are not available from Netflix as DVDs. BUT, practically EVERYTHING is available from Amazon for streaming over the Roku.For example, I found not only major movies like The Godfather on Amazon but very old movies like Earth v. The Flying Saucers, Them, They Live, This Island Earth, The Tall Blonde Man With One Brown Shoe and lots of others for one-time prices of usually $2.99 though major movies are priced at $3.99. I'm seriously beginning to wonder why I'm paying Netflix $16/month.", "verified": false, "helpfulness": "1/2", "author": "D. alexander \"DMA\""}, {"rating": 5.0, "review": "I love this because it is small and takes up on room.  It is easy to set up except for having to go back and forth to the computer to reigster it.", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Zechman"}, {"rating": 5.0, "review": "I enjoy all the channels, especially the PBS channel.  NASA, Public Radio, Bloomberg, Pandora, AEBN as an adult alternative to PPV on cable. Of course Amazon Prime, Nexflix, Crackle are popular but the magic of ROKU is the fun of diverse content offerings. Now if only Roku could get some public financing to run a C-span channel. Come to think of it lets petition the FCC to make it apart of their negotiation of the merger of Cable companies to provide that license for the public domain so that content can be made available as the public service it's intended to be!As for the device itself it's powered through the USB port on my HDTV and it's noticeably slower then my Roku 2  but I Love it and you will to! It keeps a very clean look to my system and i didn't pay the smart TV price, I just paid a smart price!", "verified": true, "helpfulness": "1/2", "author": "David Sandbeck \"hallgrd\""}, {"rating": 5.0, "review": "I got this for my birthday and I LOVE this little gadget!  I don’t have to worry about moving my Wii to different TVs, now I can just plug my Roku stick to whatever television I want to watch.The best part is that it is HD!", "verified": true, "helpfulness": "0/0", "author": "Tal"}, {"rating": 5.0, "review": "For months now I've had the Roku 3 player on my wish list, but $99 is a lot of money to replace my \"smart\" blu-ray player that worked much of the time. I've been using  my Sony blu-ray player to stream content, but its been struggling to work well ever since I got it. As a blu-ray player, it works great; streaming content, not so much. So when I saw the Roku stick priced at $50, and it didn't include a bunch of things I didn't want anyway, I was delighted. I'm still amazed that so much technology can be packed into such a small device, but here it is. You just stick the thing into the HDMI port on your TV, follow a few directions, and you're streaming content. This is one of those things that, if it were any easier to use, you'd be doing it wrong. And it's worked without any problems at all. I *highly recommend* this if you want an inexpensive streaming device, and fyi, it does come with batteries!", "verified": true, "helpfulness": "1/1", "author": "breed3134"}, {"rating": 5.0, "review": "I plugged this into the televison I have mounted on my home office wall. This is great because I dont see wires hanging and I didn'thave to replace my TV for a smart TV. Thanks Roku!", "verified": true, "helpfulness": "0/0", "author": "rivinlv"}, {"rating": 5.0, "review": "We have a Roku 3 in the living room, but this is a good option in a bedroom or spare room - especially since you can't see it when it's hidden behind the television.  Just love it.", "verified": false, "helpfulness": "0/0", "author": "Janeen Evenson"}, {"rating": 5.0, "review": "Couldn't ask for more:  portable like a chromecast, netflix, amazon, hulu plus, and slingplayer. It is everything I need and more. Great product. Way better than the competition", "verified": true, "helpfulness": "0/0", "author": "NM sling"}]