[{"rating": 1.0, "review": "Not very impressed.", "verified": true, "helpfulness": "0/1", "author": "Michael Mcgehee \"californiadreaming\""}, {"rating": 3.0, "review": "still working through the adding of channels; some that i want don't have access because still need cable to access of which i was trying to eliminate. we will see how it works out.", "verified": true, "helpfulness": "0/1", "author": "Cassie P."}, {"rating": 2.0, "review": "With the continued growth of chrome-cast enabled apps, Roku is growing more and more inferior for anyone who isn't completely devoid of either a smart phone or tablet. I'd take simple two-button beaming from a cell app to a Chomecast over the slow and convoluted menu's of a Roku any day, and would expect mom or grandma to have a far easier time with it too. If they want to stay relevant, they really need to accelerate their adoption of casting features. I'm loath to pay yet another 5 dollar fee to PLEX just to play my own local media when I could simply chromecast it from my already purchased Android version, or the numerous free android casting options.I thought having a remote and in-device GUI would make this device more accessible for the less techy members of my household, but it's proven nothing but a hassle.", "verified": true, "helpfulness": "0/0", "author": "Grimmers"}, {"rating": 4.0, "review": "Works, but mostly for old on-demand videos and premium content.", "verified": true, "helpfulness": "0/0", "author": "David Crawford"}, {"rating": 4.0, "review": "Works good but a lot of the free channels have to set up an acct or pay once in them.", "verified": true, "helpfulness": "0/0", "author": "justin harris"}, {"rating": 4.0, "review": "purchased for my daughter ... works almost as well as my Roku 3", "verified": true, "helpfulness": "0/0", "author": "sharptapp \"sharptapp\""}, {"rating": 5.0, "review": "I purchased this device and absolutely love it! I plugged it right into the television and it works perfectly. There is no box, wires or clutter.  It has all of the features that I love about Roku. One of the features that I love the most is that it plays You Tube videos! This device is easy to use and affordable.", "verified": true, "helpfulness": "0/0", "author": "Pet Wisdom \"Realistic reviews by a real person.\""}, {"rating": 5.0, "review": "Wonderful little product. Got it as a present for my cousin and to this day he's enjoying it to the max.", "verified": true, "helpfulness": "0/0", "author": "M. Diaz \"MADXXI\""}, {"rating": 5.0, "review": "Love it ! Saved me lots of money with out cable !", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Amerson"}, {"rating": 2.0, "review": "Interface runs excruciatingly slow and roku offers nothing new over my ps4 or smart tv apps. This must be for old people who still rock a boob tube.", "verified": true, "helpfulness": "0/0", "author": "BulletWithYourName \"SendingItYourWay\""}]