[{"rating": 5.0, "review": "Awesome easy fun I use this when I babysit works great", "verified": false, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "The product does what it announces and works great.  I got it so my mom could watch  Netflix. I give it 4 just because chromecast is even better.", "verified": true, "helpfulness": "0/0", "author": "Meseguer \"Meseguer\""}, {"rating": 4.0, "review": "Purchased for the folks for Netflix and Amazon Prime, which work like a charm.  Also utilizing with Plex Media Server for the home's media.  For the most part, Plex runs great but one can definitely notice a difference in quality.  Also, be aware that not all USB ports on televisions are created equal and the need to always keep the A/C adapter plugged in may be necessary (it comes with said adapter).  The device won't quite buffer as much as its bigger brothers, but unless you're watching an exceptionally long movie, you shouldn't notice.  As a counter point, that could possibly have to do with the horsepower of the computer running the PMS.  However, the Roku 2 doesn't struggle with movies and 3D.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "I am very impressed with this product.  It's easy to setup and because it's a HDMI stick, you don't need much room to house it.  My internet connection is not great but the ROKU works without any pauses.  Great product!", "verified": true, "helpfulness": "0/0", "author": "Chanetsa"}, {"rating": 5.0, "review": "Internet tv is such a better deal than cable or satalite and Roku is the best way to get it.", "verified": true, "helpfulness": "0/0", "author": "terry thiakos"}, {"rating": 1.0, "review": "I have a wall mounted Vizo with HDMI ports only on the back, not on the side. It would have fit, but this thing has to be plugged in to a power source and the cord goes in at the very end, making it too long. The need for an outside power supply makes it worthless for the wall mounted TV.", "verified": true, "helpfulness": "0/1", "author": "Raven Stone"}, {"rating": 5.0, "review": "This is much easier to configure than the units in the past.  And certainly so much smaller.  The HD 1080P quality is wonderful!  Not an issue, not a problem.  Easy to setup and connect with my other ROKU units.  I'd certainly buy this again or as a gift for someone else.", "verified": true, "helpfulness": "0/0", "author": "Stephan A. Cheney"}, {"rating": 5.0, "review": "Great device.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Felipestan"}, {"rating": 3.0, "review": "We have a Samsung smart TV, a Sony Blu Ray with apps, and now the Roku Stick for streaming. The Samsung TV apps often will not function, probably due to their servers being overloaded. Switching to Sony clears up the problem, so we know it's not the sources (Netflix, Hulu, etc.). We purchased the Roku to get access to Acorn TV and it does provide access, but it seems to have a number of bugs that make it inconvenient to use.1) The resume button doesn't always resume from where it stopped. Sometimes it takes you back to the beginning2) In the middle of playback, the player will \"reset\" and put us back to the menu.3) Most of these problems have occurred on Acorn, I don't know it's because of a problem with Acorn or Roku.", "verified": true, "helpfulness": "0/0", "author": "Dee N \"tonipaw\""}, {"rating": 5.0, "review": "Extremely easy to use.  I think it works better than the Roku 3 I have.", "verified": true, "helpfulness": "1/1", "author": "firecaptchic"}]