[{"rating": 5.0, "review": "Works really well, and an amazing number of stations (some better than others.)", "verified": true, "helpfulness": "0/0", "author": "J. Nettles"}, {"rating": 4.0, "review": "I like being able to change users on the Netflix. I was not able to on the original Roku box. The only 2 things that I may not like as much about the stick is it does seem to be slower than the Roku box I had before (Roku LT). Also, the original remotes do not have the pair/sync button. So the 2 extras I have will not work.", "verified": true, "helpfulness": "1/1", "author": "Mike"}, {"rating": 4.0, "review": "Great product, but the set up was a bit cumbersome.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works as good as the full model", "verified": true, "helpfulness": "0/0", "author": "Edward  J. Hakala"}, {"rating": 2.0, "review": "the content is interesting, but losing Amazon and Netflix makes this pretty worthless outside the US (where those services are now also available).", "verified": true, "helpfulness": "0/0", "author": "J. F. DiGiovanna"}, {"rating": 3.0, "review": "Works fine though wish I could access youtube also and watch stuff off the internet", "verified": true, "helpfulness": "0/0", "author": "Elf Queen"}, {"rating": 1.0, "review": "From day 1, it had a poor performance. It kept stalling and had poor image quality. I changed with a brand new roku stick from best buy and that worked fine.", "verified": true, "helpfulness": "0/1", "author": "Rishi Agarwal"}, {"rating": 2.0, "review": "CANNOT BE TURNED OFF AND FREEZES UP TOO OFTEN.", "verified": true, "helpfulness": "0/1", "author": "Hawkca"}, {"rating": 5.0, "review": "Very happy with my product", "verified": true, "helpfulness": "0/1", "author": "Amber Glass"}, {"rating": 4.0, "review": "Product arrived on time.  Got this for my kids as a Christmas present.  i thought I would give a review after a couple of months of use.The Roku Streaming stick was very easy to plug in.  One of the problems during the initial set up was pairing the Roku remote to the streaming stick.  The Roku remote would lose pairing with the stick after just a few minutes. I ended up having to download the Roku app to my phone (to allow my phone to act as a Roku remote) to complete the initial setup.  This was a little frustrating and time consuming.  After completing the setup, I was able to scroll through the settings with my Roku app and pair the remote.  I was told it had something to do with the firmware and this issue is now resolved.  The remote has been working fine ever since the first little snag.The wireless connection is very good.  I have my router on the main floor of the house the bedroom the Roku is located is on the second level.  The signal stays strong and has little to no pauses during use.The menus are user friendly and adding/deleting channels is simple.  The search function works well if you are looking for a particular channel.Roku has a lot of free content, but some of the content (Netflix, Hulu, etc.) will require a paid subscription.  Some channels also require a cable subscription to enjoy their content (FX, ESPN in particular).  So, if you are a cable cutter, just be aware.After the initial setup problem, this unit has been working flawlessly.  Great signal strength, and good channel selections.  Plenty of content for those interested in cable cutting.Update:  7/1/15  Still no problems with the remote.  Everything is working as it should be.", "verified": false, "helpfulness": "0/0", "author": "A. Matthews"}]