[{"rating": 4.0, "review": "We have 2 Roku Lt models and decided to upgrade one of them to the stick.  It works well and a great thing is no extra boxes sitting under the TV now!", "verified": true, "helpfulness": "0/0", "author": "J. Cook"}, {"rating": 3.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "Keron Kerwood"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Azahel"}, {"rating": 4.0, "review": "This is so cool, all the movies and tv shows you can watch for free.", "verified": true, "helpfulness": "0/0", "author": "Rhonda PW \"Rhonda\""}, {"rating": 5.0, "review": "Works great and delivery was speedy.", "verified": true, "helpfulness": "0/0", "author": "Joanna Raines"}, {"rating": 1.0, "review": "I spent about an hour trying to \"pair\" the remote with the stick. Tried every way of mashing buttons, new batteries, etc. to no avail. I'll spend the dough on a Roku 3, this one goes back.", "verified": false, "helpfulness": "0/0", "author": "Scott Grunert"}, {"rating": 4.0, "review": "The stick works just like the regular Roku. My Apps automatically loaded to this one. It works great.The screen mirroring feature says beta. My galaxy s5 will connect most of the time. Sometimes it takes multiple tries. The video is choppy sometimes. My Galaxy Tab will not connect. When they fix the issues, then maybe another star.", "verified": true, "helpfulness": "0/0", "author": "D. Kozdras"}, {"rating": 3.0, "review": "I have been using a this device for the last two months and I can watch shows and use the apps...eventually. Sometimes Hulu will not load the shows and I have to restart the app, sometimes Netflix takes forever to load. I do not think it is my internet connection but I am not sure. This device loses one whole star because of the remote control. I have basically thrown it in the trash because I had to reset the device three times a day just to get the remote to reconnect. I use my iPhone as a remote now which can be annoying. Beaing able to move it to deifferent TVs, especially when traveling is great. The Roku platform itself is great and maybe the other Roku items will be more reliable but I am not completely sold on the streaming stick.", "verified": false, "helpfulness": "0/0", "author": "Table Top Games Dad"}, {"rating": 1.0, "review": "This is the worst roku device made. I have a roku HD and love it. This device is extremely slow and laggy.  Do not waste your money on this, spend a little extra and get a roku HD or newer.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 1.0, "review": "Constantly loading. I have 3 other Rokus, 2 of the (2's) and one 3. never any problems out of them but the stick just doesn't have to processing capabilities I suppose.. literally watch 3 minutes or less and may load for 10, VERY ANNOYING!", "verified": true, "helpfulness": "0/0", "author": "Chris Casey"}]