[{"rating": 5.0, "review": "Easy! Just plug in and following simple directions to turn regular tv into streaming tv. After setting ours up my mom bought 3 for her house.", "verified": true, "helpfulness": "0/0", "author": "LarryLamar Courtney"}, {"rating": 5.0, "review": "We already have a Roku 3 in the living room. I received the Streaming Stick today and installed it on the bedroom tv. It couldn't have been easier. About 5-6 minutes total, including the updating the software and registering it on the computer. Perfect picture! It takes a little bit longer to boot up when turned on as an example to Netflix, but from then on it's every bit as fast as our Roku 3. This is a perfect example of modern technology done right!", "verified": true, "helpfulness": "0/0", "author": "Firebottle"}, {"rating": 4.0, "review": "After a couple of days I started having sync issues with the audio. Roku support suggested that my internet speed was slow. They suggested some speed tests from speakeasy.net. I'm a post production media engineer for television and film and I have an excellent cable connection at my house generally ranging from a low of 15Mbps to a high of 75Mbps. Testing with a Macbook showed 23Mbps, but I was still having sync issues. So I put on my engineer hat and used the iStumbler app to look at the quality of the signals on the various devices in the house. Although all the PC's were performing well, the Roku had a high noise level when compared to signal level, AKA signal to noise ratio (SNR). Luckily I was rearranging the house and was able to get the TV closer to the Airport Extreme router ( 23ft vs 8ft ) and that solved sync issue but picture quality was low. I switched the broadcast channel on the router to minimize interference from other nearby networks and had the Roku join the 5Ghz network exclusively, as it was defaulting to the narrower bandwidth 2.4Ghz side. Now everything is good with the world and I'm getting excellent picture and audio quality.Remember, the more errors present in your signal the slower and poorer the quality of your audio and video will be.So here's a recap:1. Move as close to the router as possible (the Roku reception isn't as robust as your PC's)2. Use iStumbler or a similar app to see how well the Roku is actually performing (SNR)3. Use iStumbler or a similar app to see if there are other nearby networks overlapping with your Wifi channel and causing interference4. Switch router to exclusively join your 5Ghz network (if possible). The 5Ghz network has more bandwidth but doesn't transmit as far", "verified": true, "helpfulness": "1/2", "author": "Curtis Gomez"}, {"rating": 2.0, "review": "Having owned a Roku3 in the past, I was already familiar with the Roku UI.  It was that UI that made me unhappy with the Roku.  I replaced that device with the chromecast several months ago and have very happy with it.  Lately, some apps and services have been releasing support for the Roku but have been slower to support the Chromecast.  So, I picked up the Roku stick to see if things had improved.  They have not.On a quick apples-to-apples comparison, I \"cast\" a plex video to the Roku and to the Chromecast.  That means using an external client to play video on the stick.  The Roku took nearly a full minute to begin streaming, where the Chromecast took about 10 seconds.  I repeated the test with netflix and hulu and had about the same experience.  The Roku is significantly slower.As for the UI, the Roku is extremely limited from a developer's perspective.  Many devs have done very well within the limitations, but there is only so much that can be done.  As a contrast, using external clients for the various apps on an android or IOS device provides a much richer experience.  While this can be done with the Roku stick (in most cases), the fact that the stick takes 5-8 times longer to begin playing is a real deal breaker.TL;DR: the biggest thing the Roku really has going for it is that it has a menu-driven UI.  But, that UI is not very good.  When using an extermal client, the Roku experience is extremely slow.  The only real pro is somewhat better support for services like amazon and aereo.", "verified": true, "helpfulness": "2/3", "author": "Joshua M Dann"}, {"rating": 4.0, "review": "I purchased this item as I slowly move forward in my attempt to cut the cord and ditch cable. Picture quality is great, it's easy to use, and I've been able to link it to many of my accounts (or friends/family's accounts) but beware! If you're looking to use this as a way to add HBO GO and you have access to a Comcast account this will not work! Comcast doesn't allow HBO GO to be used on streaming devices for fear that customers will switch to using these rather than adding extra cable boxes to their TV for $10 per month.Found a relative with Verizon who shared the accounts. Everything working great. Just beware of Comcast, their treachery knows no limits.", "verified": true, "helpfulness": "0/1", "author": "NW DC"}, {"rating": 1.0, "review": "Get roku 3 instead of this. I ha e not had any trouble with roku 3 but the streaming stick works half the time.", "verified": true, "helpfulness": "1/3", "author": "Gina"}, {"rating": 5.0, "review": "lovin It, cut the cable cord, should of done it sooner, use it for free channels news and netflix, I still get xfinity content via web", "verified": true, "helpfulness": "0/0", "author": "Richard A. Goldsmith \"python134r\""}, {"rating": 5.0, "review": "Great would love to see some suspend on power down as boot time could be faster.  Instead leaving powered on at home page but concerned about burnout.", "verified": true, "helpfulness": "0/0", "author": "Steve Cacace"}, {"rating": 5.0, "review": "It works great - no glitches, no pausing. We totally love it. It's nice not to have to do the HDMI cord hook-up every time we want to watch Amazon Prime or Netflix etc. The remote makes it even easier. I would highly recommend this product. A great value and great way to entertain when friends, family are over.", "verified": true, "helpfulness": "0/0", "author": "SHEILA CHANG"}, {"rating": 5.0, "review": "This has made a world of difference for me since I cancelled my satellite service.  I can now purchase some and some free apps to view some of the same programs offered on satellite. I dropped a satellite bill from $80.00 to $20.00 month with different apps. I would definately reccommend this for anyone who has regular tv. At least this way you can see the programs that you want to see.", "verified": true, "helpfulness": "0/0", "author": "Linda"}]