[{"rating": 5.0, "review": "Fantastic! Love the functionality of this one over the roku 2. The channels are great. Own 2 and would recommend to everyone.", "verified": true, "helpfulness": "0/0", "author": "Darlene S"}, {"rating": 5.0, "review": "I especially love the feature when you're watching a TV series...the next episode starts automatically after the first, I don't have to touch the remote!", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 4.0, "review": "We enjoy being able to see programs and series with the Roku. Our son recommended it to us and we haven't been disappointed.", "verified": true, "helpfulness": "0/0", "author": "Martha"}, {"rating": 1.0, "review": "Would not work without resetting it each time. Constantly locked up while changing modes. Nice when It worked though! Sent back before wife smashed it against the wall!", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 3.0, "review": "This stick is nice, and because it fits in the HDMI behind the TV it is out of sight. We use an earlier version of Roku which sits below the TV.I purchased this as a gift for someone else, and they had problems with the remote control functioning.  I ordered a replacement, and we swapped out the remote, then returned the extra.  Thank you Amazon for being so good about returns.Now, however, there are intermittent problems with the replacement remote.  Some times it freezes up.", "verified": true, "helpfulness": "0/0", "author": "CAPT Bob"}, {"rating": 1.0, "review": "This stick hangs up every day and you need to constantly restart it. Sick of it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Totally thrilled with my purchase. Super fast delivery and great CS. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Lady Trent \"Twinnings\""}, {"rating": 1.0, "review": "Worthless, and support even worse. I gave it one star because that was the lowest rating. If I could have given it a minus, I would have.", "verified": true, "helpfulness": "0/0", "author": "Ronald E. Mack"}, {"rating": 1.0, "review": "Roku 3500R Streaming Stick (HDMI), I got this product in April, 2015.  It is very slow, constantly frozen.  I thought it might be the battery problem.  But I have changed at least 4 sets of new battery.  Now it is completely dead.", "verified": true, "helpfulness": "0/0", "author": "D"}, {"rating": 5.0, "review": "So the Roku offers Netflix and so much more. Admittedly, I only use it for Netflix but I do like the option.  This is so much better than having to connect my phone to the TV everytime I want to watch something on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Casey"}]