[{"rating": 5.0, "review": "Perfect. Works as expected. Great little device. No connection issues.", "verified": true, "helpfulness": "0/0", "author": "Barry Shapiro"}, {"rating": 2.0, "review": "I find the stick very sluggish in its responsiveness relative to the older Roku 2 I have on my other TV. Additionally, the AC adapter to power the unit other than through the TV (necessary unless you want to wait for the unit to reboot and load for 40 seconds every time you turn off your TV) died within 3 days. Finally, location of the microUSB plug on the streaming stick (on the opposite end of the HDMI port) is poor and ultimately results in the unit being longer than advertised and so, this unit (or the USB wire) stick out from the side of my TV on an otherwise perfectly crisp and visible wire-free set up. Despite this, the Roku software itself is still top notch and if anything, I would return this to trade up for a full Roku 3.", "verified": true, "helpfulness": "0/0", "author": "S. Sheinfeld"}, {"rating": 2.0, "review": "Horrible, simply horrible - do not let the allure of apps entice you to buy this waste of money.1) - Set-up was a pain.  Took 15 minutes to resolve the unable to connect issues.  I had to manually add the MAC address, and even after that, it drops connectively.  No other device in my house does this2)  Horrible website to set up - please, you need a credit card to order FREE apps.  Once you add your apps, you are push to use the device to add more.3)  Remote - Did I read fisher price on this, or is this just a fake remote?  This remote has not value.  Buttons stick which forces you to miss your selection, range is aweful, and the build quality is non-existent.4) 480P digitized looking background on a 1080P screen???  The UI of this device needs improvement.  When you purposely want high def TV, you expect a high def UI.  I changed the settings to 1080P, played with the themes, nothing.I bought this device because I love my chromecast device, but wanted to make it easier for the family to watch shows without casting.  This device missed the mark and more5)  Missed one - Rendering time... welcome to watching paint dry.  Chromecast vs Roku Stick... wow, chromecast blows this device away.I sooo wanted this device to live up to the hype, but back to the store you go... next on the test list, Amazon Fire devices.", "verified": false, "helpfulness": "1/2", "author": "Analysis Paralysis"}, {"rating": 5.0, "review": "Bye bye sat bills", "verified": true, "helpfulness": "0/0", "author": "diana cd jacobs"}, {"rating": 5.0, "review": "Like the streaming stick so much better than the box player.", "verified": true, "helpfulness": "0/0", "author": "F B R"}, {"rating": 4.0, "review": "Sorry not for me, but seller delivered as expected.  Content wasn't as expected, but interface did work okay.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Pheeson Liaw"}, {"rating": 2.0, "review": "not what I thought it would be, returned it.  hard to set up.", "verified": true, "helpfulness": "0/0", "author": "annie62"}, {"rating": 5.0, "review": "Works great! Have one of every TV!", "verified": true, "helpfulness": "0/0", "author": "M. Pimentel"}, {"rating": 4.0, "review": "Remote loses connectivity with the Roku. Must take out batteries to make it work again. Called Roku customer service and spent an hour on the phone with them resetting various things. It's better since then, but still does it occasionally.", "verified": true, "helpfulness": "0/0", "author": "Geoff T."}]