[{"rating": 4.0, "review": "The streaming stick works great however it is somewhat slow to startup and freezes from time to time", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 3.0, "review": "This is a decent unit, but it behaves like it was designed by grandma. It's easy enough to install and operate, but it balks continuously. It get a lot of errors saying it is not hooked up the router, which means I have to disconnect it every few days and reboot it. It is furiously slow to buffer, and on some days it never plays through. Don't know who to blame, Roku or Time-Warner cable, which has a terrible reputation in this area. However, since I don't have cable tv and I can watch Netflix and Amazon Prime with it, I find it okay. I don't know if there are better units out there, but this one is just okay....", "verified": true, "helpfulness": "0/0", "author": "RMB"}, {"rating": 2.0, "review": "I am experiencing a freeze up / reconnection issue, and the remote fails to work now. This was purchased the 1st week of January 2015. I have several Rokus including another stick and they all work fine. The reason I purchased this stick was to replace the old original Roku box which some of the programs I watch did not support any longer. It is in the same place as the old one so it should not have this issue. I am returning it and will go with the Roku 3. If this was my first Roku purchase I would give it 1 star, however I have had excellent success with all others in my house, and am sure this was one of those lemons we all get eventually.", "verified": true, "helpfulness": "2/3", "author": "Eric Thomas"}, {"rating": 5.0, "review": "Can't say enough good things about how easy this is to use and how great it works.", "verified": true, "helpfulness": "0/0", "author": "Carwin1"}, {"rating": 2.0, "review": "As pointed out in other reviews,(a) the device is extremely sluggish (under-powered probably)(b) the remote control works intermittently(c) the firmware loaded at the factory could not connect to one of our access points (which otherwise works with 30 devices, e.g. phones, tablets, latpops, printers, etc...)Our Roku 1 has been working a lot better.", "verified": true, "helpfulness": "0/0", "author": "Pter"}, {"rating": 5.0, "review": "only flaw was with tv which required an adapter to come out at correct angle", "verified": true, "helpfulness": "0/0", "author": "gordon w edwards"}, {"rating": 4.0, "review": "Works great so far. Uses cell phone as remote for TV. No hardwire option.", "verified": true, "helpfulness": "0/0", "author": "Michael Morrow \"tennisnut\""}, {"rating": 5.0, "review": ".Sucked until I figured out the micro mini usb cord they supplied was junk (also won't charge my phone). I was getting purple blank screens trying to load any video. Instant fix popping in my cell phone charger.  Streams &navigates; as great as my roku 3.", "verified": false, "helpfulness": "0/0", "author": "convoygal"}, {"rating": 1.0, "review": "I just spend 3 hours trying to get this stupid stick to work and now I'm returning it.  I waited 35 minutes to for Roku's support desk, then spent another hour working with the \"specialist\" who, in the end, passed the buck and blamed our ISP for why the remote and/or device isn't working.  I tried everything!  I downloaded the app, but the app kept telling me to turn on the stick.  The remote stopped working multiple times.  Nothing worked.  I really wish I hadn't wasted an entire evening on this product.", "verified": false, "helpfulness": "0/0", "author": "Emily"}, {"rating": 3.0, "review": "Purchased 2 of these at the same time.  While the box was the same, they must have had different build dates because the remotes were different.  One had a blockbuster button and the other had a \"Rdio\" button on it.  The newer build is the one with the \"Rdio\" button on it and it was defective.  It would not accept a software upgrade from the moment I first used it.  It went on working without the upgrade, but then another upgrade became available and it wouldn't install it either and this failure froze the system and required a hard reset.  This lost all of my hard work in selecting apps and setting them up with my passwords.  I contacted customer support at ROKU and they said that since one was working and the other wasn't that this was clearly a hardware issue and I needed to get a replacement from my retailer.  This must be a bigger issue because I bought these 2 from Amazon and a third from a different retailer.  The third one was also the new build with the \"rdio\" button on the remote and it had the exact same problem.  Roku Customer Support told me to take both of them back.  I will be looking for an older version when I get replacements.  Clearly there is a problem here that has not been fully resolved.", "verified": true, "helpfulness": "0/0", "author": "Shawn R."}]