[{"rating": 5.0, "review": "This is much easier to use and has more channels than ChromeCast. I would recommend buying this unit at a great price", "verified": true, "helpfulness": "0/0", "author": "Ted"}, {"rating": 5.0, "review": "I have a Roku 2 and a Roku 3 but they are \"wired\".  My big screen TV is mounted on the wall and I didn't want wires showing.  Roku 3500R Streaming Stick is THE answer.  Plug it into my HDMI port on the back of the TV and USB short cord to USB port for power, and WAAALA, perfect.  Thanks Roku keep on innovating.", "verified": true, "helpfulness": "4/4", "author": "Tommie J Vaughn"}, {"rating": 4.0, "review": "We bought this one for our wall mounted bedroom tv to eliminate wires and keep a clean look. Works just as well and fast as my Roku 3. I only wish it had the wrist strap and it would be 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Brad Green"}, {"rating": 5.0, "review": "Roku 3500 stick is awesome!  Took me all of 10 minutes to setup.  This is a real nice product giving me the full 1080p I was looking for our bedroom television.  Product high quality, packaged nicely for safe transportation and would recommend this product to anyone.  Price for this product is reasonable and am happy with the Roku Streaming Stick.", "verified": true, "helpfulness": "0/0", "author": "Mark E. Jolly"}, {"rating": 1.0, "review": "I keep trying to use this... talked to customer support... did factory reset... it has a problem connecting via hdmi and requires continuous resetting... don't normally write complaints but this thing is so bad, it should be withdrawn from the market... just awful...it works only occasionally... it requires continuous resets... I never tried chromecast but I think this stick was produced to rival chromecast... this is awful... chromecast works ( I think )... stay away from roku streaming stick - other roku players work well and I have 2...", "verified": true, "helpfulness": "2/5", "author": "Walter Durkin"}, {"rating": 3.0, "review": "I returned the product before even trying it. Once I opened the box I saw there was a power cord that, if plugged in to the end of the stick, would be hanging out the side of the tv and down the front of the wall, defeating the purpose of why I ordered it. We subsequently ran our older version Roku cord behind the wall and it works just fine.", "verified": true, "helpfulness": "0/0", "author": "C. Robinson"}, {"rating": 3.0, "review": "The unit lacks responding quickly to streaming commands.My Roku 2 and 3 have greater speed.Will probably return and replace with new amazon model.JRG", "verified": true, "helpfulness": "0/0", "author": "Richard G."}, {"rating": 3.0, "review": "The 3500R version differs from the previous streaming stick since it has a regular HDMI interface, and not the MHL (powered/controlled) interface. The 3500R works with several of the TVs in the office - getting it's power from the TV's USB port (using the supplied cable). However, using the TV's USB power has a distinct issue - when the TV is off, so is the Roku. Therefore, when you want to watch some, say, Netflix, you have to wait for the Roku to power up and associate with the WiFi - which takes a little over a minute.Since the remote uses a WiFi connection, and is sharing the same radio that the Roku is using for streaming media, the responsiveness of the remote is slow. In comparison, the MHL predecessor of this stick responded faster to the hosts remote control inputs.Unlike the Google Chromecast, the Roku 3500R does not come with a little HDMI extension cord - which means that it may block adjacent HDMI ports when plugged in to the TV's HDMI port.For the lack of wires and that it's essentially hidden behind the TV is great - however, I think that the 'hockey puck' Roku 3 (and it's variants) are better in terms of remote control latency, and connectivity.", "verified": true, "helpfulness": "0/0", "author": "A. Robinson"}, {"rating": 4.0, "review": "It works great and fast and easy to setup.Small and works with the thin flat screen.. Just wish it was as fast as my Roku 1", "verified": true, "helpfulness": "0/0", "author": "manicmndy"}, {"rating": 5.0, "review": "A few months ago, our reliable cable/modem gave up the ghost.  Until that event, my family had been watching Netflix (and enjoying some other streaming services, such as Pandora) via our two Blu-Ray DVD players.  After I bought a new modem (trying three, different ones, actually), our Blu-Ray players just couldn't stream without \"rebuffering\" constantly.  It was a headache to spend twenty minutes of a sixty-minute episode sitting around while the Blu-Ray players choked on the stream.  I read a review someone else had written about the Roku 3 and decided to give it a try.  BINGO!  Suddenly, the streaming was coming in non-stop (there are a few instances where we have a buffering issue, but only for a few seconds and nothing like what was happening with the DVD players), reacted faster, and had a much better user interface.  Shucks, the Roku 3 remote even came with an earplug jack that mutes the tv when my wife watches her infinite recordings of reality tv shows while I'm trying to sleep!  My next move was to buy the \"Roku Streaming Stick,\" for several reasons.  We have a \"guest nook\" in our house and it'd be nice to be able to move the stick from our bedroom tv to the nook when guests visit and want to look at YouTube, let's say.  My wife's job calls her to travel, and I figured she could take the stick along, hook into WiFi, and whittle away time watching our Netflix account offerings in a motel instead of being limited to their programming.  The Roku Streaming Stick has been awesome.  Sure, it doesn't have the remote with the headphone jack nor the buttons to play \"Angry Birds.\"  Big whoopee!  (At the time of my review, buying the \"Enhanced Gaming Remote\" separately won't bypass that problem of not being able to play the game.  It won't work with the HDMI streaming stick.)  I bought a $10 wireless headset, with a 100' range, and solved the issue of wanting a way for my wife to hear the audio while I count sheep.  The Roku 3500R Streaming Stick (HDMI, early-2014 version) may be a TAD slower in logging into the Netflix account, but it's not like it takes so long that I can brush my teeth and count the three hairs left on my head.  Like its bigger sibling, the twice-as-expensive Roku 3, I get a 1080 signal (after about thirty seconds of playing a selection on Netflix) and have that easy-to-navigate interface.  There are a couple of drawbacks, though, that a prospective buyer needs to know.  First of all, if you are like our family and have seven or eight remotes you've programmed into a universal remote, don't expect to add the Roku unit into the programming of the universal remote.  Most remotes operate using IR (infrared) or RF (radio frequency) to fire their signals to a device.  Roku uses your cable/modem (WiFi), so it can't be programmed on any of the five universal remotes I've bought since purchasing the stick.  (I even have a Logitech Harmony remote, that cost hundreds of dollars, that couldn't do it.)  Secondly, when people say that the stick is \"about the size of a small jump drive,\" do NOT believe that.  The Roku stick I bought is a half-inch thick, 1.1 inches wide, and a troublesome 3.1\" long.  (That's mere tenths of an inch bigger than the Chromecast stick, which is wider than the Roku stick but also shorter, at 2.8 inches.)  BE AWARE, therefore, to measure your spaces coming out of your TV's HDMI ports BEFORE you buy the Roku stick.  In our case, there isn't enough room between the wall and the jack to plug in the Roku stick.  I bought a $5 adapter that re-routes the HDMI port to the side of the tv instead of the back.  But, the Roku stick now sticks out mere millimeters around the end of the television and its cable bends back sharply.  I'll have to get a short HDMI cable to hide the Roku stick and keep the cable on the Roku from bending to the point of breaking.  Other than those two drawbacks, this is a double thumbs-up purchase, at least for our family.  At half the price of the Roku 3 and the same quality video, you can't go wrong.", "verified": true, "helpfulness": "1/1", "author": "Darrell L Schultz"}]