[{"rating": 5.0, "review": "Fast delivery, worked perfect", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Gale"}, {"rating": 2.0, "review": "Set up was fairly simple. Interface was good. But when the video started I got sound and a purple screen with no picture.  Contacted their customer service, having to wait over 45 minutes for the live chat, and they simply said it won't work on that tv. The HDMI handshake was not occurring. The TV I was attempting to use it on is a Sharp Aquos that is about 3 years old.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 1.0, "review": "Kept freezing while watching different shows, ended up returning it.", "verified": true, "helpfulness": "0/0", "author": "Julie Pulu"}, {"rating": 4.0, "review": "Excellent product but one little problem: if you're going to use it outside US or Canada just prepare to be disappointed because there is a lot of unavailable channels, including Netflix!!!", "verified": true, "helpfulness": "0/0", "author": "Robert \"Roberto Santana\""}, {"rating": 5.0, "review": "I am extremely amazed with this. It works awesome! I was expecting to have to use my mobile hotspot because my computer doesn't pick up the internet in my bedroom but this did! Thank you SO Much! Plus this seller shipped EXTREMELY fast!", "verified": true, "helpfulness": "0/0", "author": "Aly"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 1.0, "review": "This thing crapped out after less than a month of use. I think what's happened is that it's so cheaply constructed and gets quite hot so that the materials break down in short order. STAY AWAY!", "verified": true, "helpfulness": "0/0", "author": "Winston E. Lee"}, {"rating": 5.0, "review": "I love my Roku stick!", "verified": true, "helpfulness": "0/0", "author": "Aunt-C"}, {"rating": 4.0, "review": "I'm having loads of fun catching up on the Korean historical dramas I've missed since my satellite provider dropped KBS and would have rated this product 5 stars, if not for one annoying glitch.  Occasionally the screen freezes, even though there is still a good wifi connection.  I would have blamed this on buying a refurbished unit but then found it's a common complaint, even with a brand new unit.  Luckily, I found a quick fix online and will share.  If you get no response after hitting every button on the remote and you know you're still online, do this:  Remove the batteries from the remote.  Unplug the power from the stick, wait 5 seconds and plug back in.  When the bouncing 'ROKU' screen appears, replace the batteries in the remote.  Press the reset button in the battery cavity and hold for 5 seconds.  The system will then reboot.  This is much better than throwing the remote across the room and burning your partner's ears with a stream of profanities.", "verified": true, "helpfulness": "0/0", "author": "Phyllis"}, {"rating": 1.0, "review": "Absolutely livid. Roku stick will not work. Contacted Roku support on January 22nd. It is now February 12th and they STILL have not resolved the issue. Customer support is practically non-existent. Has been taking 2 or more days for them to respond and half the time, they repeat what they wanted me to try the last time. Very unimpressed!!", "verified": true, "helpfulness": "0/0", "author": "Diane R. Stoudt"}]