[{"rating": 2.0, "review": "the controler did not work", "verified": true, "helpfulness": "0/0", "author": "patrick b brantner"}, {"rating": 5.0, "review": "Incredibly easy set up, works like a charm. Shop around though. After I ordered it from Amazon, I saw it selling for less at a couple of local stores.This is a first step toward cutting the cord with cable.", "verified": true, "helpfulness": "0/0", "author": "Anne"}, {"rating": 5.0, "review": "Was on time and exactly what I wanted.", "verified": true, "helpfulness": "0/0", "author": "John a"}, {"rating": 3.0, "review": "U have to pay for all programs", "verified": true, "helpfulness": "0/0", "author": "merdella bartley"}, {"rating": 5.0, "review": "Love Roku, works very well. Arrived very quickly.", "verified": true, "helpfulness": "0/0", "author": "MPA"}, {"rating": 5.0, "review": "We absolutely love this! For the first time in 30 years I'm thinking of cutting cable. We used to (barely) watch Netflix because using it through the Wii was so clunky. This stick and the remote that accompanies it makes watching your favorite streaming services effortless. Who knew I had Pandora? :)", "verified": true, "helpfulness": "0/0", "author": "Life Out Loud \"Author: \"Life Out Loud\"\""}, {"rating": 1.0, "review": "Only 56% gave this item 5 stars I gave it one star. Here's why.None of the cute pictures show the thing installed. I installed it in an HDMI port, nothing happened. So as a last resort, I looked in the box for instructions. Along with those, I found a couple more pieces of hardware. There is an AC plug and a cable that attaches to it, and into a wall outlet. The other end of the cable attaches to the stick itself.NO WHERE DO THE PICTURES INDICATE THAT A CORD MUST GO FROM THIS STICK TO A WALL OUTLET.The problem is that many new flat screens are made to hang on the wall. To help expedite that, they build the HDMI ports parallel with the tv back, but inset. It was a major issue to get this plugged in, when the end of it had a cord attached. I made it, but barely.", "verified": true, "helpfulness": "0/0", "author": "SilverGhost"}, {"rating": 1.0, "review": "Bought this item as a gift for my mom. We had a problem with the remote immediately. It just wouldn't work. So we replaced the batteries. Then it worked for a couple days and stopped again. We tried replacing the batteries again. But this time it did no good. The remote is dead.I personally have a different model roku streaming stick and it works fine (other than overheating sometimes and freezing after long periods of use).  But this 3500R isn't worth buying. VERY cheaply made. Don't waste your money.", "verified": true, "helpfulness": "0/0", "author": "WIRed Mom"}, {"rating": 5.0, "review": "Love the Roku.. I own 3 and actually all were purchased refurbished. They work perfectly. I can't wait till the new ones come out so I can upgrade to a faster processor. The sticks are defiantly worth the money. You won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Brian D \"Video Rater\""}, {"rating": 4.0, "review": "there are a few issues with having to unplug and plug back in to get NetFlix to load properly, but overall I'd recommend it", "verified": true, "helpfulness": "0/0", "author": "Dawn"}]