[{"rating": 3.0, "review": "I bought this streaming stick to put on a TV in our workout room. It's great. Easy to set up and program. It's handy if you have a laptop nearby while setting it up as it requires entry of verification codes for your streaming services and creation of a Roku account, if you don't already have one. I can now watch Netflix and Amazon prime video while on the treadmill. It forgot my account credentials once, but I think that was a glitch as the stick remembered them later. The interface is easy enough to use. The remote is easy to use and I like the pre-programmed Netflix and Amazon buttons. I thought about buying a Chromecast, but I'm happy that I bought the Roku instead.Update: Seems the stick forgets login credentials for various services, like Amazon video, etc. So far it seems to remember my Netflix credentials, but I subscribe to other channels too and it is quite irritating to have to go reauthenticate at a computer when it can't seem to remember it is an authorized device.", "verified": true, "helpfulness": "3/3", "author": "J.D. Werner"}, {"rating": 5.0, "review": "Great device to make your TV smart! Watch Netflix with ease", "verified": false, "helpfulness": "0/0", "author": "Shopomaha"}, {"rating": 5.0, "review": "obsessed with this thing. thanks to my tech savy bf for showing me the ways of the non cable tv world", "verified": true, "helpfulness": "1/1", "author": "kate"}, {"rating": 5.0, "review": "Love the Roku stick! I also own an Apple TV, but its now just an \"Airplay box\".Cons:Remote isn't as responsive as an IR remoteInterface is very confusing, especially if you're used to Apple TVPros:Too many too list! It just feels more open of an environment than Apple TV. If there is something I want it to do, most likely there is a way to do it. Having Plex is a HUGE reason for buying this. But it also works well with my Western Digital MyCloud. Its fun watching videos from my phone show up on my TV! A lot of apps, and most likely more to come. Why Apple doesn't allow third party app development is beyond me! At this price, just using it for Netflix or Youtube is worth it.Note: This stick plugs directly into an HDMI port. Two of my ports are right next to each other so I loose two ports to accommodate the stick. Check to see if you have room or get an extension cord. I didn't consider this before buying, still looking for solution.", "verified": true, "helpfulness": "0/0", "author": "Sean D."}, {"rating": 5.0, "review": "love this Roku stick plug it in and it worked with no problem", "verified": true, "helpfulness": "0/0", "author": "bre"}, {"rating": 3.0, "review": "It freezes a lot when it's not been in use for a few days.", "verified": true, "helpfulness": "1/1", "author": "A. Blalock"}, {"rating": 4.0, "review": "A+ ...good to have in a pinch.", "verified": true, "helpfulness": "0/0", "author": "Russell B."}, {"rating": 4.0, "review": "Good buy for streaming.  It sometimes freezes. We have to take the stick out then put it back in. Overall I'm satisfied.", "verified": true, "helpfulness": "0/0", "author": "Regina S."}, {"rating": 5.0, "review": "Very easy to setup.  Excellent way to reduce your tie to the cable company.  Very reasonably priced.  Many more choices then any of the competition.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If you are looking for a way to stream Netflix, it doesn't get much easier than this.  The product arrived well packaged with easy set-up instructions.  Once you get signed into your accounts for the first time you can be watching really quick.", "verified": true, "helpfulness": "0/0", "author": "WildCardin"}]