[{"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "david"}, {"rating": 5.0, "review": "Both work great.", "verified": true, "helpfulness": "0/0", "author": "Sandra L. Thorp"}, {"rating": 5.0, "review": "Don't know how I've lived this long without it, quick service.", "verified": true, "helpfulness": "0/0", "author": "Susan  Pierson"}, {"rating": 5.0, "review": "Great product! I have had it for a couple months now and I have had no issues whatsoever.If your HDMI port is on the back of the tv, I HIGHLY RECCOMEND you purchase an L shaped (90 degree) adapter.", "verified": true, "helpfulness": "0/0", "author": "nerdstatuss1124"}, {"rating": 4.0, "review": "Product works well and it is fairly reliable.  The only problem I have with it is the delayed response when using the remote; it takes a few presses of any button to see any reaction on-screen.  Otherwise, every application included works as advertised and I have yet to experience any failures.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Rodriguez"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Kee Yip"}, {"rating": 3.0, "review": "I like the tons of channels available from this stick. Would give it a 5 star if upgrade is available to speed up the response.", "verified": true, "helpfulness": "0/0", "author": "bong"}, {"rating": 2.0, "review": "It worked great for 6 months & suddenly stopped connecting to internet. Called Roku and was advised I would be charged $9.99 to speak to tech after holding for 15 min. I've done every version of resets except under settings on the Roku menu because I CAN'T ACCESS IT so I'm trying unplugging the entire thing for hours to see if that does anything. Good luck if you purchase one.", "verified": true, "helpfulness": "0/0", "author": "S. C. Drinkard"}, {"rating": 1.0, "review": "5 days were needed for their customer support to get ROKU working.  Then it quit after 2 more days.  Then I paid a local tech guy to get it working again.  Then it quit again.  I give up.  Buying something else instead.", "verified": true, "helpfulness": "1/1", "author": "William"}, {"rating": 5.0, "review": "Just what I wanted perfect", "verified": true, "helpfulness": "0/0", "author": "Kenny Hartig"}]