[{"rating": 5.0, "review": "working great. really happy with our product.", "verified": true, "helpfulness": "0/0", "author": "gabby ledezma"}, {"rating": 5.0, "review": "Works as intended", "verified": true, "helpfulness": "0/0", "author": "Igal Koiman"}, {"rating": 5.0, "review": "Roku = impressive little media device.  I have this with a chromecast and android black box.  99% of my media needs are met.", "verified": true, "helpfulness": "0/0", "author": "Jmyu"}, {"rating": 5.0, "review": "Love it! Worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "good enough", "verified": true, "helpfulness": "0/0", "author": "SEC"}, {"rating": 4.0, "review": "So far, so good. It does take a bit of time to add the logon and password information. Someone, somewhere, sometime, needs to make that easier to do. All that back and forth, up and down, and what-have-you. But, the device is working. It's much more straightforward that the previous method through our DVD player. Also, we plan to take it with us on a trip to a somewhat remote (somewhat in that wi-fi is available) and watch some of our faves while taking it easy.", "verified": true, "helpfulness": "0/0", "author": "Boo \"BS-H\""}, {"rating": 3.0, "review": "It works some of the time, but often I have to unplug it from the TV an plug it back in because it hangs when trying to select a movie.  It is convenient when it works.", "verified": true, "helpfulness": "0/1", "author": "Chris"}, {"rating": 5.0, "review": "It works great, easy to set up. It will play all the big names, netflix, hulu, amazon and google play.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 4.0, "review": "I like this better than the last one which was mounted on our shelf. This one is much better. We'll see if it lasts longer.", "verified": true, "helpfulness": "0/0", "author": "David B. Marks"}, {"rating": 5.0, "review": "I love this have been using it for over a week now and love every minute of it. Can't wai to to get my roku 3.", "verified": true, "helpfulness": "0/0", "author": "M.K. Wilke \"M.K Wilke\""}]