[{"rating": 5.0, "review": "Works great! A little slower than our Roku3, but in use as a bedroom Roku it is just fine.", "verified": true, "helpfulness": "0/0", "author": "KARL BLACK"}, {"rating": 2.0, "review": "Available channels are barely adequate.  They are pretty simple if you choose just the free ones available.  You must pay a monthly fee for any channels that offer anything contemporary...", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 3.0, "review": "I had some connectivity issues with this device. Could be for many reasons not sure what though. i moved it from my living room to my bedroom and so far it is working much better. Crossing my fingers!", "verified": false, "helpfulness": "1/1", "author": "Will Evans"}, {"rating": 5.0, "review": "Great works fantastic", "verified": true, "helpfulness": "0/0", "author": "enrique"}, {"rating": 1.0, "review": "The remote is horrible and you have to bang it a million times, take the batteries out, put them back in, etc., to get it to work. I would not purchase this item again.", "verified": true, "helpfulness": "0/0", "author": "Katherine A. Fraley"}, {"rating": 5.0, "review": "We bought 2 refurbished sticks and had no problem whatsoever setting them up. They both work perfectly. Very easy. Got netflix on them and enjoying streaming TV.", "verified": true, "helpfulness": "0/0", "author": "ggch"}, {"rating": 5.0, "review": "Can't believe how much you get out this thing for such a great price! I would definitely recommend this to anyone. Perfect for people who are trying to save money on cable.", "verified": true, "helpfulness": "0/0", "author": "Michael Ahiante"}, {"rating": 5.0, "review": "I had to look back at my order because I totally forgot that I bought a refurbished unit; the product looks new and operates like I was the first person to open the box and plug it in so NO NEGATIVES regarding that facet of the purchase. Buyer beware, I ignored the recommendations to get the extender cable for the HDMI because I needed it as the location was too tight to fit the stick with the mini usb power cable sticking out. So I went to Walgreens and bought cable ($8.00), brought it home and darnit, realized the HDMI cables are normally both male ends and the Roku is a male and the TV is a female. Sooo, went to Target where they sell Roku's ($45+) and found no special cables for the roku but did find a double male adapter ($18.00) that touts itself as a cable extender because you can join two HDMI.I got it up and running, set up is easy, a keyboard would be nice to put in email addresses and user names but otherwise an a easy setup. From plug in, start up and use, I didn't even get around to reading the setup documents that came in the box.For buying the Roku and a refurbished one at that, I would do it again.", "verified": true, "helpfulness": "0/0", "author": "isail7cs"}, {"rating": 3.0, "review": "I bought this unit for use in my bedroom, I currently have a Roku 3 out in the living room and I find this unit to be much much slower than the Roku 3. Even just browsing YouTube or waiting for Plex to load takes considerably longer than the 3 and is a bit frustrating at times.Otherwise the install was simple stupid and I love that you can power it from the TV's USB port.", "verified": true, "helpfulness": "0/0", "author": "jcdillin"}, {"rating": 5.0, "review": "Works great, also allows my Galaxy S5 phone to mirror the screen to it.", "verified": true, "helpfulness": "0/0", "author": "Grant Brown"}]