[{"rating": 2.0, "review": "Just a warning for those with Sony Bravia KDL-62V5100 TVs.  Despite having 4 HDMI ports, the TV does not \"see\" the Roku Stick.  I wound up installing it on another TV (Samsung) in the house, and it works fine.", "verified": true, "helpfulness": "0/0", "author": "Reviewer"}, {"rating": 5.0, "review": "I have three of these in my house and I love them!  Very convenient and portable if you want them to be.  With a good wi-fi signal, you're all set. I've had them 3 months without issue.  I would even consider replacing (upgrading) my Roku 2HD with the stick because of the upgraded software features.  I would recommend checking the physical placement of your HDMI port on the back of your TV to make sure it will accommodate the Roku Stick.  Will it stick straight out, or hang down, or maybe hang down, but interfere with other things on the back of your TV?  If so, look for right-angle HDMI adapters.  There are lots available, but make sure you get the correct one that will \"bend\" in the correct direction that you need to \"reposition\" your Roku Stick out from the rear of your TV.  The remote uses an ad-hoc wi-fi network created just between the Roku Stick and the remote, so you never have to \"point\" the remote at the TV to make it work.  That's nice since the stick is on the rear of the TV.  Combine all that with the free Roku Android App, and you've got everything you need!PS -- I don't use the Roku for gaming and I don't have a need for remote headphones, and the Stick doesn't handle remote headphones like their other model, and I don't know about gaming.  The remote does not have game controls.  But you can easily take the Stick with you to anyone's house that has wi-fi and an HDMI port on their TV.  Netflix, Amazon Prime, YouTube, etc all work great!  You can cast those from your tablet to your Roku as well, but I haven't done it personally.  For the price, it's one sweet device!", "verified": true, "helpfulness": "0/0", "author": "JimmyJ"}, {"rating": 5.0, "review": "GREAT!", "verified": true, "helpfulness": "0/0", "author": "Simone W."}, {"rating": 5.0, "review": "As one who cannot afford cable or satellite television, the Roku stick has given me access to various programming, which I frankly enjoy more than much which I had in my 'cable days.' Since I have an HDTV, a necessity for this particular model, and WiFi Internet, I can watch You Tube, streaming from Internet provided sites, and many public domain and classic films which are available on Roku channels.If one has subscriptions to such popular film streaming services as Amazon or Netflix, the convenience would be vast. That is beyond my budget, but I still have more than enough television to stream. Pair this with an antenna for local programming, and cut the cable cord with ease.The Roku has its limitations, of course. Since Roku's aim is streaming, not, per se, being able to access programming without cable, many of the channels require subscriptions. The free channels tend to duplicate each other, and much of the programming dates back many years. (That is not a problem for me, since I prefer classics.) There are varied news channels, but BBC World was eliminated, and many of the channels are Fox affiliates, some local to areas of which I have no knowledge. Church programming seems to dominate the 'free market.' :DI nonetheless found it was 'love at first sight' (or first site) with my Roku, and am very happy with the outcome.", "verified": false, "helpfulness": "1/1", "author": "Elizabeth G. Melillo \"gloriana\""}, {"rating": 4.0, "review": "Okay, this is my second streaming device after the Chromecast. And after almost a week with it, I'll quickly compare this to the Chromecast so maybe you can decide which one you buy.What the Chromecast can do is grab media from services like Netflix and play them on your television. And you get your content from your phone/tablet/Chrome browser to cast it on the tv. The nice thing about this is that you have no remote to really lose because most people have a smartphone or tablet now. It's also a pretty big flaw depending on who you are. But I'll get to that later. And the other big thing is it's price, at 35 bucks it's not expensive compared to say, buying a Wii U at 300 bucks, an Xbox 360 at 200, or even the 99 buck streamers/blu-ray players.On the flipside of this, you have the Roku Streaming Stick which is more of a regular Roku or the Apple TV but just shrunk down to a smaller size. Unlike the Chromecast, you install apps on this stick. I feel I should say this to prevent confusion as I actually held off buying this because I thought it was just another Chromecast but purple and with the Roku branding. That is not the case at all.So, let's talk about the remotes and apps. The Chromecast uses devices you likely own already.for a remote. And that's about it. But, only Android and iOS have a bunch of apps that really have Chromecast features. Windows and OS X/Linux just have Chrome with the Google Cast extension which is only okay if you don't mind carrying your laptop or using your desktop to watch movies on the big screen. And all of this would be fine for me, but I've found that many of the Chromecast enabled apps outside of Netflix will give me problems. Crunchyroll on Android almost never casted for me so I gave up on it, and the Chromecast would sometimes just drop Youtube videos for no reason, and I also stopped trying to send local media to it because the apps would never connect to the Chromecast. Because of how dependent the Chromecast is too Android, iOS, and Chrome, it's only as good as the apps, which isn't really amazing as of this review.As for the Roku, it has a more traditional remote, which may serve you better than a smartphone. But it has apps on Android, iOS, and Windows 8/Windows Phone that can be used to control the Roku as well. And in my opinion, using the apps are a lot better than using the physical remote but everyone is different on that. And as a plus, you can also cast stuff from Youtube and Netflix from your phone to the streaming stick (but to be fair, casting is a common feature now on a lot of media devices). So the Roku gives you more options as to how you control your device.Now, content is a big deal. Roku is the king here with over 1000 apps (though you are unlikely to use even 50 of them) with all sorts of content or added functionality. Whereas Chromecast has the basics covered so if you have more niche interests that those basics don't cover, then your 35 bucks might be better saved towards that Roku or even a game system.So, if you are still on the fence between these two...-You should buy a Chromecast if-1. You are invested in Google's ecosystem, since you can cast your Google Play content with it2. You mostly use Netflix, Hulu Plus, and Youtube as these work the best3. You have a powerful enough PC to use the Tab Casting feature in the Google Cast extensionor4. You have plenty of Android/iOS devices and don't want to spend more money for a streaming device-You should buy the Roku Streaming Stick if-1. You are using more services like say, Funimation streaming or Amazon Instant Video2. You'd rather have a physical remote or you have a Windows phone/tabletHonestly, I feel that the Roku is the better device because it does what the Chromecast can do and more, all for a mere 15 bucks more. But, everyone is different, I started out loving the Chromecast, but disliked it as I stopped using Google products as much and expanding my video watching past Netflix. So, you might actually prefer the Chromecast because your needs are different.", "verified": true, "helpfulness": "1/1", "author": "Random Shopper"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Sofia Gutierrez"}, {"rating": 4.0, "review": "Little slow to boot. But love the product!", "verified": false, "helpfulness": "0/0", "author": "J. Meyer"}, {"rating": 5.0, "review": "Does load slightly slower than others but it does the job and stays out of sight. It is used on a childs tv so the speed is not an issue.", "verified": true, "helpfulness": "0/0", "author": "Maurice"}, {"rating": 5.0, "review": "Great for streaming PRIME:)  Only $50 can't beat that;)", "verified": true, "helpfulness": "0/0", "author": "Steven Whitley"}, {"rating": 2.0, "review": "The stick was fairly easy to set up.  The question I had for myself when I bought this was, why?  I proceeded to find out.Anyone who says a $40 stick can replace their cable is crazy if you spend some time browsing and viewing channels.The stick gives you a gateway to the junkyard of all media.There are some movie channels where the titles are so obscure not even the stars' moms and dads ever saw them!Advertisements, advertisements!  Well, you knew it wouldn't be free, right?  Speaking of which, my wife wants the Vietnamese channel but has to buy 180 other channels to view it!Much anticipated, big downside.  I'll live with it.  But I'm keeping my cable!", "verified": true, "helpfulness": "1/2", "author": "JTR"}]