[{"rating": 5.0, "review": "Esasy, nice, good for jw.broadcasting", "verified": true, "helpfulness": "0/0", "author": "TARCIO SANTOLERI"}, {"rating": 4.0, "review": "I have a love/hate relationship with my Roku 3500R Streaming Stick.  I waited to review it until I'd given it a fair chance.  I've had it for over six weeks now.  It replaced an ancient laptop that was driving the HDMI port on my five year old LG HDTV.  I'm very pleased with the video quality.  Streaming with the laptop was jerky and sometimes out of sync, like an old Japanese monster movie.  The Roku has smooth video that uses my whole screen, and I have yet to have it pause to buffer unless my internet goes out completely.  That's the part I love.The parts I don't love are the interface you get from the Roku remote or the app on my phone.  These menus are much harder to navigate than using the laptop were.  Apples and oranges in some ways, but the user interface is not very friendly.I only subscribe to one service and that's Huluplus.  The way the Roku manages the Huluplus queue is terrible.  There are even a couple of shows I can't get on the Roku, even though they're in my Huluplus favorites and queue.  That may be a Huluplus problem, but Roku is aware of this.  It reflects badly on them as well.There is no way to turn off the Roku without unplugging it.  Since I only turn the TV on to watch video a couple of times a week in the summer, that's a problem.  The remote should have an on/off capability, like the TV remote.  Multiple times the Roku has failed to respond to the remote or the app on my phone.  I've had to unplug it and plug it back in, along with the TV, to get it to respond again.Multiple times the video streaming has turned into purple haze.  That means you go through the menus and select something to watch, but when the video is supposed to start playing, you get audio but the screen is just a hazy purple background.  The only way I've been able to fix this is to turn off the TV and Roku by unplugging it, and then turn it back on.The bottom line is, when the Roku works, the video is great, and it beats what I had before.  The menus are frustrating, but that's compared to a laptop with a mouse to navigate.  It's still not a great user interface.  The problems that require powering the Roku off and on are annoying, but not a show stopper.  I like the Roku and won't be going back to the laptop.  It still needs a lot of work, and clearly could use some product testing.  The purple haze should never have made it to production.", "verified": true, "helpfulness": "0/0", "author": "Jerry Nowlin"}, {"rating": 5.0, "review": "I am so glad that I found out about Roku this money was well spent we spend hours finding things that we choose to watch. this has been a nice experience thanks a bunch", "verified": true, "helpfulness": "0/0", "author": "Lusy"}, {"rating": 4.0, "review": "While this works great, if it isn't plugged in and charged and you try to transfer it to another TV, you have to essentially reset the whole thing.  If it's been charged and used recently then there isn't an issue.  The other issue is that if your HDMI port is directly on the back of the TV (instead of inside a nook where it can go in sideways) and you don't have room between the back of the TV and the wall, the HDMI stick won't fit.", "verified": true, "helpfulness": "0/0", "author": "Julia S. Pearson"}, {"rating": 5.0, "review": "Just bought so I could veiw my Hockey Streams on TV but have found some great free apps so that I can watch all kinds of content", "verified": true, "helpfulness": "0/0", "author": "J. Sawtelle"}, {"rating": 1.0, "review": "This product is not compatible with a Toshiba 22LV505.  Roku doesn't list incompatible devices anywhere - all it says is it requires a HDTV with HDMI input, both of which my TV has.  Not sure why Roku claims to work with all TVs when it clearly doesn't - I also tried the Roku 3 to no avail.  Very disappointed - going with Chromecast instead.", "verified": true, "helpfulness": "0/0", "author": "Carol Haynes"}, {"rating": 5.0, "review": "I was surprised to find all of the channels that are included with the Roku for free. Sports fans will love the ESPN and sport specific channels. The picture quality is also great. We haven't had any problem so far and everything loads very quickly. It takes some time to get accustomed to the remote functionality. I like the fact that you can just push a button to go straight to your Netflix. Cable cutters should rejoice.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Its Great. I rec'd it ahead of schedule and well satisfied.", "verified": true, "helpfulness": "0/0", "author": "Jerry young"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Mary Leonberger"}, {"rating": 5.0, "review": "Love this! Nice and small and works great!!!", "verified": true, "helpfulness": "0/0", "author": "Vicky L. Reiswitz"}]