[{"rating": 4.0, "review": "Remote doesn't always pick up and has some lag.  Overall, better than older versions.  Very compact.", "verified": true, "helpfulness": "0/0", "author": "TaylorC"}, {"rating": 5.0, "review": "Great item worth they money fast shipping", "verified": true, "helpfulness": "0/0", "author": "Dan Duval"}, {"rating": 4.0, "review": "Roku is really awesome, we made our LED tv as smart TV with this. If we were able to access yupptv with Roku, could have been better.", "verified": true, "helpfulness": "0/0", "author": "santhosh"}, {"rating": 5.0, "review": "Awesome product !!  Was wondering when this would come out to the public, and had the option to pre-order for release date. Will be purchasing more in the future !!", "verified": true, "helpfulness": "0/0", "author": "Coach Rusty"}, {"rating": 5.0, "review": "The Roku streaming stick is an amazing step up from older Rokus that I've owned. It's capable of streaming a lot more stations including ESPN3 (Watch ESPN) which is great for sports programming not available on ESPN or ESPN2. (At least for Cablevision in the NY area-check with your provider). It also works much quicker when fast forwarding and shows more information with improved graphics for TV shows and movies. Although my TV is flush mounted directly to a wall and has its HDMI socket on the rear of the TV (inside the wall)-the Roku stick and remote both function perfectly. In fact, the remote control functions better than the old Roku set-top box which always had directional issues, meaning you had to point the remote control directly at the unit for it to work. This unit has none of those issues since it's working through the WiFi system of the house. Keep in mind though, that the Roku stick protrudes from the HDMI outlet several inches. Also, despite the fact that it's so small and plugs into any HDMI outlet on your set, it still requires an AC wire and transformer plug. (This AC wire and transformer come with the Roku in the box). Bottom line- this thing works great! It works so much better then the older Rokus when watching Netflix or any kind of streaming.", "verified": true, "helpfulness": "0/0", "author": "Kelvin8r"}, {"rating": 1.0, "review": "Very slow. You are better off buying the roku box . But better than the comcast stick.", "verified": true, "helpfulness": "0/1", "author": "Keli"}, {"rating": 5.0, "review": "I am very satisfied with the Roku Streaming Stick, works great for my TV (I have an Emerson). The only thing I don't like is somewhat of a false advertisement. It says that the stick comes with a lot of power, but you have to give it power either before or while you are using it. Luckily for me, my TV has a USB port in it right next to the HDMI, so I can get the power from my TV instead of an outlet with an AC adapter. I recommend this stick to everyone that is looking for a good Roku device at a really great cost!", "verified": true, "helpfulness": "0/0", "author": "Camillia McCown"}, {"rating": 5.0, "review": "Love Roku !!!!", "verified": true, "helpfulness": "0/0", "author": "Nelson S."}, {"rating": 4.0, "review": "The Roku itself works great, however, since it's a \"fixed\" or \"hard\" fit, it didn't fit on our particular TV with out this adapter, [Monoprice 8inch 28AWG High Speed Male to Female HDMI® Port Saver - Black] because once you plug the powered adapter into it, there just wasn't enough space.  Now after installing the adapter, it just kinda hangs down loosely but the quality isn't affected.Just a head's up, check the back of your TV before ordering.", "verified": true, "helpfulness": "0/0", "author": "Shayna"}, {"rating": 1.0, "review": "Be warned, if your router is not in the same room as this, it probably is not going to work. I was told that I had to move my router into the room where the stick is by Roku customer service. Apparently there they have an extender of some sort for the Roku they will have you use, but I was told I still need the router in the same room. One customer service rep even suggested I could try a wifi extender, but there was no guarantee it would work. I'd pass on the stick if the router isn't in the same room and spend a bit more for one of the other Roku offerings", "verified": true, "helpfulness": "0/0", "author": "James M. Buck \"buckman18\""}]