[{"rating": 5.0, "review": "Good product. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Rich63"}, {"rating": 5.0, "review": "GREAT! GREAT! GREAT!", "verified": true, "helpfulness": "0/0", "author": "R P."}, {"rating": 5.0, "review": "The roku is great! It's easy to use and I can watch all my favorite movies and shows!", "verified": true, "helpfulness": "0/0", "author": "Bridget"}, {"rating": 3.0, "review": "This works well, and I am satisfied with it.  Unfortunately there are a number of uses which I had looked forward to using, but I can't find any instructions.  The manual which came with it only covers the most basic uses.  Looking at  the Roku website and some user forums has not solved my problem.  For example, how to get a transfer of a internet site content to tv from a desktop.  If I'm watching a movie on the Internet, not on any network, how can I watch  it on my tv.  Sounds simple, probably is, but I can't find directions. I'm not real computer savvy, but I have a lot more uses I would like to try out.  So I only give it 3 stars because I wish there was more information.", "verified": true, "helpfulness": "0/0", "author": "Pretty Bird"}, {"rating": 5.0, "review": "Love this", "verified": true, "helpfulness": "0/0", "author": "Rae"}, {"rating": 5.0, "review": "Love the stick better then the box, because you don't have to have the remote aimed right at the box", "verified": true, "helpfulness": "0/0", "author": "Amanda S."}, {"rating": 4.0, "review": "Has difficulty getting it to work at first but love it now, we don't have cable and this puts Netflix and amazon instant video at your fingertips in one simple unit.", "verified": true, "helpfulness": "0/0", "author": "becky K"}, {"rating": 4.0, "review": "Ah, I like Roku products. This is new. It works.  But not as good as the units do. I have 5 TV's so I got two of these for extra TV's for the guest room and patio. They work good for the money. I would get another one if I needed it. But for your main TV's get the box.", "verified": true, "helpfulness": "0/0", "author": "RICHARD A. REPICI"}, {"rating": 5.0, "review": "This this is awesome. We dropped all the rerun cable channels and surf for what we want. Was a little disappointed with the Amazon Prime selection, but oh well. Movies on demand...", "verified": true, "helpfulness": "0/0", "author": "2nd_Amend_D"}, {"rating": 1.0, "review": "Roku fit loosely in HDMI slot from the beginning. It worked but would occasionally lose power and restart. Took me awhile to figure out why was wrong. Just decided to rerun it but missed 30 day return policy by less than a week!! Very annoying. Should be at least a 6 month warranty. Just crap!", "verified": true, "helpfulness": "0/0", "author": "Liza Morrison"}]