[{"rating": 1.0, "review": "Constantly freezes. I have to unplug and reset this thing 2 times a day. Piece of junk.", "verified": true, "helpfulness": "1/1", "author": "Gmork"}, {"rating": 5.0, "review": "1st did not work, Amazon got a 2nd one to me in 2 days and it works great.", "verified": true, "helpfulness": "0/1", "author": "J. Scannell"}, {"rating": 1.0, "review": ".This device came with NO instructions and symbols on the handset that are meaningless to me. It is totally non-intuitive. The interface with YouTube makes you search a title  ...  o .. n ... e .......l ... e ... t ... t ....e ... r ....  a... t .....  a  t ...i ...m .. e  How can something like this come with NO instruction sheet?? Corporations' attempt to skimp every single cent is just over the top. The controller device is sitting on my bedside table gathering dust. I wish I had just gotten a Chromecast, but I'm past the return date for Amazon I think. I just got fed up with the time wasted.", "verified": true, "helpfulness": "2/2", "author": "jj"}, {"rating": 1.0, "review": "Nothing works on it usually, and when  it does it's horribly slow(yes I have checked my internet as well).  Neat idea, poor quality unfortunately.", "verified": true, "helpfulness": "2/3", "author": "BEARD FAMILY"}, {"rating": 4.0, "review": "Good price.", "verified": true, "helpfulness": "0/1", "author": "Joseph F. Daniel \"dani5302\""}, {"rating": 4.0, "review": "Got 3, all work fine. Thanks.", "verified": true, "helpfulness": "0/1", "author": "Arthur Maynard"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/1", "author": "sandy's collection"}, {"rating": 3.0, "review": "The video channels and streams are great. I really bought this for the screen sharing functions. Under Android or Windows 8.1 it hangs and never connects. This strange in that the roku app works from both systems.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The idea here is fantastic. The execution is lacking. Nearly all the bells and whistles as the Roku 3 at half the price AND it hides behind the TV. Great. If only the Wifi remote would keep it's pairing for more than a day.Returned the product ONLY because of the remote. After following ALL of Roku's workarounds (live chat and FAQ) and some tips found online (factory resets, hard resets, manually repairing the remote, changing my router channel three times, and so on) read tons of forum threads and spending about 6 hrs in 4 days on resolving the issue, I called it quits. Not worth my time. This product is billed as plug and play, and it is. But the remote sabotages the whole thing.This is a widespread issue with the Stick remote, not sure if it is as much of an issue with the Roku 3 Wifi remote; but after this disappointment I - a loyal years long Roku user - am buying Amazon Fire TV. Why? No Wifi remote (Bluetooth here) and it supports Netflix profiles (and all of our family's must-have apps).Sorry Roku.For the skeptics:The router is in the same cabinet as the TV and Stick, range is not the issue.The Stick was powered with the provided wall plug, not the TV's USB.While the Stick was working perfectly, streamed everything we asked it to without issue, interface was gorgeous, yadda yadda, the remote lost it's pairing at least once a day, every day we had it, not matter the level of use.I utilized Roku's live chat service initially, their first suggestion was to change the router channel to 11. Did that, reset, rebooted. Success! For about an hour.(ps, the only other Wifi devices on in the home at this point is the laptop and the other Roku, an old model upstairs. I unplugged the wireless printer and made sure all phones and tablets were running on 4G and not my Wifi. I did this just to be sure that my 60 Mbps connection wasn't overloaded... pfft.)Followed up with Roku's FAQ on their site. Same results.Turned to several forums for other's solutions. Tried all of them. Some of them worked, but none worked for more than one sitting's worth of use.So irritating!In summary, I wasted so much time on temporary fixes on a $50 device I decided to cut my losses and go with a device that eliminates the issue- the Wifi remote.", "verified": true, "helpfulness": "3/3", "author": "RangerBurcher"}, {"rating": 4.0, "review": "Simple start-up good instructions, performing as expected Carl L. Parmer", "verified": true, "helpfulness": "0/1", "author": "Carl Parmer"}]