[{"rating": 5.0, "review": "Although they say it was refurbished, it sure looked new to me.  I have the Roku Stick and the Fire Stick.  The Roku appears to have a little more content, but I sure like the voice commands in the Fire. I am inching my way toward cutting the cable.", "verified": true, "helpfulness": "0/0", "author": "Shawn H."}, {"rating": 1.0, "review": "Get the roku 3 instead! It is so slow! Set up took forever because an error message kept popping up. After that we constantly had to keep resyncing the remote and restarting the device/ our router. Since it is powered through the USB on the TV it has to boot back up everytime you turn on the TV. It's just agonizingly slow and buggy. We've never had issues with the roku 3. We thought we would try this for our second TV because it was half the price, but it doesn't work so it's not worth it.", "verified": true, "helpfulness": "2/2", "author": "Matt Gilbert"}, {"rating": 5.0, "review": "Very handy for streaming. You set up a free account and then you can have a few of these and the account and selections cover them all. Great for a traveler, as you can put movies of your own, or take your Netflix with you to hotels. Just don't forget it in the hotel. Once you get it set up, you can unplug it and move it from TV to TV in your house.", "verified": true, "helpfulness": "0/0", "author": "Larry Philpot"}, {"rating": 4.0, "review": "works great./sooo far", "verified": true, "helpfulness": "0/0", "author": "anthony cozzitorto"}, {"rating": 3.0, "review": "It works most of the time but for no reason it will freeze and I can't get it to do anything.  And once in a while it will stop and reload if there are others on my network.  My Roku 3 does not ever do that.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Casi Antcliff\""}, {"rating": 5.0, "review": "Product has performed well thus far (three weeks). Excellent appearance, looks new.", "verified": true, "helpfulness": "0/0", "author": "DBell"}, {"rating": 5.0, "review": "Works well with wifi works well with iPhone Netflix and Roku 3 it is a bit slower and lags more than the Roku 3 but that is by it is wireless", "verified": true, "helpfulness": "0/0", "author": "Tiffany Youknowyouloveme"}, {"rating": 4.0, "review": "A little time consuming to get on computer internet and TV but works OK.", "verified": true, "helpfulness": "0/0", "author": "Dana Fox"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Michael H."}, {"rating": 2.0, "review": "this is marketed as a highly portable item, but it cannot authenticate open wifi networks found in a lot of hotels.  I wasted my time and money buying this, I feel tricked.  The Roku 2 I have does the job just fine.  I have space at home.  This was bought for traveling and they knew they likely weren't that great a travel solution.  More scamming, great", "verified": true, "helpfulness": "0/0", "author": "JaneiR36"}]