[{"rating": 4.0, "review": "Haven't had it long enough to really review it, but so far so good.", "verified": true, "helpfulness": "0/0", "author": "R. A. Peterson \"hangglider\""}, {"rating": 1.0, "review": "Careful ... premium channels such as Netflix and Amazon are not available in some countries outside of the US and the remaining channels (other than YouTube) are not really known ... not by me anyway. Approach with caution.", "verified": true, "helpfulness": "0/0", "author": "Andrew Waldropt"}, {"rating": 5.0, "review": "Works great easy to connect and use.  Glad we purchased this for my parents to entertain on the rainy wintry days. They love it!", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 5.0, "review": "works very well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I thought that since this is fulfilled by Amazon that even though it's refurbished it would work. It did not work. It was very frustrating attempting to connect it to my wireless Internet multiple times not only because I kept getting an error message but also because the picture was cut off on the sides. Even when I adjusted the picture on my television, the sides were black and you could see that there were more buttons to the sides that were cut off. So much for the movie night I'd planned. Very disappointing.", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 3.0, "review": "Ive never had a roku1,2,or 3. The roky stick is my first. As soon as I turned it on I realized it was going to be slow. Ive had many times when my netflix or hulu plus wont load so ive had to push the rest button on the roku. It didnt delete anything but it fixed the issue. Yes the roku is slow & anyone can see it.Besides that: i kind of like it because ican use netflix & hulu plus.", "verified": true, "helpfulness": "0/0", "author": "Miley"}, {"rating": 1.0, "review": "I owned an original Roku box that just up and quit working several years ago.  I bought this in hopes that it was just a defective box the first time around.  I plugged this in and started setup, but I could never even get it to connect! I tried every available option  to get it to work,  Roku support Is a joke! Sending this back immediately and trying a fire stick!", "verified": true, "helpfulness": "0/0", "author": "ANParker2008"}, {"rating": 3.0, "review": "I bought this refurbished in October 2014, and while I love it when it works, it only works sometimes. It's easy to reboot and that seems to resolve the issues, but I have to unplug and reboot the entire thing at least 3-4 times per week. It has to be plugged into the wall all of the time. Power from the HDMI port is not enough to run this. It will immediately shut off and reboot when unplugged...which is convenient, since I'm constantly rebooting. Minor inconveniences overall. I love my Rokus (I have two LTs as well), but if this sort of thing bothers you, don't get a reconditioned model.", "verified": true, "helpfulness": "0/0", "author": "Viaggiatrice"}, {"rating": 2.0, "review": "traded up to the fire stick which is  MUCH better ......changed do  to the small memory of the roku, it kept having to buffer.", "verified": true, "helpfulness": "0/0", "author": "jeff decker"}, {"rating": 5.0, "review": "Great value, easy to set up, easy to use", "verified": false, "helpfulness": "0/0", "author": "Amanda"}]