[{"rating": 2.0, "review": "The remote control is horrible one. I use my mobile as remote control. I need to reset the device all the time. Buy Chromecast I think.", "verified": true, "helpfulness": "0/0", "author": "Md Raqibul Alam"}, {"rating": 5.0, "review": "Works perfect. We have not had any issues yet. We love not having to have another box sit on our tv stand! I read some reviews about how it takes too long to set up and having wifi and remote issues. We did not experience any of these problems. We enjoy using our roku streaming stick on a daily basis. My kids especially enjoy all of the kids channels.", "verified": true, "helpfulness": "0/0", "author": "Kelsey"}, {"rating": 5.0, "review": "works as intended", "verified": true, "helpfulness": "0/0", "author": "cbcdave"}, {"rating": 1.0, "review": "Really liked it but it didn't even last a year we will be trying the amazon one next. This was our second roku that died within a year", "verified": false, "helpfulness": "0/0", "author": "mdavis"}, {"rating": 1.0, "review": "Stick arrived on 5/30. Main reason I bought was to view Picasa Web Albums on TV. App currently does not work. My belief is it needs a software update. Contacted Roku on 5/30 when found app did not work. Was told they had been receiving a lot of calls. Was promised a call or e-mail within 48 hours with an update. I waited 72 hours and called customer service back. I asked to speak to a supervisor. This person told me he thought problem would be fixed within 48 hours and again promised a call or e-mail back within 48 hours. It has now 6/7 and has been 110 hours. Still no contact from Roku customer service and app still does not work. Initiated return of item to Amazon. Very disappointed as prior experience with Roku had been positive.", "verified": true, "helpfulness": "0/0", "author": "kurebeachkid"}, {"rating": 3.0, "review": "The streaming stick seems to work, but the remote keeps unpairing. It is easy enough to fix, but very annoying to have to do it every time you use the streaming stick. No similar problem with either original Roku or the Roku 3 remotes. Note that there is a free smartphone app that you can use to let your phone be the remote, but why should we have to do that? Roku gives instructions for the pairing on their website, but what they really need to do is fix the basics of the remote/streaming stick.", "verified": true, "helpfulness": "0/0", "author": "marciacubed \"marciacubed\""}, {"rating": 5.0, "review": "Bye bye cable, Hello Roku!", "verified": true, "helpfulness": "0/0", "author": "Steve Burns"}, {"rating": 1.0, "review": "error code 009error code 009error code 009error code 009error code 009error code 009error code 009........Every devices in my house can connect with WIFI very well except this stick....It shows this error nearly once a week.....And when it shows this error, you can do nothing with the remote control and have to shut down the TV....Remote do not response and error code come out again and again.....It must be a defective product but Amazon does not allow to return...Can I give a zero star??? I really want to do....", "verified": true, "helpfulness": "0/1", "author": "Jasonli"}, {"rating": 5.0, "review": "Works better than. Expected", "verified": true, "helpfulness": "0/0", "author": "debbie Kirby"}, {"rating": 5.0, "review": "Don't know how I could live without my Roku.......great little piece of electronics that adds a great deal to the TV programs available 'round the clock.  I got it specifically for the Acorn Channel which features only British, Canadian, and Australian TV series and films.", "verified": true, "helpfulness": "0/0", "author": "Joseph Dietrich"}]