[{"rating": 3.0, "review": "Good all around streamer, but not without some flaws.  And just for reference, my comparison is with an Samsung 5100 bluray player, an Apple TV, a PS3, and a few older PCs (HTPCs).Size-wize and power consumption is wonderful.  There's a USB port right by an HDMI port on my TV so I was able to neatly tuck the cable away keeping the entire unit out of site.  This is also up on the wall so nothing is visible.Netflix playback is my primary purpose for this unit and it does well.  It's the official Netflix app and while it can be sluggish, it does the job.  Quality is good but can take a while to load the app and the videos itself.DLNA playback using Roku's default player is good.  It's much faster and responsive than Netflix.  However, I have noticed some issues with some videos I've attempted to playback.  Some will not play audio (either 5.1 or multiple streams embedded).  A few videos that play fine on all other devices simply will not play...well they attempt to play but nothing more than static is heard.On the plus side, the remote is RF, so line of site is NOT needed.  For anyone familar with the AppleTV, you know how useless their provided remote is!  On the downside, buttons are a bit mushy and sometimes require a fair bit of pressure to \"activate\".All in all, I do recommend this.  I really hope to see some software updates in the near future to correct some of these problems as most of them are simple software quirks.", "verified": true, "helpfulness": "2/2", "author": "D. Adams"}, {"rating": 5.0, "review": "It is everything it says it is. It is easy to install, has great picture quality,and has many choices to choose from.", "verified": true, "helpfulness": "1/1", "author": "ker \"rambo\""}, {"rating": 5.0, "review": "As described and shipping was fast", "verified": true, "helpfulness": "0/0", "author": "j"}, {"rating": 5.0, "review": "A legitimate alternative to satellite or cable, for a lot less money.  I have only been using it 10 days, but so far it is great.  Amazon Prime has an excellent selection of things to watch.  Quite a bit superior to Netflix for my tastes (though everyone has their own personal preferences).  The menu system is easy to use yet powerful.  You can search for a title or actor, and get a list of available things to watch, along with prices (it shows the free choices available).  Lots of available free channels to watch, probably something for just about everyone.  Quite a few HD versions of older shows and movies.  I haven't spent any money on anything (except my Prime membership) and don't see any need to.  Check out the private channels when you get a chance.  Easy hookup and a nice functional remote.  Overall, an excellent product and value. I liked it so much that I got another one  for my retired parents, and they love it.", "verified": true, "helpfulness": "0/0", "author": "vivitron"}, {"rating": 5.0, "review": "Love it. Works as advertised", "verified": true, "helpfulness": "0/0", "author": "New user"}, {"rating": 5.0, "review": "Excellent item; saves us a bundle on cable!", "verified": true, "helpfulness": "0/0", "author": "Antonio Webb"}, {"rating": 5.0, "review": "Plugged it into the TV, connected it to power, linked to the internet, and it worked.", "verified": true, "helpfulness": "0/0", "author": "Mark Garofalo \"Mark\""}, {"rating": 3.0, "review": "if it's a stand alone tv/monitor and relatively close to the wifi it's great. We found that running it through two walls, the stereo surround receiver with a cable box, and smart dvd, interfered with it enough that it lags and freezes. Can be great, just not for our setup.", "verified": true, "helpfulness": "0/0", "author": "bob"}, {"rating": 4.0, "review": "I'm a PRIME subscriptor and my family is enjoying the selection given. We already watched series like: Viking , Rome, also enjoy a lot watching Stand Up Comedy Specials. Excellent TV programming for secondary TV sets at home. We got an internet signal range extender to be be able to load channels fluently.", "verified": true, "helpfulness": "1/1", "author": "Benjamin Caban Reyes \"Beca\""}, {"rating": 5.0, "review": "very good product for add on programing", "verified": true, "helpfulness": "0/0", "author": "JOHN B."}]