[{"rating": 3.0, "review": "It is faster than some roku's I have had previously (have had 5 of them over the years for different TVs). It is great because it is so small and can hide behind the TV - but - that comes with problems. The remote connection on this is the worst of all of the roku's I have owned. Frankly, the original Roku was the best of all years ago- the quality seems to have degraded with them. I wish they built them like they use to. I give it 5 stars for what it can do, but 1 star for its remote and ability to maintain connection to wifi. The remote is larger than other roku remotes to house larger batteries - likely to give it more reach to get around a tv that is not in direct sight. But, it just doesn't work that well. Sometimes it works, sometimes it doesn't. I am disappointed and frustrated with it daily. Fix the regular remote and occasional problem and it is a 5 star product. But, until then, 3 stars is all it deserves.", "verified": true, "helpfulness": "0/0", "author": "DrMFT \"SwintonPhoto\""}, {"rating": 4.0, "review": "I have two Roku devices; a Roku 3 in my living room and the Roku stick in my sons room. I do not have cable, I do not see the need with google play and netflix. Roku has an amazing user friendly interface that didn't take any time to learn. However, I would not use the streaming stick as a \"daily driver\" as it is a bit laggy, if your looking for a living room setup I would recommend the roku 3, but this is a great device for your child or to watch in the bedroom often. Roku has a ton of app selections, but the big hitters are of course netflix, hulu, google play, amazon prime instant video, etc, basically every streaming  service is offered besides iTunes.If your tv does not have a usb port to power this stick, do not worry. Roku provides a usb charger (much like an iPhone charger) that allows you to plug it in to your outlet.Thanks for reading", "verified": true, "helpfulness": "0/0", "author": "TechyAccountant"}, {"rating": 5.0, "review": "I LOVE this!  I ordered Time Warner Cable and received a massive cable box as a receiver.  With a flat panel TV mounted to the wall, that box was simply too ugly to keep.  When I discovered the Time Warner Cable app on my Roku device, I knew what I had to do.  I bought this Roku Stick and installation was a breeze!  I get my Amazon Movies, Netflix, Hulu Plus, YouTube, and Cable all through the Roku stick now.  The box goes back to the cable company and, instead of that ridiculous remote, I have a simple Roku remote that the entire family loves and can operate without hours of instruction.", "verified": true, "helpfulness": "0/0", "author": "Lisa Pietsch \"COO Tequila Aficionado Media\""}, {"rating": 2.0, "review": "remote does not work  the only way I can use my roku is through my tablet,  disappointed", "verified": true, "helpfulness": "0/0", "author": "Susan Brazee"}, {"rating": 4.0, "review": "This would get 5 stars if the remote worked.  However, I downloaded an app to my iPad, and that works perfect every time, so I'm not complaining too much.  The streaming stick itself works great.", "verified": true, "helpfulness": "0/0", "author": "K. Cronberg"}, {"rating": 5.0, "review": "Great device; easy to install and great for traveling!", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "We love this product.", "verified": true, "helpfulness": "0/0", "author": "Leo McNeill"}, {"rating": 2.0, "review": "I have been a fan of Roku for quite a while, having purchased a Roku box back in 2010 which worked very well. Eventually, having bought a wall-mounted television, I wanted to upgrade to a Roku Stick.  It was somewhat difficult to install, as the tv was already on the wall and I didn't want to take it down, but other than that, the set up was quite easy. The stick took some time to load, but again, not a huge deal.  It worked fine for almost a month, and then bam, purple screen of death.  When I would try to play something, it would load up the movie/show/whatever, but there would only be audio...no visuals.  Just a purple screen where the picture should be. Tried unplugging everything, tried rebooting, tried doing a reset, etc etc etc. Searched online for solutions until my eyes were spinning, and tried the advice of changing from 1080 to 720 (or whatever the number is), and back again.  Yes, there's lots of advice out there, as you will see if this happens to you, but...no real solution from Roku. The only two things I didn't try where switching out hdmi cables because I didn't have another one, and I wasn't about to buy a new one, no matter how cheap. And I didn't switch ports because my tv didn't have another one, at least not that I can see. It was a VIZIO - E-Series - 40\" Class (40\" Diag.) - LED - 1080p - Smart - HDTV.  I'm sure there are other thing I could try, but my husband and I are not tech gurus, just average people. I've seen a lot of debate about whether Roku is at fault for this; some blame the tvs and their updates. But seriously, if this many folks are having this problem, Roku needs to sort it out. There help section is virtually useless. I returned mine; thank goodness for Amazon's return policy (although since this is sold by Roku thru the site, it looks like i lucked out when mine went belly-up within the 30 day grace period to return it to Amazon instead of Roku, which from other reviews sounds a nightmare).  Anyway, I'm very disappointed.  I already have apps I purchased from Roku back in the day, and wanted to continue to use them. And I like their offerings. But it looks like I'll be trying one of the other sticks instead of Roku.", "verified": true, "helpfulness": "0/0", "author": "R. L. Wallace"}, {"rating": 5.0, "review": "Performed as advertised and very easy to set up. My compliments to the software developers at Roku. Great user interface and easy to use. Other software delopers could learn from these folks!", "verified": true, "helpfulness": "0/0", "author": "ronl3991"}, {"rating": 4.0, "review": "I love it when it works......it will kick itself off the wifi network frequently.", "verified": true, "helpfulness": "0/0", "author": "K&T"}]