[{"rating": 5.0, "review": "Love it. We have 5 roku devices in total now.  We like this newest streaming stick the best so far. Just plug and play if u have an hdtv. Lives up to its description.", "verified": true, "helpfulness": "0/0", "author": "Anna D. Howell"}, {"rating": 1.0, "review": "Good idea, poor implementation.  Wifi shows full signal strength, yet this stick has trouble streaming any content (even across my local network).  Takes forever to power up.  Slow to respond to remote control commands.  Sent this back just about as soon as it arrived.", "verified": true, "helpfulness": "1/1", "author": "ixat"}, {"rating": 4.0, "review": "Awesome device that keeps getting better. For 50 you turn your tv into a smart tv and you have options for premium channels same as cable but better and cheaper", "verified": true, "helpfulness": "0/0", "author": "matt helenek"}, {"rating": 2.0, "review": "I needed to go wireless and had bought the first version of the Roku back in 2010 so it was a no brainer since that unit worked so well.  After a week the remote stopped working, I did the Tech. Support thing twice with no luck.  I Googled the issue and found better help on the Internet.  Now it works 60% of the time but I've lost count on how times I've opened it up and switched the batteries around.  Needless to say a big pain.  I will go to some other product after doing some research.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "We are not really huge TV watchers in my family.  Outside of news and weather...we watch very little live TV.  I have just one or two channels that I usually keep on for background noise and to watch.  My son prefers to just watch something from Netflix or Hulu and my husband doesn't have any preference.  So to save our family over $80 per month I cancelled my cable TV.  I just have the high speed internet now and we are able to pick up a ton of channels for free. In fact I get all my favorite channels that I used to pay cable to have now for free.  We got the Roku because while we have Xbox in 2 bedrooms and the living room that we stream Netflix and Hulu through...I wanted something for the TV in my office.  I could not see paying $200 or more for an Xbox that was going to be used only for streaming.  I bought this Roku and have been very happy with it.  Not only did it save me the cost of another Xbox but also the $60 yearly gold membership required to stream on Xbox.  It took just seconds to plug into my TV and I was up and running.  I can watch Netflix, Hulu Plus plus other channels now just as easily as when I had cable. The little remote is great.  I am very happy with this product.  I hope they add more channels in the future. There were a few I was disappointed you could not get like the history channel but overall a great deal.", "verified": true, "helpfulness": "0/0", "author": "N. Mason"}, {"rating": 5.0, "review": "I have a Roku wireless box already. The stick is perfect size and can be moved easily if need be!!", "verified": true, "helpfulness": "0/0", "author": "Marci"}, {"rating": 5.0, "review": "My family don't have cable. When Roku announced that they were set to release a Roku stick, I couldn't wait. This stick is so easy to install on my flat screen tv and once you've connected it to your internet, it's up and running. We already have a Roku box in the living room, so Roku has really outdone themselves with this stick.", "verified": true, "helpfulness": "0/0", "author": "DEBORAH A MILLER"}, {"rating": 1.0, "review": "It worked brilliantly for a few days and then all the apps started to slow down to the point where it was getting really frustrating to use it. In particular there seems to be an issue with Netflix which failed to work a few times and take nearly 1 minute to load.  Also experienced significant lag when using the remote.Great concept but product clearly not ready for Prime Time unless my unit was faulty. Decided to return it and wait for a few months to see if Roku update software or even hardware to resolve problems. Real shame since I loved the Roku ecosystem and navigation :-(", "verified": true, "helpfulness": "0/0", "author": "Mustangito"}, {"rating": 5.0, "review": "A portable HDMI Streaming Stick that offers tons of apps, a real remote, and a compact design for under $50.", "verified": true, "helpfulness": "0/0", "author": "Mark A. Swift"}, {"rating": 4.0, "review": "I saw this one on pre-sale and was excited!  I have a friend who has the older model and I needed something that was not going to take up space.  I use to stream Netflix through my Wii console, but after a while, the movies starting going slow and kept “buffering.”  Frustrated, I bought a HDMI cable from Amazon, which was great, but had to hassle with positioning my laptop to where I won’t trip on cables.  I bought two of these.  It works great in my living room.  On my smaller TV it works great, but appears to be interfering with the antenna reception.  I have to work on this one, but don’t regret the purchase.  The added bonus is that I can listen to “today’s comedy” station on Pandora while doing house work.", "verified": true, "helpfulness": "0/0", "author": "Swannie"}]