[{"rating": 1.0, "review": "Died after less than 3 months, wifi cant connect anymore and remote loses link constantly with new batteries. Other Roku3 works great on same wifi network. When it does work, takes 30 secomda or more for the roku stick to react to input from the remote and never loads videos. Only 30 day return now on Amazon prime so Im out 40.00. Worthless.", "verified": true, "helpfulness": "1/1", "author": "orange0987"}, {"rating": 4.0, "review": "Good, but need another and cost went up?? In short time!", "verified": true, "helpfulness": "0/0", "author": "Diane Gagliano"}, {"rating": 2.0, "review": "The Roku way slow to respond and the remote rarely worked.  The apps were glitchy and limited.  I replaced it with a Chromecast for less money and am much happier.", "verified": true, "helpfulness": "0/0", "author": "A. Gift For You"}, {"rating": 5.0, "review": "Love my Roku streaming stick!  Easy to use, even my 5 yr old granddaughter can navigate and get to her favorite channels & shows!  Has pretty much replaced my DVD player, because all the dvds I purchase have digital downloads which we access through VuDu.  No more scratched or misplaced dvds!!!", "verified": true, "helpfulness": "0/0", "author": "T. Thompson \"Guinan\""}, {"rating": 1.0, "review": "The device didn't work out of the box, returned it and got a new one that has worked flawlessly!  Buyer be ware!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent streaming stick.", "verified": true, "helpfulness": "0/0", "author": "Carlos \"cam2c\""}, {"rating": 5.0, "review": "Got this for my client who wanted internet TV and to cut the cable/satellite service.We got the Google Chromecast unit first but the learning curve was too steep.With this unit I had them up and running in less than 15 minutes.East Peasy setup and use for Senior Citizens [non tech geeks]", "verified": true, "helpfulness": "0/0", "author": "Kona Mike"}, {"rating": 5.0, "review": "this is a MUST have! when there is nothing on the TV and you can watch what you want when YOU want it. NO COMMERCIALS!", "verified": true, "helpfulness": "0/0", "author": "Greenbank Mayor"}, {"rating": 3.0, "review": "Product seems like it is a good product. I contacted the Roku company prior to my purchase to make sure this was what I needed to solve my issue. After my purchase I discovered that I was mislead on several issues. I had numerous 24/7 Chat Window chats with Official Roku Techs, and was given evasive and inaccurate information. I had to make phone calls to Roku, email Roku, have live chats, and also contact the Marketplace seller before I finally returned the streaming stick. My issue was the tech support. They like to promote and sell their product but their customer support was lacking. I kept being faced with the online requirement of setting up an account and submitting my personal financial information BEFORE Roku would agree to activate the streaming stick. If you refuse to set up an online account, then they refuse to activate their product. That allows them to charge your card at will for services and products. I didn't like their terms, the tech support was insufficient and the product seemed problematic (it was a refurb) the whole process was difficult, so I contacted Amazon and asked for a full refund, which I received. An electronic product is only as good as the tech support. The Marketplace Seller was okay.", "verified": true, "helpfulness": "0/0", "author": "A. Johnson \"Mrs. J\""}, {"rating": 4.0, "review": "Product works fine. Installed mine on the side of a wall mount TV using the USB for power. No problems with power, streaming or remote. You can use Roku Streaming Stick instead of using/renting a Time Warner Cable Box. I would purchase again from seller", "verified": true, "helpfulness": "0/0", "author": "Michael Spine"}]