[{"rating": 5.0, "review": "I got the Roku after reading how I could stream Amazon Prime Videos through it.  I had Chromcast and all  I could stream with that was Netflix.  So far so good, hooked up quickly and great picture.  I have not tried streaming Amazon yet, but will update this review when I do.  I also saw that I could stream some of my Video podcast, will have to try soon.  Well worth the money.", "verified": true, "helpfulness": "1/3", "author": "Interested in a Wide Range of Subjects \"I am a happily married women with two grown children and a wonderful husband.  I enjoy reading, knitting, sewing and travel.\""}, {"rating": 4.0, "review": "I am not sure just how long Roku can make money on these with the smart TV/Bluray players out there but it does have a lot of apps on it and it provides an excellent picture to my 55\" led lcd 3d tv.I hade some trouble getting it to work on my wifi though. Had to use the forum at Roku to get it figured out, no FAQ with answers to a problem many people have with the Roku either new or after updates. I doc a start for that due to every other tv, disc player, ipad and phone I have connect to the wireless is seconds and without any hassle.  My 7 year old grandson even has a toy that will and he connected it himself.  The Roku should do that but doesn't all the time for everybody.", "verified": true, "helpfulness": "0/2", "author": "saw4846"}, {"rating": 5.0, "review": "It's the Roku interface in a compact design.  I'm not sure why people keep comparing this to the Chromecast.  The only thing they have in common is the form factor.  Functionally it has more in common with the Apple TV than anything else.Anyway. This is a great device. I bought it to use with a projector but am testing it out on a TV.  Setup was super simple.  Plug it into the HDMI and plug the power into the USB port on my TV.  My TV's USB port stays on after it's turned off so I don't have the issue some others have where the Roku has to startup when the TV is turned on.The remotes non line of sight feature is handy given how this device is meant to install. That said it also makes it impossible to add to my Harmony remote if I wanted to.", "verified": false, "helpfulness": "1/3", "author": "C. Phillips"}, {"rating": 5.0, "review": "So far so good on day one,  Netflix, Hulu Plus, and Vudu look fantastic and in 1080p.  For some reason Amazon prime will only stream in what looks like crappy standard def, hopefully a firmware fix is coming.Is a little slower than my Roku 3 but needed this one for a tv without wire internet.If you do have a wired connection to your tv area get the roku 3, and if you need the wireless connection get the 3500RReplaced my chromecast on this tv so now can do amazon prime and Vudu, and love having an actual remote.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer \"deano\""}, {"rating": 2.0, "review": "I just received this , so far I give that 2 star because that easy to set up , but the connect to Netflix so slow not like roku 2 or another product of roku , the best thing I like is small and you can hide that behind your tivi no one see that on wall but the bad thing is this slow when you try to connect to watch stream live video that doesn't what speed you on  .", "verified": true, "helpfulness": "3/5", "author": "Quang Tran"}, {"rating": 4.0, "review": "I made the set up harder than necessary because I did not think to insert ROKU directly into my tuner.  Once I figured out where to connect the ROKU the setup was easy.  I was going to use my iPhone as a remote, but I love the ROKU remote.  The remote fits my hand perfectly, and the feel of the buttons is wonderful.  This is the best designed remote I have ever used.I gave the ROKU 4 stars based on content.", "verified": true, "helpfulness": "7/9", "author": "L. Bell \"Gadget Queen\""}, {"rating": 5.0, "review": "Amazing. I recently decided to give Roku a chance, although there interfaces many be a bit old fashioned the product works greats.", "verified": true, "helpfulness": "0/1", "author": "Micah"}, {"rating": 1.0, "review": "UNLIKE AppleTV which worked \"out of the box\", when I plugged the Roku Streaming Stick in nothing happened.  I go to online support and find I am 31st in the support queue (a 40 minute wait.)  This is a dead stick with useless service (worse than Verizon which must be the worst company in the world.)", "verified": true, "helpfulness": "9/35", "author": "Matthew Davidge"}, {"rating": 3.0, "review": "PLEASE SEE MY SIX MONTH UPDATE AT THE BOTTOM OF THIS REVIEWI want to give this five stars, but I can't. I pre-ordered this from Roku the day it was announced. It is pretty much exactly what I wanted, most of the features of the Roku 3 (which I LOVE), but in a small package that can be hidden behind the TV and powered by the USB port. You may know that Roku took an earlier stab at this with a device the required an MHL port (kind of a super HDMI port), this meant it only worked with some TV's and the device never took off.I don't know if the very inexpensive Google Chromecast was the push that Roku needed to try to get the Roku Stick right, but sure enough they are back with a device very similar to the original stick but that uses USB and HDMI, instead of the MHL port. So far so good... It should work with any TV that has an HDMI port, but there is no Ethernet so make sure your Wi-Fi is solid.I received this in the mail today and immediately started setting it up. This process took much too long compared with my setup of the Roku 3 a few months ago which was easy and FAST. I had some trouble getting the device to connect with the remote (I think it was confusing my Roku 3 remote and the newer Roku remote, I finally took the batteries out of the older remote to ensure they didn't stomp on each other).With the remote connected, I moved onto Wi-Fi, it connected to the Wi-Fi but would not connect to the internet. After going through all sorts of attempts and settings, I decided to hotspot to my phone to see if that would work, and this allowed me to run the Roku updates and load in the channels. After the software update was complete, I connected back to my regular house Wi-Fi and all was well! So this must have been some kind of issue with the combination of the initial Roku Stick software and my network.After the network was updated then it was on to setting up the individual accounts (Netflix, Amazon VOD, and iHeartRadio being the important ones for us). So I would love to know why Roku does not store the login information and transfer it to all of my devices? (UPDATE: In the comments to this review it was mentioned that Roku does not store ANY of your account information to protect your identity. This is plausible and likely true, but it would be nice if setting up a new device was simpler.)But no, you have to do this manually. Going through this process brought me to the thing that I am really worried about: the response of the remote sucks, it sticks, it lags, and sometimes you are waiting a long time for it to catch up with you. I cannot EVER recall waiting on the Roku 3, at least in regards to responding to commands from the remote.The last concern I have is the size of the stick and it's fit in the TV. I didn't imagine this would be an issue, and hopefully it won't turn out to be, but when I installed it in the back of the TV, the fit was very tight and there was noticeable pressure put onto the USB cable and the HDMI connection. I am hopeful that this will not cause any issues going forward and I may look at moving it to a different HDMI port to see if there is a better fit, if you encounter this problem, you may want to look at getting a short HDMI extension to avoid putting undesirable pressure on the device.The Good:-Roku's software and interface are the best I have used, and this is exactly like the Roku 3-Streaming quality seems to be very good thus far-I've tested all the services we use, and though the setup was tedious everything works and the quality is excellentThe Bad:-The installed software that needed immediate updating has issues-Initial setup was NOT smooth (I have done this before, so it should have been!)-Device response to the remote can lag a lot (this may be the thing that ruins the stick for me)This device is BRAND NEW, so I am willing to be a little patient with Roku, hopefully as they roll out more updates in the next few weeks some of the issues will be worked out, the remote lag is a MUST fix. People will abandon a device that seems flaky (this is why I am getting rid of my Apple TV's). I am kind of surprised that all of the reviews so far have been almost completely positive, at this point I am a bit disappointed when comparing this to my Roku 3.After a few weeks and hopefully some updates, I will revise this review, I am hopeful that I will be able to add more stars, but the jury is out on that until I have lived with the device for a while.UPDATE: October 15, 2014 My Almost Six Month UpdateI have not quite given up the device (we still use it all the time). However, if I were making this purchase now I would not buy the Roku Stick, I would buy another Roku 3. It turns out that the Roku Stick has a MUCH less powerful processor than what is in the Roku 3 (a device that is almost a year older). The specs were not released until after the device was on sale as far as I can tell. Were this device to have the power of the Roku 3 (maybe next year!) I would recommend it.A few issues and work-arounds:-Start-up is SLOOOOWWWWW. I initially had it powered by the USB port on my television. This meant waiting at least a minute from turn on time to watching a show. Way too long. What I have done instead is powered the Stick from a regular power outlet and the USB power supply. This means as soon as you turn on the TV it is ready to go.-It has periodic crashes, mostly this just means it won't do anything. So at least weekly restarts are required. While many people are used to this these days it shouldn't be this way. I restart most of my computers at most once a month and often I go months between restarts. The Roku should be less fragile than it is (the Roku 3 IS less fragile).-The Netflix app, in my opinion, is too demanding for this device. This is particularly noticeable when rewinding a video (at least at 1080p) which is essentially impossible. It just doesn't work. You lose control of the remote and the rewind just doesn't work. I am considering moving this to a 720p TV, it may work better with a smaller fire hose of video attached.-Amazon VOD in contrast to Netflix works pretty well on the Roku Stick. I have far fewer issues with Amazon, so if that is your primary video source, maybe this isn't such a bad idea.-I use this on a 1080p TV with a FAST connection to the internet. Once the video is playing, the quality of video and audio is EXCELLENT. It looks great, and once it is rolling everything is fine as long as you don't want to do a quick rewind (which won't work).-I had an issue with the device not fitting well into an HDMI port. I switched it to a different port, fortunately my TV has several, and it fits fine there, in the comments several people mentioned that you can buy (and maybe request from Roku) a small HDMI extension cable if it will not fit in your TV. I didn't need to do that, but some people might need to do so.", "verified": false, "helpfulness": "1/112", "author": "Jeffrey M. Welch"}, {"rating": 5.0, "review": "This is the perfect companion for Amazon Prime. Amazon Instant Video in glorious HD. I have barely scratched the surface of the capabilities of this device - mostly using Amazon and HBO-Go. I have installed the Linux version of the Plex server which enables streaming from PC to HDTV.Hardware is a snap but SETUP WAS A MESS. Stick with it. First of all, I had to attempt to connect to my WiFi several times before it worked - only to update the software and have to do it all over again. Authorizing Amazon requires a combination of Roku and your web browser.I have this plugged into my receiver rather than the TV. This way I am getting full Dolby digital sound. Try the Android app. It's rather nifty.", "verified": true, "helpfulness": "0/1", "author": "Eyeconic"}]