[{"rating": 5.0, "review": "This works so much faster than the Roku II that we have had for several years. Movies on Netflix load quickly even using WiFi!", "verified": true, "helpfulness": "0/0", "author": "Eve B Mayes"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "susan"}, {"rating": 4.0, "review": "This product is nice and works good. The only thing I dont care for is the layout of netflix. There is to much going on, it needs to be simplified. I like the apple tv better for netflix.", "verified": false, "helpfulness": "0/0", "author": "Ben Miller"}, {"rating": 4.0, "review": "The only reason this is getting 4 stars instead of 5 is because it was a PITA to get set up. I was connecting just fine to my wireless network, but it was NOT connecting to the local network. I will say, however, that the Roku online customer service was great. After I stubbornly looked around and tried to fix the problem on my own for a while, I went onto the Roku chat help line and a rep got me straightened out and the problem fixed in about 15 minutes.Once I FINALLY got the system set up on my TV, which should have been a more straightforward endeavor, the Roku stick is fantastic, easy to use and responsive. I'm so glad I got it!", "verified": true, "helpfulness": "0/0", "author": "Shelley Seale"}, {"rating": 5.0, "review": "Absolutely love the Roku! It has changed our TV viewing experience, and is very easy to set up and use! I notice no issues with the refurbished status. Will purchase another in the future.", "verified": true, "helpfulness": "0/0", "author": "Fashionable Athlete \"Ashley S\""}, {"rating": 5.0, "review": "The Roku stick works flawlessly. We have purchased them for 3 tv's without disappointment. They are easy to install and provide access to many streaming channels. We have never had an issue with any of them.", "verified": true, "helpfulness": "0/0", "author": "Deborah A. Walters"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Minerva L Irace"}, {"rating": 5.0, "review": "complete package, easy install, excellent streaming!!", "verified": true, "helpfulness": "0/0", "author": "Steen E. Mortensen"}, {"rating": 4.0, "review": "Love the idea- batteries die too fast- like the options of programming amazon prime- Netflix - Hulu + more", "verified": true, "helpfulness": "0/0", "author": "rose"}, {"rating": 5.0, "review": "Product in excellent condition. Working great.", "verified": true, "helpfulness": "0/0", "author": "Ann Chandler"}]