[{"rating": 1.0, "review": "We already own a Roku 3 and it works great, but this little stick is worthless.  It was not worth 2 hours of my time to discover it is obviously defective.  It will not do the required software update (error code 011), so I tried the whole secret screen thing and tried that way.  That resulted in error code 006, so some people recommended a factory reset and so I did that via the secret screen.  Now it sticks on select language and will move no further.  Calling India isn't worth my patience, so I'm returning it.  I wouldn't recommend it.", "verified": true, "helpfulness": "3/3", "author": "K. Rennie"}, {"rating": 5.0, "review": "at first it wouldn't work. then  peering into the innards of the computer revealed that the wan port on the computer tower had been disabled. hours of redoing finally abled it and all has been peachy keen .", "verified": true, "helpfulness": "0/0", "author": "epiphyte \"palate\""}, {"rating": 1.0, "review": "Save yourself some money and DO NOT BUY THE STICK. My old Sony streaming media player works better than this one. The HDMI stick will drop connection frequently causing me to restart my router.", "verified": false, "helpfulness": "0/0", "author": "Anindya C."}, {"rating": 5.0, "review": "Works as described", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 3.0, "review": "My streaming stick has stopped working after only 8 months of infrequent use. First it lost picture then it lost audio. The HDMI connector appears a little bent. My thought is that it sticks out horizontally from the TV port and is further weighed down by its power connection, so all the mechanical stress is on the HDMI connection joint. Not so bad for vertical ports like most side ports on TVs, but the joint is most stressed if the port is horizontal (parallel with the floor.) I wonder if this a known design flaw? I have an early model. Has there been a design improvement that strengthened the HDMI connection? The device has been used rarely - just for travel - and no children have been near it.Otherwise, I found it quite handy, except you cant load video files on it or stream files from a USB port like the full-sized Roku players. A way around this is a portable hard drive that provides a wireless connection, such as the Seagate Satellite.", "verified": true, "helpfulness": "2/2", "author": "chemess"}, {"rating": 4.0, "review": "I really do like this little tool. It is well worth the money.", "verified": true, "helpfulness": "0/1", "author": "Bob"}, {"rating": 1.0, "review": "A very disappointing purchase.  The Roku wireless would not accept my wireless password; I also received an error message after connecting to the internet through a network that was not password protected.  After hours of troubleshooting this error message I decided this just wasn't worth the aggravation.  I'm sure the 15 minute set up time they proclaimed is right on for folks that don't have these issues, but it seems to be a crap shoot with respect to whether or not you will be one of the lucky ones.", "verified": true, "helpfulness": "1/2", "author": "Ingenious Mr Toad"}, {"rating": 4.0, "review": "The only problem I've had is the radio link fades out sometimes. Would like a version that could be connected to the network with Cat 5 cable.", "verified": true, "helpfulness": "0/0", "author": "Russell E Brock Jr"}, {"rating": 4.0, "review": "Works Good", "verified": true, "helpfulness": "0/0", "author": "AnkS"}, {"rating": 2.0, "review": "Didn't work, either the remote (changed batteries 2 times with new batteries) it would work a second (remote) then not. Could be the stick. So I gave up and went back to my Roku 2 box. That works. I'll probably will need to buy a NEW stick if and when my Roku2 box stops. Thought the stick would be a good change. So I shouldn't fix whats not broke..haha.", "verified": true, "helpfulness": "0/0", "author": "Alfred G Maynard Jr"}]