[{"rating": 4.0, "review": "Picked this up at Fry's the day they put it on the shelf, Amazon hadn't even released it yet - score!  It does exactly what it is supposed to do, stream Netflix, Hulu, Amazon and any other app channels you choose to download.I found it very quick and easy to set up, and I did not have a previous Roku set up. The remote is responsive and does not lag, it does not take a long time to load so long as it is coming from Standby, and it has no affect on my OTA channels.Everyone's equipment set up is different, and I think a lot of the problems mentioned are somewhat, if not all, attributed to user error. Give it a try for yourself!I did take one star away for the Roku rep who was on hand in my local Best Buy store answering questions. She INSISTED to myself and other people that you could get Disney Channel through the Roku without having cable. This is NOT true. I'm sorry - educate your reps better please.", "verified": false, "helpfulness": "0/2", "author": "AT"}, {"rating": 4.0, "review": "Have a Chromecast, which has been great also, but this is so much easier to configure.  Quality so far so good.  I travel a lot and have only used it a few time, but it works great.Cons: Little slow at times.Pros: Saves WIFI Passwords, Onscreen Guide, Use without phone laptop or tablet!", "verified": true, "helpfulness": "0/0", "author": "Biged"}, {"rating": 5.0, "review": "Pros: Setup was a breeze. I opened the box, removed the dongle and charging cable, connected both to my tv, ran the setup and was done in a few minutes. Afterwards you will need to sign in to any apps you may have accounts with and explore for new channels to add to your list. I would recommend searching for private channels to add as you may find one that suit your interests.Cons: Some of the apps are slow to load. Some people will have issues with the size of the dongle as I am unable to use the adjacent hdmi port because of the width of the unit. I'm sure an adapter will resolve this issue.It has some flaws but I can look past those for the price. Easy setup and portability make this purchase an no brainer.", "verified": true, "helpfulness": "0/0", "author": "Anthony Vernon"}, {"rating": 5.0, "review": "Having Chromecast, it's nearly identical in its size and how it connects.  It's simple to do.  Not needing a IR remote, the Bluetooth remote is ideal that is provided especially because this is hiding behind the tv out of site.  My other 3 rokus are boxes placed in plain view, but this works equally as good as any other roku and has no lack of features or function and I don't know how, but the size of it....it's mind boggling when I weigh it or put it in one hand and my others in the other hand.  Hard to believe a set top box roku...the others until this came along, is so light, so small and yet provides everything that roku is good for.  The latest software (or firmware) is set for it, and an amateur can easily set this up.  I would recommend this for people either travelling or wish to have an additional set top box not in sight..which certainly pleases those who don't have room or prefer no clutter.  Very impressed.", "verified": true, "helpfulness": "3/4", "author": "Chris Bold"}, {"rating": 5.0, "review": "It might be small, but it works like a charm.  Very easy to install.  Just plug it in, wait for the software update to download, then follow the instructions on the screen.  We were up and running in a jiffy.  So happy we decided to give this a try.", "verified": true, "helpfulness": "0/1", "author": "Janet Slivoski"}, {"rating": 5.0, "review": "Own three older versions of Roku. Have been very happy with those. Upgraded TV to a wall mount version. This new Roku is perfect. No exposed wires or box to deal with. We had also purchased Google Chromecast. I prefer the Roku over the Chromecast. In my opinion it all comes down to Roku has a remote and Chromecast does not.", "verified": true, "helpfulness": "4/5", "author": "ohioleck"}, {"rating": 5.0, "review": "I am not sure why I was not expecting all that much from this device? Maybe it was the price or the size. All I can say is WOW! Was I pleasantly surprised. First of all I own a Roku 3 which is the best of the Roku line so my comparison is based on that device. In short the Roku 3500R was every bit as good at doing what a Roku does (Streaming) as the Roku 3 at HALF the price. On top of everything else the Roku 3500R Streaming Stick is 'currently' the only other Roku device that supports the \"official\" YouTube channel. Now understand that it has limitations. It does NOT have a USB port, Ethernet port, Micro SD slot, motion control controller or the an earphone jack on the controller. But really up to this point I the only ONE of those options I have used and only a few times is the earphone jack on the controller. So I don't miss them on the stick.The performance of the stick has been flawless in every regard and in comparison to the Roku 3 barely noticeable. I saw the tiniest bit of lag in scrolling through the channels but really it's so slight that I could be imagining it. The bonus item on both these devices that is a MAJOR plus is the YouTube channel (not available on any other Roku currently). It works flawlessly and it brings all the ENDLESS content of YouTube to your HDTV (Awesome). A few more things that I don't think most people know is that they can stream content from Android and IOS (Apple) devices (pictures and music only). Second you can stream Video, Music and Pictures from Windows computers using Windows Media Player. Check my YouTube channel Richard Lloyd to see my video review. Sorry Amazon TV and Gary Busey but if you use your Android or IOS (Apple) device with the Roku remote app you can talk to search on this or any other Roku Device too.", "verified": true, "helpfulness": "4/6", "author": "Richard Lloyd \"Youtube Producer\""}, {"rating": 5.0, "review": "I was deciding between the two sticks for streaming, Chromecast and Roku. This Roku stick blew the Chromecast out of the water. I still wanted the remote interface that I enjoy with Roku and the access to all of the channels that are in my account. With this roku stick you can still send videos, photos, and music to your tv. All of which worked flawlessly. When I had the Chromecast things wouldn't load or give me a screen stating that there was some junk issue. I updated from the HD and this is amazing. Well worth the $50.", "verified": true, "helpfulness": "2/2", "author": "Zach"}, {"rating": 5.0, "review": "Just got my Roku 3500R in the mail today, so far it is nothing short of amazing.  Set up is a breeze, if you are new to Roku, go to their website and create an account.  Using your remote with no keyboard will take forever.  When it comes to streaming, the picture is clear and crisp.The main reason I bought this product was for the WWE Network, after watching it all evening I can say it was well worth it.  WrestleMania will be a blast watching on Sunday using this new Roku.", "verified": true, "helpfulness": "1/2", "author": "Randy \"dgenx321\""}, {"rating": 5.0, "review": "When Roku last had a stick, it was for a specialized HDMI port that was specialized for only limited TV's.  Of course the majority of us have many HDTV sets that could use a boost to being \"Smart,\"  but without that very dedicated slot.Enter the 3000R model, it fixes the limitations.  All it needs is a power outlet nearby, plug it into and HDMI port, have a good wifi/broadband package, and it works great.A key benefit of Roku is the ability to add channels from a multitude of places, not just a limited pool of Apple approved apps.  Can't tell you how great it is to have freedom of choice.  To have multiple services to be able to use.You cannot get: Amazon, MGO, Blockbuster, Target Movies, Epix, VUDU, Spotify, Pandora, Slingplayer for Slingbox and countless more independent content on Apple TV.  For $49, its a great device.  It works well and is easy as pie to add on to your existing Roku account if you have one.I may get a second one.  It works well and is more open than alternative choices.", "verified": true, "helpfulness": "9/12", "author": "Candle Man \"Why not enjoy a nice scented candle?\""}]