[{"rating": 5.0, "review": "Great product - just works", "verified": true, "helpfulness": "0/0", "author": "Mark Williams"}, {"rating": 3.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Luis Alberto Rodriguez"}, {"rating": 5.0, "review": "Love them. I've got one for every TV in the house. And, we take them on vacations to use at the beach house which has limited channels.", "verified": true, "helpfulness": "0/0", "author": "Gala"}, {"rating": 4.0, "review": "Meh.. sucks there's only a few channels you dont have to pay to enjoy the roku experience, but its nice when you want to work out and it automatically syncs with your phones music.", "verified": true, "helpfulness": "1/1", "author": "Luis Zayas"}, {"rating": 5.0, "review": "We love it. Works geeat. Perfect condition for a refurbished model.  We got it specifically to watch jw broadcast.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Granger"}, {"rating": 4.0, "review": "It's amazing!", "verified": true, "helpfulness": "0/0", "author": "Kingsley Brand"}, {"rating": 5.0, "review": "Gift to my daughter. She loves it.", "verified": true, "helpfulness": "0/0", "author": "Tom Ramirez"}, {"rating": 5.0, "review": "Works great and I use it all the time. Much more convenient than my cables On Demand feature.", "verified": true, "helpfulness": "0/0", "author": "kay"}, {"rating": 5.0, "review": "Working great so far and received in a timely manner!", "verified": true, "helpfulness": "1/1", "author": "tara jarrett"}, {"rating": 5.0, "review": "Actually haven't used it but I use Chrome, which is awesome.  Gave Roku stick to kid as gift and he loves it.  Stupidly, I thought Chrome had a superior feature since it does not come with a remote control; the last thing I needed, I thought, was another remote.  Well, obviously in hindsight, you can too control a Roku via smartphone app OR with a standard remote.  Advantage of remote is that guests with no experience would be hard-pressed to learn the Roku app -- plus I understand there are still people who don't own a phone.  While I'd keep the remote tucked away and strictly use the phone app, the remote controller would be essential for most of my (admittedly dim-witted) guests.Chrome \"cast\" feature works well BTW.  I guess Roku's rich content renders casting less useful, just mentioning FWIW. Doubt you could go wrong with either.  Note only Roku natively supports Amazon vid.", "verified": true, "helpfulness": "0/0", "author": "Robert O'Connell \"Mr. Consumer\""}]