[{"rating": 4.0, "review": "I bought the Roku 3500R because I wanted to stream my amazon prime videos at the office while I worked.  I previously bought google chromecast at a lower price--that worked great--but it didn't allow for amazon prime streaming.for my purposes--this works fine.  However, there are a couple of a caveats--I only use amazon prime on roku device.  so my experience/review is limited to amazon prime compatibility with roku.a couple of odds and ends--the remote control is pretty cool and allows you to search on screen for the movies you want.  but it has dedicated buttons for \"mgo\" \"Netflix\" \"blockbuster\" and \"amazon.  Netflix and amazon I get--but I never heard of mgo and I thought blockbuster went out of business.in short--this is great way to stream amazon prime.  However, if you want to stream Netflix--I recommend you get google chromecast--its less expensive and streams just as good as roku.", "verified": true, "helpfulness": "0/0", "author": "cortez"}, {"rating": 5.0, "review": "We absolutely love this product! We cut the cord and now receive local stations from an antenna, and most of the other  we would watch now come in  free through the ROKU.", "verified": true, "helpfulness": "0/0", "author": "Rodney Ballance"}, {"rating": 5.0, "review": "I'm very please with this purchase. Not only do I now have another smart tv without spending the money, but I didn't need to order another cable box, as all my cable channels (including my premium channels) come thru the Roku. I plan to buy one for my guest room next.", "verified": true, "helpfulness": "0/0", "author": "Rai C. Myers"}, {"rating": 5.0, "review": "I have a Samsung \"smart tv\" and the hub for using apps is horribly slow. The Roku is fast and simple to use and install. It made my TV like able again. If you have a Samsung Tv with Smarthub disable the internet connection to the TV or the Smarthub will update without you realizing it and interrupt whatever you're watching on Roku.", "verified": true, "helpfulness": "0/0", "author": "North Texas Girl"}, {"rating": 4.0, "review": "The compact size and USB power make up for the slow boot time. It also had the most features for the price.", "verified": true, "helpfulness": "0/0", "author": "college  student"}, {"rating": 2.0, "review": "It works... when it works.  Unfortunately, the streaming stick reboots every time I try and use Netflix, and more often than not when I try to access Amazon.com.  I ended up returning it.", "verified": false, "helpfulness": "0/0", "author": "Global nomad \"S\""}, {"rating": 4.0, "review": "This is an excellent performing device for its size. Very easy to use with the massive library of Roku channels behind it.", "verified": true, "helpfulness": "0/0", "author": "Zach Boswell"}, {"rating": 2.0, "review": "First off, set up is more or less easy. UNLESS you have a A/V receiver involved. Then audio is a nightmare. I still have issues with audio.Now, as stated above, I bought it because this is the only service with HBOGO and Showtimeanytime. Showtime works fine, the sound is quiet so I have to turn it way up on my receiver, but that's fine. Now onto HBOGO, this for me was the reason I gave it 2 stars, borderline 1. ALL the other apps other than Amazon I have seen absolutely zero issues with. Amazon doesn't stream audio on 5.1 supported movies, but my PS4 has it so no biggie. But HBOGO is absolutely awful on this. The audio skips for at least 5 min before smoothing out, oh and thats out of the TV speakers as the audio never stops skipping out of my reciever. Here's the best part! Even after it stops skipping, it lags about 30 seconds behind the video. So it's unwatchable. AWESOME! Wish I would've know this when I bought it. Would've just waited for GO to come to PS4. Don't buy this if you want to use GO or Amazon a lot. You will be very disappointed.-Update: After messing with the audio setting all day, I figured out that most of the issues come from 5.1 streaming. HBO and Amazon work fine on stereo settings. I can't bring myself to give it more stars though. The troubleshooting guides don't offer any help on this issue. I have a $3K audio setup because I like to use it.", "verified": true, "helpfulness": "1/1", "author": "Jim"}, {"rating": 5.0, "review": "Very happy with my purchase. It works well and I haven't had any issues with it. I don't use it daily, but when I do watch movies I am satisfied.", "verified": true, "helpfulness": "0/0", "author": "Jazey13 \"Jadiac\""}, {"rating": 4.0, "review": "Other than some programs or movies that take a while to stream, I am enjoying my ROKU product.  I don't watch much regular TV, and this allows me to see many television series I never got a chance to see because I have not had cable in a while.  The cost of the ROKU was right for my budget, and although I was required to purchase a router because I had a DSL modem; I have very little to complain about.The technical advice for the ROKU I receive from Amazon is great, as the problems I do address are resolved.  I plan to continue to watch television using my product.", "verified": true, "helpfulness": "0/0", "author": "Brenda Steele \"Brenda\""}]