[{"rating": 1.0, "review": "Poor quality remote. Have gone thru 4 sets of batteries in 3weeks. Roku customer service refused to help me. I'm now using Amazons Fire Stick.", "verified": true, "helpfulness": "2/2", "author": "G. Perkins"}, {"rating": 2.0, "review": "Just buy a Roku3, this thing works well, but is too slow for my tastes.", "verified": true, "helpfulness": "0/0", "author": "Htur05"}, {"rating": 5.0, "review": "Okay, so good things first.- At under fifty dollars, it isn't that expensive. And while the Chromecast and Fire Stick may be even cheaper, the Chromecast has no remote while requiring the use of your phone, and the Fire Stick plays only Amazon Prime content. Which brings me to my second point...- The library of available content providers is impressive. Some you'll obviously need subscriptions to, like Netflix, Hulu, Amazon PRime, et cetera, but there's also a lot of free content on there, too, including PBS. In fact, one of my apps is for the Slingbox, which allows me to watch non-on-demand programming from anythwere my Roku's plugged in. And you can search through all that content--for actors, movie titles, et cetera--from a single search bar.- The shortcuts on the remote make reachign my Netflix and Amazon Prime content even quicker and easier. Which brings me to...The bad.- There is no need for a Blockbuster button on this remote. What should be there is a Hulu button. Or even an HBO Go button. Something someone would actually use. Blockbuster's hanging on by its fingertips. I have no need for that button.- The remote has no headphone jack. This existed on the Roku 3. It's not like they would've had to figure out a whole new system. Just put the headphone jack in. I'd be willing to pay five more dollars for that.- The setup feels like it could've been streamlined.Now, even though I've outlines all my complaints above, I still  haven't subtracted any stars. Because honestly, none of those downsides manage to take away from the awesomeness which is this product. If you're buying for a friend, feel free to get the Chromecast or the Fire Stick or whatever. If you're buying for yourself, get the Roku Stick.", "verified": true, "helpfulness": "0/0", "author": "Jesse B."}, {"rating": 5.0, "review": "I have purchased at least five Roku devices of various types. I love these little things! My daughter is using two (the set up box styles)...one for HDMI and the other with the RCA (red, yellow, white) connectors. She and her kids say the DO NOT miss the [overcharged] subscription service they had. I recommend that users research OTA (over the air) TV before investing in it as it may not be for everyone. However, it saves BOATLOADS of money! Roku apps are available on startup, Netflix, Crackle, and YouTube being among them. Some apps offer access to subscription services, some are free...its up to the user. Many categories of entertainment are indexed, searchable, available at the Roku App Store, and available. Pricing was great, delivery was fast, and packaging was secure.", "verified": true, "helpfulness": "0/0", "author": "Dwranny \"Dwranny\""}, {"rating": 5.0, "review": "Purchased this as a Christmas present for our son. He immediately hooked it up and used it almost every day. Great for any tv", "verified": true, "helpfulness": "0/0", "author": "Celtic Cutie"}, {"rating": 5.0, "review": "I love it, since I don\"t have cable in my kitchen, this work very well for me. Ithe my movie and catching up on missed TV programs, I would remind it to everyone, best buy I ever made", "verified": true, "helpfulness": "0/0", "author": "brenda johnson"}, {"rating": 5.0, "review": "I love this!!  Saves SO MUCH MONEY!!", "verified": true, "helpfulness": "0/0", "author": "LindaG"}, {"rating": 5.0, "review": "this improves and expands my smart tv performance.", "verified": true, "helpfulness": "0/0", "author": "Gwen Luikart"}, {"rating": 4.0, "review": "LOVED this at first! But now having issues w/ having to reset often! Aside from this, I love it! Easy installation; Roku customer service good, though outsourced in India so language barrier can be a bit frustration so be patient. Another issue is that my iphone Roku app doesn't see it on the network only my Roku 2 which is downstairs. :-(", "verified": true, "helpfulness": "0/0", "author": "Ennui"}, {"rating": 5.0, "review": "It is very good. A detail: those who want to buy for use outside the US or Canada have to make a DNS settings you to use Netflix or Amazon. Since it is not released for the rest.", "verified": true, "helpfulness": "0/0", "author": "Carlos Quinto"}]