[{"rating": 5.0, "review": "This has been an excellent experience./", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Bought my first ROKU in 2009 (and it's still in use.) Have since added two of these Streaming Sticks and bought another one as a gift. Cut my cable bill in half over five years ago and have saved about $4800. We rarely watch \"regular\" TV anymore - ROKU is so much better!", "verified": true, "helpfulness": "0/0", "author": "L. Allen"}, {"rating": 5.0, "review": "My daughter loves the Roku... streams all her shows and she is thankful to have it.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lana B Christmas"}, {"rating": 1.0, "review": "Worked fine for a couple months then started shutting down, not a lot at first but now it's every 5 minutes. Thinking about adding a heat sink to see if that helps but I should not have to modify brand new electronics.", "verified": true, "helpfulness": "0/0", "author": "Stephen Holley"}, {"rating": 5.0, "review": "Love it. Great item I got was a gift for someone. Thinking of getting the Roku 3 for myself.", "verified": true, "helpfulness": "0/0", "author": "Rifford"}, {"rating": 5.0, "review": "works great! Like this product a lot.  was easy to set-up and use.", "verified": true, "helpfulness": "0/0", "author": "annie"}, {"rating": 1.0, "review": "I discarded the roku. It was unreliable and only worked part of the time.", "verified": true, "helpfulness": "0/0", "author": "benson zeikowitz"}, {"rating": 5.0, "review": "Did everything I expected & more. Plenty of free channels to choose from.", "verified": true, "helpfulness": "0/0", "author": "Neicy"}, {"rating": 5.0, "review": "Great product at a very reasonable price. I would highly recommend buying refurbished. The stick is already the cheapest of the Roku models so if you're in the market for the Roku Stick you're obviously looking for a budget streaming device. I don't know about all refurbished products, but with regards to the one I received from DealFisher through Amazon, I cannot tell it isn't brand new! Save even more and don't be afraid to try refurbished.", "verified": true, "helpfulness": "0/0", "author": "Marc"}]