[{"rating": 5.0, "review": "I've only had it a day or 2, but I do not know what people mean that say it's slow.  I can't imagine what they are comparing this to.  It's much faster than my blue ray player, and probably as fast as my computer.  At least with amazon prime, which is the only thing I've used it for so far.", "verified": true, "helpfulness": "0/0", "author": "kw987654321"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 3.0, "review": "keeps freezing up...I nabbed my daughters box roku since mine kept not working. It takes a longtime to process things also. I have a blu-ray player that does the same thing and it takes about 1/4 the time to load information.", "verified": true, "helpfulness": "0/1", "author": "Regina M. Thurman"}, {"rating": 5.0, "review": "Great product from Roku.  We purchased the streaming stick as part of our transition to being cable company free and in conjunction with an antenna we could not be happier.  We found the streaming stick to be our best option from a value standpoint because the other Roku products provided additional features we just did not need (playing games, headphones in remote, etc).  If you are looking for just viewing content and do not need any of the other features the higher priced Roku products provide this is the right one for you!", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Awesome little device! Setup was a breeze. Working flawlessly so far, no lag. Very user friendly, the remote is very handy as well.", "verified": false, "helpfulness": "0/0", "author": "RSB"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Tatyana Sobolevky \"Taty\""}, {"rating": 5.0, "review": "I have cut the cord so to say. No more Satellite for me! I switched to an antenna and this. If it broke, i'd be online ordering another one right away! I have a \"smart\" Samsung TV, which has a lot of the same apps, but this interface is so much better and the speed is great!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Shipping was fast and works great.", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Pat Crepeau"}, {"rating": 5.0, "review": "So awesome. I love it.", "verified": true, "helpfulness": "0/0", "author": "Aaron Wilder"}]