[{"rating": 4.0, "review": "good price, crashes sometimes but overall performs very good.", "verified": true, "helpfulness": "0/0", "author": "Hi-sing"}, {"rating": 2.0, "review": "I bought this for my daughter, I have a roku MHL Stick, Roku 1 and Roku 3, this is by far the slowest streaming device I have come across, the features are all great Roku Apps but I suggest highly to dish out a little more for a Roku 1 or better, preferrably the roku 3 which is awesome and fast, jsut dont waste your time unless you dont mind slow loading times.", "verified": false, "helpfulness": "0/0", "author": "JOHN MCGEE"}, {"rating": 3.0, "review": "I have a Roku 2 for my TV and I decided to save some money by purchasing the less expensive Roku Stick for the TV in my spare bedroom.  What I've discovered is that you get what you pay for in terms of speed.  It is markedly slower than the Roku 2, which is frustrating.  It certainly saves space with its form, but I wish I had bought another Roku 2.", "verified": true, "helpfulness": "1/1", "author": "Sandra"}, {"rating": 5.0, "review": "Item came exactly as desrcribed and works perfect. I have a roku 3 also and there really is no difference between the 2.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install. There is a learning curve, at least for me, to navigate how it works. We love it. For the price it is great.", "verified": true, "helpfulness": "0/0", "author": "phyllis scholz"}, {"rating": 5.0, "review": "Easy to install, perfect for me as I didn't need the one that had games, the price was right.", "verified": true, "helpfulness": "0/0", "author": "JC in PS"}, {"rating": 5.0, "review": "cannot go wrong!! this thing is AMAZING!!! skip buying the fancy smart tv and get this instead!!", "verified": true, "helpfulness": "0/0", "author": "Hope McCormick"}, {"rating": 4.0, "review": "I have the original Roku and bought the stick for a kitchen tv. I have been very happy with Roku and like the stick much better. However, I have pre-ordered the fireTVstick as it looks like it may perform better than Roku.", "verified": true, "helpfulness": "0/0", "author": "get home alive"}, {"rating": 5.0, "review": "Works great. Not my first time buying refurbished but I am always impressed with the like new condition of refurbished parts. The streaming stick is very easy to share between TVs. Remote makes selections much easier than using a gaming system.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "One step closer to cutting the cord. Had an older Roku and was not impressed with it but with new tv and new Roku I was pleasently supprised.This has more content and is way faster than the old Roku and expect them to add more content down the road. I'm a news junkie and would like to see news channels live but it's not there yet. I would reccommend this to everyone.", "verified": true, "helpfulness": "0/0", "author": "F. Getz"}]