[{"rating": 5.0, "review": "Better than the Roku 2, which I also have.  I love the new screens on Netflix and Amazon.", "verified": true, "helpfulness": "0/0", "author": "Roy Stephenson"}, {"rating": 5.0, "review": "Love this little device! Easy to setup and we were able to watch Amazon Prime movies and shows within minutes.", "verified": true, "helpfulness": "0/0", "author": "Christine K \"in VA\""}, {"rating": 3.0, "review": "I would have given 4 stars if it was better at picking up a signal from ALL wireless devices.  Fortunately I have an access point ASUS in the same room.  Otherwise, you should have a strong signal router to use this for streaming.  I also have a roku3 which works much more consistently in wireless mode.  For half the price, it's a good deal though.  Also great for traveling.", "verified": true, "helpfulness": "0/0", "author": "John J Hair III"}, {"rating": 2.0, "review": "I have several Roku devices and have always been very satisfied until I bought the \"stick\". First, it performs all the functions I have come to expect from Roku - so don't get me wrong, it streams Netflix and all the other streaming media just fine - but I already had 3 other Roku models that did the same thing.  So why did I buy the stick anyway? Well it looked like it would be handy to use while I was traveling - just plug it into the back of my hotel tv and away you go... not so fast.... it seems you have to plug the Stick into a power source; so you have this very handy device encumbered by a power cable - the only power outlets neat the hotel tv are behind the cabinet and all in use, so you need an extension cord (probably a long one) to reach an outlet elsewhere in the room... that was more hassle than using my Roku 3.  The other reason I bought the Stick was to stream video directly from my tablet or phone to the TV. It turns out that unless you have an Ipad, the Stick works with a very small list of Android devices.No portability advantage and no streaming from my tablet - I'm not impressed.", "verified": true, "helpfulness": "1/2", "author": "J. F Jones \"ballast\""}, {"rating": 5.0, "review": "I had two traditional Rokus and got this one for my bedroom. I did buy an HDMI multi-plug so that I could use both HDMI outputs on the back of my TV.This stick is also very handy to take with me when I travel. I just plug it in to the TV at the hotel and can watch everything I would watch at home!", "verified": false, "helpfulness": "0/0", "author": "msd"}, {"rating": 1.0, "review": "Would have been great if it worked for more than 2 months", "verified": false, "helpfulness": "1/1", "author": "Janice"}, {"rating": 3.0, "review": "I really like this product and was really excited to get it. I think this could possibly be better than the Appletv. Until I began to try and watch shows and I could not link them because the channels would not link to Dish. Very disappointed about not being able to watch the channels I want.", "verified": true, "helpfulness": "0/0", "author": "Alexis V."}, {"rating": 5.0, "review": "Easy and we'll designed UI. Excellent selection of channels and ease of use make this a better buy than my Chromecast. While there is a place for both, I use this the most for its versatility and the remote is fantastic!", "verified": true, "helpfulness": "0/0", "author": "AmericanEagle2572"}, {"rating": 5.0, "review": "Just follow the instructions and it is do easy to set up!  Works like a charm!!", "verified": true, "helpfulness": "0/0", "author": "Jersey Boy"}, {"rating": 5.0, "review": "Terrific! This is are third roku player and they all work super. Never had the roku stick before, but set up took only 10 minutes and was up and watching all the shows we have on are other roku devices. Love the new style remote.", "verified": true, "helpfulness": "0/0", "author": "HMG"}]