[{"rating": 2.0, "review": "Worked great at first. Now it doesn't at all. Went to roku website and did everything they suggested and still nothing. Went online and found hundreds of people having same problem on exact same day as me with no results after resetting etc", "verified": true, "helpfulness": "0/0", "author": "susan m. tillman"}, {"rating": 3.0, "review": "For some reason I did not picture that I would have a power cord dangling from the end of my Stick and that with no component hookup I could not make the sound work with my older Bose system (actually it would work for a while and then crash and require an elaborate re-setup and this is Bose's fault). I am going to connect this to another TV that is \"smart\" but doesn't get Amazon Prime and I replaced this with Roku 2 which I much prefer and would rate 5 stars.", "verified": true, "helpfulness": "0/0", "author": "SF3"}, {"rating": 1.0, "review": "This is totally a crap.. I DO NOT RECOMMENDED AT ALL. Please avoid even future burning problems.All start with my purchase in a retail store. When I activated I noticed that the product was TOO HOT, but I did'nt take into account since Roku used to do good products. Then problems again each time I needed to see my programs I did notice that the Roku boot screen was resetting each time and no signal at all was present.Then I reset it... but two days later, the same issue. I needed to reset AGAIN.. so, One week later is not working not even the boot screen no reset no nothing.This is my last purchase with  ROKU. I will switch to Cromecast and my old but worthy Apple TV.", "verified": false, "helpfulness": "3/5", "author": "Mark Sampras .:: MXUSMX ::. \"AMAZON MEXICO\""}, {"rating": 1.0, "review": "What a disappointment. I bought one of these as a gift for a family member. I've had an older Roku for several years and have loved it. The stick, however, is a piece of junk. The recipient used it for less than a month with constant problems. We spent hours troubleshooting it in the beginning, just to get through the initial connection. Assumed she needed a booster for her router and got that. Finally thought we had it working but then it started dropping the connection every 30 minutes. Now, it's quit working entirely. We can't even get the bouncing Roku image to come up. After ONE MONTH. What a piece of junk. I'll never buy another item from Roku.", "verified": true, "helpfulness": "19/20", "author": "Virginia R. Painter"}, {"rating": 3.0, "review": "Looking to add a unit for my Winter home in FL.  Base on the number of poor reviews for the Stick and the price difference which is not very much I think I will go with the regular Roku rather than take a chance on the Stick.  It's not like the regular unit is a big box or anything.  The Roku 3 is awesome but I don't need the features for gaming etc so I think I will go with the Roku 2", "verified": false, "helpfulness": "0/0", "author": "J.R.M in TN"}, {"rating": 5.0, "review": "I just bought the Roku stick because I wanted a more dependable streaming receiver for my living room than my Bluray player that freezes.  I use it now in both my bedroom and living room.  It is so much more functional and easy to use than both of my blurays.  I highly recommend this product!!!", "verified": true, "helpfulness": "0/0", "author": "aonetruthr"}, {"rating": 5.0, "review": "Love it, easy to use and has made it possible for me to stream Netflix to my TV instead of watching on my computer.", "verified": true, "helpfulness": "0/0", "author": "Mary McNamara"}, {"rating": 1.0, "review": "I live in Guatemala city and I bought this device for netflix  wich is supported in guatemala. well now i'm not allowed to download the netflix channel because of region restrictions and dont let me start on spotify, pandora, etc wich are supported in guatemala too.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 4.0, "review": "works well on a wall mounted tv (not a lot of wiring to hide). although the roku 3 is the way to go if you have somewhere to hide the wiring. not real wild about the wifi remote and the load time is a little slow. but I was spoiled by the roku 3", "verified": true, "helpfulness": "0/0", "author": "bassmaster"}, {"rating": 4.0, "review": "This was easy to install and works great.If I have one complaint is that, since I power the stick from the TV, it take a long time to boot when I turn the TV on.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]