[{"rating": 5.0, "review": "Works really well. Powers from my TV's usb port, so looks really clean and neat.", "verified": true, "helpfulness": "0/0", "author": "sandy 121"}, {"rating": 5.0, "review": "Awesome, awesome, awesome!  This little thing is amazing!  When I was researching streaming sticks, I had 3 requirements: 1) Netflix 2) Amazon Instant Video 3) HBOgo.  For some reason, this was the only stick available at the time that streamed all 3.  Also has a ton of other options, but those are the only ones I care about.  Setup was easy, it's so small that you don't even see it on the TV, and it's a great value for the price!  I now have them on all TVs in my house, and we cancelled our cable subscription.  The interface is so easy to use that I bought one for my mom and for my grandmother, who do not even know how to use the internet.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Elena Milenkovic \"mother of twins\""}, {"rating": 5.0, "review": "My hubby love it !", "verified": true, "helpfulness": "0/0", "author": "Pratita"}, {"rating": 5.0, "review": "I use it to stream twc n hulu. Works good. Love the fact its a stick and plugs directly into hdmi", "verified": true, "helpfulness": "0/0", "author": "Deanna Jaimes"}, {"rating": 1.0, "review": "BIG WARNING, this product is not for travelers, You can't launch the Netflix app or Amazon prime when you are outside of US, so if you go to Mexico, UK, Brazil, etc, is not going to be possible for you to setup a legal account for that country to watch local content.That is not acceptable, even on my old WII (US device) console I can setup any account wherever I go, Smarts TV (US device), PS3 (US device), all these devices works without problems on any region. Please note that I don't want see exclusive content for US, I want to setup a local account for the services of Netflix to watch local content.I got this info from the Roku customer support, my big annoyance is because they say that some content is not going to be available outside US, that is OK for me, I understand the law, but why Roku banned an app that can be setup totally legal in other country?Another annoyance issue was the setup of the Roku account where they ask for a credit card to finish the process.I must to admit that Roku was a big disappoint for me, So now I'll have to start with the annoying return process, starting to repack :\\", "verified": true, "helpfulness": "0/0", "author": "Rodo"}, {"rating": 4.0, "review": "everything I thought it would be,and more.", "verified": true, "helpfulness": "0/0", "author": "derekbowring"}, {"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "0/0", "author": "JA UNIVERSAL STORE"}, {"rating": 1.0, "review": "It worked perfectly for TWO DAYS. Remote won't pair up with tv all of a sudden & Roku has two fix-it's in their help section for remotes (that were unsuccessful ). If I cannot fix this situation myself, it will be returned.  IF YOU CAN GO WITHOUT A ROKU, DO SO!!  A friend has the same functionality with her blue ray & it's cheaper. That will be my next buy if I have to return this.", "verified": true, "helpfulness": "0/1", "author": "M. Parisien"}, {"rating": 3.0, "review": "returned because i could not use it to mirror my computer on the tv", "verified": true, "helpfulness": "0/0", "author": "joseph olive"}, {"rating": 5.0, "review": "This is a great gadget at a great price.Arrived very quickly.", "verified": true, "helpfulness": "0/0", "author": "ZACHARY TAYLOR"}]