[{"rating": 5.0, "review": "I only have one cable box, but, two tv in my home and so I only have basic cable in my bedroom I was looking into the roku 3 box, but didn't want to  spend $100 and the roku 2 box did not link to my cable, Then they came out with this little stick, it was just what I was looking for, all the streaming I wanted and half the price of all the other boxesMind you, at times it can be just a little slow, but 90% of the time works just the way i want for a second tv with no cable boxIt is well worth the price", "verified": true, "helpfulness": "0/0", "author": "Amazon Custom \"Diva\""}, {"rating": 5.0, "review": "sorry I did not buy this first over the the roku 3.  now I use this on May main tv in the livin room.  love it", "verified": true, "helpfulness": "0/0", "author": "Eileen A. White \"E.A. White\""}, {"rating": 5.0, "review": "I plugged it in registered it online and now am streaming my netflix and amazon prime with no trouble at all!!!!", "verified": true, "helpfulness": "0/0", "author": "debbie"}, {"rating": 5.0, "review": "this is the 2nd Roku I have, after buying a Roku 3 last year.  Like the hundreds of other positive reviews of the Roku, i cant say anything more positive about it then what many others have said before.  The stick works great but it would not fit in the HDMI port of my Philips plasma TV because Philips thought that having a non removable metal bar only 2 inches under the HDMI ports was a smart idea.  So Roku is great, Philips not so much.", "verified": true, "helpfulness": "0/0", "author": "K. Cormier"}, {"rating": 5.0, "review": "What can I say, it does what it says it will do, and it does it well. Not as fun or flashy as Chromecast, but it streams Amazon perfectly, as well as Netflix The wife loves the remote, which is the only reason I bought this one over others.", "verified": true, "helpfulness": "0/0", "author": "Kingazjay"}, {"rating": 1.0, "review": "No technical issues. This is my second Roku. My Roku box remote has an audio plug so I can listen without disturbing others. The stick remote has no audio outlet. Cheap.", "verified": true, "helpfulness": "0/2", "author": "Neill"}, {"rating": 5.0, "review": "Love the new roku streaming stick I have the roku 3 and while the processor in it may be faster the stick is great in it's own right. I use a 1 gigabit router on the 5g band the stick has great picture quality and I have had no dropouts. Yes it takes Netflix and youtube 30 seconds to load but after that it works just like the other roku. It plugs strait into an hdmi port and draws power from the usb port on the tv or it has it's own power plug if you need it. This thing is so small yet has such entertainment value it's about the size of a disposable lighter. The streaming stick has all the same channels as the other roku's but is much smaller and compact. The remote for me is simple and easy to use it fits my hand perfectly. If you're looking for a great entertainment value at a great price $50 bucks look no further than the streaming stick. And no I do not work for the company.", "verified": true, "helpfulness": "0/0", "author": "G. Jones"}, {"rating": 4.0, "review": "I gave this to my elderly relative.  She LOVES it!  She is not tech savvy but does have a wireless network.  I set up a Netflix account for her because cable is just too expensive for her needs.  I also helped her set up other channels that she can easily access and view.  She is totally not a gamer, so gaming features are of no consequence.The menu layout is different from older Roku devices.  It took a good while to help her learn to navigate  the menu with the remote.  The way her tv is made, the HDMI port makes the device stick straight back.  If her tv was in a cabinet or wall mounted, it would have been a problem.  The remote... It is so basic, it is difficult to easily find wanted content.  Although the remote on this device does not require you stand or point directly at the device, a pain if you cannot sit directly in front of the tv.  The Roku app available for smart phones or iPads makes using the stick much easier for viewing.The price point was doable.  The fact the device can be concealed and doesn't need extra space on a console is probably the biggest issue we like.  I was impressed by such big performance from that little device.  I'm happy that she's happy.", "verified": true, "helpfulness": "0/0", "author": "Maggie"}, {"rating": 5.0, "review": "I purchased this item so that I could stream content from my NAS and iPad.  It works great for both.  It's super easy to install.  As long as you have an available USB port on the TV, then you don't need to use the included power supply.  When I first got it, it installed the latest firmware.  All in all, I think I was up and running in about 30 minutes.  I have a Synology network attached storage device (NAS) with many gigabytes of home videos and movies that I've copied from my DVD/Bluray collection.  The Roku was able to detect all my videos and I was able to play them with very little effort.  As for the iPad, there's a program called Twonky.  With this software, I was able to stream videos directly from my iPad, including Youtube videos.  Streaming videos from my iPad makes it easy because I can find the videos much faster.  I give this device a 5 star rating and would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "gr2"}, {"rating": 4.0, "review": "Very convenient for streaming movies. The only issue I have with it, is that is loads a little slowly. It also does not offer some channels I would like to stream, but overall it is a very nice, convenient addition for streaming.", "verified": true, "helpfulness": "0/0", "author": "T.N."}]