[{"rating": 2.0, "review": "I have 3 Roku Devices and I love my Roku service but this device is clunky and unresponsive alot of the time. The remote has trouble communicating with the stick which is not behind the T.V. and sits just 3 feet away. I wish I had returned it and ordered a Roku 3 instead.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Seriously....watching my Netflix, my Amazon Prime videos, and my Youtube videos ON MY TV....has made me really happy.  Admittedly the setup process for Netflix, Amazon, etc can be annoying, but once you get through it, you're good to go.  I set everything up myself....and if I did it, anyone can.  You can even browse Facebook photos on your tv with it, which is great.  And there are some fun radio channels as well.  Money very well spent.", "verified": true, "helpfulness": "0/0", "author": "Wacky Witch Hazel"}, {"rating": 5.0, "review": "Love this it works very good", "verified": true, "helpfulness": "0/0", "author": "Evelyn Olavarria"}, {"rating": 1.0, "review": "Don't fall for the \"easy as one two three\"  Be prepared to spend ALOT of time with your new Roku Stick, a laptop and every password you have ever used typing them in using a remote with only up, down, and side to side arrows.  Every other device had an activation code I could just type into Netflix to get started.  With Roku you have to go to their website fill out some forms on your laptop then go back to your TV and type in your password for every channel for which you already possess a subscription.  Good luck....you'll need it!", "verified": true, "helpfulness": "0/1", "author": "S. R. Weissflog"}, {"rating": 5.0, "review": "works surprisingwell", "verified": true, "helpfulness": "0/0", "author": "Donald D Kline"}, {"rating": 1.0, "review": "Awful speed. Slow channel surfing. Extremely dissapointed.", "verified": true, "helpfulness": "0/0", "author": "James Dowter"}, {"rating": 5.0, "review": "Bought this as a gift.  He had some trouble setting it up, but the manufacturer helped immensely.  He loves it.", "verified": true, "helpfulness": "0/0", "author": "Golden San \"Golden Sand\""}, {"rating": 4.0, "review": "I really liked this streaming stick but I have to say the amazon fire stick is much better. This has much longer loading times and not as many apps available. If this was cheaper than the fire stick then I would say go ahead and buy it... but the fire stick is $39 so I would recommend buying that instead unless Roku lowers their price.", "verified": true, "helpfulness": "0/0", "author": "B Renee"}, {"rating": 1.0, "review": "No because i can use Netflix in argentina", "verified": true, "helpfulness": "0/0", "author": "Antonio Heinz"}, {"rating": 3.0, "review": "so, we have other Roku products and Roku Streaming Sticks elsewhere in the house. Recently tried to use this in a less-than-central location and had constant problems with the remote... freezing up, suddenly behaving as if we were holding down one of the buttons... called customer service and they were little to no help - oddly they didn't even ask how far we were from our router. It seems the remote works through the ROUTER not through the Roku device. After much frustration (including a \"fix\" of having to go through a restart sequence every time it happened, which was often), I finally switched it out with an Amazon Fire Tv system which worked beautifully in that location. Using the Roku Stick elsewhere with no issues.", "verified": true, "helpfulness": "0/0", "author": "Aileen T. Darragh \"kacje\""}]