[{"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Sherman D. Robinson Jr. \"SHERMAN\""}, {"rating": 5.0, "review": "I have a roku on every TV. Works great.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "It's my second Roku, never befor bought a refurfished one, but everything is ok. The only difference with the origial i got, are the batteries.", "verified": true, "helpfulness": "0/0", "author": "Alejandro"}, {"rating": 2.0, "review": "Problems with internet picking up", "verified": true, "helpfulness": "0/0", "author": "quin"}, {"rating": 5.0, "review": "Love the convenience of having an interchangeable Roku stick for smaller bedroom TV used in conjunction with our Roku box in living room. It's a great way to stream music, movies, shows, and more at home or traveling. Very reasonable price!", "verified": true, "helpfulness": "0/0", "author": "Melinda Y."}, {"rating": 4.0, "review": "I don't think the streaming stick works as well as the normal roku's, sometimes you have to click it a couple times, but all in all it still works great!", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "jastaski"}, {"rating": 1.0, "review": "Not a good product.  Had it for a week and have to continually unplug the powere to the stick to get the home screen.Once there the remote sometimes works so basically stuck.  Asked Amazon to take it back and going to switch to Apple tv", "verified": true, "helpfulness": "0/0", "author": "Jwalker"}, {"rating": 5.0, "review": "Absolutely love my roku streaming stick! Ive always had roku products and this small little streaming stick is perfect for us. It comes preloaded with many free and paid channels and also has the option to add more channels. It was easy to set up, just put it into your HDMI port on your tv, sign in to your hulu, netflix, ect accounts and your ready to go!", "verified": true, "helpfulness": "0/0", "author": "brandy ray"}, {"rating": 3.0, "review": "I've had to return 3 of 4 sticks. The remote is useless.  I end up having to use the app on my cell phone.  I upgraded to ROKU 2 but need to restart system before every use. I still like it better than Amazon Fire, which I also returned.", "verified": true, "helpfulness": "0/0", "author": "B. Savino \"Benne\""}]