[{"rating": 2.0, "review": "It took it awhile to load and then it would reset.  If I pressed Netflix, it would change to YouTube.  I was really frustrated with it and plus I had to purchase an additional HDMI adapter to plug it in the back of my tv because of the small space.  I am returning it.", "verified": true, "helpfulness": "0/0", "author": "SapphirePearl"}, {"rating": 5.0, "review": "The Roku stick is easy to install...easy to use. Hoping it can save us from the clutches of the high cost of cable. Enjoying it so far.", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 5.0, "review": "Great price. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Instant access! I have come up a level in viewing pleasure--worth the $$$.  $10 off on Roku site.", "verified": true, "helpfulness": "0/1", "author": "MucBeah54 \"Cloudwoman\""}, {"rating": 5.0, "review": "This product is fantastic.  I have a Blu Ray on another TV and that is so slow and it takes several steps to get to the  streaming.  The Roku gets you there so much faster.  It is a pleasure to use.", "verified": true, "helpfulness": "0/0", "author": "Sally P, Illinois"}, {"rating": 5.0, "review": "I love this roku! Easy to set up and  move from tv to tv. I definitely plan on buying for gifts", "verified": true, "helpfulness": "0/0", "author": "linda winter"}, {"rating": 5.0, "review": "Buy this and sign up for Acorn TV and get all the great British programs no longer available on Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "COH"}, {"rating": 5.0, "review": "Love this thing!  We cut cable awhile back (should have done that a long time ago) and have a Roku 3 (awesome) for our main TV.  I researched the Roku stick for awhile and wondered why it was so much cheaper than the Roku 3.  There are reasons but for my application, it didn't matter.  We use it for our basement TV so our son can watch cartoons on Netflix and we don't have to.  My son is happy...need I say more.  The stick is definitely worth the money and just as easy to set up as the Roku 3.  Buy it.  You won't regret it.", "verified": true, "helpfulness": "0/0", "author": "jmen73"}, {"rating": 5.0, "review": "Best electronic purchase in a very long time.The only downside is that the streaming stick doesn't have an off option, you have to unplug it if you don't want it on. But other than that, I love it", "verified": true, "helpfulness": "0/0", "author": "D. K."}, {"rating": 5.0, "review": "No complaints about this product. It's simple, affordable, and gives me all the features I expected. I love using it to watch Netflix, Youtube, the WWE Network and streaming movies from my computer via Plex. I bought three. I love Rokus!.", "verified": true, "helpfulness": "0/0", "author": "John G \"(www.johngallino.com)\""}]