[{"rating": 3.0, "review": "We bought a Roku stick in order to watch HBOGO, since Comcast blocks it on Amazon Fire TV , which is our usual streaming device.Buying the Roku made me appreciate the Fire TV in every way. As far as use goes, the Roku remote is clumsier and less responsive than the Fire TV remote. That's a minor issue, however. The real problem was set up. We tried to set it up in our room of choice, but it could not complete its update and kept showing an error code. We tried everything, no joy. Finally, before returning it, we tried it upstairs, closer to the router. It works perfectly now that it's within ten feet of the router. Disappointing that it has such limited range.All cons aside, it has a lot of apps and is user friendly. For now, it gets points for having gone up against Comcast in the quest to unlock HBOGO for viewers.", "verified": true, "helpfulness": "0/0", "author": "Rebecca B"}, {"rating": 5.0, "review": "Love our Roku streaming stick. Very easy to set up and use. It has tons of apps !! We only use some of them but my husband loves the sports apps. ESPN watch and NFL now . ( for those 2 you do have to have a current cable or satellite provider to stream them). My kids love the netflix Hulu and Amazon prime apps for their shows! They can work the roku remote on their own. The remote has an easily displayed home button and a specific button for netfix and Amazon. With the Amazon app though you have to be careful because if your children use it they could accidentally purchase shows by accident that aren't included with prime. Wish the app was a little better designed with kids in mind. Remote is a great buy and is easily moveable to and from different Tv's in your home . Like that it is just a tiny usb stick .", "verified": true, "helpfulness": "1/1", "author": "Adrianne Rachele Praditbatuga"}, {"rating": 4.0, "review": "Very nice! Easy to setup, however I bought two others for my sister and my parents, I ran into a strange problem with the wifi setting reading good, but would not connect, I then got them a wifi extender and all worked good, the device has a lot of good apps, you can stream content directly from a computer, stream popular apps like you tube, Amazon instant video etc...., I would suggest getting the roku app for your iPhone or android, because you'll have to use the remote to search, and put in passwords which is a pain without the keyboard from an app, but that is my only complaint, very easy to use", "verified": true, "helpfulness": "0/0", "author": "Rob G \"PC Pro\""}, {"rating": 5.0, "review": "I love my Roku!  Super easy, works great!", "verified": true, "helpfulness": "0/0", "author": "S. Suarez"}, {"rating": 5.0, "review": "delivered right to my door nice product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Wouldn't let me use it without entering credit card information.  I had to call customer support in order to bypass it. Also it won't connect to my phone for some reason. Other than that it's just an ok product.", "verified": true, "helpfulness": "0/0", "author": "Teresha"}, {"rating": 5.0, "review": "Love technology!!", "verified": true, "helpfulness": "0/0", "author": "Christine M Johnston"}, {"rating": 1.0, "review": "Complete waste of money. Every few weeks the remote goes out of sync. This is a well known problem...just google \"pair roku remote\". There are tons of odd solutions that are nothing short from standing on one foot, stratching your head and rubbing your tummy. I've tried removing batteries from remote, the sync button, unplugging the roku.... all in several different combos. It worked once and then 3 weeks later same problem, this time no solution. Even went through a whole 8 pack of AAs. I've tried factory resets 3 times while on phone with support with no luck.And yes I am aware of the remote apps but hate the idea of passing around my smartphone in the living room because the remote doesn't work.Again don't my word for it, google it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is great to have I can see any program I want or miss. I recommend the Roku to my family and friends. I'm going to order another Roku for daughter.", "verified": true, "helpfulness": "0/0", "author": "Jay Noble"}, {"rating": 1.0, "review": "Roku does nothinbg more than your household WiFi can do. You can't get local or network TV and you still have to pay for Netflix, Amazon Prime, and all the other movies and TV shows you want to watch. Roku runs thru your Wifi, so why would you get it? I thought it would show local TV, and paid $50 at Sams for the stick, but what a stupid waste of money.", "verified": false, "helpfulness": "1/7", "author": "Felix Snow"}]