[{"rating": 1.0, "review": "I had heard this was the best streaming stick on the market when I made the purchase in December of 2014 and I bought into that hype. After receiving the \"Roku 3500R Streaming Stick\" it take long to test my patience as it kept dropping the Wi-Fi connection along with the dropping the activations to the likes of Netflix, Youtube, amazon prime and others. Oh I spoke with Roku customer support after a 1-1-/2 hr wait, they had no clear answer why it wasn't connecting to my wi-fi network other than reboot, reboot, reboot, oh it worked that time - goodbye. I should have returned the item early on but I was still hoping the hype was correct and the issue was me being a fossil and didn't know enough to make it work correctly. Well today something snapped in me as the hype was gone and the POS Roku says it got \"excellent\" but nothing would load. From my view this this Roku 3500R streaming Stick isn't even worth target practice. BUYER BEWARE ROKU SUPPORT IS AT LEAST 1 HR. OUT AND SKETCHY AT BEST.", "verified": true, "helpfulness": "0/0", "author": "Cando"}, {"rating": 5.0, "review": "Love it. Dumped comcast for this. I do miss cable a little, but after a week, I was fine.", "verified": true, "helpfulness": "0/0", "author": "tedd petrich"}, {"rating": 5.0, "review": "Finally purchased one, now wonder why we didn't do so earlier.", "verified": true, "helpfulness": "0/0", "author": "E"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Jorge Arango"}, {"rating": 5.0, "review": "Easy to use might have to buy another", "verified": true, "helpfulness": "0/0", "author": "Mark Weichel"}, {"rating": 5.0, "review": "Love this little guy. Not the fastest but no slouch and potable + small", "verified": true, "helpfulness": "0/0", "author": "Carrie Houdyshell"}, {"rating": 5.0, "review": "Great buy", "verified": true, "helpfulness": "0/0", "author": "tyrone m harris"}, {"rating": 5.0, "review": "packages was shipped in a timely manor and was exactly as described.", "verified": true, "helpfulness": "0/0", "author": "amy lyle"}, {"rating": 4.0, "review": "I have used the ROKU devises for almost a year now and can't believe I didn't have them way before then! I prefer the ROKU 3 for speed and quality but the stick is perfect for the bedroom TV. It would be five stars if not for the ever so slight lag it sometimes has booting up.", "verified": true, "helpfulness": "1/1", "author": "Switch(Brandon) \"Brandon Davis\""}, {"rating": 2.0, "review": "meh. hard to work with if you don't have subscriptions or a dedicated youtube account. worth buying the larger version or even better the amazon versions. Seriously, the fire stick is better.The inability to connect a keyboard or use your phone's keyboard (even though it has a supported app!!!) is infuriating. Just an absolute struggle.It's better than the original samsung \"smart tv\" (which is what we are bypassing with this) but that's not saying much.", "verified": true, "helpfulness": "0/0", "author": "TG \"TG\""}]