[{"rating": 1.0, "review": "The remote control is junk.  Now it only works if I take out the batteries and put them back in.  Then sometimes that doesn't work and I have to hit it into my palm.  Bought it only two months ago and have used it less than a dozen times.  Not happy Amazon doesn't accept a return / replace.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works Great! ..but you do need to have wi-fi", "verified": true, "helpfulness": "0/0", "author": "BANGELCB96"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The remote consistently lost contact with the Roku stick and the batteries had to be popped out of the remote and returned to get it to communicate again. We had the Roku set up for 2 hours last night, and this happened 8 times. Back in the box, back to Amazon. Ordering a Firestick like I should have in the first place.", "verified": true, "helpfulness": "1/1", "author": "jennyp1976"}, {"rating": 5.0, "review": "Easy to use and connect. Love the choice of channels.", "verified": true, "helpfulness": "0/0", "author": "leftside"}, {"rating": 3.0, "review": "It cuts out a lot :(", "verified": true, "helpfulness": "0/0", "author": "GRAMMOM64"}, {"rating": 2.0, "review": "I have a Roku box that I love, so for my bedroom TV I wanted the Streaming Stick for price and form factor.I suppose I am a bit spoiled with the box. It is very fast and smooth and I've not had any issues out of it at all.But the Stick is another story completely. It lags SO BAD. It will get hung up on a screen for 20+ seconds, in which time I won't know if the button didn't register, or it froze up. So I'll hit the button another time or two and before I know it all of my button presses rain down on me at the same time in a storm of Netflix+Youtube confusion. And I end up on a completely different app and video and just want to cuss.Once the video gets going, the quality is good. No real complaints there. But if you are even an inkling short on patience... I'd recommend looking elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Eric Wilhite"}, {"rating": 3.0, "review": "Got this product right on time, easy setup, I have been having lots of problems with the remote I have to take the batteries out and put them back in constantly. I bought so I could watch Netflix and it works perfectly for that but the remote part sucks : /", "verified": true, "helpfulness": "0/0", "author": "Brittanie"}, {"rating": 5.0, "review": "Works great even with my older TV that doesn't have HDMI. I was ready to return it because there was no sound (I have DVI with HDMI adopter so I guess it's wasn't a true HDMI connection) but I found a great sound extractor that takes in the Stick on one side and connects to the TV on the other through a DVI to HDMI.As you can see from the pics I used:DVI (female) to HDMI (male) adopterHDMI cable (male to male)Sound extractor", "verified": true, "helpfulness": "3/3", "author": "Yoram"}, {"rating": 4.0, "review": "does it work on emerson tv i might buy it tomorrow", "verified": false, "helpfulness": "0/1", "author": "Desiraefisette"}]