[{"rating": 5.0, "review": "The Roku was recommended by friends who have the earlier, more expensive black box. This little stick is easy for a technophobe to install, inexpensive, and accesses dozens and dozens of movies, series, shows. We immediately cut the movie channels from our pricy TV provider, and spent the savings on popcorn!", "verified": true, "helpfulness": "0/0", "author": "Mary W."}, {"rating": 5.0, "review": "This is super easy to set up.  Easy to use, download apps and channels, and marathon all of the movies and TV shows you would ever want.  I highly recommend it.  I also downloaded the remote to my Android tablet, which was just as easy to start using.", "verified": true, "helpfulness": "3/3", "author": "Deanna"}, {"rating": 4.0, "review": "If you use a lot of Netflix and Youtube, that's an easy purchase (those are the apps I mostly use). The only drawback about them is that they take some time to load (30-40 seconds).The integration with your tablet/smartphone is a really useful feature.", "verified": true, "helpfulness": "1/1", "author": "Adriano Maron"}, {"rating": 5.0, "review": "So i got this in the mail yesterday and its works like a dream! I have both chromecast and this Roku stick and i gotta say. I dont think i'll be using chromecast anymore.The roku stick has everything i need built in incuding netflix, amazon instant video, hulu, youtube, PLEX etc etc.having a amazon video app alone is worth the price of purchase. its a shame chromecst doest have one.Also the PLEX app interface is great. The 2 things that i thought chromecast had over this was casting plex and youtube from phone only to find out that Roku can cast too!Finally, the range. for whatever reason, when i cast plex from my phone to chromecast the video always stops every few minutes. I'm guessing becasue of the range from the chromecast to my wifi router? Well this Roku stick streams my plex movies from 2 floors away from my wifi router with no skips or buffering at all! The loading of the movies may take a few seconds but once its running, it doesnt freeze. Def recommend this and im gonna get another now that i see what it can do.", "verified": true, "helpfulness": "2/2", "author": "Brian"}, {"rating": 4.0, "review": "It supports most online channels, Netflix, Amazon instant video, Roku own service, holu and many others. The UI is quite friendly. The remote have four buttons for easy access of Netflix,Amazon Holu and Roku, which is convenient for my purpose.My TV has a USB port, so I can directly power up the HDMI stick when I turn on my TV. It takes some time to boot, if that boot time can be optimized, that will be nicer.Over all I'm satisfied with the stick and service Roku provided.", "verified": false, "helpfulness": "1/2", "author": "Wei C."}, {"rating": 3.0, "review": "I own the competitor to this device, the Google Chromecast. I love the chromecast but felt that it really needed a remote. Using a smartphone to control the experience is a bit of a hassle since there isn't that instant feedback response that you get from using a remote. There is always a half-to-one second delay when tapping the buttons on Netflix, Youtube, etc.With the Roku Streaming Stick, you get that remote experience. However, it is still a bit laggy when the remote hasn't been used for a while. Usually I have to press twice when using the remote again since I assume the remote goes into standby.One thing that I noticed is that you must use the included power supply or else you will be waiting a while for the streaming stick to initialize. Plugging the USB cable into the TV cuts off the power every time the TV is shut off, so the Roku will have to initialize again.App selection is quite large. I particularly like the news headlines channel.Big apps like Netflix and Youtube are slow to load. Waiting times on Chromecast are noticeably shorter.One thing that I wasn't expecting was the lack of a headphone port on the remote. This is a feature on the Roku 2 and 3, but not on the Streaming stick. I was looking forward to this feature, but I can live without it.Overall, with a few firmware updates, I'm sure the streaming stick will improve. For now, it still needs a bit of polish.", "verified": true, "helpfulness": "6/6", "author": "Erik"}, {"rating": 5.0, "review": "Great tool for cutting the cord. I don't think it's as slow as some have indicated.  It's not live tv so there is some buffering sometimes but never more than 30 seconds and once the app is loaded going from episode to episode is pretty seamless. Set up was the biggest hassle not the product itself but the app that you use with the Roku. The entry of your account information in each app is very cumbersome and clunky by having to use the remote it's like texting on the old cell phones before T9 . Overall I love it and haven't used my cable since and in fact have cancel my service and wIth APPS LIKE Amazon prime, Hulu, Netflix and Aereo and Plex I have about 97 % of the shows i watch and I that has more to do with the networks rather than Roku. It fit into my TV  just fine with no effort right under my Chromecast. It you're thinking of getting this and cutting the cord I say it's definitely worth the money. If you want everything without waiting 10-15 seconds occasionally then you may be frustrated. Goodbye high cable bill hello to cord-free life.", "verified": true, "helpfulness": "1/1", "author": "reykeith s."}, {"rating": 2.0, "review": "The stick is too slow, reboots, and it takes forever to power on when it is connected to the TV's USB port. It is a real pain when you are trying to watch something quickly. The stick will probably get better in the future with firmware updates, but I need a Roku now that works well. I already bought a Chromecast as a streaming stick experiment.I have the Roku 2 XS right now and I love it. It runs smoothly and rarely reboots. I had high hopes for this stick but it didn't live up to the promise. I decided to buy a refurbished Roku 2 XS that includes most of the features of the Roku 3, for around the same price as this stick. Check around on Amazon for it.", "verified": true, "helpfulness": "3/4", "author": "Ryan"}, {"rating": 5.0, "review": "great piece of streaming equipment for price and size!have had no problems at all in few weeks that i have had it.have used it on all 4 tvs in my house pretty much just plug and play.", "verified": true, "helpfulness": "2/2", "author": "brett anderson"}, {"rating": 5.0, "review": "I have been using this for about two weeks now and it is a perfect complement to my Over The Air (OTA) antenna.  I cut the cable/satellite several years ago and in my market (Fort Worth/Dallas) I receive over 70 stations including 3 movie stations and 4 classic TV stations as well as all of the national broadcasters; ie: Fox, ABC, CBS, NBC, WB and ION. This gives me a channel to watch the weather on, world newscasts as well as Hulu+ and Vudu (I don't have Netflix). I can also enjoy many free channels.I have seen many issues about setup; If you have a very complex password it will be difficult at best to get it entered in the first time... it took me three tries to enter my very complex password... but, that is my doing not the fault of the Roku Streaming Stick.  Otherwise; setup is straight forward and as easy to learn as any smartphone I have used.I love having this to complement my OTA Tivo and I feel that I will be using this for many years to come.", "verified": true, "helpfulness": "1/1", "author": "Russell S."}]