[{"rating": 3.0, "review": "The pluses: Tiny, plugs right into your TV, not too expensive, and gives you access to streaming services.  Streaming quality has been solid.The minuses:* Compared with, e.g., an AppleTV, the Roku stick is very, VERY slow.  Mine has required 45 seconds to a minute to boot up each time.* HDMI is not self-powering, so--despite the tiny form factor--you will still need to plug the Roku into a wall outlet (or, if you're lucky, a USB port on your TV).  This was kind of an unpleasant surprise, but not a deal-breaker.  Might be a problem, though, if your TV is mounted on a wall without easy access to an unsaturated outlet.* I've only used Amazon Prime's TV streaming so far; the info screens are almost comically uninformative.  Want to know if the episode you're looking at is one you've already seen? Want to know which number episode it is?  You'll have to back out to the prior menu for that.* There are dedicated buttons on the remote for services I will never use.  Blockbuster? Please.* Comcast doesn't support HBOGo on Roku, which is really Comcast's fault as far as I can tell, but which is still really dumb.", "verified": true, "helpfulness": "7/7", "author": "Joshua N. Mitchell"}, {"rating": 5.0, "review": "I had a Roku 2 and it works fine after a somewhat simple installation. The streaming stick is a no-brainer to install and use.  I have it plugged into an older flatscreen TV (Vizio), and it worked out of the box.The remote is identical to the prior units and connects easily to the stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "After earlier returning 3 Roku 3's each of which failed to operate after only a few weeks (remotes froze), I decided to wait for the streaming stick before considering other options.  In the few weeks I have had the stick, it has failed to operate only twice (requiring the restart procedure).  If it fails to perform further, it too will be returned to Amazon.  Roku's live technical support is virtually non-existent.  A recording says the line is temporarily out of service.", "verified": true, "helpfulness": "1/2", "author": "Laaurence W. Michalski \"tantumergo\""}, {"rating": 5.0, "review": "I like my Chromecast. But the Roku HDMI Streaming Stick provides access to content that is not available on the Chromecast yet. I love both devices.", "verified": true, "helpfulness": "1/1", "author": "Chris \"cgvang\""}, {"rating": 1.0, "review": "I have paid for Amazon Prime.I have paid for Netflix.I have paid for my ROKUYet I cannot use my Roku without registering a credit card.  Out of sheer principal I will NOT give them my credit card.Time to buy another APPLE TV!", "verified": true, "helpfulness": "4/12", "author": "Joel R"}, {"rating": 5.0, "review": "Great device, love it.  It really expands my viewing options and it's easy to install and it's hidden from view.", "verified": true, "helpfulness": "0/0", "author": "Eric L Hines"}, {"rating": 5.0, "review": "Improved to allow watching a TV series (Netflix, etc.) without playing the previews or the credits.  Jumps to the start and minimizes the credits to let you jump to the next show in the series.  Excellent quality similar to other ROKU 2 that I own.", "verified": true, "helpfulness": "0/0", "author": "Hobbyist \"Chemistry for fun, Computers for money.\""}, {"rating": 5.0, "review": "I got two of these for my Daughter's Rooms so they could watch TV also, We cut the cable cord 2 months ago and i thought we would be missing something, But we watch so much of the shows we did before with our Roku box x2 and our Roku sticks x 2 so now all 4 of our TV's We can watch when we want and paired with our antenna to watch local news, And the cw channels plus some we are very Happy, Without A monthly cable bill Only internet!! Loving Our ROKU\"s :))", "verified": true, "helpfulness": "0/0", "author": "dana gates"}, {"rating": 5.0, "review": "This is a pretty cool gadget. Easy to set up for the most part. If you have to sync up any channels/apps with your cable/satellite service provider then it can be a little bit of a pain. But it's only something you have to do once... then never again. Good selection of channels/apps. It's fast too... that was a concern of mine as I read that the Roku 3 had a faster processor. I thought there might be some lag between button presses but there's not.My one complaint is that they REQUIRE a credit card even if you don't plan to buy anything. They say it's to make it more convenient for you should you decide to make a purchase later. What would be more convenient for me would be to not have to worry about my credit card info on yet another online subscription service that I'll never use.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "I've never owned a streaming service or device until recently I signed up for Amazon Prime (but mainly for the 2-day shipping). I've been a cable TV user all my life. So when I decided to jump on the bandwagon and utilize the free Amazon Instant Video Prime programming, I did all the research to see what fit best based on my lifestyle. First off, my house is an Apple environment so naturally, AppleTV was a consideration. But AppleTV and Google's Chromecast don't have Amazon apps, which left Roku. To me, that was the biggest factor since I already had Amazon. I didn't want to buy an AppleTV only to be forced to subscribe to Netflix or HuluPlus (which Roku supports as well).At the time I was shopping, the new Roku Streaming Stick was due out within the month. I had a friend working over there, so I was fortunate enough to get my hands on it pre-release as a gift from Roku.The initial setup was fairly easy. It took a minute to register the stick with my Amazon and get logged on. Once that was done, I can go straight to my watchlist or browse the TV shows and movies. I should note, for my TV (Vizio) the clearance space for the HDMI input was so tight, the Roku stick wouldn't fit. I had to buy a $5 HDMI extension cable. Also, since I run my TV audio to a Bose speaker system, I wanted my Roku stick to do the same. It was just a matter of tweaking some audio settings on my TV but I was able to finally set it up properly, and everything sounds and looks great. Sometimes, the video takes a second to stream into HD but if your wifi signal is strong, its a non issue.As others have probably said, the Roku search feature is great as it searches titles across ALL of its apps/channels. So if say, Hunger Games is available for free on Amazon Prime, it will show you so you don't have to pay to rent it on Netflix.I've been very happy with my Roku Streaming Stick and would say it is the best choice for someone looking for the best overall streaming device with the most apps/channels available. And if Amazon Prime is already something you use, then Roku really is a no-brainer.", "verified": false, "helpfulness": "0/0", "author": "Jarrett T."}]