[{"rating": 5.0, "review": "Works fine. They changed the layout of the buttons, I don't think it is as ergonomic as the old unit.", "verified": true, "helpfulness": "0/0", "author": "william b pound"}, {"rating": 1.0, "review": "when it works, it's great. but freezes 30% of the time requiring a reboot. not reliable!!! I DO NOT RECOMMEND", "verified": false, "helpfulness": "3/3", "author": "weehourz \"weehourz\""}, {"rating": 5.0, "review": "Very useful device (although, a few months later I found a Blu Ray DVD player with built-in Wifi, for $47 (at Costco). The player offers everything this Roku stick does, and much more - like access to You Tube.", "verified": true, "helpfulness": "1/1", "author": "Jay Doraiswami"}, {"rating": 5.0, "review": "Setup was smooth. Interface is intuitive. Start up is slow if you use your TV as the power source rather than wall plug. I love it. It fits my needs perfectly. I have a 22in wall mounted 1080p LED Samsung and the roku stick does its job exactly the way I wanted and expected. I love it.", "verified": false, "helpfulness": "0/0", "author": "Hannah Mills"}, {"rating": 5.0, "review": "Set up without a hitch and everyone is impressed, using it every day.  With NetFlix you have more than you need.", "verified": true, "helpfulness": "0/0", "author": "BigTex"}, {"rating": 5.0, "review": "Excellent product, like it... use to see taiwan tv online...", "verified": true, "helpfulness": "0/0", "author": "Chih Chun Hsieh"}, {"rating": 5.0, "review": "Wey better than Chromecast.  I bought them at the same time. Hands down this operates better. I can watch season after season if tv sitcoms without having to cast every 23 minutes.  It's awesome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was easy to do I look on YouTube and found out how to install it.", "verified": true, "helpfulness": "0/0", "author": "Gwen \"Gwendolyn Dotson\""}, {"rating": 5.0, "review": "2nd Roku ordered. Great service and product! I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "D. Lawson"}, {"rating": 1.0, "review": "Deceitful arrogant and unhelpful.I bought this item to allow my toddler to watch Netflix, since the tablet commands of the excellent Chromecast are a little difficult for him I thought the roku remote would make it \"child's play\".  NOT. This thing does not even support Netflix outside us! A complete ripoff and total lack of understanding,  let alone support from their customer lack - of - service.  They basically just stole my money.  Back to Chromecast.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer \"Mark\""}]