[{"rating": 3.0, "review": "I bought two of these, one for the Den and one for the bedroom. Overall I was pleased but the connection to my wireless was spotty. The one in the bedroom kept dropping the connection. I added a WiFi extender that solved the problem. However, both of them would tend to lock up during streaming (not always) which required a reboot. I would recommend spending a little on the Roku 3 which has proven to be a mure better unit with none of the problems I experienced with the streaming stick.", "verified": false, "helpfulness": "0/0", "author": "James Taylor"}, {"rating": 5.0, "review": "I saved $10 by purchasing a remanufactured Roku Stick with the same warranty as a new one. This product performs everything I was looking for. Though it does sometimes seem to lag in certain apps, I do not think it's due to the product but instead my internet connection. Perfect for Netflix, Sling, and Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Maiof2tx"}, {"rating": 5.0, "review": "Very cool!", "verified": true, "helpfulness": "0/0", "author": "Jonathan Girard"}, {"rating": 5.0, "review": "Nice price, easy set-up, works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Michael D. Spayde \"MSPAYDE\""}, {"rating": 5.0, "review": "Dont know where Id be without this thing. Use it instead of paying for an extra box in my house. Works wonderfully. Don't use the remote, use your phone. Works better.", "verified": true, "helpfulness": "0/0", "author": "Lamar Small"}, {"rating": 5.0, "review": "Only had the device for a few days but it works fine.  Seems to work much the same as the Roku 3 that I have connected to another television.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Best streaming device out there.", "verified": true, "helpfulness": "0/0", "author": "GREGG HEIMER"}, {"rating": 2.0, "review": "Because, I'm from Brazil, and I can't watch netflix here. The sistem is diferent.", "verified": true, "helpfulness": "1/2", "author": "Carlos Eugenio Becker \"Carlos Becker\""}, {"rating": 3.0, "review": "Interface look horribly ugly. The device is slow and menu selection and app launches lag, as expected from a device of these specs. Remote sometimes loses connectivity and needs to be reset.", "verified": true, "helpfulness": "0/1", "author": "Faisal N. \"Faisal N.\""}, {"rating": 5.0, "review": "Great stick. It appears to access many more channels than other sticks.", "verified": true, "helpfulness": "0/0", "author": "R. Watson"}]