[{"rating": 2.0, "review": "This is my second Roku, I already own the Roku 3 and it is a wonderful device so much so that I've convinced at least three other people to buy Roku devices.  This stick on the other hand is first generation garbage.Firstly the CPU is really underpowered so after powering on your TV, expect to wait around a minute pounding the buttons before you can even access the channels.  I have to stress how annoying it is to turn on the TV and have to wait a couple of minutes for the device to boot and sort itself out.  Some less well designed apps have huge UI delays when clicking buttons too, very frustrating.Secondly, the remote just randomly stops working from time to time.  Its not the batteries as I just replaced those with fresh ones.  It appears to just be what we nerds call a 'race condition' where a random sequence of events just breaks something and these things are hard to fix.I really hope they update this software with something less buggy, because this is trash.  Just spend the extra $50 and get an 'always on' Roku 3.  That device is just wonderful by comparison.Sorry Roku, I really like what you're doing and this stick is a step in the right direction and way, WAY better than Chromecast.  But how this product made it out of QA is beyond my comprehension.", "verified": true, "helpfulness": "0/0", "author": "R P."}, {"rating": 5.0, "review": "Easy setup, works great long distances (located 3 rooms away from router). Everything loads fast. Very happy. I returned the Chromecast for this, hands down better device. Worth the $15 more!", "verified": false, "helpfulness": "0/0", "author": "Derek"}, {"rating": 1.0, "review": "The device itself is great, but Roku requiring a credit card to create an account is bogus.  They will create your account without if you go through customer service, but they continually try to talk you into giving them the cc information.  Not good Roku!", "verified": true, "helpfulness": "4/4", "author": "Steve A."}, {"rating": 5.0, "review": "this was a fantastic buy, I bought it for an extra TV we had in the bed room and I was sick of plugging in the tablet every time the ids wanted to watch tv. Now the kids have one TV and I can still watch my shows too win win. It took a few extra minutes to install and set up the accounts but it was easy enough to do while my so jumped on the bed behind me.My 7 year old can use this with out my assistance so I don't have to go back and forth every time his show is over. All in all 2 thumbs up!", "verified": false, "helpfulness": "0/0", "author": "Aisha Rafferty"}, {"rating": 2.0, "review": "It does the job fine and is compact, but even the first day I had it, it kept freezing and requiring the \"magic reboot\" from the remote.", "verified": true, "helpfulness": "0/0", "author": "coffee addict"}, {"rating": 1.0, "review": "I purchased this device as I hove the Roku and the Roku2. We moved to a new house and I bought one for our upstairs TV. Once we moved I hooked it up and it worked fine for a month. Now it does not even connect, the prong on the stick is too loose. I am passed the time for return. Very disappointed. (We have only been in our new house for two months and the return policy must be for a month as I was not able to return it after Sep 26, 2014. Funny how things break right after the return policy is up. We purchase 80% of our items from Amazon. This is one of the first times I have been unhappy with quality.", "verified": true, "helpfulness": "0/0", "author": "Julien200"}, {"rating": 4.0, "review": "A little tough to program", "verified": true, "helpfulness": "0/0", "author": "Ricrhard J. Brookman \"richard j brookman\""}, {"rating": 1.0, "review": "Absolutely would NOT recommend. The remote connects to the streaming stick through wifi, which I have, yet it can never stay connected to the roku. This leaves me with a screen full of netflix, amazon, YouTube, etc- but no way to select these options with my disconnected remote. I've talked with customer support countless times, only to get the advice that I should unplug everything, take out the remote batteries, and try again. I am so disappointed in the steaming stick and would advise you to stay away unless constant unplugging and rebooting is something you enjoy.", "verified": false, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 3.0, "review": "Nice solution. I hope Roku continue to invest in the product.", "verified": true, "helpfulness": "0/0", "author": "FREUD OLIVEIRA"}, {"rating": 3.0, "review": "this is helping us to get away from the big cable bills, but the remote constantly stops working and the whole system needs to be reset if you want the remote.  This is ironic because I specifically bought this Roku because it had a remote and everyone said they liked having the remote as opposed to using their phone or other smart device.  my husband and I inevitably end up using our phones as the remote, which is very easy.also, the process of setting up the different channels can be a pain when you need to log on from a computer or other device to connect everything.  other than that, it's okay.  if I get something for our second TV, I won't buy this one again.", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}]