[{"rating": 3.0, "review": "I have had this thing for a couple weeks now and its okay. i feel like it could be better. most of the apps are useless if you arent a cable subscriber but it does allow me to get hulu on my tv finally (although the novelty of hulu is wearing off)the device doesnt work as well a it should. i was using my blu ray player for year to stream and it worked perfectly with no flaws. i decided to get this becaue youtube was no longer supported. i wish i could say it was a seamless transition.1. the remote it horrible. it top working ALL the time. you have to wiggle the batteries. a quick internet search told me it was a common problem so i  didnt exchange it. i changed the batteries. still does it. downloaded the remote app on my iphone, works a little better but kill my battery. remote i an issue.2. it does not have a sleep function, and if it is plugged in never turns off. no power button. the tv will stay on indefinitely if you forget to turn it off or fall asleep.3. it retarts itself more often than i think it should considering that my previous device never had a problem and wasnt even dedicated to just streaming.in all i feel like this was hyped up to be better than it is and i not perfected quality wise. for something that doe only one thing, i expect it to do it better. also any free content i found wa not worth the price of free, everything else is paid or inaccesible without expenive cable subscriptions. any channel i want i cant get. good for netflix and hulu if you subcribe. but so was my blu ray player and it was better.", "verified": false, "helpfulness": "0/0", "author": "jacqueline"}, {"rating": 5.0, "review": "The Roku stick was a good choice for us as a second option. We already had an Amazon Firestick (it made sense since we have Prime) but wanted to try the Roku stick as well.The stick itself works without flaw and my only constructive bit of criticism here would be for the intrerface. My husband and I are early 30s and very tech savvy, my parents not so much. We bought them one so they could cancel their cable and use Netflix or Hulu. Its taken about 6 months for them to fully commit to it because the interface is a lot of jumping around, adding channels, and screen changes to get it setup to your preferences--which was something to get used to from just changing channels up and down on a cable remote. Even then some \"channels\" represented themselves as free on the Roku stick but once downloaded required a subscription. You can imagine some of the frustration.So in all, I would say the Firestick would be better suited for those who are less tech savvy rather than the Roku stick. But the Roku stick is still a great product that works well and lived up to expectations.", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 3.0, "review": "Great for its portability or if space is more of a concern.  Otherwise, I recommend upgrade to the Roku3 for speed.  You'll also get the USB port to play local media files.", "verified": true, "helpfulness": "0/0", "author": "Chris Maroney \"fletch2k\""}, {"rating": 2.0, "review": "It worked great for the first month.  Now it constantly disconnects from the Internet, the remote, and Netflix.  I want my money back!!", "verified": true, "helpfulness": "1/1", "author": "flimpsons"}, {"rating": 3.0, "review": "Remote need to be reset every evening which is real pain in @$$, apart from that no complains", "verified": true, "helpfulness": "0/0", "author": "Harry"}, {"rating": 5.0, "review": "Perfect for streaming to our bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "P. Cameron"}, {"rating": 2.0, "review": "I bought this unit in 2014, it is great, then I bought another one at Walmart in March 2015, it froze up constantly couldn't get past the home screen. So I ordered this one from Amazon thinking it may be a better unit.  Well no....it freezes up constantly. I tried it on two different tv's changed the batteries in the remote, rebooted it several times. It still wouldn't go past the home screen.  I don't know what happened in the last year, but this stick is terrible. It's to bad too because I love the apps on the Roku.", "verified": true, "helpfulness": "1/1", "author": "CJ Craig \"JL Miller\""}, {"rating": 5.0, "review": "Very easy to use once you get it installed.  Roku needs to make it easier to get to their web site but their customer service is good.  I'm happy with the product.", "verified": true, "helpfulness": "0/0", "author": "Jogene"}, {"rating": 5.0, "review": "This is perfect.  We wanted to be able to watch movies and shows without having to pay the price of cable and this does the job.", "verified": true, "helpfulness": "0/0", "author": "Maxime Soto"}, {"rating": 1.0, "review": "This is garbage. Ive had it about a month and I have constant issues. Freezing, content not loading. WiFi issues all the time. The apps are slow and clunky. This shouldn't even be sold. DO NOT but this.", "verified": false, "helpfulness": "0/0", "author": "Clint Chesney"}]