[{"rating": 5.0, "review": "We have a Roku HD installed in each of our two rooms at home and they work great but they only support 720p and YouTube channel is not available. This new streaming stick supports both 1080p and YouTube. We connected it to the TV in the living room and it works as expected.", "verified": true, "helpfulness": "1/2", "author": "Char"}, {"rating": 4.0, "review": "Very nice device. However, it seems much slower than the Roku 3. I have two of those that are much further away from the router and seem to be faster. The R-stick is less than three feet from the router while the R-3's are 30 to 50 feet away. But, I'm happy with it.", "verified": true, "helpfulness": "1/1", "author": "R. R. S."}, {"rating": 2.0, "review": "Crap.  Ok interface and easy setup.  All wasted on crappy streaming.  I bought this thing to get Showtime on my TV.  Showtime has not figured out that this is something people want on more then just one platform so I bought the Roku after seeing the price and hearing generally good reviews.  Everything on the Showtime app was out of sync and it kept buffering for very long periods of time.  Not a functional way of viewing anything.  I have a Verizon Fios REV modem/router and it is 2 feet, direct line of site from the stick.  There should be no problems with bandwidth on my end.  As a completely non comparative test, I streamed episodes off Showtime to my iPhone and computer and there was almost no buffering at all.  To troubleshoot, I did a factory reset two times.  No dice.  Since the showtime app was all I bought the stick for, I'll likely return it to Amazon.  Too bad.UPDATE: DAY 2The device worked better today.  Still out of sync but the buffering was quicker.  I'll keep trying it for the next week or so and update accordingly.", "verified": true, "helpfulness": "9/22", "author": "Patrick Krass"}, {"rating": 5.0, "review": "Product came early. Easy to set up and use. Picture quality very good. Buffered a couple of times, but most programs played thru completely. Recommend highly for the price.", "verified": true, "helpfulness": "1/2", "author": "cmib19jf"}, {"rating": 5.0, "review": "Wow this is one powerful little device. Many were beginning to write off the standalone set top box in the wake of the Chromecast's success, but I do believe that Roku has one-upped Google with a device that delivers a lot more capability for just a few dollars more.This device is a Roku set top box on a stick. And that means the following:1. The best DLNA client I've used to date - it even bookmarks partially played video files.2.  Enough horsepower to play Blu Ray-class files in MKV format without having to transcode first. If your Streaming Stick is attached to a home theater receiver it will pass along full Dolby Digital and DTS audio. I have yet to see anything at a $50 price point be able to do that.3.  Full support for all of Roku's video channel ecosystem including Netflix, Amazon, HBO Go, etc.In short it's probably the best streaming media box available at the moment, and it can be powered off a USB port included in most modern televisions. It's quite impressive.The only negative is just the length of time it takes to boot up and load some of the channels (especially Netflix). But that minor issue aside I highly recommend this very capable little device to bring streaming video to an HDTV.", "verified": true, "helpfulness": "9/10", "author": "Lon J. Seidman \"lon@ lon.tv\""}, {"rating": 1.0, "review": "Couldn't get it to work with my external audio speakers.  Interface was slow and buggy.  Playback was interrupted frequently for spats of buffering.  Returned. Save your money.", "verified": true, "helpfulness": "5/25", "author": "Swandog"}, {"rating": 5.0, "review": "Great streaming because my internet fast but when registered step 4 you have enter a credit card incase you order a pay movie but I have hbo and amazon prime work great small device its also connect to my Android tablet I  able  to change channels very easy easy to behind my tv hdmi power ubs plug", "verified": true, "helpfulness": "1/8", "author": "Willis"}, {"rating": 3.0, "review": "if you get cable TV via Comcast Xfinity, the largest U.S. cable provider, you can't take full advantage of the device. Any channel that requires activation with your cable provider (HBO Go, Watch ESPN, Fox, History Channel, among others) will be useless. Keep that in mind when buying. For this reason, I am returning the item. Otherwise, this is a great device with lots of uses", "verified": true, "helpfulness": "12/24", "author": "Drew S."}, {"rating": 5.0, "review": "I have a Roku 2 & 3 (on separate TV's), ATV3 as well as a Chromecast Stick. I didn't need a Roku stick as the Chromecast has been serviceable* when I travel. I never use it at home though as I like using a remote and access to the plethora of channels. It also doesn't handle Plex very well, which is my main media server on my NAS. I can't remember the last time I used my ATV honestly. Mostly because I ca't use Plex on it and you have to have your computer & iTunes booted up to use it.So now I can take my Roku on the road :) The internals are slower than Roku 3, likely due to the compact size but overall, it still works well and not really noticeable unless you're really trying to compare between the two.*When traveling, if you are staying in a hotel, make sure you bring your own mini router so you can get these devices on the hotel WiFi.", "verified": true, "helpfulness": "20/25", "author": "BRKLYN"}, {"rating": 1.0, "review": "(1) Does not ship with a flexible dongle extension like the Chromecast. If I didn't already have a Chromecast, I would have had to return the Roku without even trying it.(2) I bought this primarily to get a better implementation of Plex than is available on the Chromecast. Although my Roku 3 has some problems with Plex on my other TV, it can be coerced into working. Not so with the Stick. It crashes and forces a reboot of the Stick when I try to run a high quality Handbrake rip of an unnamed TV series episode. The Chromecast can't handle it either, but at least it just stutters and stalls. It doesn't reboot. I intend to remake the program that kills it with decreased quality and see if I can make it work at all with an acceptable level of quality. If so, I'll compare it to the Chromecast with that program. If the Chromecast can handle it, I'll probably be returning the Roku. If the Roku is better, I'll keep it and upgrade my rating to two stars (the dongle extension issue removes the device from consideration for many users).", "verified": true, "helpfulness": "8/42", "author": "Amazon Customer"}]