[{"rating": 5.0, "review": "Really enjoying the Roku. Use it on multiple TV's and take it on the road with me - it remembers all my settings. Seriously thinking of getting rid of cable pretty soon.", "verified": true, "helpfulness": "0/0", "author": "Eric S"}, {"rating": 5.0, "review": "I really enjoy this device for the price and size of it compared to the typical $99 price of other streaming devices. It has plenty of options to stream from like netflix, amazon, and hulu, as well as a bunch of other random options. It's not bulky like some of the other devices. Only other comparable device is the chromecast, but I like not having to have another device responsible to playing like a phone, tablet, or computer. This device is independent. Other than needing wifi. Only benefit of a roku 3 over this is games (which wasn't a concern for me), and having an Ethernet port (which wasn't helpful since I didn't have a place to plug it into in the room I'm using it in).The only thing I'm hoping they come out with an update for is for mirroring off of devices. The only thing I think you can stream from your phone currently is netflix and YouTube. Both of these already have apps on the device itself so that isn't exactly a plus. If you could mirror thighs from your phone or tablet that roku doesn't already have channels for, then this would be the best device out by far.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "While it us true that the Roku Stick does take some time to load when you power up your TV I see no reason to get bugged about it. After all I'm using a device that lets me watch video on my TV via WiFi how cool is technology?! http://youtu.be/uEY58fiSK8E", "verified": true, "helpfulness": "0/0", "author": "S. Hummer \"Steven\""}, {"rating": 1.0, "review": "A friend of mine suggested Roku, he was so enthusiastic about it that I bought a Roku 2 for my kitchen and a Roku 3 for my bedroom. Two weeks after I received the unit it stopped responding to the remote, I figured it just needed to be setup again. I work two jobs and haven't had the time to watch any TV recently, and by the time I really had a chance to sit down with the unit and discover that it wasn't working at all it was 2 days after the 30 that Amazon allows for returns. I called Roku support and talked to a girl who was very nice, but wasn't well suited to support. On top of this, she had received no training from Roku. The call took an hour and 45 minutes, she left the call 8 times to talk to her supervisor. This was an hour and 45 minutes of her fumbling around blind, with her superiors unwilling to believe that the unit was broken, an hour and 45 minutes of my time that I'll never get back, endlessly rebooting a Roku unit. I think some people might say that it's a great product, but the support sucks, but that's not really true. The support is the product. It's all the product. I think consumers think that corporations are somehow misinformed about how bad their support is, but does that really make sense? That a company could build a great little TV box, with new technology, have QA/QI departments, have whole departments to manage their image, but be uninformed that their support sucks? It seems far more likely that choosing to have bad support is a conscious decision. And if it is, isn't the purpose of that decision to force customers to get tired of waiting on the phone, repeating idiotic tasks, and simply go away. Or (homerun!) buy another brand new unit? If you had to choose one, does what I experienced sound more like support, or theft?Your support team decided that my unit was broken and told me where to send it to be fixed. I asked for a mailing label, and was told that only customers that bought their units directly from Roku were \"real enough\" customers (not her words) to get mailing labels. Because I bought my Roku from Amazon, I simply didn't measure up. So I returned my unit during a lunch break and waited. And waited. And I called Roku and they told me they had lost the unit. At first they didn't know who I was because the email address they had for me, the one I repeated over and over, was wrong.  Then they said they hadn't received my unit, and to check my tracking number. After telling your support person that I didn't have a tracking number, she told me to find the tracking number. I did speak to her superior, and after telling him that I didn't have a tracking number, he told me to look for the tracking number. I told him (and this is becoming a social experiment for me at this point) three times that I did not have a tracking number, and each time he advised me to look at the tracking number. So I ask you - who do you think lost this package? The mailman or your \"support\"? My feeling is that working for a company that makes you say things so silly and be so scared to do the right thing is dehumanizing. Initially I felt angry, but as the conversation progressed I felt sorry for him. Your support supervisor was acting like a monkey, acting insane, to keep his job.I feel like I've been through enough now, I'd like you to be decent. I sent you a Roku 3 that broke only weeks (maybe during the first days - I didn't have time to turn it on) after I bought it. It doesn't matter where I bought it, I'm your customer, I bought a couple of Rokus, and if you check your records you'll see that's true. If you check your records you'll see that I've spent 2 and a half hours with your support team. I would like you to send me a replacement unit. I'm your customer, I'd like you to treat me like it matters to have customers, and like I matter enough to replace a unit that has so thoroughly been tested as being bad. Will you do the right thing?", "verified": false, "helpfulness": "2/4", "author": "David \"David\""}, {"rating": 4.0, "review": "I like it because it allows the kids to play WII, not because it works any better than anything else.", "verified": true, "helpfulness": "0/0", "author": "BRETT ROBINSON"}, {"rating": 2.0, "review": "Streaming is very slow, causing it to freeze up frequently. I definitely should have spent the extra for a regular Roku, which I love. I'm sorry I missed the return window. I don't use it.", "verified": false, "helpfulness": "1/2", "author": "Pat"}, {"rating": 4.0, "review": "Love my Roku stick. Only reason I don't give it 5 stars is that it has to be plugged into a power adapter, so you must have an outlet closeby.", "verified": true, "helpfulness": "1/1", "author": "Sloane Rogers"}, {"rating": 5.0, "review": "I HAVE MANY OF THE SERVICES ON MY IPAD AND LOVE THE IDEA OF BEING ABLE TO VIEW THEM ON MY TV. HOWEVER, I DO NOT KNOW WHEN I WILL USE IT, NEW FALL TV SEASON STARTS NEXT WEEK.", "verified": false, "helpfulness": "0/1", "author": "RED"}, {"rating": 5.0, "review": "We love our ROKU !!!! It has made television affordable and so easy! All you need is an internet connection! Tons of free channels!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "streaming live programs has to pause and load every little bit. Still learning about other stuff..", "verified": true, "helpfulness": "0/0", "author": "Larry Hollifield"}]