[{"rating": 3.0, "review": "I got this thinking that the TV resolution would be up to the 1080i standard. It is not. The best I get is 720 which is definitely fuzzy.", "verified": true, "helpfulness": "0/0", "author": "ShelterIslandJoe"}, {"rating": 5.0, "review": "Love this Roku's", "verified": true, "helpfulness": "0/0", "author": "Grampy John"}, {"rating": 5.0, "review": "Bought this for my family's living room. Works just as good as my Roku TV. I was skeptical on buying this over the Roku 3 but I have not seen any problems. I have a basic router and I have no problems with load times. I would recommend this over the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "William P."}, {"rating": 1.0, "review": "The Roku stick is not like the  Roku box. The remote feature of the stick does not seem to work but 10% -20% of the time and the only way I can get back \"home\" is to go to Netflix or Amazon button on the bottom and then hit the back button. I tried it on 2 different TVs and then packed it up after almost 2 wasted hours. GO FOR THE ORIGINAL ROKU with the box.", "verified": true, "helpfulness": "0/0", "author": "Susan J Hamadock"}, {"rating": 4.0, "review": "Minus one star because you need a Roku account (no need with Chromecast!). Otherwise just as easy as any Roku plus it just plugs in an hdmi port and a power source and that's it. Set up wifi and GO!", "verified": true, "helpfulness": "0/0", "author": "Doug \"computer nerd\""}, {"rating": 3.0, "review": "We have used Roku for years and the streaming stick has given us more issues than any of them. It buffers a lot more and takes forever to load. It's worse if it's plugged into the TV for power and will sometimes suddenly restart. We love Roku but not so much the streaming stock until it gets its issues fixed. We are hoping they update it and fix all these oasis", "verified": true, "helpfulness": "0/0", "author": "ihearangels"}, {"rating": 5.0, "review": "Great product. Although refurbished, no problems with set up or usage so far. Planning on buying another!", "verified": true, "helpfulness": "0/0", "author": "Teasha Fleming"}, {"rating": 4.0, "review": "Very satisfied with this product.", "verified": true, "helpfulness": "0/0", "author": "Ernie"}, {"rating": 1.0, "review": "Wouldn't connect to our perfectly fine internet. Then reset it and TV wouldn't recognize it. Getting replacement to see if it was a dud. If the replacement doesn't work forgoing ever purchasing this piece of crap again!!!", "verified": true, "helpfulness": "0/0", "author": "Lauren Bulley"}, {"rating": 5.0, "review": "Works perfectly and just as it was described.", "verified": true, "helpfulness": "0/0", "author": "Susan Richards \"Keeper of Hope\""}]