[{"rating": 5.0, "review": "Great product..  Plan to buy more", "verified": true, "helpfulness": "0/0", "author": "Patrick Miller"}, {"rating": 2.0, "review": "Not really useful in Greece.. Limited channels variety, no netflix, no hbo, no amazon tv, unfortunately a waste of money", "verified": true, "helpfulness": "0/0", "author": "Kwstas7"}, {"rating": 1.0, "review": "Don't buy this crap! The stick is so much slower than the regular Roku box which I love. I purchased two of these stupid sticks and one already broke.", "verified": false, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "LOVE it! Get rid of cable!!!!!Remote is so intuitive and easy to use and a WONDERFUL selection of materials for adults and children!", "verified": false, "helpfulness": "0/0", "author": "jennifer Brockman"}, {"rating": 3.0, "review": "Remote is sometimes non-responsive.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought this because my Google Chromecast could not do Amazon Prime videos and I wanted an alternative when away from home. I was pleasantly surprised by how many features the Roku provides and the interface is pretty nice as well. The remote is a very nice touch and makes navigating & setup much easier.", "verified": true, "helpfulness": "0/0", "author": "Brax"}, {"rating": 4.0, "review": "I just wanted to re-post comments since I have used this device for a while. I have seen a lot of comments about the remote and totally agree that it is pretty useless. I have a windows phone and downloaded the Roku app. It works great it is available for android and apple also. For one thing it is big and lit up, I am 62 yrs old and my eyesight isn't what it once was. Now i see all the buttons. I have never had to reset the stick or had any disruptions. But I have Cox high speed internet and get 50 Mbps so the streaming is flawless. I think some of the problems people are having is more with their ISP than the unit. For those people with inferior internet I would suggest a Roku that has an Ethernet connection. That way you avoid having to use WiFi.As far as smart TV's my son has one and i get a far better experience with Roku. For one thing both hulu and Netflix have a different interface when using Roku. You also get Acorn TV for those who really like British shows and PBS app that lets you see all the antique road shows on demand. crackle, YouTube and vevo, as well as amazon prime. there are free channels for those who like really old Westerns like early John Wayne or Gene Autry. also scary movies like Dracula and the wolf man. If my wife wasn't so tech challenged i would have got rid of cable long ago and just used over the air for football.I own a chromecst also and think the roku is far superior.Someone posted they hated Roku but loved Amazon customer service. Well I love Roku and love Amazon customer service. I work for a very very very large retailer and I shop Amazon. The pricing is great and I have never had any problem with the companies that sell their items here. THANKS AMAZON KEEP UP THE GOOD WORK.", "verified": false, "helpfulness": "3/3", "author": "Trex"}, {"rating": 4.0, "review": "I am very pleased with this purchase. It works as promised, and the remote gives it a leg up on Chromecast in my book. One star off for the time it takes to boot up (about a minute).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "not sufficient for distance from TV to wireless unit. returned it.", "verified": true, "helpfulness": "0/0", "author": "Senior Buyer \"Senoir Reader\""}, {"rating": 4.0, "review": "Works well enough.", "verified": true, "helpfulness": "0/0", "author": "nick h."}]