[{"rating": 5.0, "review": "Very easy installation!  Can easily move it from TV to TV.  Like it a lot!", "verified": true, "helpfulness": "0/0", "author": "Larry Brown"}, {"rating": 1.0, "review": "Did not work as I would have liked. The remote seemed not to work properly. My WiFi wasn't fast enough. I'm returning it for a refund.", "verified": true, "helpfulness": "0/0", "author": "mary 1967"}, {"rating": 4.0, "review": "Product works great. Remote not so much. But using the app as a remote is awesome.", "verified": true, "helpfulness": "0/0", "author": "Kirk Edwards"}, {"rating": 5.0, "review": "The best streamer out there.  Works better than anything else on wifi.", "verified": true, "helpfulness": "0/0", "author": "jason Williamson"}, {"rating": 5.0, "review": "It is great.", "verified": true, "helpfulness": "0/0", "author": "Sue Torres"}, {"rating": 5.0, "review": "Excellent value, easy installation, works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Wanted it for streaming my media from my PC to my tv but it does it very poorly, doesn't play many many files.As for pure internet tv, it does that, but very very slowly, not buffering over my network, just loading from Roku along with the same three or four commercials every ten minutes over and over all day/night long.I don't dislike it, but I don't like it much either.", "verified": true, "helpfulness": "0/0", "author": "Patrick Nelson"}, {"rating": 5.0, "review": "This is my third Roku.  Works just great.", "verified": true, "helpfulness": "0/0", "author": "Richard L. King"}, {"rating": 5.0, "review": "I have enjoyed using this rather than the Apple TV 3 that I have been using.  The interface is so much better and the performance is also much better, no waiting for buffering or mysterious disconnects. The remote is also much easier to work with vs. the narrow metal strip that Apple provides.Roku rocks even on this little level.", "verified": true, "helpfulness": "0/0", "author": "Foster"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "laura"}]