[{"rating": 5.0, "review": "Works great! Love it.", "verified": true, "helpfulness": "1/1", "author": "Swell"}, {"rating": 2.0, "review": "I have purchased several other Roku's in the past, but I was not impressed by the streaming stick.While the boot time and processor are slower, these are things I came to expect with a lower cost device like the streaming stick. However, there were several other major issues I found during my time using the stick.The UI was occasionally laggy and sometimes wouldnt respond to input at all even though a sound was played to acknowledge a button press.The WiFi radio strength is pretty poor so don't expect to pick up a medium strength signal very well. Picking a WiFi channel that isn't used very much might help, but even after changing this the Roku's would frequently have to pause to buffer or would just not have network connectivity at all. My Roku 2 works fine at the same location, and the signal strength was read as -70dBm which should be adequate for the application. In summary, if you don't live in a small apartment where the router is one wall away, you might have problems picking up your wifi.I would reccomend that anyone looking to purchase this product instead purchase a Roku 2 and have a much better experience. It's worth the extra money.", "verified": true, "helpfulness": "0/0", "author": "Jory Morrison"}, {"rating": 1.0, "review": "The remote control worked for 2 days only. It suckssss", "verified": true, "helpfulness": "1/2", "author": "arturo gonzalez"}, {"rating": 5.0, "review": "Received the Roku Stick within about 10 days of ordering.  Easy to set up and works great.  I have already canceled DirecTV and am just using the Stick to watch programs.  Do not have an over-the-air antenna, but might try that later in order to have \"local\" news and weather.  Probably will consider ordering a second Stick for bedroom TV.  I thought I might have to increase my internet connection speed, but 3M download with the Stick and 2 laptops has not been a problem (DSL connection).  I chose the Stick so that I could plug it into the back of my TV and not have a \"box\" to take up space on the tv stand too!", "verified": true, "helpfulness": "0/0", "author": "Freddie L. Reed"}, {"rating": 5.0, "review": "Easy to set up and use.  Lots of free entertainment as well as the connection to Netflix which was our primary desire.", "verified": true, "helpfulness": "0/0", "author": "Larry D. Foster"}, {"rating": 5.0, "review": "Good product. gives lots of extra options for shows and movies. Still exploring all I can use it for.", "verified": true, "helpfulness": "0/0", "author": "itsdean"}, {"rating": 4.0, "review": "This product works for your video streaming needs. Very simole and easy to set-up. Only drawback so far is that I need to get used to not having a cursor while I navigate.", "verified": true, "helpfulness": "0/0", "author": "Micah"}, {"rating": 5.0, "review": "Best thing I ever purchased online. I am addicted to the private channels", "verified": true, "helpfulness": "0/0", "author": "Larry J. Eustice \"coaster camper\""}, {"rating": 5.0, "review": "Terrific product. All our favorite apps are on there. Everything loads super quick.", "verified": true, "helpfulness": "0/0", "author": "Aric"}, {"rating": 3.0, "review": "Works, but is laggyIf I had this to do all over again I would have just bought another $99 unit instead", "verified": true, "helpfulness": "0/0", "author": "Thomas"}]