[{"rating": 3.0, "review": "You need to connect the stick into an ac adapter.  That was a surprise.  Would not have bought it.", "verified": true, "helpfulness": "1/1", "author": "tab"}, {"rating": 5.0, "review": "Love it! This was so easy to install and start streaming! I didn't even need my husband to help me. :)", "verified": true, "helpfulness": "0/0", "author": "J.K."}, {"rating": 5.0, "review": "We've used the Roku devices for the past few years and loved them, but I wasn't sure how the smaller stick would work - especially with a lack of direct sight lines to the remote. However, my fears were unfounded. It works perfectly, and we're able to enjoy our online TV without cluttering the top of the cabinet.", "verified": true, "helpfulness": "0/0", "author": "Cheryl S."}, {"rating": 3.0, "review": "Easy to set up and use.  I think this is definitely a better deal for the money than Google's ChromeCast product.  My only complaint is the Netflix software seems extremely buggy (I'm not sure if Roku or Netflix is to blame for this).  Every so often, I hit the \"Netflix\" button and it just kinda sits there forever.  There's also a frequent issue when I start a Netflix program and I just get a blue screen, with the audio playing and no video.  The solution is always to unplug the Roku and plug it back in.  This is rather annoying since I'd like to plug in the Roku behind my wall-mounted TV and out of site, but I need to be able to easily get to it to reset it.  I ended up getting a TiVo Mini instead, which also supports Netflix, and it seems to work a lot better.", "verified": true, "helpfulness": "0/0", "author": "Mike Christensen \"Mike Christensen\""}, {"rating": 4.0, "review": "i would give this five stars if I could leave it plugged in to my tv all the time. I love all the content that is available, much of it free and some at a very reasonable price. However the radiation it puts out interferes with my t-v if I want to watch over-the-air or cable to the extent that they are unwatchable if it is plugged in. Not the biggest hassle in the world, but if I had known I would have opted for a different model that could be placed a bit farther from the t-v and eliminate the problem entirely.", "verified": true, "helpfulness": "0/0", "author": "KB"}, {"rating": 5.0, "review": "Great product. Works just as advertised.", "verified": false, "helpfulness": "0/0", "author": "Jose Eduardo Prieto Garza"}, {"rating": 5.0, "review": "I love it better than the ROKU 3!", "verified": true, "helpfulness": "0/0", "author": "Mid Cities Dave"}, {"rating": 2.0, "review": "Two didn't work properly. The first one worked great for a couple months but then the remote buttons only worked after repeatedly pressing. Amazon replaced it quickly and without charge, but the second started behaving the same after a few days.", "verified": true, "helpfulness": "0/0", "author": "J. J."}, {"rating": 2.0, "review": "Netflix, Hulu and a host of other channels that work on my chromecast are region blocked by roku.", "verified": true, "helpfulness": "1/1", "author": "Travys"}, {"rating": 2.0, "review": "I purchased a new HDTV that wasn't a SMART TV, so I thought I'd give Roku a try, rather than buy another Sony Streaming Media Player box.  The main reason I bought this was because of the \"over 1,000 channel\" feature.  Big disappointment there. Roku advertises \"HULU PLUS\" free, for example, when you buy this.  Well, that's free for 60 days. Tons of other channels, when you try them out, have such inadequate and limited content.  Many unheard of channels with poor content are not free. Some don't even give you a 30-day preview. They have \"CAT TV\" which is supposed to be entertainment for your cats while you're away.  It consists of a few blurry videos someone took at home of their cat running around. And at a cost of $.99 per month!More Cons and Pros:CONS:-Streaming is definitely slower than my Sony Streaming Media Players.-The Roku screens are cheesier I'd say than what you see with the Sony boxes.  Sony's definitely has a slicker look when it comes to what you see when navigating thru things.-There are some \"private\" Roku channels which are just those that aren't in their channel listing yet.  The titles to some looked good, but they are pretty much like the rest - limited and/or poor quality content.-You have to set up a Roku account and there's no way that I saw to get around giving them a credit card number.  That's because some of the channels have monthly subscription fees (beyond Netflix, etc.) You may have to keep an eye on things so kids aren't ordering channels with subscription fees on their own.-Rhapsody isn't offered on Roku, although Pandora is.-The power cord is short. There's no off button on the remote, so to power it down, you've got to either unplug it at the wall or where the power cord plugs into the stick on your TV.PROS:-The feature of being able to use an Android or iPhone app to control the unit is handy and I actually like it better than the little Roku remote.-The Roku stick plugs into a HDMI port, which is nice, as opposed to being a bulky box. So, it's more portable than a box if you want to move it to another TV or take your TV outside.I think I'll pretty much be using Roku to watch Amazon Instant Video and listen to Pandora.  I gave it a try.", "verified": true, "helpfulness": "0/0", "author": "Max Daddee \"M. White\""}]