[{"rating": 5.0, "review": "It has changed the way we watch TV.  Now watch a lot more movies.  Works great.  Highly recommend this", "verified": true, "helpfulness": "0/0", "author": "Randannie"}, {"rating": 5.0, "review": "Makes any TV a smart one.  You don't get the buffering problems you have when using your smart TV.  I have two of them.", "verified": true, "helpfulness": "0/0", "author": "Douglas Sumrell"}, {"rating": 1.0, "review": "Five stars for Roku Streaming Stick (I love it) - minus four stars for Amazon \"certified\" refurbished.Why do you send DEAD batteries? It is really annoying, I'd rather have no batteries at all.", "verified": true, "helpfulness": "1/2", "author": "JD"}, {"rating": 5.0, "review": "Changed my life! I would be very unhappy without it. TV viewing is so bad most of it is unwatchable. With Roku there are many free channels and easy access to Netflix, Amazon Prime and Acorn to name a few and there are hundreads more! Plus now Slingtv is supported. There's a whole new world out there and you are in charge.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it !!!", "verified": true, "helpfulness": "0/0", "author": "adele"}, {"rating": 1.0, "review": "Product is useless unless you give them a credit card #. Return in progress.", "verified": false, "helpfulness": "3/3", "author": "AnnMarie Adams"}, {"rating": 5.0, "review": "Loved this. I use it everyday and it's just so much cleaner, snappier, and more intuitive to use than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Sk8erBoiWasTaken"}, {"rating": 4.0, "review": "User controls could be better", "verified": true, "helpfulness": "0/0", "author": "John ChiTown"}, {"rating": 2.0, "review": "im trying to download music and it won,t let me. i try,d chating with roku but the chat box didn,t clear the screen so i can send the message. i also perchased a fire tv and had no problem downloading music. im gonna try one more time if i can,t i will try to return it", "verified": true, "helpfulness": "0/0", "author": "michael joseph"}, {"rating": 5.0, "review": "Installed without any problem.  Works better than I expected.", "verified": true, "helpfulness": "0/0", "author": "Leo Hetling"}]