[{"rating": 4.0, "review": "very handy little thing am really enjoying being able to watch  netflix and more in the bedroom no messy wires, neat and orderly, and  love the remote!", "verified": true, "helpfulness": "0/0", "author": "Laurie McKenna"}, {"rating": 3.0, "review": "Very slow. I have another roku and it's a lot faster then this one.", "verified": true, "helpfulness": "0/0", "author": "Stephanie De La Rosa"}, {"rating": 5.0, "review": "work great", "verified": true, "helpfulness": "0/0", "author": "edna zissler"}, {"rating": 4.0, "review": "Love it. It works just as advertised. It is a little slow on loading compared to the box but instead of 3 seconds to load it takes 4-5 seconds. Not a big deal.", "verified": true, "helpfulness": "0/0", "author": "Jason Golt"}, {"rating": 4.0, "review": "Bought a Samsung smart HTS 2 years ago, 6 months after purchase it started giving me minor problems Went on to purchase a Samsung smart tv and have had much better luck with that  Since I don't use cable, I rely on streaming and antennas and the smart hub in my HTS has been a source of constant aggravation for almost the last year and not being able to stream pretty much puts my largest TV out of business so I began researching alternate options for streaming  My main concerns with a streaming device are that I'm able to stream both Netflix and Hulu, that its reliable, and easy to operate  After researching and reading many reviews I chose to go with the Roku Stick and so far I'm very happy  I love that the stick offers History channel and Lifetime which my smart hub does not  It also has Pandora, Youtube, Crackle, Vudu, MGo, and so many channels my hand would cramp if I tried to type them all  The only reason this isn't getting 5 stars is because there is a bit of lag and I'm not sure you can turn it off without unplugging it and if you can I haven't figured it out so not crazy about it being on all the time  Time will tell how reliable this will turn out to be but for now I am one happy customer", "verified": true, "helpfulness": "0/0", "author": "lennon587 \"lennon587\""}, {"rating": 5.0, "review": "This is the best thing since white rice. Although it is somewhat deceiving as far as the channel options, which most do not have a good selection at all and some I would classify as soft porn, it is convenient to have amazon, netflix, etc in one place with one remote.", "verified": true, "helpfulness": "0/0", "author": "Bernard Castro"}, {"rating": 1.0, "review": "unable to install device.......a total disaster....can not get any on line help", "verified": true, "helpfulness": "0/0", "author": "Gilson Greytok"}, {"rating": 5.0, "review": "works great.", "verified": true, "helpfulness": "0/0", "author": "Linda Wallace"}, {"rating": 5.0, "review": "top produkt", "verified": true, "helpfulness": "0/0", "author": "rob"}, {"rating": 4.0, "review": "I got rid of cable and for most part I don't miss it. A few shows I can't find (history and ID channel)?Saving close to $100 a month. I have been unplug and take between family room and bedroom but think will order a second soon. Little to no functional problems.", "verified": true, "helpfulness": "0/0", "author": "sydne north"}]