[{"rating": 5.0, "review": "Great idea and great product.  Easy to install and use.  This will revolutionize my television experience.", "verified": true, "helpfulness": "0/0", "author": "Terri G"}, {"rating": 5.0, "review": "Ruko is the best . If you complain about having one of these you should move to the moon . Because this is a great gadget with all kinds of free or pay service program . Best one out there. I recommend the stick because I did have the ruko 3 and lightning hit my cable and went thru the ruko to the tv and blew it out . The stick will avoid me that fear and while it is alittle slower than ruko 3 it is still GREAT!", "verified": true, "helpfulness": "0/0", "author": "SkinnyDude \"skinnydude\""}, {"rating": 2.0, "review": "This was shipped quickly and brand new just like ad said. My 2 star rating is regarding the product itself. I already had a roku 3 and thought I would get this for my kids room since we recently got rid of cable all together. This thing is so slow compared to the roku 3. Not only does it take like 5 minutes to completely boot up and load everything but even then it's still extremely laggy compared to the roku 3. To me this thing is only worth about $10 max. I am going to throw this away and just go get another roku 3. Don't waste ur time and money.", "verified": true, "helpfulness": "0/0", "author": "misty cochran"}, {"rating": 5.0, "review": "So easy to use. I've been watching Netflix, AmazonPrime and HBOGO without having to be off my laptop. Love this product!!!", "verified": true, "helpfulness": "0/0", "author": "Colleen P Quigley"}, {"rating": 1.0, "review": "Very poor reception! Needs to be close to where your wireless router is. Buy only if you were going to install it on a TV at the same floor level as your wireless router.", "verified": true, "helpfulness": "2/2", "author": "44r0n m4nu3L"}, {"rating": 5.0, "review": "Great little product, my only complaint is not with the stick or Roku - but now need a booster for my signal!", "verified": true, "helpfulness": "0/0", "author": "L. M.M \"LisaMay\""}, {"rating": 5.0, "review": "Love how easy this is to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Addict Jessica \"jessicamarie917\""}, {"rating": 1.0, "review": "The first one came from amazon and it was dropping connection every 2 seconds. The second one had the same problem plus it did not communicate with Roku account. The stick does not communicate with remote properly. I have tried both regular remote and android app. I spent two evening trying to fix those issues without any success. As result, I do not recommend this streaming stick to anyone who values their time and money.", "verified": true, "helpfulness": "0/0", "author": "Dan \"Algor\""}, {"rating": 1.0, "review": "sent back for recorded programming...not so good", "verified": true, "helpfulness": "0/1", "author": "Jacki O"}, {"rating": 4.0, "review": "they work great.  fast streaming & the kids really enjoy them. great product i do encourage people to buy.", "verified": true, "helpfulness": "0/0", "author": "ronisha"}]