[{"rating": 1.0, "review": "I bought this hoping to be able to stream video to the TV in my bedroom.  We had an older wifi connected blu-ray player in there that we had been using, but it couldn't stream some of the channels we wanted to watch, namely HBO go.  After reading the reviews, I decided to get the Roku streaming stick over a Chromecast, since we wouldn't have to use a phone/tablet as an intermediary this way.When I got the Roku, I performed the initial setup, and after it did its initial software update, it would never again connect to our wireless network.  I spent several hours trying to get it to work, including an hour on the phone with Roku tech support.  Nothing I tried could get it to connect after that initial set up, so I sent it back.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer \"jhbwolverine\""}, {"rating": 5.0, "review": "So much better than expected.  Such an amazing variety coupled with ease of use.  I would recommend this to anyone", "verified": true, "helpfulness": "0/0", "author": "Michael P Smith"}, {"rating": 1.0, "review": "I bought this items, because everywhere is advertised as capable of streaming Netflix movies.When yo go to Netflix site, you find it only works for Canada, UK and USA.I feel completely cheated, as even though I have a Netflix account, I can not use the Roku streaming box !!!!I feel like I should return it and publisg others to be warned", "verified": true, "helpfulness": "0/1", "author": "Carlos Morató"}, {"rating": 5.0, "review": "I have a older model in the family room.  Bought this for a new tv I just purchased.  Very easy to set up and start using.", "verified": true, "helpfulness": "0/0", "author": "Kathy Florczak \"throkmorton\""}, {"rating": 1.0, "review": "I would like to love this device but it won't wake up when you try to use it.  I have reported the problem to Roku and they have not responded.  Unit they fix it i would not recommend this.", "verified": true, "helpfulness": "1/1", "author": "RAN"}, {"rating": 5.0, "review": "For half the price of a grown up Roku, which I also bought, this works just as well.  Use it in the bedroom where I don't need to stream too often.  Comes with a regular remote, so I'm not even sure what the difference is between this and the full sized unit. It's a terrific value IMHO.", "verified": true, "helpfulness": "1/1", "author": "Linda Scott"}, {"rating": 2.0, "review": "Not great, just keeps freezing up a lot, plus there is not a lot of interesting stuff to watch.A long way to go yet before it improves.", "verified": true, "helpfulness": "0/0", "author": "Mr. Joe  Chambers"}, {"rating": 5.0, "review": "I found this to be as advertised with simple directions and quick up and running on my own cable Wi-Fi. I think it might give a little improvement in picture quality.", "verified": true, "helpfulness": "0/0", "author": "Richard Falck"}, {"rating": 1.0, "review": "We own Roku 2 and Roku 3 boxes.  I decided to try the new Roku stick for a guest TV and it did work for a few weeks.  It seems that after that period of time something happened to the stick and started acting up, freezing, not loading apps, etc.  Did the usual reboot, reset to factory, etc etc. I decided to call Roku after noticing that the Roku stick was getting very hot, it did not seem safe anymore.  I spent over an hour with Roku support, they were very hard to understand, I had to ask them to switch me to another person and then to a supervisor because they initial level of tech support all they know how to do is reboot and reset the unit which I have already done.  The supervisor was very rude and also was trying to just get me to reset the unit again, something I already did with the previous support person twice!.  After explaining that something apparently went wrong with the device and needs to be returned to Roku to get it replaced/repaired, he still did not want to hear it and wanted to ask again about the brand of router I am using and what wireless channel it is set even after I explained that I already did the regular troubleshooting by myself and also with the second person in customer support.  Every other device in my home connected to the router, which includes Roku 2 and Roku 3 players are working just fine, but he did not want to hear it.  He started raising his voice and at that time I decided that was enough and asked for the unit to be replaced since we have gone around and around for too long.I expected so much more from Roku.  They need to learn from Amazon or even Apple support.  In fact I even bought a WD streaming box 2 years ago and their support was top notch when I had to call and ask them how to connect it to an older TV.  Maybe Roku is not spending enough on the customer support area.Roku lost a good customer today, I will not purchase another Roku box and I will encourage everyone else that asks me to buy something else because this is not how a company should treat their customers if they want to stay in business.", "verified": true, "helpfulness": "145/164", "author": "V. Santillan"}, {"rating": 1.0, "review": "At my home, Roku stick was OK on some programs and not acceptable on many - due to frequent and repeated streaming pauses. My Roku stick was within ~10 ft of my Cisco E1500 wireless N router on Comcast hi speed cable modem network.Some PBS and Acorn shows started after a minute or less and ran through without pause(s). Others took more than a minute to start, paused after a minute or two for up to five minutes and some shows then paused multiple times for a minute or more (at which time I gave up). To me, this is unacceptable. I wrote twice to Roku tech support but have not heard back (after nearly a week).I have returned my Stick and have ordered a Roku 3 in hopes that its performance is acceptable - time will tell...", "verified": true, "helpfulness": "28/28", "author": "George Collins"}]