[{"rating": 5.0, "review": "Gave to my son-in-law and he loves it.  They have just the basic cable so this allows him to watch tv shows he normally does not get to see.", "verified": true, "helpfulness": "0/0", "author": "hebrew"}, {"rating": 1.0, "review": "Even with the help of a live chat person, stick would not install, blamed it on a slow Internet, which is ridiculous, she even suggested I get a new router, which is also ridiculous as I have the fastest", "verified": false, "helpfulness": "0/0", "author": "Coco nut"}, {"rating": 5.0, "review": "works good", "verified": true, "helpfulness": "0/0", "author": "William Batton"}, {"rating": 4.0, "review": "Loving the roku. Was worried by reviews that it would be slower than the box but have not had any streaming issues with it so far. Use it for amazon, hulu and netflix without any issues. And love that it's so easy to change between TVs.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "We have the Roku box on our living room TV at home and love it.  For Christmas I got a Roku streaming stick to put on my kitchen TV.  I liked the fact that the stick was small and wouldn't take up any of my valuable counter space.  My husband plugged in the stick and had some difficulties getting it to set up on the TV.  We finally got setup done.  It works pretty well, but I have noticed that it is a bit slower than the box.  Not sure if that's because of the way the stick is made or because our box is located next to our router.The problem we have now is that the remote for this thing devours batteries.  Since Christmas (less than 2 months ago), this thing has gone through 4 sets of batteries.  In the 6 months we've had the Roku box, we have gone through one set of batteries, even with my son using headphones with it.  I know the batteries are dead in the remote because we have a battery tester and I check them each time.  I wish we had bought the Roku box now, instead of the streaming stick..", "verified": true, "helpfulness": "0/0", "author": "S. Ammons \"celtic queen\""}, {"rating": 4.0, "review": "This device was everything I hoped for. I use Roku primarily for Youtube and Netflix. I mostly cast content from my phone but occasionally use the regular Roku UI apps (when my phone is off, etc.). Either way it is a great experience. I haven't experienced any crashing, freezing, glitches, etc. Loading times weren't incredibly fast but are not as bad as others describe them as. I also use the screen mirroring function to stream content that is not displayed through Roku apps (for example, shows from the USA app for Android). This experience was surprisingly good. I will not say it was perfect because sometimes I had to restart my tablet and the Roku a few times in order to get it to work, however, I willingly looked past this due to the fact that this feature is still in beta (at this time). For a new feature still in beta, it worked great. Once I got it to work, streaming video was nearly flawless. The only reason that Roku didn't get five stars was due to the app selection. I would like to see in the future TV station apps (USA, TNT, etc.). Obliviously licensing plays a part in this selection, but hopefully in the future the app store can be expanded. If/when this happens, I will gladly change my rating to five stars. Other than that, this was a great purchase. The price was reasonable given it turns a regular TV into a smart TV. Recommended for anyone looking to stream internet content to a TV. Note: this requires a HDMI port as well as a power source (USB or standard plug).", "verified": true, "helpfulness": "0/0", "author": "john.l"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Shaun"}, {"rating": 3.0, "review": "So far the stick works as promised, but I am a little disappointed by a lot of the channels available on the device.", "verified": true, "helpfulness": "0/0", "author": "MarkOC60"}, {"rating": 5.0, "review": "I gave it to my parents after they were unsuccessful in operating the Chromecast I got them.  They are very happy with their Roku", "verified": true, "helpfulness": "0/0", "author": "Todd Brugma"}, {"rating": 1.0, "review": "Ok, so you can access NetFlix, Amazon Video, Hulu and the other paid services and watch what whatever you want from those providers. Those providers are great, so if that's what you're getting it for, go for it. However, the next tier of decent channels are only as good as your cable provider will allow. You need to log into each of those channels' websites, choose your cable provider and enter an access code. If your cable provider isn't listed, or you don't have cable, SORRY! If you thought you could get rid of cable and replace it with a streaming device, think again. Very few channels offer true live streaming of what's being show at the time on there channel. On top of that, in my opinion, 95% of the remaining ~1500 channels are just crap that someone created at their kitchen table. If that weren't bad enough, after a week, the Roku froze up and was uncontrollable through the remote. I believe most of the positive reviews here are bogus.", "verified": true, "helpfulness": "1/2", "author": "John H."}]