[{"rating": 5.0, "review": "My Father Loves the Product and it easy to work set up and work with", "verified": true, "helpfulness": "0/0", "author": "Algie Wiley"}, {"rating": 1.0, "review": "No stars. Sent it back. Very inconsistent, lots of problems.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love this streaming stick. It is fast and reliable and easy to work once everything is set up. I have friends who have Chromecast and Firestick and they are not as easy to use, nor do they support all the channels that Roku does. Definitely worth the extra money", "verified": true, "helpfulness": "0/0", "author": "G. Shader"}, {"rating": 1.0, "review": "It's been one problem after another.  Support honestly has no idea what there doing or how to trouble shoot.  I still can't get it to work!", "verified": true, "helpfulness": "1/1", "author": "Lisa Fryar"}, {"rating": 5.0, "review": "It plugged in and set up super easy.  Works great. no problems after 3 weeks. We use it to watch down loaded TV/movies using Plex. Works very well for that.", "verified": true, "helpfulness": "0/0", "author": "Teri Miller \"TLM\""}, {"rating": 5.0, "review": "completely satisfied.  working great", "verified": true, "helpfulness": "0/0", "author": "willie evans"}, {"rating": 1.0, "review": "Ever since I bought this product I am experiencing constant buffering and freezing, I called so called \"customer service\" asking for help but they could not offer any except for rebooting device and routers. I was told that I can send email to help@roku.com whenever I have problems, I did more than 5 times, to my surprise nobody ever responded to my emails.", "verified": true, "helpfulness": "1/1", "author": "Felix Akhtiorsky"}, {"rating": 4.0, "review": "Absolutely no reason NOT to buy this for the price and performance.  We had a smart TV which got the wifi \"smarts\" fried by lightening.  The Roku Stick solved the issue wonderfully, with no repair hassles.  Great on \"dumb\" tv's as well.", "verified": true, "helpfulness": "0/0", "author": "John Thomas"}, {"rating": 5.0, "review": "We've been using it for about 1 year. Occasionally we have to reboot because it will freeze up. Very convenient. Glad it offers our most favorite apps; Netflix, Hulu, PBS, & Amazon.", "verified": true, "helpfulness": "0/0", "author": "Elissa"}, {"rating": 5.0, "review": "Love my Roku", "verified": true, "helpfulness": "0/0", "author": "Stacy E. Johnson"}]