[{"rating": 2.0, "review": "If you plug the usb power cable into the TV, the Roku streaming stick powers on and off with the TV. This would be great if the Roku didn't reboot every time. You have to log back in to all of your accounts over and over again.", "verified": true, "helpfulness": "1/1", "author": "Pete Zoucha"}, {"rating": 5.0, "review": "Now I can have my content anywhere in the house. Plug and play, it just works without getting trapped in a proprietary system.", "verified": true, "helpfulness": "0/0", "author": "Jim Simonson"}, {"rating": 5.0, "review": "OMG!  THIS IS LIKE THE BEST PURCHASE EVER.  I USE IT ON THE NON-CABLE TV.  WORKS WITH WIFI.  GET TO WATCH ALL MY NETFLIX SHOWS AND IT'S VERY EASY TO USE.  YOU HAVE TO SET UP AN ACCOUNT WITH ROKU AND I HAD AN EXISTING ACCOUNT WITH NETFLIX..........PERFECT MARRIAGE.", "verified": true, "helpfulness": "0/0", "author": "Theresa A. Colon \"Teri311\""}, {"rating": 5.0, "review": "Pretty easy to set upI'm told the large size is faster but this works great- very happy with it", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 4.0, "review": "I like goof quality and  small,  only wan point netflix is too slow but i can handle. but the video quality is great", "verified": true, "helpfulness": "0/0", "author": "Andres Reyes"}, {"rating": 5.0, "review": "I would recommend this to anyone that doesn't have a lot of space as it fits right in the back of the tv.  Set up is very easy to understand only takes a few minutes.", "verified": true, "helpfulness": "0/0", "author": "A. M. \"AimeeM\""}, {"rating": 3.0, "review": "I'm not sure if it was my TV but with this model I found Roku to be a bit slow compare with their other models like roku XD 2 overall it satisfied my expectations but I was hoping at least the same performance has the other roku I had", "verified": true, "helpfulness": "1/2", "author": "JDR"}, {"rating": 5.0, "review": "I have always had an xbox and access to hulu and netflix. This wasnt for me it was a gift for my mother who received it yesterday and is already in love with it. Great audio and video quality. Definitely recommemd roku over any competitor. Especially good and easy to use for those old folks in our lives haha.", "verified": true, "helpfulness": "0/0", "author": "Brian Mahan"}, {"rating": 5.0, "review": "Functions just as a Roku box would. I am satisfied with the performance. Great Portability, easier to take with you and set up elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Yeah, this thing is the bomb!  Bought it to replace my kid's WD Live box, which finally started quirkin' out after 4 years, but that's a while.  Who knew that they now could fit the same software and then some into a little USB stick?!", "verified": true, "helpfulness": "1/1", "author": "Joel K. Mitchell \"Joel K. Mitchell\""}]