[{"rating": 5.0, "review": "Works great, love it!", "verified": true, "helpfulness": "0/0", "author": "Holly Day"}, {"rating": 2.0, "review": "The remote does not work right. I have to take the batteries out and put them back in every time I use it or it does not work.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "Device defective, will not keep charge", "verified": true, "helpfulness": "0/0", "author": "Sylvia Johnson"}, {"rating": 5.0, "review": "i love my roku stick... i have 2 roku sticks and 1 apple tv.. it does well compared to the apple tv.. awesome quality. great for the money..", "verified": true, "helpfulness": "0/0", "author": "joy roff"}, {"rating": 4.0, "review": "I have ordered 3 of the roku sticks an they all seem to have the same problem after an update Netflix playing videos before you even click ok. The new remote has a great layout but feels very cheap. The old remote with the other roku sticks have a better build quality.", "verified": true, "helpfulness": "0/0", "author": "Scott R. Gudaitis"}, {"rating": 5.0, "review": "works great.  no problems. love it", "verified": true, "helpfulness": "0/0", "author": "anjiestar"}, {"rating": 5.0, "review": "Easy to use and easy to set up. Using on our 2nd TV - so we can watch things on it, without having to pay for a 2nd device from cable company (we already pay them too much).  I was pleased with how easy it was to set up and use.  Netflix works like a charm, and the wi-fi connection works nicely, even though it is a few rooms away from the router.", "verified": true, "helpfulness": "0/0", "author": "Louis T"}, {"rating": 5.0, "review": "My brother says it works great, enjoys all the free channels. Works much better than the 1st/original Roku.  Easy to install in available HDMI port.  He even said thank you.", "verified": true, "helpfulness": "0/0", "author": "Reed M. Jordan"}, {"rating": 5.0, "review": "Love this! It has a lot of channel to pick from.. really great for the price.", "verified": true, "helpfulness": "0/0", "author": "Connie Jeffcoat"}, {"rating": 4.0, "review": "I just wish that Roku had more apps like the Direct Tv app. But the Netflix and Pandora apps are  definitely very useful.", "verified": true, "helpfulness": "1/1", "author": "Stephanie Perez"}]