[{"rating": 5.0, "review": "Love the roku I haven't had a chance to explore all the features yet but what we have used so far has made me very glad I purchased. Netflix is easy to use as well as access to other free channels and paid subscriptions.", "verified": true, "helpfulness": "0/0", "author": "LJBrooks \"Lauren J Brooks\""}, {"rating": 4.0, "review": "I like it. But lately it's been having to reboot itself. Other than that it's Awesome.", "verified": true, "helpfulness": "0/0", "author": "D Nice"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "RUBEN RODRIGUEZ"}, {"rating": 5.0, "review": "Rather than move the stick from tv to tv ( which is very easy) I decided to buy  amother one so moving the is not necessary.Roku units are truly fantastic. Have everthing we need to intertain, learn new things along with reviewing older shows.", "verified": true, "helpfulness": "0/0", "author": "Gdom"}, {"rating": 1.0, "review": "I really like the idea of this and bought it so that I could stream UFC pay per views. Unfortunately, it is not reliable enough to do so. There is nothing worse than random buffering during a live event!The WiFi antenna is terrible. I installed a repeater because I though it was having a hard time getting a signal because it was in the basement. That did not help. Next I moved it up to my bedroom where it could get a better signal. It currently is 10ft from my router and shows that it has excellent signal, but still has extremely long loading times, and excessive buffering. Sometimes it the show never comes back on after buffering so I have to unplug the power supply.The streaming stick has no IR receiver for the remote so it operates through the WiFi. This would be nice if there was not excessive lag time between button presses. I hit the button, nothing happens so I press it again and it works, then at random times it goes crazy because the extra button presses all go through at the same time.  My smartphone does a way better job at controlling it.Unless you're looking for frustration don't buy it.!", "verified": false, "helpfulness": "0/0", "author": "Eric"}, {"rating": 4.0, "review": "The stick works great. It's a little bit slow but it was advertised as being slower than the bigger (more expensive) boxes. The refurbished package came with the wrong cord for the power adaptor. It was't worth contacting the vendor, I just ran over to Micro Center and bought one that fits. Kinda wiped out the savings of buying a refurbished unit but it all works great now and I'm streaming Netflix and HBO Go with no problems.", "verified": true, "helpfulness": "0/0", "author": "F. Pearson"}, {"rating": 5.0, "review": "came on time and a fantastic product", "verified": true, "helpfulness": "0/0", "author": "greg"}, {"rating": 4.0, "review": "I own 3 of these, they are slow but they are cheap and they work well.", "verified": true, "helpfulness": "0/0", "author": "motormedicine"}, {"rating": 5.0, "review": "This Roku stick was an outstanding value. Within 10 minutes I had it installed in my granddaughter's room and she was streaming cartoons from Netflix!", "verified": true, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 4.0, "review": "It's working well and I like it.", "verified": true, "helpfulness": "0/0", "author": "Gary Carrier"}]