[{"rating": 5.0, "review": "Perfect way to stream television.  I couldn't be more satisfied", "verified": true, "helpfulness": "0/0", "author": "Dawn Straily"}, {"rating": 4.0, "review": "LOVE LOVE LOVE, just dont like that i cant access regular hulu through it.", "verified": true, "helpfulness": "0/0", "author": "lisa"}, {"rating": 5.0, "review": "Gets a lot of channels.", "verified": true, "helpfulness": "0/0", "author": "Betty Thompson"}, {"rating": 5.0, "review": "Wonderful wonderful! The color is so much more amazing than anything I have ever used. All of my apps run very smoothly. And the selection of apps is more than the other products out there.", "verified": true, "helpfulness": "0/0", "author": "Jason Ward"}, {"rating": 3.0, "review": "Takes an abnormally long time to come up. Locks up frequently and reboots itself - then you get to wait several minutes for it to come up again. Once you get it working it seems to do OK though. I think it would benefit from either a better wifi receiver or antenna because 30 feet away from the router it's getting network errors even though none of the many other pieces of equipment in the house are having that problem. I wish there was a way to search for new channels in the TV but it must be done on the computer through Roku.com. I have mixed feelings as to whether or not I would buy again.", "verified": true, "helpfulness": "0/0", "author": "Sparks601"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "Don Allen"}, {"rating": 2.0, "review": "absolute rubbish if you live outside USA, CANADA, and/or UK. i'm from the Caribbean and i have a netflex account... yet i cant get it on the roku stick. all the channels are s***. DLNA sucks and mirrorcast is in beta, so it doesn't work. i'm better off with my cable or buying a chrome cast. only thing that it can be used for is basically watching youtube.Again... this is useless if you're outside the regions stated!!!!!", "verified": true, "helpfulness": "0/2", "author": "IamDee1"}, {"rating": 5.0, "review": "I like it because it's so portable.", "verified": true, "helpfulness": "0/0", "author": "George E"}, {"rating": 5.0, "review": "Wish I had purchased this for all TVs. You can take it with you when you travel and have your roku in hotels that have WiFi, great product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This version of Roku seems to load really slow compared to others. Idk why?", "verified": true, "helpfulness": "0/0", "author": "drake"}]