[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "1/1", "author": "Chad Hughes"}, {"rating": 5.0, "review": "great..", "verified": true, "helpfulness": "0/0", "author": "Robin A. Gans"}, {"rating": 5.0, "review": "Awesome product. We won a flat screen tv in a raffle at a super bowl party. But it was not a smart tv and we don't use cable or satellite... So to use it, we really need it to be Wi-Fi capable. This solved our problem and exceeded expectations! Now we have Netflix and Amazon on the tv and a bunch of other channels like PBS, news channels, and more. You can even pick up a subscription to watch NBA games. It runs a bit slow, so expect to wait 10 seconds when navigating the menus, especially when you first turn it on each day. But for the price and the ability to get all our programs it's a great product!", "verified": true, "helpfulness": "0/0", "author": "savannah k"}, {"rating": 5.0, "review": "I'm just starting to use this and so far I like it a lot.", "verified": true, "helpfulness": "0/0", "author": "Mary Miller"}, {"rating": 3.0, "review": "I live in the country and so my internet is limited to DSL. This stick had a lot of buffering. I upgraded to the Roku 3 and it seems to be working fine. My son has the stick and lives in town. His works great.", "verified": true, "helpfulness": "1/1", "author": "Cmatchley"}, {"rating": 5.0, "review": "I've installed many of these devices and this met my expectations.  Delivery and packing were superb.", "verified": true, "helpfulness": "0/0", "author": "BuffaloBob \"buffalo bob\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "JWB"}, {"rating": 3.0, "review": "Unable to use unless I order more. Dissapointed", "verified": true, "helpfulness": "1/1", "author": "maxine warlick"}, {"rating": 2.0, "review": "So my Roku completely quit working  20 days after my return window shut :( loved it when it worked!", "verified": true, "helpfulness": "1/1", "author": "tsutter76"}, {"rating": 5.0, "review": "Works better than the regular smart tv programing and has many more options.", "verified": true, "helpfulness": "0/0", "author": "Dafne"}]