[{"rating": 1.0, "review": "Not working", "verified": true, "helpfulness": "0/1", "author": "JA"}, {"rating": 3.0, "review": "Some connectivity issues, the hand control battery only lasted a week.  It takes a long time to run through the startup", "verified": true, "helpfulness": "0/0", "author": "Zombie Steve"}, {"rating": 3.0, "review": "These are good when they work.  Mine connected well but I've had to reset it a number of times and at the moment I have it pulled out completely.  If I had to decide all over again I'd go for a larger model simply because they are more reliable.", "verified": true, "helpfulness": "0/0", "author": "C. Hatton Humphrey"}, {"rating": 1.0, "review": "I was very disappointed with the product. I was looking forward to trying it. But it will not work with two of my TVs. A 22 inch Panasonic about 8 years old and a 40 inch Westinghouse about two years old. Both have HDMI ports but they are inaccessible. The case on both TVs stick out forcing the length of the ROKU into an angle. It won't lay flat. I had to order a male/female HDMI cable. The one I ordered (6ft.) cost an additional  $8.99. There is one that costs much less but it takes forever to arrive and a shorter one for $7.99. This is not a new problem. If you read the questions asked by potential customers you will find that others have had the same problem with ROKU.3 days later. The cable that was unexpectedly required came a day late. I have spent the last hour with Roku support and have been unable to make the Roku stick work. I was disconnected twice. I may have to return the device. Frustrated and disappointed!", "verified": true, "helpfulness": "8/8", "author": "Justin Time"}, {"rating": 4.0, "review": "I bought the Roku stick having had an original Roku for many years, but there were channels that were not supported on the original device and it I heard there was a new Roku interface on the newer devices, so when our original Roku started locking up it was time to upgrade. The Roku stick has a lot of things going for it. It's size and the fact that you can easily take it with you wherever you go and have access to your Netflix and Amazon accounts etc is great for when you book that weekend away in a cabin, or even to take on the road with you from hotel to hotel. The new interface looks nice, and the ability to search across streaming video providers is a nice feature. The device is wireless only, with no Ethernet option (no doubt due to the size), but the radio in the Roku stick is lacking. You'll need to have a good strong wireless signal for the device to work successfully. If you're planning to try to use this device near the edge of the range of your wireless router think again - it almost certainly won't work. Also, the new wireless (rather than IR remote) seems sensitive to interference and will often just fail to respond for a few seconds at a time. It starts working again but it can be annoying. Those minor drawbacks aside, the Roku stick is a well engineered device that is stable and reliable.Pros: Portability, Size, New Interface, Search across video providers (e.g. Netflix, Amazon)Cons: Poor wireless radio reception, Flaky remote", "verified": true, "helpfulness": "0/0", "author": "Andrew M. Foster"}, {"rating": 1.0, "review": "Although easy to set up, the picture clarity did not compare to my older versions of roku, and had problems with the remote, would often stall, would not recommend this product", "verified": false, "helpfulness": "0/0", "author": "dr sunshine"}, {"rating": 5.0, "review": "I have an older Roku on my main TV, but I needed one for my bedroom TV so I bought the stick for it. I have two Vizio Smart TV's that I purchased early last year. However, Amazon Prime does not work on Vizio Smart TV's for some unknown reason. (The Amazon techs informed me of this fact after I purchased both TV's) But it works perfectly with both my Roku's!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Major Mitzi fan!!!\""}, {"rating": 1.0, "review": "Take this off the Market until it works better. It didn;t work with my first TV a Samsung 40\" HDTV. I tried it on a smaller TV and it couldnt pick up the internet signal enough to complete the activation. We have pretty good fast internet and have no problem streaming other items to this room. On the third TV I had low expectations. FInally got it to work but the streaming was choppy and had to constantly re load the queue. After trying to watch a show and reload it constantly I gave up. It's not worth it. Unfortunately this is my first Roku device and it may be my last. I have an Apple TV that is hands down worth the extra $50. We will use our xbox to stream other things for now.", "verified": true, "helpfulness": "0/0", "author": "A. Milton \"Silent Mom\""}, {"rating": 5.0, "review": "Incredibly easy to set up and best roku yet. Getting another for the bedroom set.", "verified": true, "helpfulness": "0/0", "author": "Mercedes Toro"}, {"rating": 4.0, "review": "The Roku 3500R is a product I really wanted,  found inexpensive, and MANY more channels than (say) my Chrome TV.  I almost threw it against the wall and returned it broken (so no one else would have to suffer through it) before I realized it was GROTESQUELY underpowered by the USB port on the TV.  It would random reset, snow between remote pushes,  big lags, forever startups, and got very hot.  The very hot was the final clue.  Since I plugged it into the wall, it is stable and working.  The buffering is infantile compared to Chrome TV or Apple TV, but it is more versatile than either of these devices.", "verified": true, "helpfulness": "36/40", "author": "Robert W. Mc Gwier"}]