[{"rating": 5.0, "review": "I am overjoyed with this Roku Streaming Stick! I have a Samsung Blu Ray Player which is supposed to connect to the internet wirelessly. What a joke! After calling Samsung and literally fighting with the thing for days, I threw in the towel. Actually, I would have liked to have thrown the Samsung! It either couldn't connect to the internet, couldn't connect to Netflix, and when by some miracle it did, constantly stopped after a couple minutes to rebuffer! So annoying and unacceptable. Samsung says it must be the fault of your wireless provider. Well, my iPad and everything else works just fine wirelessly. Shame on them...Anyway, sorry for the rant...I did some research and decided on the Roku Stick. I received it from this seller super fast, yesterday. I Installed the batteries it comes with into the remote, plugged the stick into the HDMI on back of the TV, put the plug in the electrical outlet and Presto!, it found my wifi network immediately. Entered my password, went to my iPad and connected through the site given and was up and streaming in a matter of minutes. No rebuffering, no problems at all! Couldn't have been easier. Get it.", "verified": true, "helpfulness": "5/5", "author": "Blondeonboard"}, {"rating": 5.0, "review": "works good", "verified": true, "helpfulness": "0/0", "author": "Dawn DuRocher"}, {"rating": 4.0, "review": "As advertized", "verified": true, "helpfulness": "0/0", "author": "Theodore Swanson"}, {"rating": 1.0, "review": "Streaming Stick is misrepresented; after installing and finding unit would not do what it's description says, \"Stream\" I called Roku and they said it would not stream live streaming coming into laptop.  Sent back for full refund.", "verified": true, "helpfulness": "1/5", "author": "Richard Noble"}, {"rating": 5.0, "review": "Installed the Roku as soon as it arrived. We were able to get it working immediately with no problems. The picture is better than the one we had with our old streaming device. We have also noticed we do not get any stoppage in shows like we used to. We are enjoying it very much.", "verified": true, "helpfulness": "1/1", "author": "Forrest McQuitty"}, {"rating": 5.0, "review": "Roku is worth the small price.", "verified": true, "helpfulness": "0/0", "author": "Robert W Plummer"}, {"rating": 5.0, "review": "I ordered it for my bedroom. I also have the Roku 3, this does have a little bit of delay by comparison. But it's perfect for the occasional use it gets. If I were to go for daily use I would recommend the extra money for the 3.", "verified": true, "helpfulness": "0/0", "author": "Kendra Brown"}, {"rating": 5.0, "review": "Easy HDMI pop in and set up for my bedroom TV. Great that it's wireless because there's a 20' distance from my router.", "verified": true, "helpfulness": "0/0", "author": "Liam Malone"}, {"rating": 3.0, "review": "This is just ok. I was hoping for something else. It just has static content. With all of the other services available I don't see why you'd need this. I was interested in the History Channel programming and A&E.; It has that. But, I want the ability to see a new program when it comes out. I doubt you get that. I was also interested in more live streaming apps. This was just boring... IMHO. I have a ChromeCast. I can cast Amazon Prime movies via my browser so, I'm just not all that impressed. Sorry about that. I would be impressed if I could 'cast' my computer screen to this as well as the other features. Since I can't, eh...", "verified": true, "helpfulness": "0/0", "author": "Stroke4 \"GP\""}, {"rating": 2.0, "review": "So far so good.  Easy to set up and works well. Quick shipping.Update: 9/6/15  I can no longer get Netflix to work on this Roku.  I own two other Roku 2 streaming players that work exceptionally well.  I do not recommend the Streaming stick.", "verified": true, "helpfulness": "0/0", "author": "JoAnn \"jkv5052\""}]