[{"rating": 5.0, "review": "I love it I can watch it on my time and the program I want to watch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great cable replacement device. Got rid of cable last year and have been using roku's on my tvs.  Totally worth it. The streamer works just like the roku 3 but without the headphones and little box.", "verified": true, "helpfulness": "0/0", "author": "SinCity Sister"}, {"rating": 5.0, "review": "As expected", "verified": true, "helpfulness": "0/0", "author": "Wilfred Dominguez"}, {"rating": 3.0, "review": "Randomly stops responding which is infuriating.  Otherwise it's fine for pulling up Amazon and Youtube.", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 5.0, "review": "No issues and works like a charm.  Easy to move from one tv to another.", "verified": true, "helpfulness": "0/0", "author": "Rolando & Kennie"}, {"rating": 5.0, "review": "didn't need and returned", "verified": true, "helpfulness": "0/1", "author": "Richard H. Frohardt \"Churchbuilder\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Connie Rasmuson"}, {"rating": 4.0, "review": "Excellent. Works well and has a large selection of entertainment. The downside: very poor instructions NO help whatsoever.", "verified": false, "helpfulness": "0/0", "author": "PhillyBilly"}, {"rating": 5.0, "review": "I love the fact I have to no longer have a roku sitting around, fits nicely behind the tv and works well!!", "verified": true, "helpfulness": "0/0", "author": "rich daniels"}, {"rating": 1.0, "review": "I am on a campaign against Roku. Received it as a gift. Still don't know how I will tell my nephew I can't use it. I've owned 4 other devices for streaming and Roku was the first one that I've tried to activate only to find that the device is useless unless you supply a credit card number. I already have accounts for Amazon and Netflix and some free providers. I don't intend now or ever to subscribe to anything else through Roku. BUT they won't let you use the already paid for device until you turn over your personal information. DON'T buy Roku. Go Fire TV Stick. Even if you don't have an Amazon Prime account (consider getting one) the stick will provide many options.", "verified": false, "helpfulness": "9/10", "author": "Uncle Billy \"Bill\""}]