[{"rating": 5.0, "review": "since finding ROKU products, we have eliminated all but basic cable saving over fifty dollars a month. My whole family uses this product daily.", "verified": true, "helpfulness": "0/0", "author": "M. SCALA"}, {"rating": 1.0, "review": "I want to love the Roku streaming stick. When it works, it works well. Unfortunately, it hasn't worked consistently for me since purchasing it last year. It has been continuously plagued with connection issues, and Roku customer support is a huge pain. At this point my streaming stick hasn't been working for several months, and I'm ready to give up on it entirely.For the first few months I had this Roku, it worked fairly well. I primarily used it for Netflix and Amazon Prime. Occasionally it would have problems connecting to the internet or to the remote, but generally if I restarted the device it would come back up just fine. The remote connection was so bad that eventually I just started using the Roku app on my phone as a remote. But then, it stopped connecting to either remote. For no clear reason, it could no longer get on my wifi network. Because it has no option for an ethernet connection, it was pretty much unusable.I spent hours on the phone with Roku customer support, dealing with people who would walk me through each step in a painstakingly slow way, and seemed not to hear/understand me when I told them I had already tried these steps several times. Finally they sent me a new remote. It still didn't work. They sent me a new Roku streaming stick. Nothing. I replaced my internet modem, thinking that my very old modem might be the issue. Now it connects to the modem, but it can't connect to any of my channels, even though it is on my wifi network. I'm so sick of all of these issues, and wish I had just bought the Roku box that can connect via ethernet. I'm trying to convince Roku customer support to let me trade up to that device, but so far it doesn't seem possible.My advice: DO NOT BUY THIS DEVICE. Go with one you can connect via wires. It's just not stable enough without.", "verified": true, "helpfulness": "0/0", "author": "Lila Kitaeff"}, {"rating": 1.0, "review": "If i can give it a 0 stars i would have done it.. I have been trying to set up this thing for 3 hours and when i contact support they close the chat on me ...bad customer service...returning this thing asap...does.not work....too many error codes", "verified": true, "helpfulness": "0/1", "author": "Rita Saoud \"Rita Saoud\""}, {"rating": 1.0, "review": "Doesnt connect well to internet", "verified": true, "helpfulness": "0/2", "author": "chris mcfarlin"}, {"rating": 5.0, "review": "fantastic love this little device can't say enough for me a good buy", "verified": true, "helpfulness": "0/0", "author": "Tito"}, {"rating": 5.0, "review": "This is awesome , a good money saver no more cable bill yay!", "verified": true, "helpfulness": "0/0", "author": "diana"}, {"rating": 5.0, "review": "Great product.  Easy to move between TVs", "verified": true, "helpfulness": "0/0", "author": "Master Ed"}, {"rating": 5.0, "review": "BUY this...this stick works very very well...Im cutting the directv cord in December...so getting ready...over 450 channels so far and plenty more available...more TV than I had with directv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it.  Works extreme lyrics well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I splurged and put Netflix on another TV where I can actually lie down to watch it at the end of a very long day. This was so easy! I had it for at least a month before I set it up, dreading it, but it was so easy, I was laughing at myself for having waited so long. Hard to believe there is so much power in such a small device. For the technically challenged, here's what you do: Plug it into the TV, but know that you also have to plug it into an outlet. I don't think that's super clear when you're looking at it online. Then follow the instructions on your TV.", "verified": false, "helpfulness": "0/0", "author": "toree"}]