[{"rating": 5.0, "review": "I LOVE my Roku stick!  I can take it easily from room to room. I'm considering cancellation of my cable TV and just going Roku.", "verified": true, "helpfulness": "0/0", "author": "Gloria"}, {"rating": 1.0, "review": "Dont buy this thinking u can watch netflix while your at your local park or hotel with free wifi unless u are some computer geek,Not plug and play capable when i went camping at my local county park with wifi, as it doesnt give me option to get past the \" agree to terms\" that most hotels etc make u click before connecting to their network.  All help i found is telling you to get a laptop, close mac addresses, download a program etc.......  Seems like alot of effort especially people who r not that tech savy.  Bought a roku to bring on vaca to watch, but its completely useless unless i turn my laptop into a wifi hotspot", "verified": false, "helpfulness": "2/3", "author": "Lisa"}, {"rating": 5.0, "review": "Okay, I am a fan of the Roku product and when I saw that these had come out I needed it (well not really need but really wanted it).  I travel a lot and this is great for that purpose.  Now I can hole up in my hotel room and avoid team dinners or other social events where co-workers over indulge while traveling.  I can keep up with my programs and watch movies which is far nicer for me since I am not a social person to begin with. I have four roku devices and this little baby is the best mainly because I can just package it up and have it with me for trips.  I love the device!  The price is right too.", "verified": true, "helpfulness": "0/0", "author": "Nickie S"}, {"rating": 5.0, "review": "I love this stick. This device makes it possible to use my tv and stream videos and music without adding another cable box to my already high cable bill. I haven't had any problems with it, and I can use it without having to have a computer running simultaneously, thus reducing the need to extra cables. I would recommend it!", "verified": true, "helpfulness": "0/1", "author": "R. McNamee"}, {"rating": 5.0, "review": "Really, the only complaint I would have is it connects me to many other pay services that I won't purchase, other than that it is awesome!", "verified": true, "helpfulness": "0/0", "author": "michael chapple"}, {"rating": 4.0, "review": "Excellent product!  Easy to set up and use.  The remote comes handy and works perfectly.  I wish it had the possibility for advance settings like dns etc....hopefully in some update.", "verified": true, "helpfulness": "0/0", "author": "Fabio Pizzuto"}, {"rating": 5.0, "review": "This is what the Chromecast should've have been. This packs all of the power of all the Roku players into a small package. Great for turning any tv into a smart tv!", "verified": true, "helpfulness": "0/0", "author": "Philip T. Sparagna"}, {"rating": 5.0, "review": "Glad I got it. Easy set up. Should have went right to my laptop but messed around on my tablet for a while.", "verified": true, "helpfulness": "0/0", "author": "Paul R. Grasemann \"PaulyG1960\""}, {"rating": 5.0, "review": "I have cut the cable!  Paying Comcast to receive hundreds of channels with endless commercials, most of which I never viewed, is now in the pas.  I choose the channels I want to watch and control what I pay.  Many of my favorites are free.  What is even better, I can watch stories for several days and select only those which interest me.  So what if it isn't live coverage?  So little of what is available is really related to 'today' because most so-called news is not news, it's feature pieces.The Roku device is simple to set up and simple to use.  It's great!", "verified": true, "helpfulness": "0/0", "author": "comedy tonight"}, {"rating": 5.0, "review": "I had absolutely no problems with this Roku. I'm using a small TV in the bedroom with no problems with reception.", "verified": true, "helpfulness": "0/0", "author": "Barbara Monroe"}]