[{"rating": 3.0, "review": "I bought this device to use it outside the US.It turns out that if you are not in the US one cannot add some channels such as Netflix and HBOgo even though the service is available locally. This should be stated more clearly. The remote control even has a Netflix button which I cannot use.The streaming is just fine with the chanels that can be added.The size of the device and the things that it can do are amazing though.", "verified": true, "helpfulness": "0/0", "author": "Leon K."}, {"rating": 3.0, "review": "It works but it is very slow compared to my Roku 2. The remote doesn't seem as responsive.", "verified": true, "helpfulness": "0/0", "author": "Vic"}, {"rating": 3.0, "review": "I bought my Streaming Stick for travel. I set it up at home, tested it with both my smartphone and iPad. There's a lot to like. Lots of channel choices, easy to set up, and performance is pretty good once the device starts up.But for my first trip with the SS, I took it to California, leaving the remote at home. I thought I could just use the mobile Apps to control the SS. Well, after waiting on the phone for over 1/2 hour for someone at Roku Tech Support, I was told the SS needs the remote to change to a different network. So the SS turned out to be a worthless piece of luggage.I realize this \"feature\" is probably to ensure security, but surely there's a way to establish security without needing the remote. For example, connect the SS to a laptop's USB port and have software tell it the name and passphrase of the new network. Or, have the firmware save the credentials of a second, backup network, such as the hotspot associated with a smart phone. Then when traveling use this network to bootstrap into the main one on the road, such as a hotel's network. Or, do as Chromecast does, have the SS create its own temporary network, log into it with your mobile device, give it the information about the main network, and let it switch networks.At the very least, this \"feature\" should be documented in big red capital letters. The documentation doesn't mention it.My Chromecast never required me to lug a remote along for traveling.", "verified": false, "helpfulness": "0/0", "author": "Marshman"}, {"rating": 1.0, "review": "Waste of money!!!", "verified": true, "helpfulness": "1/1", "author": "JUANITA STRICKLAND"}, {"rating": 3.0, "review": "It is what we expected.", "verified": true, "helpfulness": "0/0", "author": "Allison Orlowski"}, {"rating": 3.0, "review": "It seemedIke a good device if I wasn't looking to watch SHO.", "verified": true, "helpfulness": "0/0", "author": "T. B. \"Terry\""}, {"rating": 4.0, "review": "It's very good although I had a hard time setting it up as I am not very technically adept.  It was very helpful that Netflix has a number you can call for help.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Jacobs Furey"}, {"rating": 2.0, "review": "I returned it as I didn't like it. I like Chromecast better.", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "Item came as described, and shipping was fast. Very satisfied with the purchase.", "verified": true, "helpfulness": "0/0", "author": "B. Bolding"}, {"rating": 5.0, "review": "I love it! Now I don't need to pay for a cable connection that I hardly ever us. I watch what I want, and it saved me a lot on my budget.I only need my internet and I already have it.", "verified": true, "helpfulness": "0/0", "author": "Joan"}]