[{"rating": 5.0, "review": "Really enjoying this so far. Easy to set up, lots of channels. I recommend it, especially if you have a lot of time to watch television.", "verified": true, "helpfulness": "0/0", "author": "Richard Landis \"Earthling\""}, {"rating": 5.0, "review": "Our house has cable internet($45/month), but no cable TV.  It is quite amazing this little device is as powerful as it is.  It streams better than any other streaming device we have in the house.1. the remote is very easy to use.2. conceals nicely behind the wall-mounted LED TV.3. there are so many other private channels other than the thousand-plus supported.4. great travel companion.5. Plugs directly onto the HDMI port. To power the device, unless there's a power-over-HDMI feature I'm unaware of, still has to be powered via the included  USB power supply, (which the promo pics leave out. Hmm). Some TVs have a USB port with enough power on-board, so that might be a plus. I have an outlet behind my TV so there aren't any wires hanging down from my TV ;)", "verified": true, "helpfulness": "0/0", "author": "C. Bauer \"Satcom39\""}, {"rating": 1.0, "review": "Unbelievably poor performance. When pressing a button on the remote, there is a pretty long lag between the time you press and the time the device actually updates. I own other Roku devices, and cannot believe how poorly this device performs. I'm fairly certain I will be returning it.Where this device may be nice, is if you are on the go and would like the ability to stream movies from a location other than your home. It is small, much like a Flash Drive, and besides the stick itself there is also a small power supply to plug in to a wall socket. Both can easily fit in a jacket pocket, or a small bag.", "verified": true, "helpfulness": "6/7", "author": "Alan W."}, {"rating": 3.0, "review": "I purchased this because of the price point and product reputation. This is the first streaming device I've purchased. It is easy to configure and use.for a one time price is not bad, but since I'm not really use to using streaming tv, it's not as complete as cable.", "verified": true, "helpfulness": "0/0", "author": "Pafreer"}, {"rating": 5.0, "review": "We use Netflix and Plex on a daily basis.  It was causing us to use Chromecast, or multiple other media streamers.This device does both, and has a small wireless remote.  Easy to use, thousands of channels and no extra cables coming out of the back of the tv.Would highly recommend to anyone looking for streaming media system.", "verified": true, "helpfulness": "0/0", "author": "AaronOx"}, {"rating": 1.0, "review": "Bought this new device for streaming movies and TV serials.  While it was easy to install, I could never get it to stop buffering -- even for short 2 minute news videos.  While the support team was reachable, they never offered any advice that worked to fix the problem.  My own feeling is that the problem is caused from running it through WiFi - seems like that means it is limited by the slower speeds of a WiFi connection.  Ended up returning it.", "verified": true, "helpfulness": "4/6", "author": "G. Targee"}, {"rating": 3.0, "review": "I bought this Roku to replace my overpriced cable system.  It's not what I fully expected, but it's better than my $120.00 cable bill.  My first disappointment was the 2.5 hours I spent with tech support trying to get the device to work on my WPA secured network.  The tech support was outstanding though!  Second, is the lack of free streaming video content from major providers (History/A&E;/Discovery, etc.)  I guess I'll just have to be satisfied watching older episodes!  I can still stream some content from my computer which I have hooked up to my TV.  Finally, I have a DVD/VCR combo that I wanted to hook up and be able to record to DVD.  The problem is, that the content ran through my cable box which is now gone.  To solve this problem, I've purchased a 2 way HDMI spliiter, A double female adapter and a HDMI to RCA cable.  This way I should be able not only to watch Roku through the TV, but should also be able to record content from it on the VCR/DVD.", "verified": true, "helpfulness": "0/0", "author": "Gary Smart"}, {"rating": 5.0, "review": "This is my second Roku, my first streaming stick, and I love it.  It's pretty much plug and play, set up your accounts (Amazon, Hulu, Netflix, etc.) on your computer and go.  I've been streaming content through my DVD player on my last TV, but this is so good, I may splurge and put a stick on there, too.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Jenny Crusie Smith"}, {"rating": 5.0, "review": "As a Chromecast owner, I was excited by its potential... but disappointed by the lack of apps and developer supprt. Fortunately,  this Roku stick offers everything I need - plus a remote to boot. To me, it's a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Hopdevil"}, {"rating": 4.0, "review": "Needed something to stream Netflix and hulu through a different tv and this is perfect. My only complaint is that it can sometimes freeze up on you once in a while. Other than that I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "smaldon"}]