[{"rating": 5.0, "review": "I love this. We have three and have no problems with it.", "verified": true, "helpfulness": "0/0", "author": "Cherie"}, {"rating": 4.0, "review": "So easy. I'm a multi roku owner, the only thing I notice is that it's a bit slower than say a roku 3, but so easy to be mobile, well worth a buy.", "verified": true, "helpfulness": "0/0", "author": "Christopher Glidden"}, {"rating": 1.0, "review": "The remote constantly stops working for some reason.  I have to shut down my whole entertainment system then reboot it to get the Roku remote to work.  I would never recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Mark"}, {"rating": 5.0, "review": "Love my Roku's ... Have on all 3 TVs... No more cable 😀", "verified": true, "helpfulness": "0/0", "author": "Barb in MO"}, {"rating": 5.0, "review": "Switching to Roku stick from cable is a transition like anything else, when you are trying something outside of the box and breaking away from common chains.  Our cable bill was $144 a month for only a handful of channels that we actually watch.  We are already members of the WWE Network and we use my sister's Netflix account (which means it's free for us).  The only thing I signed up for was Hulu Plus and Sling TV (for our occasional live tv cravings).  All together our cable bill went from $144 down to $50 a month (for internet), with WWE Network($9.99), Hulu Plus ($7.99) and Sling TV ($20) our total comes to a little over $87 a month.  Keep in mind that $144 is a promotional rate for the first 6 months, after it goes to about $195.  First let me say, that this has not placed any bump in our entertainment lives at all.  You have to find what you're into and it will be there.  My daughter watches the Simpsons, and now she can watch any episode on Hulu. Our baby watches Disney Jr and PBS Kids, Sling TV has Disney Jr live tv and there is also a Disney Jr app, where you can watch all the Disney Jr shows.  PBS Kids lets her watch Sid the Science kid, Caillou, and Thomas the Tank Engine.  There is no buffering or lag in the programming and it is very easy to maneuver yourself around.  There are hundreds of apps that can bring your entertainment to a whole new level.  As a movie head, my options (and cost) have not increased any.  I watch maybe two or 3 movies a month. Again with cable, it was a waste of money but now I have Vudu or Google Play which gives me an a la carte option of watching whatever movies I want for a few dollars (usually $2 or $3) per movie.  Being one floor above from where my WiFi router is has not impeded on the speed.  I am also not restricted by cable outlets ... if there is an electric outlet, I can plug it in.  My only issue is that the remote resets itself when you don't use it after a few hours.  All in all, it's an exceptional decision and this purchase will pay itself in the first month you go without a cable bill.  We actually got it free since we applied for the Amazon Credit Card and got a $70 instant gift card ... then I cancelled it once the item shipped (WIN for me! LOL).  I think the product speaks for itself as far as quality, based off of everyone's review of it.  It was a major contributor to the decision of getting a Roku Stick for our bedroom and not Chromecast or Firestick.  Roku stick gives you more bang for your buck.", "verified": true, "helpfulness": "0/0", "author": "Molecule Inc"}, {"rating": 2.0, "review": "Couldn't get it to work after the first use! On the hotline with customer support - no help after 2 hours. Returned. Looked like, if it worked, it would have been great.", "verified": true, "helpfulness": "0/0", "author": "Belle Voce \"I'd rather be singing\""}, {"rating": 5.0, "review": "Great item with great packaging", "verified": true, "helpfulness": "0/0", "author": "billhuds"}, {"rating": 1.0, "review": "I got this Stick mostly to watch CBS All Access which currently only can be accessed on a TV via Roku.  We got a subscription to All Access.  The free CBSN seems to work fine.  However, we cannot watch the \"taped\" CBS Nightly news as every couple of mins the stream has to re-buffer.  Worse, about ever 2nd or 3rd time the Roku tries to re-buffer it crashes and we have to watch the ROKU logo reset and start over. I think the memory on the Stick might be just too small for many purposes.  We have Charter Internet Service giving us 60 Mbps up and 4 Mbps up.Update 7 Aug 15:  After 4-5 weeks of terrible drops in connectivity between the remote and the device (the connectivity between the device and the router is great), I chatted with Roku support. That was a really terrible experience; he was in complete denial.  I wish I could just keep using my Fire Stick and my Chromecast stick, but CBS Access and Showtime Now are only on my Roku.", "verified": true, "helpfulness": "1/2", "author": "L. Ingber \"ingber DOT com\""}, {"rating": 1.0, "review": "Horrible battery life for remote. I own 6 ROKUs and love them all. This was my first purchase of the stick drive version. It works as well as all the other versions for general service (I have 1 of each generation), but the remote too easily loses pairing with the unit - requiring removal of batteries and reinstalling to  get it \"recognized\". The remote also devours batteries at the rate of new ones needed every 72 hours - needing fresh batteries multiple times/week.  I use this ROKU for about 4 hours per night and remote completely dies after 3 days (during which I had pulled and re installed the batteries about 8 times).", "verified": true, "helpfulness": "0/1", "author": "Chelliott"}, {"rating": 5.0, "review": "I love it!!!!", "verified": true, "helpfulness": "1/3", "author": "Ebony Hamilton"}]