[{"rating": 5.0, "review": "We already have two Roku boxes, and when we needed a third for a new tv, the stick seemed like the best decision for the space.I love that the stick is completely hidden behind the TV. Unfortunately, our TV doesn't have a USB plug to charge the stick, so we do have to use the in-box charging cord, but it's pretty much hidden away behind the screen.One of our original model Roku boxes doesn't support auto-starting the next episode in a series when we're watching something on Netflix or Hulu, but the stick does.We would definitely purchase another Roku Stick before we purchased another Roku box.", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Derek Anderson"}, {"rating": 5.0, "review": "This is just great. So much to see on Roku. I can live without the \"dish\" and save a dollar.", "verified": true, "helpfulness": "0/0", "author": "Barrie"}, {"rating": 5.0, "review": "Very cool item to have with your HDTV. This little streaming stick does what the larger Ruku base units does. Works great!", "verified": true, "helpfulness": "0/0", "author": "Merlin \"Triwizard Team\""}, {"rating": 5.0, "review": "i  can view everything through my roku stick except you tube.  this is very convient.", "verified": true, "helpfulness": "0/0", "author": "Lonnie Hudson"}, {"rating": 5.0, "review": "Works as promised.", "verified": true, "helpfulness": "0/0", "author": "Olderthanus"}, {"rating": 3.0, "review": "I purchased this to compare our Amazon Fire TV which is in another room and there simply is no comparison. The Roku is okay but it pales in comparison to the Fire TV. It is extremely slow and the navigation is not as easy. I'll be returning this and purchasing an Amazon Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Denise Moore"}, {"rating": 5.0, "review": "Great product for under $40. It works just as good as my more expensive Roku 2. It is very portable.", "verified": true, "helpfulness": "0/0", "author": "R. G. Shiflett \"shiflerg\""}, {"rating": 5.0, "review": "I purchased this product for a Father's Day Present and it was loved by all!Easy to set-up, easy to use, couldn't have asked for a better price as well!", "verified": false, "helpfulness": "0/0", "author": "Megan Caruso"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Jesus Salazar"}]