[{"rating": 4.0, "review": "Works as advertised.  I hope they keep adding channels.", "verified": true, "helpfulness": "1/1", "author": "Kevin M."}, {"rating": 5.0, "review": "Thanks!", "verified": true, "helpfulness": "0/0", "author": "Wayne Thompson"}, {"rating": 5.0, "review": "I have an older modem and only 1.5 Mbps internet speed and it works flawlessly  In fact, the streaming is better than on my tablet. My TV isn't the latest and greatest either but it does have an HDMI port.  It was easy to set up and I like having a remote.  I didn't need an HDMI extender because the port is in the back.  There's only one small cord to plug the usb into the wall but it's not noticeable at all.  This is one of the best purchases I've ever made.  You won't be sorry.", "verified": false, "helpfulness": "0/0", "author": "DR"}, {"rating": 5.0, "review": "I purchased this for only one reason, to watch the WWE network without having to drag my computer into the living room and set it up. Came with easy to follow instructions so I was up and running in no time. It works as advertised and I am very happy with it.I really like that you can go online on your laptop and look up different channels that are available and can add them to your roku right from the computer and they will be ready for you when you use the Roku again.  While there are a lot of channels, most of them are either rather spendy for my tastes or have some really old or other wise weird content but that is actually a fun aspect of trying out new channels. I have found some great cult channels that have those so bad they are good horror movies..Would recommend to anyone, very good product so far", "verified": true, "helpfulness": "0/0", "author": "Rodger Williams"}, {"rating": 5.0, "review": "We have 4 other Roku units but this one is the best.  Plugged it into my big screen TV HDMI port and bingo I have Netflix or whatever channel I need.  This is a wonderful travelling companion but don't forget to bring the remote or at least an iphone to control the device.", "verified": true, "helpfulness": "1/1", "author": "P. Miller"}, {"rating": 1.0, "review": "I can not currently add the channel Ruku Netflix does not have it for my country, while other systems if they do, I recommend that if you live in Dominican Republic do not buy it . Chromecast is much better and gives you access to netflix from my country.", "verified": true, "helpfulness": "0/0", "author": "Jose Miguel"}, {"rating": 1.0, "review": "very slow...get the Roku 3 instead.", "verified": true, "helpfulness": "0/0", "author": "Luis Rivas"}, {"rating": 5.0, "review": "Works flawlessly and after a month seems perfect for our viewing habits. Best to research your shows for streaming options before purchasing but even after paying a couple bucks per episode for a few first run shows my net savings is more than 50% versus cable. There are a few sacrifices to be made...not everything on cable is available and you might have to wait a day to watch something, but still easily worth it. An added bonus has been the PLEX channel which allows me to use a separate dedicated device (laptop/tablet) as a media server for content I already owned but was unable to watch on a TV without significant hassle.", "verified": true, "helpfulness": "0/0", "author": "Brian Andersen"}, {"rating": 4.0, "review": "I like this product for the simple reason it dosen't run through your computer.Although it does offer many channels and movies sites there's alot of them you must to have a subscription to use.It is easy to use and easy to set up.I wish you could get regular hulu on it.", "verified": true, "helpfulness": "1/1", "author": "Gotu11 \"AH\""}, {"rating": 5.0, "review": "Love it lots of choices and easy to install", "verified": true, "helpfulness": "0/0", "author": "Camaro"}]