[{"rating": 1.0, "review": "Remote works whenever it feels like it.  Have tried everything I could find on Google search to fix it.  Would return but return period is over.  I made mistake of telling my daughter to buy one thinking it was just my bad luck.  WRONG.  Hers is doing  same thing.", "verified": true, "helpfulness": "0/0", "author": "danny baker"}, {"rating": 5.0, "review": "Already had a Roku 3 but wanted to have access to Roku on another TV.  This fit the bill and was easy to set up on my Roku account.", "verified": true, "helpfulness": "0/0", "author": "Paul Beard"}, {"rating": 4.0, "review": "Fast delivery and the product looks and works great!", "verified": true, "helpfulness": "0/0", "author": "Brett"}, {"rating": 5.0, "review": "i like", "verified": true, "helpfulness": "0/0", "author": "Fabian Aguilar"}, {"rating": 5.0, "review": "This is the third ROKU we have bought. .I got this one to replace a Panasonic USB WiFi Lan adapter on a Panasonic 55\" Plasma. The Panasonic adapter was OK, but you had to jump through too many hoops to get to the \"smart\" programming, sometime having trouble connecting to the WiFi network. With the ROKU Stick, I just change input on TV, and there is ROKU ready to go. No problem connecting, or holding WiFi signal. I also used the USB port on TV for power. (be sure and check USB port voltage and amps, meters sold on Amazon). Some USB ports will not support this item. But, the USB converter is included.We also have a ROKU Angry Birds. We have had it for about 3 years, with no problems.My other ROKU is built into a 40\" TCL TV, also sold on Amazon, ( http://www.amazon.com/gp/product/B00K7NCS9G/ref=oh_aui_search_detailpage?ie=UTF8&psc;=1 ). Just check out the reviews. This was bought for my shop/mancave. Perfect size, and at 22lbs. it fit on my articulating mount put up for a smaller TV.", "verified": true, "helpfulness": "0/0", "author": "R. Jones \"Retired&LovingIT;\""}, {"rating": 5.0, "review": "like it; it is the best solution for streaming media so far. there are more and more channels available every day. and big plus of this one - youtube channel.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We are happy with this item.", "verified": true, "helpfulness": "0/0", "author": "Ida bailey"}, {"rating": 5.0, "review": "Not much to add to other positive reviews. Nice little stick vs. more clunky equipment around the wall-mounted TV. Setup was a breeze. We've been using this streaming stick for a couple months and it's worked consistently. No need to reprogram anything after power outages. My 8 year old daughter can navigate through the menus to find what she wants to watch.", "verified": true, "helpfulness": "0/0", "author": "Nepenthe \"Mother of two daughters and three dogs\""}, {"rating": 2.0, "review": "I bought this so that I could upgrade my TV and get Netflix.  What ROKU does not tell you is that even though Netflix offers service and subscriptions in Central America.  (I have a subscription.) that ROKU does not recognize Netflix out of the USA.  Total waste of money, international shipping and custom duties for nothing.", "verified": true, "helpfulness": "1/1", "author": "djclayt"}, {"rating": 2.0, "review": "My roku just work one month  and 10 days, now is preseting problems on the remote control, not possible refund.", "verified": true, "helpfulness": "0/0", "author": "claudia almeida"}]