[{"rating": 5.0, "review": "Just started using and this thing works great, if you don't have a smart TV then this is the way to go.  Picture quality through Netflix and Amazon is excellent.  Download the app for your phone or tablet this makes searching much easier due to having a full keyboard.  We'll worth the fifty bucks I paid for it!", "verified": true, "helpfulness": "0/0", "author": "Ranger05"}, {"rating": 5.0, "review": "Greatest item I ever purchased", "verified": false, "helpfulness": "0/0", "author": "Linda T. Mickel"}, {"rating": 1.0, "review": "This review is for the \"Certified Refurbished\" Roku stick.The remote did not work correctly, the remote would sync, then forget the sync after it was restarted.Be aware Certified Refurbished means that it was inspected and nothing looked broken, then repackaged and sole to me without any Refurbishing. This is not unique to just this product. The time and effort required to check it out and fix it would exceed the value.", "verified": true, "helpfulness": "0/2", "author": "James B Fox"}, {"rating": 5.0, "review": "This device works great!  My Blu-Ray player had a Netflix function that didn't work anywhere near as well as my new Roku.  The picture and streaming quality are fantastic and I expect to get another for my other TV very soon.  And it didn't even cost me much money.", "verified": true, "helpfulness": "0/0", "author": "Tom Kelly \"film fan\""}, {"rating": 5.0, "review": "This little device works as advertised.  The great thing about it is that it is easily hidden.  I use it connected to a receiver rather than the TV itself.  Only down side is it gets HOT, so make sure it gets plenty of air and nothing combustible near it.  This little thing replaces a mini desktop computer I was using for the same purpose, nice to get that out of the entertainment center.", "verified": true, "helpfulness": "0/0", "author": "jb3amz"}, {"rating": 5.0, "review": "Excellent - good price - quick delivery - love it.", "verified": true, "helpfulness": "0/0", "author": "M. Wagner"}, {"rating": 5.0, "review": "Only took my husband a few minutes to install and we have enjoyed movies and shows shows on the 'big' screen ever since!", "verified": true, "helpfulness": "0/0", "author": "M. Berry \"Berryjam\""}, {"rating": 1.0, "review": "It does not hold a wifi signal and can never connect to Netflix.  When it does, it freezes.  If I could give it zero stars I would. Save your money.", "verified": true, "helpfulness": "0/0", "author": "Jeannie"}, {"rating": 3.0, "review": "I bought it for my in laws, set it up, (had to be plugged into an outlet for their flat screen TV).  They recently moved out and I brought it home and used it. Had to plug it in an outlet an I've had to reset it a couple of times and have only used it 6 or 7 times on that TV. The remote doesn't consistently work, although the batteries are still new. I thought the stick would be less wires to temp our toddler. Still have the power cord to deal with...", "verified": true, "helpfulness": "0/0", "author": "Ricklg83"}, {"rating": 4.0, "review": "If you like turning on your TV and immediately watching something, it might be worth it to use the wall power option, rather than power this device from a USB port on your TV.  If you use USB power, it takes a minute or two to boot up every time you turn on your TV.  Other than that, it works fine.  We still like the traditional Roku boxes a little better.", "verified": true, "helpfulness": "0/0", "author": "chase.k"}]