[{"rating": 5.0, "review": "Great Product!", "verified": true, "helpfulness": "0/0", "author": "pablo"}, {"rating": 2.0, "review": "My experience with Roku over the years has been outstanding.  This particular refurbished streaming stick was an exception.  Although it set up OK, the remote would continually lose its pairing with the stick and I'd have to reset the whole thing to correct it.  After it happened several times, I returned the device.", "verified": true, "helpfulness": "1/1", "author": "mikestuff"}, {"rating": 5.0, "review": "Wow! I am very pleased with my Roku. Easy to connect on set up.  It is fast to respond, and the home site offers some great deals. Much better than cable or satellite offers, and no long term contracts. I was concerned at first with the \"always on\" feature, but found it is great. Uses no more electric than a night light bulb. I struggled with a different system for a long time, slow response time, if at all. Not with Roku. I've bought additional one for another TV. Good selection to fit your needs, especially if you have older model TV's, or the latest models of Roku for newer systems.", "verified": true, "helpfulness": "0/0", "author": "Nancy Hamrick"}, {"rating": 4.0, "review": "The Roku stick is easy to use and for the most past I really like it and it makes watching movies and shows on your TV a lot easier. Most of the time it works fine but occasionally the remote will stop working and you won't be able to click anything and you have to unplug it from the wall, take the batteries out of the remote and put them back in, and hold the purple button on the remote to get it to work which is kind of annoying when you're going to bed and just want to watch an episode of your show. Generally the Roku stick works fine and you don't have to do this and I would still say it was worth the price because it is much easier than connecting your laptop with an HDMI every time and having to use your trackpad every time to click on a different show.", "verified": true, "helpfulness": "0/0", "author": "Gigi"}, {"rating": 4.0, "review": "I am the owner of a Roku box which i purchased back in 2008. It has always worked very good for me and i now have it on a second TV in the  bedroom, i recently began enjoying content on Crackle which i could not get to play for me on the Smart..samsung blueray player. I was easy to hook up and plays very well so far, on the Crackle App, i am confident it will play all of the streaming content till my hearts content at $40..I have spent more on dinner, i am giving it a 4 directions don't include how to set it up to play from your stereo reciever, but it's very simple and i am glad i made the purchase.", "verified": false, "helpfulness": "0/0", "author": "A. Lowery \"my2cents\""}, {"rating": 5.0, "review": "Super easy to use! You plug it into your TV and turn the channel to the correct setting and it works. This has soo many channels to choose from.", "verified": true, "helpfulness": "0/0", "author": "Aduer"}, {"rating": 5.0, "review": "Love it! Setup is easy and fast. Love the small design that plugs directly into the back of the TV to eliminate any use of wires. We have the older version Roku that connects with a HDMI cord and we are very pleased with this product.", "verified": true, "helpfulness": "0/0", "author": "CHRISTINA CLEMONS"}, {"rating": 5.0, "review": "I don't know how I got along without it.  I also subscribed to Acorn and can now watch all my favorite British mysteries on demand.  Hardly ever watch my cable now except for the news.", "verified": true, "helpfulness": "0/0", "author": "Avid reader"}, {"rating": 5.0, "review": "I was not convinced that I needed this stresming stick.  I was absototally WRONG!  In just a few months I have come to depend on my Roku to be the first place to go for serious entertainment.  I am residing in a rehab facility and the satellite they have is limited with almost no sports.  Ugh, I got this and I was saved.  I even bought a better TV.  This was a delightful surprise.  It will expand your world", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "Produces a great picture and a very easy interface to use.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}]