[{"rating": 5.0, "review": "I totally love this things!Five stars from me, and I now order them as gifts for friends and family.", "verified": true, "helpfulness": "0/0", "author": "Michael K. Jones"}, {"rating": 5.0, "review": "I thought this was just a streaming device that you had to use your phone to watch Netflix and such, but it is built in like a regular Roku. I guess I did not read the full description. But, the only difference between the streaming stick and the Roku 3 is:-The processor on the 3 is 5x faster. Which I don't even know why this matters at all, maybe for using the thing Roku as a gaming device. But who does that-The roku 3 has a headphone jack in the controller, which could be useful if you have a spouse or kids, but I don't.-The roku 3 remote is a motion controller like a wii. If you want to play a game with a vii style remote, get a wii.", "verified": true, "helpfulness": "0/0", "author": "Ryan Hancock"}, {"rating": 4.0, "review": "Difficult to use remote in regards to searching using onscreen keyboard. I would recomend using the app. Stick works great though! Good buy happy with purchace.", "verified": true, "helpfulness": "0/0", "author": "jacob"}, {"rating": 1.0, "review": "I have Xfinity-Comcast cable internet and a Cisco router.  After spending over an hour with ROKU tech support rebooting, opening secret pages, and getting nowhere--they promised to call me back the next day with a fix.  They didn't.I chatted on line with ROKU support on the third day, and we spent another hour or more playing with my modem's DNS settings.  After that got us nowhere, I was told to call Comcast.  Many of you know where that can lead.I got the streaming stick because my Chromecast does not have a remote.  However, Chromecast worked out of the box with my internet connection, so three stars for Chromecast and one for Roku's stick.", "verified": true, "helpfulness": "0/3", "author": "Fizz"}, {"rating": 5.0, "review": "I was concerned about buying this new roku, i read reviews and were not so good. I received it yesterday and works exactly like roku 3really fast and has a plus! the remote control quick netflix and amazon prime access! I recommend this product, almost 50% less expensive that roku3.", "verified": true, "helpfulness": "0/0", "author": "ALEXA"}, {"rating": 2.0, "review": "Piece of crap waste of money according to roku you can use this anywhere weather on vacation or business trip if you in another country too bad for you no netflix no us channels the Google Chrome cast is a better product by far that works anywhere in the world netflix and all the us channels instantly would not recommend roku for people who travel outside the us", "verified": true, "helpfulness": "0/0", "author": "deryck"}, {"rating": 5.0, "review": "Love this gadget.  Loaded the Roku remote to my iPhone (easier to search with keyboard on most channels).  This little stick fits all my needs.  I even dumped cable @ over $100/month.  Great decision.  I have had no issues.  Just plug in set up and start watching!  Roku should send me a commission as many people I know have purchased this on my recommendation.  Very easy to move between tvs.", "verified": true, "helpfulness": "0/0", "author": "Brigid Ketner"}, {"rating": 3.0, "review": "Overall the stick is ok.  But Having the Roku 3 has spoiled me.  The stick is very sluggish.  Sometimes I have to repeatedly hit a button before anything happens.  But with the Roku 3, Its always very responsive.  Love the headset jack and usb port.  Just wish the usb port supported more video file formats.", "verified": true, "helpfulness": "0/0", "author": "Skip Wetzel"}, {"rating": 1.0, "review": "Watch out Roku is 40% owned by sky and don't allow any competitors in the uk to broadcast through it including amazon instant", "verified": true, "helpfulness": "0/2", "author": "Andrew Rhodes"}, {"rating": 5.0, "review": "Each time I use this device I love it more! It's not lightning fast when navigating through the menus and loading apps but it definitely exceeds the needs when playing stuff! The connectivity is pretty good (specially since it's dual band) and the remote feels perfect on your hands. Great selection of apps, no complains at all. You definitely get more than what you pay for.", "verified": true, "helpfulness": "0/0", "author": "David A."}]