[{"rating": 5.0, "review": "awesome, no wires", "verified": true, "helpfulness": "0/0", "author": "bill"}, {"rating": 3.0, "review": "I cannot give an advised opinion on this product. I could not get it to connect using Comcast/Xfinity gateway (Modem/Router). Three attempts to communicate with Roku were frustrating in that tech support folks were not articulate enough in English to communicate with effectively. One rep passed me off to another supposedly more skillful in English, but still unable to communicate. Ultimately I was passed off to a third who offered to take control of my computer remotely in order to solve the connection problem. That rep suggested that I had too many connections on the computer already. - I then scoured the net looking for helpful forums and youtube comments and self-help videos to continue my attempt to connect. - All these efforts were in vain so, assuming that the \"refurbishment\" of the product was the problem I returned the item to Amazon. I ordered the more expensive and new, not refurbished Roku 3 even though the tech support difficulties were still a major concern. Upon receipt of the new unit, I discovered the same problem. I concluded that the Comcast gateway was the real problem. I dug out an old Belkin router that I had and bridged it to the Comcast Gateway and was gratified by establishing a connection right away.", "verified": true, "helpfulness": "3/4", "author": "Donald Duane Newburn"}, {"rating": 5.0, "review": "Extremely great product!", "verified": true, "helpfulness": "0/0", "author": "Gregory Childress"}, {"rating": 5.0, "review": "this is the second one we bought for the house we love them.", "verified": true, "helpfulness": "0/0", "author": "Denise Harker"}, {"rating": 1.0, "review": "I bought two, one of them has manufacturing defect is not new, I very angry, the screen looks purple", "verified": true, "helpfulness": "5/5", "author": "José Gerardo Rodríguez Ochoa"}, {"rating": 5.0, "review": "works as expected no problem", "verified": true, "helpfulness": "0/0", "author": "climber"}, {"rating": 5.0, "review": "Great Amazon Seller. Excellent product.", "verified": true, "helpfulness": "0/0", "author": "LLOYD JR."}, {"rating": 5.0, "review": "I am very happy with the Roku.  Note that you do need a \"smart\" TV in order to use it. Between my streaming Netflix account and Amazon prime movies, I can watch any movie right on my TV immediately with it.", "verified": true, "helpfulness": "0/0", "author": "Kat Cotter"}, {"rating": 4.0, "review": "good item,well good no complain.thanks", "verified": true, "helpfulness": "0/0", "author": "peter cuellar"}, {"rating": 5.0, "review": "bought one to try. now own four.  probably easiest out of all of the products like it to use.", "verified": true, "helpfulness": "0/0", "author": "jel"}]