[{"rating": 4.0, "review": "Works great....", "verified": false, "helpfulness": "0/0", "author": "Gil M. Meyer"}, {"rating": 5.0, "review": "I cut the cord a few months ago and have been using one of these in the bedroom and living room. Between Netflix and Amazon Prime, I don't miss paying over $60 a month for TV that I didn't watch very often anyway. Excellent quality. Highly recommended to friends.", "verified": true, "helpfulness": "0/0", "author": "G. Widener"}, {"rating": 5.0, "review": "Great support", "verified": true, "helpfulness": "0/0", "author": "Peter Gianna"}, {"rating": 5.0, "review": "Very easy setup, have lots of rokus in my house. Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Sean McKinney"}, {"rating": 5.0, "review": "Works lovely.", "verified": true, "helpfulness": "0/0", "author": "Patrick Forbes"}, {"rating": 2.0, "review": "The stick's remote won't stay connected and when it does connect it has a terrible, borderline-unusable delay. Netflix keeps losing my credentials between reboots. Spend the extra $50 for a Roku 3 and avoid this garbage.", "verified": true, "helpfulness": "0/0", "author": "Ryan Brignoni"}, {"rating": 1.0, "review": "Sorry - really can't recommend this item... Tried to install and it got into a loop of rebooting itself.After half an hour on the line with Tech Support, they gave me a convoluted set of instructions to reconfigure my router!!!!What the hell... Decided to reconfigure my router as per their instructions.After all that, the Roku playre still doesn't work.All it does is get in a loop of updating/rebooting/etc.Back it goes to the store tomorrow ... Will try a different brand.Thanks for trying Roku, But you probably should have released this as a beta... definitely nowhere near ready for production yet!", "verified": false, "helpfulness": "0/0", "author": "Janet Sullivan"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Beverly"}, {"rating": 5.0, "review": "Not the best at what it does but the best in a tiny package.", "verified": true, "helpfulness": "0/0", "author": "Nick Vaidya, MBA, MS, PhD Psychometrics Candidacy"}, {"rating": 5.0, "review": "Love the Roku.  Wish there were more regular TV channels though.", "verified": true, "helpfulness": "0/0", "author": "Deeny WV"}]