[{"rating": 5.0, "review": "Instead of buying a smart tv which is considerably higher in price, we bought this streaming stick.  It works great and saved us a lot of money over the cost of the smart tv!  We are using it for Netflix but there are many, many other channels available.  Nothing bad to say about it.  Easy setup, easy connectibility.  I like that you have the option to plug it into the hdmi and usb on the tv rather than  the hdmi and outlet (which you can too).  Nice product for a reasonable price.", "verified": true, "helpfulness": "1/1", "author": "D.A."}, {"rating": 5.0, "review": "Works as advertised, turns your \"dumb\" TV into a smart one. Using this we get Netflix and Hulu and have eliminated cable TV from our Lives. Easy to install and set up I had it going 5 minutes after the guy in the brown truck left.", "verified": true, "helpfulness": "1/1", "author": "K. Carter"}, {"rating": 5.0, "review": "Very happy with the stick.  Works very well as to date.", "verified": true, "helpfulness": "0/0", "author": "Thelma Liggens"}, {"rating": 5.0, "review": "Works great. Plugged it in to TV. Voila. (Ps I love Amazon, Amazon's customer service and Amazon Prime)", "verified": true, "helpfulness": "0/0", "author": "Marianne Houle \"MARI\""}, {"rating": 4.0, "review": "Only real problem I have with it is it doesn't play the credits to the end & sometimes there are extra scenes in the credits or after the credits & instead of having them full screen you have a postage stamp type thing in the upper left corner & a line up of 3 watch next recommendations. The recommendations are at least moderately useful but I'd rather be able to see the full credits first.", "verified": true, "helpfulness": "0/0", "author": "Diane Peter \"Rabid Bookaholic\""}, {"rating": 1.0, "review": "Purchased this item for oCosmos Roku-ready HDTV to replace a Roku 1 (that I wanted to move to a different TV). The Roku Stick would never manage to play a video through Wi-Fi because it was constantly \"buffering\" the signal. (The Roku 1 worked fine on this TV and location.) I returned the Roku Stick.", "verified": true, "helpfulness": "0/0", "author": "Douglas H. Sherbert"}, {"rating": 5.0, "review": "Bought for my boyfriend for his birthday and he loves it! Now he wants to disconnect his cable because there are so many channels to watch! A definite buy.", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 1.0, "review": "First and now only Roku product I will purchase. Sorely underpowered. Flakey application response. Disconnects from both bands on a regular basis. Requires a power recycling at least twice a week no matter the service used. The list goes on. I have high hopes for the new Amazon streaming stick option because this device is plain junk. Shame on Roku, such a large presence in the streaming device world, to put out to the public such a half baked product.", "verified": false, "helpfulness": "5/5", "author": "Slappy MacPhee"}, {"rating": 5.0, "review": "So easy to use. I've had it for a couple months now. No problems at all. Good choice.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "nice", "verified": true, "helpfulness": "0/0", "author": "l adams"}]