[{"rating": 1.0, "review": "The device needs to be reset continuously. The handheld unit about every third time you have to pull the batteries and put them back in to get it to work would it be possible for you to contact me and give me instructions to send it back for a new one.", "verified": true, "helpfulness": "0/0", "author": "Andrew Singleton"}, {"rating": 4.0, "review": "My unit works, no issues pairing the remote or anything.  The streaming stick itself does feel slow as compared with using a PS3 for netflix before.  But for the price and what it gives you I can't complain. I used the included power adapter to plug into the wall instead of using the TV USB port, that way I don't have to sit through the stick boot up sequence every time I turn on the TV.  This will definitely hold me over until 4k streaming devices are available!", "verified": true, "helpfulness": "0/0", "author": "Michael Weissman"}, {"rating": 5.0, "review": "Very happy with it Very easy to use", "verified": true, "helpfulness": "0/0", "author": "Alan S Carpel"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "John Baird"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "S.Otis Lane"}, {"rating": 5.0, "review": "Worth the cost. Works great!", "verified": true, "helpfulness": "0/0", "author": "great product"}, {"rating": 5.0, "review": "We have multiple Rokus. This is a more portable version to add to our arsenal. We love them all.", "verified": true, "helpfulness": "0/0", "author": "cybersherrif"}, {"rating": 1.0, "review": "Refurbished seems like a real roll of the dice. Unit started fine, menu's were up and functional, even netflix sign in worked fine but; Every time it tried to stream it only produced a blank display area with audio (multiple monitors/TV's tested upon). I'm unwilling to roll the dice again to save a few bucks. Will buy new next time. -Savings to frustration ratio not good enough.  (One of the very items I've returned to Amazon; they handle returns excellently.)", "verified": true, "helpfulness": "0/0", "author": "Nevermindme \"tyrantxii\""}, {"rating": 5.0, "review": "We've had Roku streaming stick for about a month, and (although I was skeptical at purchase) I can definitely say I have no complaints. It is easy, works great, never had a streaming issue -- comes in just as cable/satellite would, in terms of quality.We bought one stick and move it to the bedroom TV at night - just plug in and go. Channels are easy to add. I like the \"news\" section on Roku, so I can feel up to date on some of the latest stories, as that was my only hesitancy in ridding of cable. I originally thought it would be worth the money to buy the bigger unit, rather than the stick, but I was proven wrong. (We use Roku for Netflix mainly, plus some other streaming channels).", "verified": true, "helpfulness": "0/0", "author": "N. L. B."}, {"rating": 5.0, "review": "Great at $29. Amazon and Netflix together with a remote to boot", "verified": true, "helpfulness": "0/0", "author": "Mike"}]