[{"rating": 5.0, "review": "Love it. A little slower than the other models but that's understandable for its size.", "verified": true, "helpfulness": "0/0", "author": "Mr.Mac"}, {"rating": 3.0, "review": "Interface is sluggish and outdated, especially with the FireTV stick out now.", "verified": true, "helpfulness": "0/0", "author": "Eliott Neumann"}, {"rating": 5.0, "review": "I was unable to use it upon receipt.  I had to purchase a router.  Now that it's installed I love it! Still checking out all the venues it has to offer.", "verified": true, "helpfulness": "0/0", "author": "Susan Sheppard"}, {"rating": 5.0, "review": "This was a additional roku to use at home. this stick works great.", "verified": true, "helpfulness": "0/0", "author": "Thierry M. Steenberghs"}, {"rating": 5.0, "review": "Great buy, was exactly what I wanted and works perfectly", "verified": true, "helpfulness": "0/0", "author": "Lisa Purcell"}, {"rating": 1.0, "review": "I like the idea of the product.  But, the remote (the part I actually interact with) is causing so much frustration!  Buttons stick and cause the selections to race around on the screen.  Sometimes they just don't respond without a very intense push of the button.  This device has been used no more than 20 hours, so it isn't worn out and the batteries are fresh.  As I said, the \"idea\" of this product is awesome.  But, if the quality of the part you use to make it work is so bad that you can't control the programming with cursing, then it isn't worth it.  I also have the chrome, which has no remote at all.  THAT remote is better than this one!  So sad.  I wish the remote was as solid on this device as the one they sent with the Roku 3 that came the same day.  :/", "verified": true, "helpfulness": "0/0", "author": "pgAZ"}, {"rating": 5.0, "review": "As a gift it has been used a lot, and they love it.", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 5.0, "review": "super easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "Summer Grace"}, {"rating": 3.0, "review": "Like the small size and portability, but I wish it fit a bit more snugly in the USB port on my TV.  It was very easy to set up an account, the remote is small and sleek, and I like the pre-programmed Amazon and Netfix buttons.", "verified": true, "helpfulness": "0/0", "author": "V. Pickens"}, {"rating": 1.0, "review": "My roommate has one and it works great, however mine was junk.  After hours of screwing around with I returned it for my money back.  Roku tech support never returned my email - the remote would stop working after about 15 seconds, it would lockup on the home screen, sometimes it wouldn't power on until I unplugged it from the tv and plugged it back in.  Tried both usb and supplied power source - nothing mattered, it just was junk.", "verified": false, "helpfulness": "0/0", "author": "Todd Goodsite"}]