[{"rating": 4.0, "review": "Other reviewers have complained about how \"slow\" this device is.  I have to say, that is a rather petty complaint for what is truly a fantastic little gizmo.Yes, it takes two or three minutes to boot up - so just turn on the TV a few minutes before you're actually ready to sit down. Yes, there's a very slight delay between pressing a button on the remote and actually seeing the response on-screen - but it's less than a second, and you do get instantaneous audio feedback (a little \"ding\") when pressing a button.  So on both counts, yes, the device is technically \"slow,\" but not in such a way as to be problematic.On to what I like about it:1.) The size - it just plugs right into an HDMI port. Gets power from a USB plug, which on our TV is located right next to the HDMI port. Use a six-inch Micro USB cable and you can plug this thing in and not even have to see it, with no messy wires, etc.2.) It's easy to set up. I was connected to our network within a couple of minutes. I could connect it to most networks even faster, but ours doesn't broadcast the SSID so I had to type it in manually.3.) It's easy to connect to online accounts.  As just one example, you can rent Amazon movies right from the remote.4.) It holds the Internet connection - very solid in that department.5.) Video quality is great.6.) It can easily be \"paired\" with a smartphone or tablet so you can stream Youtube right to the Roku. You can use Youtube on Roku directly as well, but it's easier to set up playlists, search, etc., from a mobile device.This little device has eliminated our need for a DVD player or to run messy HDMI cables from a laptop to our TV. We love it.", "verified": false, "helpfulness": "0/0", "author": "M. Lewis"}, {"rating": 2.0, "review": "I was on the pre-order list for this device and have had it since day one.It just experienced it's 2nd 'hard reset' issue in that time. At first I thought it was a Hulu glitch as the screen went kinda green and then it froze requiring me to unplug it to get it to unlock. This time it froze during Netflix and came up with the pair the remote screen. (I'm typing this review as it's doing the reset process, and it just went back to step one as it was adding channels)If it was just a matter of rebooting the unit and moving on this would not bother me, however I need to reenter my passwords for all of my services after this happens, which is very time consuming. It will take about 15 minutes for it to re-add all my channels, then however long it takes for me to remember all my login info for about 5 other paid services and input that.We have an older Roku 2 in on a different TV that has been rock solid, so if these issues persist this unit may be heading back to the factory and I'll get an older, more reliable box instead of this sleek HDMI stick.And now we are back at the \"Pair your remote\" screen and starting over again. Locked up during the channel scan again.I just unplugged it from the TV and power source and the unit is quite warm. Starting over again....23 of 56 channels...I'll update this review if it succeeds or fails this time, life calls.--After unplugging the unit from the power and TV, and going thru the startup process again I'm again watching Netflix. If I have to go thru this again, it will be returned as defective.--- 6 month updateThe Roku stick still hard resets about every other week, sometimes it remembers it's settings, sometimes I have to go back to step one and re-add all my account data again. If I had to do it over again I would have gotten another Roku 2.", "verified": true, "helpfulness": "1/2", "author": "Eric B."}, {"rating": 4.0, "review": "If you love Roku you'll love this stick.  But I have a couple gripes.1. The boot time for this is very long.  2.5 times as long as our 32\" LED TV.  If you have patience or patient kids, then great.2. You must have an open HDMI port.  It cannot use any other ports.3. Hopefully your TV has an open USB port.  This is the power source for the stick.  If you don't have an open USB port that's fine but you'll be forced to use the included power source (micro usb to AC) which defeats the purpose for the stick; being able to hide it behind the TV.4. There is still no easy way to travel with and connect the Roku to hotel TVs and use their wireless. You need to understand MAC and IP addressing and how to mimic your laptop's IP.If you don't have a USB, don't get the stick. You might as well buy the full size Roku and get the other various ways to connect and hide it in some cabinetry or similar.  They all behave the same, use the same remotes, have the same menu structures.  Save yourself the hassle and check if your TV has the USB then make an informed decision.  If your cable company is going all digital and making you already use one of the HDMI ports, check to see if you have a second port available before purchase.  If not, then don't buy the stick and get the full sized Roku.", "verified": true, "helpfulness": "0/0", "author": "HandyDad \"MSR PMP\""}, {"rating": 5.0, "review": "Great item, totally worth the money and in the long run is very inexpensive for what its true value is in my family.  Got my mom one and got myself one and will be replacing older roku LT eventually. AWESOME PRODUCT!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "this works great i have no issues with is user friendly easy to follow instruction. when and if i need another i would by this again", "verified": true, "helpfulness": "0/0", "author": "juan galindo"}, {"rating": 4.0, "review": "Love the concept - no set top box, no power outlet needed if your TV has USB. The only down side is that it is noticeably slow to boot up when the TV is turned on.", "verified": true, "helpfulness": "0/0", "author": "K. Sam"}, {"rating": 5.0, "review": "This was a addition to my television and was able to pick up my network easily.  It offered so many channels and continues to grow daily.", "verified": true, "helpfulness": "0/0", "author": "Ray D'Aguanno"}, {"rating": 1.0, "review": "Ugg; so many wide and varied problems - it's hard to even know where to start.I've set it up on three different TV's.  Different problems on each one.  One TV only sees the device in the HDMI port sporadically.  Another TV sees the device and shows it onscreen, but it doesn't respond to the remote control.  A third TV sees the device, starts the setup process, connects to the local wi-fi...and then won't hold an internet connection.I've a dozen other devices in the home from a dozen other manufacturers that connect to the same wi-fi router seamlessly and reliably.  But not this Roku.The fact is, it's simply a bug-ridden, unreliable device that's not even stable enough to be labelled a \"beta\" release.  It's definitely nowhere near functional enough to be rolled out as a mass-consumer product.Try again, Roku.", "verified": false, "helpfulness": "0/2", "author": "Michael Mcfadden \"Ike Mcfadden\""}, {"rating": 5.0, "review": "For me, this is the best streaming device out there. I've got ChromeCast, which I enjoyed a lot, but was frustrated that I had to control everything through my laptop. The Roku Stick eliminated that by providing a nice little remote. Now, everything works right on my TV. It costs a wee bit more than ChromeCast, but it's well worth it.", "verified": false, "helpfulness": "1/1", "author": "Jennifer AlLee"}, {"rating": 2.0, "review": "We sent this back because it was buffering (loading) every few minutes. This ruined the experience. We have a Roku lite and it doesn't do this nearly as often. We also purchased an Amazon Fire. I like the fire for the addition cost and features.", "verified": true, "helpfulness": "0/0", "author": "kentrosi \"kentrosi\""}]