[{"rating": 5.0, "review": "This is awesome! So many apps to choose from on it to watch and you can buy and rent movies and shows from it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So this is my first Roku device, but it won't be my last. I started my 'smart tv' life with builtin tv software, but that is a bit limiting...so I then got the Chromecast....and when the $50 Roku was announced.... So overall, this form factor like the Chromecast is perfect, but the downside is that this means the device has to start up everytime the TV is turned on, now that may be because I'm using the TV USB power, but....anyways, I love the Roku device for 2 main reasons.... 1. great channel selection, 2. a physical remote.The biggest complaint I have is that it takes a bit to boot, and that it has the tendency to reboot often while searching for something to watch, but once it starts playing a show, it works great. It reboots mostly while searching Netflix, so I'm thinking it is a SW bug that will get itself worked out over time and then it will be flawless.If the boot time was faster (like the Chromecast) I'd give it 5 stars without a question.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It simply did not work. The stick steaming was inconsistent. It would buffer and lock up when used, primarily for Netflix. When I watch Netflix on my lap top computer Netflix streaming works great. The Roku streaming stick just didn't work.", "verified": true, "helpfulness": "8/8", "author": "Paul T. Sherwood"}, {"rating": 5.0, "review": "Very easy to set up, easy to use, very portable, and overall the best on the market. Thank you Roku", "verified": true, "helpfulness": "0/0", "author": "Douglas Bryan"}, {"rating": 4.0, "review": "I am happy with the Roku stick however I have not used the hand remote. I have had issues with the hand held remote of the Roku3 so I use the remote via the ipad app. So far so good...letcha know if there's a change.", "verified": false, "helpfulness": "0/0", "author": "Xtc"}, {"rating": 5.0, "review": "This is my first Roku device and so far I am very impressed with its performance and variety of channels available. Easy to install and simple to use. Small but ample to do the job. Works great.", "verified": true, "helpfulness": "0/0", "author": "DSL"}, {"rating": 4.0, "review": "I wanted a streaming device without spending much. I selected the stick since it claimed to be exactly like the Roku 3 box covering the same content without the headphone enabled remote and, of course, speed. Sacrificing speed was no big deal but this little stick does pretty well considering. It doesn't respond to the remote quickly which is frustrating and it does lag somewhat while browsing. Still, for the money at half the cost of the boxes, the stick is perfect.", "verified": true, "helpfulness": "1/1", "author": "A Little Bird Told Me"}, {"rating": 5.0, "review": "Easy to set-up, everything was fairly straight forward. I can take the stick and use on any television in the house. Stream music, video and any available site right to my television. Great purchase!", "verified": true, "helpfulness": "1/1", "author": "Norman Bovenzi"}, {"rating": 5.0, "review": "The Roku Streaming Stick was very easy to install.  It probably took about 5 minutes, if that.  Now I get to enjoy so many tv shows that are not available through my regular cable.  I'm very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Janet Hildebrand"}, {"rating": 5.0, "review": "I have had a Roku for some time now, and when I saw that Roku came out with this little stick I had to have it!  Now I can have Roku on my wall-mount TV in the bedroom without having to worry about placement of a box.  The one thing I did not expect is that it has to be powered by being charged or via a USB outlet on the TV.  I just assumed the HDMI connection would do it all.  I panicked when I realized it had to be charged/powered, but luckily my TV set (which is a little older) did have one USB connection for me to connect it for power.Roku is great for streaming from Amazon Prime and other streaming media sources.", "verified": true, "helpfulness": "0/0", "author": "A. Mcintyre \"Frugal Shopper\""}]