[{"rating": 1.0, "review": "I bought this product with the expectation of having as published a stick that could be added to any HD TV and convert it to a smart TV, unfortunately it has limited service outside US, which makes you lose a lot of features, even if Netflix service is available in Argentina, through ROKU cannot see it. I've called ROKU and they said that they cannot do anything, I also tried to return the product on AMAZON but they do not allow me to do it, so I have a ROKU that I cannot use nor return.", "verified": true, "helpfulness": "0/1", "author": "Pablo Ferreiro"}, {"rating": 5.0, "review": "We love our Roku", "verified": true, "helpfulness": "0/0", "author": "vicky brown"}, {"rating": 5.0, "review": "Love it. Easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Daniel J. Prince"}, {"rating": 4.0, "review": "I thought that ordering a refurbished Roku might be tricky but was pleasantly surprised when it worked perfectly.  My only caveat was that was almost impossible to log-on, on screen.  You couldn't see the whole screen.  I called Roku, they helped immediately.  Everything is fine.  As for arrival, it was on time, safe and sound, no problems.  I think the screen size was an just a quirk.  I'd recommend them.", "verified": true, "helpfulness": "0/0", "author": "Carole A. Potter \"Kate's Carole\""}, {"rating": 5.0, "review": "Was a little hesitant to buy refurbished, but it worked perfectly.  Very fast delivery too!", "verified": true, "helpfulness": "0/0", "author": "Amy C"}, {"rating": 5.0, "review": "Wish I had bought this long time ago.  Works like a champ.  No problem so far.", "verified": true, "helpfulness": "0/0", "author": "Justin Sonner"}, {"rating": 5.0, "review": "This is not my first Roku, so I was already familiar with the system.  I like the streaming stick because it takes up little space by plugging right into the TV.  I also like the fact that it allows me to view Netflix based on the different viewing \"accounts\" that I had created online, for example, one for adult interests, another specifically for kids shows for my young son.  This wasn't something that I had been able to access with my previous Roku units.  As for it being refurbished, the unit and the remote control looked new, and so far there has been no difference in the performance.  Eventually, I will gladly buy another one for my remaining TV.", "verified": true, "helpfulness": "0/0", "author": "Yadagoy"}, {"rating": 5.0, "review": "Able to stream Amazon prime, Hulu, and Youtube with no problems on standard wifi.Some of the menus are slow to get through, especially Youtube channel, but found that connecting my phone via wifi remedies this problem.", "verified": true, "helpfulness": "0/0", "author": "cngmi"}, {"rating": 5.0, "review": "Skeptical at first, now I look forward to going home and watching tv my way. I love it.", "verified": true, "helpfulness": "1/1", "author": "Russell S."}, {"rating": 5.0, "review": "Regarding setup I did have to press the reset button on the stick to get my smart TV to recognize the stick was plugged into an HDMI port. Then had to sign up for a Roku account online and enter credit card information, just in case I want to purchase online shows in the future. Also had to receive a pin type code (don't remember what they called this number) online and then enter that number on the TV. Having easy access to a laptop during setup was a must. Only took about 15 minutes to complete everything. Works like a champ.", "verified": false, "helpfulness": "0/0", "author": "Teresa D'Angelo"}]