[{"rating": 5.0, "review": "Works perfect!", "verified": true, "helpfulness": "0/0", "author": "MGSpin"}, {"rating": 5.0, "review": "Inexpensive. Easy. Cut my cable bill and reduced monthly bill spending. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Jenna Bachen"}, {"rating": 5.0, "review": "Arrived in good condition and works perfectly. Thanks very much!", "verified": true, "helpfulness": "0/0", "author": "Derek Norman"}, {"rating": 5.0, "review": "Great interface and easy to use. It was a definite improvement over using our Wii to control Netflix and Hulu. Great for us who have recently cut the cord!", "verified": true, "helpfulness": "0/0", "author": "ecuaman801"}, {"rating": 3.0, "review": "The stick does work like the box does but for some reason, it constantly buffers; which tends to be quite annoying.  If I was sure there was no restocking or shipping fee, I'd probably send it back and order the 3 HD ROKU box.  I wouldn't order another one.", "verified": false, "helpfulness": "0/0", "author": "GG"}, {"rating": 5.0, "review": "Great idea!  I love it and would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Lenore"}, {"rating": 3.0, "review": "I'm waiting for the online live chat to move to me to \"1\" in the queue, as I type this.  Look, when it works, it works great.  I've loved not having to pay for TV and this has (for the most part) done what it should.  However, I purchased this March 28th, 2014 and here it is January 26, 2015.  It hasn't even lasted a year, and this isn't the first time I've had issues.  Unfortunately,  when I woke up this morning I found it in a perpetual loop of ROKU sadness, where the letters bounce on the screen and then it constantly resets.  So, as I sit in the \"queue\" for what will probably be another 30 minutes only to have them not be able to fix this, I think the next TV stick I order will be the amazon fire.  You might get a ROKU that lasts for years, but I'm disappointed this thing didn't make it even one.", "verified": true, "helpfulness": "0/0", "author": "Jaime E. Brown"}, {"rating": 5.0, "review": "This is a pretty nice little device to steam tons of content off the web.  Besides being able to stream your Amazon Prime, Hulu Plus and Netflix, the Roku provides you with a ton of other free content as well.  I've had it a couple of weeks now and the more I play with the Roku the better I like it.  Definitely a great gadget to have.  Just log it into your wireless network and go.  Great picture quality in HD.", "verified": true, "helpfulness": "0/0", "author": "Dan Keller"}, {"rating": 5.0, "review": "Works great. No problems! I always buy refurbished items & they always work as good as new but with a cheaper price tag.", "verified": true, "helpfulness": "0/0", "author": "JDO \"Guyswhocook\""}, {"rating": 3.0, "review": "I have had a lot of trouble with this product. The streaming stick went bad, and was promptly replaced by Amazon. A good thing.Now it is the remote. Over the last two days , I have spent three hours working with Roku tech support. It has been a challenge. They don't speak my type of English, and they are not really technical people. I may yet get this to work well.", "verified": true, "helpfulness": "0/0", "author": "William s. king"}]