[{"rating": 5.0, "review": "Just perfect, works great !", "verified": true, "helpfulness": "0/0", "author": "klaus Blaszik"}, {"rating": 5.0, "review": "Works great. No issues. Installed in 5 minutes. Works great even with small internet package.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We've really enjoyed this Roku. I considered getting one of the box tops but I am glad I didn't. This works very well and plugs right into the HDMI port of my tuner, plugs into a power source and uses our wifi to receive the signal. It's compact and does the job. The remote works very well and we enjoy watching on demand programs this way.", "verified": true, "helpfulness": "0/0", "author": "S. Rencher"}, {"rating": 5.0, "review": "If u only have a converter box and dont want to go through the process and prices of cable/satellite........this is Perfect!!! Enjoy.", "verified": true, "helpfulness": "0/0", "author": "Dan Fino"}, {"rating": 5.0, "review": "works great. and is simple to use.", "verified": true, "helpfulness": "0/0", "author": "pat"}, {"rating": 1.0, "review": "Garbage.  Works for 2 weeks and remote fails to respond after you go into Netflix, hulu, amazon, etc.", "verified": true, "helpfulness": "0/0", "author": "Jesse W. Chovan \"JesseX\""}, {"rating": 4.0, "review": "Bought as gift for my son. He's very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Jon P. Laird"}, {"rating": 1.0, "review": "Love it when it works,  but have been having the same problem as others regarding the remote since day one.  Half the time the remote simply does not work.  You press a button - nothing happens.  You reset,  it works for a few minutes,  and then stops again.  Infuriating.  Switching to another product and will be warning everyone I know to stay away.", "verified": false, "helpfulness": "0/0", "author": "chathamcanvas"}, {"rating": 5.0, "review": "This is our 2nd one.  It is easy to set up and works great!We purchased to replace the ChromCast and are glad we did.", "verified": true, "helpfulness": "0/0", "author": "Carla Van \"Carla\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Linda Bollinger"}]