[{"rating": 5.0, "review": "It is a worth! To me, I like Roku better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "L'Raine"}, {"rating": 5.0, "review": "Perfect. Set it on my bedroom TV and now I have high definition and many viewing options for shows, movies, and more without having to use my cable box.", "verified": true, "helpfulness": "0/0", "author": "michael sonlin"}, {"rating": 5.0, "review": "I enjoy this little Roku Stick best one I ever had!!", "verified": true, "helpfulness": "0/0", "author": "Sherri Carr"}, {"rating": 1.0, "review": "The roku streaming stick doesn't work sometimes and the remote don't work not a good product", "verified": false, "helpfulness": "0/0", "author": "michael g garcia"}, {"rating": 2.0, "review": "The remotes don't work. I've gone through 2 Roku Streaming sticks and same problem with both. Not to mention the screen mirroring doesn't work at all. I can still stream fine but overall pretty disappointed. Oh and Netflix? I have 20-20 vision and can barely read their titles on the netflix channel.", "verified": true, "helpfulness": "0/0", "author": "KGelks"}, {"rating": 5.0, "review": "Awesome device.  We have both Apple TV and Roku streaming stick, but we use our Roku over our Apple TV pretty much all the time because the remote is easier to use, and it just has way more functionality.  More channels, more everything.  Roku is great!", "verified": true, "helpfulness": "0/0", "author": "matthew j yates"}, {"rating": 5.0, "review": "The stick definitely has a slower reaction time to the remote than the Roku box does... but it does it's job.  Very good price for the product.  Have recommended this before and would continue recommending it.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "This is the best Roku yet for me. It is tiny. You plug it into your tv and plug the power into an outlet and it works perfectly. You can easily travel with it. The one thing to note about traveling with a Roku is that you will need to create your own wireless network as the Roku does not have the ability to sign up for access. There are many ways to do this. I carry a portable router with me and use my laptop or tablet to log the route into the hotel network. Before I leave home I setup the Roku to use my travel router. Then once I have my router plugged in and my network access established, Roku will automatically work. It's really great to have this little Roku. I can use my iPad as a control also, as long as the Roku is already setup for the network. You can also purchase a connector to USB and power the Roku stick off of the tv's USB port, but I haven't tried this yet. The power adapter came with the Roku and was fine for my purposes.", "verified": true, "helpfulness": "0/0", "author": "Elle \"Mahalo\""}, {"rating": 1.0, "review": "I purchased this last July.  Now, it won't load onto my TV.  My TV is working fine.  The screen keeps loading and reloading and the ROKU screensaver just repeating.  It has been less than a year and I am very disappointed that this product did not last as long as I thought it would.  It was great in the beginning.", "verified": true, "helpfulness": "0/0", "author": "Nancy S."}, {"rating": 5.0, "review": "This is good for streaming movies and saving on the cable bill. Much needed I wish we would have gotten it sooner.", "verified": true, "helpfulness": "0/0", "author": "alexis"}]