[{"rating": 5.0, "review": "Love Roku, it has been fun having this to live stream at our vacation home and not have to pay for cable monthly since we are only there sporadically. Easy to set up and works well.", "verified": false, "helpfulness": "0/0", "author": "Wurkinout"}, {"rating": 1.0, "review": "Disastrous quality of apps. Netflix - especially - eventually becomes unresponsive, while other apps seem to degrade in performance (lagging, unresponsive) in time. Bought this as an \"upgrade\" for an already Vizio \"smart\" TV (with its own apps), which did not support some new features of the most common service providers. Had to go back to the TV built in apps after no more than two months of Roku usage.", "verified": true, "helpfulness": "4/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It is wonderful, I love being able to have so much to watch and enjoy.  Thanks Roku for such a useful product for such a low price and it was so easy to install, It took me about 15 minutes.", "verified": true, "helpfulness": "0/0", "author": "Constance Rodgers Faison \"IFETAYO\""}, {"rating": 5.0, "review": "Pretty slick. We already had a Roku 3 and I bought this one for a bedroom TV. I didn't realize it needed power but not a big deal. I read recently that it can also be powered from a USB port so may try that. And the price is hard to beat--less than we paid for the refurbished Roku 3 several months ago.", "verified": true, "helpfulness": "0/0", "author": "Dave McCartney \"dkmcpa\""}, {"rating": 5.0, "review": "Love it!I already own a couple of Roku's in my home, however, I got this for traveling with the family.  It was just great.  Wherever we go, we just plug it into the tv and connect to the wifi.  Everything we have at home is there with us.  I don't bring the remote since I can easily control the stick with the Roku app on my phone or tablet.  Also, we can cast any photos or videos we take right to the TV.Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "PJ"}, {"rating": 4.0, "review": "Ok for the price.  Easy to set up.  Especially nice if you have Amazon Prime services.  Little slow to respond a times, but not too bad.", "verified": true, "helpfulness": "0/0", "author": "Reader"}, {"rating": 1.0, "review": "I guess I could write a lengthily review, but, however I'm not.  The Roku 3500R Streaming Stick was a disappointment from the first  day. Poor picture quality, constantly dropping the internet access, wanting to reset itself and the list goes on and on.  Till one day, after the return window had closed, the blasted thing just quit working. This happened about one week after the return window closed, so I'm stuck with a forty  -some dollar piece of junk. In someways I'm glad it died, now I can move on to something, hopefully, better. The old adage applies; \"Buyer beware.\"", "verified": false, "helpfulness": "1/2", "author": "charlieww2"}, {"rating": 3.0, "review": "This was fine at first. Now, after a few months it freezes frequently. The remote feels great in the hand and its ability to operate without being pointed directly at the sensor was a real plus until finding out that just picking it up from the floor the wrong way could cause it to stop or change what you’re watching.", "verified": true, "helpfulness": "0/0", "author": "Phaeton"}, {"rating": 5.0, "review": "So far so good, easy set up.", "verified": true, "helpfulness": "0/0", "author": "miranda"}, {"rating": 1.0, "review": "This thing is terrible. When you turn it on, it takes an eternity to start up (literally > ten minutes usually) and half the time it crashes and has to start up again. There have been times where I just gave up after three cycles of startup/crash. It has a host of other problems as well. Sometimes it has static on the screen, which I don't even understand how that's possible with a digital media device connected via HDMI. It's extremely slow navigating menus, and has an annoying habit of either not registering a button push or you press the button once and it won't stop scrolling until you turn the unit off and back on.I missed the amazon return window, because I didn't install the Roku until more than a month after I bought it, and I tried to go through Roku's customer service, but they had some simpleton in Bangalore trying to walk me through the most ridiculous troubleshooting ever (actual example from our customer service chat: \"have you are turning the unit on?\") and then they kicked me off the chat session for telling them it was a f****** joke. I will not buy another Roku. The only decision now is chromecast or Amazon Fire TV....decisions, decisions.", "verified": true, "helpfulness": "2/2", "author": "Dean \"KoolMoeDean\""}]