[{"rating": 5.0, "review": "I bought this to replace my roku hd that was overheating from years of use and I am not disappointed. Roku is the best streamer out there. Hands down.", "verified": true, "helpfulness": "0/0", "author": "Reese \"Te\""}, {"rating": 5.0, "review": "I love the Roku Stick!!!! It's worth every dime, nickel, and penny!!!!!", "verified": true, "helpfulness": "0/0", "author": "Crystal"}, {"rating": 5.0, "review": "It's easy to set up and use. I'm very glad I purchased it.", "verified": true, "helpfulness": "0/0", "author": "Colleen Lade"}, {"rating": 5.0, "review": "This really works well. I also have a roku 3 and I feel it works just as good.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"babywaif\""}, {"rating": 5.0, "review": "Our first order was from Blinq for a used one bought thru Amazon, unfortunately we had to return it because of a faulty or shorted power port or power supply cord, don't know which one was faulty. Blinq was great to deal with and I compliment them for the free return shipping and thank Amazon too because my credit was applied the day following shipping return... Thank you ! I have purchased another unit but in our brief experience with ROKU stick after saying adios to Comcast ...we were very pleased. The little stick works great ( when powered up ). You may need an adapter to change orientation of your Roku stick if your set has any obstruction within about 3:\" of your HDMI port, otherwise you may not be able to stick it in without an adapter, they come in 90 degree and 270 degree versions and the plugs are oriented differently. Check your set and get what you need because if your stick won't fit in the HDMI  with enough clearance you will be looking for a Female to Female coupler and HDMI cable or some other adapter type like the right angled adapters described previously, there are other types too so check before you leap and get all you need so when your ROKU arrives you won't be heading to Best Buy or Radio Shack to look for an overpriced adapter. You can get them here on Amazon for 1/10 of the price you will find at your local retail! Have fun cutting your cable bill and enjoying HD 1080 !!", "verified": true, "helpfulness": "0/0", "author": "Greybeard"}, {"rating": 5.0, "review": "Great device! I recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "SazziK"}, {"rating": 5.0, "review": "This arrived and was installed in minutes - very easy to use and setup!!", "verified": true, "helpfulness": "0/0", "author": "NatsFan"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Bill Heald"}, {"rating": 1.0, "review": "Someone should stick this stick where the sun don't shine. What a joke! You have to create an account on every channel or network even if its \"free\" some channels only play trailers, some have like 1 or 2 shows/episodes. Totally bogus! Save yourself HOURS of endless frustration!", "verified": true, "helpfulness": "0/3", "author": "shirley cunningham"}, {"rating": 2.0, "review": "I have a Roku and love it.  However, I find the Roku stick and its remote to be non-responsive at times and it doesn't seem to respond to our internet signal as well as other devices in the house.  This is my second Roku streaming stick.  I returned the first one hoping it was a lemon and the same issues are consistent, which seems to be the only consistency. By the time I decided that this new product really wasn't going to work well, I had missed my window to return it.", "verified": true, "helpfulness": "1/2", "author": "Whitney S Grant"}]