[{"rating": 3.0, "review": "We have two Roku 3s and one of these sticks...I consistently have issues getting it to read the remote. And it freezes up a lot. We had one Roku 3 and then the streaming stick, when we went to purchase another one we got another Roku 3. It's not even an issue of the room being too large to read the remote either...it's just has some flaws.", "verified": true, "helpfulness": "0/0", "author": "Mom Addicted to Target"}, {"rating": 5.0, "review": "I love it. great price", "verified": true, "helpfulness": "0/0", "author": "Willamae Thomas \"Amazon Queen\""}, {"rating": 4.0, "review": "Good so far no probls", "verified": false, "helpfulness": "0/0", "author": "carla dunton"}, {"rating": 4.0, "review": "It has been a good streaming device. However, I couldn't use the Roku 3500R on one of my televisions because the HDMI connector on the TV didn't have enough clearance to plug in the power cord for the Roku. The was a problem on 1 of 4 TVs.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "WORKS GREAT!", "verified": true, "helpfulness": "0/0", "author": "Paul Willson"}, {"rating": 4.0, "review": "Kinda slow", "verified": true, "helpfulness": "0/0", "author": "Maggie Nunn"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "mspjdiva"}, {"rating": 5.0, "review": "Fantastic. Much better than the one that hangs on to the TV.", "verified": true, "helpfulness": "0/0", "author": "Andra Davis"}, {"rating": 5.0, "review": "Love this product!!!  It is nice - we can get for every TV and we all can watch what we want.", "verified": true, "helpfulness": "0/0", "author": "Kelly R"}, {"rating": 1.0, "review": "Starting with the setup, I was pissed because I can't proceed without giving Roku my payment information even I do not intend to purchase anything from them. Then the boot time seems to take forever. This wouldn't be too bad if the system is reliable. Unfortunately, it crashes at least once each time I use it. Sometimes it crashes and reboots with the annoying bouncing Roku. Sometimes it just freezes, requiring replugging the stick to reboot. Did I say the boot time is long? You can see how annoying it can be. The entire system is sluggish. The Miracast also has lot of issues and simply is not workable. It connects to my phone easy enough even if also takes a long time. Then it randomly disconnects itself. There is a noticeable delay between the phone and the TV. But when playing a video, the Roku stick is completely unacceptable. It freezes a lot, screens are scrambled almost certainly with voice mismatch.It seems like the Roku stick is under powered for what it intended to do. In comparison, the Amazon Fire TV Stick never suffers from these issues and is generally a much better product.", "verified": true, "helpfulness": "2/2", "author": "GMY"}]