[{"rating": 5.0, "review": "Great!  Works very quick. Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Dee W"}, {"rating": 2.0, "review": "The remote controler is faulty and I have to keep taking the batteries out, and put them in again, and press the sync button over, and over again to reconnect it to the roku stick!", "verified": true, "helpfulness": "2/3", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Absolutely fabulous!", "verified": true, "helpfulness": "0/0", "author": "Ms_Monica"}, {"rating": 5.0, "review": "Price was great.  Super easy to set up.  I am a newbie to the streaming video world so I was blown away with how many channels are available on Roku.  Just watched  Uncle Alvin's 4th of July Display on my 55 in HDTV using the Roku (youtube.com)  and was really amazed at how great seeing youtube videos in my living room is.", "verified": true, "helpfulness": "0/0", "author": "S. ASHCRAFT"}, {"rating": 1.0, "review": "Returned. Didn;t work properly.", "verified": true, "helpfulness": "0/0", "author": "marcella edzards"}, {"rating": 5.0, "review": "second roku stick I purchased, both are great.", "verified": true, "helpfulness": "0/0", "author": "Thomas A. Brock \"oldbuckeyeman\""}, {"rating": 5.0, "review": "Packaged as a new one would be, didn't note any difference. Works the same as a new one. Good value, prompt shipping, pleased with product.", "verified": true, "helpfulness": "0/0", "author": "Arbret Yager"}, {"rating": 5.0, "review": "My second Roku", "verified": true, "helpfulness": "0/0", "author": "Tonya A"}, {"rating": 5.0, "review": "Can't believe we didn't buy this sooner!  WOW!  We have cable in our room again.  An excellent deal.  The Roku channels are a waste but amazon, hulu, and time warner channels are what we watch anyway.", "verified": true, "helpfulness": "0/0", "author": "ABWills"}, {"rating": 5.0, "review": "Very easy to set up, it included a usb cable that works as power source if you don't want to use a wall socket. The kit we received did include both cables, the wall power source and the usb cable. The stick plugs into HDMI socket.", "verified": true, "helpfulness": "0/0", "author": "sir Charles"}]