[{"rating": 5.0, "review": "Why cable, this Roku gets hundreds of channels and internet.  So far noissues whatsoever.  I do have a 2 and 5 gb wifi that does make it easier.  The boosters also help.", "verified": true, "helpfulness": "0/0", "author": "Rich l"}, {"rating": 5.0, "review": "I have 3 Rokus Streaming Stick (HDMI) and very one of them work great on my TV's .. just a lot fun watch movies, to shows of all kind and so much more. I even own a Roku old SX with Angrys Birds on it, which I still play on my big screen tv . Great fun from Roku at a good price.", "verified": true, "helpfulness": "0/0", "author": "Ronald Brezenski \"poeronald\""}, {"rating": 5.0, "review": "IT WORKED WELL IMMEDIATELY AND DID A STAND UP JOB FOR MY OLD LAPTOP", "verified": true, "helpfulness": "0/0", "author": "David G. Cruse"}, {"rating": 3.0, "review": "I like the Roku Streaming Stick, but it will kill the batteries in its remote in 30 minutes or less! Called Roku Customer Service twice and they couldn't resolve the issuse and told me to contact Amazon. Amazon is sending another one. I hope it doesn't have the same problem. I was sent a replacement that uses AA batteries in the remote control instead of AAA. I works great. No problems. The remotes that use AAA batteries are defective and should not be sold.", "verified": true, "helpfulness": "0/0", "author": "Fred"}, {"rating": 1.0, "review": "It is not ready. It didn't work out of the box. I went online and after hours of searching I found there is a reset button on it. I pushed it and it started to work. When I went back to use it I had the same problem all over. Tech support took days to get back to me. It had already been returned to amazon by the time they got back to me.", "verified": true, "helpfulness": "0/0", "author": "F. Wagg \"woody\""}, {"rating": 5.0, "review": "works great bought another one", "verified": true, "helpfulness": "0/0", "author": "phil morgan"}, {"rating": 4.0, "review": "The ROKU works fine.  Great picture quality and much nicer to use than my old one.  Getting it up and running was a nightmare of support and trying to get through pages of Roku trying to sell me all kinds of channels.  I already had a Roku account.  The page was so long I missed the \"continue\" button and screwed up the whole thing.  Had to  spend a long time on their support page with 'chat' to get it all ironed out.  If you hate using support as much as me I recommend you get someone more well versed to hook it up or get ready for some problem.The 'chat' option was nice as it gave me more time to go through the steps and negotiate all the channel selling.  In the end it was simple and I have no idea why it didn't just work the first time through using the remote.  Somehow the Roku could not see the Roku.  Go figure.  I had to give them the serial number of my roku before we even got started so have it handy.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 1.0, "review": "Very disappointed - had the first Roku out and loved it. This one lasted until a month past the warranty although I should have suspected it had a problem before now. It would hang up and not respond to the remote - removing the unit from the TV and plugging it back it and it worked again. The last couple days it won't respond to the remote no mater what I do - so is it the remote (new batteries to be sure) or the Roku unit? Since unplugging and replugging fixed it before I think it's the unit. The reset button on the unit doesn't do anything and the unit get quite warm (wall mounted TV - 42\"). My Blu-ray player will stream video though it doesn't have the some features I liked on the Roku - but no more Roku. And I'm not wasting another 50 bucks to see if this one was just a fluke.", "verified": true, "helpfulness": "0/0", "author": "Alfie \"Silverbird controller\""}, {"rating": 1.0, "review": "Didnt work for us.  Really bad lag from the remote.  Also would constantly freeze when using the menus.  Got to the point where we had to keep unplugging it and plugging it back in for it to work.  Not fun.  Going to look into other options.", "verified": false, "helpfulness": "0/0", "author": "Brian Munter"}, {"rating": 5.0, "review": "My mom loves it! She didn't have a smart TV and now she can watch all her shows!", "verified": true, "helpfulness": "0/0", "author": "Brittany Elks"}]