[{"rating": 5.0, "review": "Used as expected.", "verified": false, "helpfulness": "0/0", "author": "JOHNNY JONES"}, {"rating": 4.0, "review": "Good for business trips. My only complaint is the remote can be unresponsive, but it's few and far in between.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "Love it got my 2nd one for bedroom very nice", "verified": true, "helpfulness": "0/0", "author": "Julia M Fields"}, {"rating": 4.0, "review": "The Roku rocks, but the Amazon remote seems to be much more intuitive. I picked up the Roku for my parents before I bought an Amazon stick for myself. I wished I had given the Amazon stick to the folks because the remote is easier.Throw in the games and gaming controller available for the Amazon stick, I'd have to say I prefer it to the Roku. But I only watch a few services, so I can't give a good comparison of the apps available.I haven't tried the Chrome stick yet.", "verified": true, "helpfulness": "0/0", "author": "Michael McCrae"}, {"rating": 5.0, "review": "I previously used my Wii to stream, but always had buffering issues.  I then used my computer hooked to my tv via an HDMI cable, but that doesn't have a remote so you have to get up frequently and then my laptop was unavailable for use. The Roku streams my shows seamlessly and the remote is great. I would recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "sn"}, {"rating": 5.0, "review": "Love it and it works great", "verified": true, "helpfulness": "0/0", "author": "Lindsey Ramirez"}, {"rating": 5.0, "review": "Got here on time. Works great!", "verified": true, "helpfulness": "0/0", "author": "Angela Plank"}, {"rating": 4.0, "review": "I own a Roku 2 as well. Its the exact same thing its just cheaper and smaller! I haven't put too many hours into this guy yet but its sure is doing its job right now.One thing to consider: Your TV!I bought a TV and the Roku streaming stick at the same time off amazon because I wanted to watch nexflix in my bedroom. My plan was to mount my TV on the wall. The streaming stick seemed simple: No box no wires! I didn't even think about where, how many, or what kind of HDMI ports were on the TV I just bought a highly rated cheap TV because I was only using it with a Roku.Well the Roku streaming stick needs power. If your HDMI port is powered you're in luck!! No need for the AC adaptor.  Now if if you HDMI port is not powered, it needs to be plugged in to a power source with the AC adaptor, which means another cord and another thing in a outlet. :(I also didn't think about the placement of the HDMI outputs on my TV. My TV only has two and they stick straight out of the back. Thankfully my streaming stick just barely cleared the wall mount but I have to be thoughtful of the streaming stick when pushing my tv against the wall because it sticks so far out of the TV. Now also add the power cord and the TV has to be at least 5 inches from the wall, where i was hoping for it to be flush.", "verified": true, "helpfulness": "0/0", "author": "Jeska"}, {"rating": 4.0, "review": "So far so good, I feel its working little slow,because some times you need to wait for the device to respond back. other than this, its a good devide and works perfectly fine.", "verified": true, "helpfulness": "0/0", "author": "Ahamed Ashraf"}, {"rating": 4.0, "review": "Work very well.", "verified": true, "helpfulness": "0/0", "author": "Ms. Mable"}]