[{"rating": 3.0, "review": "This is a nice video streamer but I suggest spending the extra to get the Roku 2. The processor is smaller and at times it takes a while to react when trying to change shows. Also, prepare for a long set up. The stick needed a ton of updates out of the box. Probably took 2 hours before anything could be watched.", "verified": true, "helpfulness": "0/0", "author": "Matt Clifford"}, {"rating": 3.0, "review": "Have had some minor issues with connectivity and streaming speed while playing...but might be problem other than the device.", "verified": true, "helpfulness": "0/0", "author": "Lance Gailey"}, {"rating": 5.0, "review": "I love my new Roku. I have one of the older Roku and it's a little cumbersome. My new Roku stick is barely visible. I'm impressed that it does the same job as the larger Roku. Definitely recommending this to friends and family.", "verified": true, "helpfulness": "0/0", "author": "Le Le"}, {"rating": 5.0, "review": "Have two of these work great. Love the ability to get power from the TV so truely cordless.", "verified": true, "helpfulness": "0/0", "author": "Nick D."}, {"rating": 1.0, "review": "Malfunctions and freezes often. Do not buy refurbished.. I can't enjoy streaming my subscription channels", "verified": true, "helpfulness": "0/0", "author": "Yasmine"}, {"rating": 5.0, "review": "I love my Roku. Its easy to set up and saves me $100.00 a month.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "crystal smith"}, {"rating": 4.0, "review": "It works fine. I mainly use it for amazon instant video.", "verified": true, "helpfulness": "0/0", "author": "Kyle R Broadhead"}, {"rating": 3.0, "review": "Drops connection to remote every time tv turns off. Power adaptor to wall jack is the only solution to it.", "verified": true, "helpfulness": "0/0", "author": "pratik"}, {"rating": 5.0, "review": "Love it! I can watch all my programs and it's so easy to use. The hook up was a breeze. Definitely a must have for those using Netflix, Hulu, or any other similar app.", "verified": true, "helpfulness": "0/0", "author": "Shannon Arroyo"}]