[{"rating": 1.0, "review": "The Roku Streaming Stick worked great for a while. After two months it quit -- will stay on for a few minutes after reboot, then it quits. My wifi and internet connections, TV are all fine. I've tried all the usual tactics with no success. Unfortunately I'm past Amazon's return date so I'm out $49 and stuck with a useless piece of electronic/plastic waste.", "verified": true, "helpfulness": "0/0", "author": "richard w. lowery"}, {"rating": 3.0, "review": "nice shoes", "verified": true, "helpfulness": "0/0", "author": "robeas"}, {"rating": 5.0, "review": "Great little device. We use it for watching Major League Baseball games. Easy to install on TV and fun to use.", "verified": true, "helpfulness": "0/0", "author": "Ellie - Ohio \"Ellie\""}, {"rating": 1.0, "review": "Had to return it.  I have 2 tv's and it didn't fit either.", "verified": true, "helpfulness": "0/2", "author": "CLP Reviews \"Carole Phelan\""}, {"rating": 5.0, "review": "Love the streaming stick compared to my regular Roku unit. Definitely buy the USB power adapter though to take full advantage of it's compact size.", "verified": true, "helpfulness": "0/0", "author": "Andrew S."}, {"rating": 1.0, "review": "Broke within a few weeks.  It doesn't work.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 4.0, "review": "It's a pretty solid streaming stick with a couple of drawbacks. It supports basically every streaming service and a few hundred you've never heard of, it's fast, easy to use, easy to set up, and simple to operate. Where it loses me is the remote - the remote loses connections randomly, has significant lag when in use, and doesn't have any kind of IR support, which means no universal remote for you. The boot times are long - easily two minutes sometimes and you learn very quickly you dont want to power this thing from the USB. You're going to want to plug this in to the wall and just keep it on or else you'll  get frustrated waiting for the stick to boot so you can watch Netlfix. That said, the device is still excellent and worth buying.I've owned a chromecast as well, and one key advantage with the stick is that it also supports casting functions though this one is a bit more. If you want a simpler interface and are willing to pay a bit more for it, this is great for you. Otherwise, stick with chromecast.It's a solid streaming stick, but it has some drawbacks. Overall, it's a win.", "verified": false, "helpfulness": "0/0", "author": "James Smithe"}, {"rating": 5.0, "review": "I was looking for a device to reduce my Cable cost and found it!Took only a few minutes to be up and running. I was using my Blue ray player to stream Amazon Prime movies. It was difficult to organize and make movie selections. With my Roku the format is so much better and  the convenience of having more programs to watch is fantastic. I recommend it, if you are looking for a fine streaming device. After purchasing one Roku, and using it for a few days, I was so pleased that I ordered two more. another for my Wife to  use and I sent the other to my Daughter. She also had no problem installing the Roku. Her seven year old Daughter after a few minutes, was able to master the basic, simple to use Remote, and found many movies and programs such as Sponge Bob Square Pants to watch. My Daughter and Granddaughter both love their Roku..", "verified": true, "helpfulness": "0/0", "author": "Pj Waldo"}, {"rating": 5.0, "review": "My wife and I have been very happy with the Roku Streaming Stick. It provides substantially more content than competing devices and is very simple and straightforward to use. We purchased a second stick for our extra TV we liked it so much. The streaming stick is also nice because of its compact size!", "verified": true, "helpfulness": "1/1", "author": "Chris Speer"}, {"rating": 1.0, "review": "Terrible product for international shoppers, It won't work outside the US, the only apps that will work are: YouTube, TuneIn and Facebook.I regret buying this over a Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Yozafath Norori"}]