[{"rating": 1.0, "review": "We received our Roko in early Oct 2014 and it worked fine for about 10 weeks.  The sound stopped working this week.  I spent about 30 minutes on the phone with a Roku support person and was told I would hear from his manager.  No one ever called back.  I will not recommend this product to anyone.  I had to wait 20 minutes just to talk to someone.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "freezes programs (wwe network) ect...", "verified": true, "helpfulness": "0/0", "author": "BYRON C."}, {"rating": 1.0, "review": "Requires a credit card to use/install - why?  I've already paid for the subscription services.  And if I want to buy something else, I'm savvy enough to purchase it at the time of viewing -- I don't need Roku to store my credit card info.", "verified": true, "helpfulness": "0/0", "author": "AllThingsConsidered"}, {"rating": 5.0, "review": "Work great need it to setup WWE", "verified": true, "helpfulness": "0/0", "author": "Samuel A. Morris"}, {"rating": 4.0, "review": "I hope that things have gone much easier for others who have purchased this, but after about a month, our Roku stopped working.  The remote just froze, the Roku settings page (w/all the channel listings) appears for a second and then reverts to the Roku home page, so we can't get any shows (well, we couldn't anyone as the remote is frozen!).  We have gone online and tried several solutions, which did not work for us, and finally got through to Roku's online chat center, but the solutions offered didn't work either, despite the service person's best efforts. Maybe we have a lemon, and we're only out $50.00, but I sure wish we hadn't bought something with only a 30-day money back guarantee.Amended Review:  I wanted to let any potential buyers know that Roku's customer service department reached out a couple of times to help me with my issues with getting Roku up and running and internet connection more stable. In the end, the service associate recommended I change my internet channel to one that's less \"crowded\", apparently.  And that suggestion worked very well so that Roku is now up and running--some slow downs sometimes but overall working well.  I really appreciate the efforts of the Roku staff--and my kids are loving being able to find so many good movies to watch via Hulu Plus, Netflix, and Amazon Prime.  Nice job.", "verified": true, "helpfulness": "0/0", "author": "PriscillaO"}, {"rating": 4.0, "review": "Other reviews here do a good job of describing the products pros & cons. I am happy with the purchase and think it delivered on what it was supposed to.", "verified": true, "helpfulness": "0/0", "author": "Kevin Severance"}, {"rating": 5.0, "review": "Easy to use...it works well.", "verified": true, "helpfulness": "0/0", "author": "Nancy Maulsby"}, {"rating": 3.0, "review": "Definately runs a little slow on loading your Netflix main page but def will save electricity verses the ps4 so I'm satisfied", "verified": false, "helpfulness": "0/0", "author": "Heather Hodge"}, {"rating": 5.0, "review": "Great - absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "asnake77"}, {"rating": 4.0, "review": "Great substitute for larger version.  Takes a long time to boot when unplugged and plugged again.", "verified": true, "helpfulness": "0/0", "author": "Alexandro Camarena \"Alex C.\""}]