[{"rating": 5.0, "review": "Talk about plug and play! I love this alternative to expensive cable. I love that I choose the channels I want to watch! I love the sleek, slim design and I love the remote. There is so much free programming available, it just makes sense to have your own Romulus.  I highly recommend Roku. You will not regret this purchase!", "verified": true, "helpfulness": "0/0", "author": "CharlieGirl \"Listener10\""}, {"rating": 5.0, "review": "Worked well. Easy set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I could not be happier.  So easy to set up and operate it is amazing.  I will probably buy several more.", "verified": true, "helpfulness": "0/0", "author": "John W Chaplin"}, {"rating": 5.0, "review": "Awesome I can watch my Netflix purchases on my TV", "verified": true, "helpfulness": "0/0", "author": "Carlene1"}, {"rating": 5.0, "review": "Great!  Goodbye high cable cost. Now we only have the Internet and still get to watch great shows.", "verified": true, "helpfulness": "0/0", "author": "Darlene"}, {"rating": 5.0, "review": "yes easy to use.", "verified": true, "helpfulness": "0/0", "author": "katherine"}, {"rating": 1.0, "review": "I purchased 2 refurbished Roku sticks from this seller and they were great, but one of them stopped working this week. We did nothing to the stick. It was just plugged into the back of our TV. Was working fine one day and the next day it was on the set up screen and would not move past the language set up screen. I emailed the seller to ask if he/she would be willing to let me send the stick back in the original box with all original packaging and have yet to receive a reply (I know I am outside of the return timeframe as it's been several months). When I purchase something, I expect it to last more than 3-4 months w/o breaking, so yes, I am a little irritated and would like a replacement. If this seller is ethical by an means, then I am hoping they will agree to let me return their bunk item and exchange it for a working item.", "verified": true, "helpfulness": "1/1", "author": "Heather L."}, {"rating": 4.0, "review": "Just a regular Roku device. works great and does what a Roku should.", "verified": true, "helpfulness": "0/0", "author": "J. Mayberry \"Neen\""}, {"rating": 5.0, "review": "daughter loves it", "verified": true, "helpfulness": "0/0", "author": "robert w jarrett"}, {"rating": 5.0, "review": "This is the best purchase i've ever made!", "verified": true, "helpfulness": "0/0", "author": "Elisabeth Bethi"}]