[{"rating": 1.0, "review": "Worked fine for awhile, then just totally stopped working after a little over 3 months. This was the 2nd roku I bought, as I loved it so much on my bedroom tv, I wanted another for the family room. I've had my other roku from Walmart for almost a year with NO ISSUES! This one convieniently crapped out about a week after the 90 day \"warranty period\". Typical. I wish I had just bought another brand new one from Walmart or wherever instead.", "verified": true, "helpfulness": "0/0", "author": "D. Sullivan"}, {"rating": 5.0, "review": "Awesome product! I love the roku! Easy to use and set up and lots of channels to stream from! Thanks!", "verified": true, "helpfulness": "0/0", "author": "KT"}, {"rating": 2.0, "review": "Too slow to load.", "verified": true, "helpfulness": "0/0", "author": "T. Brock"}, {"rating": 1.0, "review": "I am very disappointed. I got the refurbished version and the remote worked at first but eventually it completely stopped working before I got finished with the set up. I even tried replacing the batteries. This is ridiculous.", "verified": true, "helpfulness": "0/0", "author": "Alyssa"}, {"rating": 5.0, "review": "My husband was very skeptical at first , but now he loves it. We cut our cable more than in half!!!!", "verified": true, "helpfulness": "0/0", "author": "Julie wikle"}, {"rating": 1.0, "review": "This device is very frustrating to use. The remote frequently loses connection and becomes unresponsive for minutes at a time. The apps running on the device are extremely sluggish and fickle. They often fail to load forcing me to sign out of them completely then sign in again. Or else completely delete the app and reinstall it. Though sometimes the Roku won't even let me uninstall an app. The streaming is unreliable—even with a solid internet connection. When it's working well it is a passable device. But it runs poorly so often that it's not worth the frustration.", "verified": false, "helpfulness": "0/0", "author": "DB"}, {"rating": 3.0, "review": "Waiting for grandson to set up for me.", "verified": true, "helpfulness": "0/0", "author": "Elaine Carter"}, {"rating": 5.0, "review": "Just awesome", "verified": true, "helpfulness": "0/0", "author": "Jennifer cozzitorto"}, {"rating": 1.0, "review": "loading works continuously and never comes up. I have tried in five home same result.unable to find the error.Joe Marvin", "verified": true, "helpfulness": "0/0", "author": "Joseph Marvin"}, {"rating": 5.0, "review": "My bro loved it as he can now watch netflix on his big screen without using his laptop.", "verified": true, "helpfulness": "0/0", "author": "Salvador E Sanchez"}]