[{"rating": 5.0, "review": "Got sick of LG TV Smart TV apps being so slow and clunky. I wanted a faster easier way to stream and this device does the trick. Love it!", "verified": true, "helpfulness": "4/4", "author": "Aggiebill"}, {"rating": 5.0, "review": "Love it. I took it out of the box plug it to the TV and 2 seconds later we were watching a movie. Very Happy...", "verified": true, "helpfulness": "2/2", "author": "Daniela Kennedy"}, {"rating": 5.0, "review": "Love the streaming stick! It does everything I want a media player to do. Install the PLEX app -- it is a godsend. Netflix works wonderfully. A lot of the other apps work great too, but PLEX and Netflix alone make it worth the purchase in my book.", "verified": true, "helpfulness": "2/2", "author": "J. Phillip Anderson"}, {"rating": 3.0, "review": "It is very sleek and easy to configure/install.The ease of installation is inversely proportional to the time taken to start the device. Its way too long for comfort.Once it starts the apps take their own sweet time to start up specially YouTube.Not sure if Youtube start up can be improved since it is a Google app but initial boot up time should be definitely improved.I don't have Roku 3 so cannot say how quick is that.But compared to Chromecast, Roku seems ages behind..", "verified": true, "helpfulness": "2/2", "author": "Prady"}, {"rating": 5.0, "review": "It's a quick hook up and I love being able to carry it on the go.Like any new Roku setting up all of your account information on Netflix, Hulu, Amazon and so on will take some time to punch in. I highly recommend downloading their \"Remote App\" it's faster using your cell phone keyboard.I plan on buying 2 more for family members. Great price!", "verified": true, "helpfulness": "1/1", "author": "PC4U"}, {"rating": 1.0, "review": "it is very slow, do not reccomend to people that dont have a lot of time to browse. dvr is very better", "verified": true, "helpfulness": "3/5", "author": "steven c wilson"}, {"rating": 5.0, "review": "If you use MLB.tv or have NBA League pass this thing is amazing.  1080p video for live sports is great.  HBOgo and Showtime Anytime, Netflix, and all the various channels are just a plus.  Well worth $50.00.", "verified": true, "helpfulness": "0/0", "author": "Richard Hossli"}, {"rating": 5.0, "review": "We got this after becoming fed up with the crap-tastic apps and interface on our internet-connected Blu Ray player. It's pretty much perfect. Setup was an absolute breeze; I spent more time untangling cords and unplugging things to make room for the power adapter than I did actually configuring it. Awesome app/channel selection. Having a remote that doesn't require line-of-site is a bigger benefit than you might initially imagine; no more trying to shoo the cats away from an IR receiver!As this was of particular interest to me, let me talk about streaming your personal media collection with this gadget. Yes, you can, fairly easily. It requires a third-party application called Plex, which I think ends up costing $5 after a 30-day trial. It's fairly easy to configure, with the trickiest part being mastering the file naming conventions it uses. Once you've got that set up, the Roku provides a very slick method of organizing and watching your media collection on your TV.About my only complaint is that the quicklink buttons on the remote aren't reprogrammable. I mean, Blockbuster? Really? Is it still the 90s somewhere? I'd much rather have a Hulu button.", "verified": true, "helpfulness": "1/1", "author": "D. Perrine"}, {"rating": 5.0, "review": "If you don't know about Roku, wake up! This is the best iteration yet-awesome software and hdmi hardware. 2minor issues: it's not a dongle so it might not fit hanging tvs with ports in back. Also, no phone or Pc mirroring, but you can beam files.", "verified": true, "helpfulness": "1/1", "author": "Batman3030"}, {"rating": 4.0, "review": "Would have been 5 stars.but only works On some tv's, we had to pick and choose which tv based on software even though all tv's have hdmi.", "verified": true, "helpfulness": "0/0", "author": "sereniti"}]