[{"rating": 4.0, "review": "I took one bar out because it does not have a button to turn it off. I think is on all the time.", "verified": false, "helpfulness": "0/0", "author": "Accounting Assistant"}, {"rating": 5.0, "review": "Initially, I had my questions, as I wasn't certain of my ability for the WiFi connection in my area. Purchased a western digital, bought the device, hooked it up following the directions and we are cooking with gas!This roku is more than expected. Have satellite with 500+ channels and there's really few worth watching. Roku offers such diverse channels that we watch it more than the other. May consider disconnecting from the other, but we do like a few that are offered , so not ready to disconnect yet. The more Roku brings online, the happier we will be. I am surprised other channels haven't signed up. I'm not into chromecast. Roku is the best.Youtube, can broadcast thru the Roku from the app, adding to or switching videos at anytime. The best!If you are considering purchasing this device, you won't be disappointed!", "verified": true, "helpfulness": "0/0", "author": "J. Ricks"}, {"rating": 5.0, "review": "We already have a roku 3 system- this allows us to access the programming in a second room.  Works great.", "verified": true, "helpfulness": "0/0", "author": "orangebonnies"}, {"rating": 4.0, "review": "It took a while to get this set up and I still can't get the sound to come through my sound bar but now it works and the picture is very good so I'm happy.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth S. Rock"}, {"rating": 1.0, "review": "I sent email to roku asking if i can use roku in Colombia, and they answer me, yes \"you can do it\". Now when i purchased one roku player and try to search channels like netflix without success, they say me, \"channels like Netflix, Amazon, Hulu Plus and other premium channels could not be accessed outside United States, UK, Ireland and Canada through Roku since these channels are Geo-Restricted channels\". this are hoaxes, i have netflix in other devices without any problems.", "verified": true, "helpfulness": "3/4", "author": "Mario S."}, {"rating": 3.0, "review": "Love the streaming stick! I just recently cut the cable cord and this Roku has everything we need to watch Television.  Tons of great chanels and my kids and I love it.  The only thing I wish it had was voice recognition to search b/c my 7 year old has a hard time trying to use the remote to spell.  For the money though, this is a great option.  I will be pairing this with the Chromecast eventually.  This is where it is at folks.the remote on this sucks! it freezes up and you have to reset it all the time. We don't even use this anymore b/c of the remote/", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "I was deciding between this and the Chromecast and ended up choosing the Roku, best decision i could have made. The search tool is extremely effective and the number of channels is insane! the only negative is the rather long load times.", "verified": true, "helpfulness": "0/0", "author": "Michael Bower"}, {"rating": 5.0, "review": "Love it, easy to use.  Have recommended to friends who do not have a Smart TV.  Neflix my favorite.  Great idea for a gift.", "verified": true, "helpfulness": "0/0", "author": "Deb"}, {"rating": 5.0, "review": "I have two of the older Rokus, I also have a dvd player with instant streaming. But, I love this item, and will be replacing the other items with this.", "verified": true, "helpfulness": "0/0", "author": "Georgie Smith"}, {"rating": 4.0, "review": "small whine in audio when I use the TV's usb for power. Other than that I like it a lot", "verified": true, "helpfulness": "0/0", "author": "Norm From Ft Walton Bch"}]