[{"rating": 5.0, "review": "Good shipping and product", "verified": true, "helpfulness": "0/0", "author": "Nicholas Ferriero"}, {"rating": 4.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Lawrence Sackett"}, {"rating": 1.0, "review": "I work in IT, and I've tried for about 6 collective hours now to get this thing setup.  At first, it would connect to the wireless network, home network, and internet, then error out with code 011.  Then i talked to support and they told me about the secret screens.  I have tried everything.  I finally got it to update software and now it's giving me a code so i can link the device to my roku account.  ALL of the link sites that i've cycled through are unavailable.  I talked to customer support and they said their servers are down at this moment (but hello, i've been troubleshooting over the course of 18 hours, WHO has ALL of their servers down at the same time for upgrades?  That's why you have more than one server in the first place! Contingency and redundancy!).  Their live chat customer service use canned responses, which is annoying. If I cannot get this fixed by tomorrow, I will be returning the device and getting a firestick or chromecast.  I wanted this bc it offers both amazon and google apps, but Roku needs to get their crap together.", "verified": true, "helpfulness": "2/2", "author": "Sarah Shaw"}, {"rating": 5.0, "review": "Love the price looks new", "verified": true, "helpfulness": "0/0", "author": "Eddy R"}, {"rating": 5.0, "review": "Much better then expected.", "verified": true, "helpfulness": "0/0", "author": "Richard Herod"}, {"rating": 4.0, "review": "Great device. Works well with my Android phone. The start up time and processing speed does lag a tiny bit at times but nothing to be concerned about. It was a toss up for me between this and the Chromecast. I've used both now and the extra features this one has (select TV episodes & Spotify capabilities), if you're like me and don't get cable, are worth it.", "verified": true, "helpfulness": "0/0", "author": "Cannon"}, {"rating": 5.0, "review": "👍👍👍", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Its great for our purposes, but the UI is a tiny tiny bit laggy sometimes.", "verified": true, "helpfulness": "0/0", "author": "Alex 'B2'"}, {"rating": 1.0, "review": "Froze would not even load anything. I do not recommend this product at all", "verified": true, "helpfulness": "0/0", "author": "cory finn"}, {"rating": 5.0, "review": "Our first refurbished unit had a wonky remote, so we returned it. Amazon shipped out a replacement in record time and our UPS guy took the original back when the new one was delivered, so we didn't have to be without TV for days.That said, I much prefer the Roku to Amazon Fire TV. The interface is smoother and the remote is sturdier. Amazon's extra free channels are all pretty bad -- just youtube videos -- and they take forever to load. There are thousands of channels you can get for the Roku, and while some of them are youtube videos, they load in a reasonable amount of time.", "verified": true, "helpfulness": "0/0", "author": "Dennis"}]