[{"rating": 3.0, "review": "As I'm still using the device, I hope to update this as issues come and go.When I first unboxed the stick, I was pleased. I finally had a device to do what I was doing on my laptop, which died. Setup was quick, and before I knew it I was watching Netflix. Now, though, there is an issue. I'm not sure how the issue came about or why, and I've yet to find someone with the same problem.My streaming stick has gone through initial setup 6 times in the last 3 days. I'm not sure what's causing it (lost wifi connection, restarting itself, cat bumping TV while I'm at work), but I don't like having to wait on all my apps to load to watch netflix because once again I have to go through the initual setup process.It's become more than just a headache at this point: it's become a hassle. A hassle I'm seriously starting to re-consider. I should have gone with one of the more stable Roku boxes. The 1 and 2 are roughly around the same price as the streaming stick.I wonder if this is even something that an update can fix, or perhaps I'm just doomed to go through initial setup with this thing for the rest of my days.", "verified": true, "helpfulness": "0/0", "author": "Carol Whitt"}, {"rating": 5.0, "review": "I haven't had a single issue with my Roku stick. It has a lot more channels that my Chromecast (so far) and it's ridiculous how comfortable the remote is. I have to grab it from my kids because they like the feel of it so much though.My favorite thing, and this is a big difference between the Roku and the Chromecast, is that the Roku will keep track of more than one Wifi network. In my house it means I can use both my main wifi, and then go back to my repeater which is on a different network, and it will automatically make the switch. The Chromecast, as of this review, requires you to completely reconfigure it if you go from one network to another. With the Roku I can also go to a friend's and it will remember their Wifi. Great stuff, and a surprising omission from the Chromecast.I highly recommend this!", "verified": true, "helpfulness": "0/0", "author": "Ethan \"A wide variety of interests. Or flaky, take your pick.\""}, {"rating": 5.0, "review": "I'm always Leary about new stuff but I must say for the price this was a good investment. The stick arrived in 2 days and I was quite impressed with the packaging and the quality of the product. Read the instructions a few times and proceeded to install. I plugged the stick into the TV, powered up the set, changed hdmi input and away we go. Once plugged in you go through a few set up questions, get your laptop and go to roku site and enter info and boom its done. It now goes through a software update down load which I found amusing. It was like having scotty from star trek communicating with you. Once that's done start watching. There is a setting icon that asks if you want 720 or 1080 and stereo or surround sound. Picture and sound quality was excellent. Total time for everything was about half and hour.", "verified": true, "helpfulness": "0/0", "author": "Peter Palagonia \"peterpal\""}, {"rating": 5.0, "review": "works as well as Roku 3 at half the cost, good app store.  Easy to set up and use, not difficult to use for children either.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Gauthier"}, {"rating": 5.0, "review": "Ordered this product and it came as promised. Hooked it up easily and I'm not a tech person. Love the free channels they offer. The wand is so easy to set up. Less than 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "Terri Shorter"}, {"rating": 4.0, "review": "Most of the negative reviews on this probably stem from customers poor internet bandwidth and/or outdated wifi router. Anytime a device is WIFI only, people are going to complain. Having said that, yes there are some issues engrained on this device. I have experienced the slow Netflix start, but that has more to do with the Netflix product than the Roku stick, it seems like the Netflix release for this was rushed. Other apps load lightning fast. I’ve yet to experience any sort of lag, buffering, or choppy video. I mainly bought this to replace my apple TV 3 which is sorely lacking in channel choices, mainly the Plex app. Speaking of plex, I can stream full 1080p video without a hitch to the stick. HBO GO is amazing (when their servers aren’t going nuts from demand). I am giving this 4 stars because the interface is wildly out of date, especially the keyboard, plex descriptions, and other aspects that remind me of using windows media player in the windows millennium days. This is a great and minimal device that has functionality that will astound you based on its size, but I am impatiently awaiting a software update to address some of its caveats.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 1.0, "review": "Takes at least a minute to power on (only an issue if powered by the TV's USB port, if you power it via the AC adapter it's always on)Loading the Netflix app takes about 30-40 seconds. It gets annoying if you use multiple streaming services.The rounded base of the remote feels nice in the hand, but limits where you can set it. Want to leave it on the arm of the couch? There's a good chance it'll roll off. I've gotten in the habit of setting it face down to keep it from moving.This was supposed to replace my 3 year old Roku XD 2050 (which doesn't support alternate language or subtitle streams), but in many ways the 3500R is actually slower.I'll give it another week, but this device gives me no compelling reason to keep it.", "verified": true, "helpfulness": "4/6", "author": "sparx."}, {"rating": 5.0, "review": "High speed internet and HDM! interface a must!  Both my wife and I enjoy the options roku offers. What a buffet of choices.We have a plan and Roku is a big part of the plan---we have a roku 2 and the slick trick streaming stick. Get wired.", "verified": true, "helpfulness": "0/0", "author": "Macado"}, {"rating": 1.0, "review": "Amazon was amazing, as always. I received my device pretty quickly, incredibly excited to start using it on my 1080p TV. (That has two HDMI inputs and usb port). Plug it in, and nothing. Try to troubleshoot it myself, changing inputs, plugging in my laptop via usb to make sure there was no error with the ports themselves, tried power with usb port and wall adapter, etc. Nothing worked. So I went to chat. 20 minute wait, not a big deal. Finally connected to someone, and after giving them my TV brand and model number, and listing everything I've tried, the only things they did to \"help\" were to insist I do all of the things I tried again at least three times each for almost an hour and a half. During the conversation I asked multiple times if my TV wasn't compatible, even though meeting all requirements on the site. I even asked half an hour in if they were going to help me do anything other than what I suggested because I didn't really want to continue wasting my time. They insisted they'd get it figured out and proceeded to keep suggesting the same things over and over for an additional 45 minutes to an hour. This is probably getting returned unless it miraculously begins functioning.", "verified": true, "helpfulness": "68/75", "author": "Cassandra Warn"}, {"rating": 3.0, "review": "The product might be all tight, but I've not been able to use it.Roku's website claims that if one sends an email request, one would get an HDMI Extender, so that the stick would be easy to plug in.  I sent a request on 04.04/14; nothing happened.  I resent the request on 04/10/14.So far no answers, no deliveries.Thus, only three stars.", "verified": true, "helpfulness": "0/0", "author": "SOR \"SOR\""}]