[{"rating": 4.0, "review": "Love all of Roku products but the stick needs external power to operate. Not seen in photos.", "verified": true, "helpfulness": "0/0", "author": "J_A_R"}, {"rating": 5.0, "review": "It's a good alternative to our old hockey puck Roku, and it works just as well for us since we don't need to play any stored content. The best part is the dedicated Amazon Instant button that has been missing on Roku remotes for so long.", "verified": true, "helpfulness": "0/0", "author": "Anthony A."}, {"rating": 4.0, "review": "Exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "Shannon Wallace"}, {"rating": 4.0, "review": "No real issues. Only had ro reset it once so far.", "verified": true, "helpfulness": "0/0", "author": "J. Kent"}, {"rating": 5.0, "review": "I was very hesitant in buying this because I wasn't sure if I would like the Kindle Stick better but I love my Roku. My button on my remote sometimes sticks but other than that this thing is great. I love it. I don't have a very nice Tv with the HD and everything but it still works great.", "verified": true, "helpfulness": "0/0", "author": "Kaity"}, {"rating": 5.0, "review": "Works perfectly..!!", "verified": true, "helpfulness": "0/0", "author": "Sayan Banerjee"}, {"rating": 5.0, "review": "Love it!!! Goodbye cable!!", "verified": true, "helpfulness": "0/0", "author": "jbuck"}, {"rating": 1.0, "review": "I'm on my second Roku stick.  It's buggy and locks up.  Don't be swayed by the stick and the price.  You will regret it.  Have spent many hours with customer service and they won't give me a refund.  They want to send me a 3rd one instead.  I said no.", "verified": true, "helpfulness": "0/0", "author": "momof3"}, {"rating": 5.0, "review": "Roku rocks!  This was a great refurbished unit, came in packaging just like it was new.  Very easy to install and use.  Within 15 minutes I was watching free programs.  The device is very responsive.  One drawback is the remote is Bluetooth which is cool but it doesn't work with my Harmony remote as it is IR only.  There is a ton of free programming that is worth the investment into the device.  I am very happy.", "verified": true, "helpfulness": "0/0", "author": "Bruce Fyfe"}, {"rating": 4.0, "review": "This is my 5th Roku purchase and I will consider more in the future. I have 4 of previous generation devices, Roku LT, Roku XSs, and Roku 2 XD, and they still work well. Two issues I have with these older devices are no Netflix Profile support and painfully slow YouTube app. Thus this new Roku purchase. It definitely solved the Netflix Profile support issue but YouTube is still very slow. If you are regular user of this, I would consider Roku 3 or possibly Amazon Fire TV. I was going to say Fire TV Stick but I am having a bit of issue with that one as well. You can refer to my review of Stick TV for details. Otherwise, Roku Stick is a great product that I would recommend to anyone, even non-techies.", "verified": true, "helpfulness": "0/0", "author": "YH Shon"}]