[{"rating": 5.0, "review": "Roku has the best interface of the streaming devices IMO. The refurbished stick worked flawlessly out of the box for me, but you should always inspect/test refurbished products as soon as they arrive just in case.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 4.0, "review": "Works very well.  Can't tell it's not new.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I cut my cable OFF and got a ROKU!  I stuck this into the back of my TV, but I did need my techy son's help with the setup.  I'm not missing the $100 a month cable bill.  I also got an antenna so I could pick up local channels.  Bye bye Cable Company!", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 4.0, "review": "ThIs roku is great as long as you don't use it too far from the riuter. I love it in my living room but my daughter can't use it at all in her room. I have also heard allot about speed but I feel that it is fast enough and gets the job done for what we need. I would definitely recommend.", "verified": true, "helpfulness": "0/1", "author": "christian"}, {"rating": 5.0, "review": "I love it , i mainly use it only for sling tv and amazon Prime", "verified": true, "helpfulness": "0/1", "author": "Omaha Techie \"I love trying out new tech!\""}, {"rating": 5.0, "review": "Disconnected my cable, and thanks to this little gadget, I have access to all kinds of things. It's easy to use for a woman. Just plug it in and then set up an account on the internet, and then enter data into the TV the first time. Very simple and easy to use, and saving me a ton of money.", "verified": true, "helpfulness": "1/2", "author": "Jenni"}, {"rating": 5.0, "review": "as an installer I highly recommend roku. I get these for my customers all the time and no complaints. Works great with Harmony universal remotes.", "verified": true, "helpfulness": "1/1", "author": "Matthew J Hart"}, {"rating": 3.0, "review": "I received the refurbished one today. The cable (included was defective). So I bought a new cable (usb) at the office supply store ($10). I could have bought a brand new Roku for almost the same dollars I have spent on the refurb version + the usb cable. I bought a brand new Roku Stick in May. I was thrilled with it. So I bought the refurb for the bedroom tv (so I wouldn't have to move the other one back and forth). The refurb seems like it's a previous model. doesn't seem as fast to load and the remote is a bit different.also, the picture quality doesn't seem as good as the new one i purchased. if it continues to function properly,  i am giving it an \"OK\" rating (3 star). The new one I purchased would get the 5 star rating!  I am satisfied enough that i purchased the new cable (usb) just so I wouldn't have to send it back. However if I had read a review such as the one i am writing, i would opt to purchase a new one for $48. However, chances are, your refurb would work well and the cable would not be defective. I love the roku devices in general, however like all electronic companies they have some duds in the batch. And this one was clearly marked refurbished. I usually have great luck with refurbished items. This wasn't a bust, just not as perfect as the new one. I would recommend, just note what i have written above.", "verified": true, "helpfulness": "2/2", "author": "Bad Mackrel"}, {"rating": 3.0, "review": "Started a bit rough, you have to set up an account, another account among the million I already have.  Then they want your credit card!!  Took me half hour on hold to get all the reasons I should put a CC on account.  Finally got the no CC link from customer support.It started to look worth it for a bit, lots of apps and when it plays HD video it is WAY better than the TV's default apps.The problem is it won't play for very long.  We have yet to get Netflix to actually play.  The stick reboots all the time, like literally every time in the Netflix app and we have gotten nothing to play.  Hulu plays pretty well, but eventually the stick just starts rebooting, checking shows how hot it is at that point.  Youtube plays well, the GF is liking Crackle and some others.  If the Netflix thing is persistent this is going back.", "verified": true, "helpfulness": "0/0", "author": "sablesurfer"}, {"rating": 3.0, "review": "I really like the ability to be able to stream. But I have had to return the remote two times. Once because I was constantly having to take out the batteries and put them back in to get it to work. The replacement remote didn't work at all. Now using the 3rd one, and still have to remove the batteries sometimes to get it to work.", "verified": true, "helpfulness": "0/0", "author": "Peggy Shipley"}]