[{"rating": 5.0, "review": "Good product!", "verified": true, "helpfulness": "0/0", "author": "yajaira Diaz"}, {"rating": 5.0, "review": "Works every bit as good as my Roku 3, maybe better as it boots much faster.", "verified": true, "helpfulness": "0/0", "author": "Wolfster101"}, {"rating": 4.0, "review": "I love this streaming stick. Easy to use, hassle free. The Only reason that I did not give it 5 stars is because it is a little slow. Other than that, its perfect.", "verified": true, "helpfulness": "0/0", "author": "CG dude \"I'm a soldier armed with Audio books in my eternal and brutal \"Commuting wars...\"\""}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Chip"}, {"rating": 3.0, "review": "Anything streamed from my phone is glitch.  Disappointed. Will be sending it back.", "verified": true, "helpfulness": "1/1", "author": "Angelina G. Rafatti"}, {"rating": 2.0, "review": "did not work sent back", "verified": true, "helpfulness": "1/1", "author": "Pop's  Ronning"}, {"rating": 4.0, "review": "Love it such a nice alternative", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 3.0, "review": "The streaming stick is great.  Need to check before you buy; whether your local area stations are streaming live.  Mine were not and I do like to hear news and weather as it is happening.", "verified": true, "helpfulness": "0/0", "author": "Cathleen Simon"}, {"rating": 1.0, "review": "I have been double billed and then triple billed by Roku. I purchased a yearly subscription for a channel that was $79.99. Upon reviewing my bank statement I found two charges for 79.99 and a single charge for 7.99. I contacted Roku support and after 15 minutes of trying to explain the issue to the representative (she was dead set upon explaining the difference of a yearly subscription vs a monthly subscription) was told that they need 5-7 business days to \"escalate your issue.\" On day 6 I opened a chat with their representative online and asked what was happening. I was told a supervisor would return my call by days end. They never called. On day 8 I again opened a chat online with them. I was told \"the concerned parties\" were looking into my problem and that I needed to wait more. They would need a couple more days. I explained that I wasn't interested in waiting any longer. I ended that chat and called. The representative said that in order to move any faster in this operation I needed to send in my bank statements. I became pretty distressed as I had to wonder what they had been doing for the last 8 days to resolve my issue? I requested they just refund my yearly charge as well as my monthly charge as the channel I purchased would still be functional because they had the original billed amount. I was put on hold many times and each time a representative came back I was told that my issue had taken a higher step in the escalating process. I explained that I was not willing to wait, After 27 minutes on hold a supervisor came onto the line.I was told I need to email my bank statements and wait longer. Even though they can clearly see in my account that they have double billed me. I also own the Amazon Fire Box and stick. The only reason I ordered ROKU was they offer the Acorn channel and Amazon does not. If you are not in need of ths channel I would stick to Amazon as they have never billed me inaccurately.", "verified": true, "helpfulness": "0/0", "author": "Staci"}, {"rating": 2.0, "review": "Could not get to work", "verified": true, "helpfulness": "1/1", "author": "Paula Fenton"}]