[{"rating": 2.0, "review": "Absolutely love my roku. Would give it 5 stars except the damned remote keeps \"jamming\" where I have to remove the batteries and put them back in. End up doing this several times each day.", "verified": true, "helpfulness": "1/1", "author": "Lisa A. Penree"}, {"rating": 5.0, "review": "Haven't had this long but so far I love this thing! I mostly use it for Netflix and also listen to Pandora through it. I haven't gotten/taken the opportunity to use any of the free channels yet but I'm sure they will be fine as well. I have a Visio TV that this pairs up with, with no problems; instillation was super easy! I bought my TV right before smart TV's became popular, so my TV is still in perfect condition, I had a hard time justifying spending the money to upgrade to a smart TV; this is the perfect solution that saved me hundreds of dollars!", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 5.0, "review": "We bought this for our business TV. We have them at home too. We love our Roku stuff!!", "verified": true, "helpfulness": "0/0", "author": "mcgrane21"}, {"rating": 4.0, "review": "Use it everyday.Pros:A plethora of programming! Netflix, BYUTv, Amazon, Blockbuster, Plex, PBS, and hundreds more.Good speeds with a strong wireless signal.Love the Roku app on our android devices.  Always good when the kids 'hide' the remote.Cons:Slow sometimes, especially when booting and first launching Netflix.The remote doesn't always work for me, though I've noticed that it works much better since relocating my router to the same room as the Roku stick (not sure why).My opinion is that the Roku 3 may be a better investment since it has wireless and wired options.", "verified": true, "helpfulness": "0/0", "author": "bennyboy"}, {"rating": 3.0, "review": "Too confusing to be useful.", "verified": true, "helpfulness": "0/0", "author": "Patricia L. Rehfield"}, {"rating": 2.0, "review": "This was a replacement for my last Roku which unexpectedly died. It works fine except for two issues. First, its plugged into the side slot of my tv. Its sometimes difficult to use unless you're off to that side of the tv and at the same level. Also the remote eats batteries, I've already gone through 3 sets in as many months. There's a phone app to control that works but I'm frequently on my phone while watching tv so...Update. I just looked for cheap remotes to replace this one. Only the $32 original remotes will work with the stick. With all other roku devices you can buy cheap remotes to replace but not this one... I wouldn't buy it again.", "verified": true, "helpfulness": "1/1", "author": "Bill"}, {"rating": 5.0, "review": "This was exactly what we needed to stream Netflix!", "verified": true, "helpfulness": "0/0", "author": "Judith A. Pilgrim"}, {"rating": 5.0, "review": "awesome streaming stick! I recommend this to everyone. it hides behind the tv, which is why my kids probably haven't stolen it yet! They can't find it. Use the smartphone app for easier searching.", "verified": true, "helpfulness": "0/0", "author": "J Leibensperger \"L.B.\""}, {"rating": 3.0, "review": "Slow I would have got the Fire stick if it was available. I have the roku 3 it runs like a dream.", "verified": true, "helpfulness": "1/1", "author": "Kyle"}, {"rating": 5.0, "review": "Amazing ! I absolutely love it!", "verified": false, "helpfulness": "0/0", "author": "SarahBoo"}]