[{"rating": 5.0, "review": "I just received the roku streaming stick today, and one thing I already love about this is that it was delivered to me a week before estimated. it was packaged tight in a small secure box. I already have a roku player and my mom loves it, so I figured I'd surprise her with this for her new tv. I will be installing it soon, and it looks simple and easy to do. you open the box and the stick is in there, the remote, and a usb plug and directions. really pleased with this.", "verified": true, "helpfulness": "0/0", "author": "shania"}, {"rating": 5.0, "review": "Outstanding & convenient device with an excellent remote & great price, much better the Chromecast which does not have a remote.Great product.  Only one where the VEVO app works-does not work in Apple TV, Samsung Smart TV-all off them stall.  Would definitely recommend it.Wish it had mirroring for PC or Apple-but this is not Roku's fault.", "verified": true, "helpfulness": "0/1", "author": "SD"}, {"rating": 5.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "Jane Oliver"}, {"rating": 3.0, "review": "Was excited to receive ROKU, had no problem hooking it up. A few weeks using it I experienced problems with blue screen. Played around with it for a few days and un plugged from the wall socket and now it is working just file. Instructions are easy to follow, I don't watch a lot of cable except for a few shows and was disappointed to find out now I have to pay for those shows that I thought I would get for free. So canceling my cable at this time is not an option. I have not checked into how much each program will run me on a monthly basis, and it could be less than what I am paying for cable, and will check into that shortly.Pauletta in Phoenix AZ", "verified": true, "helpfulness": "0/0", "author": "Pauletta"}, {"rating": 3.0, "review": "have to reset the contotrol very often to get it working again.", "verified": true, "helpfulness": "0/0", "author": "sabah malak"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Jill Miller"}, {"rating": 5.0, "review": "OPERATES AS ADVERTIZED AND MAYBE A BIT MORE. ONCE YOU FULLY APPRECIATED WHAT THIS LITTLE DEVICE CAN DO IT SAVED ME 1400 DOLLARS A YEAR. I DROPPED THE PAID TV AND NO ONE IN THE FAMILY COMPLAINED A TESTAMENT TO WHAT THE LITTLE STICK CAN DELIVER WITHOUT COST!", "verified": true, "helpfulness": "0/0", "author": "Rock"}, {"rating": 2.0, "review": "Very slow, get Roku 3 if u don't want to wait 1-2sec for it to respond after u hit a button", "verified": true, "helpfulness": "0/0", "author": "oleksandr sushchenko"}, {"rating": 1.0, "review": "Opened Christmas morning and worked fine for a month or so. Set up was unnecessarily long as many settings had to be entered multiply times before they would save. Started having network connection problems in late February even though nothing else in the house was having problems with the network. By the end of March, just after the warranty expired, the Roku would not load past the start up screen. No quality, no customer support, no more products from Roku for this family.  Very disappointed - did NOT live up to the name!", "verified": true, "helpfulness": "0/1", "author": "B. Caton \"Techie-mom\""}, {"rating": 5.0, "review": "Had some problems with my Internet provider's firewall. But it works great now.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]