[{"rating": 1.0, "review": "I ordered the Roku stick due to its price and that my Roku HD died after a year of use.Well..SURPISE...my Roku stick is now deceased as well after only 4 months. After scouring the internet for resets, trying all the suggestings...my Roku purchased here on Amazon is now worthless. It freezes the screen every 8 seconds (while moving forward inside the stick causing me to miss whole scenes). I'll now just stick to streaming from my Xbox One. No more Roku. And yes Amazon, my batteries in the remote are fresh.", "verified": true, "helpfulness": "1/2", "author": "mikeco3030"}, {"rating": 4.0, "review": "This is a great addition to the roku line of products. Unlike the chromecast this has an actual menu and interface. also comes with remote. Saves a lot of space, Tons of apps. Apps do take much longer to load vs the traditional style rokus, also for 5.1 you will have to hook directly to receiver. For the price though you cant beat this product.", "verified": true, "helpfulness": "0/0", "author": "HelloFallAllergies"}, {"rating": 2.0, "review": "This is a great concept and works on most TV's but I have a 65\" Panasonic TV and it conflicts with the remote and will NOT work. This is very upsetting because this is the room I actually bought the ROKU for.  I cannot recommend to anyone because of this.", "verified": true, "helpfulness": "0/0", "author": "vance elliott"}, {"rating": 4.0, "review": "I really only wanted to access Netflix on my TV w/o having to constantly hook up my Ipad.There's a point during the initial setup where you're required to go to the Roku website & createa username/password, etc. Then you must enter your credit card info. There didn't appear to beanyway to avoid or skip this step.", "verified": true, "helpfulness": "1/1", "author": "RoB"}, {"rating": 5.0, "review": "I have to admit, I only purchased this out of peer pressure and simple curiosity. I have been a die hard Apple fan and have my house wired up with the Apple ecosystem, including 2 Apple TV boxes, so this was a definite switch for me. To add to my uncertainty, I purchased this as a preorder before there were any reviews or feedback on it, so me, I was living on the edge. Best decision ever!The setup was simple, I plugged it directly into my AVR and it automagically started working. After that, the intuitive interface guided me through creating an account and within minutes I was watching TV. The only problem I have had with it is prying myself away from it and forcing myself to use the Apple TV in the other rooms.Since I now own both Roku and Apple TV, and used both for a while, here are the major differences that I see between them:Apple TV better integrates with the Apple ecosystem by allowing streaming from iTunesRoku offers a far better remote, much easier, functional and intuitive than the Apple remoteThe Roku remote seems more responsive and less touchy than the Apple remoteRoku offers far more media content providers than Apple, this alone makes it a winner in my bookYou can stream Amazon Prime videos on Roku, shame on Apple for not offering itRoku is virtually invisible as it is a tiny stick that plugs into the back of the TV or AVR - Apple requires a box to be placed in a visual locationOther than that, they are very much alike, If I had the need to purchase another device, hands down it would be a Roku.", "verified": true, "helpfulness": "1/1", "author": "J. Johnson"}, {"rating": 3.0, "review": "Very nice size. I have placed on my Samsung TV directly and then later on an HDMI slot on my Yamaha receiver. Fits well.  Nice interface.  Android user interface is functional if not beautiful.Biggest issue is that the thing is slow overall, especially compared to the Roku 3 I have in another room. Especially bad on Netflix startup. Once in the app it's tolerable.  Startup takes forever and sometimes fails followed by a sudden auto reboot.  I have had this product since April and I am STILL waiting for the bugfix firmware update. They really should have done that by now.  If they speed this thing up I would give it 5 stars.  In the meantime, I say spend another $34 and get the Roku 3. Still beats Chromecast if you ask me (but then for $35 bucks why not buy one of those 2 and get the Google goodies too?).", "verified": true, "helpfulness": "0/1", "author": "Geoffrey A. Erickson"}, {"rating": 4.0, "review": "Very easy to set up, works great.", "verified": true, "helpfulness": "0/0", "author": "Marilyn R."}, {"rating": 5.0, "review": "WONDERFUL. I have both the streaming stick and the Roku 3. This is great for my smaller tv, just because it sticks out the side a bit. We have the Roku 3 mounted on our big tv on the wall, so it's completely hidden.", "verified": true, "helpfulness": "0/0", "author": "Etta Stockwell"}, {"rating": 5.0, "review": "I admit I was intimidated at first, but was pleasantly surprised by how simple and quick the set up was.", "verified": true, "helpfulness": "0/0", "author": "Favorite Aunt"}, {"rating": 1.0, "review": "I am not using it because the device cannot conect with Netflix. Even it has a dedicated key 'NETFLIX' it doesn't work.I'm not interested in the rest of the other channels.So I loose my money buying this Roku.", "verified": true, "helpfulness": "0/2", "author": "Jennie"}]