[{"rating": 1.0, "review": "WORKED WHEN I FIRST HOOKED IT UIP.  NEVER WORKED AFTER THAT.  THIS IS THE SECOND THAT THIS HAS HAPPENED TO.", "verified": true, "helpfulness": "0/0", "author": "Elise Dennison"}, {"rating": 4.0, "review": "Very great easy product!", "verified": true, "helpfulness": "0/0", "author": "Alexander K."}, {"rating": 5.0, "review": "Easy set up.  I had Malware on my computer which prevented me from setting up the Roku stick.  After spending $200 to have my PC cleanedup, everything works fine.  Very user friendly to operate.", "verified": true, "helpfulness": "0/0", "author": "Richard \"Shodan\""}, {"rating": 5.0, "review": "Awesome product! Fast shipping.", "verified": true, "helpfulness": "0/0", "author": "Jonathan"}, {"rating": 1.0, "review": "update 07/13 - i saw a new software update from Roku, but i still have same issue with lagging and unresponsive remote. i just reduced another star from my review. a very bad choice i made by going with roku stick.update on 06/20 - its been 3 weeks since i purchased roku stick and so far experience has been sub par. remote is extremely slow and does not respond most of time. i am changing my rating to 2 star now. Roku seems to have created a device just to complete with Chromecast and not with customer in minds. if anyone wants to buy roku then i would suggest buying there non stick device. this stick is just not worth it.---------------------------------------------------------------------------------------------i got roku stick to stream Sling TV which currently only supports either roku or fire tv. i don't know about other roku apps (channels) but sling tv app definitely has some slowness issues with roku stick. i selected roku stick over fire tv by going with roku reputation. now i am thinking if Fire TV stick would have been a better option.i have been a long chromecast user and its an amazing streaming device both in terms of speed and flexibility. i doubt roku stick offers similar usage experience. if Sling TV had supported chromecast i would have not even purchased this device.in this modern work with cpu's clocking ghz's of speed its frustrating to stare at TV waiting for app's to open in this roku stick.", "verified": false, "helpfulness": "0/0", "author": "DayaS \"DayaS\""}, {"rating": 1.0, "review": "half star.  Can someone please tell me how make this work without having the cable company come in and charge me.  I have spent numerous hours online with Roku 'chat support'.  It's always the same thing, 'you need to contact your service provider.'  VERY disappointed, given the time I've spent on this piece of crap.", "verified": true, "helpfulness": "0/0", "author": "summerschl"}, {"rating": 2.0, "review": "A streaming media player that's the perfect size for travel...but which can't handle hotel wireless (it can't handle the requirement to click \"I agree\" before getting access). We're long-time Roku users at home, and decided to get the Roku Streaming Stick for use when we're traveling. But, it doesn't work for that at all. Buying it was a total waste of money and a big disappointment. We got an Amazon Fire TV Stick instead, and couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "J. Walsh"}, {"rating": 5.0, "review": "Was pleasantly surprised the refurbished Roku stick worked perfectly.  I love that it tucks away, plugged in, behind my flat screen t.v. that hangs on the wall.  I have been using the Roku nearly every night for a month to stream music.  And, so far, haven't had any problems at all.", "verified": true, "helpfulness": "0/0", "author": "FelineFriend"}, {"rating": 3.0, "review": "Bought this to try and replace an apple tv. Slower that apple tv and dont as nice a layout but it will at least get the job done", "verified": true, "helpfulness": "0/0", "author": "Spencer Roll Tide"}, {"rating": 1.0, "review": "need to speak to someone about this item, it does not work????", "verified": true, "helpfulness": "0/1", "author": "Alice A Agrafiotis"}]