[{"rating": 4.0, "review": "I am not electronically knowledgable as some of the other reviewers on this product. I can only, simply, express my humble pros and cons on this product.PROS:1. Price was right- $50.00 from Target2. Most of the channels I streamed are free. Right now I am paying $15.00/ for Neflix and Hulu combined to get hundreds of programs between the two.3. I have streamed alot of programs. Movies, cooking programs, international programs, travelshows, Pandora, classic TV, documentaries and so much more.4. My choices, not packages that includes 200 channels and programs I don't watch; like the Kardashians and those other silly reality shows. Now, those are available if you want them on your list. But, I can do without them.5. Easy installation and setup.6. With it being plugged into my HDMI port, I get much crisper, clearer pictures.  Scenic shows/pictures are unbelievably beautiful.7. It will allow me to get rid of cable.CONS1. Sometimes there are interruptions during a program where the program has to be retrieved. Sometimes this can take several minutes.2. When the stick has not been used for several hours, I have experienced some connectivity problems where I have to reboot it by unplugging the power cord from the outlet and then replacing the plug.3. Screen freezing. i have had to call the Roku service department for help. The technician had me holding the reset button on the remote as well as other buttons on the remote. This maneuver was suppose to reboot the remote. Didn't work. Then I was to change the new batteries that came with the system. That worked for a few minutes. Now, I figured out that when my screen freezes up to remove the batteries from the remote and then place them back into the compartment. This reboots the remote and it's working.This is a headache because the batteries are not easy to remove. I have to use a case knife to remove the batteries. Roku has decided that my remote has to be replaced. They are sending me a new one free of charge.4. Also, you have free help service for 3 months I think, and then you will be charged about $9.00 to use their service which burns me.All in all I am very happy with it. It offers soooo much more than cable for far less money. Quality TV is whatever your choices are not what cable TV offers in their packages.", "verified": false, "helpfulness": "1/1", "author": "Pat Rice"}, {"rating": 4.0, "review": "Bit slow on the remote at times. Get new batteries when you buy it. The ones that come with it are useless. Easy enough to set up and able to add services easily", "verified": true, "helpfulness": "0/0", "author": "Darrell A"}, {"rating": 5.0, "review": "I love it. It's great.", "verified": true, "helpfulness": "0/0", "author": "Rosie Acevedo"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "aykins"}, {"rating": 4.0, "review": "I have Roku the first one, Roku 3 and now the Roku streaming stick. I love all of them (I have 3 tv's)", "verified": true, "helpfulness": "0/0", "author": "J Hoop"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "reid mclellan"}, {"rating": 4.0, "review": "Plugged this in and saw that it worked however have not had the opportunity to use it much beyond that. Definitely convenient if you wish to save a bit of money and avoid some of the wires coming out behind your set. My understanding is that it is a bit slower than buying the roku box.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing is awesome. As long as u have a hdmi port use it anywhere. We take it on vacations, works thru wifi. Netflix, amazon, youtube, hulu, etc. EASY TO USE! Smart phone remote access. So much better than using stupid tv remotes to type on tvs", "verified": true, "helpfulness": "0/0", "author": "Tonystarq"}, {"rating": 1.0, "review": "6 months of using it, it starts resetting. Tried everything but nothing works. Seems like lot of people have the same issue. Hope roku guys can return my money or get me a replacement", "verified": true, "helpfulness": "0/0", "author": "Raviraj"}, {"rating": 1.0, "review": "Not working good, remote is always frezing", "verified": true, "helpfulness": "0/0", "author": "Mahendra Kurban"}]