[{"rating": 3.0, "review": "When you buy this they FORCE you to put in your credit card. The device is a BRICK without it. You can't get past the welcome screen without 1st creating a Roku account (understandable) then that same process REQUIRES a credit card before you can even pick the channels you want or to even use the device. Other wise it stays at the \"enter your code from a internet connected device\".Then on top of that insult their website kept producing an error when I put in my credit card and FORCED me to setup a stupid paypal account because of that error. I don't trust PayPal.I reluctantly recommend this product just based on that fiasco alone. Besides that the device, is nice, a good build, nice remote, overall its 100% better then my blu ray player that has amazon on it.", "verified": true, "helpfulness": "0/0", "author": "Spartan021"}, {"rating": 5.0, "review": "Got the stick for my projector and so far it's been working great...I am loving it.", "verified": true, "helpfulness": "0/0", "author": "E. Sylvester"}, {"rating": 5.0, "review": "Thank you!", "verified": true, "helpfulness": "0/0", "author": "Steve Gelvan"}, {"rating": 5.0, "review": "The Roku 3500R Streaming Stick is awesome.  If you have a spare monitor with HDMI capability, this is perfect for watching your Netflix, Amazon Prime, YouTube, and other video streaming services.  You need to have a computer handy, as well as a wireless router, and internet connection when you first set up your account information.  Logging in all the information for the Roku was incredibly simple and intuitive, and all of my channels were set up in under 10 minutes.  Very easy to navigate menus, and handy \"wipe\" function to reset it back to the factory release when you are ready to part with it.The drawbacks are that the buttons on the remote are not reprogrammable.  I am stuck with the \"Blockbuster\" button that I will never want to use, and I wish I could reprogram it for Youtube.  If the remote had four shortcut buttons I could set, I would be happier.  Otherwise, this is a lot better than using my Wii for my streaming channels.", "verified": true, "helpfulness": "0/0", "author": "Fatt"}, {"rating": 5.0, "review": "Love my Roku. Why did I wait so long to get one. Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "anne l gremillion"}, {"rating": 5.0, "review": "I've cut the cord (or the cable!)  I had decided I needed to trim some of my finances, so looked at my cable tv bill, and the services I was getting for the money..... I enjoyed some of the premium programming, but I didn't like that I had so many channels that I NEVER watched (mostly sports and childrens programming). So, I had been researching streaming tv, and since I already had Amazon Prime (LOTS of options there) and Netflix (different lots of options!) I thought now is the time.  For less than $50 one time cost of the device, I was able to cut out my $100/month cable bill.  I'm so much happier now, because I'm watching a lot less junk tv (reruns or reality programs just because they were there) and I watch WHAT I want WHEN I want.  The device itself is compact, a little bigger than a standard jump-drive, and surprisingly easy to install.  Just plug it into the HDMI port on the back of the tv, turn on the tv, and then move through the prompts to set it up.  There was a little fussing with typing in passwords for Netflix and Amazon, but once that was done, you don't have to do it again.  Using the device is very intuitive.  There are buttons on the remote for Amazon, Netflix, Blockbuster (that still exists, I guess?) and Mgo, which I'm not even sure what that is!  I've only explored my options on Amazon and Netflix, so far.  If you go online for Amazon Prime or Netflix and select your favorites, programs/movies you want to see, they show up on your list on the tv when you're searching for something that catches your mood.  You will need two remotes, one to turn on the tv, and the other for the Roku, but that's not such a big deal, to me, anyway.  So, seriously folks, I'm a middle aged, single mildly tech-savvy woman, and if I can figure this out, you can.  You'll be glad you cut the cable, too.", "verified": false, "helpfulness": "1/1", "author": "Barbara Kooiman \"babsinWisc\""}, {"rating": 4.0, "review": "Solved the problem witn my grand daughter tv", "verified": true, "helpfulness": "0/0", "author": "Roberto Prisco"}, {"rating": 4.0, "review": "It was give as a gift and they loves it.", "verified": true, "helpfulness": "0/0", "author": "harold zayas"}, {"rating": 5.0, "review": "easy to install and works as promised..can't ask for more", "verified": true, "helpfulness": "0/0", "author": "fraiser"}, {"rating": 3.0, "review": "Pretty cool except you need to make sure your wireless router is right next to it - I tried to get mine to work for waaay too long the first night. BUT the chat help on the Roku sight was very helpful.", "verified": true, "helpfulness": "1/1", "author": "No Nonsense Woman"}]