[{"rating": 4.0, "review": "I researched and researched which streaming device to purchace. I settled on the Roku Stick based on price and function comparisons. It is also portable. The device is the same size as a thumb drive.I plugged it into my TV, added my wifi password, picked channels, and it was ready to go.While there are plenty of Free channels, those tend to be more filled with cheesy and unheard of TV and Movie titles.  With Hulu+, Netflix, Amazon Prime, Crackle, Youtube and Pandora ... I seem to have all my bases covered. Or mostly covered.Recap:Excellent PriceEasy to installWorks greatCan't imagine not having it", "verified": true, "helpfulness": "0/0", "author": "Phillip Tomasso III"}, {"rating": 4.0, "review": "The nifty buttons are great and now I get to use my amazon prime.But the remote is very limited, no volume, no hdmi channel switcher, timer for tv, etc.Set up does take quite a bit of time since you are pressing up and down with arrows instead of typing your logins to the different subscriptions.I had this problem with Netflix \"I have had it a month and the netflix stopped working. It just shows the red opening screen. I still have my old device and netflix works on that, so I know it's not my netflix account. I've tried unplugging, restarting, turning everything off...everything works except netflix.\"  I chatted with Netflix and they gave me the web address to fix my problem.[...]So, in the final analysis I like it for $50, but hopefully the next generation will be better.", "verified": true, "helpfulness": "0/0", "author": "Happy"}, {"rating": 5.0, "review": "I have the Roku 3 in our living room and really wanted one in our room as well, but I just didn't want to spend 100 bucks on something we wont use all the time. At $50 it was a bargain. It function as the Roku 3 except for motion remote and it does need to be plugged into the power. I don't know why, but I sort of thought it would be powered by the TV. I guess that was silly of me. Anyways happy to have this in our room so we can watch Amazon Prime movies and listen to our Amazon Cloud as well.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 3.0, "review": "I have used the Streaming Stick several times now and as long as I am home or somewhere where I can connect to a WiFi using a password or truly open, it works pretty good.  I tried to use it on vacation where you had to go through a web page to complete the sign-on to the WiFi and I could get the device to recognize the internet.  I also watch a couple of shows through Amazon Prime with it and it kept reloading all the time and stopping on occasion.  Very annoying.  I don't know if the problem was with Amazon Prime or with the Streaming Stick.", "verified": true, "helpfulness": "0/0", "author": "Donald R Ford"}, {"rating": 3.0, "review": "With XBMC out there this device along with Apple TV, Amazon Fire TV, Chromecast etc... are all very short in content!!!....That said...its an easy install...some of the best channels are found courtesy of private channels just google it....its has a little lag with remote commands, can get frustrating after a while...if you have an usb slot in your tv make sure it can power this stick...my Sharp Tv could not hold the charge and I had to use the power cord provided...so much for discreet.. you get a nice stream most of the time, of course Wifi and streaming depends on your connection....overall not a bad device to have in a spare room just to have content to view......", "verified": true, "helpfulness": "5/5", "author": "Denise Perez"}, {"rating": 4.0, "review": "Roku streaming stick was very easy to set up and use.  My daughter (12 years old) loves it and my cable bill has significantly dropped now that I can do all of these things with Roku.  I would recommend this product to anyone who feels the cable companies are ripping you off.", "verified": true, "helpfulness": "1/1", "author": "Deb Abram-Cioppa"}, {"rating": 2.0, "review": "This stick is quite large.. I was expecting more of a USB size stick, but it was larger than that.. I have a huge indent in my TV for the HDMI port, but the Roku stick barely fit in to it. Since my TV isn't \"brand new\", it cannot support the device itself and instead would need to be connected to a charger all the time. With the charger placed in as well, it does NOT fit my TV at all. I couldn't even force it. I thought it may be smaller or that it ran enough by itself when charged, but it has to be plugged in 24/7 unless your TV can support charging it.So note that unless your HDMI port is completely an open space and you can have the ability to hook up the charger near by, this could work for you. If you don't, I would not recommend this product due to it's size.", "verified": true, "helpfulness": "6/9", "author": "bethany"}, {"rating": 5.0, "review": "Gets me everything I want. Hulu, Netflix, Amazon Prime! Obviously you need your subscriptions to those services to use them. Great selection of other (free!) channels too. Much cheaper than the Roku my mother bought about a year back", "verified": true, "helpfulness": "0/0", "author": "A.A.M.C.B"}, {"rating": 2.0, "review": "I like the idea, the portability, and the price. I was looking for a device with Amazon Instant that was relatively portable. This is very portable as you could likely get away with just carrying the little HDMI dongle, using your phone charger as a power source and using your phone as the remote. It'd be great to bring with you on the road.However, last night it became stuck in a boot loop where it would load, freeze, and then reboot repeatedly. I believe the device has an overheating issue since it gets hot after being being on for 5-10 minutes through USB (when the TV is on) or the wall. Both make me wonder how it would be 6 months from now if this is only after 3 days. It is also relatively slow, but not to the point of killing the device given how portable it is and it is Roku's first generation of the product.They need a second generation device to fix these issues where they can work out the speed/heat issues and I think it'd be a good device, but until then seeing the letters \"R-O-K-U\" dance (the boot screen) is not the entertainment I was looking for. In the meantime I am using my PS3 and my original Roku, and see what happens since everyone is getting into set top boxes.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "My one star review was totally wrong!!!!Ok where to start, the Roku will stream from my media server !!! for some stupid reason you have to FIND MEDIA SERVER buried in a menu somewhere that I do not remember. Once you tell the Ruko you have a media server it will be on the list. All three of mine are now watchable.Super PROs, when watching Netflix it makes you press play for EVERY episode. If like me you go to sleep with your FAVORITE series it stops at the end of the episode instead of playing till the end of the season. When I wake up I know where to start watching, instead of being at the end of the season and having to figure out where I fell asleep.I am not using my Sony DVD player at all lately. The Roku does all I need !!!!!!!!----------------------------------------------------------------------------------------------old wrong :It came free with my JVC TV. They say you get what you pay for. I do not see any of my three media servers. I still will be using my Sony DVD players to stream from my servers. What is this stick designed to stream?Buy a Sony DVD player, works better, has all the bells and whistles and actually streams video.", "verified": false, "helpfulness": "0/5", "author": "Harry Samuel"}]