[{"rating": 5.0, "review": "I have Chromecast and an Amazon Firestick as well, but like the Roku remote and functionality best - I use it all the time.", "verified": true, "helpfulness": "0/0", "author": "CA EV Owner"}, {"rating": 3.0, "review": "The unit continues to show \"reloading errors\"  When i contact the RoKU tech support they have been no help to solve the problem. They keep telling me its my internet connection which is excellent.", "verified": true, "helpfulness": "0/0", "author": "Robert L Pauly"}, {"rating": 5.0, "review": "I bought three Rokus (one for each TV @ home) because I purchase and rent all movies through Google play store. I initially wanted to purchase three Chronrcasts but that meant I have to have an android device streaming the content to the Chromecast. Thus is where Roku comes in, I installed Google Play app on all Rokus, now my kids can watch their cartoons while I watch a movie without having to link an android device. This is also a great advantage if traveling.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "What a pleasant surprise and great experience this has been. This was very easy setup and and using with my prime membership. If you have Netflix also very nice. You can add other channels in the search for many free channels and programs.I dropped Satellite TV and now just use my 3 meg hi speed through my phone line provider and it works great. Save hundreds of $$ a years and able to better utilize my Prime membership. lots of free stuff some not free just make sure it says prime. Lot's of apps pre-loaded but be careful many want you to put a credit card on file. I will never do that, but you may not care?", "verified": true, "helpfulness": "0/0", "author": "indyj"}, {"rating": 5.0, "review": "My Grandson loves it", "verified": true, "helpfulness": "0/0", "author": "Richard/TX"}, {"rating": 1.0, "review": "Make sure you have to speed to run it.constantly freezes.Remote hangs up and drains batteries.  Every time I think it is ok it starts all over again.  I even moved it to another TV.  Do not buy this it is junk my three year old Roku is much better than this thing!", "verified": true, "helpfulness": "0/0", "author": "Rodney"}, {"rating": 5.0, "review": "I LOVE THIS DEVICE. I was able to kiss my cable company goodbye and I can watch anything and everything I want..I no  longer have to be aggravated with the Cable company for they crummy service. The ROKU is instant streaming using the same wireless router hook-up I used for computer Internet access. There are hundreds of free channels.. but I already have NetFlix, Hulu and Amazon Prime accounts. If I was retired and had 24/7 to watch television, I would not run out of programming for the next 10 lifetimes. And I don't have to pay the cable company. Do you know how happy that makes me? Excellent purchase; fantastic price; lightning fast delivery with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Theresa Moore"}, {"rating": 5.0, "review": "Although it is certified refurbished, it works as new.  I love what Roku is capable of doing.", "verified": true, "helpfulness": "0/0", "author": "reg 67"}, {"rating": 3.0, "review": "I purchased this in a tossup between roku and apple tv and I ended up going with the stick when I saw the price. i was looking for a wireless way to stream netflix and hulu without having to connect my laptop to the tv via hdmi. while it does this, it is also very slow starting up and it's just ok when i finally get a movie started. the interface is annoying and lags when I'm using the remote. sometimes i feel like i have to be right in front of the tv to get the remote working. tried the app on my iPhone and it worked pretty well WHEN the app and roku would stay synced. overall, it does what i wanted it to do, but it's annoying when i do it and never really use the thing. I wish i just spent the money and got either the wireless device or just something totally different. disappointed.", "verified": false, "helpfulness": "2/2", "author": "Noel"}, {"rating": 4.0, "review": "My daughter loves it.", "verified": true, "helpfulness": "0/0", "author": "Dennis Fellenger"}]