[{"rating": 5.0, "review": "It's everything you love about the Roku in a much smaller form factor.  I swapped out a Roku 2 for this and the performance seems faster and smoother.  It is able to stream content in Plex that choked the Roku 2 so I am wondering if they bumped up the processor speed.  Maybe better wifi also.Definitely a no brainer here, if you like the Roku and have a modern TV this is the way to go!", "verified": true, "helpfulness": "3/5", "author": "Jason Plotkin"}, {"rating": 5.0, "review": "This is my fourth Roku.  I've had the 1, 2, and 3 and decided to try to the stick as a replacement for my Roku 2 (which I will hand off to a grateful relative).  The Stick was super easy to set up.  I didn't have any problems mentioned in previous reviews.  All-in-all I was up and running in a matter of minutes.  Steps completed:1) Plugged into HDMI port and USB port on the TV... no extra power required!  Nice.2) Booted up and paired with the included remote right away.  It wasn't confused with my Roku 3 remote.3) Found my home WiFi with no issues4) Registered with my roku.com account and downloaded all my channelsNow I just need to register all the channels with their respective providers (Netflix, MLB, etc.), which is a minor pain, but not that big of a deal.  Previous reviews mentioned some remote lag but I didn't really notice that at all.Roku has another winner on their hands!  Will update this review later if any of these impressions change.", "verified": true, "helpfulness": "1/2", "author": "Marcus \"Marcus Schmidt\""}, {"rating": 5.0, "review": "Roku ROCKS.  What more is there to say.  WAY WAY more channel options than Chromesticks, easy to connect and up and running in just minutes.  This is my 2nd Roku device, use them both on 2 different non-internet TV's.  And ROKU is the only one so far w/ Amazon Prime streaming video.  Chromestick?  Nope.  The WiFi receiver on this seems really good, I've never had a dropped signal even tho its clear across the house from my router.  Zero complaints.  Small size, fits out of sight behind the TV and powers from the TV USB port, so no extra cords needed.  It can be plugged into a wall outlet if your TV doesn't have a powered USB port.", "verified": true, "helpfulness": "1/2", "author": "jimb"}, {"rating": 2.0, "review": "This is not nearly as good as my other two Roku devices (the very first Roku 1000 and the Roku 2 XD).Full disclosure - I am a true Roku fan and it pains me to write a negative review about this Roku stick.The content is fine - generally the same as all Roku content (I don't use games, so can't comment on that).My gripe is with the remote.  It only responds about 20% of the time - and it is only 10 feet from the tv.  I can use my iphone with the Roku app just fine, but the remote it pretty much useless. I tried new batteries and I tried re-pairing it with the stick.  No improvement.  Also, the remote is not IR, so don't expect to be able to use any universal remotes (although some newer RF Harmony models seem to be able to work over wifi - BUT I have not been able to get my Harmony Ultimate to work with the Roku stick yet).  Finally, why does the remote have a hard button for Blockbuster?  Didn't they go out of business months ago?Also, this Roku stick seems to have a weaker wifi antenna (or something).  My wifi router is only 30 feet away and this starts with a full four dot HD signal, but after watching for about 60 seconds, it drops the signal completely and needs to \"try again\" to find the network.  My first generation Roku 1000 (sitting in the same spot with the same configuration) never had that problem.This might have some growing pains, so I cannot recommend it at this point.", "verified": true, "helpfulness": "5/8", "author": "Just a guy"}, {"rating": 5.0, "review": "We've had a lot of trouble streaming Amazon Prime upstairs to our tv that supports it as it'll frequently disconnect. This seems to have solved that problem completely, although we have only had it a day to try out.The stick does require a power cord (provided) and it would be nice if that wasn't necessary.I am considering getting rid of cable completely if this works... it would be SO awesome to cut our cable expenses.", "verified": true, "helpfulness": "0/1", "author": "Do-It-Yourself Danielle \"Do-It-Yourself Danielle\""}, {"rating": 5.0, "review": "11/3/2014:  Over a period of time the Android software has been updated and now works just fine.I have been using the Stick for a few days now and must report that it works just fine.  It is not as fast as my Roku 3, but it is adequate.  I had NO PROBLEMS connecting it to my network and the internet.  The remote control paired perfectly for me and took no effort on my part.  It just happened!  I used a spare USB port on my TV to power the device but quickly abandoned that as I had to wait for the Stick to reload every time I turned the TV back on.  I am now using the provided power dongle.  The picture quality is excellent and the Stick is much easier to manipulate than the Samsung SmartTV interface my TV uses.Con:  The only negative I can report is about the Android software (not required for normal operation of the Stick but used primarily to provide an easier way to enter text into the Stick).  It was working just fine, but was redone just prior to my receiving my Stick.  The software reviews are terrible.  It has a lot of problems.  Put simply, it blows chunks.  I am certain it will be fixed due to the volume of negative reviews.", "verified": true, "helpfulness": "0/1", "author": "H. Goeller"}, {"rating": 2.0, "review": "If you are considering buying this vs. a Roku 3 - GET THE ROKU 3!  This device is frustratingly slow, especially with the Netflix interface.  Setup is easy and all my Roku 3 channels transferred over fine, but i am returning because 5.1 surround does not work on Netflix or Amazon Prime for my 2 year old LG blue ray player.  Apple TV plays surround great on this device.  The Roku 3 at least plays Amazon Prime in 5.1.  I have found the Roku support to be abysmal at best and decided to return this product rather than enter that never-ending dystopian spiral.", "verified": true, "helpfulness": "6/9", "author": "preset1"}, {"rating": 1.0, "review": "The wireless signal could not connect to my modem which is about 20 ft away in my den. It connected only when I plugged it up in the den, right next to the modem. I'm returning it for a Roku 3. You get what you pay for. Lesson learned.", "verified": true, "helpfulness": "4/9", "author": "The Truth"}, {"rating": 1.0, "review": "This was going to be used to convert some 'dumb' TV's in the house to 'smart' TV's. I have a Netflix account and Amazon Prime and I'm more than happy with them and the programming they provide on the various TV's, tablets, laptops, desk tops and phones in the house. As a matter of fact anywhere I go in my house or on my deck I can get a very good wi-fi signal on any device I own, but not with the Roku. I first tried to install it in my bedroom which is on the same floor as my modem/router and only about 25 feet and two walls away. It couldn't find my signal, but did mange to pick up my neighbors for some reason. I tried numerous times and never once picked up the signal from my modem. I removed the Roku from the TV in the far bedroom and then tried it in the TV which is about 12\" from the modem, then it found my signal. I entered all of my info and logged in (giving up all of my credit card info which I HATE to do until AFTER I'm positive the product works, but it wouldn't sign me up until I did) then got Netflix working. Since I had problems with the signal earlier I decided to try to get a signal in the other room in the house where I was planning on using the Roku before entering all of the passwords and log in info for Prime and all of the other channels I wanted to use. No dice. No signal anywhere else in the house except in the room where my modem/router is.  Now I had a $50 device that I couldn't use in any other room in my house except for the room that I have my wireless router in, which effectively makes it useless to me since the TV in that room already is 'smart'. So back it goes. I don't want to send it back, I really want to sit on my deck and watch Netflix on my 32\" TV but that's not possible with this device, not for me anyway.  There's a couple of other problems also. The remote seems to be almost line of sight, which is kind of bad since the Roku plugs into the HDMI which (on my TV) is in the back. Pointing the Roku remote directly at the TV only worked about 25% of the time. To get it to work all of the time I had to bend my arm around the side of the TV if I could or bounce the signal off the wall and that didn't work 100% of the time either. The other problem I had is with the fact you have to register a credit card with Roku before they'll allow you to finish your registration and begin using the device. I realize this is something you have to do with every app or device that's hooked to your TV where there's the possibility that you may want to purchase a song, or TV show or movie or whatever sometime in the future. The thing that bothers me is, why don't they give you the option to enter the credit card info later, AFTER you're 100% sure that the device works and you're going to keep it? You can have my name, address and all that - just let me keep the option of entering the credit card info later, perhaps the first time I want to buy a movie.  I guess I'll just keep on hooking the TV up to my old LG bluray player which still gets Netflix wirelessly with no problem, the only problem being an LG bluray player is a lot bigger and harder to move around then a little Roku Streaming Stick but at least the LG works.", "verified": true, "helpfulness": "8/13", "author": "Rick Blaine \"Ten 252\""}, {"rating": 5.0, "review": "After two days, this thing is AWESOME, despite a minor issue I'm having with OTA reception!About two months ago, I made the decision to get rid of Verizon Fios.  Not that I didn't really like it, I loved it....I just couldn't afford it anymore.  I realized that I was only really watching a few of the many channels available, and despite the \"bundle\" was still paying way more than I could afford.  Rather than continue to juggle other bills in order to keep it, I cancelled it, bought myself a $20 antenna from Target and began watching free over the air channels.  Found that I honestly didn't miss cable - yes, there are certain shows that I miss, but I will just have to deal.  Enter the Roku Streaming Stick - I had researched the Roku and decided that I would get a Roku 3 when my funds got better....then realized the stick would actually be a little more economical, and would serve the same purpose.  I did the preorder directly from Roku; it arrived earlier than expected, and I set it up right away (took maybe 5 minutes).  Added channels and was amazed at everything available.  I can spend hours just searching through!!The minor glitch for me is that the free channel reception became awful with the stick plugged in. I had 65 channels prior to plugging it in, and after plug in, there was only one channel coming through, and it was constantly hiccupping, to the point where it was impossible to watch anything.  Very annoying!!  I did a chat with Roku support - sorry, these folks had no clue what they were talking about, only kept saying that it shouldn't interfere with the OTA reception.  I then emailed support to ask whether the Roku would need to be constantly rebooted if I unplugged it until ready to use.  I received a quick reply, which said that while the OTA reception should not be affected, all information and added channels would be available if I were to unplug it and only plug it in when using it.  They also promised to check this out on their end (I have a feeling I'm not alone in this).  While this is a minor annoyance, I have found it to work wonders, and honestly do not mind doing it since it solves my problem and is a relatively easy fix.  I thought perhaps I would need to go with the Roku 3 instead to solve this issue - but unplugging it works for me!  I have read reviews of those who feel it is slow....if this is slow, the Roku 3 must be lightning fast!  I don't find it slow at all, and all of the channels I have added (Vudu, Hulu Plus, Crackle, etc) respond very quickly (to me anyway!)  I like the feel of the remote and it responds very nicely, even though the stick is hidden behind the back of my Samsung TV.If you're on the fence, I highly recommend giving this a try, $50 is a great price and is only paid once.  I am so delighted when I think of how much money I'm saving!  Even with the minor issue of having to unplug it to watch regular TV, I will deal with it.  I would say it's a great option for those of us who don't need the constant CNN or MSNBC to be available, or those who can't do without regular cable.  As for me, I am just fine without it, even though I myself paid for cable for many many years.I will update in a couple of months - but if it's anything like now, I'm sure I will love it even more. Highly recommend.  Goodbye Cable!!!", "verified": false, "helpfulness": "8/10", "author": "Cheryl L. Mcfadden"}]