[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "James Jenkins"}, {"rating": 3.0, "review": "A little slow, laggy, and pokey.  But it works otherwise.", "verified": true, "helpfulness": "0/0", "author": "J. Payne \"Home Theater Nut\""}, {"rating": 5.0, "review": "LOVE THE Roku.  So easy to take from tv to tv in my house!", "verified": true, "helpfulness": "0/0", "author": "Marybeth Bergeron"}, {"rating": 2.0, "review": "Ok, I had even more troubles with spooling and connections, cross tested, and it definitely has more connectivity and spooling issues than my Roku2, so I returned it. I'm so glad to be rid of it!!!It just does not seem as stable as my other ROKU, a Roku2 when tested on the same unit at the same location. It spools more and loads slowly, I wish I would have gone a different direction. Phone support is ok, but the online chat SUCKS... it's like saying one sentence and then being on hold for a few minutes while the tech deals with too many multiple users.", "verified": true, "helpfulness": "0/0", "author": "bfrazier"}, {"rating": 5.0, "review": "Easy peasy to set up, works great", "verified": true, "helpfulness": "0/0", "author": "Ama-Me \"Ama-Me\""}, {"rating": 5.0, "review": "This thing is awesome! Waaaaayyy better than Google Chromecast. I love it!", "verified": true, "helpfulness": "0/0", "author": "JJDynomite"}, {"rating": 5.0, "review": "works perfectly and i believe this deal is better than cable", "verified": true, "helpfulness": "0/0", "author": "joseph0612"}, {"rating": 1.0, "review": "Would not hold internet signal. Returned and exchanged for Amazon Fire TV.", "verified": true, "helpfulness": "0/1", "author": "toothpkr97"}, {"rating": 5.0, "review": "I got this for my dad as he has a smaller conventional LCD TV on a wall mount with an electrical outlet behind the set. It has a great picture and no wires or cables are visible. Roku has added a bunch of free channels that have a lot of the older programming that he likes as well as all of the popular channels such as Hulu Plus and Netflix.Just a note that this works good up to 720P. If you have a large screen that supports a higher resolution you might want to go with a larger Roku however 720P looks pretty good on everything at and below a 32.\"", "verified": true, "helpfulness": "3/3", "author": "Radon"}, {"rating": 5.0, "review": "It was great", "verified": true, "helpfulness": "0/0", "author": "susan hubbard"}]