[{"rating": 2.0, "review": "I have two streaming sticks. One works great but the other one I am having problems with the remote. Tech support was not helpful at all.", "verified": true, "helpfulness": "1/1", "author": "Walter Zahn"}, {"rating": 5.0, "review": "Love Roku. This is the 2nd unit we,ve ordered for our home. Easy to install even for techno-dummies like us!", "verified": false, "helpfulness": "0/0", "author": "Christie Gilbert"}, {"rating": 4.0, "review": "Got it for my friend.  Works great for what it does but it runs hot.", "verified": true, "helpfulness": "0/0", "author": "Anthony Estremera"}, {"rating": 4.0, "review": "Bought for a Christmas gift for the wife as she's the one that really likes movies.. Compact, no need for another box, very easy to set up price is right and with Amazon prime how can you lose ..  Saying around the house now is \"you want to watch a movie\" ;-)", "verified": true, "helpfulness": "0/0", "author": "Tim in Maine"}, {"rating": 4.0, "review": "No issues with product itself, but hook up with wifi was difficult and lots of added steps", "verified": true, "helpfulness": "0/0", "author": "Pete Lesniak"}, {"rating": 1.0, "review": "i have four rokus, from the orignal blakc box to the newest roku3. I got one of these thinking the small size and non infrared remote would be great. This roku is so slow. the GUI is very unresponsive, even in netflix. Its 80% slower than my generation 1 roku. It reminds me of the built in TV netflix app. Please, for the same money, get a refurbed roku lt and be much happier.", "verified": true, "helpfulness": "2/2", "author": "Ben"}, {"rating": 1.0, "review": "doesn't work, wondering how to return it to get another one?", "verified": true, "helpfulness": "0/0", "author": "Carrie Glessner \"Giggles\""}, {"rating": 4.0, "review": "works very nice in our bedroom and makes a good second option for our kids", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "Perfect condition,  works really fast with our older version HD tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this product.", "verified": true, "helpfulness": "0/0", "author": "Roni Royal"}]