[{"rating": 2.0, "review": "Apparently if you're not in the US you get a VERY stripped down version. The main reason I got the Roku was for Netflix. I HAVE a Netflix account. Netflix IS available in my country, but not on my Roku. VERY disappointing. If you're not in the US, don't buy it.", "verified": true, "helpfulness": "1/1", "author": "lion_thirteen"}, {"rating": 5.0, "review": "LIKE THIS WAY BETTER THAT THE ROKU BOX", "verified": true, "helpfulness": "0/0", "author": "meme"}, {"rating": 5.0, "review": "Better than the Chromecast, by far!", "verified": true, "helpfulness": "0/0", "author": "velasc0marli"}, {"rating": 1.0, "review": "Roku Stick stopped responding after a couple of minutes. Returned to Amazon for replacement. New stick did the same thing. Returned for Amazon Fire Stick, and it works great.", "verified": true, "helpfulness": "0/0", "author": "T. Schultz"}, {"rating": 5.0, "review": "I love my riku!", "verified": true, "helpfulness": "0/0", "author": "Anita D. Lara"}, {"rating": 5.0, "review": "Good price and it works. We own two of them which is used on a daily basis no problem found.", "verified": true, "helpfulness": "0/0", "author": "Oswald K. Fraser \"iriejam\""}, {"rating": 5.0, "review": "My daughter loves it", "verified": true, "helpfulness": "0/0", "author": "Roger P."}, {"rating": 4.0, "review": "Great to have.", "verified": true, "helpfulness": "0/0", "author": "Camera Video"}, {"rating": 5.0, "review": "I just got this, and it works great. I had it up and watching a show in under an hour. I plugged it into a regular wall outlet because I didn't want the wait time on turning on the TV that others reported. My only problem so far is that there isn't enough clearance from the end of the stick with the power cord plugged in to use it on most of my HDMI ports. It works fine on the side, but that makes the power cord (plugging it into a regular outlet) just a little tighter than I would have liked. On my TV in the living room (I have it in my room right now) the cord wouldn't be long enough, and the side port is the only one accessible when I move it from TV to TV. I ended up plugging it into the USB port instead, and it works fine. The time it takes to start up isn't a problem since it takes time for my TV to start up anyway.I cut the cable cord the beginning of the year and got HuluPlus. It only works about half the time on my Vizo smart TV that I bought 4 years ago.  I usually end up watching it on my son's PS4 in the living room instead of on my TV in my room. The apps for Netflix and Amazon are clunky on it since none of the apps have been updated since I originally bought it (I thought they were supposed to update automatically, but I guess not since nothing I've tried works). Needless to say, I've been wanting to get a device like this for a while to get around the problems with the TV, but I couldn't decide which one to get. When I cut the cable cord, I also got CBS All Access. It works great, but only on my phone or on my laptop, so I decided I would wait a little to get any extra device until that got released on one of them. It got released on Roku devices a couple of days ago, so I bought the stick since it can be portable between TVs and since the cost is so much less than the Roku 3.It did take some time to get all the apps set up with my user information, but now that it's done, it's done and shouldn't have to be repeated. I was really impressed with the amount of apps available, though I will probably only use the movies/TV and music apps.  The set up is really easy for the device, and the app for my phone made typing in of user names and passwords much easier.  It will also make searching for movies easier too. I really like the Netflix and amazon buttons on the remote since those are the ones that I use the most.This device is just perfect for me, and I am so happy to be able to watch whatever I want wherever I want and not have to worry about whether an app freezes up or not (HuluPlus) on the TV I'm using or needing to use my son's PS4 or having to watch on my laptop or the tiny screen on my phone (CBS).", "verified": true, "helpfulness": "0/0", "author": "L. Robinson"}, {"rating": 5.0, "review": "I have 4 Roku 2s. I recently purchased the Roku 3500R Streaming Stick. It is great and I love it. The interface is snappy and responsive. No performance concerns.", "verified": true, "helpfulness": "0/0", "author": "Bill Carter"}]