[{"rating": 3.0, "review": "It works, but pretty slow to respond to clicks on the remote.  Takes some time for the image to catch up and display in good quality.  Maybe it is just me, or the TV where it is connected.", "verified": true, "helpfulness": "0/0", "author": "Jose Alvarez"}, {"rating": 2.0, "review": "Ok, so this thing seemed pretty cool at first; a compact, $50 full HD Roku player that can simply plug into your TV and bring all the same great streaming content you enjoy on the standard Roku, right?  Well, kinda.  It works, but not well.I already had an older standard Roku box (720p) and decided to upgrade.  Right outta the box, the Roku stick worked nicely.  It connected quickly and relatively easily.  The problems began with the remote.  Within the first 24 hours I started to encounter problems with connectivity.  Commands from the remote do not execute in real time, there is significant lag that can cause you to push the button more than necessary.  This can be quite annoying.  First, I replaced the batteries thinking that maybe the ones included in the box were somehow drained.  This made little difference.  I had a feeling that this particular problem was due to the fact that this stick plugs into the back of your TV; the TV is basically blocks the signal from reaching the stick.  To test this theory, I stood next to the TV and pointed the remote directly at the stick (on the back of the TV) and \"Ta-Daa\" it completely eliminated the lag problem, which seems to indicate that the TV really does interfere with the remote's communication with the Roku stick.  The other problem I have noticed is that sometimes the remote will abruptly stop working completely.  For example, I was watching a show on the Comedy Central App; I decided to rewind the program a bit, and it did start rewinding; the problem is that it never stopped rewinding.  The remote was completely unresponsive.  Other times, when scrolling through a menu, the scroll button seems to be \"stuck\" because it will continue scrolling quickly through the menu uncontrollably.  The only recourse in this situation is to reset the remote with a small purple button on the inside of the battery compartment.  This works about 50% of the time.  The other option is to completely unplug the Roku Stick, take the batteries out of the remote, wait 5 seconds, plug the Roku back in, replace the batteries, and start all over again.I looked into this problem in some online forums and found out that you can download Roku's free app for your smartphone.  One of the features of this app allows your smartphone to function as a remote for your Roku stick or box.  The app worked right away with almost no setup required.  At first, this seemed to be a perfect option to replace the God-awful remote that came with the stick; however, after only about 24 hours of using the Roku app, I encountered more problems and glitches.  I started to get error messages telling me that I needed to check that my internet connection was active.  My router/internet connection is working fine (I actually have a brand new cable modem and router*) and all my other devices (phone, tablet, PS3, Smart TV, Chromecast, laptop, etc.) can connect to the internet with no problem.  Despite the fact that my home network is clearly working just fine (as a matter of fact, that is how this message is reaching you now*), the app keeps telling me otherwise.  Eventually, the app began to fail repeatedly and shutdown automatically with an error message \"Roku has failed.\"  So, long story short, the Roku app is the perfect compliment to the Roku stick; both are equally disappointing and technically unsound.When the app went tits-up, I switched back to using the remote.  I figured I would just have to get used to standing next to my TV to control the Roku...but the Roku stick had other plans.  Currently, it cannot connect to the internet at all.  After resetting it several times, it can recognize my Wi-fi network, the password is correct, it connects to the wireless network, but then it says that there is no internet access and that I should contact my internet service provider.  Well, we have already established that there is absolutely nothing wrong with my internet service, so logic dictates that this \"Roku Streaming Stick\" is really more of a \"Roku Steaming $#!+.\"If you want a purple plastic accessory to plug into your TV for some weird, ascetic reason, the Roku Stick is a good buy; however, if you want to watch streaming videos, I would suggest coughing up the extra cash to buy a regular Roku player.  My old 720p Roku box was much more reliable and never had half the problems in 3 years that this streaming stick has had in the last 3 days.  It was a nice try by Roku to make something smaller and cheaper, but they have missed the mark on this one.", "verified": true, "helpfulness": "0/0", "author": "Amanda White"}, {"rating": 3.0, "review": "The remote stopped working for me on the second day. Sometimes the device takes a while to load.", "verified": true, "helpfulness": "0/0", "author": "Jenna Collins"}, {"rating": 1.0, "review": "It worked for about an hour then locked up.  The Roku 2 is a muck better performer.  I now have two.", "verified": true, "helpfulness": "0/1", "author": "Mark Dement"}, {"rating": 5.0, "review": "I LOVE LOVE LOVE my Roku HDMI stick. This particular purchase was a gift for my cousin as I bought mine 2-3 years ago and it still works perfectly.I am a big researcher when it comes to purchases, especially electronics. When I learned I had a chronic illness and was going to be home in bed for long periods of time, having more variety with what I could watch was crucial. So, I did a lot of research on what streaming devices were the best from a variety of seemingly un-biased/objective sources. The Roku HDMI stick consistently came out on top. Even though Roku, and other companies, have made newer and seemingly more advanced models since this streaming stick, the Roku stick still gets the highest rating based on my needs (streaming movies and television) and is the most compact and inconspicuous. It never buffers, is lightning quick and I love the huge variety of channels available. The remote is very sensitive, which is great because it makes it very easy to use and you don't have to wave it all around to get it to \"talk\" to the HDMI stick in your TV, but be careful not to have it too close to you because I often find it fell under a pillow or blanket and inadvertently hit stop, rewind, etc.The only downside (which I am guessing is the same for any device of this nature) is that you initially have to set up an account on your computer with most of the channels you would like to add to your Roku before you can begin streaming. It is quick and easy to set up, but when I got it, I was not feeling well and wanted instant gratification, so nothing to deduct a star for because once a channel is set up, you do not have to do it again, unless you need to make changes to method of payment or something.Also know that while most of the channels I have been interested in on Roku are free (especially if you already have an Amazon Prime account, cable with HBO, Showtime and other stations), there are a few channels on Roku that charge a nominal monthly fee. For instance, Acorn TV that carries hard-to-find BBC shows is $4.99 per month if I am recalling accurately, but I watch enough of these shows to warrant the monthly fee. Also, if you want to watch a newly-released movie or television show in its current season, you might pay a few bucks to rent (meaning you have to watch within a certain time frame) and more if you would like to purchase a recent/current season of a show or newly released movie, but if it is something you know you might watch more than once and you would like to permanently have in your library for that channel, it is worth it.I have learned if you have something particular you would like to see, go to Roku's home page and do a search for what you would like to watch and Roku will tell you every channel it has that carries what you are looking for, and you may find there are some channels where you can watch it for free and others that might charge to watch. So, before you pay to watch anything, do a search and see which channel will give you the best deal and you may be pleasantly surprised. Some of the channels you subscribe to will also give you promo codes for a free movie, etc., so you can used those as well.Anyway, this was a long-winded review, but I have used my Roku stick almost daily since I bought it and did so much research ahead of time, I figured I would share in full. I have given Roku sticks as gifts for family and friends over the last few years and they all love theirs as well. So, if someone's needs are simple like mine (tv and movie streaming and non-gaming), there is no need to re-invent the research wheel, when there are helpful reviews from average consumers who have actually used the product. I know I rely on the review's of others for everything from products to services, so this past week I have decided to start paying-it-forward to my fellow consumers by writing my own reviews. I hope this was helpful.", "verified": true, "helpfulness": "2/2", "author": "Kiwiness"}, {"rating": 3.0, "review": "The remote locks up intermittently.", "verified": true, "helpfulness": "0/0", "author": "David Mangan"}, {"rating": 3.0, "review": "The stick controller is very temperamental.  I have had to call Roku twice to get it rebooted.  When it works it works well but the little changer just quits working and we have to reboot the entire system each time.  Not sure if they have sold us a bad changer or if this is just not the greatest system ?", "verified": false, "helpfulness": "0/0", "author": "Louise A. Ford \"Weezie\""}, {"rating": 5.0, "review": "Daughter loves this.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 1.0, "review": "No problems with returns, This unit will not stay connected to the internet and it has trouble downloading ROKU updates.  I returned one device and am having similar problems with the second.  The seller was very easy to deal with on returns.", "verified": true, "helpfulness": "0/1", "author": "Thomas c."}, {"rating": 5.0, "review": "Great little streamer.  Im using it in the guest room and guest love the fact that it's in there for them.", "verified": true, "helpfulness": "0/0", "author": "kevin"}]