[{"rating": 2.0, "review": "In a nutshell - returned it.I bought this (refurb, direct from Roku) for two reasons - my new crappy Vizio TV doesn't support either HBO-Go or screen casting.  This seemed easier than hauling the TV back (tho regretting that decision now).The good:Connected easilyHeld WiFi signal, never any bufferingLots of channelsThe bad:Slow start - I powered it directly from the TV USB, so every time I powered the TV on, I had to wait for Roku to boot up.Crappy Remote - key presses were missed.  So then I would press again and again.  Invariably I would get one too many or too few presses and have to sort that out.Screen mirroring doesn't work - I spent hours and hours and hours with their support team on this.  Display of static pictures works 1 in three times, the other times you get heavily pixelated crap.  Video was better, but only as long as there is no fast-motion on the screen.Requires a credit card - you can't watch anything, even free stuff without entering credit card.  After replacing our credit cards 3 times in the last year due to security breaches at Target, Home Depot and others, it pisses me off that a) they require this and b) they don't disclose this in the advertising.Lots of channels - tons and tons of channels, but all with stuff that I would Never consider watching.  Ever.  Most of it is so bad, you would have to pay me to watch it.  So more isn't necessarily better, just more crap to weed thru.Online Support sucks - 'did you cycle power?'  'first on the TV, then on the roku?'  'roku then the TV?'  'TV, then Roku, then dishwasher?'  And every call had to start from the beginning of the script, even when they accidentally dropped my connection.  They eventually improved it from terrible to just bad, but I was expecting pictures with sufficient clarity to differentiate the dog from my MiL.Return Policy - their web site doesn't work, so then I was stuck on a 2 hour support call with them trying to debug their website - they held me hostage on the return while trying to figure out why their crap was broken.  And I had the audacity to be using something as obscure as Chrome on Windows 7!  During the entire process I provided them with my invoice number, purchase date, serial number, phone model and FW number 15 times.  Apparently they haven't heard of computers and support databases.My equipment: Vizio M5521-B2, Samsung Galaxy S5, Samsung Galaxy Tab S 10.5\"BTW, I was a happy owner of the original Roku for 6 years.  How far they have fallen.", "verified": false, "helpfulness": "0/0", "author": "J. Bochsler"}, {"rating": 4.0, "review": "Works great..a bit on the fragile side but all in all a great product.", "verified": true, "helpfulness": "0/0", "author": "Bryan P Bassett"}, {"rating": 5.0, "review": "I am very happy with my stick. It arrived safely with no problems.  There were no problems setting it up.Thanks", "verified": true, "helpfulness": "0/1", "author": "SpecialK Day \"Karen Day\""}, {"rating": 4.0, "review": "Works well, not quite like cable but works well.", "verified": true, "helpfulness": "0/0", "author": "Ted Feight"}, {"rating": 1.0, "review": "They do not disclose that an account with credit card information must be provided in order to use this.", "verified": true, "helpfulness": "2/3", "author": "carkid11"}, {"rating": 1.0, "review": "It worked great within 5 feet of modem/router but was quick to lose connection in my room- 15 feet from modem/router. Contacted my provider thinking it was a weak signal, they sent a tech out that checked and said everything is fine- he was picking up signal from the road! I was constantly having to go into settings and reconnect. The apps on my roku account online were not coming on the roku itself. It would randomly close out of apps like Netflix. I tried to do a factory reset and the whole thing is frozen, I can't even choose language!! Had it 32 days, worst purchase EVER!! Convenient that I am 2 days past return date with no way of contacting about even exchanging it.", "verified": true, "helpfulness": "0/0", "author": "StaceyR"}, {"rating": 3.0, "review": "I haven't actually used the product yet. I was disappointed that I must enter a credit card number just to activate it. I would have not purchased this product if I had known I had to enter credit card just to browse or watch free things. Not sure if Im going to use it at all at this time. **** Please be warned you must enter a credit card to activate/use this product******", "verified": true, "helpfulness": "2/2", "author": "Shelly"}, {"rating": 4.0, "review": "I like it. Lots of free stuff to watch and plenty of payed channels also. Lots to pick from. Took awhile for it to stay connected, took some time. But finally got it updated and on line. Nice product.", "verified": true, "helpfulness": "0/0", "author": "Steve Ritter"}, {"rating": 5.0, "review": "Excellent product!!", "verified": true, "helpfulness": "0/0", "author": "Lisa \"linlacor\""}, {"rating": 5.0, "review": "Plugged the streaming stick into an HDMI port on my wall mounted TV. I tried powering it from a USB port on the TV, but the port could not supply sufficient power. I then connected the included power cable and plugged it in to my UPS. The ROKU streaming stick works very well, and it is hidden behind the TV. The RF remote does not require line of sight, so it all works as described. We love it. We use an OTA for local channels and the ROKU stick for everything else including Amazon Prime Videos, Netflix, Hulu, and Showtime, not to mention several free channels.", "verified": true, "helpfulness": "0/0", "author": "J. Thomas \"Polish Ninja\""}]