[{"rating": 2.0, "review": "Every single time I use the Roku, I need to get up, unplug and restart. EVERY SINGLE TIME. Or else I get a purple screen with audio only.  I'm out of the warranty period now, so it was just a waste of money for me.", "verified": true, "helpfulness": "0/0", "author": "Jessica L. Poff"}, {"rating": 5.0, "review": "EXCELLENT, use it everyday and never had a problem!", "verified": true, "helpfulness": "0/0", "author": "Kenneth C. Weindl"}, {"rating": 5.0, "review": "Great it and well worth the money.  We bought one and now have bought 3 more as well as telling ell our friends and relatives to buy these.  We shut off our satellite dish and have never looked back or missed have it at all.  We see more good movies now than with the dish and are savings about a $100 a month.  We have signed up for Netflix as well as Sling so we get a ton of movies and then all the regular shows we like are on Sling.  It cost $20 a month but gives us History 1 and 2, CNN, ESPN and lots of the channels we watched the most often on the dish.  Then I installed a cheap digital antenna for the local channels so we are happier than with our old Satellite.  Actually, the TV we get now is worth more than what we used to pay $120 a month for - really!  You get far more channels, movies than with cable or dish either one for a fraction.  Wish we had done this a long time ago.  Just do it and you'll be glad you did!!!", "verified": true, "helpfulness": "0/0", "author": "Glynis"}, {"rating": 5.0, "review": "I've had no problems with mine. It works perfectly and I can take it anywhere easily.", "verified": true, "helpfulness": "0/0", "author": "Brandi Fleeks"}, {"rating": 1.0, "review": "It's been only 6 months since I gave my friend for Christmas and the remote is broken al ready.  This should not happen and it is not eligible for return.  I am very disappointed.", "verified": false, "helpfulness": "1/1", "author": "Michael Roach"}, {"rating": 1.0, "review": "It does not maintain connection. This is the second Roku stick I've had the same issue with. I contacted Roku for the first one and they won't troubleshoot once your product is 90 days old, so I bought a new one to see if it would resolve the issue. It didn't. It worked well for 3 hours, and then I had the same issues. The connection was \"excellent\" according to the network status screen, it was updated with the latest software, but like I said, after 3 hours, it refused to connect to any channel. After spending 2 hours on the phone troubleshooting with Roku, they told me that it isn't connecting due to interference on the line and that I had to change my router's security settings to the minimum security of WPA-TKIP. I googled it and read several pages/sites' worth of information on how you should NEVER use TKIP and then I called my internet provider to verify with them. They stated that this would not be an appropriate security setting for me to have, given that I've previously been hacked, and reccommended against changing it. ROKU needs to let people know up front that while they may be saving $20 off the price of a Roku BOX (which doesn't require reduced security), they will be putting their home network at risk in order to use this particular Roku product. Do not buy the stick if you are concerned about network security, go with one of the boxes and hardwire it to the router.", "verified": true, "helpfulness": "1/1", "author": "Raine"}, {"rating": 2.0, "review": "Have both a regular roku and a streaming stick.  No problems with the regular one, but all sorts of remote problems with the streaming stick -- al related to the recognitiion of the remote.  A coupleof months ago when I first got it, I spent aout an hour and a half on the phone with customer support and finally got the streaming stick to recognize the remote.  The customer support person recommended I get an extension (which was free).  I did -- even though things were working -- but didn't plug it in.  Today it wouldn't recognize the remote with OR without the extension.  This would be useless if it weren't for my Kindle Fire, which I set up to act as a remote.  Actually, this new roku would only get one start if it weren't for the Kindle Fire .", "verified": true, "helpfulness": "0/0", "author": "Barbara Mullaney"}, {"rating": 4.0, "review": "This is a pretty great device, eliminated one of our rental boxes from Comcast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Our streaming stick worked great for a month or two.  Then it would no longer stream Netflix bUT it works fine on amazon.  Thought it was Verizon Internet issues but, tried my old HP player with Netflix and it worked great.  So I'm  a little ticked at Roku.", "verified": true, "helpfulness": "0/0", "author": "Robert M. Young"}, {"rating": 1.0, "review": "This is by far the worst product I have purchased off of Amazon ( through no fault of Amazon) will be returning as soon as I find out how! The 1st day it wouldn't connect to the wifi, we had to call customer service to assist. That was a 2 hour phone call. The next day it did connect to our wifi but with no picture or sound, another 3 hour phone call to customer service. Now a week or so later the remote it came with won't connect, customer service wants me to contact Comcast to reconfigure something and reset something else. Ummm, No! Too much trouble for something that should require practically zero effort beyond plugging it in. Returning to get another Firestick, that works just fine with minimal problems.", "verified": true, "helpfulness": "1/1", "author": "bookworm4ever"}]