[{"rating": 2.0, "review": "The good content they promote all over their website is deceiving.  ESPN and all the cable network channels require a Cable TV subscription.  Which I'm sure may or may not have to do with Roku itself but don't promote it if people can't use it.  The point of these devices is to \"cut the cable\" and I was hoping that this device would solve my problems since I am a cable cutter.Most of the free content is not worth viewing in my eyes.  The movie rentals were nice, the interface is nice, and the options are okay.Netflix was extremely sluggish on this.  I imagine if I had a Roku3 and paid the extra bucks it may work a little better.  Getting it to pause and play content on Netflix was exhausting, half the time the buttons on the remote wouldn't work (and yes I didn't use the batteries that came with it I put my own better ones in).Neat device if you find a use for it.  I got an Amazon Fire TV stick that handles Netflix a lot smoother and has a more fluid interface.", "verified": true, "helpfulness": "2/3", "author": "Brett"}, {"rating": 1.0, "review": "Please read the Roku support forums before you buy this product now (and shadily enough you have to sign up as a user to even view the forums). I have owned this stick for about 5 months now and it always worked great. However, last week Roku pushed an update that broke the sound and picture on all the apps on this product. You can see this by looking at the Roku support boards. When I contacted customer service, they informed me that the product is only covered under a 90 day warranty. I was shocked. What major product doesn't have a year warranty if it breaks? So now I am stuck with a completely worthless product that I wasted my money on. And of course at this point I have already phased out other media options I had connected to my TV. So read up on the boards before you buy it!", "verified": false, "helpfulness": "0/0", "author": "georgiagirly"}, {"rating": 4.0, "review": "I bought this thinking you just plug it into your hdmi port for our exercise room tv in on the wall.  Well if your tv doesn't have a USB you'll have to use the plug which comes on the usb cord they provide and plu into outlet..  I had the USB on my tv so just removed the plug end and used it as a USB.  I have two other rokus upstairs roku 2 and 3 and never had problems connecting to my wireless.  Downstairs it would connect to my wireless but could not go further as my wireless wouldn't add the roku.  I looked it up online and several had the problem.  Roku offers a free hdmi extender which can give better connection to the internet.  I didn't order it.  I just took my roku stick upstairs and switched it and it worked upstairs.  As far as channels I have a new smart tv that comes with channels and it hardly has any channels.  I also have 2 DVDs that stream and again hardly no channels.  The roku has so many channels.  We like vudu  hulu netflix hbo target ticket amazon our cable on roku ae history/history2and local news channels and other news channel all over plus so many more.  Some you can buy, like I bought old western movie channel and old scary movies etc.  I paid 5 bucks and just once for each about and there is so many to watch and doesn't expire.  My husband watches the storage wars, pickers, alien shows, duck dynasty etc. on the free ae or history channels.  Netflix and hulu ugh have to pay for monthly like 16 buck for both about and get sooooo many shows and movies.  Vudu, amazon target ticket m go you rent or buy movies.  Often they offer free codes online so we get free movies often.  I love roku and what it offers.", "verified": false, "helpfulness": "1/1", "author": "Wendy S. Domros \"ebookreader\""}, {"rating": 1.0, "review": "I'm so sorry I ever bought this. It's a complete nightmare. It is very slow and the remote rarely even works. Also, the Roku website is about as unhelpful as you can possibly imagine", "verified": true, "helpfulness": "0/0", "author": "RY"}, {"rating": 3.0, "review": "It really slow loading and the remote that comes with it is not responsive at all.  It takes a few minutes just to get to the main menu, and the remote lags really bad.  The phone app is a bit better, but it also takes a while to connect to the device.  Once I can actually get to what I want to watch it works well, but getting there is a pain.", "verified": true, "helpfulness": "0/0", "author": "Joel Neely"}, {"rating": 3.0, "review": "Works pretty much as described however the channels offered were somewhat disappointing.  I can't really give a good review because my internet connection is way too slow for the Roku to operate properly so I may be more satisfied with it after I get a better internet connection in a couple of years.  In the mean time I can only use parts of it like Pandora radio.  Can't really stream channels like Netflix or Hulu and only a couple of the Roku channels are watchable at certain times of the day.  Looks like I'll be stuck with my satellite dish for a while yet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Its perfect", "verified": true, "helpfulness": "0/0", "author": "leriver Campbell"}, {"rating": 1.0, "review": "This streaming stick worked fine for awhile but less than a year later, the sound stopped working and there's nothing I can do to fix the problem. Don't waste your money.", "verified": true, "helpfulness": "0/0", "author": "Katherine"}, {"rating": 5.0, "review": "Excellent product and delivered on time.  The stick does everything my Roku 3 does except gaming.", "verified": true, "helpfulness": "0/0", "author": "Tony Lewis"}, {"rating": 5.0, "review": "Great prdouct", "verified": true, "helpfulness": "0/0", "author": "Felix Valdez Medina"}]