[{"rating": 5.0, "review": "I already own a second generation of Roku but really love the stick.", "verified": true, "helpfulness": "0/0", "author": "Kurts gun"}, {"rating": 5.0, "review": "It's awesome works just like my tcl roku t.v.!!", "verified": true, "helpfulness": "0/0", "author": "Lawrence Barrow"}, {"rating": 5.0, "review": "Great upgrade from the original Roku.  Works with Dish World, a cheap sports streaming service as well as Amazon Instant and Netflix.Don't waste your money on a 'smart TV'.", "verified": true, "helpfulness": "0/1", "author": "Libertarian Believer"}, {"rating": 4.0, "review": "Setup was easy and it performs as advertised. Be aware that many of the channels are only free for an introductory period.", "verified": true, "helpfulness": "0/0", "author": "Rita Gunter"}, {"rating": 1.0, "review": "I should have returned it at once to start with it was freezing up constantly.  I had to take the batteries out and put them back in and then it start working again.  Besides this annoying feature, I am liked it pretty well.  Don't know if I have a defective Roku or what.  It has totally stopped working.  when it did work, I liked it pretty good.  NOW that it won't work, AND I have had trouble with it from the start, AND I can't return it due to the non-existent warranty, I HATE IT,  WATCH OUT, IF YOU GET ONE AND IT GIVES EVEN A TINY BIT OF TROUBLE, RETURN IT", "verified": true, "helpfulness": "0/0", "author": "MHS \"MHS\""}, {"rating": 5.0, "review": "Very easy to set up.  Works really well.", "verified": true, "helpfulness": "0/0", "author": "Tes"}, {"rating": 5.0, "review": "It works great", "verified": true, "helpfulness": "0/0", "author": "Edward Ryan"}, {"rating": 4.0, "review": "Our Roku stick has trouble with Netflix. We know it's not the internet or the account because it will work fine on the ipad, kindle, or iphone when it won't function on the Roku. Other than that, we love it! Price is great!", "verified": true, "helpfulness": "0/0", "author": "cbp"}, {"rating": 5.0, "review": "Easy, fast, woks great!  A few problems setting the internet password, but once you get through that your worries are over.", "verified": true, "helpfulness": "0/0", "author": "Jules"}, {"rating": 2.0, "review": "Many online posts concerning this issue. I have a soundbar with a wireless subwoofer, and another pair of wireless speakers in my living room. Not sure if this is part of the problem with roku stick wireless remote. Anyhow, several times a day, I have to remove the roku remote's batteries, press the remote's pairing button, then reset the roku stick. I recommend not getting the roku stick, and instead getting another product. Or, maybe the Roku 2, or Roku 3 stand alone models, since they use infrared instead of wireless.", "verified": true, "helpfulness": "1/1", "author": "Ron Kropp"}]