[{"rating": 5.0, "review": "Exactly what i was looking for. None of the games just streaming apps.", "verified": true, "helpfulness": "0/0", "author": "nathaniel slider"}, {"rating": 5.0, "review": "This worked absolutely amazingly.!  I got this because Time Warner was changing the cable from analog to digital, so most of the channels don't come in without a box.  Our TWC bill is already unreal, and we didn't want to add another box.  I got this and the TWC app came on the device, so now on the second TV we can use it like on our Iphones - we actually have more channels now than before.  It is great!", "verified": true, "helpfulness": "0/0", "author": "artistpw"}, {"rating": 5.0, "review": "This thing is great.  I'm getting rid of my direct tv and this was exactly what I was looking for", "verified": true, "helpfulness": "0/0", "author": "Jenn Plumb"}, {"rating": 5.0, "review": "Went from chromecast to this device.  Love, love, love it!!!! No brainer if you're thinking of making the switch. It's a must.", "verified": true, "helpfulness": "0/0", "author": "Tracey Hall"}, {"rating": 5.0, "review": "Smart TVs don't hold  candlestick to Roku.  Great device that I will put on all my TVs.  Even my inlaws that are not tech savy are enjoying streaming movies and tv with theor Roku.", "verified": true, "helpfulness": "0/0", "author": "Timothy Ward"}, {"rating": 4.0, "review": "almost perfect.  I had a charge for $1+ in my bank account that says Roku.  It shows you that there are charges for some of the channels but no price...at least on most of them.  Really like it.  It gets a little hot being plugged in though.  Thats the main reason why is got 4 stars", "verified": true, "helpfulness": "0/0", "author": "K9rotehexe"}, {"rating": 5.0, "review": "I bought the Roku Stick to stream MLB.TV Cub games.  It works great, and now I am checking out the other stations that come along with it.  Go Cubbies!!", "verified": true, "helpfulness": "0/0", "author": "J. Pekarek \"jpeck\""}, {"rating": 5.0, "review": "Great works good and is easy to use", "verified": true, "helpfulness": "0/0", "author": "ALLEN SISLER"}, {"rating": 5.0, "review": "Its a great product. I first brought chromecast but didn't like the fact that it doesnt have its own screen.Thats when i found Rokustick.It is simply awesome. No complaints Whatsoever. The remote is very convenient. I also downloaded roku app which also has a remote and works great.", "verified": false, "helpfulness": "0/0", "author": "nature admirer"}, {"rating": 5.0, "review": "wonderful love it", "verified": true, "helpfulness": "0/0", "author": "Betty Gladney"}]