[{"rating": 5.0, "review": "It does everything the Apple TV does, but at a fraction of the cost.WAYYYY better than the Chromecast.Chromecast has better screensaver pictures though.We own all three.", "verified": true, "helpfulness": "0/0", "author": "ShewpDaddy"}, {"rating": 4.0, "review": "This device gives me the kind of control I want over what I watch, and when I watch it.", "verified": true, "helpfulness": "0/0", "author": "Darryl Branning"}, {"rating": 2.0, "review": "Claims of thousands of movies and TV shows is very misleading. News briefs are very low quality production. PBS library is extremely short. For god's sake, it is a public television and most of their shows should be available. Not too many full length programs are listed. Very disappointing..", "verified": true, "helpfulness": "1/1", "author": "Aydin Guc"}, {"rating": 3.0, "review": "Easy to set up. However, I have been unable to get FREE videos from the Amazon site, in spite of my PRIME status.", "verified": true, "helpfulness": "0/0", "author": "Michael N. Zaharias"}, {"rating": 5.0, "review": "love it.  Greatest thing since sliced bread.", "verified": true, "helpfulness": "0/2", "author": "00$6.95"}, {"rating": 4.0, "review": "It does what it promises to do. The Roku stick we purchased is the most basic one, thus, I assume, is also the slowest on start-up. This is why We took away one star in ratings. The other issue we are having is, strangely enough, related to amazon videos. Roku has a problem buffeting Amazon videos. We experienced it with the movie 'Redemption' and again with 'Parker'. Both run of the mill 'the killed him, and he ran off' time killers. We did not experienced any problem watching the same streamed movies on Netflix. I have to add that our internet is provided via satellite.", "verified": true, "helpfulness": "0/0", "author": "J. Sobelman"}, {"rating": 5.0, "review": "this little stick is cool; i now have netflix and hulu plus in my living room and just ordered another stick for my bedroom.  i was thinking i might need the bigger unit, took a chance with the stick and it has been working great and as advertised for a few weeks now.", "verified": true, "helpfulness": "0/0", "author": "Lex Pruitt"}, {"rating": 5.0, "review": "Simple instructions, TV was online in minutes.I unplugged it from the first TV, and plugged it into another TV, and started watching there with no problem.I also lost the remote. So I downloaded the Roku app on my iPad, and now just control the TV with my devices. App automatically finds your Roku on your wireless network, so there is no passwords or set up.", "verified": true, "helpfulness": "0/0", "author": "Joellyn Jarvis"}, {"rating": 5.0, "review": "excellent, easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "Sergio Rodriguez"}, {"rating": 5.0, "review": "This works good even with our slow DSL internet. There is a  lot of free stuff available and it works well to stream Amazon movies.", "verified": true, "helpfulness": "0/0", "author": "JimBow \"jp_bowhunter\""}]