[{"rating": 5.0, "review": "I love my Roku Streaming Stick. We use it in the bedroom and it is a great device.Pros:It plays all the big apps/channels we use (Netflix, Amazon Prime, Hulu, Watch ESPN, HBO Go, and PBS). I got this instead of the Google Chromecast beacuse it has an actual interface on the screen and a remote. I love that you can add just the channels you want and get rid of any you don't use.Cons:Not a huge deal, but it takes a long time to boot up, compared to my other devices (Apple TV, Sony Blu-Ray Player, PS3). But I always just turn on the TV, then go brush my teeth and stuff for bed, then it's ready to go when I get back.Also, it can be easy to accidentally bump one of the buttons at the bottom of the controller (especially in a dark room) and suddenly be taken away from a show you're watching on Hulu to jump to Netflix. Back-lit buttons would help. The Netflix and Amazon Prime shortcut buttons are convenient, but what's up with the Blockbuster button? A Hulu button would have been ideal.Summary:Even though I listed some cons, I still gave the device 5 stars because, ultimately, it allows us to watch all the shows we want in our bedroom without cable or satellite! I highly recommend this to anyone looking to \"cut the cord.\"", "verified": true, "helpfulness": "0/0", "author": "Josh Bledsoe"}, {"rating": 4.0, "review": "So far,  this doesn't work quite as well as I had hoped.  The set up was a hassle.  I don't understand why it will not let you plug in a keyboard to your tv for all the signups!  Using the remote to enter your email and passwords for Netflix, Amazon Prime, etc - is a royal pain.Aside from the set up, it seems a bit slow to start up.  This might be my internet/wireless - I do have service coming for that.  I'll update if it fixes after they replace my modem.For anyone, who is like me, and thought they purchased a smart tv but didn't -- this is a handy little tool to plug into your tv so you can watch Netflix & Amazon Prime without having to turn on your PC.  It has other options, I have not tried and doubt I will anytime soon - such as paid tv/movies, and various other paid watching choices.It does what I wanted it to do and simplifies the process of watching / streaming to my tv - so I'm basically satisfied.I think it works better (for me) than Chrome would have - since I don't have an android phone to stream from.", "verified": true, "helpfulness": "0/0", "author": "Janet"}, {"rating": 4.0, "review": "easy to install and use", "verified": true, "helpfulness": "0/0", "author": "DBS Bill"}, {"rating": 1.0, "review": "Nothing but problems.  Connectivity issues where there should be none.  Password issues where there should be none. Constant resets.  I have a Roku 3 that has been an excellent product.  The streaming stick is crap.", "verified": true, "helpfulness": "0/0", "author": "CraigT"}, {"rating": 4.0, "review": "I like this much better than the Chromecast we previously bought.  The device is menu driven and the remote works great.  I'd recommend it to anyone looking for a few movies for free.  Thus far though I wouldn't suggest that the 'newest' movies will be available to you if you buy it.  But still, it works great for the money!", "verified": true, "helpfulness": "0/0", "author": "M. Dunlap"}, {"rating": 1.0, "review": "We have another roku so I was excited to hear of the Roku stick.  My advice, save yourself a lot of headache and don't buy.  First to even link it was difficult and I had to watch You Tube videos for the secret screen in settings.  When I finally got it linked it was very slow, meaning I couldn't even pull up movies to try to watch them.  I had very high hopes for this and was very disappointed.  I have returned to Amazon and had to pay shipping for return.", "verified": true, "helpfulness": "0/0", "author": "Jon Ackman"}, {"rating": 1.0, "review": "The best thing I can say about this product is that Amazon gave me a full refund without any hassle.  I tried to hook this to my TV but never got it to work.  Roku support was worthless.  After return, I purchased a NetGear device that connected without any problems and works fine.", "verified": true, "helpfulness": "0/0", "author": "Mark H. Kolman"}, {"rating": 1.0, "review": "ROKU STICK DID NOT WORK. COULD NOT CONNECT TO LOCAL INTERNET COMCAST/XFINITY AND GOT AN ERROR MESSAGE. ADVERTISED AS PLUG IN AND READY TO GO. REALLY NOT TRUE. SPENT HOURS AND HOURS AND THEN ROKU TOLD ME TO CONNTACT COMCAST AND HAVE THE SECURITY SETTINGS LOWERED TO THE LOWEST POINT. ALL OF MY OTHER DEVICES WORK EXCEPT ROKU.I GUESS THEY WANT ME TO MAKE IT EASY FOR HACKERS BUT NO WAY. RETURNED IT", "verified": true, "helpfulness": "0/0", "author": "Sascha"}, {"rating": 4.0, "review": "So far, so good! Compact, you can't even see it! Easy set up, lots of options for streaming apps.", "verified": true, "helpfulness": "0/0", "author": "Aella W"}, {"rating": 1.0, "review": "I can't really give this product a fair rating as it didn't work long enough to test it out.  It worked for a month or two (probably only used 4 times) and then it wouldn't start up (freezes immediately at the Roku logo screen).  My mistake for assuming the warranty period would be longer than 90 days.  Now I have wasted $50 and at least an hour of my life with Roku technical support.Pretty sad that a device that just sits there plugged into your tv can die so soon after very minimal use.  I guess I know why the warranty period is only 90 days.  As this is this is the second Roku product that I have had issues with shortly after buying, this will be my last Roku product purchase.", "verified": true, "helpfulness": "2/2", "author": "D. Seabrook"}]