[{"rating": 5.0, "review": "couldn't be happier.  works perfectly", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 1.0, "review": "Returned item. Unless you like a slow TV experience, buy the Roku 3 instead. Well worth the additional $50. The streaming stick was noticeably slow and took forever to load anything. Frequently crashed, half the apps froze when opening. No issues found with the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "fun cook"}, {"rating": 5.0, "review": "It TOOK A LITTLE HELP FROM MY TEEN NEIGHBOR TO INSTALL & ITS BEEN A LEARNING EXPERIENCE TO SIGN UP & TEST ALL MY CHANNELS, BUT AS A 75YR OLD NON TECHY  i'M ENJOYING MY NEW TOY , PLUS THE SAVINGS IN CABLE COSTS!!!", "verified": false, "helpfulness": "0/0", "author": "Shirley Solus"}, {"rating": 5.0, "review": "Impressed with simplicity and form factor.  Obviously, not nearly as fast as the Roku 3, but for back porch and bedroom, this exceeds the need.  Well done Roku!", "verified": true, "helpfulness": "0/0", "author": "USERBOSCO"}, {"rating": 1.0, "review": "Set it up on Sunday. Worked fine on Monday. Was dead by Wednesday! Worked for nearly an hour with online support to determine the problem was with the Roku unit. They suggested working with retailer (not Amazon) to return it. Unfortunately online retailer is not equipped to do replacements so sent 2 e-mails back to Roku to see about getting a replacement from them. So far I've heard absolutely nothing back. Likely I will have to return it to the retailer (and probably get charged a fee) or toss in trash.", "verified": false, "helpfulness": "0/0", "author": "DGBradley"}, {"rating": 5.0, "review": "Exactly what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 3.0, "review": "Did not meet my expectations.  Thought Roku would give me more of what I don't currently have through cable TV.  It is a good buy for a 2nd or 3rd TV but mine dont have HDMI inputs.", "verified": true, "helpfulness": "0/0", "author": "Angela Marie"}, {"rating": 5.0, "review": "Excellent. Works perfect. Easy set up, connected to my wi-fi without a problem (by the way, my wi-fi is just my phone that I use as a hot spot)my TV is a new one that has a USB right next to the HDMI, and it works without a problem.So far no issues, but I just have it for a day, I don't think I would have any though, but I will update if something happens.", "verified": true, "helpfulness": "0/0", "author": "Dan WPB"}, {"rating": 5.0, "review": "The best product I have bought all year!  Fantastic and easy to setup", "verified": true, "helpfulness": "0/0", "author": "Melissa Armstrong"}, {"rating": 5.0, "review": "Price was right and works great.", "verified": true, "helpfulness": "1/1", "author": "T. Chapman"}]