[{"rating": 4.0, "review": "Streaming Stick works better than I imagined. I was pleasantly surprised to find so many channels and special interest channels that I look forward to getting to all of them some day.", "verified": true, "helpfulness": "0/0", "author": "Judy A. Silva"}, {"rating": 2.0, "review": "Controler doesn't work, and phone app won't keep its link to stick. I own one stick and have never had any problem with it and have pruchased two others for gifts and they work well but this one just doesn't. So sad!", "verified": true, "helpfulness": "0/0", "author": "Joan"}, {"rating": 5.0, "review": "My son uses this daily.  A little effort and a call to customer service (they were great) during set up and couldn't be happier.Netflix, Amazon Prime, YouTube and so much more", "verified": true, "helpfulness": "0/0", "author": "Grandma in Oregon"}, {"rating": 4.0, "review": "I use it mainly for Spotify.  Works pretty well but the remote sometimes goes wonky. It also doesn't give you as many options as the Spotify app on the phone and computer.", "verified": true, "helpfulness": "0/0", "author": "nestof3 \"Dawn\""}, {"rating": 1.0, "review": "Quit working after 24 hours. Remote kept losing connection, unit would freeze up, then couldn't reconnect to wireless network. Roku suggested I contact my ISP provider and manufacturer of my wireless router to resolve the problem, despite the fact that none of my other wireless devices had connection issues. I'm going back to my Roku Classic--it may be old but it works!", "verified": false, "helpfulness": "0/1", "author": "Steve"}, {"rating": 1.0, "review": "Remote not working.  Tried multiple steps but not working.  Disappointed", "verified": true, "helpfulness": "0/0", "author": "Hammy \"Hammy\""}, {"rating": 4.0, "review": "Still getting accustomed to this little device. Controls behave differently from our main Roku. Plugs into a USB port, and can take power from it if the bus isn't already loaded to the max. Otherwise needs to use the supplied wall wart for power. Really enjoy the service Roku provides. Conveniently transferrable from one set to another.", "verified": true, "helpfulness": "0/0", "author": "Organgrinder1010"}, {"rating": 5.0, "review": "This roku stick is all it says it is. Very easy to setup and use some say best to use the roku app to operate the stick me i like the remote best.", "verified": true, "helpfulness": "0/0", "author": "de"}, {"rating": 1.0, "review": "RETURNING THIS ITEM. IT DOES NOT WORK, FREEZES UP AND CAN NOT USE IT", "verified": true, "helpfulness": "1/2", "author": "amy harless"}, {"rating": 4.0, "review": "Works fine. Just wish it would stream ripped content from my media server.", "verified": true, "helpfulness": "0/0", "author": "Monte"}]