[{"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Benjamin Dubinsky"}, {"rating": 5.0, "review": "THIS IS THE COOLEST THING WE HAVE BOUGHT IN A LONG TIME.  EASY TO USE TO STREAM INTERNET STATIONS NETFLIX, HULUAMAZON ETC.....100 OF OTHER STATIONS NOT ON CABLE.JUST PLUG IT INTO YOUR TV LIKE AND USB WHAT COULD BE EASIER........LOVE  IT.", "verified": true, "helpfulness": "0/0", "author": "Pat H"}, {"rating": 5.0, "review": "Bought this a few months back and have to say this product is great.  Easy to use, great for older non smart Tv's and very compact.  Great job on the product!", "verified": true, "helpfulness": "0/0", "author": "Q. Julie T."}, {"rating": 4.0, "review": "The batteries that came with the Roku were dead. Other than that, I like it. I have a Vizio, which is a smart tv with the apps built in. And I got this for my other tv. This is my first time using a Roku product and it was easy to set up and user friendly. So far, no complaints.", "verified": true, "helpfulness": "0/0", "author": "Kristina KP Patrice"}, {"rating": 5.0, "review": "Love it! Works perfectly", "verified": true, "helpfulness": "0/0", "author": "Irina"}, {"rating": 1.0, "review": "Worked for a short time. This is not the first unit that stopped working well.", "verified": true, "helpfulness": "0/0", "author": "RG"}, {"rating": 1.0, "review": "I purchased my Roku 3500R Streaming Stick at a local retailer - intended for use to watch Netflix and NBA League Pass.  The Streaming Stick worked flawlessly for 28 days and thereafter will not see any WiFi signals at all.  Took it back to the store and got a replacement and the remote control of the replacement unit failed in exactly one month.  Contacted Roku online support and received a replacement remote control by mail.  Then a little over a month later, the Roku Streaming Stick - even though it's connected to my WiFi signal - will not connect to any of the streaming servers.  I'm quivering in my sandals at what could possibly happen next...This thing is just a WiFi adapter with a bit of flash memory/ROM to hold your sign-on information and a simple Roku program, so it's only like ... slightly more sophisticated than a lightbulb or mashed potatoes, okay?  How can one F up something this simple is beyond me.I hope y'all have better luck than me.  As for all the troubles I'm suffering thru, I'll say:  \"Inshallah!\"", "verified": false, "helpfulness": "0/0", "author": "bob chang"}, {"rating": 4.0, "review": "Good product, a bit slow to start, but gives you options.", "verified": true, "helpfulness": "0/0", "author": "Ed L"}, {"rating": 4.0, "review": "Great addition to my home. Although ive got to say ive got Roku 3s as well. And the difference is night and day. Roku 3 is at least 10 times faster. Nevertheless this is great for when travelling. Hotels and al.", "verified": true, "helpfulness": "0/0", "author": "Osama Ebrahim Ali"}, {"rating": 5.0, "review": "Came on time and works great", "verified": true, "helpfulness": "0/0", "author": "brendan"}]