[{"rating": 5.0, "review": "Product performance is very good, very satisfied!", "verified": true, "helpfulness": "0/0", "author": "ZOU XIAOGU"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/1", "author": "Gregory Alan"}, {"rating": 1.0, "review": "Didn't work. Had a purple screen every time I tried watching a video. Spent hours online going through known fixes for the issue. And contacted customer support and went through everything they had to say. It was defective. Got a refund and bought one at Walmart that works just fine without having to wait on shipping again.", "verified": true, "helpfulness": "0/1", "author": "Mog"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Karen J Citrano"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/1", "author": "Edwin Rojas Villar"}, {"rating": 3.0, "review": "Great when they work right!  The one I had periodically stopped working and I had to reset it. Also its seems one time a button does a function one way and differently another time.  I suppose this could be operator error but there is not documentation to explain how it is supposed to work. The last thing is it has no on off switch. so even though your tv is off whatever you were watching could still be running. Of course  the ability to get content from so many services still made it worth the money  and I bought another one after the first one died", "verified": true, "helpfulness": "0/0", "author": "C. Morrison"}, {"rating": 5.0, "review": "Bought for my Mother who never watched TV. She loves it and can use it easily.", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 5.0, "review": "I oreder it from México, it arrived super fast and everything was perfect! :)", "verified": true, "helpfulness": "0/0", "author": "Nidia Lizzeth Lopez"}, {"rating": 4.0, "review": "Good deal for the certified refurbished. What you would expect from a roku. Had some channels i wanted over the amazon set top box. I would have preferred to have that option with voice recognition, but limited by one specific channel i can only get on roku.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Baynes \"Jon B IT GUY\""}, {"rating": 2.0, "review": "I got this because I wanted to be able to stream Netflix and other things in my bedroom.  It synced just fine with my wireless, but after that it kept freezing.  I never even got a chance to watch anything because the screen would just freeze for minutes at a time.  Maybe this is because the bedroom is the furthest room from the wifi?  Other stuff works though.  I returned and will try the more expensive unit that is not the USB.", "verified": true, "helpfulness": "0/0", "author": "Josh Moeller"}]