[{"rating": 3.0, "review": "It's not bad for this price. But I'd like to make two manufacturer's descriptions clear. First, so called thousand channels, almost all of them need registration and other charges. Second, there are some news channels like CBS, WSJ, but you have to be patient since they always stopped for buffering.", "verified": true, "helpfulness": "0/1", "author": "ilham"}, {"rating": 5.0, "review": "I love this item I had never heard of this till I changed my TV and inside it told me to buy  this stick so I did and it's been great Thank You", "verified": true, "helpfulness": "0/0", "author": "Ne"}, {"rating": 5.0, "review": "I received this Roku device that was refurbished. All items were in the packaging and looked to be brand new. I plugged it into my TV's Hdmi port, and to an outlet, and was up and running in less than 10 minutes. The roku connected to my wireless network and I haven't looked back since. Great picture, and sound. Almost no buffering. Totally satisfied.", "verified": true, "helpfulness": "0/0", "author": "TV_PC Guy"}, {"rating": 5.0, "review": "very pleased", "verified": true, "helpfulness": "0/0", "author": "richard pavonetti"}, {"rating": 4.0, "review": "Bought mine 3 months ago.  I had no issues with setup.  Biggest challenge was entering WiFi security information to bring the device into our home network.  It worked well for almost 3 months.  Then the remote stopped communicating with the screen.  So all I got was the floating Roku logo moving over the screen.  Changed batteries in the remote.  Still got only the floating logo.  At that point I was going to give it 2 stars for 3 months of working well before dying.  But I went on the Roku Support website and waited in line for about 30 minutes for a chat session.  Finally got some help .  Here is the process (so you don't have to wait 30 minutes).  Pull the batteries.  While they are out, pull the stick out of the screen and pull the power wire out of the stick.  Wait 20 seconds.  Reconnect power wire, put stick back into screen (that reboots the stick), and put the batteries back into the remote.  After a few seconds, it was working again.  So, I deducted 1 star for not including that information in the box or posting it in plain view on their website.  But I'm generally pleased with the product now that it's working again.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Space Ranger\""}, {"rating": 2.0, "review": "I have owned and enjoyed two units of the Roku 3 so when I was looking to buy an additional unit I decided to try the steaming Stick to have a more portable unit for traveling....but unfortunately the steaming Stick works nothing like the Roku 3.....To begin with the Roku 3 actually works...Right out of the box the Stick took almost a hour to sync up with it's remote... even then it would drop off a lot..sometimes I was able to use the Roku app on my smart phone but even then it was hit or miss...and when it did work it seemed to lag from when I pushed the button to actually having the action take place.The unit itself seemed to need time to \"warm up\".  When I turned on the TV it would take a good 3 minutes of watching the Roku screen saver before it would switch to the channel selection....unlike the Roku 3 which is immediately ready...To be fair it is possible that having the Stick plug into to back of the TV as oppose to directly to an electrical outlet could have  contributed to the delay time... but one of the selling points of the Stick was to eliminate the need for an additional outlet.Once the Stick worked it played fine with good picture, however (maybe due the remote lag) rewinding and forwarding on the Stick was a nuisance, either going too far, not far enough or not working at all. Too many times the Stick would have to \"rebuff\" or reload the problem... again this could be in part to the channel I was watching but this was more of a common occurrence on the Stick when it was a rare occurrence on the Roku 3.One of the biggest problems and the one that finally prompted me to return the Stick was that it would fall off my wifi too many times... even though the Stick itself would say it was connected, the individual channels would not work... At first I put the blame on the channel (in this case Netflix), but this was happening too many times.  I would be playing Netflix on the Roku 3 in my office and walk down the hall to my bedroom, to watch on the Roku Stick and it wouldn't connect, I previously had the Roku 3 in the bedroom and can't remember any such connection problems.... so I know it wasn't a location situation.  After I discovered the problem wasn't a Netflix problem but that the Stick wasn't connecting with any channels, I read more of the reviews here and determined I was having the same problems many people were having.In the end... I like the Roku products... good channel selection ... easy to use... otherwise I wouldn't have just ordered my third Roku 3 unit at double the price. But this Stick just didn't make the grade.... maybe the next version will work better, meanwhile I would go with the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "DT"}, {"rating": 4.0, "review": "Makes streaming content super easy. I like the interface. The remote is easy to use and does not need line-of-sight to the Roku. They have TONS of channels. Many of the channels are free and some have excellent content.The only change that would make this easier to use would be better price labels in the channel store. The price listed is what Roku charges for the channel, but does not state whether an outside subscription is needed to access content. For example: Netflix is listed as free, but you need a Netflix subscription (not free) to access anything from that channel.If they changed the pricing labels to state when an outside subscription might be needed and allowed browsing just the free with no subscription channels, then I would rate it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "spitofland"}, {"rating": 5.0, "review": "Love my Roku's ..this is my fourth unit. I have two sticks now and they work great. Very happy with Roku streamers.", "verified": true, "helpfulness": "0/1", "author": "doityourselfer"}, {"rating": 5.0, "review": "I have the Roku 3 on my main TV which is not a \"smart\" TV.  For my next TV purchase, I wanted a smart TV so I wouldn't need any extras to watch Netflix, Amazon Instant Video, Hulu Plus etc.  I ended up with a Samsung Smart TV.  The TV is great but the \"Smart\" part of it is hit and miss.  Some days it just doesn't want to work or it makes me re-install an app over and over.I got sick of it.  I saw the Roku Streaming stick was released and was much less money than the Roku 3.  While I love the Roku 3, I didn't want to spend that much money when I didn't necessarily need another Roku.I got the Roku Streaming Stick and it was quick to setup.  I put it in the HDMI port and connected the power cable to a USB port on the back of the TV to power the thing.  It worked much more reliably than the Smart TV functions built in to the TV.  It responds pretty quickly and I never have issues with having to re-install apps or anything.I did notice that when I turned off my TV and then turned it back on, the Roku had to start up again.  It seems that at least on my TV the USB isn't powered when it's off.  So that could be a great feature if you want to save a little on power but I'm more concerned about not having to wait to watch TV.  So I ended up unplugging it from the USB port and using the AC adapter to plug it into a regular outlet.Both my TV's are wall mounted and it's nice not to need a extra mounting bracket like the other Roku models.  It's small, easily portable, reliable and I think Roku has the best \"smart\" TV viewing experience.On another note, I also have a Chromecast.  I like the Roku Streaming Stick better.  It's nice to have a dedicated remote and an interface.  You can \"cast\" to the Roku as well.  With the Chromecast, I had issues at first trying to figure out how to get it to stop.  The Roku is intuitive and smooth.", "verified": true, "helpfulness": "0/0", "author": "MarkR"}, {"rating": 4.0, "review": "Good product, navigation is awkward though (minimalist remote is both a boon and a curse- typing is a pain, but the buttons on the remote are very easy for non-techies to read)", "verified": true, "helpfulness": "0/0", "author": "Jett Vance"}]