[{"rating": 5.0, "review": "love it ..", "verified": true, "helpfulness": "0/0", "author": "Reju"}, {"rating": 5.0, "review": "Amazing device. I love the fast remote control. Then I don't have a smart phone to run the roku. And now it's up to 2000+ channels! Who needs Dish and Cable anymore?", "verified": true, "helpfulness": "0/0", "author": "Barry"}, {"rating": 5.0, "review": "I ordered another one for the spare bedroom for company. It took about an hour to set it up and add all the channels I had with my other one. Surprisingly, both Roku devices were able to stream at the same time using the same wireless connection with no buffering.", "verified": true, "helpfulness": "0/0", "author": "Ohioboy1962"}, {"rating": 1.0, "review": "Worked great for a while.  Now, I can't download Amazon movies using it.  I use my laptop instead.  My last Roku lasted years, but wasn't a stick.", "verified": true, "helpfulness": "2/2", "author": "Rick Briesch"}, {"rating": 1.0, "review": "I am so disappointed in the Streaming Stick.  I loved that it just plugged right into the tv without any cables or setup.  It worked fine for awhile.  Now, however, it stops every few seconds to reload.  Sometimes it will work for a short while, then it is back to the reloading.  It ruins any movie or program you are trying to watch.  Unfortunately, I didn't purchase the warranty with it...I will next time.  I'm going back to the box until they work the bugs out of this one.  Ok, I need to edit this review. It turns out  that the fault evidently lies with my WiFi. It seems the Roku requires 21/2 megs to operate and my home is in rural Oregon, where we only get 11/2 megs. Therefore, my Roku had to keep stopping and trying to get enough power to stream. As I am still in rural Oregon, and can still only get 11/2 megs. I cannot say positively one way or the other. I have read other reviews of people having the same problem, so I don't know.  As for myself, I will wait for the next version of stick to come out.", "verified": true, "helpfulness": "2/2", "author": "Mary Buker"}, {"rating": 1.0, "review": "Five + hours to setup. Including a $50 call to AT&T; which Roku told me I needed to made to change the Primary and Secondary DNS changed. AT&T; ended up telling me they couldn't change the settings. So I call Roku back, they have me do the same thing I did (unplug and replugin my router) with the first person I called at Roku and this time it works. So I have no idea why it is working. I asked them if they knew why it was working and they told me that it is standard to have the DNS address changed. I reminded them that AT&T; DIDN'T change the DNS address. They couldn't offer an explanation except that it was working now. So I don't know if it is a defective device. Regardless, why didn't it work the first time we plugged it in? Very disappointed and out another $50 that wasn't necessary. At least not for any reason that Roku can give. We've had other Roku devices but this stick thing is very unimpressive.", "verified": true, "helpfulness": "1/1", "author": "Katherine Harris"}, {"rating": 5.0, "review": "I purchased the Roku Streaming Stick a month ago and it has surpassed my expectations. I have since cancelled my satellite subscription and rely solely on Roku for my television entertainment. Best investment I have made in a long while.", "verified": true, "helpfulness": "0/0", "author": "Withro Wiggins Jr"}, {"rating": 5.0, "review": "Good service and options", "verified": true, "helpfulness": "0/0", "author": "James R Gard"}, {"rating": 5.0, "review": "We are watching the free movies available through Amazon Prime with this Roku. We love the movies on demand. It does not have as much storage as the next larger Roku or as the Amazon streaming device, but we are not going to buy movies, so we don't need that much storage. I tried to order the Amazon device, but they were out of stock, but this inexpensive Roku does everything we need.", "verified": true, "helpfulness": "0/0", "author": "Southern Lady 31 \"bookworm\""}, {"rating": 5.0, "review": "Works great. Packaged well, Directions understandable!  Good as new.", "verified": true, "helpfulness": "0/0", "author": "Marie C."}]