[{"rating": 4.0, "review": "okay", "verified": true, "helpfulness": "0/0", "author": "MO'Brien"}, {"rating": 1.0, "review": "not able to play mkv format having dual audio.cast screen also not working. useless device.", "verified": true, "helpfulness": "0/0", "author": "rajneesh"}, {"rating": 4.0, "review": "Purchased as a gift.  Only drawback was that you have to enter your credit card info at setup.  I believe you can remove after setup according to the recipient.", "verified": true, "helpfulness": "0/0", "author": "671buyer"}, {"rating": 5.0, "review": "This rocks and is so much better than cable.", "verified": true, "helpfulness": "0/0", "author": "Luv2read"}, {"rating": 3.0, "review": "Gave this 3 stars because refurbished products are hit or miss. Received product and will not display picture. Tried on 3 different HDTVs, with USB plugged into the TV and a power outlet. Still was unable to bring up a picture. Ordered a brand new one to replace the broken one I received.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "I actually did not have high expectations for a little device that just plugs into the back of my tv, but I've been pleasantly surprised.  It's so easy to use, even for my kids, and it's so fast.  Much better than the junky Netflix app we have on our Blu-ray player, and it's also replacing our wii for streaming.  The picture is always crystal clear.  I love that I can have a small stick that doesn't take up space like a Roku box would.", "verified": true, "helpfulness": "0/0", "author": "5Mom5"}, {"rating": 5.0, "review": "My second one of these!!  They're awesome!!", "verified": true, "helpfulness": "0/0", "author": "Jim Mantey \"dog lover\""}, {"rating": 2.0, "review": "When the remote works, its fine. The remote is horrendous. Ready to throw whole thing in garbage. Pain to hope it works at any given time.", "verified": false, "helpfulness": "0/0", "author": "mickel"}, {"rating": 4.0, "review": "Very good Video Quality!", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 1.0, "review": "Have not yet been able to get it to work!!  Have had several more tech saavy folks look at it--nothing.  Waste of money!", "verified": true, "helpfulness": "0/0", "author": "Linda Behrendt"}]