[{"rating": 5.0, "review": "Performs just as well if not better than the bigger Roku boxes. I was worried that it being such a small device, performance would take a hit, but it doesn't. I like that it can be powered through a USB port, but also comes with a small AC adapter. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Flatus Faceflicker"}, {"rating": 5.0, "review": "Great product for streaming!", "verified": true, "helpfulness": "0/0", "author": "Christy \"Rachel's Momma\""}, {"rating": 5.0, "review": "I've never had one problem with it.  It works wonderfully.  This was my attempt to get rid of cable TV and it worked.  You really do get a lot of channels.  The only one I pay for is Netflix, so for 7.99 a month, it's so much a better deal than cable.  The PBS channel is great too.  I love more than anything being able to watch a TV show when I want to, and be able to pause, and most importantly (with Netflix) be able to watch TV without commercials.  It has spoiled me.  The only drawback is that I have to keep unplugging it to watch regular antenna TV... It interferes with the reception otherwise.", "verified": true, "helpfulness": "0/0", "author": "Amy L."}, {"rating": 1.0, "review": "Since you asked:  I don't know whether the thing works or not.  My TV, of course, didn't have the Prime Logo so I went to Roku helpline.  Mostly, I couldn't understand the technician, but the others in the background were having a good time.  After some time I got the code and was directed to go to Amazon Prime and tried to log on with the code, but was blocked by Mozilla as an unsafe site.  And, that's where it ended for me.  Might try sometime later, might not.", "verified": true, "helpfulness": "0/0", "author": "Marcus R. Miller"}, {"rating": 4.0, "review": "A bit slow but a great product for the price", "verified": true, "helpfulness": "0/0", "author": "Red Dragon"}, {"rating": 5.0, "review": "I sent this back before I actually got to open it.  We returned our tv and purchased a smart tv.  Therefore, there was no need for this product.  My so in law had this loved it and recommendIt to me I'm sure it would have worked great had I needed it", "verified": true, "helpfulness": "0/0", "author": "Cathy"}, {"rating": 1.0, "review": "Do NOT buy this - spend the extra little bit and get the real roku 2 or 3.  We bought this in June 2014 and for the past 2 months we can barely use it because it will constantly disconnect from the remote and no amount of trying will get it to stay connected or work.  Only unplugging it and rebooting it does anything anymore, which takes 5-10 mins each time. I did find a work around using the roku app on my tablet and phone - but who wants to do that?  I just want to grab the remote turn on the tv and have it work... this DOES NOT!  We also have a roku 3 and had a roku lt before this.  Those all work fantastically, which is why I thought buying the stick was a no brainer.  I was right - I had no brains when I ignored the one star reviews and bought this anyway.  The Roku stick is a total piece of junk.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my Roku.  No issues at all.  Streams great!", "verified": true, "helpfulness": "0/0", "author": "Kathy Labit"}, {"rating": 1.0, "review": "Unfortunately, almost everyday I have to unplug and restart the stick so it can work again :-(", "verified": true, "helpfulness": "0/0", "author": "JULIANA RILLOS"}, {"rating": 3.0, "review": "I guess this is OK for a portable device, but if it's your main TV just get a Roku 3.  The stick has remote lag, takes forever to launch, and crashes in certain apps. Once it crashes it either gets stuck in the reboot screen or,  if it reboots, takes at least two minutes. It refuses to update to the newest version even though an update is available.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]