[{"rating": 2.0, "review": "Slow", "verified": true, "helpfulness": "0/0", "author": "Chad D. Hummel"}, {"rating": 5.0, "review": "Third Roku Stick I've purchased for family and friends now. It does the job of making your TV smart at a good price and I like some of the free channels that other streaming options don't offer.", "verified": true, "helpfulness": "1/1", "author": "Michael"}, {"rating": 1.0, "review": "Buy a Roku 2 or 3 instead.  The stick is unstable and terrible wifi performance and generally slow loading and response.  I have a Roku 1, 2, 3, and stick.  Thought the stick would be easy and out of sight.  But it clearly doesnt have the wifi reach or stability while all the other Rokus work fine.  It will play for 15 seconds then halt for 5 seconds repeatedly until I restart the stick by unplugging and plugging back in.  I have to do this every time I want to watch that particular TV.", "verified": false, "helpfulness": "0/0", "author": "Eric S"}, {"rating": 5.0, "review": "Came quickly, was given as a gift, and well appreciated. Product is terrific.", "verified": true, "helpfulness": "0/0", "author": "Bonnie"}, {"rating": 5.0, "review": "Works perfectly by plugging in directly to a HDMI port and the RF remote means you don't have to be \"line of sight\", you can plug the Roku in back and totally out of sight.", "verified": true, "helpfulness": "0/0", "author": "John M."}, {"rating": 1.0, "review": "I cannot even express how pissed I am with this device. Let me preface this review with the fact that I am a network engineer with 16 years experience in my field. This should be a 5-10 setup to get my daughters Roku setup and working, boots up, see the network just fine and downloads and update (from the Internet...). Reboots and tells me it is unable to connect the Internet, check all my other wireless drives and they are having zero issues getting out, go ahead and reset my WAP/Router and no change, all other devices are fine including other Roku's on the same network. Do some reading and it seems that the Roku has some bug that does not like private DNS addresses, which most routers proxy public DNS via their private IP (you gateway) everything works this way now days and worked fine for it to take the update that broke the device. I go ahead and perform the recommended change to force a public DNS from my DHCP server and no change, reset my router and the Roku, no change. Fire up the hotspot on my cell and it works fine, I am starting to wonder if it has a problem with my LAN subnet 172.16.254.0/24 I have read some threads on certain 192.168.X.0/24 subnets it does not like. I really do not want to double NAT This thing to work around the crap software it has, would be nice if you could manually set the IP and DNS servers in the damn things, but no.... JUNK", "verified": false, "helpfulness": "2/3", "author": "Nick Crocker"}, {"rating": 1.0, "review": "Big Warning: A credit card is required to activate this device.I gave this to my parents to Christmas, I thought it would be a good way for them to access various online video services. I connected it to the TV, then found out you have to create a Roku account to use it. I started the process, but gave up on the 3rd page when it required a credit card to continue. It looks like the card is supposed to be used for separate purchases, but if that's the case then I'm not sure why a credit card is required to activate the device. I can only assume they intend to introduce a monthly fee to use the device. I only got it for them so they could use services they already have (Netflix, Amazon, HBO, etc.).The isn't created until you add a credit card. You cannot skip the step, and you can't use the device without a credit card.Be particularly careful when buying this as a gift, anything that asks for your credit card but tells you it won't charge you is automatically suspicious, it's a common scam.", "verified": false, "helpfulness": "1/2", "author": "Andrew B. Madigan"}, {"rating": 4.0, "review": "Easy setup...Works well...I got this for my kids room as an additional ROKU...I love the idea of internet TV and getting rid of cable but I seem to be spending just as much if not more between Amazon Prime, Netflix, and streaming movies...oh well...as for this Roku...it is fast and good quality...good price point and I like that the buttons now have fast access to the most common channels.", "verified": true, "helpfulness": "0/0", "author": "Jon Messimer"}, {"rating": 5.0, "review": "Streaming TWC on the Roku.  No cable outlet in a room but wanted a tv there.  So, get ROKU stick, download time warner cable app, and off you go watching live tv.", "verified": true, "helpfulness": "0/0", "author": "Luke C. McLaren \"lukelawyer\""}, {"rating": 3.0, "review": "It wouldn't work for me on my TV.  I tried numerous times for several days, using more than one connection/channel on my wireless (even set up wireless hotspot on my phone - no luck).  Worked once & was able to watch about 5 minutes on Netflix & then wouldn't connect again (kept saying it was \"acquiring audio signal (now)\".  Gave it to someone else & it works fine for them.  Must have been some signal interference issues.", "verified": true, "helpfulness": "0/0", "author": "Gary"}]