[{"rating": 1.0, "review": "Worked for less than 90 days.", "verified": true, "helpfulness": "1/1", "author": "Jimmy W. Lyons"}, {"rating": 5.0, "review": "Works well. Still learning how to use it.", "verified": true, "helpfulness": "0/0", "author": "Patriot Dad"}, {"rating": 2.0, "review": "I've been looking for a solution to cutting the cord and getting off subscription TV.  I wanted to give Roku a try as I have not previously tried any streaming services.  I'll layout the steps and issues I encountered during setup and use to hopefully help others that may be thinking of purchasing this unit.1) SETUP - Easy enough to connect, plug into an available HDMI port.  I initially tried to plug it into a port that \"faced\" downward behind the TV but the size of the unit was too long to fit as the design allows for most wired connections but this is obviously larger (which may also be an issue for wall mounts).  So I plugged it into a side connector and the USB into the TV USB port.  Easy enough.  Now the setup the device.  You have to setup a Roku account (yes you need credit card info, not to purchase but in case you purchase channels later) then there was an extremely long time for it to update during which time I could not use any other device with my WiFi.  Then I choose channels and again a very long time as some channels (Netflix, Youtube, etc...) take a long time to add while others take a few seconds.2) CHANNELS - you may want to setup a separate email account as some channels require you to provide this information.  Also some listed as \"Free\" aren't free.  For instance the Dishworld channels are listed as free but when you try it you are prompted to Log in/Sign in and a subscription is 14.95 for 3 months.  Other channels have past season shows for free but more recent shows you'll need to provide your TV Provider info (so much for cutting the cord).  Then there are of course the paid subscriptions (Netflix, HuluPlus, etc...).  There are free channels of course, but to me it was kind of like the basic cable - a lot of channels I'm not interested in watching.  I will say my son however loved having the Roku setup - mainly so he can watch YouTube on the TV.  YouTube can also be used with your smartphone/tablet so you can find the video you want and send it to the Roku.3) PERFORMANCE - Initial setup was using my upstairs TV while the router is downstairs in the opposite side of the house.  As I mentioned I had it plugged into the TV USB for power, so when TV's off so is the Roku.  For some reason this setup seemed to hog the WiFi (U-Verse 12Mbps) and I could not use my tablet or smartphone during setup or even when channels are being added.  After setup I could use those devices but speed was an issue as both the Roku and other WiFi devices slowed to a crawl and the Roku would often display \"loading\" messages and play a second or two and go back to loading.  If I plugged the USB into the power strip, the Roku would not find my network, or if it did find it, it would only connect for a brief few seconds.  I plugged the Roku into a downstairs TV that was just a couple of feet at most from the router and it worked fine even with other WiFi devices accessing the network.  I therefore question the description for this device having \"A robust extended-range wireless connection seamlessly streams video with ease and speed\".  I also noticed when left plugged into a power supply that had the Roku always \"on\", the unit seemed quite warm.So for me, someone who wanted a wireless connection for an upstairs TV, this stick is an under-performer and is on its way back to Amazon.  I wish this was the solution I was looking for but sadly it falls short as the WiFi issues cannot be ignored.  Hopefully there will be improvements made in future devices.*** Update : I've since purchased a Chromecast.  The Chromecast had a WiFi/HDMI extender that helped as far as connecting it to the upstairs TV but the signal and performance, although better, still lagged a bit.  I tried a WiFi extender and it helped some but that stopped working after two days so I returned it.  I now have a new wireless router and it makes a world of difference as far as signal strength and performance is concerned.  I may reconsider getting a Roku now, if only they would warranty their products for more than 90 days!", "verified": true, "helpfulness": "0/0", "author": "TheLion"}, {"rating": 5.0, "review": "Easy set up. Great for travel. Good buy for the money!", "verified": true, "helpfulness": "0/0", "author": "Laura J. Brunson \"Sans Souci Girl\""}, {"rating": 1.0, "review": "Piece of crap. Never worked.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is so easy and awesome to use. Added to my bedroom tv and works like a charm! Set up in 5 minutes....at the most.", "verified": true, "helpfulness": "0/0", "author": "Diana Soto"}, {"rating": 3.0, "review": "I like the concept and want to like it,  but I constantly have to reset it because it is constantly failing and missing things.  That means I am constantly having to re-login to every one of my accounts and I barely have time to watch TV, let alone have to login every time I sit down.There is also something weird with the new Netflix interface.  I miss my Pandora button and I don't understand why the \"OK\" button is under the arrows instead of in the middle.  Fail!", "verified": true, "helpfulness": "1/1", "author": "Sadie \"vw head\""}, {"rating": 5.0, "review": "I was able to figure it out all by my self! Love it and LOVE Netflix!", "verified": false, "helpfulness": "0/0", "author": "Fran McCoy"}, {"rating": 5.0, "review": "This little gadget is unbelievable.  I was already cutting the cable cord in a measured way, but this thing just put the process into warp speed.  It works flawlessly.  The setup process is a little tedious and can take some time to set up a Roku account, enter Netflix account info, Amazon Prime account info, etc.  But once it's set up and you've chosen your channels, you're not gonna miss cable one bit.  The freedom of watching what you want, when you want it, in full HD, is refreshing.  Anyone looking to cut the cord or simply more freedom to watch what they want, buy this immediately.  Highly recommended.", "verified": false, "helpfulness": "1/1", "author": "Chacate"}, {"rating": 1.0, "review": "Didn't work for me.  I bought it to replace my old Roku box but couldn't get it to recognize my wireless network.  The nice thing about buying from Amazon is their no hassle return policy.  Bought the newest Roku box and it works like a champ!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]