[{"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "1/1", "author": "Aliki"}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "amazonwoods"}, {"rating": 5.0, "review": "Excellent! My husband loves it! Uses it all the time now.  Highly Recommend ThisItem.  A+++++", "verified": true, "helpfulness": "0/0", "author": "Pamela J. St Jean"}, {"rating": 5.0, "review": "Bought this for my mom, and she loves it.  If she can operate it, then anyone can!  If you have Netflix streaming, this is a must.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 1.0, "review": "Slow. The technology in the stick might be good, I don't know, probably not, but the service is slow. Stopped using it one week after fiddling with it. Wanted to set it up for mom. Menus and navigation too complex for her to handle.", "verified": true, "helpfulness": "0/0", "author": "Yu"}, {"rating": 2.0, "review": "I was excited to be able to watch tv from my bedroom. Sadly after several hours attempting to set it up I had to quit. it would only register one bar of my wifi. Netflix wouldn't get past the load screen without erroring. Amazon let me go to the sign-in screen but kept rejecting my password, then it froze. I tried it in my mother's room (where wifi router is located) and it worked flawlessly. I tried it in the living room and again it worked perfectly. The distance from the living room to router is MAYBE 5 feet closer than in my room with more walls for the signal to pass through. I returned it to Wal Mart (where I originally purchased it) and bought the Roku 3 instead.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"wreckelite\""}, {"rating": 5.0, "review": "I love this device Netflix looks amazing on it definitely worth buying you won't regret...shipping and delivery was also a breeze!", "verified": true, "helpfulness": "0/0", "author": "Angel Cisrow"}, {"rating": 5.0, "review": "Love it. Buying a second one.", "verified": true, "helpfulness": "0/0", "author": "OffroadJeepgrl"}, {"rating": 5.0, "review": "Best streaming device ever! Even cancelled my satellite!  I have all the tv shows I could ever watch and more and pay half the price now! Haven't had one problem with roku and ive been using it for a few months now! Way better then streaming boxes in my opinion!", "verified": true, "helpfulness": "1/1", "author": "kitkat425"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "judy"}]