[{"rating": 5.0, "review": "hate to say it, but roku beats the other stick.", "verified": true, "helpfulness": "0/0", "author": "Daniel Healy"}, {"rating": 5.0, "review": "Trying to avoid the cable company at all cost and the ROKU streaming device is a step in the right direction. I was surprised the item still needed an ugly power wire to be connected to it as it is in the USB spot...also trying to get away from wires, but one step at a time...works great as a streaming device and will buy another...", "verified": true, "helpfulness": "0/0", "author": "Jeffrey G."}, {"rating": 5.0, "review": "Awesome. Combine it with the mini-usb cable for power.", "verified": true, "helpfulness": "0/0", "author": "saj167 \"saj167\""}, {"rating": 5.0, "review": "I've owned Roku players ever since the 1st generation came out in 2008(back when they were still called Netflix players- by the way, that one is STILL going strong!!!). I purchased these two streaming sticks as gifts - one for my parents and one for my fiance's parents. Aside from the Roku servers being a bit overwhelmed the day after Christmas(when everyone and their brothers were doing the initial setup on the Roku players they received as gifts the day before), the streaming sticks installed and worked flawlessly. It's amazing how SOOO MUCH entertainment can be generated by such a tiny device(only slightly larger than an average USB memory stick). Within 5 minutes I had my parents Stick up and running, had it connected to their new Roku account, had their Netflix, Amazon Prime and HBOGo accounts connected and their free Hulu plus subscription online.The HD picture through the HDMI port is flawless as well.  I can't say enough about Roku. Even though I still do have a cable subscription(mostly to keep the HBO GO channel on Roku), My fiance and I RARELY ever use cable. I will be dead and buried before I even get halfway through my Netflix streaming queue. Amazon Prime is almost limitless as well. My prediction is that, within a decade, cable will either be dead or forced to merge somehow with streaming content  providers such as Roku, Chrome-cast, Apple TV etc...  I've seen most other streaming devices(Apple TV, Chrome-cast, Amazon Fire stick, and regular Smart TV's) and I still think that Roku is the best. It's one of the 1st (if not the 1st) streaming devices, it is easy as pie to use, it has very few if any hiccups, and the amount of content available is unbeatable.****UPDATE*****My parents(and many others apparently from reading the multitude of posts on Roku's support forum) New Streaming Stick is one of the Sticks having a problem updating to the new version 6.1 firmware. The Stick still works perfectly with the older 5.6 firmware, but it simply will not update to the newer firmware. The stick downloads the new firmware but when it reaches 100% downloaded, instead of doing the normal auto restart and update, it comes up with a message saying that there is no update available?!?!? If I try to manually restart it, it gets caught in a nonstop bouncing Roku logo start screen. I then have to unplug the stick for 30 seconds and it will immediately restart correctly but defaults back to the older 5.6 version firmware.  Many, many, many others are having this problem. I called Roku tech support and they admitted to there being a problem with the 6.1 firmware coding. Oddly, instead of giving me a timeframe as to when THEY would fix the firmware coding problem(my 2 other Roku devices - a Roku 1st gen and a Roku 2 XS did the download of the firmware flawlessly - so obviously Roku mis coded the firmware for the Roku streaming sticks) Roku insisted that I return the Stick to them and they would ship me a new unit ???? Huh??? So is Roku saying that All the Streaming Sticks are faulty and cannot update to the 6.1 firmware for some reason??? Anyway since the Stick still works flawlessly at the 5.6 firmware, I decide to call AMAZON and have them ship me a replacement(without having to ship back the current 5.6 firmware working stick and have to have my parents wait up to 2 weeks without any streaming content). If the new streaming stick I receive accepts the 6.1 firmware, the problem IS a hardware problem with my particular stick. If however the new stick is not able to upgrade to the 6.1 firmware it means there is a problem with the firmware coding from ROKU's end.  If anyone else is having this problem I would live you to comment on this issue. I will update this review accordingly when I get the new stick.***2nd Update***Well Roku's Tech Support gave the WORST possible advice.... One day before I was slated to receive my replacement Streaming Stick from Amazon(by the way, Kudos to Amazon for being so easy to work with in regards to replacing/returning items); the 6.1 firmware \"issue\" was apparently resolved by Roku from their end. The resolution took the form of a simple withdrawing of the offending firmware upgrade for either all devices or all affected devices. So I stopped getting the upgrade message(as did everyone else who was affected) and the endless bouncing Roku logo cycle stopped. I confirmed this by testing it with the NEW replacement Roku stick sent to me by Amazon, and low and behold, it also worked perfectly; initially updated flawlessly to the working 5.6 firmware and (as the previous unit) was unable to find any new available firmware update. I hope Roku learns a hard lesson from this fiasco - i.e. NEVER tell people to return/replace otherwise perfectly functioning hardware devices until you are certain an errant software/firmware update issue is NOT the cause from YOUR end. Once again the Roku streaming sticks(BOTH) are functioning flawlessly. My only problem now is figuring out which one to return to Amazon????", "verified": false, "helpfulness": "1/1", "author": "whozitz \"GodAlmighty\""}, {"rating": 3.0, "review": "Installation couldn't have been easier -- once i remembered to put batteries in the remote. The remote is fairly simple, and the only minor quibble is that it sometimes seems to take more than one press of a key for recognition.There is a huge variety of channels available on the Roku and a lot of free stuff (much of it ad supported though). Still i don't think anyone would be disappointedI'm updating this review after 3 weeks of use and reducing the rating.Starting to see the 'freezing' issue so many others have reported. Seems like a cold boot fixed it, but I'm wary. When it happened no button press produced an audible or visible sound. After rebooting to the home screen the freeze continued for a little while and I gave the remote a hard slap on my hand (I doubt that did anything, but it did start working shortly).if this continues I may seek a return.Just beware of the problem, it is not an isolated one", "verified": true, "helpfulness": "0/0", "author": "RDK"}, {"rating": 5.0, "review": "Easy to install and use along with the Amazon app.", "verified": true, "helpfulness": "0/0", "author": "Eric W Davies"}, {"rating": 5.0, "review": "What can I say its great turn your HDMI Flast screen TV into a smart TV. You can even use a Micro USB which is used for charging a cell phone to keep it full powered if your TV has a USB plug.", "verified": false, "helpfulness": "0/0", "author": "Blasgarcia"}, {"rating": 1.0, "review": "The streaming stick is garbage!!!  I have a Roku 3 that I love.  I thought this would be a good investment to use in different rooms. It is beyond slow and inadequate.  Spare yourself the frustration and pay the extra money for the Roku 3, or, as I'm going to do, throw this piece of crap away and try the Amazon fire stick.", "verified": true, "helpfulness": "0/0", "author": "geoffrey thomas osowski"}, {"rating": 1.0, "review": "It was great until it randomly stopped working. I couldn't stream anything anymore; I would just get a purple screen, and sound. I looked up ways to fix it online, and for awhile the suggestions worked, and then eventually nothing worked. I would never recommend  to anyone, and will never purchase again.", "verified": false, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "Love it. We use it mainly for Amazon prime and it works perfectly!", "verified": true, "helpfulness": "0/0", "author": "A M Livingstone"}]