[{"rating": 5.0, "review": "WONDERFUL!!!", "verified": false, "helpfulness": "0/0", "author": "Melissa in CT"}, {"rating": 5.0, "review": "Roku steaming stick is overall a great product. Set was quick and easy. The remote is really easy to use. Initially I had problems with the  \"loading\" message and would have to unplug and plug the device back in because it was unresponsive and slow. So I bought a new dual band wireless router that can support hd streaming videos. That solved my problem.I love my Roky streaming stick. You get lots of free channels with no subscription fee such as YouTube, crackle,  Pandora, PBS kids, news channels, and much much more. I only pay a subscription fee for Netflix and Hulu Plus. That is all that i need. I am saving $60 a month just by not having cable and it feels great.This is a great device.  You won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Ashley Williams"}, {"rating": 5.0, "review": "Bought this about 6 months ago and it works fine.I like old  movies, and I stream alot from Amazon, and this unit works great.When the unit does die, I will then update this review.", "verified": false, "helpfulness": "0/0", "author": "John Q Public"}, {"rating": 5.0, "review": "Took awhile to set it up cause I've got an older TV but it works great.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Works Great no problems.... Going to buy another one and another one!", "verified": true, "helpfulness": "0/0", "author": "QuietGurl"}, {"rating": 1.0, "review": "I got one as a gift about 2 months ago. The channels are not to bad, but the Remote is sheer hell! Who designed this crap? Tonight it just stopped working, after each time I practically wore off my thumbs getting it to work. I am not the only person who had cause to bitch about a remote that does not even have a beam that points to the unit that is to be activated.We have bought many electronic items, such as TVs, Computers, etc, but never came across such rubbish from Amazon. They need to reconsider carrying this rubbish.", "verified": false, "helpfulness": "0/1", "author": "marquis gittens"}, {"rating": 1.0, "review": "I love Roku.  I bought my Dad one to Christmases ago and it is still going strong.  I bought this one in hopes of a more compact version to travel with.  Right out of the gate, it wouldn't work.  It would flicker on and off the same way in each of my HDMI ports on my TV.  All of my other HD products are working just fine.  The Streaming Stick would not connect to the internet, kept shutting off and would display a weird screen at times.  Perfect Amazon Prime delivery execution, nothing wrong with the packaging, etc.  While I must say that this experience has not turned me off from Roku products whatsoever, I am now hesitant about getting Refurbished products.  If this was 'Certified Refurbished', someone must have skipped their job duties on this particular unit.  I will sending this back and asking for a refund.", "verified": true, "helpfulness": "0/1", "author": "Timothy Rutherford Jr. \"killmanironface\""}, {"rating": 3.0, "review": "hard to set up ,a bit balky to use once the app is open works fine,mostly using for amazon prime fliks wish i could stream from my computer but cant as of yet", "verified": true, "helpfulness": "0/1", "author": "James Mackalonis"}, {"rating": 5.0, "review": "▀▄▀▄▀▄▀▄★☆☆Super Fast Shipping & Great Price☆☆★▄▀▄▀▄▀▄▀", "verified": true, "helpfulness": "0/1", "author": "Saud Alhashash"}, {"rating": 4.0, "review": "It is what it says it is.  You have to have wifi to use it.", "verified": false, "helpfulness": "0/0", "author": "Amy \"Gr8tsoul\""}]