[{"rating": 5.0, "review": "Great product but Comcast doesn't support it so I had to return it. Other than that, it has a ton of apps and a nifty remote. The only downside is, you have to register every app with Roku.", "verified": true, "helpfulness": "0/0", "author": "Cedrick E. Wilson"}, {"rating": 5.0, "review": "Great addition to other smart devices and portability to boot!", "verified": true, "helpfulness": "0/0", "author": "George V. Afflerbach"}, {"rating": 5.0, "review": "the Roku streaming the stick is excellent it plays better than my playstation 4 streaming Netflix Amazon Prime is Hulu Plus all the free channels are excellent picture quality is 1080p with my internet getting my girlfriend for her birthday everybody needs to buy roku streaming stick I love it its nothing bad I can say about it it loads a little slower then my ps4 but other than I can't speak for all the other streaming devices", "verified": true, "helpfulness": "0/0", "author": "Mark A. Jones \"mark1977\""}, {"rating": 1.0, "review": "This didn't even last three months before the metal end that inserts into the TV broke off.  This is not normal wear and tear. There was no rough handling or tinkering with. Just plugged in and left alone. Buyer beware, you get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "Jennifer H Gamela"}, {"rating": 2.0, "review": "This is not an impressive product.  While it is advertised as a device to stream a fair amount of \"free content\" in addition to pay as you go, the \"free channels\" have commercials that last 30 -180 seconds after a few minutes of listening or viewing.  Very annoying. Roku should tell you this in advance so you know what you are getting before you buy the device.  The Roku device, as well, is impressively slow even with a good internet connection and a modern high def television.  Finally, many of the \"channels\" require registration involving user ID information and selection of passwords, as if there is not enough of this to track already.", "verified": true, "helpfulness": "0/0", "author": "Jazzpop"}, {"rating": 3.0, "review": "Love Roku miss Aero. Remote died after 5 weeks.", "verified": true, "helpfulness": "0/0", "author": "Mark S."}, {"rating": 1.0, "review": "I am very disappointed with this item. It won't let you  configure Netflix if you are over seas. Expensive paper weight...", "verified": true, "helpfulness": "0/0", "author": "MACR"}, {"rating": 5.0, "review": "Works as it should - no glitches. Actually a nicer interface than my older model on the other TV.​", "verified": true, "helpfulness": "0/0", "author": "A. A. Glazer \"world wide web wanderer\""}, {"rating": 3.0, "review": "Make sure your wireless modern is near where you plan to use it.  I had to upgrade and move my modern to really be able to it. The customer service is nearly useless. Most of what Amazon prime offers for free is super old.  If you can't afford cable and you don't get great antenna reception I would recommend, otherwise I'd say go for the more expensive unit.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "A little slow getting started and navigating but works well streaming. Very clear video.", "verified": true, "helpfulness": "0/0", "author": "E Ireland"}]