[{"rating": 5.0, "review": "Excellent product with wide array of choices. I have not experienced any delays or interruptions while streaming different videos and the video quality has been superb. Very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Mr. J \"Mr. creativity\""}, {"rating": 5.0, "review": "I've purchased 2 Roku sticks from Amazon. The first one is 5 stars. The second one could not \"find\" my WiFi and was returned for credit(since received).Len Kraus", "verified": true, "helpfulness": "0/0", "author": "Leonard H. Kraus"}, {"rating": 5.0, "review": "This is my 2nd Roku Streaming Stick!  Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jessica Long"}, {"rating": 5.0, "review": "Worked just like a new one!! Thanks.", "verified": true, "helpfulness": "0/0", "author": "Diana Ball"}, {"rating": 3.0, "review": "Easy to set up.The Roku Stick can be a little slow.", "verified": true, "helpfulness": "0/0", "author": "RICHARD BROOKS"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Juliaiam"}, {"rating": 1.0, "review": "The remote worked only for the first day", "verified": true, "helpfulness": "0/2", "author": "Rana"}, {"rating": 4.0, "review": "This product works great but it does have a little lag when it is starting up. Sometimes the remote will also lose connectivity in which you will need to reset it. I had originally bought this product because I thought I would be able to mirror from my iOS devices. Turns out there is an app that you can download on iOS but it only functions as a remote. It does not actually project what is on the iPhone or iPad to the screen. Also, my package came with a faulty charger cable. Luckily I had an extra cable from a different product that I was able to use. Other than that I have not had any other problems with the device.", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 5.0, "review": "So much nicer than having one more box in front of my TV. I really like the Roku Stick.", "verified": true, "helpfulness": "0/0", "author": "D. Perez"}, {"rating": 5.0, "review": "This was a wonderful gift purchase. Worth its weight in gold!", "verified": true, "helpfulness": "0/0", "author": "G. Hill"}]