[{"rating": 2.0, "review": "This has alot of problems, very slow to load & sometimes will not load or stream at & has to be reset constantly.  Spend the extra money & get the box one instead of this one.", "verified": true, "helpfulness": "1/1", "author": "Amy Stepanek"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Y. Hernandez"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "howard lee"}, {"rating": 5.0, "review": "We no longer have cable in my house hold. No cable bill to pay for which is great, it comes with some free channels, we have netflix that's what we mostly watch and youtube, lifetime, ....", "verified": true, "helpfulness": "0/0", "author": "dewiley alla"}, {"rating": 1.0, "review": "I bought this in September. Worked so great i bought one for another TV. Last month, the first one that was connected through a receiver, had jitters in the programming. I wrote Roku and asked them if there had been a firmware upgrade that might have messed something up. A week(!) later I heard back and they said check with Denon. I asked again about upgrades. Four days later they gave me more junk to try. Four days later they said they had a new software version that would fix it. Nope. Three days later they blamed Denon again. By then I had bought an Amazon Fire Stick which works fine. All the time, my Apple TV, also connected right next to the Roku, has worked fine. Customer service only the phone company could love.", "verified": true, "helpfulness": "0/0", "author": "Charles Mintz"}, {"rating": 1.0, "review": "Piece of crab..  No work properly out side USA.", "verified": false, "helpfulness": "0/0", "author": "Alejandro Chaves Di Luca"}, {"rating": 4.0, "review": "a little bit slow, but nice device. The only issue is that it's kind of hard to make mirroring from a phone.", "verified": true, "helpfulness": "0/0", "author": "arke ruiz"}, {"rating": 1.0, "review": "Have a 5 year old Roku 2 device that has always worked flawlessly. Decided to try the new Stick version for our new big screen TV, but big mistake. The Roku Stick worked for about 2 months but now refuses to connect to the internet. It will connect to our wireless network but fails trying to connect to Internet even though all our other wireless devices (including the 5 year old Roku 2) connect no problem", "verified": true, "helpfulness": "0/0", "author": "BT"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jason L."}, {"rating": 1.0, "review": "Overheats very easily, freezes, crashes, and errors in display", "verified": true, "helpfulness": "1/1", "author": "Clay R. Smith"}]