[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "mikespc3"}, {"rating": 5.0, "review": "Works very well", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 5.0, "review": "This little device is the best tech purchase I've made in quite awhile.  It took me awhile to figure out how to install it because I couldn't get the sound to work installing it directly on the TV.  However, I read all the customer questions/answers on Amazon, and learned that I should install it on the back of my multi-channel AV Receiver.  This worked immediately and perfectly.  Now all I do is switch the input source on the remote, and get Netflix, Amazon Prime etc.Couldn't be happier with this, and very glad I stuck with the installation to avoid the $2k purchase of a smart TV.", "verified": false, "helpfulness": "0/0", "author": "Joe Scott"}, {"rating": 1.0, "review": "signal is so weak, even next to my router. constantly streaming. buy the more expensive one", "verified": true, "helpfulness": "0/0", "author": "G. Saks"}, {"rating": 3.0, "review": "Worked as advertised for about 4 months. Now it will not connect, it keeps trying to recycle, then shuts down. I will throw it away and use my Apple tv!", "verified": true, "helpfulness": "0/0", "author": "gjaykin \"gjaykin\""}, {"rating": 1.0, "review": "The Roku couldn't update system after one month. I try to reset it after three months, it couldn't update the latest software and then couldn't be actived. The Roku service confirm the Roku is defective but couldn't be replaced as they do not do international shipping. I am surprised that why the BAD Roku could be sold by international shipping but couldn't be replaced by the same way.", "verified": true, "helpfulness": "0/0", "author": "Wang"}, {"rating": 5.0, "review": "Everything worked well once I followed out the instructions correctly !! Would recommend it to anyone.....B", "verified": true, "helpfulness": "1/1", "author": "MR.B."}, {"rating": 5.0, "review": "Bought as gift for friend who is very pleased with it!!", "verified": true, "helpfulness": "0/0", "author": "sleepyhead"}, {"rating": 5.0, "review": "I really love this streaming stick. I use it practically every day. It has thousands of channels to choose from. Although some of the channels seem to be YouTube videos compiled and put into a channel, I still love the streaming stick.  You can also rent videos through there at a very low cost, but I have not tried that yet. You can view all of the types of channels that are available by going to the website. Note, some of the TV channels you will not have access to if you currently do not have access to them such as Fox, HBO Go, lifetime, etc.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "Love it, does not take up any counter space.", "verified": true, "helpfulness": "0/0", "author": "J. Johnson"}]