[{"rating": 5.0, "review": "You should have one on every TV", "verified": true, "helpfulness": "0/0", "author": "Peter Bouley"}, {"rating": 3.0, "review": "Not bad for the price. Not as good as Roku3. Had technical set up issues. Have to change router settings. WAP something. Frustrating until you call to get proper settings. Check websites for router set up.Also, slow to start up once unused for a day. Sleep mode I guess. Annoying.", "verified": true, "helpfulness": "0/0", "author": "Gator Lanphear"}, {"rating": 4.0, "review": "Works well, however, batteries in the remote were dead on arrival", "verified": true, "helpfulness": "0/0", "author": "James C. Whitten"}, {"rating": 5.0, "review": "I am very pleased with this purchase. I have to admit that I was looking at other streaming sticks and I couldn't figure out which one that I would like that best...and I am glad that I got this one. It was very easy to set up. I am no where near tech savvy and I had no problem setting this Roku up. I have no problems with my remote paring with my stick (as I have read that some have had that problem). The remote was fairly easy to understand and use. I still an in the process of trying to figure and explore what all it can do...but so far I am very happy with it. :)", "verified": true, "helpfulness": "0/0", "author": "Charity Hope"}, {"rating": 4.0, "review": "I just got it today .  So far set up was fast .  At first we cannot find the Roku on HDM1 and it took a few minutes before the Roku sign came up on the tv but once it did registering went well, entered my wifi account and password and was done. Only issue I have is I cannot get back to ATT Uverse channels.  I have Roku on HDMI and ATT on HDM2 but for some reasons I cannot go back to my Uverse channels.I  added another star because I am beginning to like it although the picture is not as crisp as watching HD channels on my cable box and even if I changed the resolution.  Must be my tv settings.  I added  some channels  like Hulu, Fox and Crackle.  I already have Netflix but Hulu has the tv show that I watch so I am subscribing to Netflix and Hulu.  I am getting rid of my Uverse and  ATT told me that I can keep my router for my wifi and return the my dvr.  Next I am going to find out how to connect to  Facebook.  I  like Roku.  I also bought an indoor HD antenna but still waiting for Amazon  to deliver it. So with Roku and  antenna and subscription with Netflix and Hulu plus my internet I am spending roughly $70 a month.  Not  bad  for a retiree.", "verified": false, "helpfulness": "0/0", "author": "Lilia"}, {"rating": 4.0, "review": "The batteries that came with it were dated 5/2014 and did not work. So far I am happy with the stick itself.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This has opened a whole new world, for me, that is.  Can get Netflix and Amazon Prime and a lot of other things not offered by Direct TV, Either the box or the stick' both work equally as well", "verified": true, "helpfulness": "0/0", "author": "M. McCALL \"Author/Editor\""}, {"rating": 4.0, "review": "Been using this for a couple of weeks now and am happy with it. Bought this to use in my Samsung (not so) smart TV that stopped opening it's Netflix app! Works way quicker than the smart TV I mentioned and has more TV apps that I will actually use like PBS for example.", "verified": true, "helpfulness": "0/0", "author": "Britincalifornia \"Genesiswozzer\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/1", "author": "AR"}, {"rating": 5.0, "review": "It is fun and easy!!", "verified": true, "helpfulness": "0/0", "author": "Donna May"}]