[{"rating": 5.0, "review": "This little stick is a super idea! I had no issues w/setup.  The new tv I bought for the bedroom was a 22\", and the streaming stick fit & works beautifully!!!I will say the one issue, and this has nothing to do with the Roku streaming stick, is the Netflix site takes over a minute or more to open!  I have the Roku 3 on my 40\" TV, love it, & Netflix site takes a shorter time to open.The Roku Streaming Stick is very affordable & worth it!", "verified": true, "helpfulness": "1/1", "author": "Sherlock Holmes Fan"}, {"rating": 1.0, "review": "this product never worked... customer service for this product is not good. waste of time and money. rather pay a little more and get apple tv", "verified": true, "helpfulness": "1/2", "author": "Gisselle M. Velazquez"}, {"rating": 4.0, "review": "It works well and as advertised. I returned it though and bought a 2nd Roku3 unit. The roku3 is much faster and I was already uze to thae before getting this slower and less expensive stick. I also like the cordless headphones option on the roku3.", "verified": true, "helpfulness": "0/0", "author": "Markster2"}, {"rating": 5.0, "review": "Always great quality will buy again. Thank you will keep watching your offers on the line. Wonderful item thanks for  it.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Whitney"}, {"rating": 2.0, "review": "I have had several traditional Roku boxes, dating back to when they were first introduced to the market, and I have liked them all, and even given them five star reviews on Amazon. I had high hopes for this newest one, but it unfortunately does not live up to my expectations.First of all, it's unbearably slow - in more ways than one. It took two minutes to boot up (I even timed it after several attempts on multiple days), another 90 seconds to load Netflix, and even using the remote control has a bizarre lag. This alone was enough to make me return the item. I know that it is not my internet connection, because I stream Netflix on my PS3, PS4, laptop, and phone without issue or anywhere near the same load times.Another disappointment was that Roku forced me to go through some ungainly account setup before I could even use this thing. This was not required on the old Rokus, and I found it really obnoxious, as it did not enhance the viewing process in any way. All it did was waste my time, and give Roku a means by which they could try to sell me programming and bombard my inbox with junk.", "verified": false, "helpfulness": "3/4", "author": "Gabe"}, {"rating": 4.0, "review": "Still I will expect more TV online station from sport or music....and of couse for free ...otherwise the image is great and no buffer gap...", "verified": true, "helpfulness": "0/2", "author": "Radu Dragomir"}, {"rating": 4.0, "review": "Works fine, easy set up and operation; most of the Roku Free movie Channels pretty much suck, horrible resolution since of course they're just streamed non-HD - worse than YouTube; but Netflix and the other pay channels aren't too bad.", "verified": true, "helpfulness": "0/0", "author": "Don Smith"}, {"rating": 5.0, "review": "I upgraded from the old roku to this one and I'm really impressed with the speed, new software format, and the additional channels that are offered through this device!", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 5.0, "review": "better than i expected..easy to use, install and invisible.  what's not to like about  the roku stick i have them for both tvs", "verified": true, "helpfulness": "1/1", "author": "dibankker"}, {"rating": 1.0, "review": "Roku should be ashamed of itself for releasing this piece of junk.  I can see from the reviews that it apparently works fine for some people and if you're one of the lucky ones, great, because it's theoretically a cool piece of hardware.  Here are the problems you will likely be facing:1. The remote.  Who would've thought a remote could be a massive problem?  Not me, until I got it home and realized you can't set up the Roku without it.  Yep, that's right - you CANNOT connect to a Wifi network without the remote.  Which would be fine if the remote worked.  It doesn't.  It's incredibly flaky even when I was one foot from the device (sometimes I'd click \"down\" once and it would just go on an infinite scroll through all of the menus).  This also means that you can't take the Roku with you on vacation because, without the remote, you won't be able to connect to the Wifi network in the hotel or home or wherever you are assuming the remote decides to work.2. The connection blows.  It constantly lost my Wifi connection as in every few minutes - it took over an hour just to update the firmware and even that didn't fix the problem.  And, again, without it being connected to the Wifi, you're stuck with the horrendous remote.  By comparison, every other Wifi device in my home, including those significantly farther from my router than the Roku was, worked perfectly fine.  The Roku was basically on the opposite side of the same room as my router and kept losing internet.  If it can't even hold the internet long enough to call up a menu, how could it possibly stream a movie?I was bummed that this thing sucked so hard.  In all honesty, the fact that Roku's own remote didn't work - and the fact that it's REQUIRED to function and prevents the device from being portable - is what made me return it after a day and is what's making me write this review.  If it had just been poor Wifi, I'd probably have blamed my router or the location of my TV or something.  But the remote is all Roku and that the fact that they can't get their own remote to work with their own product is pathetic.Buyer beware.", "verified": false, "helpfulness": "2/4", "author": "Matt Prager"}]