[{"rating": 5.0, "review": "A++ Works exactly like bigger version of Roku", "verified": true, "helpfulness": "0/0", "author": "Vladimir Aronov"}, {"rating": 5.0, "review": "Good thing!", "verified": true, "helpfulness": "0/0", "author": "Lauri Saar"}, {"rating": 5.0, "review": "I'm enjoying it immensely.  There was a problem, however, setting it up.  I went through setup twice and it froze before loading the channels.  I then reset the streaming stick to factory condition and after that nothing worked.  Solution that worked for me: There is a tiny purple button in the battery compartment.  I pushed and held the purple button until the Roko logo showed up on my TV screen, then I replaced the battery cover and went through setup again and this time everything proceeded and worked flawlessly.  I suspect this solution might work for remotes that quit working about which some posters have commented.", "verified": true, "helpfulness": "0/0", "author": "Shirl"}, {"rating": 5.0, "review": "Awesome product.  However there is a cord which is the power source so it is not cord free.", "verified": true, "helpfulness": "0/0", "author": "Kassidy Martin"}, {"rating": 5.0, "review": "Prompt delivery great product", "verified": true, "helpfulness": "0/0", "author": "craig millar"}, {"rating": 1.0, "review": "It never worked Had to return", "verified": true, "helpfulness": "0/0", "author": "michael funicello"}, {"rating": 5.0, "review": "So far, so good. Quick delivery, Pretty simple set up.", "verified": true, "helpfulness": "0/0", "author": "shenry"}, {"rating": 5.0, "review": "Great price, fast shipping and worked perfectly.  Happy customer.", "verified": true, "helpfulness": "0/0", "author": "Dannie Hedgpeth"}, {"rating": 4.0, "review": "Works great but the batteries did not last very long.", "verified": true, "helpfulness": "0/0", "author": "William F. Adams"}, {"rating": 5.0, "review": "Easy to install and worked as promised. I liked it so much that I've purchased two additional ones for the other TVs in my home. One word of warning though, if you plan to use it in a room that's far from your router you may need to get a \"booster\" to resolve the issue.", "verified": true, "helpfulness": "0/0", "author": "Gordon Grow"}]