[{"rating": 2.0, "review": "I'm a Roku fan but this is a very flawed and frustrating device.  This is my second Roku, as an 'upgrade' to a 3 year old Roku XDS.Particularly after the recent firmware update, the lag on playback controls (pause, rewind 9s, rewind etc.) is so bad to make the device almost unusable.  Press the rewind 9s button to get something you missed, and it takes so long to respond it rewinds to just after the place you wanted - repeat until you give up and move on.In addition, selecting Netflix means an inexplicable 30-40s wait with the Netflix banner up waiting for it to be usable.  I appreciate this is a low cost device but there is no reason with this hardware's capability that it couldn't be a lot better.  It should not be out-performed by the device I bought 3 years ago.One of the selling points for me was it can do much of what a Chromecast can - but it's very slow at that too.  Try to cast Youtube from Android and the setup time is loooong - 3-4 times as long as the Chromecast.If it weren't for the performance issues, it'd be great.", "verified": false, "helpfulness": "3/4", "author": "jimmyfergus"}, {"rating": 5.0, "review": "Purchased as a gift and was impressed with how easy it is to set up and navigate the apps. My dad had surgery scheduled so I wanted him to have on demand video during his recovery - his TV came out just a couple years before Internet Apps but still works fine. He's thrilled with it.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Horrible product Horrible customer service Would not recommend to anyone. I recently got a ps4 because i thought this roku would work just as well. How wrong i was.", "verified": true, "helpfulness": "0/0", "author": "kato"}, {"rating": 5.0, "review": "Works great I use it in bedroom tv streaming hd is great", "verified": true, "helpfulness": "0/0", "author": "Fernando Irizarry"}, {"rating": 5.0, "review": "Makes Prime membership very worthwhile. I did need to get an audio adapter since this unit feeds my projector directly.", "verified": false, "helpfulness": "0/0", "author": "James H. Stangel"}, {"rating": 5.0, "review": "no problems !!", "verified": true, "helpfulness": "0/0", "author": "Ronald L."}, {"rating": 5.0, "review": "Easy install and easy to use! Works great! Have Charter 30meg service and there is no lag at all.. My 6 year old daughter loves it too!", "verified": true, "helpfulness": "0/0", "author": "Matthew B. Witt"}, {"rating": 5.0, "review": "LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Shannon Carless"}, {"rating": 4.0, "review": "little slower than regular Roku but negligable.", "verified": true, "helpfulness": "0/0", "author": "A. Thompson"}, {"rating": 5.0, "review": "Super easy to install, worked right out of the box, just as expected. The Roku Streaming Stick could not have been easier to set up, integrated quickly with all of our most used programming, including Netflix, Hulu Plus and Pandora. It's so easy that our kids are able to navigate the device, largely because of the 'hot button' features on the remote for Netflix, among others. This is our first Roku product, and after going back and forth about different products e.g. Apple TV, this was the definite right choice. We have even found ourselves using this preferentially for streaming services over our Wii. We will definitely be checking out future products and would recommend this product to anyone else looking for an easy-to-setup and fully functional product.", "verified": false, "helpfulness": "0/0", "author": "Jayl20bb"}]