[{"rating": 2.0, "review": "WATCH OUT FOR HIDDEN FEES IF YOU HAVE A SIMPLE QUESTION - I gave it as a gift as I have given away 3 other regular ROKUs and everyone loved them. I chose a stick as she travels to see her grandkids about twice a month and I thought HDMI would be as nice as the regular ones.  It wouldn't set up for her like the other regular ones had set up, called ROKU, the said it would be 72.00 fee, then said oh, sorry there isn't a fee made a mistake, by then they had her credit card.  She is not a techie person, has a new flat screen and I was out of town last weekend to help her.  She and her niece ran into a snag and it wouldn't set up.  She asked her simple question and a minute later was on her way with some kind of product reboot.  Then ROKI charged her account anyway, how embarrassing is that for my gift!!!  We now paid 121.00 for this - I wish I would have gotten the old style ones apparently the set up is much better, although bulky it would still travel and a LOT cheaper.This low rating is because of the lied about fees from the customer service line.  The items seems to have a good picture, needs a better search feature clearly on the remote for my non tech friend to find stuff in Netflix.", "verified": true, "helpfulness": "0/0", "author": "Kris"}, {"rating": 5.0, "review": "Love this! Easy set up...turns your tv into a smart tv in no time.", "verified": true, "helpfulness": "0/0", "author": "Kayla Loftis"}, {"rating": 5.0, "review": "NIIICE!!!", "verified": true, "helpfulness": "0/0", "author": "Renee H."}, {"rating": 5.0, "review": "In my opinion it is better than Chromecast. It has dual band WiFi support and if your network is set correctly you'll get consistent fast speeds on the 5ghz band. The interface is fast and the ability to use the twc app lets you  avoid buying a 2nd twc cable box. There are 3 problems though: if you plug the USB into your television USB port the start-up for the device is lengthy and if you choose to plug the device into the outlet the cord is really short also if you do plug the device into an outlet the problem is that if your TV doesn't have HDMI cec the device will be on all the time so it would be nice to have a way to turn off the device. It comes with a wifi direct remote which is useful and while the casting abilities are limited it is better than the current Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Romine Mohammed"}, {"rating": 5.0, "review": "Got it for my son for Christmas and he loves it. it works as advertised and there are 100,000+ choices of entetainment", "verified": true, "helpfulness": "0/0", "author": "Janet G \"Voracious Reader\""}, {"rating": 1.0, "review": "I down graded this to one star, remote stopped working after 3 1/2 months, and it only has a 90 day replacement.  You might be better off with the Amazon stick, I would stay away from this one or you could very well be out 49.00 real fast.", "verified": true, "helpfulness": "0/0", "author": "nmnative1"}, {"rating": 5.0, "review": "I'm now watching Prime movies and loving it. It's a great deal and the movies are free with PRIME. Go For It.", "verified": true, "helpfulness": "0/0", "author": "Ginny \"Senior Citizen\""}, {"rating": 5.0, "review": "Use it for Plex and it works. A bit slow, but it work.", "verified": true, "helpfulness": "0/0", "author": "Anders Venaas"}, {"rating": 4.0, "review": "I am loving this roku. The only hang up is when my roku goes to sleep due to know activity doesn't respond quickly to the remote. I use my phones roku remote to pair it back up again and back to streaming again. Love the fact I can watch my amazon prime. Smooth sailing on picture qaulity.", "verified": true, "helpfulness": "0/0", "author": "Susan Lamb"}, {"rating": 5.0, "review": "Conveniently small and out of sight. Streams 1080P video.If you have an open HDMI port? Get this! You won't need the Roku 3.. save the money for a few subscriptions. Or something else.", "verified": true, "helpfulness": "0/0", "author": "Charles"}]