[{"rating": 4.0, "review": "I love this device. Works great for me. Once I set it up it's very easy to use with the remote", "verified": true, "helpfulness": "0/0", "author": "derrick small"}, {"rating": 5.0, "review": "Works great!!  We love our roku!!", "verified": true, "helpfulness": "0/0", "author": "Jodi \"Jodi\""}, {"rating": 1.0, "review": "i had to contact tech support numerous times to get it to work and am still having problems with it i will probably be with tech support again today to see if i can get them worked out being that i am in south america not in the US has been a problem trying to get streming movies on our tv to share and not just watching them on a tablet or a lap top when it works it is great", "verified": true, "helpfulness": "0/0", "author": "charlie"}, {"rating": 5.0, "review": "What an awesome alternative to cable television!  Who needs to pay those super high prices and be manipulated by contracts???  I'm very happy with the options and choices this Roku offers.  I highly recommend giving it a try!", "verified": true, "helpfulness": "0/0", "author": "Lori Blazek"}, {"rating": 1.0, "review": "Very inconsistent device.  It'll work for awhile, then constantly interrupt to load...  I workaround the problem by grabbing an older roku unit (LT or HD) from another TV and using it to to watch the rest of video.  The older units work solid, this one is intermittent (I connect older units to same input, across same access point--the problem is specific to the 3500R).  Good luck with yours--hope your experience is better than mine.", "verified": true, "helpfulness": "0/0", "author": "Happy Customer"}, {"rating": 5.0, "review": "Excellent product. Easy installation, I was streaming within minutes. I would recommend to anyone with Hulu, netflick or wwe network", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Better than I imagined", "verified": true, "helpfulness": "0/0", "author": "faydra"}, {"rating": 3.0, "review": "Apple TV kills Roku in my book, especially if you have an iPhone or iPad. Own them both", "verified": true, "helpfulness": "1/1", "author": "Ugochukwu Nwogwugwu"}, {"rating": 4.0, "review": "It works with Wi-fy.  With the adapter, it makes have a home net work much easier.  It is great not to need wires for a good connection.", "verified": true, "helpfulness": "0/0", "author": "f3forever"}, {"rating": 5.0, "review": "I'm loving it. e only hav a tv antenna. Streaming is great.", "verified": true, "helpfulness": "0/0", "author": "Samuel S. Moses"}]