[{"rating": 5.0, "review": "Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Lovers Not Fighters Pit Bull Rescue"}, {"rating": 2.0, "review": "Frustrating set up. After several attempts to pair remote, reading instructions, watching videos, I decided to call Roku. Turns out batteries were too low to pair remote even though remote light would illuminate. Roku wouldnt send new batteries after I requested them to.", "verified": true, "helpfulness": "0/0", "author": "Eric Salage"}, {"rating": 3.0, "review": "worked as expected.", "verified": true, "helpfulness": "0/0", "author": "don e. click"}, {"rating": 3.0, "review": "In the end, still doesn't do much.  Without a previous cable subscription or subscriptions to other services, the Roku doesn't do much.  YouTube and Netflix.  Neflix's variety is always hit and miss as well.  The remote is really bulky for how few buttons it sports.  More apps that are all currently available for free on Android would be nice.  Xfinity Go, WatchABC, WatchTNT..etc.", "verified": true, "helpfulness": "1/1", "author": "Justin"}, {"rating": 4.0, "review": "Great product thanks", "verified": true, "helpfulness": "0/0", "author": "Connie Kramer"}, {"rating": 4.0, "review": "the streaming stick is a little tricky from a couple of standpoints.  first, it's more or less marketed in pictures and written description as a 'stand alone' device similar to a 'thumb drive' or memory stick.  just look at the pic.  Not quite.  it has to be plugged in to both the TV HDMI receptacle AND a USB power port.  when you receive it, the limited instructions strongly suggest that you do not use the usb port on your TV or device,  but use the 120v plug adaptor that they provide.  the instructions say that the power provided on a usb port on a TV or device can fluctuate and they would rather you use a 120v source and connect it to the adaptor and cord that they give you.second, like many electronic add-on devices of its kind (for me anyway), it took some 'monkeying around' with to get it to work properly.  the instructions consist of about 4 sentences.  I suppose with some people those work fine some of the time.  but not with me.  i had to fool with it for about 45 minutes to get it working.  i was not surprised or disappointed.  i read and re-read the 4 lines a few times and tried things out.  i turned the TV and the stick on and off several times, one after another, and 're-set' the Roku remote about 5 times by pressing two keys on the front and the almost invisible 'switch' inside the battery area.  i guess if you went online to the Roku support page you might find this stuff easier, but i figured with the instructions they gave i should be able to do it.  i don't need no stinking map!\"  so after turning (unplugging) TV and Roku on and off in various sequences, having the Roku menu on the TV 'lock-up' on my many times, it started working correctly.  i felt great about it and still do.  what a great picture and easy to use unit (now it is).  i can see how many people might give up and say \"this thing is broken or doesn't work\" and quit before going through what i did, but that's not my nature.  i find a lot of these electronic \"thingies\" need to be fiddled with for a while, for me anyway, before they work properly.  maybe calling Roku or going to online support would have made this setup simple and fast, but i find a lot of the time the support advice is nothing more than what i described, so i tend to do it myself and avoid the call and call-backs, etc.  the streaming Roku is a beautiful thing when working and i feel that it was worth the 45 minutes of my typical 'struggling'.  i'm sure the same thing would have happened if this were 'new' rather than 're-conditioned'.  my thinking is that 're-conditioned' is in reality a stick that somebody lost patience on and sent back (then it's quickly tested and re-packaged).  this scenario probably describes many \"re-conditioned\" accessories.  save your money and get a 're-conditioned' one!", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "Already have a Roku 3 that we use every day. Netflix and others. Wanted the stick for traveling small, easy to install in hotel TV find WiFi and watch. A family member purchased Apple TV after some time they bought a Roku.", "verified": true, "helpfulness": "0/0", "author": "Perry & Shirley"}, {"rating": 5.0, "review": "Everyone should own one of these gizmos!!", "verified": true, "helpfulness": "0/0", "author": "John E. Miller"}, {"rating": 2.0, "review": "This Roku constantly has to reload and freezes. And, it also has an issue with not getting all the episodes that are available. Not very happy with it. My Sony DVR with steaming is no where even close to my router and never drops anything and never freezes. My Roku is twelve feet from the router and drops connection. I would not recommend this.", "verified": true, "helpfulness": "1/1", "author": "K. Davis"}, {"rating": 1.0, "review": "I never again buy a device of this company, too many control problems and very slow in the navigation of the menu.", "verified": true, "helpfulness": "2/2", "author": "Bernardo Ortega"}]