[{"rating": 2.0, "review": "It started off working great! We are a few months in now and it loses connection, locks up, overheats...it sucks. We end up using the apps on our smart tv instead. Just ordered a Roku3 as we are tired of dealing with the unpredictability and it not working at all more often then not. Enjoy it while it works!", "verified": false, "helpfulness": "1/1", "author": "grateful76"}, {"rating": 5.0, "review": "This device is better than the regular Roku player my household has on the main TV.  The original is an older version and, thus, is rather slow.  This stick connects quickly and easily.  I registered my internet streaming accounts on it and I love that I don't have to tie up my computer just to watch my internet media.  I even enjoy the game channels and have enjoyed both free games and paid games like Jeopardy.  I highly recommend this little gadget!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great and a super value as opposed to buying the box.  Love that we no longer need our big xbox to network an older tv.  Just plug this in and away we go.  We have even configured it to play videos from our computers and media drives through the network.", "verified": true, "helpfulness": "0/0", "author": "Lyn"}, {"rating": 5.0, "review": "So much better than Chromecast! love the remote feature!", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "Amazing.  Great product", "verified": true, "helpfulness": "0/0", "author": "Michael Kerr"}, {"rating": 5.0, "review": "Roku rocks", "verified": true, "helpfulness": "0/0", "author": "Tomcdman"}, {"rating": 1.0, "review": "Not recommended outside US. Other devices run Netflix but this one does not.", "verified": true, "helpfulness": "1/2", "author": "Marco Acuna"}, {"rating": 5.0, "review": "absolutely love it, tons of free channels. and good customer support even in 2 am in the morning!", "verified": true, "helpfulness": "1/1", "author": "Maryam"}, {"rating": 5.0, "review": "Really amazing device. Fast shipping and best choice in streamers as all the stations you can get.free even! This style roku installs really easily! I am very happy!", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 2.0, "review": "Let's start with the good.  The Roku stick is super convenient and easy.  I really loved it.  I didn't have to hear the whirr of my Xbox when streaming Netflix movies.  I didn't really use it all that much; not a huge TV watcher.  It worked fabulously for 5 months.  It cost $50, so that's basically $10/month for service.5 months into it, the Netflix player started crashing.  1 month later, the Roku refused to start up at all.  I called customer service, they walked me through attempting to reset it.  I was told that the hardware warranty is only 90 days, so they couldn't help me and I'd have to buy a new one.If you're willing to essentially pay $10/month for the stick and what it offers and then buy a new one every 6 months and live with yourself adding that stick to your local landfill twice a year, then this is a great product for you.Personally I'll be looking into other options rather than buy a new one.", "verified": true, "helpfulness": "7/9", "author": "E. Helfrich"}]