[{"rating": 5.0, "review": "Out of the box, it did not work.  After discussing the challenge with Roku tech support, the challenge was corrected.  Will use it for a long time.  Has what I need.", "verified": true, "helpfulness": "0/0", "author": "Charles E Brown"}, {"rating": 5.0, "review": "Big fan of the Roku, last year i bought the Roku2 and loved it so much i just bought the stick so every TV has it and now i can get rid of directv. These are so easy to operate and there are more than enough channels for me to find something to watch.", "verified": false, "helpfulness": "1/2", "author": "Brian Edstrom"}, {"rating": 4.0, "review": "I'm a ROKU vet, I had the first one and the X2. We cut the cable and my current Logitech Revue is not supported anymore and never had a PRIME stream source, so I got this after  the kid's Wii died and we needed a new streaming device. The biggest attraction to ROKU is the channels.First, I love that I don't have another box to set up. You have to power it, but no footprint. Cool.I actually bought two relatives Chromecast for Christmas and I wasn't overly impressed. So, I pulled the trigger on this one for about $15 more.Initially the set up was easy, looks good but I had intermittent audio issues. something about PCM audio but if I go to back to Logitech Revue and then back to ROKU it works. Sharp Aqous 60. Connected to HDMI. New stick is updated as far as I can tell, that was part of the default. Testing to see if the issue is centered around Netflix.Oh set up was easy and it works fine. Just this weird audio issue. Connected to the net, I have watched PRIME, Netflix, and now sail TV. You can change the pic to 1080. Do that.Same TV and audio output, going back to Netflix and the sound dropped out again. Switch to Google TV via Logitech revue and sound is fine. So \"Rotisserie\" was amazing on NF LGR, no sound on ROKU stick.I guess I will switch the HDMI input. I went into settings and went back to \"stereo\" from \"surround\". I get an error message. \"an incompatible audio signal has been received.\" and then something about PCM.I switched HDMI ports and so far so good. This bugginess might be TV related.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "While the Roku experience is better than my older (2011) Blue Ray player's online interface (Panasonic VIERA Cast), it still isn't ANYWHERE NEAR as simple as just \"watching tv.\"  Maybe that's too high an expectation, but it's also not as easy as \"just finding what I want\" ...at least not quickly.For those that just want a quick pro/con breakdown instead of the detailed report below...PROS:*perfect* if you JUST want to use it for Netflixtiny!easy to switch between tv'scan be powered by television USB port instead of wall outlet (if the port has constant power)best provider participation on the market (number of channels)comes with remotefree android/iOS app is greatCONS:search and navigation is awfultoo much dropping stream (not signal)/LONG wait time to rebuffers...l...o...w... (long lag switching between channels and screens)frustrating channel set up (entering username/passwords for pay channels with no keyboard remote or \".com\" type shortcut keys)signal interferes with over-the-air HD signal (makes watching \"regular\" tv impossible unless you unplug the stick)not enough content on many of the channelsSet up of the device is easy enough, though I had my gripes.  You plug the stick into an HDMI port and then plug it in to a power source via a mini USB and converter (like your phone uses).  The USB cord isn't nearly as long as a regular tv cord, so unless you have a power strip close to the back of the TV or the outlet is *right there*, you'll need an extension cord.  There IS the unadvertised bonus option of being able to power the stick via a USB port on your TV, but that will of course depend upon your TV (the USB port needs to be powered, consistently and with enough juice). Powering via the USB port works on my older Sony Bravia TV, so that is great.Once you are powered up and have the (included) batteries installed in the remote, the two will automatically pair (pretty painless).  You will then need to find your wi-fi network and enter your password.  Entering a complicated or long password with one button is no fun, but it's the only way to do it (since the Android/iOS app won't work until the Stick is on the network).  Luckily, you should only have to do this once (unless you change your router's password).After you select the appropriate wi-fi network, the stick will update its own software and reboot.  You get a progress wheel with a \"percent completed\" update, but once that hits 100% and the device reboots, you are faced with a screen containing extremely annoying, animated \"Roku\" letters bouncing up and down.  You will immediately think: \"What the heck is going on?  Did this work?  Is this the Roku version of the spinning wheel of death?  Am I supposed to know what to do now?  Is this the home screen?  Why can't I navigate? WHAT IS GOING ON?!\"  The annoying bouncing letters are the device's way of telling you: \"Hold on a second!\"  It would be VERY nice if there was a message on this screen that let you know what was going on (instead of just the infuriating, overly-cute, rage-inducing, bouncing letters). [UPDATE] The bouncing letters are apparently what happens when Roku Stick is looking for a wi-fi connection.  You will see this screen any time the device loses power or signal.Once the device is ready to go, you can start picking channels.  Bear in mind, you will need to enter user names and passwords for any pay services you will be using (Netflix, Amazon Prime, Hulu Plus, HBO Go, etc.).  Unless you are a masochist and enjoy entering large quantities of text with a single button, you will need to either keep switching back and forth between your Roku and a computer or download the Android/iOS app (which has a keyboard input).Setting up your channels can take a LONG time.Another annoyance: you can't set up your Roku channels until you actually OWN the stick.  Once I ordered the stick from Amazon, I created a Roku account with the intention of mitigating some of the frustration with setting everything up on the day the Stick arrived, but without having the actual device, Roku would not allow me to add channels.  Why?  No reason really.  But a nice way to further frustrate the customer!Even once you are all set up with your channels, the experience is still less than pleasurable.  Navigating is painful, and program selection is pretty mediocre.  If you are getting this JUST to use with Netflix, then you might be satisfied, but if you are casting a wider net (searching for that cut-the-cable-holy-grail), you will be disappointed.I was excited to see some of my favorite channels in the channel list, but most channels provide a VERY FEW number of shows (I'm looking at you, History Channel).  Even though you think you're going to be able to *watch tv*, you will exhaust your supply of any particular channel very quickly.  For instance, even though (for the sake of an example) Counting Cars is listed, there are only two seasons, and only two episodes from each season.  Thus, even though the show is listed, there are only a TOTAL of four episodes.  Hardly worth the trouble of adding to your list.  It's not like I'm crying because I can't see more Counting Cars... it's that so many of the shows have the same problem (only a very few episodes available).This brings me to the \"search\" function.  There are some major limitations on searching a show (especially television episodes and seasons).  If you use \"search\" from the main menu, Roku only returns hits from premium channels.  Continuing the Counting Cars example, I entered the show into search.  I was presented with 13 episodes on Amazon Prime and 13 episodes from Vudu.  There was absolutely no mention of the episodes available on the Network's actual channel; this leads me to believe that the search function is ONLY searching premium channels for episodes that are available for purchase or included in a subscription.So, if you don't want to watch your show on a pay service like Amazon or Vudu, you have to know which netork it is on, install that network/channel, and then hope that there are a few episodes there.  For instance, if you search \"American Pickers,\" you will get nothing, even though it's a History Channel show.  You have to know what channel the show is on, install that channel, then search within the channel to (hopefully) find the specific show.  So, outside of movie titles, you can only search networks and/or channels (not shows).The main menu lists movies, television, and news.  From the main menu, you will ONLY be searching MGo (who?!) for movies and television.  In order to search other providers, you will need to use \"search\" (not just select the movie or television list), and even \"search\" has the limitations listed above (your search will only return results from premium channels like Amazon and Vudu, NOT your other installed channels).  Furthermore, the News in the main list ONLY comes from AOL.com.  Seriously?!  AOL?  What I am getting at here, is that navigation is really, really bad on Roku devices (and, to be fair, most other devices as as well).Another thing: I'm sure Blockbuster, Amazon, Netflix, and MGo (who?!) pay a massive premium for their dedicated buttons on the remote, but it SURE would be nice if you could remap those buttons to channels you *actually* use.As I keep saying, navigating is the main problem.  Another example: navigating Amazon Prime, even on a computer, is an ABYSMAL experience.  It's just as bad (worse actually) on Roku.  Searching is horrible, because you don't have a keyboard.  You can download the app and use your keyboard on your phone or tablet, but that is still a pretty sucky option.  So you are left scrolling through hundreds of things that are haphazardly and randomly ordered (or only alphabetized if you select that option... FROM A COMPUTER).  You've got watchlist and library options, but unless you take a lot of time populating lists and setting things up manually, you are just SOL on a pleasurable watching experience.  Sure, this is largely the fault of Amazon, but Roku has a grand opportunity to make it better with their interface.  They don't.  And it's pretty much the same (or worse) with all content providers (the channels available on Roku).  As a side note: you can't add television episodes or seasons to your Amazon Watchlist from Roku (only from a computer browser).  You can add *movies* to your watchlist, but not television.So, in the end, while this is probably the best thing going, it still isn't the \"easy\" and/or \"fun\" experience I was hoping for.  It's nice to not have to power up the HTPC all the time and it's nice to be able to plug a tiny dongle into an HDMI port for some \"internet tv,\" but it's still a pain in the keester.NOTE: a BIG thing that would make me a lot happier about the Stick would be being able to stream movies from my NAS (Thecus N5550).  Apparently there may be an option to do that with with Plex, but if you weren't an early adopter, you will need to pay five dollars for \"Plex Channel\" and figure out how to set it up with your NAS.  I hope to learn more soon (and be able to watch my NAS stored media via Roku).  Twonky is another possibility, but I haven't had time to explore these options yet. It would be great if the functionality was just implemented in the device from the start.***For what it's worth, I realize it's AMAZING that Roku is packing SO MUCH into such a tiny device.  It really is AMAZING.  But what I am reviewing is the item's practical application in my viewing experience, and right now it doesn't seem to be able to live up to expectations (what Roku is advertising).***So for the review of this item: the stick *physically* works fine (pairs well, transports data, doesn't drop signal, etc. --though it DOES interfere with my tv signal), but the ROKU interface (an inexorable portion of the ROKU Stick experience) is lacking to say the least.  I kind of wish I had waited and saved my fifty bucks.[UPDATE 4-2-14]  After our first night of actual use, I am even more disappointed.  During a single hour-long show, we experienced four drop-outs that resulted in waiting more than FIVE MINUTES *each time* for the program to buffer and restart.  It was great for \"making time\" to interact with my wife, but pretty lame for the television viewing experience.To be clear, we have a brand new modem with Comcast top-tier internet and consistently see 60Mbps down/11Mbps up on Speedtest.net, so it's not our internet speed (though I suppose Comcast could be throttling our service even though they SWEAR they don't do that).  Also, the Roku Stick is RIGHT next to the router, so it shouldn't be an issue of signal strength.If we can't watch a program without massive interruptions like this, the Roku Stick is worthless.  I can tolerate a few stutters or freeze-ups if they last less than 15 seconds (though that kind of thing makes me miss cable), but this is just unacceptable.  Furthermore, switching between channels or even just *screens* has a good deal of lag (takes quite a while to navigate, often up to fifteen seconds or more between channels) and makes watching TV extremely frustrating.  I will give it a couple more nights of trying before lowering my rating another star and perhaps even returning the item.Another side note: when I got frustrated with the lag and buffering, I switched over to \"HD antenna TV\" and was experiencing a lot of glitching out in the over-the-air signal.  I had the thought that the Stick might be interfering with the signal, and sure enough, once I unplugged the Roku Stick my HD over-the-air signal was strong and solid.  So the Stick can definitely interfere with your HD over-the-air signal, and having to unplug the unit from the power source or TV when your not using is is obviously unacceptable.  Once it \"goes to sleep\" the over-the-air signal is clear, but it takes quite a while for the Stick to sleep (longer than one can reasonably wait to switch over to regular tv).[UPDATE 4-7-14] Haven't had any more real \"buffering\" hang ups, so that's good.  Most everything we've watched since then has been PBS or Amazon Prime, so provider could also be the issue (the drop outs and incredible buffering times were via HBO Go).  Have taken it from one TV to another a few times, and it REALLY is convenient since you can plug it into a USB port on the television (no having to take a wall-wart with you and finding a plug close enough).  The lag and navigation issues still exist, but they become less important if you know what you want to watch.  The interference with over-the-air tv signal has also been a little less problematic (though still present).  Thus, we're happy enough with the Roku Stick for the moment (especially at this price point).  Still haven't tried out streaming from the media NAS, but hopefully I'll get to that soon.[UPDATE 4-29-14]  My new least favorite thing about Roku is that if you have the remote on the couch or bed next to you and accidently hit one of the buttons, you'll spend the next three to five minutes just trying to get back to the show you were watching (there needs to be a \"back\" or \"undo\" button on the remote).  For instance: click HBO Go, click series, click season, click episode, click past description to actually start watching... watch for 30 minutes, move your leg and... AMAZON PRIME HOME SCREEN.  Now you have to get out of that and drill back down to the program you were watching.  Major pain in the a**.On the upside, the Stick seems to work great with Twonky.  I haven't set up the server on my NAS yet, but I've definitely streamed plenty of stuff from my phone to my television screen.", "verified": true, "helpfulness": "5/9", "author": "Jonas Bendsen \"i'm trying to help you\""}, {"rating": 4.0, "review": "I JUST FINISHED INSTALLING THE ROKU 3500R STICK. IT WAS EASY INSTALLING THE UNIT,THEN THE NIGHTMAREBEGAN. THE WEBSITE , ROKU.COM/LINK, BROUGHT UP SCADES OF SITES TO HELP YOU INSTALL THE ACTIVATING CODE,AFTER YOU INSTALL THEIR SITE. I SPENT MOST OF AN HOUR TRYING TO FIND ROKU'S WEB TO  INSTALL THE CODE. FINALLY I HAPPENED ON THE RIGHT ONE AND OF COURSE THE CODE HAD EXPIRED, SO BACK TO THE TV AND NEW CODE. AFTER THE CODE IS INSTALLED AND IT SAID WE ARE FINISHED. THEN ALL OF YOUR CHANNELS THATWERE THE PAID ONES, HAD TO BE ACTIVATED ALL OVER. THE KEYBOARD HAD CHANGED TO  SOMETHING THAT WASCOMPLETELY DIFFERENT THAN THE TYPEWRITER KEYBOARD FROM PREVIOUS. ROKU PROGRAM IN THE RO0KU UNITTHAT WAS INSTALLED ON OUR TV AND WAS WORKING FINE, TELL ME WHY IT DID NOT RECOGNIZE THE INFO THAT HAD BEEN INSTALLED ON THE ROKU THAT I HAD FOR YEARS AND HAD TO ENTER IT ALL OVER WITH THAT FOREIGNKEYBOARD? ROKU IS A GOOD UNIT AND WE LIKE IT, BUT THE STRESS FACTOR TO INSTALL WAS  NOT EASY.", "verified": true, "helpfulness": "0/5", "author": "Amazon Customer \"WALLYGEE\""}, {"rating": 5.0, "review": "Great device that is really easy to setup, use and enjoy.Did need to go into settings to set the display to 1080 as 720 is default, once set it's done.To really enjoy this, as with ALL HDMI streamers, plug into HDMI AVR. Device is small enough to fit between connection on my AVR!With that done go into settings and set audio to surround.(The Roku will show that it needs to be on the AVR for 5.1 to work- an HDMI limitation, not a Roku limitation)With mine set up as above it is really shining as a streamer and I no longer need to power up the PS3 to watch quality streaming in full 1080-HD 5.1 audio and CC. (when the source provides these anyway)Using 5GHz wireless-n with only 4Mb download ability from ISP I am seeing buffer free Netflix, Amazon and Hulu+.Channels I am using that do 5.1;Amazon (DD+)Netflix (DD+)HBOGo (DD)2 Channel  audio only  are Hulu+ and ShowtimeAnytime.As a hearing impaired user I am really happy with the Closed Captioning ability of this. More available than when using the PS3, for instance Crackle. Not everything has the captions still however (Roku makes it easy, up to providers to actually add to content)Lots of options for the text if using CC.Notes: If you use the TVs USB port for power the Roku will power off/on with TV making it boot before usable. Not too long though.(supplied AC to USB power brick is SMALL and sucks little power, using it solves this if needed)Remote is RF so no pointing at anything required and Roku can be out of sight- mine's in another room buried behind the AVRI guess a Roku 3 loads Netflix faster but really I can wait 30 seconds prior to watching a 2 hour movie, once in it is very responsive, just the initial load is slow.I added Twonky Channel, and the Twonky Beam app on my android to \"beam\" photos, music and video wirelessly - easyRoku's android app will also send photos/music, also easy.Rokus media player channel finds my DLNA devices, easyYou're not going to beat this for $50 right now.Update 4/3/14Just found the Roku Search feature of the mobile app, WOW does this make a difference.It is,for now, a streaming stick exclusive feature! Try it.[...]", "verified": false, "helpfulness": "2/3", "author": "J. Jones"}, {"rating": 5.0, "review": "I am new to roku, so I can not compare to roku 3 in terms of speed/performance.  Everything I tried loaded at an acceptable rate for me, even youtube/netflix.  All content looked and sounded great for streaming media with the stick set at 1080p.  The included remote worked great, just need to be firm with the button pressing sometimes to command to register.  Also used the smartphone android and ios apps and it hooked up without a hitch and seems to work more fluidly with stick than the included remove.  Only downside is I have to have wifi turned on the phone which drains battery.  Using either input method I had no problems navigating and controlling content.  There are tons of channels, but only a few worth using in terms of content.  Most of the good stuff you need to pay extra: netflix, hulu, amazon video, ect.  Setup was not difficult at all, unsure what problems others were having.  I quickly was able to find my router, connect, create an account, and get started without a single hiccup.  I started out with the stick power source plugged into my TV USB, and it worked for a while but then started to reset itself.  This problem stopped when I plugged the roku power supply into the wall outlet.  I do our power TV antenna plugged into the other USB port on the TV, so that was likely why I was having the power issues.Our family cut the cable cord a long time ago and with the exception of some live sporting events, really don't miss it.  Before purchasing this item we mainly streamed via PS3 or HDMI to laptop with wireless keyboard.  This was purchased to add access to online content to our upstairs TV.  This little stick does the job beautifully.  I do not have a chromcast to compare to, but feel the roku is superior to apple TV unless you are highly bound to the apple world and itunes, especially at half the cost.For the price, I can not recommend a better streaming device that has a simple interface and setup.  Perhaps it will push google to get more content/functionality out of the chromecast.  Will also be monitoring what amazon has to offer tomorrow at their press conference and at what price should they come out with their own stream stick.", "verified": true, "helpfulness": "2/3", "author": "N. Carlson \"your welcome\""}, {"rating": 3.0, "review": "Their 1,000+ free channels is a joke. You can add the channels to your list for free but most of them require subscription. There are a few channels that let you watch videos for free but they don't have anything good to watch. If you have already subscribed to other services like NetFlix, Hulu Plus (NOT Hulu), Amazon Prime, etc... then sure this will be worth but not if you just want to use their free channels.", "verified": true, "helpfulness": "3/11", "author": "Bill H."}, {"rating": 2.0, "review": "So far the interface is nice and I love having the remote (compared to my Chromecast), but it's painfully slow. Booting up takes at least a minute or more. Launching Netflix takes around 30 seconds. Moving from one item in Netflix to another can take a full second it seems.Way too slow for me. I'll be returning it. Check out the video to see the speeds I'm seeing: http://youtu.be/viQKvVWgk64", "verified": true, "helpfulness": "8/12", "author": "ianneub"}, {"rating": 1.0, "review": "I bought this roku to \"smart\" my bedroom TV, in which I have my PS3 hooked up. My brother had a Roku and he recommended it, so I went for it instead of the cheaper Chromecast. I wanted a stick as I didn't want another box on my set. First things first, it advertises thousands of channels, but apparently I can't find them. Some apps take forever to load, others need cable tv suscription (which I don't have and the reason for which I bought the roku in the first place). So first disappointment, channels.Next, its painfully slow. It took me about a minute to start Netflix.  When it loaded, I pick a show, and the audio from the show started playing before the loading screen disappeared. That was like 30 seconds of audio going on and the percentage indicating it was on 63% loaded. After a minute the video showed, the Roku reset. When I tried accesing any shows again in Netflix, it said the show wasn't currently available. Tested with my tablet, PS3 and smart TV then and all worked, but Roku was saying it wasn't available. Second disappointment: Netflix doesnt work correctly.I started looking for shows in the few interesting channels there are. I opened the A&E; channel and saw that they had 50 shows. Seemed a lot so I got excited. Then I opened a show (again, painfully slow and no feedback from the Roku its loading...you only hear a click and ten seconds later the action performs, so you can be clicking everywhere without knowing if the Roku Stick is doing something) and saw that they had just a couple of episodes, all in disarray. For example episode 18 of season 1, then epidose 23, then episode 7 of season 3, and so on. Next disappointment: content.  I thought more channels and app means more content. Yep, just crappy leftover content.  If you want the real content, you need cable suscription.Finally, loading times and pixelation.  I was watching shows from different channels and constantly I saw that the video suddenly pixelated. It restored, but it was not uncommon. First I thought it was something in the show, but then I saw it happening again and again and again on Amazon Prime (which works half of the time btw). Also in shows, it would load part of the show, and suddenly in the middle of it, in the most interesting part, it shows a black loading screen and starts buffering the new content. Wow this streaming sux!! Big time!! Bottomline, content is not what I expected.At the end Im using this for Netflix, when it works. When it doesn't, I turn on the PS3 and keep watching from there. But its definitely not what I expected, and for the price, the Chromecast is way better.", "verified": true, "helpfulness": "9/14", "author": "Fernando DVJ \"Fernando\""}]