[{"rating": 5.0, "review": "Love it! The only shortcoming is the difficulty with accessing web-only content. We ditched cable and love the Roku!", "verified": true, "helpfulness": "0/0", "author": "Reviewer"}, {"rating": 1.0, "review": "I have two ROKU Streaming sticks. They worked great and then I couldn't get past the Software update. I checked my Wi-Fi connection and it was connected but it still wouldn't go past the software update. I called support and was told it was out of warranty and would cost me $10 to get help. I have had a Blue Ray player for 2 years and have never had a problem. I won't ever buy another ROKU product.", "verified": false, "helpfulness": "0/0", "author": "N. Webb"}, {"rating": 1.0, "review": "Bought this September 2014 and this week 6/9/15 it does not work  ANY MOREI Have reset it several times and tried on other tvs and will not get past asking for the languagePlus not a yr old  and it is not returnableI have the roku 3 and they are working fineI bought this because of the apps for Animoto and slingboxI", "verified": true, "helpfulness": "1/1", "author": "Allen H. Sounhein"}, {"rating": 2.0, "review": "Not good experience with this. I already had been using 2 older Roku boxes with no troubles. I bought this one and it was horrible. Constantly overheated, crashed and was not streaming correctly-constantly getting buffering messages. Maybe i had a bad one, but I don't think so. I think it's small design makes for overheating, and then it just doesn't work, even after repeated resetting. Will return it.", "verified": true, "helpfulness": "0/0", "author": "Blackhawk"}, {"rating": 4.0, "review": "Although excellent, for the price I would pay a bit more and get a combined DVD player/ rock u set up", "verified": true, "helpfulness": "0/0", "author": "Floyder \"loves jewellery\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "melissa"}, {"rating": 1.0, "review": "Does not work in Australia and I have sent back", "verified": true, "helpfulness": "0/0", "author": "Rafael Costa"}, {"rating": 4.0, "review": "Great love it", "verified": true, "helpfulness": "0/0", "author": "tamiko marion"}, {"rating": 5.0, "review": "Works just as described...love our Roku. Have bought a digital antenna and between my Roku and my digital antenna I've eliminated the cable company, saving a lot of money each month !", "verified": true, "helpfulness": "0/0", "author": "Catered Affair \"Chef\""}, {"rating": 3.0, "review": "Streaming stick works great but the remote stops working every time I use it- It will turn it on, and that's about it. Have replaced the batteries and reprogrammed it, but still the remote continues to fail. Only reason I give it 3 stars is because I downloaded the Roku Remote app on my smartphone and it works perfectly- shame I have to provide my the remote.", "verified": true, "helpfulness": "0/0", "author": "Tara Stiner"}]