[{"rating": 4.0, "review": "I like the Roku Streaming stick. it was fast and easy to set up. My only problem with it is some time the remote will not work. I have to take the batteries out and reset the remote in order to get it to work. other then that the stick works great", "verified": true, "helpfulness": "0/0", "author": "notyourmomma"}, {"rating": 4.0, "review": "I tried it the first day and with netflix on my computer and watched the INTERVIEW spoof of North Korea. My  ROKU stick worked well!  Very please except that the delivery came 4 days after they promised me in writing. So I saved a view days off the first month of ROKU use.", "verified": true, "helpfulness": "0/0", "author": "Yitz"}, {"rating": 5.0, "review": "For the price you can't beat the quality. Has every app that I need and easily connects to your accounts. Streams HD pretty easily with few hiccups.", "verified": false, "helpfulness": "0/0", "author": "fruit"}, {"rating": 2.0, "review": "After too many time waiting, the item wasOutOfStock, everything else was ok", "verified": true, "helpfulness": "0/1", "author": "Musaranio"}, {"rating": 5.0, "review": "This is the 2nd Roku stick I've purchased, this one was for my son. Super easy to set-up and use, so many viewing options!", "verified": true, "helpfulness": "0/0", "author": "MarilynW"}, {"rating": 4.0, "review": "Absolutly fantastic. I travel and have a MIFI that I stream through.  It works great!", "verified": true, "helpfulness": "0/0", "author": "Andrew D. Duncan \"ADD\""}, {"rating": 5.0, "review": "Thanks to this we no longer use cable!", "verified": true, "helpfulness": "0/0", "author": "Giri11"}, {"rating": 2.0, "review": "Got this for my sweetheart who lives in Canada and she spent hours tring to get it to work. Not sure if it's a border issue or if it is a defective unit. Not very inpressed for sure", "verified": true, "helpfulness": "0/0", "author": "fisch"}, {"rating": 4.0, "review": "Very slow compared to the Roku 3. I had to change my wireless channel to channel 11 in order to get it to work. Other than that it works good", "verified": true, "helpfulness": "0/0", "author": "Tim W."}, {"rating": 4.0, "review": "This Roku gives reliable connections and clear menus for the 2 streams I use, Netflix and Amazon Prime. . .I don't bother with anything else.  The stick stays on my wireless network without any problems.  Once in a blue moon it locks up and needs to be power cycled.  I like the remote, especially that it uses radio rather than IR; I wish it had the audio-output-jack feature.The only problem I had with this Roku was in setting it up because my network used Static IP addresses, which my streaming BlueRay player could accomodate, but this stick requires Dynamic IP address assignment.  So I had to change my whole IP address assignment philosophy to keep this thing happy.  Also, Roku support wasn't very effective for anything but the simplest issues.Though I like this Roku so far (about 6 months), if I got another streaming stick I would try the one from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Virgin User"}]