[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "D. Gonzalez \"Petaholic\""}, {"rating": 5.0, "review": "Solved a problem I had with streaming Netflix on my flat panel tv.  Plugged it in the HDMI port in back of tv, chose input on my tv's remote, selected HDMI 2 and voila I had access to Netflix and others.  Remote control comes with Roku stick and is easy to use.", "verified": true, "helpfulness": "0/0", "author": "T. Foster-Simeon \"Thane F-S\""}, {"rating": 5.0, "review": "Great streaming stick, I recommend it to anyone looking for one.", "verified": true, "helpfulness": "0/0", "author": "Tom Tlucko"}, {"rating": 3.0, "review": "I wished I had bought the roku 2 or 3. Once I figured out that my Wi-Fi signal wasn't strong enough, after two useless calls to Roku, everything seems to be working ok,except for the controller. Evidently there is an issue with battery connectivity. I'm not going to spend money for a replacement that shouldn't be needed. I will just remove and replace the batteries when the issue arises, as it already has.", "verified": true, "helpfulness": "0/0", "author": "John L. Adams"}, {"rating": 5.0, "review": "works as well as the Roku 3 yet is simple to use. very pleased", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 1.0, "review": "Worst purchase ever!", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Having been a long time Tivo user, I found using the Roku overall less than convenient as it could have been.  Its great in the respect of getting access to all sorts of both paid and free content, and the Streaming Stick is plenty responsive.  I found the interface cumbersome to locate my regular shows I watch through my subscribed channels as navigation varies slightly and requires multiple layers of image heavy menus.  I'd much rather have a more simple interface that showed me show names and episode titles in normal text form similar to that of the Tivo.  I watch my Roku on a 32\" TV in bed at night, and trying to read/comprehend which show is which is difficult.  If you are going to ditch cable, I'd overlook these, but for now I think this will be relegated to the man-cave and my regular use TV's are sticking with Tivo.Additionally, the included remote does not act as a universal remote, so you'll need to keep your TV remote or get something like a Logitech Harmony Home universal remote.  You'll need one of the higher end (non-IR only) type remotes to work with the Roku, but I personally didn't think it was worth buying a remote that was more expensive than the Roku to get this feature, especially with the other shortcomings.  I guess Roku is playing to the cheapest common denominator fighting against the other streaming devices and forgot they are competing against more well established Cable/DVR products.  I was also in the market for a new TV shortly after getting the Roku Streaming Stick, so I thought buying a \"Roku Ready\" TV that included a remote with Roku functions would help with this as well, but alas this feature only works with the Roku Streaming Stick MHL version, not the HDMI version.  The MHL version is slightly more expensive, but in hindsight would have been much more preferred than going to expensive fancy universal remote route.", "verified": true, "helpfulness": "0/1", "author": "Daniel J. Stringfield"}, {"rating": 4.0, "review": "The remote is spotty but like it when it works.", "verified": true, "helpfulness": "0/0", "author": ",sally waldrop"}, {"rating": 5.0, "review": "works perfectly", "verified": true, "helpfulness": "0/0", "author": "David R. Moran"}, {"rating": 5.0, "review": "Very reasonable price for the connectivity.  Easy to set up", "verified": true, "helpfulness": "0/0", "author": "UVA Mom"}]