[{"rating": 5.0, "review": "I can't live without it.", "verified": true, "helpfulness": "0/0", "author": "Junior Ryle"}, {"rating": 4.0, "review": "After hooking up to \"dumb\" Samsung, this product is doing what it says. I so have Prime and just enjoy it very much, especially since they added HBO reruns. Easy to do because I did it w/o any help from tech. and believe me people that takes a miracle. Note: This takes both versions of Wi-Fi unlike the Chrome cast which doesn't take 5mg.", "verified": true, "helpfulness": "0/0", "author": "Stephen D. Gentry \"cvilleman\""}, {"rating": 5.0, "review": "Works perfectly. Now I can watch on the big tv screen rather than my ipad.", "verified": true, "helpfulness": "0/0", "author": "Eunice Silver"}, {"rating": 3.0, "review": "Hard to set up, had it for months and have not used it yet.", "verified": true, "helpfulness": "0/0", "author": "Kathy A Martin"}, {"rating": 5.0, "review": "Fast & cheap & easy. Love it.", "verified": false, "helpfulness": "0/0", "author": "Rodney S."}, {"rating": 3.0, "review": "did not fit my brothers tv and i did not return it in time so out of luck", "verified": true, "helpfulness": "0/0", "author": "Reader"}, {"rating": 4.0, "review": "Start up is a little slow but it works great.", "verified": true, "helpfulness": "0/0", "author": "Clucas81"}, {"rating": 5.0, "review": "Is exact what I spect. From it", "verified": true, "helpfulness": "0/0", "author": "Orlando Rodriguez"}, {"rating": 3.0, "review": "It does everything I wanted it to but controlling it is a headache! I have the Logitech Harmony Keyboard and it is supposed to connect with the Roku Stick via Wifi and it does; however, the connection is so slow it is unusable!As for how it streams, it is pretty good! But sometimes it has to buffer for a few seconds during a long show or movie! If you want something non-expensive go with this, if you want uninterrupted viewing go with Roku 2 or 3!", "verified": true, "helpfulness": "0/0", "author": "Dyslexic1"}, {"rating": 2.0, "review": "It takes a very long time to boot and in the middle of viewing it always either waiting for download or waiting to load or waiting for something else . I wish I could have ordered Roku 3 instead of Roku 3500R Stick.", "verified": true, "helpfulness": "0/0", "author": "RK"}]