[{"rating": 5.0, "review": "We were very impressed, it is quick and easy to hook up to the TV, accessed our wi fi and Netflix account, now we have movies on the TV all the time! don't have to watch them on the computer screen. We love the Roku stick!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great addition to my streaming tv world. I love the Roku's b/c they have a remote and I don't have to have a tablet around to work them.", "verified": true, "helpfulness": "0/1", "author": "L. Carney"}, {"rating": 2.0, "review": "Doesn't run as smooth as my 2500 model, it say stutters/jumps alot and freezes.", "verified": true, "helpfulness": "0/0", "author": "nd75229"}, {"rating": 5.0, "review": "This is an excellent, low priced alternative to set top boxes. It's small size hides away behind the TV, so no one would even know you had one. It boasts the full range of ROKU channels (hundreds), and is simple to set up.The only complaint I have is its range. It has trouble streaming Netflix from our downstairs bedroom. The Apple TV had no such issues, so it's not a wireless range issue. This could benefit from a better antenna, or a small external one.", "verified": true, "helpfulness": "0/0", "author": "MrAltoids"}, {"rating": 5.0, "review": "I have a large screen LED TV, a  DVD player, and an Apple TV.  Each of them has streaming on-line movie capability, played thru the LED TV.  After using the Roku 3500R for a few weeks, I prefer to use it over the other three.  The TV is of a  2011 vintage,  has a limited number of apps, and the DVD player often freezes, and starts reloading  in the middle of a video stream.  The Apple TV, and the Roku  3500R work perfectly.  The advantage of the Roku is it's extensive variety of video apps, far more than the Apple.  It doesn't have the game capability of the Roku 3, or the ear-buds and remote that they can plug in to, but it costs approximately half the price of the Roku 3 or the Apple TV.  The Apple TV has a slight edge in a couple of  areas-  1.  It has a blue-tooth capability, allowing it to use a wireless keyboard instead of the hunt and peck remote search that the other streaming devices have.  This comes in handy when trying to do quick searches on Netflix. and 2. It was made to easily play videos from my iPads and iPhone thru the large screen LED TV.  One big negative of the Apple TV for me is that it doesn't have an Amazon Prime Video Streaming App., and the Roku does have one.  One additional point to consider- the Roku 3500R uses an RF remote, instead of a IR remote.  This can be a problem if you try to control it with some of the \"Universal IR Remotes\" available to control all your components with one remote.  Other than these issues, the Roku 3500R is a superior device, at a much lower price.", "verified": true, "helpfulness": "0/0", "author": "Bazooka Joe"}, {"rating": 1.0, "review": "Just recvd and tryed for hours to hook up...could not...called support ,some guy far away laughingly said it would cost 69.95 $ to hookup...device was 48$...told him he was a cyber robber...ii would send it back to AMAZON,but i had opened it and wrote all sorts of codes on box...i will NEVER touch this brand again nor wiil i recommend...thank you..steve(loyal Amazon customer)", "verified": true, "helpfulness": "0/0", "author": "lox2bagels"}, {"rating": 5.0, "review": "Gave as gift, and was loved!", "verified": true, "helpfulness": "0/0", "author": "Cassandra eguiluz"}, {"rating": 5.0, "review": "With some trepidation, I bought this. Installation was easy. I'm learning the difference between cable and internet reception. A PLUS:  I watched \"Celebrity Apprentice\" tuesday night, and 90% of the commercials were gone! I didn't even have to fast forward like I do with DVR programs.", "verified": true, "helpfulness": "0/0", "author": "coffee lover"}, {"rating": 5.0, "review": "We liked this streaming stick so much that within a week we ordered another.  Who knew?  This little device has changed our viewing habits considerably with all the access it has given us.  We have even discussed losing cable tv altogether.", "verified": true, "helpfulness": "0/0", "author": "Clare G. Neher"}, {"rating": 5.0, "review": "great product, easy to set up, but the right site and way to do  the activation sequence takes a while to sort out - be patient", "verified": true, "helpfulness": "0/0", "author": "James W. Ferguson \"Kid Doc\""}]