[{"rating": 4.0, "review": "It turns any TV into a smart tv", "verified": true, "helpfulness": "0/0", "author": "naorth \"naorth\""}, {"rating": 4.0, "review": "I love the service, however the remote leaves quite a lot to be desired.  The romote is forever freezing up and not changing on screen positions, and when it unlocks it hyper scrolls whatever direction I had sent it.  Unfortunately the Android app, does the same hyper scroll.  Overall I like the product.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"The Shadow\""}, {"rating": 5.0, "review": "I bought this to watch the premium show 'Naked News' without having to use my computer and the internet.  Coincidentally, I am an Amazon Prime member so I can get Amazon Prime Video - TV Shows and Movies free and I can get all that via Roku.  I have watched all of 'Bosch' shows and am now on on my 4th season of 'The Good Wife'  - several episodes a night.  A very good product.  It's High Resolution (1080i) on an 8 foot wide picture projected by an Infocus Projector - a real Home Theater Experience - on a dime.  No screen needed - project on the wall or ceiling.", "verified": true, "helpfulness": "0/0", "author": "JED"}, {"rating": 1.0, "review": "Did not work...spent close to an hour could not get any response from remote to roku or vice versa...called AMAZON the agent was more than gracious and refunded the money paid by me for this non working item..but based on my experience I could not recommend in good conscience.", "verified": true, "helpfulness": "0/0", "author": "DIBLEY2200 \"harry22\""}, {"rating": 5.0, "review": "Love It!", "verified": true, "helpfulness": "1/1", "author": "Kevin A. Mitchell \"Kevin Mitchell\""}, {"rating": 4.0, "review": "The stick is okay but the remote stinks. I've had to replace the first one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"cashcreators\""}, {"rating": 5.0, "review": "Works great. And no Roku box to contend with. Highly reccomend the connector cord to avoid needing an outlet altogether", "verified": true, "helpfulness": "0/0", "author": "Lisa Monteleone"}, {"rating": 5.0, "review": "I ABSOLUTELY LOVE MY ROKU!!  I cut the cord from my cable company, and couldn't be happier!!  I tell everyone and so far 2 of my friends have cut the cord too and love it!", "verified": true, "helpfulness": "1/1", "author": "Lynne"}, {"rating": 5.0, "review": "Product works great fast shipping", "verified": true, "helpfulness": "0/0", "author": "Darren S.  Clemmer"}, {"rating": 5.0, "review": "Love this thing!! Do not miss TV at all, and saved $140 a month!!  no cable bill! I pay $9 a month and that's for NETFLIX.", "verified": true, "helpfulness": "2/2", "author": "Marc Brennan"}]