[{"rating": 5.0, "review": "Love this streaming stick. If you have a USB port on the back of your tv you won't even notice it is there. The only downside is it can take about 20 seconds or so to load Netflix; other programs load quickly.", "verified": true, "helpfulness": "0/0", "author": "Dumac"}, {"rating": 5.0, "review": "Great device that works much better than the same internet source using my \"Smart TV\" set and also offers way more channels..", "verified": true, "helpfulness": "0/0", "author": "Joel M. Cohen"}, {"rating": 1.0, "review": "I WANTED to love this streaming stick.  At first, I thought to myself, \"Yay, I'll get one of these for EVERY room in my house!  What a great solution!\"  Alas, I am on Day 2 of fiddling with this thing and I want to throw it out the window.  I've even tested my streaming speed and contacted my ISP to deal with the issue. I am streaming on my laptop at around 33 Mbps.  Every OTHER device in my household works great with streaming but this stick is slowly killing me.The main reason I purchased the stick was to stream my Amazon Prime shows directly through my TV.  I was tired of watching via laptop.  And when I set it up, I was thrilled at how easy it was!  Look!  There is even a button for Amazon Prime on my remote!Yes, it has amazing channel selection.  Yes, the first appearances are fabulous.  Roku Streaming Stick, I WANTED to love you.But they shouldn't call it a streaming stick.  They should call it a trickle stick. It simple will not play for very long.  It's currently connected to a TV that sits RIGHT NEXT to my router.  I continue to get error messages about my \"slow internet connection.\"  Sitting on the screen right now is a message that says \"We're unable to play your video right now.  Please try again in a few minutes or contact Amazon.com customer service.\" (That's my next step right after I warn people away from purchasing this product).  It is a maddening way to live life.  The few shows I have watched have taken almost twice as long to view because I can't view them from beginning to end.And, at first, I loved the remote.  Now, I can't even tell if it's working.  There's no light on the bottom and it doesn't seem to respond every time.  I push a button.  Nothing happens.  I even already replaced the batteries (they were good quality Duracell, so I couldn't imagine that was the problem, but I'm trying everything!)  Then, out of the blue, it will start responding again.This is my first Roku purchase. All signs point to it being my last.", "verified": true, "helpfulness": "22/23", "author": "KTily"}, {"rating": 4.0, "review": "Works very well and I am happy with the unit, price and performance. Both Roku and Apple TV and other streaming devices would be better however if the included a volume control on their remotes. Not having this capability means you always need two remotes to adjust the total viewing/listening environment.", "verified": true, "helpfulness": "0/0", "author": "K. weber \"the engineer\""}, {"rating": 1.0, "review": "Both the app and Roku stick crash ALL THE TIME!  I can't go 30 seconds navigating content without one of these things rebooting. Incredibly frustrating and total was of time. I doubt any real testing was done on this thing and the consumer gets to beta test this insanely buggy product. Returning it today!", "verified": true, "helpfulness": "0/0", "author": "Marcio F. Dacosta \"Marcio\""}, {"rating": 5.0, "review": "Works great! Nifty little thing to travel around with. Netflix takes a little longer to load, but it's not a big deal. Life doesn't get shortened if you can wait for a few extra seconds. :-) It does the job well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "At first it was very slow within the apps, but after awhile, maybe after some firmware updates, the speed got better. Love these things.", "verified": true, "helpfulness": "0/0", "author": "J.Carter \"JJC\""}, {"rating": 5.0, "review": "Great product for the price", "verified": true, "helpfulness": "0/0", "author": "susan hubbard"}, {"rating": 5.0, "review": "I just  installed it and after I figured out how to use it, it is great. I am 76 (what you would call an 'old fart') and with that in mind, you could make the operating instructions a bit more explicit. That is the only item I found lacking. The rest is pure pleasure!Theo Willis", "verified": false, "helpfulness": "0/0", "author": "Theo H Willis"}, {"rating": 4.0, "review": "Very happy with this product, simple plug and play system with a great variety of channels.Note: Not all the channels are free but access to the usual Amazon Prime, Netflix is available.", "verified": true, "helpfulness": "0/0", "author": "Mr A Sharma"}]