[{"rating": 5.0, "review": "The stick came in on time and the packaging was as described. Having issues connecting with my wireless internet, but I don't believe it's an internal issue with the Roku. I've had one in the past and loved it.", "verified": true, "helpfulness": "0/0", "author": "Erica K."}, {"rating": 1.0, "review": "The remote control for this thing is beyond worthless.  It has intermittent loss of signal with the Roku device and needs to be reset/resynced several times during each session of scrolling thru the listing of shows available, every time.  The remote is much more trouble than any benefit the programming provides.I've downloaded the app to use my phone as a remote, and that works with no problems.", "verified": true, "helpfulness": "0/0", "author": "Randy"}, {"rating": 5.0, "review": "So happy we cut our cable and went with this. It's been great.", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 4.0, "review": "Love, just wishould the remote didn't act up now and then. It's an easy fix though.", "verified": true, "helpfulness": "0/0", "author": "Jessica Lumley"}, {"rating": 5.0, "review": "I already had a Roku 3 for my living room and bought this one for my bedroom.  However, I honestly like this one better.  The remote on this Roku has \"hot\" buttons for some favorite stations.  The set up was a breeze and I swear I have a better picture than I have in my living room.  Extremely pleased.", "verified": true, "helpfulness": "0/0", "author": "Reads Too Much \"TC\""}, {"rating": 5.0, "review": "Great product! Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Kevin Alvis"}, {"rating": 5.0, "review": "Works very well!", "verified": true, "helpfulness": "0/0", "author": "fdolce \"Fred\""}, {"rating": 2.0, "review": "Something I read quite a while back seems to still hold true, which is the remote loses connection often. The solution is to take the batteries out of the remote and reinstall them, which sort of resets the connection. It's very annoying to do this and this is something that should have been addressed with a firmware update long ago. Unacceptable for something like this to get passed initial testing before the product released, let alone LONG after it's been out and still not corrected.", "verified": false, "helpfulness": "1/1", "author": "L. Allen \"MIX_MASTER_ICE\""}, {"rating": 3.0, "review": "Love this", "verified": true, "helpfulness": "0/0", "author": "patricia smith"}, {"rating": 1.0, "review": "Stopped working after a few months. No tech support!", "verified": true, "helpfulness": "0/0", "author": "DMM"}]