[{"rating": 1.0, "review": "The Roku works as advertised, but in reality it is nothing more than a gimmick to get customers to pay more for subscrtion TV.Sure, there are \"free\" channels with Roku, but nothing you'd really want to watch. And the constant buffering that one must endure in order to watch streaming television is a distraction. So, for me, the Roku was a waste of money. YMMV", "verified": true, "helpfulness": "1/8", "author": "Chet Logan"}, {"rating": 5.0, "review": "For $50 I don't believe you can find a better streaming product.  I also have a Chromecast but being that it's still so limited on apps, I ran across the Roku Stick.  Same concept, countless more apps and actual remote.  It's a little slow booting up and accessing Netflix but it's still a quality product.  Definitely a great buy and am more than happy I made the purchase.", "verified": true, "helpfulness": "1/1", "author": "DeeDubb"}, {"rating": 5.0, "review": "My mom recently became a cord cutter in order to save money. Cable is so expensive! I got her this Roku so she could watch Netflix and the like.The package was delivered to her and she set it up on her own. She even got Netlix set up. Now she's a bonafide millennial! (kinda)", "verified": true, "helpfulness": "0/0", "author": "JoshK"}, {"rating": 5.0, "review": "I already have a couple of the Roku 3's. The only thing that I don't love about those is all of the cords. I purchased the streaming stick for the TV in my garage that I have mounted up on the wall. The device works the same as my Roku 3 but it is powered by a USB port on the TV and the device plugs rite into the HDMI port on the back of the TV. Yes it takes netflix a little longer to load than the Roku 3, but once it is operational it works great. The only thing that I have noticed is that on my particular TV if I leave it plugged into the USB port when watching TV it messes with the reception for some reason.  So I do have to power it down in that situation. A very minor annoyance to me.", "verified": true, "helpfulness": "0/0", "author": "BVR"}, {"rating": 5.0, "review": "It's everything you need. Hulu+, Netflix, Spotify... YouTube controlled by your phone...  We love it! It paid for itself in days.", "verified": true, "helpfulness": "0/0", "author": "Chad Grattan"}, {"rating": 5.0, "review": "I have Roku 2 and 3 and now this Streaming Stick, which I've had for more than 30 days and its a very seamless and similar experience across all three models. There is no lag or stuttering, as many have reported in the reviews, these folks are having other problems, the Roku stick works just fine with no stuttering, lag or delay.Problem for most people is Bandwidth. Basic cable supplies a 1.5Mb or slower connection. That is barely adequate for SD streaming. If you attempt HD steaming at those speeds, guess what? It will stutter and lag...Netflix recommends at least a 5Mb connection FOR EACH stream of HD content.I have a 20Mb connection. (Time Warner Turbo) and rarely see any pixilation or lag.If you have proper bandwidth, this Roku works just fine.", "verified": true, "helpfulness": "0/0", "author": "NC-Mike"}, {"rating": 5.0, "review": "I absolutely love this product!  I am glued to the tv set. I like the numerous channel options Roku delivers. Love it!", "verified": true, "helpfulness": "0/0", "author": "Geri Mitchell"}, {"rating": 5.0, "review": "Picture quality is superb,  streaming is smooth and fast. Getting ready to cut the satellite cord and save some money.", "verified": true, "helpfulness": "0/0", "author": "Carol A Shank"}, {"rating": 5.0, "review": "Already owned a Roku 2. Needed a device for an extra room. This was an easy choice. It was easy to set up and works flawlessly. Way to go Roku!!", "verified": true, "helpfulness": "0/0", "author": "RobW"}, {"rating": 5.0, "review": "I love my Roku. I was one of the easiest things to setup. I have my router set to mac address filter, hidden and password protected. So I have had trouble getting some of my electronic devices to connect to my router. Not the case with this though, it was a breeze.", "verified": true, "helpfulness": "0/0", "author": "S. Reynolds"}]