[{"rating": 4.0, "review": "Satisfied for the most part.  Have to restart it frequently", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "everything ok", "verified": true, "helpfulness": "0/0", "author": "rene ortuño"}, {"rating": 5.0, "review": "Perfect companion for a cord cutter. It has all major streaming services except iTunes. If you are purchasing multiple streaming sticks, if you use the same account all apps installed on the first one, will download to the others.", "verified": true, "helpfulness": "0/0", "author": "J. Johnson"}, {"rating": 1.0, "review": "it freezes and i have to press the buttons really hard to get around", "verified": true, "helpfulness": "0/0", "author": "Nancy M. Morales"}, {"rating": 5.0, "review": "Entertains all of us. Well built product. And as always, EAD.", "verified": true, "helpfulness": "0/0", "author": "Starkvegas \"J.R. Baker\""}, {"rating": 5.0, "review": "didn't know Roku could do see so many programs  Opens doors.", "verified": true, "helpfulness": "0/0", "author": "mary"}, {"rating": 5.0, "review": "This thing is amazing. Streams wonderfully in full HD. However, it does take awhile to set up all the apps with your accounts. Well worth the cost.Pro Tip: Plan on having some sort of a computer or tablet nearby because you'll be activating a lot of your accounts on a browser.", "verified": true, "helpfulness": "0/0", "author": "B. Ayers \"BA\""}, {"rating": 4.0, "review": "Batteries last about as long as mouse or keyboard.  If things stop, check them first.", "verified": true, "helpfulness": "0/0", "author": "Mooreakid"}, {"rating": 4.0, "review": "I do like this, but my Roku 3 is much better.  This is great for streaming, but looking at what you want to stream is not as fast as the Roku 3.  Since this is 1/2 the price, I think it is a great purchase.  Nice to have for my daughter's room.", "verified": true, "helpfulness": "0/0", "author": "D. Golub"}, {"rating": 5.0, "review": "This is AWESOME!!!!  Cancelled all but HBO after we installed this on 3 of our TV's.  My teenage daughter watches most of the TV in our house and she has found tons of stuff to watch.  With all the different things it offers from Netflix to Prime.... there is always something to watch.  Easy to install, absolutely NO issues.", "verified": true, "helpfulness": "0/0", "author": "Christy"}]