[{"rating": 5.0, "review": "Unbelievable what such a tiny device can do. Adequate speed and crystal clear picture and sound.", "verified": true, "helpfulness": "0/0", "author": "Willie Bond"}, {"rating": 5.0, "review": "Works perfect!", "verified": true, "helpfulness": "0/0", "author": "Jill Owen"}, {"rating": 5.0, "review": "This is my 3rd Roku in the house - One Rocku 3 and 2 sticks.  I love Roku; nothing is easier to use and I love its compatibility with PlayOn in supporting my move to cut the cord with cable company.  Roku rocks.  I suggested one to my mother who was able to set hers up without any assistance from me and 72 she usually needs some help with any 'tech' things.  That's how easy Roku is.  Love, love, love it.", "verified": true, "helpfulness": "0/0", "author": "Stacey Jefferson"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Adam Luther"}, {"rating": 5.0, "review": "amazing device", "verified": true, "helpfulness": "0/0", "author": "babazar"}, {"rating": 5.0, "review": "Excellent.", "verified": true, "helpfulness": "0/0", "author": "LEV ALTSHULER"}, {"rating": 5.0, "review": "Quick delivery. Exactly as described. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Andrew K."}, {"rating": 2.0, "review": "Power light stopped working after 2 months in operation. TV screen stays black when this HDMI channel is selected. Tried different TV, reset button, different USB charger - completely dead. Beyond the 30 day Amazon return period for defective goods so effectively threw my money for this purchase down the drain. Up to the failure, it was working relatively well but I would have liked a bigger buffer so that our slower internet connection did not stop playback and buffer quite so often.", "verified": true, "helpfulness": "0/0", "author": "moriarty"}, {"rating": 1.0, "review": "Huge waste of time, this thing is worthless. I wasted far far too long with it, support was worthless. The thing worked initially, forced a firmware update, & then with the same settings gave me error 009 (generic unable to connect to internet). Didn't matter what tech support ran me through, the secret menu, the super secret menu, wiping my router settings, etc etc. This thing is one big bag of fail. I have an old roku2 & that works wonderfully on the same network, so the problem is the roku stick & the huge amount of fail it contains in such a small package.", "verified": false, "helpfulness": "0/0", "author": "Keith V. Klenke"}, {"rating": 1.0, "review": "Mine wouldn't connect to the internet. Returned it and got a Roku 2 instead.", "verified": true, "helpfulness": "0/0", "author": "Walk2Much"}]