[{"rating": 1.0, "review": "I setup the unit easily, but it stopped working a month later.  The loading screen just keeps reloading over and over again.  I tried to call customer support 3 different times and never actually talk to a person.  I have been on hold for 30 minutes each time and finally give up.  Very disappointed in this device after reading such good reviews.  Unfortunately, I am past the date I can return the unit.", "verified": true, "helpfulness": "0/0", "author": "Ben Harbaugh"}, {"rating": 2.0, "review": "Too many issues with this product. As other reviewers have said, wait for the next version when more bugs have been worked out. The power cable fits way too loosely in it's jack, has to be constantly adjusted 'just so' for it to work. The device itself needs to be unplugged and plugged in again to get it to start working again after it freezes. Worked well for a couple weeks before this last issue started getting bad. When it works, it works great. It streamed Standard Def for me on a measely 0.7 mbps with no hiccups! Stick with the boxes for now as far as Roku is concerned.", "verified": true, "helpfulness": "0/0", "author": "J. Black \"adpng\""}, {"rating": 4.0, "review": "As described,", "verified": true, "helpfulness": "1/1", "author": "Bryan"}, {"rating": 5.0, "review": "This unit works great. Installation was very easy and the remote works perfectly. Some people have reported minor issues with the remote becoming confused with instructions. I have had none of those issues. I use the Roku Box in another room and it also works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "kevin \"Old HP Guy\""}, {"rating": 4.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Amazon prime"}, {"rating": 3.0, "review": "Not their best.  The remove is bigger and clunkier and has Blockbuster short cut... REALLY?I would not get this again.", "verified": true, "helpfulness": "0/0", "author": "Ever"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Denise Béchard"}, {"rating": 5.0, "review": "Easy to use and tons of channels and movies. Will also cast similar to chromecast. Love the remote as well. Makes it much more user friendly. Also removes the need for cable/satellite...", "verified": true, "helpfulness": "0/0", "author": "Nic"}, {"rating": 5.0, "review": "Love my roku. I use Netflix and Amazon and have been very happy with the results over the past 6 months. I'm not a sports fan so with the use of my Roku I have been able to significantly reduce my cable bill. With the Roku you need basic cable and wireless access. I can find almost anything I want using Rodu.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Nancy from Ohio\""}, {"rating": 5.0, "review": "Great product!  No problems at all.", "verified": true, "helpfulness": "0/0", "author": "bridgebum"}]