[{"rating": 5.0, "review": "I bought this streaming stick for my large TV in my livingroom....and I love it.  It's for us really lazy people who sit in our favorite recliner and don't even want to take our hands out from under the fuzzy throw to press any buttons.  Once you have chosen your favorite multi-episode TV show, it goes from the first through the last episode of a season without your having to push any buttons....and there's usually no more than an 18-second break in between loading a new episode.  This is my favorite entertainment gadget.  It's good for Netflix, Amazon, and all the other many channels you used to get with your old box-style Roku.", "verified": true, "helpfulness": "0/0", "author": "lindadello"}, {"rating": 5.0, "review": "Worked as described", "verified": true, "helpfulness": "0/0", "author": "Tracy A Rothstein"}, {"rating": 5.0, "review": "Love it. Only had it for a few days but I don't seem to have any problems. It's fast and perfect for turning a unseat TV into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "S. Daniels"}, {"rating": 1.0, "review": "The problem started with initial setup.  After setting up the WiFi, ROKU prompted to update the firmware.  I attempted to finish this step atleast 8-10 time, every time ending with error 011.  I gave up and did an old style power up and boot.  The firmware was updated eventhough the UI showed 011 error.second, the remote is a nightmare.  I was trying to type in the WiFi password.  One click and the pointer just moved continuously over all alphabets on its own.  Still managed to finally setup the Roku.  Now realized, the remote goes unresponsive.  Thankfully i downloaded the phone app.", "verified": true, "helpfulness": "0/0", "author": "Ninad"}, {"rating": 1.0, "review": "The installation of this product was a nightmare! It took about 7 hours, plus multiple calls to Roku support to finally get the thing working. And if I wasn't following the directions that it came with it would be one thing, but the steps that I needed to successfully get the product working you couldn't find anywhere. The hassle of returning this item wasn't worth it but, I wouldn't recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "Ryan Olsen"}, {"rating": 5.0, "review": "I absolutely love it! GET RID OF YOUR CABLE AND GET ROKU!", "verified": true, "helpfulness": "0/0", "author": "cc"}, {"rating": 5.0, "review": "Excellent right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Bob Spath"}, {"rating": 5.0, "review": "My family is loving this.", "verified": true, "helpfulness": "0/0", "author": "father"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Mike Caraway"}, {"rating": 3.0, "review": "Failed to mention that the item also had to be powered. Very slow compared to my Apple Tv.", "verified": true, "helpfulness": "0/0", "author": "Chris Younan"}]