[{"rating": 1.0, "review": "I asked before buying it if it will work in foreign countries as Mexico as answer roku told me almost all channels will work (circa 90%), once I received the item, only crappy channels can be seen, not even netflix or vudu that normally works at Mexico in a lap top or other devices...ESPN, Amazon any other good channels can be seen.I alert buyers from other countries to not buy this thing and also don't trust 100% what support say at Roku web page...", "verified": true, "helpfulness": "0/0", "author": "manlio lopez"}, {"rating": 5.0, "review": "Easy setup and works perfectly. Draws power from separate USB plug on back of TV or an external AC power source.", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 5.0, "review": "Great device. It does a great job of eliminating a clunky BluRay player interface. You can stream files from you computer with the Plex app. Plex can be a little confusing, but once you figure it out, everything works well in conjunction with the Roku.", "verified": true, "helpfulness": "0/0", "author": "Lee Hollihan"}, {"rating": 1.0, "review": "Will not work on SHARP  AQUOUS TV.", "verified": true, "helpfulness": "0/0", "author": "cerayart"}, {"rating": 3.0, "review": "First unit was not functioning correctly. Got a replacement unit. Will update rating when I get to use it more.", "verified": true, "helpfulness": "0/0", "author": "Lyle J Spain"}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "Fanya Gersh"}, {"rating": 4.0, "review": "It clearly does what it's built for, except with my samsung TV the power from the USB was not sufficient so I had to plug in to a proper power source.Great piece of equipment , no complaints", "verified": true, "helpfulness": "0/0", "author": "Thiru"}, {"rating": 5.0, "review": "Performs as advertised. Unobtrusive, simple menu, USB powered, works perfectly with my wifi router. You can of course spend more money, but I think this unit is a great value.", "verified": true, "helpfulness": "0/0", "author": "Daniel W. Anderson"}, {"rating": 1.0, "review": "So, I purchased this as a Father's Day gift for my dad, so he could watch Netflix on his 32\" lcd tv that is a few years old, and not smart. When it finally got here I was so happy for dad. That happiness lasted about 10 minutes, the amount of time it took me to realize that I cannot add Netflix to my Roku stick, because of region restrictions. I contacted the Roku support team, because there is  absolutely NO HINT in their site or anywhere that states that I would be having this issue, and they basically told me that I had thrown $49 down the pipe. This is completely useless to me without Netflix, and like I told the customer support rep, it is a scam that they don't let u know about the regions restrictions BEFORE you purchase the product, so you can make up your mind and decide if you still want to purchase this.I hate that they didn't give me any options to fix my issue, and did not show any type of empathy towards it. Lesson learned!!", "verified": true, "helpfulness": "10/11", "author": "Jonathan Gonzalvo"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "S. Moon \"Steve\""}]