[{"rating": 5.0, "review": "I love my Roku!  I dropped off the cable grid back in the late 80s.  I simply despise having to pay for TV.  I don't watch enough for it to be a worthwhile investment.  But this little baby gives me access to lots of free content with very little fuss.  Since I'm more inclined to watch movies than anything and since I'm not averse to watching the odd commercial to get my free content, I much prefer this one-time expenditure to a monthly cable bill.  I'm already paying for an internet connection, and I wouldn't be without that - I'm not a Luddite! In fact, I have been an early adopter of computer-related junk since the introduction of the Commodore 64.  But, I don't like commercial TV and I despise cable. (I don't like commercial radio either, but that's a different story.)Having the Roku and an Amazon Prime account means that I have access to a huge amount of content.  Yes, I'm paying for Prime, and yes, that's gone up to the point that I sometimes question the necessity, but since I live in a very rural area, I often find it more expedient to order things online than to spend the money and time on gas to get where I could buy in person.  The combination of Prime and Roku will absolutely replace your need for cable, if you don't mind waiting for content.  It's not important to me to be the first one who watches something, so it's perfect for me.  With Roku and Prime and my library card, I very rarely pay for something to watch, aside from the Prime subscription that I've already got to help me get access to goods that I can't buy locally.To me, it's a perfect choice, and I would definitely recommend it to the like-minded.  If you insist on seeing whatever's the newest thing immediately, you're still going to be paying for content and it might make more economic sense to pay for cable. But, you can also stream content from paid subscriptions, like Amazon, so there's that option, as well.  For example, if you just want to watch baseball, and you don't want to pay for the sports package from your cable provider, you might go for an MLB.TV subscription.  You can definitely create your own package of content, whether paid or free or a mix, and not have to worry with the monthly bill or other such nonsense from a cable provider.", "verified": true, "helpfulness": "0/0", "author": "ellonwheels"}, {"rating": 5.0, "review": "Love it", "verified": false, "helpfulness": "0/0", "author": "nikki"}, {"rating": 2.0, "review": "Irritating as hell that you have to add a credit card number to activate a product that you have already paid for.  You can remove your credit card information from the account once it has been activated, but the mandatory entry of credit card information is unnecessary for the function I bought if for - watching my Netflix TV shows.  You suck Roku.  Two stars instead of one, because it works fine.", "verified": true, "helpfulness": "1/1", "author": "courtesyreview"}, {"rating": 5.0, "review": "It's so useful and easy to use, simple to move between tvs. Great product!", "verified": true, "helpfulness": "0/0", "author": "Danielle Shobe"}, {"rating": 1.0, "review": "Both the device and the remote are slow to load menus or respond to input. Streaming itself (once you've finally made a selection is fine).Details: Make sure to have the device powered by a wall outlet, having it connected to your TV leaves you waiting for what seems an eternity for it to boot-up and get into the main menu (since it's powered by your tv - when your tv's off, it turns off).The setup process takes almost an hour, when it's finally setup it progressively gets slower. The remove connects 40% of the time - I finally just installed the app on my phone and had better luck getting it to respond that way. Fast forward, rewind, and pause options are delayed. Don't buy this device! I've only tried the Apple TV and it was by far a way better experience. I'm trying the Amazon device first (cheaper) and if I have the same luck with that I'm going back to Apple.", "verified": false, "helpfulness": "0/0", "author": "A. LAGHAI"}, {"rating": 5.0, "review": "My friends may miss me but I suppose I can invite them over.  This is easy to set up, very affordable, and works well.", "verified": true, "helpfulness": "0/0", "author": "Leucadian"}, {"rating": 1.0, "review": "I bought this on on the sale they had going on for Mother's Day to treat myself, and boy am I glad I didn't gift it to my mother. I got this device last week and I have Roku Ready TV's. Immediately I knew from the start this wasn't going to work. I plug the stick into the slot that my TV even details Roku Ready port and it took forever to get setup because the remote didn't work without dancing around the room to get it to recognize it was being pushed. I guess this is a common issue with these things and Roku answer for it is to send a 3\" adapter that they are in no hurry to get to you. An adapter to give it more room for the WiFi Direct remote to work due to possible interference. I think that is an excuse for poor quality especially on a Roku Ready TV with nothing in the way to interfere. If it potentially needs more parts then Roku should be including it in the box. I only discovered the adapter by researching the many others who have had this complaint. If it is so well known and/or required then why did it take 2 support chats, a replacement remote ordered that hasn't shipped days later, and support acting as if this was a one in a million issue for me to find this 3\" adapter they list on their site as a fix for a couple different things. Roku support response before I discovered the issue is the connection involving this adapter rather then the remote was ''use the smartphone app\". Really? You produce a product with a remote that doesn't work and your answer is use the app? Ok so to recap, I buy a plug and play stick with remote for a Roku Ready TV and to use it I need to get extra parts or toss the remote and use an app. So do I get a 50% refund for using only half the product? Probably not.Ok so enough complaining about the remotes poor quality of use, I go to use the smartphone app and as I do I notice it doesn't always respond to the app when manuvering around the menus, the app constantly looses connection with the stick and the longer it's on the slower it seems. Then it buffers and I NEVER have a buffer issue and I own several other streaming devices. Roku answer to that was \"move it closer to the router\". Apparently less then 3 ft from it isn't close enough because I specified it was within 3 ft direct line with no obstructions and it was still buffering. I go to remove the product from my TV to gather up for a return and I take notice the stick is hot. I suspect that may have something to do with the buffering but at this point the crappy support, needing extra parts that Roku should just be including, ridiculous responses and lack of knowledge from support did me in. It's reached my attention threshold and I'll just go back to my normal means of streaming.I'd like to leave something positive about this stick but I just can't. I'd say make sure you got the optimal setup to use it but I don't know what that is. Less then 3 ft from the router, attached to a Roku Ready TV and hold the remote in direct line of sight of it and you're golden. Wanna relax and watch something, dance around the room and be prepared to be frustrated when it constantly buffers..Note: I'll come back later and clean this rant of a review up when I can process this whole frustrating experience. Maybe I'll try a Roku 3, but then again I can't see spending double what I spent on the stick with the poor experience I have had with Roku but I guess you do get what you pay for. Maybe the 3 is better though this stick is protrayed as the 3 wrapped up in a portable plug and play stick.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Had over a year... use this combined with digital antenna as i became one of the cable cutting bill tossing consumers. I use this with a low cost well known subscription service...and a enjoy the vast library of additional free viewing available through Roku. Perfect solution to my cable rate going up 150% in 2 years. Plenty to watch.", "verified": true, "helpfulness": "2/2", "author": "CitizenJane \"CitizenJane\""}, {"rating": 4.0, "review": "I give it only four stars becauce it's a little noisy.", "verified": false, "helpfulness": "0/0", "author": "Allen Mills"}, {"rating": 5.0, "review": "Love this streaming stick. Also own the Roku 3. They are both wonderful products. I had cancelled my cable and this gives us all that an more. Easy set up.", "verified": true, "helpfulness": "0/0", "author": "Anne M Verke"}]