[{"rating": 5.0, "review": "Easy to install but not sure my senior citizen  mom can actually figure out how to use it", "verified": true, "helpfulness": "0/0", "author": "waxy"}, {"rating": 1.0, "review": "Died 1 day after warranty ran out. Amazon only has a 30 day return policy. Don't waste your money. Only worked for about 20 days then completely stopped working. I would buy this from Roku themselves if you are going to buy it, they offer a 90 day return.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Kathy Miller"}, {"rating": 1.0, "review": "Item was defective. Should have just bought this locally and saved time and money.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "I cannot say enough wonderful things about this stick. It works great. The only downside is the plug sticks straight out, which makes you unable to push a tv mounted on the wall directly against the wall. I know this is the best streamer out there because I also own an amazon fire stick. The fire stick is awful. It spends half the time loading, though the roku does not do that so I know it is not my internet....and the remote on the fire stick only does what you ask it half the time, seriously, in the first month it has stopped responding or does the opposite of what you press...but roku is amazing and works perfect so if you want to stream GET ROKU", "verified": true, "helpfulness": "0/0", "author": "S. Pounders \"notspoiledbymodern\""}, {"rating": 5.0, "review": "The attractively-branded Roku Streaming Stick box shouts loudly about the streaming services it supports (called “Channels” in Roku-speak). Of course, the list of services differs by region but the line-up boasts over 1000 channels, including many household names.The Roku Streaming stick itself is just a little larger than a USB thumb drive, and is designed to plug directly into the HDMI port on your TV, or other compatible AV device. Like other streaming sticks, it needs a power source to operate – the neatest option, if available, is to use a powered USB port on your TV, otherwise a standard power adaptor is included.Also included in-box is an RF remote control, different to standard infrared zappers in that no line of sight is required to control the device. It’s not the most luxurious remote you’ll encounter but it’s sturdy enough and feels comfortable in the hand. In today’s app-driven world, it’s good that Roku includes a decent, physical remote – especially for older users – but of course, there’s an iOS or Android app that can also be used to control the device.Plug the Roku Streaming Stick into a spare HDMI socket, add power and then switch your TV to the HDMI source – you’re ready to get set-up. Unlike larger streaming devices from Roku and others, there’s no Ethernet port on the Streaming Stick, so your first job is to connect the device to your wireless network. While the device only supports connections up to 802.11n speeds, it is dual-band, so it can connect to 5 GHz networks if your router supports them.In your first few minutes using the Roku you’ll appreciate its big, friendly user interface. With output resolutions up to 1080p, the interface looks crisp on your big screen and remote control button presses are met with a satisfying “clunk”, so you always feel in touch with what’s happening. A quick software update and you’ll be ready to create your Roku account.You’re presented with a Channel Store which allows you to access and add channels from a wealth of providers. While there's a ton of choice you’ll want to separate the wheat from a lot of special interest chaff that the line-up includes. If you the kind of guy or gal that loves nothing better than spending the afternoon delving through obscure lifestyle cable and satellite channels, you’ll be thoroughly absorbed by the weird and wonderful range of channels Roku offers.In the US, the selection includes a host of network and over the top services including Hulu Plus, Amazon Instant Video, Pandora, HBO Go, PBS and PBS Kids, VUDU, Disney Junior, A&E;, Showtime Anytime, Fox Now and more. While channel choice is impressive and very simple to use, streaming from local PCs, NAS devices and home servers requires a little more knowledge. Roku includes support for the the always-excellent Plex Media Server (recently overhauled with a new design and additional features including music streaming) or there’s a third-party Roksbox channel which adds DLNA/uPnP streaming to the Roku device. I bore everyone I meet by recommending Plex, so that’s the option I’d go for if you’re a NAS/home server owner.Streaming quality too is excellent. Many of the major services now use a smart streaming protocol that starts quickly with lower resolution video before switching to full 1080p HD once buffering has completed, so don’t be concerned if the first few seconds of your favourite programme start a little blurry – unless you’re on the slowest of broadband speeds, it’ll sharpen up quickly.The Roku Streaming Stick is a great little package for anyone seeking to upgrade a TV to a smarter, connected solution. The hardware is compact but powerful, the user interface is responsive and a pleasure to use – even for older users who may not be used to streaming from the TV, which makes the Roku Streaming Stick a great idea as a gift for parents. The range of channels is vast and impressive, but once you’ve scanned the list, you may well stick to a few favourites.", "verified": false, "helpfulness": "0/0", "author": "Terry Walsh \"Terry Walsh\""}, {"rating": 1.0, "review": "Just Don't buy it if you are outside USA! It will not work because copyright restrictions on apps like Netflix (that runs on every other brand streamers on must countries) I live in México and bougth this because of Netflix just to find out that must apps \"are not available in your country\" while registering a new Roku acount that, besides, requieres a prior (and obligatory!) card number or Paypal registration.Trying to use this device or any other Roku it's just frustrating outside the \"Roku-white-listed\" countries.  Even when Netflix, Spotify and the other main services are available here you just can't install the apps... but in the bright side you get something called \"TexFlix\" (some sort of texan Netflix) and the Jehovah's Witnesses channel preinstalled for free. Thanks Roku!Amazon just started doing bussiness in México a few weeks ago and I'm impressed to se the Roku line in the available products list of amazon.com.mx . PLEASE STATE ON THE PRODUCT BOX and online description that the device can not be fully used outside the USA. You will prevent a growing list of dissapointed and angry buyers.It's true that a handfull of mexican resellers are offering legally unavailable (?) Roku access to those and other apps but you have to pay them a monthy fee to get remote-access VPN redirecting to USA-only-available services besides the actual Netflix or Spotify charges. I'm not shure if this is legal but by mantaining this nonsense restrictions Roku is letting other people make a huge profit by keeping the devices running using their trademark, image and likeness ( See: http://rokumexico.net/ )  I'm tired of trying to bypass the geographic restrictions by reading tutorials and geek obscure subreddits, I'm giving this brick away to someone already living there.I would love to get my money back and return the item, but it can't be done... you gess it!!... because of of geographic restrictions.", "verified": true, "helpfulness": "0/0", "author": "David Humberto Corona Sandoval"}, {"rating": 4.0, "review": "I like refurbished products because they are usually as good as a new one.  These were no exception.  I only gave it three stars because it wouldn't work on my Brokesonic Flatscreen TV and one of them didn't have the power cord in the box (I returned that one for a refund).  I kept one because it worked well on my Samsung TV and is easier to use that my Nintendo Wii for Netflix, etc.  if the second one had the power cord I probably would have kept it and used it in another room but since I had to return it and the price had went up to replace it, I decided against it.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "I have the Roku 3500R Streaming Stick on my TV in my home office as the only option for watching TV (no cable or satellite).  It works perfectly.", "verified": true, "helpfulness": "1/1", "author": "Maverick21"}]