[{"rating": 5.0, "review": "like it  does job", "verified": true, "helpfulness": "0/1", "author": "gerald tessier"}, {"rating": 1.0, "review": "We tried three different products from three different places and couldn't get any of them to work.", "verified": true, "helpfulness": "0/0", "author": "athibault"}, {"rating": 4.0, "review": "Now I can watch a lot if the older movies and television series that I either like to see again or missed.  Also I enjoy the choices on Amazon Prime.", "verified": true, "helpfulness": "0/1", "author": "Paula S. Garbett"}, {"rating": 5.0, "review": "I love Roku! My whole family has a Roku now that I purchased this refurbished one for my oldest daughter. We all love it! And the refurbished one is working just as a good as a brand new Roku.", "verified": true, "helpfulness": "0/1", "author": "Luverly \"Luverly\""}, {"rating": 1.0, "review": "Not satisfied. The few times I have used it, the remote keeps quitting on me. I have to take out the batteries, and re-install them again for it to start working. I have changed batteries with new ones out of the box, but the problem continues. I would love to get my money back, but I don't know what process to follow to do this. Besides its probably too late since I have had it for about a month. I only used 3 times since I purchased it, and just put it aside collecting dust for now. too much frustration to use it.", "verified": true, "helpfulness": "3/3", "author": "Alexander Avalos Sr."}, {"rating": 5.0, "review": "Cancel cable", "verified": true, "helpfulness": "0/0", "author": "ROBERT T BEEBE SR"}, {"rating": 5.0, "review": "Everything ok", "verified": true, "helpfulness": "0/0", "author": "Sergio Elizondo Loredo"}, {"rating": 5.0, "review": "Works good..", "verified": true, "helpfulness": "0/0", "author": "BRADLEY R. PARSLEY"}, {"rating": 1.0, "review": "I don't recommend this product.  Some of the set-up was cumbersome (too many accounts to log into, passwords to set-up, going back and fourth from PC to TV).  I've been using this for a few months and there are a lot of inconvenient navigation options.  The first annoying thing is that there are a few \"channels\" that you would have to pay for that always show and you can't delete them from your account.  I don't want to pay more to watch stuff.  I really just want to watch from my netflix account, amazon prime, youtube, and hulu.  Well, you can't even put the free hulu in your channel set-up.  And if you're using the general search and find a show to watch, it defaults to one of the channels that you have to pay for.  There is no search for TED talks.  The only option is to pick from what is displayed.  Then last night, all the sudden in the middle of a TED talk the Roku crashed.  Once we got it to start up again, it wanted us to set up our account, wifi passwords, etc. all the way from the frustrating beginning!  I hope I still have the box for this because I am returning it.", "verified": true, "helpfulness": "2/2", "author": "Reviewer"}, {"rating": 5.0, "review": "Excellent!!!", "verified": true, "helpfulness": "0/0", "author": "enrique lopez"}]