[{"rating": 1.0, "review": "I thought it work for me but I have to pay monthly and I already have a lot pay for.I can't return it because I made mistakes I thew a way😔Roku 3500 steaming stick.", "verified": true, "helpfulness": "0/1", "author": "Erisa Niyibhitanga"}, {"rating": 1.0, "review": "Did not work reliably for us. The Wi-Fi signal at the TV (a Samsung 6000) was apparently too weak for the stick. Our router is in another room, about 25 feet away. We verified the weak signal using the \"secret\" screen (you can find out about this on the web) and it was in the red. It did work a little bit but operation was slow, erratic, and the range of the remote was only about 6 feet from the TV.Other things we tried: changing the router channel to the avoid interference with the neighbors, and an HDMI extension cable. The Wi-Fi Analyzer app on a smartphone indicated that the router signal at the TV was fairly strong. If fact, an old Roku LT that we had just under the TV has always worked reliably. We had hoped to replace it with the stick and eliminate the wire, but no luck.YMMV.", "verified": true, "helpfulness": "0/0", "author": "Grammy"}, {"rating": 5.0, "review": "works like new", "verified": true, "helpfulness": "0/0", "author": "noome"}, {"rating": 2.0, "review": "did not work with our system. the old Roku box was better. Had to return the Roku stick to Amazon and got a refund", "verified": true, "helpfulness": "0/0", "author": "liza2000"}, {"rating": 4.0, "review": "Roku is a good enough product for me. I have two of them and compared to other devices (Netgear, Chromecast), they are pretty reliable. The channel software is updated so Netflix and Hulu work well. If Roku 4 comes out, some channels may ignore updates on it (like Netflix for the Roku 2).This device does have the same shortcoming as the Roku 2 I own, namely an unresponsive remote. You are never sure if you are too far away, the batteries or dead, or if it is just glitching out.Overall, for ease of use, features, and price, it can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Matt M."}, {"rating": 4.0, "review": "Works fine and is a Good one", "verified": false, "helpfulness": "0/0", "author": "Burrl96"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "gerald baker"}, {"rating": 5.0, "review": "Wow! Love this for watching Netflix! Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "D.M. \"online shopper\""}, {"rating": 4.0, "review": "I really like this little stick, and I think that it's a great value. I have seen some customers write about the stick becoming too hot - I can confirm that issue on this end, too. Sometimes the device seems to overheat, and becomes very sluggish and unresponsive. Simply unplugging it for a few minutes and waiting for it to cool down works just fine, however it is a bit of a pain. Aside from that minor issue, I absolutely recommend the Roku Streaming Stick (and really, for the price, I think it's one of the best devices you could buy).", "verified": true, "helpfulness": "0/0", "author": "Alycia G."}, {"rating": 5.0, "review": "I have the Roku 3 in the living room and needed another for the den. Instead of buying another box, I bought two of the stick and gave the other to a friend as a gift. She loved it!!!!The stick is just as easy to set up as the box and if you get a USB cord you can power it from the TV so it doesn't take up any table-top space or require [another] socket from my crowded power strip. (I suggest th eRoku Mini USB Cable. Roku Cable Designed to Power Your Roku (3500R) Streaming Stick from Your TV USB Port. )", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}]