[{"rating": 5.0, "review": "Easier to set up than I thought it would be and is working flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Callen Gilbert \"Reading Cowboy\""}, {"rating": 1.0, "review": "They should call the Streaming Stick the Steaming Pile of crap. The remote gets stuck constantly and makes navigating a complete nightmare.", "verified": false, "helpfulness": "0/0", "author": "james e freeman"}, {"rating": 4.0, "review": "This stick is perfect for streaming Netflix and Amazon Prime Videos. We don't really use it for much else because Netflix and Amazon have so much content. But there are hundreds upon hundreds of on demand video channels, including channels that offer free movies, but those movies are either low budget or just not very good. The device does have glitches every now and then, like running slow or freezing which either requires a restart of the device via the settings menu, or restarting it by unplugging it. But overall it's still worth the low price, especially if Netflix and Amazon Prime Videos are your main thing.", "verified": true, "helpfulness": "0/0", "author": "Attila"}, {"rating": 4.0, "review": "Works well. But it takes time to start up every time I turn on the TV (I powered in with my TVs USB).", "verified": true, "helpfulness": "0/0", "author": "Antony"}, {"rating": 3.0, "review": "The wireless radio on this device sucks.", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Given as a Christmas gift and broke in February. I have 3 Roku 3s, and gave this as a gift. Major disappointment. I can't believe that it was ineligible for return.", "verified": true, "helpfulness": "0/0", "author": "Brian K."}, {"rating": 5.0, "review": "Device works as advertised.  Wanted a Roku for quite a while, and the streaming stick works great with all the streaming services I use.", "verified": true, "helpfulness": "0/0", "author": "K. Kurr"}, {"rating": 5.0, "review": "Works as expected..No issues", "verified": true, "helpfulness": "0/0", "author": "virji1988"}, {"rating": 5.0, "review": "Works fine and so small. Great item.", "verified": true, "helpfulness": "0/0", "author": "bob bowen"}, {"rating": 5.0, "review": "Does what it says it will do. So far easy to install and use. Couldn't get any reception at 25ft. with Amazon Firestick. Returned it with no problem as usual. This unit is a refurb was the same price as the FS. All good now.", "verified": true, "helpfulness": "0/0", "author": "pd"}]