[{"rating": 4.0, "review": "I got two of these, one for my bedroom and one for my son's bedroom. Too bad is not possible to play the games with it.", "verified": true, "helpfulness": "0/0", "author": "Mema"}, {"rating": 5.0, "review": "I'm a recent cable-cutter, and setting up the Roku with Prime/Netflix/Hulu was completely simple and straightforward.  Paying $50 to save $130/month... sign me up for that any time!Now they just need to figure out the whole \"Live Sports\" part of streaming... I'm gonna miss Packer games once the season comes around.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 5.0, "review": "This device is so cool. No more having to hook up my laptop to my TV via HDMI cables just to stream my Prime, Spotify, and other online content. It is so small I take it anywhere I go and view my content anywhere there is WiFi and a TV with HDMI ports. It is much cheaper option than wireless HDMI receiver/kit.", "verified": true, "helpfulness": "1/1", "author": "Jeremy Rice"}, {"rating": 5.0, "review": "Works well.  Easy to use.  We had to move our wifi router, zoom,  closer for apps to load.  The approximately 40 ft was too far.  Now works great.  Worth the extra money compared to google chrome to have a remote.  Has lots of apps, but not much that I (I'm 50) would want to watch, but I don't really watch much on internet.  Mostly watch Netflix.", "verified": true, "helpfulness": "1/1", "author": "kyle solomon"}, {"rating": 5.0, "review": "I Love the Roku 3's, I have a couple and I now use this on a tv. You can tell it isn't as powerful as the 3, but it does what it needs to do.", "verified": true, "helpfulness": "0/0", "author": "Ben Thrum"}, {"rating": 4.0, "review": "I am not good with Technology. Roku advertises Free channels/movies. My kids seem to like it. I like watching movies also. More of an outdoors type of person.", "verified": true, "helpfulness": "0/0", "author": "Kelly Anderson"}, {"rating": 5.0, "review": "If you have Roku and 1 or 2 paid accounts (like Amazon Prime and Hulu), you can pretty much give up your cable (most certainly your movie channels). The HD is clear, sound is fantastic. Worth every penny!", "verified": true, "helpfulness": "1/1", "author": "Kelvin"}, {"rating": 5.0, "review": "This little stick works better than the Roku box (which only worked when the sun was high and bright in the sky).  Great alternative to regular tv.", "verified": true, "helpfulness": "1/1", "author": "Sandra"}, {"rating": 4.0, "review": "I have 3 different models of Roku, including this one, so it's obvious I'm a fan.  These are the easiest consumer electronic devices to set up I have ever encountered.  However, this one is not superior to the traditional Roku boxes.  I had this one hooked up to a TV on the far side of the house from the wireless router.  It couldn't get a signal.  I swapped it out with a Roku that was closer to the router, and it worked fine.  The other Roku also picked up a signal just fine in the more distant location.  I would say if this is fairly close to the router, it will be fine.  Otherwise, you might consider one of the Roku boxes.  This company makes quality products.  If you want to stream things like Netflix, Hulu, etc to your TV, this is the company to use.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I am SO UNHAPPY!  I went to turn on my netflix via Roku and the remote wasnt working.  I changed the batteries 3 seperate times all with brand new duracell batteries... nothing.  I took apart the remote and all the components were still in tact.  I went on to see if I could return it because it has only been a month and you usually get 30-60 days... well.  I purchased it April 19th and it is now May 22nd.  30 days +3 days = SORRY BUT YOU LOSE!  UGH!  Slap in the FACE!  It would be nice to get a replacement!  As I said, Its a good product... I love Roku... But not happy I got a DUD!", "verified": true, "helpfulness": "0/1", "author": "stay@homemom"}]