[{"rating": 1.0, "review": "The remote sucks.  I have to return it because the remote will not work and if I use the app on my phone it scrolls like crazy and doesn't stop on what I want to watch.  Very disappointed in this.", "verified": false, "helpfulness": "0/0", "author": "Lisa Harshman"}, {"rating": 5.0, "review": "Works great and takes up very little room. It does process just a tad slower than the Roku 3, but a great option for a secondary TV.", "verified": true, "helpfulness": "0/0", "author": "Denny"}, {"rating": 4.0, "review": "Works well. easy to install, great price. Read some of the other reviews for great helpful info.", "verified": true, "helpfulness": "0/0", "author": "Reutter"}, {"rating": 5.0, "review": "Great Gift!", "verified": false, "helpfulness": "0/0", "author": "Thomas F Blackmon"}, {"rating": 1.0, "review": "Went through the device setup without any issues whatsoever.  Everything was crisp and clean with the remote and the device.  Then the device booted up and updated with our selected content on it and had the issue.  When selecting anything within the main menu or any other menu the selections would scroll uncontrollably until I pushed a button to stop the scrolling.  Sometimes, it would seem fine and one press of a button lead to one action.  But more often than not, just when you thought you were selecting a service or show to watch, the device would start scrolling uncontrollably and select another show 5 selections away from the one you clicked on.  I thought it was a faulty remote at first.  But when I reformatted the device and before any updates, the remote and the device were once again crisp and perfect when inputting the user information.  So it was a problem with the device itself.  I tried the device on another tv, same issue.  Tried taking all remotes that \"might have the same frequency\" outside the house, same issue.  Tried different tv settings, same issue.  It was very frustrating.  We are going to try a Roku 3 to see if actually works correctly right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Perfect!  We are having so much fun with this thing!! The best of all the streaming options", "verified": true, "helpfulness": "0/0", "author": "Amber W"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 5.0, "review": "Works Great! No Complaints. It comes with the power cord FYI", "verified": true, "helpfulness": "0/0", "author": "neil suva"}, {"rating": 5.0, "review": "I absolutely love my Roku Stick. Best investment I ever made, switching from no cable and just using the free channels broadcasted over the air, this makes the perfect backup when there's nothing on TV. You can find hundreds of channels to watch like Netflix and Hulu and Amazon Prime video. Its the best.", "verified": true, "helpfulness": "0/0", "author": "Adam S."}, {"rating": 1.0, "review": "I have to replace the batteries in the remote every time I use it.", "verified": true, "helpfulness": "0/0", "author": "SUSAN L WYNNE"}]