[{"rating": 4.0, "review": "I got this stick free with a sling TV promo. It is a very good, maybe even great streaming stick. The ability to plug it into the USB port of the TV for power is nice, and creates a clean look. Using the USB port does cause 1 drawback, the stock has to completely boot when Turning the TV on this takes about 30 secs.The only real complaint I have is with the remote it uses its own wifi to connect to the stick, and it has some connection issues. I've had to re-add the remote 2 times, and pull the batteries about 10 times, in 3 months.The 3500R does offer 5GHz wifi, 1080P video, and current Netflix app (allowing profile switching). These make it ideal for wall mounting, or anywhere else you want to keep it hidden.", "verified": false, "helpfulness": "0/0", "author": "Kmagn13"}, {"rating": 5.0, "review": "Very great product", "verified": true, "helpfulness": "0/0", "author": "guillen"}, {"rating": 5.0, "review": "bandwidth control for those that are lacking a QoS router", "verified": true, "helpfulness": "0/0", "author": "Corey Johnson"}, {"rating": 5.0, "review": "I bought this for my Mother and Father and they can't stop watching it. They watch it more than they do regular television. They watch it for hours at night. They haveNetflixHuluAmazon PrimeHBOCinemaxShowtime and the list goes on and on...", "verified": true, "helpfulness": "0/0", "author": "Kim Tolliver \"Cat lover\""}, {"rating": 1.0, "review": "I was really, really excited to get the Roku streaming stick, as I figured this could be a way of using my \"dumb\" TV so it's not just collecting dust. What a waste of money.The issues:1) From the very get go, the Roku would connect and disconnect to my network intermittently. Half the time it couldn't find my network. I replaced my modem, tested my router, and ran checks with three other wireless devices to see if they had the same problem. Full strength signals on the other three devices, \"weak\" signals on the Roku.2) The remote - it clearly has a mind of its own. It wants to work one minute and I can click through screens and then it simply stops working and that's the end of that. I can change the batteries, I can try to reset it, nothing works. My favorite was when I was talking to customer service after a hard reset and they said, \"The problem is your internet, that's why the remote can't connect to the Roku.\" Well then...how is the remote magically connected to my password-protected wireless network and moving the device through the initial start up screens BEFORE I've even entered my password? Not to mention that when the device decides to disconnect from my network, there are times where the remote is still perfectly capable of switching through screens...pretty sure my network has nothing to do with that. Try harder, Roku customer support. Speaking of which...3) The customer service - they assume that all their customers are basically the lowest common denominator. You can say, \"I've already done this, this, and this,\" to troubleshoot, and they'll still tell you repeatedly that you need to do what they say, and when the device doesn't behave as they think it should, they make up reasons to explain why it's not working. (See point #2). You might well be talking to a robot for all the sympathy and compassion provided.It's my own fault for not returning it the first day I tried it and ran into these issues but I wanted to give it the benefit of the doubt and forgot to sit in front of my tv long enough to actually try it. And then every time I tried it, I just got frustrated and said I would try this again when I had more time and more patience. I can count on one hand the number of times I actually watched something without buffering, disconnecting from the network, the remote disengaging, or it just not loading the show or film period. So basically: do not recommend.", "verified": false, "helpfulness": "0/0", "author": "Jess"}, {"rating": 5.0, "review": "This was one of the best purchases I have ever made! I am so happy with the functionality of this and the easy setup. This stick has so much to offer. If you are looking to find a smart app stick for your HDTV, look no further. I bought this stick because I wanted to use it to stream my Slingbox from home to my television away from home and this stick offered the application for the Slingbox. While it does not allow you to stream it without a handheld device such a tablet or phone to watch the Slingbox, it worked perfectly when I got one. It also has limitless choices for other apps to download. My personal favorite is the Crackle app. It features popular movies such as Joe Dirt and other for absolutely free! It also allows you to download other apps such as the TWC app to allow you to stream your digital cable through this stick enabling you to eliminate the need for an additional cable box for another room. It was easy to setup and came with a neat remote to make it easier to navigate things. I can't say enough about this product. Do not fear buying it refurbished as that is what I did and it saved me some money. Also, if you want to save more, simply sign up for a cash-back website and receive as much as 5% back on your Amazon.com purchase! What are you waiting for... the choice is easy with this product! If you found this review helpful, be sure to let me know by voting! Send me any questions you have and I will do my best to respond in a timely manner to answer them!", "verified": false, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Worked well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "No complaints on the fact that this is a reconditioned item at al! So far it works great and the picture is awesome. I plan to buy more Roku products for my home in the near future.  Setup was as expected and required a computer , phone or tablet to create an account with Roku and register the device but after that you are good to go. Initially I was under the impression that thte TV had to have a usb port to power the stick but it does actually come with a usb wall adapter and a usb cable much like most of our phones. My main reason or this purchase was the ability to use the DS Video Application that allows me to stream movies from my Synology NAS. DS Video shows me all the info about a movie and a synopsis of the film along with cover art. this makes for a pleasant experience when deciding what movie to watch. I hope to use this for travel viewing as opposed to at home due to the RF only remote control. My home systems use universal remotes and control systems to operate macros and not having an IR port makes this a less viable option for controlling in that manner. I do believe you can use an app on a phone or tablet to control the Roku stick, it just doesn't fit into my particular workflow.", "verified": true, "helpfulness": "0/0", "author": "A-hopps"}, {"rating": 5.0, "review": "Great gift.", "verified": true, "helpfulness": "0/0", "author": "MT"}, {"rating": 3.0, "review": "I think the Roku  could be great,but there are too many people on there charging money for the same old movies net flicks puts on so why should I pay them for the same old same old, specially showtime, showtime and net flicks are the same thing.Any movies that are free,have trouble streaming and too many commercials,like 5 min.apart.tell me what is the point of a roku if you have to pay for a decent channel?? History channel has a few good shows,ie; Pawn Stars, Las Vegas,and the same in New Orleans,but not much more.Amazon is the same,same old movies,unless you pay for Prime.I will keep looking,hope I find something free and decent.Is there such a thing??", "verified": true, "helpfulness": "0/1", "author": "Patty"}]