[{"rating": 5.0, "review": "What's not to like about Roku? TV today is mostly garbage and studies show that passive watching of TV contributes to brain degeneration (did we really need a study?), but when we are actively seeking the content that we want to watch, it does not have the negative effects. I got this for my mother, who is newly retired. I don't think she has bought into it yet, but she does have a Netflix and Amazon Prime membership, so hopefully she will see how great it is. You would think that the HMDI stick being behind the tV, that there would be remote control communication issues, but it works fine.", "verified": true, "helpfulness": "1/1", "author": "EzereBartonne"}, {"rating": 1.0, "review": "Arrgh. 35 Years in the Tech Industry and never before have I encountered such a NOT Ready for Primetime device like this. Conceptually it's wonderful, practically it's useless. After 24 hours, connected to a 54MB router, and HULU and Netflix had still not fully populated their respective menus. Even upon selecting a menu from either service, the selected show would not begin. The only thing I could watch, after the 24 waiting period was one movie trailer.Put this thing back in the oven, it's not done yet. Or better yet, release it in green for as Kevin Kline said in A Fish Called Wanda , \"Avoid the green ones, they're not ripe yet.\"", "verified": true, "helpfulness": "3/6", "author": "Blaine Mogil"}, {"rating": 4.0, "review": "Like the service now that it is set up.  Was for me not as simple as it should of been, took many tries before it fully connected to my internet,  No Idea what was happening but stayed with it and over an hour later everything was working together.  Not had any issues since ( 1 week)", "verified": true, "helpfulness": "1/1", "author": "Toni Gray"}, {"rating": 5.0, "review": "Works great as a Second device - I own a Roku 3 on my main TV but this streaming stick is great for a second TV - only doesn't have some of the features of the Roku 3 such as the headphones jack.", "verified": true, "helpfulness": "0/0", "author": "DMR"}, {"rating": 2.0, "review": "I find it awkward & challenging to use.", "verified": true, "helpfulness": "0/0", "author": "dh"}, {"rating": 4.0, "review": "Works pretty well. A bit slow loading and synching the remote when turning the TV on", "verified": true, "helpfulness": "0/0", "author": "C. Christopher Akin"}, {"rating": 5.0, "review": "Exactly what i needed for my NON Smart tv . The Roku picks up my WiFii no problem and streams my Netflix  LOVEEEEE It  Thank You.  PS. Fast Shipping too.  However I also bought a HDMI cable and the Roku had one in the box.  Even more Value .", "verified": true, "helpfulness": "2/2", "author": "Sheila Williams"}, {"rating": 5.0, "review": "Everything like expected", "verified": true, "helpfulness": "0/0", "author": "ladyhkaz \"mickey\""}, {"rating": 5.0, "review": "Easy to install.  Just be sure your wireless connection is decent.  If your a newbie you'll need to go ahead and set up a Roku account to register the unit. Saved some money with this refurbished unit.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm very happy with my Roku stick. Installation of the device and setup was easy. I've watched both Netflix movies and Amazon Prime TV series so far. I had to stop using my Logitech Revue due to loud fan noise (and concerns about a possible electrical fire). Logitech never returned my call or email about that device, although oddly they did email me to ask if I was satisfied with their response. Anyhow, I found the Roku stick here on Amazon, and I decided on it because I don't play online games. The Roku remote is also easy to use.", "verified": true, "helpfulness": "0/0", "author": "Michelle A. Green \"eprof\""}]