[{"rating": 1.0, "review": "I tried this on the tv for which I bought it (purchased less than a year ago) and there wasn't enough room to connect the device and the power cord.  I then hooked it to my other tv which did have the necessary space for the power and entered the wifi password and successfully connected to the wifi.  Then it failed trying to connect to home network.  No other device does this.  They all connect to wifi and then internet.  This device's software has an extra step which is unnecessary and causes it to fail.  It provides no work around for this.  I had to send it back.  Instead of watching the ballgame I am spending my time printing and attaching labels to send this back.", "verified": true, "helpfulness": "2/4", "author": "Nick D \"Nick D\""}, {"rating": 5.0, "review": "Easy to install and.a breeze to setup.  I chase this over the Chrome since is cost very little more and it has more functions.  Read the Cnet article.", "verified": true, "helpfulness": "0/0", "author": "Steve Morrow"}, {"rating": 3.0, "review": "It's nice that you can plug this into the TV without adding a box, but it's slow, slow, slow. Takes about 60 seconds to start after turning on the television if power is coming from TV, too.", "verified": true, "helpfulness": "3/4", "author": "Richard"}, {"rating": 5.0, "review": "My parents have owned the original Roku since it first came out. Back then it was awesome now it is AMAZING! No longer is it the size of a cable box or limited to a handful of channels. Overnight we now have access to hundreds of channels that we actually WANT to watch! Not to mention setup was a breeze - an actual self-install that worked flawlessly. Simply plug the stick into your TV, then plug it into the wall, and follow the on screen instructions and you're up and running in less than 15 minutes. Honestly it couldn't be any simpler to install and use.We are so happy with this product that we highly recommend it to anyone interested in watching movies and TV shows without incurring a hefty cable bill - just a one time fee of $50 for the equipment and you're done. Plus if you want you can of course use your Netflix account or get Netflix for about $10/month and you'll have access to a ton more affordable entertainment right from your TV screen.This product cannot be outmatched by any of it's competitors buy it and you'll be happy - plenty of entertainment for all ages.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"carolinerocks\""}, {"rating": 3.0, "review": "This is the 2nd Roku I've had, but I think I will keep it.  1st one was an early generation Roku, and wasn't even as good as this stick.+1 star... Content.  Roku has added plenty of channels to keep people entertained.+1 star... Design.  This plugs directly in to the TV HDMI port.  It does require external power, but that can be provided by the TV USB port.+1 star... Setup.  I had the Roku 3500R Streaming Stick unpacked and installed in 10 minutes.  Was watching Robin Hood: Men in Tights 3 minutes later on Amazon Instant.-1 star... Local Streaming.  Come on, Roku.  You're good at everything else.  Add some codecs and a player or something.  I've got 15 Terabytes of local media that won't be viewed using the Roku.  Boxee Box is still plugged in for that.-1 star... Remote.  The remote is generally pretty good, the only down-sides are 1. No keyboard, and 2. Blockbuster (who are they?) button.  Otherwise, RF allows you to use it just about anywhere in the room, and since the stick is on the back of the TV, no line-of-sight is required.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I purchased this to replace the \"wired\" Roku that I have. The problem is my TV doesn't generate enough juice via the USB port and it would have to be plugged into a wall socket anyway.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A little slower than the roku 3...but the wifi connection isn't inhibited by this.  My shows come in great! Screw apple...", "verified": true, "helpfulness": "0/0", "author": "jr"}, {"rating": 5.0, "review": "I bought this for my father who is not only technology-adverse, but was actually operating his 20 employee small business with a typewriter and series of files until 2005. What prompted the purchase, he watched a couple of episodes of House of Cards and expressed interest in watching more.  I thought about the Roku, but when he even made the leap and started texting me this year, I knew he was ready.I bought the Roku stick, and it fits in the HDMI slot of any TV (read, any newer flat screen), the stick does require a power source, so it will still have a cord.  I guess I thought it would be powered by being plugged into the HDMI, but it's not. It's a minor annoyance, so be prepared for that.  But other than the cord, the stick is a very compact design. Be prepared to spend about 30 minutes setting up the Roku, you'll need wifi for the Roku to work and a credit card (for other purchases you may make down the road through your Roku) but that's about it.I was able to set up a Netflix account for my dad during that time, and get him all logged in, and showed him how to set up some additional Roku channels.  It was pretty clear which channels and movies would be a charge, and which ones would be free, which was comforting to him.  The final piece of comfort for me, was about a week later when Netflix accidentally logged him out on his Roku, and he lost his login credentials, he was able to figure out how to reset his own user ID and password.  I think this is something that 5 years ago might have either sent him to a bottle of scotch, or sent him back to Blockbuster and Comcast.  Now thanks to Roku, I know I won't hear from him for a week because he will be binge watching season 2 of House of Cards, and I'm OK with that :)", "verified": true, "helpfulness": "0/0", "author": "Valerie C. Lynn"}, {"rating": 4.0, "review": "Nice wireless streaming player with user friendly interface. The wireless remote uses an RF signal so no line of sight issues some of the other Roku players may have had to overcome.  Lots of media option and the portability of the player and the ability to quickly move from one tv to another or bring with on a trip is where this model shines. Only thing to make it a five star would be to have the HDMI port power the player instead of having to tether the power cable to a USB port or AC.", "verified": true, "helpfulness": "0/0", "author": "Ryan G"}, {"rating": 4.0, "review": "First, some background: I have had Roku devices since the company released their first one years ago. I've upgraded through every generation, as well as using other streaming devices from other companies. I know my way around cord-cutting, as I've been off cable and terrestrial television for about 5 years now.Now, on to the review...ROKU'S BEST EFFORT THUS FARYes, I'll stand by this statement. Roku has taken all the best things about their devices and compacted it into a stick that takes up minimal space, has varying options for power sources, and works better than anything at this price point... But that doesn't mean it's perfect. Let's get into the meat of the situation and talk about why their best effort is still short in a few places, and why that shouldn't (or should) matter to you.SO SHOULD I GET THIS OR THE ROKU 1?The obvious starting conversation here is \"should I get Roku Streaming Stick or the Roku 1, since they're both about the same price?\" and the answer is a bit more complex than a simple yes or no.▼ User Interface: The Roku Streaming Stick for HDMI has the same basic user interface as the Roku 1. It seems to be a tiny bit quicker in menus, but it's really not a noticeable difference as far as I'm concerned. The Netflix app is slightly different, but that comes down to personal preference as I can't say one or the other is better; both Netflix interfaces have their merits and their negatives. Most other apps are identical on all Roku devices.▼ Remote Control: Here's where we hit the first stumbling block for the Roku Streaming Stick. While the Roku 1 supports an IR remote, the Streaming Stick only supports RF. What this means is that if you use a universal remote control, such as Logitech's Harmony series, you will NOT be able to control the Roku Streaming Stick with it. You will be stuck using the Roku Streaming Stick's included remote.This would not be a problem for most people, but when you're used to an elegant and well-made remote, the Roku Streaming Stick's remote is a huge step down. It's fat, heavy, has odd button placement (why is the \"OK\" button UNDER the control cross on this, but in the middle on the Roku 1? I much preferred the button in the middle of the cross), has direct buttons for MGo, Netflix, Vudu, and Amazon (which is great if you use all of these, but wastes space if you don't), and of course it lacks controls for other devices like your TV, receiver, or soundbar.The Roku 1, on the other hand, supports IR input, which means it works perfectly with Logitech's Harmony Remotes. If this is important to you, then you may want to avoid the Roku Streaming Stick. If you plan to use a universal remote in the future, you may want to stick with Roku 1, 2, or 3.Granted, you can always use the Roku App for Android or iOS on your tablet or phone, but that's not exactly an improvement. The remote app still doesn't control volume or any TV/Audio functions, and additionally ends up draining battery from your phone or tablet. It's a tiny patch for a very big hole. It's also worth noting that the iOS version is for iPhone/iPod touch, and will be blown-up and a bit ugly on an iPad, since Roku hasn't bothered to make a universal version yet.By the way, you know what's really annoying? When you're in the middle of a movie or show, and you accidentally hit one of the four instant-access buttons at the bottom of the remote (MGo, Amazon, Netflix, Vudu) -- You are instantly popped out of your video and taken to the other channel. I think they should consider an \"are you sure?\" prompt... Or sell a remote without these buttons!▼ Heat: There is no doubt about the fact that the Roku Streaming Stick gets hot. The Roku 1 doesn't. This is to be expected when you're dealing with electronics packed into a tiny space, but it remains to be seen whether or not the hotter-running leads to shorter life. The jury's still out on this one.▼ Power Options: The Roku Streaming Stick MAY work using power solely from your HDTV's HDMI port. This seems to me more common in 2013 model televisions and later, while older HDTVs don't output much power from the HDMI port at all. This means that the Roku Stick must be powered using the included USB cable. For most people, it's a simple matter of connecting to the USB port on your HDTV. For some people who bought cheaper TVs (Element, Sanyo, Emerson, RCA, etc.) there is often no USB port available, and as such these folks will be forced to run the USB cable to the AC brick, and plug into a standard wall outlet.However, consider that the Roku 1 (and all other models) require using the wall outlet. Period. There is no option for USB power in other Roku models, and as such the Streaming Stick is simply more versatile when it comes to giving it power.▼ Local Media Connectivity: There are no USB ports, or additional inputs on either the Roku 1 or the Roku Streaming Stick. If you want the USB port, you're stuck getting the Roku 3. Personally, I think it's not worth it because Roku handles local media so poorly. You're far better off getting a dedicated device for local media, such as the mid-range Micca players. Most devices, like the Roku or game consoles, that try to do many things at once tend to fail at the local media by limiting the size, format, container, or codecs of the media files you wish to play.Essentially, local media is limited on the Roku 1 and Roku Streaming Stick to a network server, such as the EXCELLENT Plex Media Server and it's accompanying app for Roku. I think most people who keep their PC on all the time will be pleased with Plex as their local media source.▼ Video Connectivity: The Roku Streaming Stick is obviously HDMI only. If your TV is old, you won't be able to use the Roku Streaming Stick very well or at all, and you really should go for the Roku 1 (or other Roku models), which all support AV connections.▼ Audio Connectivity: The Roku Streaming Stick supports 5.1 audio via HDMI. For those of you with receivers, you would just plug the Roku Streaming Stick directing into your receiver, and then output via HDMI to your TV, monitor, or projector. Your receiver should be able to decode the 5.1 audio from your Roku Stick without a problem.  Just make sure you go into Roku Settings and set the audio for Surround Sound instead of Stereo!The Roku 1 also supports HDMI 5.1, as well as supporting standard RCA red/white stereo and Dolby audio. If your receiver is old and doesn't have HDMI input, then you have no choice: You will NOT be able to get audio from the Streaming Stick and must choose the Roku 1, 2, or 3.The same applies to soundbars. The Roku Streaming Stick will not output optical (toslink), coaxial, or RCA red/white audio, so your only choices would be to have a soundbar that has HDMI input that passes video to your TV via HDMI outputs (less likely), or to output audio from your TV to your non-HDMI soundbar and keep it in stereo.▼ Internet Connectivity: The Roku Streaming Stick supports dual-band wireless; the Roku 1 doesn't.  If you don't know what any of this means, then you most likely don't need dual-band wireless right now and can get either device without worrying about it.▼ YouTube:  For some reason, Roku has decided that the Roku 1 won't have YouTube yet. They say they're working on it, but it's pretty obvious that withholding YouTube from their lowest-priced Roku box is a means to lean people toward the higher-priced models.Meanwhile, as something of a surprise, the Roku Streaming Stick does support YouTube natively, and even supports \"casting\" from YouTube; A method by which you choose your videos on a portable device or PC, and then \"send\" it to the Roku. The Roku connects to YouTube directly instead of to your device, and plays your video.It's a good thing they have this, because the built-in YouTube app interface is clunky, and the search is slow and messy. You almost NEED the casting feature for YouTube to be fully functional.Another note: If you don't have a birth year listed on your Google+ account (oh, yes: You have one. They kinda forced you to) then you won't be able to view age-restricted YouTube videos on the Roku.If you need YouTube, then the Roku 1 is out for the time being. Maybe in a few months to a year they'll put YouTube on it, but for now the lowest-cost YouTube-capable Roku is the Streaming Stick. If you don't care about YouTube, then the Roku 1 will be fine.It should be noted that all other video apps are supported on Roku 1. YouTube is the only one missing, so don't worry about missing out on other Roku channels, including private channels. The Streaming Stick and Roku 1 both support every other channel.▼ Remote Headphone Jack:  Neither the Roku 1 or the Streaming Stick have it. When I had my Roku 3, I never used it, but you may have need of such a thing. if that's the case, you need to aim for the Roku 2 or Roku 3.▼ Send Video/Photo/Music from Roku App:  Both devices fully support this feature.▼ Search:  Both devices fully support Roku's system-wide search feature, which can be very handy for finding contend quickly and easily. This is one of Roku's best features, no matter which unit you own.▼ Casting: As I said above, the Roku Streaming Stick's YouTube app supports \"casting\", which is the process of choosing content on a portable device such as a smart phone or tablet, and then instructing the Roku Stick to connect with YouTube directly (NOT with your device) and display the video. This feature is also supported by Netflix, so if you don't like searching on your TV screen for videos on Netflix, you can use your portable device, find the video, and then cast it to your Roku Streaming Stick.Personally, I have yet to need this for Netflix, as the Roku's Netflix interface is quite nice. Your mileage may vary, though.And of course, the Roku 1 doesn't do this at all. If you really want the casting feature for Netflix and YouTube, the Streaming Stick is your only choice.▼ Price:  Currently, they're priced the same. No winner here.▼ Fit: Believe it or not, some people have complained that the Roku Streaming Stick doesn't fit in their TV's HDMI port because of placement, proximity to other ports, or space behind the TV if wall-mounted. The Streaming Stick isn't for everyone because of this, and you may find that the standard Roku 1 device is more versatile in terms of where you can connect it.TIPS AND NOTESI find that a lot of new Roku users are confused by some things, so I'll try to offer some advice here.▼ You don't turn it off!  The Roku devices are designed to remain on at all times. They don't use much power, and when they're on a menu (even within an app, such as the Netflix or Roku app), they don't use any of your Internet bandwidth. Even if you pause a video and leave for a week, you won't use up your bandwidth. PLEASE, if you want the Roku to work properly and easily, don't unplug it or connect it to a surge protector with a switch that you flip when you're done. DON'T TURN IT OFF unless you need to reset the device for some reason! It will NOT be a problem to leave it on. It's designed that way!▼ As I noted above, if your HDMI port doesn't supply enough power to the Roku Stick, then search the back of your TV for a USB port and use that to power the Stick, using the included USB cable. That should be enough to do the job, and you won't need to connect to a wall outlet or surge protector.▼ Harmony Users: We're pretty much boned here. We can't use our Harmony remote or hub to control the Roku Streaming Stick, and that means we're stuck using the Roku remote or the Roku App. Take heart, though: You can always have the Roku App and the Harmony App next to each other, and switch between them on your smartphone or tablet. It's not the best solution, but until Logitech decides to connect to the Roku using WiFi, we're out of luck. Only the Harmony keyboard supports RF.▼ SPECIAL NOTE FOR HOTEL TRAVELERS:  If you're picturing grabbing the Roku Streaming Stick and popping it into the hotel TV, then connecting to the hotel WiFi, you may want to reconsider. The Roku Stick does NOT have a web browser, and many hotels (and other free WiFi suppliers) require you to open a web page and accept their Terms & Conditions before being granted access to the Internet. You can't use your portable device or laptop to accept the Terms & Conditions and then stream on the Roku; The Terms & Conditions are usually required to be accepted ON THE DEVICE THAT IS ACCESSING the Internet, i.e. the Roku Streaming Stick.What this means is that many hotels will simply NOT allow you to connect a Roku Streaming Stick and start watching videos. You may be able to use the \"cast\" feature to initiate videos from Netflix if you do it from your PC or portable device (I have not tested this yet), but Amazon, Vudu, Hulu, and all other channels except YouTube will be blocked.My advice, if you are a traveler dreaming of a simple way to watch movies in the hotel without paying the hotel's PPV prices, is to pick up an HDMI cable and bring your laptop. You will have a far easier time connecting your laptop to the TV and using it as a monitor than you will trying to get a Roku Streaming Stick to access hotel WiFi in many places.▼ I highly recommend getting a screensaver that has weather and time, and setting it to your local area. It's very handy to have the Roku serve as a clock/weather guide when in screen saver mode.▼ Don't consider the Roku a gaming device by any means. Yes, there are games, but they're not highly-developed and control is frankly pretty awful. If you want a cheap gaming console, consider the Amazon Fire TV, the Ouya, or pick up a used Wii. The Roku is first and foremost a video streaming device, and the games are an afterthought, at best.▼ Experienced Users, I said it before and I'll say it again: If you want to access local media on your own server, you MUST get PLEX for Roku. With PLEX Channels you can access CBS shows, NBC shows, South Park Studios, The Daily Show, CW shows, SPIKE TV shows, ABC shows, PBS shows, Comedy Central videos, and tons of other content. With the PLEX Media Server on your PC, you can stream your video library in HD with multi-channel surround a LOT better than most XBMC devices handle it, and this includes fan art, movie sheets, and other bells & whistles. PLEX is well worth the small Roku app price, and the PC PLEX Media Server is free.New cord-cutters and Cable TV refugees:  When you step into the world of streaming video and step away from cable and terrestrial TV entirely, you have to get used to some changes in the way you watch things. Here's my quick guide:▼ Subscribe to Netflix, Amazon Prime, and Hulu Plus. Combined, they're still way cheaper than any cable bill.▼ Put Crackle on your channel list. Free movies and TV shows. No subscription required.▼ Use Plex to watch local media.▼ Search YouTube for \"full show\" or \"full movie\" to get some extra content.▼ Do not expect to see live sports when you're a cord cutter, unless you subscribe to MLBTV or other sports-related subscription services. You can always buy a nice antenna and view anything that the local network affiliates can broadcast.▼ If you like old movies, there are tons of Roku channels that have FREE movies. Don't pay for a channel until you've exhausted your search of the free ones!▼ For the kids, you can set up a Netflix Kids account, and there are plenty of kid-friendly and cartoon-loaded Roku channels.▼ Roku Private Channels are channels that are not \"officially\" supported by Roku, but can be added by finding a code and entering it at the Roku website in your account settings. They give you other channel options in a wide variety of content.▼ With that in mind: DO NOT PAY FOR ROKU PRIVATE CHANNEL LISTS!!! You may see them advertised on various sites (this one included!) and they are a SCAM. You can get a list of private channels by doing an Internet search for \"Roku Private Channels\" -- These lists people are selling are just compilations of the search results you can get for free. Don't be scammed.▼ If you're going to turn off the TV for the night, make sure to hit the \"Home\", \"Pause\" or \"Back\" button on your Roku remote. Turning off the TV does not stop the show from streaming, and if you're in a channel/app that does automatic advance to the next episode, it will keep playing while the TV is off. This will use up some bandwidth from your ISP, and worse, it will cause you to lose your place in the episode progression! Note that you can pause a show and come back a day later, and you will not have used any additional electricity or bandwidth. Pausing is fine, but it's still better to just exit the show.▼ You may not there's no \"stop\" button on the remote. That's because Roku has always considered the \"back\" button ( ← ) to be the \"stop\" function. Back will always take you back to the previous menu, which stops the video in the spot you were at. When you go back to it, most channels will let you resume from that position.FINAL VERDICT, AND RECOMMENDATIONAssuming the Roku Streaming Stick is durable and holds up to the additional heat it creates, I'm calling this a 4-star device. You give up a few things going to the Stick from the standard Roku boxes (most notably the IR receiver), but you gain a few features, too, and you have a more compact device that allows you to reclaim some space in your entertainment center.However, it's not perfect. It lacks that IR receiver, which is a MAJOR loss to owners of universal remotes and audio receivers. It does get hot, which may shorten its life. The smaller size doesn't make the Roku any more useful for travel because it lacks a web browser to accept hotel Terms & Conditions, and you'll still be falling back on your laptop, tablet, or smartphone sometimes. It doesn't support AV (Composite) connections at all (not a loss as far as I'm concerned; If you're still on equipment that requires composite cables, it's time for a new TV before you consider a streaming device).So I'm whipping out FOUR STARS for the Roku Streaming Stick for HDMI. This would have been a five-star review if the Streaming Stick supported IR remotes, but I understand the small size probably makes that unlikely. Still, it's a loss that cripples the device slightly and makes it fall just short of being the best Roku device so far. Currently, that status remains with the Roku 3, but considering price, the Roku Streaming Stick is a good buy for the money for most people.For those who do have older equipment, heat concerns, universal remotes, or who just don't need YouTube, the Roku 1 remains an excellent value, too. You really can't go wrong with either one.", "verified": false, "helpfulness": "1/073", "author": "Raven Wilder"}]