[{"rating": 2.0, "review": "I have been using this for about a week and got disappointed by its performance.Most of the time remote does not work, it's simply stuck and only wait to work it again it to reset it battery.Screen mirroring does not work with my Samsung Note4 Edge, even support person were not able to solve this issue, even Moto G does not work.Recently started facing an issue with Youtube app on Roku, its keep on loading and after few minutes it gets started( may be Stick is not much good at Hardware).", "verified": true, "helpfulness": "1/1", "author": "Jay Ram"}, {"rating": 5.0, "review": "Just perfect. Easy to use and reliable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Not a good ideas to sit it behind the TV,  poor signal.", "verified": true, "helpfulness": "1/1", "author": "Sabrina King"}, {"rating": 3.0, "review": "Roku make fantastic products in general, but the stick is the least of the bunch.  I have 2 different Roku devices, and every time I use the stick I regret the choice I made for form over function.  Laggy interface, poor wifi connection, unresponsive remote... do yourself a favor and skip the stick, go for the Roku 2 or 3.  I'll be replacing mine ASAP.", "verified": false, "helpfulness": "0/0", "author": "Dawn M"}, {"rating": 4.0, "review": "This is the second one I've purchased, one for me, one for my elderly grandmother. I use it as a means of controlling several web based subscriptions. I love the fact that it has a remote.  I knocked a star however because it freezes a bit more than I'd like.", "verified": true, "helpfulness": "0/0", "author": "Ohio_gal"}, {"rating": 3.0, "review": "So, Anyone know where the On/Off button is? Everything is set up. I gave it 3 stars cause of no On/Off Switch and it's CC requirement for set up. It works fine, plays our Netflix. But, Can't turn off, even when switch back to TV, the light on Remote is on, Good way to kill batteries. So, took one battery out to save it's life. Roku did the On/Off button on remote never crossed your mind?", "verified": true, "helpfulness": "0/0", "author": "Joy"}, {"rating": 1.0, "review": "Works fine on amazon prime but won't load Netflix.  It gets stuck on the red start screen .  I have had it for about a year and have tried updating it.  Still won't load Netflix.", "verified": true, "helpfulness": "2/2", "author": "Masublime"}, {"rating": 4.0, "review": "This item can use in Singapore? Cos I have buy 1 of  item not Roku, last year, I can't use in Singapore only at USA.", "verified": false, "helpfulness": "0/0", "author": "Kamal"}, {"rating": 5.0, "review": "Love this!! While it took some getting used to, I'm finally moving away from comcast's ridiculous cable prices, which is awesome. I found paying for netflix/hulu/sling to be much cheaper than cable, with more quality options (thank you BBC!). There are only a couple of channels I miss from cable, and there are so many other options on roku that it's worth a try, especially with all of the streaming services popping up lately. Perfect way to cut the comcast cord!!", "verified": true, "helpfulness": "0/0", "author": "Elle \"Elle\""}, {"rating": 5.0, "review": "I have the Roku box, but the stick is better because you do not see it.  If you are looking for the no wire look this is the product for you.  I use it on my television in the living room with the TWC app and it works great.  Going to take it with me on an upcoming trip and I will see how well it performs.  I love Apple TV, but it does not have TWC app Roku does.", "verified": true, "helpfulness": "0/0", "author": "Franklin Case"}]