[{"rating": 5.0, "review": "Has worked excellent once I got it set up. I had the hardest time, ended up having to call my internet service provider to have them change some settings.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Durkee"}, {"rating": 2.0, "review": "Didn't work to well with my tv :(", "verified": true, "helpfulness": "0/0", "author": "yvelma nunez"}, {"rating": 5.0, "review": "Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Jason B Newel"}, {"rating": 5.0, "review": "AWESOME!  Works way better than the Firestick and much easier to use.  Easy install and super easy remote to use.  I love ROKU!", "verified": true, "helpfulness": "1/1", "author": "Mary Jean Skov \"Raven Star\""}, {"rating": 5.0, "review": "Works good.. once I got it set up.... suggest not using TV usb as power source.. will cause setup/connection problems.... had no luck completing the install/set up with usb cable connected to the TV ....  after changing power source from TV to AC adapter.. zipped right thru the install with no problems...", "verified": true, "helpfulness": "1/1", "author": "J. Lipham"}, {"rating": 1.0, "review": "The negative reviews about the Roku streaming stick were very true, I should have listened after reading them. This device was very disappointing. Extreme freeze ups and over heating. I will be returning the stick back and would never recommend  this item to anyone. The Roku 3 worked flawlessly and is the way to go. I will purchase another Roku 3 in the near future. Roku, 'Please' send the stick back too the Lab for further development.", "verified": true, "helpfulness": "0/0", "author": "rhino-22"}, {"rating": 5.0, "review": "Use it all the time. I liked the channels it had over google version. Family uses it a lot when renting movies...we don't go out for red box anymore. Probably use only 5 channels but it has tons of them. Someone could potentially not have cable service and use it just fine.", "verified": true, "helpfulness": "0/0", "author": "J. Buck"}, {"rating": 5.0, "review": "The absolute best device I have ever had. opened up a new world of television viewing.", "verified": true, "helpfulness": "0/0", "author": "Ronald A. Ortiz"}, {"rating": 5.0, "review": "Works as advertised. Using it primarily for SlingTV", "verified": true, "helpfulness": "0/0", "author": "D. Nash"}, {"rating": 5.0, "review": "Like it better than my Roku streaming box! It doesn't take up space and its discreet!", "verified": true, "helpfulness": "1/1", "author": "JusJudy"}]