[{"rating": 5.0, "review": "I had doubts about something so small replacing my first gen Roku, but it's better in pretty much every way. I don't mind the 90 second startup (using the usb for power), as it's a fair tradeoff for not having any wires hanging down.", "verified": true, "helpfulness": "0/0", "author": "Raymond Robinson"}, {"rating": 5.0, "review": "GREAT", "verified": true, "helpfulness": "0/0", "author": "Cameron L Williams"}, {"rating": 3.0, "review": "The Roku Stick was easy to install and set up, but it doesn't seem to be able to pick up on the wi-fi signal very well, even though it is only a couple rooms away. Our Roku 2 is about the same distance and rarely has connection issues. Going to pick up a wi-fi range extender to see if that helps.", "verified": true, "helpfulness": "0/0", "author": "D.G. \"Mangy Cat\""}, {"rating": 1.0, "review": "I was very excited to receive this Roku Streaming stick. Plug it in to the TV and power source linked the wifi and an hour later the remote quit working. I replaced the remote with new batteries and still wouldn't work. I had to hit the remote several times and it somewhat worked. I even tried resetting the Roku Streaming stick. No luck I was disappointed not even the Roku app remote would work with this. I was on hold with Customer service for 30 minutes before giving up. I'm returning it.", "verified": true, "helpfulness": "5/5", "author": "Elsa Loaiza"}, {"rating": 5.0, "review": "I love to buy products at the best deal possible as smart customer! First off this supposed to be refurbished but you can't tell it other than a brown outer box but the original Roku box inside. It came with the newer remote with the Vudu button rather than the blockbuster button (who uses blockbuster anyway). It comes with a 90 day Roku warranty, but I added a two year Square Trade for only $4.62 with a 25% off coupon I get all the time!Now on to the Roku streaming stick review: I read the extremely long extensive reviews offered by some reviewers, one person who had a chrome cast, Roku 2 and 3 and the streaming stick. I quess he must either have slow internet or not the best tv to use with it. I have tried Apple TV , chrome cast but not the stand alone Roku 1,2 or 3. I consider myself a pretty smart electronic nut! First off I like the streaming stick because of its portability, ie; change from room to room, take to friends/ family house to use with out bulky equipment.Now as for the responsiveness of the Roku streaming stick, I find it Extremely responsive, without any lag what so ever! Now I do use the supplied ac adaptor to plug in to the stick for the best power. Now chances are most people have to plug there TV into a outlet so it's not a stretch to find another ac port easily enough to plug the USB adapter into a ac outlet. This assures your Roku streaming stick the proper voltage to run the product. Yes you can use a USB port on your newer TV if you want but it may not provide the proper voltage.As for the setup process: Extremely easy! Plug the stick into a available HDMI port, attach the supplied micro USB ac/USB adaptor into the stick, plug it in to USB port on TV or better use the supplied AC adaptor to a electrical outlet. Turn your tv on, use your TV remote to use the proper HDMI port your streaming stick is attached to and Roku starts automatically! It will take up to about a minute or 2 to initialize and then it will take you to the connect to wifi page automatically. Now Roku comes with a nifty remote with dedicated Netflix, Amazon, Blockbuster/Vudu button depending on which remote you get, and M-go button.  Find your wifi SSID (Roku uses 2.4 or 5 g signals, a great option). I used my 5g as it is usually less crowded than 2.4. (Note you must have a newer wifi router with dual band capabilities to do this). Now Roku will check for new updated software and install it, then you will need to create a Roku account with a debit or CC so you can purchase paid apps or subscription content. I find this ok because if you want to subscribe to Netflix, Hulu plus etc. it uses that info by default without having to manually enter the info each time. Now Roku will require you to go online to activate certain subscription channels with a activation code for each channel! This is to keep track of how many accounts you have on different devices and your security!Once you do this it remains as default information on the Roku stick, so you only have to do this process once for each device you want to activate.I am using a great Vizio TV and extremely fast Cox internet with a good dual band wifi router with 100 mbs download capacity.Now the Fun begins: you can use your android, Apple, PC smart phone, tablet, to download the Roku app, which has Roku App Store, a remote feature from your device, and a lot of cool features from Roku! The biggest advantage of Roku over other brands of similar devices is the enormous amount of free/paid content Roku has! It's very easy to just add content from the Roku App Store or on your TV using the Roku device!How well it works: I watched all 13 episodes of House of Cards on Netflix with extremely fast load time, pause play, rewind/forward was extremely fast and without any lag what so ever. I loaded the HBO Go app and watched many different shows with the same response!My final conclusion: I love my Roku streaming stick, it has enormous amounts of content, very easy to set up and use, very fast and responsive, small footprint, and if your HDMI port is awkwardly positioned you can contact Roku and the will send you a HDMI extension cable at no charge!", "verified": true, "helpfulness": "1/1", "author": "Tonyzany \"tonyzany\""}, {"rating": 4.0, "review": "Remote tends to freeze up but removing and replacing battery works until it does it again.", "verified": true, "helpfulness": "0/1", "author": "JK, TN"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "E Timmerman"}, {"rating": 5.0, "review": "I rather have Roku then a smart TV. This is my second one for a new un-smart TV. Just remember that everything on Roku is not free because if you make a mistake and have to call customer service, they will put you through hell. Other then that it is a very nice device.", "verified": true, "helpfulness": "0/0", "author": "jack schweitzer"}, {"rating": 1.0, "review": "I purchased Roku Streaming Stick. I was suspicious from the beginning because the box was not properly sealed and there were batteries (dead) in the remote. Once I put new batteries in, the remote was glitchy but it seemed to work. I accessed the Netflix app but did not need to log in, because it logged me into someone else's account (obviously the previous owner of the Roku stick). Then it locked up and would not work again. While I have been offered a full refund, it is unacceptable to me that Amazon / Roku would sell me a returned or reconditioned electronic item as new. In addition, they didn't inspect the returned item (which was not functioning correctly) or replace the dead batteries. What is worse is they did not delete the previous owner's personal information! I sent her an e-mail warning her of the situation and advising her to change her Netflix login at the very least...", "verified": true, "helpfulness": "1/1", "author": "charles morgan"}, {"rating": 2.0, "review": "i have a bunch of streaming options, roku 1-3 and the stick, Apple TV, chromecast, fire stick.... You get it. I like Roku's product the best. Specifically the roku 3. If you have nothing to compare the stick to, you'll probably love it. If you have a roku 2-3, especially the just released versions that are faster, then you will regret this purchase. Spend the extra money on the newest roku 2 or 3.... It's not much more and the performance is a lot better. The stick feels like old and slow technology when you have used the their boxes.", "verified": false, "helpfulness": "0/0", "author": "Jerry"}]