[{"rating": 5.0, "review": "I'm giving away my Chromecast because of this product.  I've now bought three of these, and all three of my HDTVs will have one.  Two of these TVs are Smart TVs, but the choice of apps are limited (One is Vizio -- good, and one is Samsung -- better).  It's a little bit frustrating to realize that I could have saved a lot of money by buying streaming sticks instead of paying extra for Smart TVs, but that's the way the bytes crumble, I guess.  There are a number of channels that Roku has that I love to watch, where I was only using Netflix before.  Warner Archive and Acorn TV are my two favorite channels, and well worth the small subscription fees.The only slight negative is that the streaming stick is a tiny bit slow to start up, but that's minor.", "verified": true, "helpfulness": "0/1", "author": "Daniel L Comstock"}, {"rating": 5.0, "review": "love my roku stick. Love the fact that the stick is so small... not another box alongside my tv. My only complaint is not the fault of my roku, but Comcast cable.  Many cable based roku channels such as hbo go and the history channel require one to register their cable company name.  My provider, Comcast, has no agreement with roku, so I cannot stream those channels with my roku.  a disappointment.  for Netflix and other channels that I enjoy, I could not be happier with the performance of the roku stick.", "verified": true, "helpfulness": "0/0", "author": "mary j cook"}, {"rating": 5.0, "review": "So many choices and great video quality! I found out quite by accident that YouTube videos viewed on my Nexus 7 tablet can be cast to an HDMI TV through the Roku, very cool to see to see my own videos in full HD on my big screen TV. I particularly like the Roku search. Look for a show by name, actor, etc., and it shows where it is available. So far it has never come up empty. One of  the many, many channels available is Pandora. I was aware that it has been around for a long time, but had never tried it out. Now it is one of my favorites. I find it far superior to the Music Choice channels from the cable provider.The only negative is that it is necessary to juggle 3 remotes to switch among Roku and the other TV inputs, partly because there is no volume control on the Roku remote. My guess is that capability would increase the price significantly.", "verified": true, "helpfulness": "0/0", "author": "Gerald S. Fuller"}, {"rating": 5.0, "review": "This is the best Roku we have purchased so far. We have a couple older models and they still work perfectly, just wanted another one for a different TV cause we love being able to stream shows and movies. I would definitely recommend this if you have a newer TV with an HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Kenda"}, {"rating": 4.0, "review": "This unit works as described but can be a little slow to initially start an app.  But once the app is up running everything is snappy and good.I do hate comcast for not allowing HBO Go on the Roku platform.", "verified": true, "helpfulness": "1/1", "author": "craig hartmann"}, {"rating": 3.0, "review": "It takes forever for the roku to start-up. I am fed up with the jumping roku letters. Once it is up, it works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We actually just started using our Roku stick yesterday.  We absolutely LOVE everything that it can do.. So many more options than just having cable!!!!!  Would highly recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "StaceyL"}, {"rating": 5.0, "review": "I bought a open box LCD TV at a good deal here on Amazon.  It was going to be at least $100 extra to go to a model that was a Smart TV that had no other features to justify the extra cost.  This was $50 and works better than my Samsung smart TV which just has a awkward user interface, seems to stream just as good if not better, and has more \"apps\".  It's quite small too.", "verified": true, "helpfulness": "0/0", "author": "Poppies_rule"}, {"rating": 5.0, "review": "Ditch your cable subscription the roku streaming stick is gonna take over. It has instantly become the multimedia centrepiece of our home, with PLEX, netflix, and spotify working with no problems.Bought this in the US and using it with no problems in Ireland.", "verified": true, "helpfulness": "0/0", "author": "John O'Rourke"}, {"rating": 5.0, "review": "I have been very pleased with this item. Easy to install and gets amazon which many streaming devices do not. Gets everything that the Rocky boxes get.", "verified": true, "helpfulness": "0/0", "author": "W. C. Salleng"}]