[{"rating": 5.0, "review": "enjoy the Roku very much it works great", "verified": true, "helpfulness": "1/1", "author": "charles miller"}, {"rating": 1.0, "review": "Before I purchased this device I checked the Roku website to verify I wouldn't have to use a credit card for anything else regarding usage of this device. I only purchased this device to watch Amazon Prime to which I subscribe. Much to my dismay, to activate the thing you have to open a Roku Account and provide them with a credit card or PayPal account. Having been the victim of identity theft from my information being held on insecure websites, I absolutely hate this hustle by Roku. Now I have to watch my credit card activity even more.I think I'm going to return the thing and either pick another device that enables me to use my Amazon Prime without a 2nd party requiring access to my credit card.I wish they would have openly stated this on their website. I wouldn't have ordered it. But maybe that's the reason they don't clearly publish it.Garbage!!!", "verified": true, "helpfulness": "1/4", "author": "John Ohio"}, {"rating": 3.0, "review": "Remote is horrible (must use cell phone app which is much better).  The Roku itself is great.I returned it due to the remote, but the 2nd one was the same.", "verified": true, "helpfulness": "0/0", "author": "Allen"}, {"rating": 4.0, "review": "perfect for my needs", "verified": true, "helpfulness": "0/0", "author": "N. woodard"}, {"rating": 1.0, "review": "WiFi reception is poor to the point of being unusable in the room next to my router. The interface is horribly laggy. The Roku 3 is 100x better. Not really sure why Roku even released this.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Austin"}, {"rating": 4.0, "review": "We recommend Roku! It's a must have and portable too.", "verified": true, "helpfulness": "0/0", "author": "ConativeMe"}, {"rating": 1.0, "review": "Very disappointed. I bought two of these due to the size and convenance. Worked fine until my old one, had three ROKU total, went out of warranty. When I had a problem connecting with the old one all three were affected. Call ROKU to get help and was told I needed to pruchase an extened warranty are pay 9.99 each time I call in for custmer service.I went ahead and got them going and less than three weeks later I had the same issue. Threw the old one away thinking that would solve my issue. It did not so all of them have gone in the trash. I will not be held hostage by a product that is supposed to be one upfront cost with on subscription fee. I will find another way to watch Netflixs and Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "T. Jones"}, {"rating": 5.0, "review": "Product delivered as promised!", "verified": true, "helpfulness": "0/0", "author": "Scott Ng"}, {"rating": 5.0, "review": "Great product. Milan on purchasing one for each television in my home.", "verified": true, "helpfulness": "0/0", "author": "Jocelyn D. Briddell \"Tallorder\""}, {"rating": 5.0, "review": "Does everything I need it too. Would recommend it to anyone looking for a streaming device.", "verified": true, "helpfulness": "0/1", "author": "Shane"}]