[{"rating": 5.0, "review": "We have had a ROKU 1 foe 5 years and it has been great. Got this for our new TV and love it even more. The fact that it is fully hidden is great. We even took it with us on a family trip.", "verified": true, "helpfulness": "0/0", "author": "Janelle Kelly"}, {"rating": 5.0, "review": "Works great. Use it for jw.org", "verified": true, "helpfulness": "1/1", "author": "richard n"}, {"rating": 5.0, "review": "I have an older Roku box and wanted something I could travel with.  This fit the bill perfectly.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Seems out of range of upstairs computer", "verified": true, "helpfulness": "0/0", "author": "Janet V. Delneo"}, {"rating": 5.0, "review": "Great gadget!!  Love it.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "I am a big fan of the Roku products. This one has worked well. I bought it for its small size and ability to use during travel.", "verified": true, "helpfulness": "0/0", "author": "David B"}, {"rating": 1.0, "review": "I returned it to Amazon.  Unlike the first Roku I purchased I was unable to get this one to connect to my LAN in spite of talking to Roku support and following tips provided online.  No product meant for average consumers should involve finding \"secret screens\" and \"disabling pings.\"  Ridiculous.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to use. Compact and out of the way.", "verified": true, "helpfulness": "0/0", "author": "CHERYN KRAEMER"}, {"rating": 5.0, "review": "This is one of the best things ever, I will save money while still being able to watch my favorite shows, recommended most definitely", "verified": true, "helpfulness": "0/0", "author": "Hammy82"}, {"rating": 4.0, "review": "Like new. Product works well, navigation is much better than my cable or smart TV but I am not ready to cut the cord yet. As always, excellent price and delivery from Prime!", "verified": true, "helpfulness": "0/0", "author": "Annette Bain"}]