[{"rating": 5.0, "review": "Provides all the necessary features of the other Roku devices but, as noted in other reviews, it is noticeably slower than my Roku 3.  Still, a good choice if you are taking it on the road with you.", "verified": true, "helpfulness": "0/0", "author": "J. Grove"}, {"rating": 1.0, "review": "I bought this product at Christmas. We had the roku and roku 2 so we bought the stick to take up less space and not have wires hanging. The stick will not connect to the Internet often. Every time it disconnects the remote disconnects too. Customer service mailed us a new stick and new remote but we still cannot get it to work. Internet company came out and said it's the roku stick not the Internet. The roku and roku 2 still work fine. The roku stick is garbage and now that my warranty is out for a product that never worked I will be throwing it away. I will find another company to stream my movies and shows through.", "verified": false, "helpfulness": "0/0", "author": "Grover"}, {"rating": 5.0, "review": "Great Product at a Great Price!!!", "verified": true, "helpfulness": "0/0", "author": "Dennis Surucu"}, {"rating": 1.0, "review": "I love Roku and have several devices including one other Roku stick.  All work fine except this one.  The remote depletes the batteries in about a week or two even if not in use at all.  So clearly the remote is defective.  Equally clearly, Roku technical support is in India and they can only read prepared solutions for known problems.  I have spent more time discussing this and emailing them.  Its a 40 dollar device so if you have a problem my suggestion is to put it in the land fill and buy another and spare yourself the agony of Roku customer support.I wanted to give an update to this.  This really is one of the worst products every made.  I think it is pushing me to Apple TV or some other device because I simply do not trust Roku at all after the mess they have made with this.", "verified": true, "helpfulness": "0/0", "author": "R. Tilton \"rstde\""}, {"rating": 4.0, "review": "Love my Roku 3500R streaming stick! Upgraded my old Roku and I'm not sorry. Had trouble with HBO-Go. Picture but no sound. Working great now.  My Netflix Amazon and other channels I've added working just fine. Enjoying watching YouTube  on my big screen tv and not just on my iPad. Its GREAT. Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Frances Brown \"gitty nitty\""}, {"rating": 5.0, "review": "For such a small litte USB stick that goes in back of your TV, this product works great!", "verified": true, "helpfulness": "0/0", "author": "Victor Garcia"}, {"rating": 1.0, "review": "The remote just stops working for no reason and the Roku app caused errors on my tablet. I have been using roku for several years and have NEVER had so many problems as I did with this streaming stick. Save your money for a version that isn't buggy.", "verified": false, "helpfulness": "0/0", "author": "Jennifer A. Pool"}, {"rating": 5.0, "review": "Quick shipping and love the Roku.  I have four of them, gave two as gifts and everyone as my self love this product.  A must to have!", "verified": true, "helpfulness": "0/0", "author": "Markuz Velasquez"}, {"rating": 1.0, "review": "Requires a payment method before getting started", "verified": false, "helpfulness": "0/0", "author": "Luke"}, {"rating": 5.0, "review": "This replaced my old Roku, which could no longer find my Wi-Fi connection for some reason. Love not having one more thing sitting on my counter. This little gadget plugs into the back of my TV, but still senses the remote signal just fine. Have run into some minor glitches (the Purple Screen of Death, for one) but a simple unplug & replug of the TV fixed that. And any weirdness on the Roku end is easily fixed by powering off & back on again. Love that it's simple, love that it works. Love, love, love.", "verified": true, "helpfulness": "0/0", "author": "Pseudonymous Bosch"}]