[{"rating": 4.0, "review": "I gave up my cable because it became so expensive. It took me time to get used to searching for programming rather than watching whatever was recorded or currently on some channel but now that I'm familiar with the various channels Roku offers: I love it and wouldn't go back to cable. PBS for Roku is the best. I watch is most. My reason for 4 stars is because although the Roku works great on my Panasonic TV, it doesn't work at all on my Sharp TV. The Sharp is actually two years newer but the Roku simply won't show a picture, even though it seems to sync, according to the blinking light. The information says you can take it traveling with you, use it in hotels, etc. but I'm not sure that would pan out since I can't get it to work on both my TVs in the house with solid internet connection. Still, that's minor and I'm happy with my purchase. I also purchased a multi-directional antenna so I can watch live TV. I recommend both.", "verified": true, "helpfulness": "0/0", "author": "ArferM"}, {"rating": 2.0, "review": "After a little fenageling (sp), i got the roku to connect to my wi-fi.  Of course certain channels offered wouldn't connect, i didn't explore this as i just assumed to had to pay for the channels, and i really didn't want to. I have a netflix account and really enjoy youtube, so no problem with the lack of choices.  The instructions are minimal, mainly i remember them saying something about not overheating the stick.  It doesn't say unplug after use or avoid long periods of use and why would something like this overheat anyway?  Well, it overheated and burned out shortly after the 90 day warranty was up, grrr. I really miss the convenience of roku, but why buy another if this is going to happen again?", "verified": false, "helpfulness": "1/1", "author": "lucille christensen"}, {"rating": 4.0, "review": "works good.", "verified": true, "helpfulness": "0/0", "author": "Christine Carrasco"}, {"rating": 4.0, "review": "best of its kind .. and the price point cant be beatonly flaw .. its always on ..  so if you leave it streaming say hulu.. it will just stream for hour or days on end unless you touch the home key", "verified": true, "helpfulness": "0/0", "author": "vegas massimo"}, {"rating": 5.0, "review": "Perfect n great price...thanks so much!", "verified": true, "helpfulness": "0/1", "author": "renee lea turner"}, {"rating": 5.0, "review": "Best Roku product yet!  Haven't dropped wireless network in the few months i've been using the thing.  Haven't had netflix buffering issues.  Haven't had weird stuttering issues from Plex (which I'd recommend looking into if you don't have it).  Worth every penny!", "verified": true, "helpfulness": "0/0", "author": "BBarnes"}, {"rating": 4.0, "review": "Woks great and I bought a second one for my daughter at college.", "verified": true, "helpfulness": "0/0", "author": "Jack Van Norstrand"}, {"rating": 4.0, "review": "Love the Roku streaming stick, but the remote is terrible and does not work much of the time. It seems to go into some sort of sleep mode after 10-20 minutes without use and there's no way to wake it up, even taking the batteries out. Download the app on your smartphone, it works much better.", "verified": true, "helpfulness": "0/0", "author": "Caitlin Chapman"}, {"rating": 5.0, "review": "I did a lot of research on this one. My main reason for getting this is it has the PLEX app. For those who don't know what that is, it gives you the ability to stream a movie you've downloaded on your computer, directly to the Roku device.Its small/compact. Plugs directly in to the HDMI port and local power. I am very impressed with the streaming. My wireless router is roughly 25 feet away and in another room and it streams perfectly with zero interruption. There are many video/tv apps to install, but a lot are subscription based.The only real negative thing I have to say is the interface is a little slow. So when trying to navigate through the menu, its a little laggy.I highly recommend this device over the other options out there, especially for the price.", "verified": true, "helpfulness": "0/0", "author": "ryan illsley"}, {"rating": 5.0, "review": "Great item. Does exactly what we wanted.", "verified": true, "helpfulness": "0/0", "author": "Nathan Smith"}]