[{"rating": 4.0, "review": "This works great! However, the HDMI spot on my TV is recessed, so the stick wouldn't fit in there. I had to go on the ROKU website and request an adapter so that it would fit - which means the stick hangs out from my TV and is kind of an eyesore. But at least it works now, which is what matters! And they send the adapter for free! Definitely check the back of your TV before you go with the streaming stick instead of the regular ROKU, though.", "verified": true, "helpfulness": "0/0", "author": "C. Walker \"atiecay\""}, {"rating": 1.0, "review": "Just wanted to say, I had the Roku 1 and never had an issue with it.  I gave it away and truly missed it.  I saw the streaming stick and thought what a wonderful idea and I saw the usb cable for powering the stick and thought this was great.  I bought both.  The set up was super easy and I was on my way to enjoying my Netflix and Amazon videos.  The streaming stick work beautifully for 2 weeks and then 1 morning I turned it on and it side no signal.  I tried everything possible and then looked on line to see if there were others that have the same problem.  I saw numerous reviews reporting the same issues with no solution for solving this problem.  All reviews said that it will not work again.  I did hit the reset button and it did work for about 10 mins.  Since that I was not able to make it work again.  I wish the reviews on Amazon said that.  Every product I buy from Amazon, I always read the reviews first and when I read the reviews for this, I did not see any remarks about this issue.  I am very disappointed!", "verified": true, "helpfulness": "0/0", "author": "F. Y. Chan"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "olubukola akindeinde"}, {"rating": 4.0, "review": "It works as advertised. I have had no problems with it. I would have given it 5 stars, but the menus are a bit slow. No complaints though. It was only about 40.00.", "verified": true, "helpfulness": "0/0", "author": "Robert Burks"}, {"rating": 3.0, "review": "The streaming is SLOW to catch up.  Constant interruptions,  I may just very another Roku box.", "verified": true, "helpfulness": "0/0", "author": "Aleshia Mercatante"}, {"rating": 2.0, "review": "I was told I could streamline movies from my PC to my TV. I could not  do this therefore I am not satisfied with the product", "verified": true, "helpfulness": "0/0", "author": "DONALD J NEWMAN"}, {"rating": 1.0, "review": "We had to return this product.  After hours of support from Roku and our internet provider it was clear this just didn't work.", "verified": true, "helpfulness": "0/0", "author": "Amy Newton"}, {"rating": 3.0, "review": "We have three Roku players in our house. The stick is my least favorite. Hard to aim the remote when it's plugged into a TV HDMI port. Better to buy the box.", "verified": true, "helpfulness": "0/0", "author": "MBL"}, {"rating": 5.0, "review": "Arrived earlier than expected, Product works perfectly. Packaging was perfect for the size of product . certainly recommend this to other people", "verified": true, "helpfulness": "0/0", "author": "Maurice Miller"}, {"rating": 2.0, "review": "Doesn't always connect.", "verified": true, "helpfulness": "0/0", "author": "Haden \"blond amazon\""}]