[{"rating": 5.0, "review": "love it, I would recommend it", "verified": true, "helpfulness": "0/0", "author": "Doug moore"}, {"rating": 5.0, "review": "Outstanding streaming device.  It works perfectly and loads programs in a few seconds.  My old device took minutes and when I paused it, it was difficult to start it again.  Roku works incredibly well all the time!", "verified": true, "helpfulness": "0/0", "author": "RB Carlin"}, {"rating": 5.0, "review": "This extends the channel availability in the second TV that is hanging on the wall. We have a Roku box for the other TV that is on a counter. Roku is a good product, would recommend it.", "verified": true, "helpfulness": "0/0", "author": "lyndarva"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Shotty equipment.  Lasted about 1 month then roku hdmi stops responding.  Thought it was batteries in remote, so I replaced them with new ones and still no response.  Tried to connect with tablet and keep getting an error telling me to pkug in roku, which it already is.  Regains connection for about a minute then remote wont pick up roku again. WTF?!?!", "verified": true, "helpfulness": "0/0", "author": "gsoliz"}, {"rating": 4.0, "review": "Great product, wish it was as slick as Fire TV, but it has everything you could want", "verified": true, "helpfulness": "0/0", "author": "Randy Houck"}, {"rating": 5.0, "review": "II already had the Roku boxes.So I thought I'd try the new Roku stick. I really like this Roku stick. Works great with less clutter.", "verified": true, "helpfulness": "0/0", "author": "S. Griffith"}, {"rating": 5.0, "review": "Roku is awesome.", "verified": true, "helpfulness": "0/0", "author": "James Brown"}, {"rating": 3.0, "review": "I don't know if it was because this was a refurbished unit, or the location of the HDMI port on my tv, but I could not get a good connection with the stick.  We already have three other Roku box units and with the newest tv addition in our kitchen I thought this would be perfect. I did return it and got a Roku 1 which works perfectly connected through the composite (R Y W) cable.  The streaming stick arrived as promised was in perfect packaging, just didn't work for me.", "verified": true, "helpfulness": "0/0", "author": "BP Acres"}, {"rating": 5.0, "review": "I love that we don't have to pay for cable.", "verified": true, "helpfulness": "0/0", "author": "Jim Store"}]