[{"rating": 4.0, "review": "Bought it instead of Chromecast beacuse it supports Prime Instant Video. A little more than a Chromecast, but that alone was worth it. Also having a remote is a big plus. It supports dual band internet so streaming speed is never a problem.", "verified": true, "helpfulness": "0/0", "author": "heyitsmike"}, {"rating": 4.0, "review": "Pretty cool.  Works as advertised.  Powered by USB port on TV - no wall wart necessary.  Only problem I see is that it takes a little more time to boot up than one would like.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I had one of the original Roku players, and the difference in processing speed and picture quality with this one is incredible. The interface is very clean and much better designed than the app screen on most blu-ray players.", "verified": true, "helpfulness": "0/0", "author": "CW_Indy"}, {"rating": 1.0, "review": "This product, the 7th Roku I have installed over the past 5 years or so, was incredibly disappointing. I should have paid more attention to the negative reviews and the experiences related elsewhere online. If it were just defective, that would be one thing. But the way in which it failed  resembled so many others' experiences, I have to think it is a design defect. The stick would fail to make a connection with the WiFi, or it would do that, but fail to get an internet connection, or do that and fail to do the next step (able to get to addresses?), or it would get that far and then fail to contact Roku.com... I tried all the of the suggestions on the web (e.g. turn off ping, reset Roku, reboot router), but no help. Bought a Roku 2 from Amazon for next day delivery, hooked it into the same system, and it came up instantly, did a firmware update, connected to the mother ship, etc. etc. No problem, as always before. Worse still, the box it came in had little tears around where the round cellophane \"this has been opened\" sticker goes to close the box. So the box was opened before, and then closed by someone (Roku? Amazon?) before being shipped. One can only imagine the cause. Ugh.", "verified": true, "helpfulness": "0/0", "author": "Josh Fisher"}, {"rating": 5.0, "review": "Binge watching is my new hobby. Thanks Roku.", "verified": true, "helpfulness": "0/0", "author": "Kimmie1977"}, {"rating": 5.0, "review": "LOVE! Super fast shipping, great price!", "verified": true, "helpfulness": "0/0", "author": "Ashley Hawkins"}, {"rating": 3.0, "review": "Having trouble understanding how to fully use the free issues.", "verified": true, "helpfulness": "0/0", "author": "D.M. Steinmetz"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "C. Slayton"}, {"rating": 5.0, "review": "So many apps to choose from. Works great.", "verified": true, "helpfulness": "0/0", "author": "katie"}, {"rating": 5.0, "review": "Great for streaming Netflix etc. Love how small it is and how it fits behind my TV. Would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Amelia Corwin"}]