[{"rating": 5.0, "review": "Same as brand new.  Works perfectly and could not be more pleased with condition and appearance.", "verified": true, "helpfulness": "0/0", "author": "Arndfan"}, {"rating": 5.0, "review": "Great streaming device for the money. Loads pretty fast.  The software is setup so that its easy to follow and pick your channels or apps. Cool for a gift.", "verified": true, "helpfulness": "0/0", "author": "Jor El"}, {"rating": 5.0, "review": "I bought to watch my mlb package and it works great. Hd streaming picture, looks very nice, simple to use.", "verified": true, "helpfulness": "0/0", "author": "manager"}, {"rating": 3.0, "review": "Product died after 1 year had to buy a new one which was annoying.", "verified": true, "helpfulness": "1/1", "author": "Kristen G."}, {"rating": 4.0, "review": "Good device in watching netflix.", "verified": true, "helpfulness": "0/0", "author": "Carlo"}, {"rating": 4.0, "review": "Only thing I wish was different is that the shortcut buttons we programmable. Otherwise works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Christopher Larson"}, {"rating": 2.0, "review": "It would not work on my PC.  Roku was not helpful about trying to make it work. I would have had to give them my credit card number in order for the stick to work.  I did not like the idea", "verified": true, "helpfulness": "0/0", "author": "Donald H Leo"}, {"rating": 5.0, "review": "I first bought the Roku 3 and really enjoyed it. I thought I might like to stream in my bedroom so I bought the Amazon Fire stick. After dealing with the Roku, I just have to say I was really let down with the Fire stick. The interface I have found works so much better with the Roku and I didn't really like the Firestick's remote either. so I put the firestick in my office and I bought the Roku stick. I wasn't in to gaming anyway so it has all the features that I use with the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Richard K Laue"}, {"rating": 4.0, "review": "I gave it as a gift for my mother.... She hasn't watched regular T.V. since. She loves it.", "verified": true, "helpfulness": "0/0", "author": "Lynn Walters"}, {"rating": 5.0, "review": "Easy set up, I bought two and I love them", "verified": true, "helpfulness": "0/0", "author": "Micala"}]