[{"rating": 4.0, "review": "I'm a Netflix subscriber and my husband doesn't like to watch my choice of movies and TV shows.  I connect my Roku to a TV during the time he's watching his choice of programs and off I go!  I would prefer more a few more buttons on the remote to make my selections a little easier to obtain.  The streaming is difficult at times, I assume that too many people are trying to watch Netflix at the same time and the bandwidth is not enough and not the fault of Roku.  I could be wrong!  Other than that, I love having the ability to chose which TV I want to view my movies on.  I think I have the simplest version and there are probably other versions that are either better and more user friendly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"linda.g.t.\""}, {"rating": 5.0, "review": "Cute little travel stick. We have both amazon prime and netflix and wanted a device that streamed both for our frequent travels. I have the kindle fire tv which is very nice though glitchy sometimes. This roku is a bit more portable for me when I am dealing with luggage and kids and airplanes. It works exactly how I need it to and I've not had any trouble with it at all. It is definitely not as easy to use as the fire tv or as flexible but it is perfect if you travel and have both Netflix and amazon prime.", "verified": true, "helpfulness": "0/0", "author": "A Nonymous"}, {"rating": 5.0, "review": "This is my third Roku and now have it on all my TV's.  The Stick is more convenient to use since it is behind the tv and out of site.  Works very well and Roku continues to add channels..........more than I could watch in a lifetime.  But Roku has something on for everybody.  Truly amazing.", "verified": true, "helpfulness": "0/0", "author": "M. Richards"}, {"rating": 5.0, "review": "Better than expected. Easy to hook up and set up. Love it.", "verified": true, "helpfulness": "0/0", "author": "Frank M. Rydzinski"}, {"rating": 1.0, "review": "This device is very glitchy.  It keeps losing the internet. Getting thru to customer service is darn near impossible. When it does connect, it takes forever to load.  The more tech savvy might be able to figure it out but I'm returning it.  It's more trouble than its worth.", "verified": false, "helpfulness": "0/1", "author": "Elmtree01"}, {"rating": 5.0, "review": "Works great. Just need patience to program it.", "verified": true, "helpfulness": "0/0", "author": "Mema"}, {"rating": 5.0, "review": "easy installation, great choice of sites for viewing.", "verified": true, "helpfulness": "0/0", "author": "pcguy"}, {"rating": 1.0, "review": "If you're a sports fan, this product is not for you. Roku advertises \"1000+ channels\" but it does not include the local channels that most football games are aired on and you still have to purchase a subscription to channels like HBOGO and WatchESPN. Waste of money. You're better off getting a BluRay player that has these apps on it.", "verified": true, "helpfulness": "0/4", "author": "KB"}, {"rating": 5.0, "review": "Great product, I upgraded from a roku box that was a real early version and so far it looks like I am going to ditch the earlier version. I love it Roku!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Gaines"}, {"rating": 1.0, "review": "worked for a week then quit called roku got working. worked 2 weeks called again . worked 4 days tried on 2 other tvs they seemed not to want to replace think its the remote Netflix will come up but can't go further. paired to the device 5-6 times . no good. Have a roku xd which died after a few years that worked with no problems. going to send back to amazon and buy a xd unit.", "verified": true, "helpfulness": "0/0", "author": "old man \"old man\""}]