[{"rating": 4.0, "review": "This item was a good price.  Ruko works great streaming Netflix.  The only down fall is the lack of live streaming local or national TV Channels.", "verified": true, "helpfulness": "0/1", "author": "johns115"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "jebbe"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "Pamela Hobbs Glackmeyer"}, {"rating": 2.0, "review": "I agree with others who didn't like the remote... it was twitchy when ff'ing or paging thru the scenes... hard to control where you want to stop.  I have 2 other Rokus and this one may have very slightly improved the pic, but not enough to put up with the placement of the enter button below the scroll circle. Very aggravating.", "verified": true, "helpfulness": "0/0", "author": "Rose Anonymous"}, {"rating": 5.0, "review": "This works great!!!  It delivers my Prime videos right on my TV.  I love this. Much nicer than having to use my computer and the HDMI cord.  The remote is good, can change channels on Roku home easily.", "verified": true, "helpfulness": "0/0", "author": "Linda K. Lewis"}, {"rating": 1.0, "review": "It has no support in South America. Can’t watch Netflix, etc. 100% disappointed.", "verified": true, "helpfulness": "0/1", "author": "Jose Lucas Camara"}, {"rating": 4.0, "review": "The Streaming Stick is a good product, Definitely worth $40. If you have a little extra money, I would spring for the other Roku devices.Being only a small stick, it lacks the graphical horsepower to move through the menu with out stuttering. It works well. But I would like to see Roku make the device slightly more powerful.Pros:QuietEasy to UseUnnoticeableCheapCons:Not enough processing power to make scrolling through menu items look good.", "verified": true, "helpfulness": "0/0", "author": "Julian Zygmont"}, {"rating": 4.0, "review": "love the Roku; however one of the sticks was bad", "verified": false, "helpfulness": "0/0", "author": "Cindy. dorning"}, {"rating": 1.0, "review": "Before it broke: 3 stars.- The 45-60 second boot time was a little disappointing, as was the few second response time to remote control input.- App selection was good, although the lack of standard Hulu (not plus) was a little disappointing.- Video quality and video loading times from Netflix and Youtube were impressive.- Setup was simple, especially if you use the phone app for typing.- Had to re-enter my Netflix username once in the three months I owned it, which isn't that big of a deal.After it broke: 1 starIt stopped working after a few months of ownership; the boot screen would sit for a minute, the home screen would pop up, then it would time out. Very disappointed in the quality.", "verified": true, "helpfulness": "0/0", "author": "Roger"}, {"rating": 5.0, "review": "The Roku Streaming stick is all that it claims to be--we love Roku, our third purchase. Certified Refurbished is the way to go, no noticeable flaws whatsoever! I would recommend this product to all my family and friends. No game control, but that is not my in terest. GO ROKU!", "verified": true, "helpfulness": "0/0", "author": "ciccars"}]