[{"rating": 1.0, "review": "Quite simply, it works fine as long as you can connect to Wi-Fi. But the remote uses WI-FI Direct to connect (vs Bluetooth) and causes interference on my home Wi-Fi network, making every other Wi-Fi device connection unstable and causing them to drop frequently. Google \"roku Wi-Fi interference\" for now info. The company seems not to care. I'm hoping a lack of sales will change their minds.", "verified": false, "helpfulness": "0/0", "author": "D. Snedigar"}, {"rating": 5.0, "review": "AWESOME!", "verified": true, "helpfulness": "0/0", "author": "debra2013"}, {"rating": 1.0, "review": "Good Lord.  I ordered two of these Roku sticks.  One stopped working within a week of getting it, so I returned it and they replaced it for free.  The other one has lasted a grand total of 3 months (well, not quite.  October 29, 2014-January 24, 2015).  Not sure if they will replace it.  These sticks are used on two different TVs, and they each stopped working.  Just waiting for the other one to poop out on me.  If they don't replace the other one that broke, I'll be replacing it with an Amazon Fire Stick.  Hopefully those are worth damn.", "verified": true, "helpfulness": "0/0", "author": "Caeley"}, {"rating": 1.0, "review": "I really like the product, when it actually works.  I've had a lot of trouble with the remote cutting in and out.  It wouldn't be as much of an issue if I could actually connect the Roku to the app, but that doesn't work either.  After spending over 40 minutes speaking with customer service and having everything reset, the remote still will not work.  Incredibly disappointing considering I've only owned the product for one month.  Will be returning.", "verified": false, "helpfulness": "0/0", "author": "WyoMom"}, {"rating": 4.0, "review": "Came fast and works great. The power cable that came with it was faulty, but other than that, brilliant!", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 2.0, "review": "Remote does not work without taking off back and re inserting batteries...pain in butt.  Bought \"warranty\"...don't know if I will ever get satisfaction.", "verified": true, "helpfulness": "0/0", "author": "Deana Smith"}, {"rating": 1.0, "review": "i bought this Roku and can't used due to is only for USA and i live in Panama, I recommend to put something that explain that the product is only for the areas that should be working without problem to install ok or at least say no valid for other regions.", "verified": true, "helpfulness": "0/0", "author": "Antonio Manfredonio"}, {"rating": 5.0, "review": "Awesome, especially since it's plugged straight into the back of the TV.  So I don't have another box on my entertainment center.", "verified": true, "helpfulness": "0/0", "author": "Cunchitta"}, {"rating": 5.0, "review": "Works great easy to set up", "verified": true, "helpfulness": "0/0", "author": "Louis Belanger"}, {"rating": 5.0, "review": "Purchased as a gift for my son. He was very pleased with the stick and no longer has to hook his tablet to the television. He is able to get many apps.", "verified": true, "helpfulness": "0/0", "author": "Valerie Sims Turner \"Val\""}]