[{"rating": 4.0, "review": "This was so easy to set up and works well with my wall mounted television.  Doesn't loose connection to my WIFI which is down in the basement.  I would certainly by another one.  This is on my set in the bedroom and the light for the roku/power connection is quite bright.  I put a piece of tape over it.  Also my HDMI outputs are on the back of the set so  I have to be careful not to crush the roku when I adjust the viewing angle of the TV.  I have a small television.", "verified": true, "helpfulness": "0/0", "author": "Stephanie A. White"}, {"rating": 3.0, "review": "It works fine but not without compromise. Be better off buying the full Roku...3-25-2015 UpdateI still feel the same way, buy the full ROKU 3 and you will be rewarded as it's not that much more. Some of the compromise I get is that when I need to rewind or fast forward it's a hassle because it's like it needs to literally break the connection first then rewind or fast forward. That process takes about a full 5 sec or more. So the best thing to do is to press play and forget about it.4-12-2015I have to admit, most  of the movies I stream are in full 1080p. I played a movie that was in 720p and it worked just fine. So if anything above that will have to be compromised. The ROKU II that's been refreshed is probably a better buy with not nearly the trade off with the the STICK.", "verified": true, "helpfulness": "0/0", "author": "marofromcuse"}, {"rating": 4.0, "review": "Works great. No problem with refurbished product or packaging. Not as fast as my Roku 3, which is the only reason I don't give it 5 stars. But the speed isn't a deterrent.", "verified": true, "helpfulness": "0/0", "author": "EssyP"}, {"rating": 5.0, "review": "Amazing little gadget! I'll be ordering another one soon. Great price. Bye bye Comcast!", "verified": true, "helpfulness": "0/0", "author": "Robert Richard Jr"}, {"rating": 3.0, "review": "Love Roku, don't get the 'stick' though, it runs slower.", "verified": true, "helpfulness": "0/0", "author": "Her Name is Bert"}, {"rating": 5.0, "review": "I use this in my basement where I do not have cable.  I wasn't sure that my wi-fi would work down there, but works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Susan Spoto"}, {"rating": 4.0, "review": "It's ok.", "verified": true, "helpfulness": "0/0", "author": "Katrina Florence"}, {"rating": 5.0, "review": "I got this for my husband for Christmas!  He LOVES it!! He is able to watch his favorite college team through ESPN without having to hook up the computer to the TV.  We are very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Aibee"}, {"rating": 1.0, "review": "Be careful if you have only downward pointing HDMI ports the charger won't fit. Was really looking forward to this.", "verified": true, "helpfulness": "0/0", "author": "A. Young"}, {"rating": 1.0, "review": "Didn't work at all!", "verified": true, "helpfulness": "0/0", "author": "C'Uda"}]