[{"rating": 1.0, "review": "After 3 months, CRAP", "verified": false, "helpfulness": "0/0", "author": "Derek B \"Col.Forbin\""}, {"rating": 1.0, "review": "Very unhappy with this product.  Connects to the wifi, connects to the network, connects to internet, starts downloading the update and once it gets to 100% downloaded it then informs you that it cannot connect to roku.  Tried to contact roku for support and the only support available is a FAQ page, no answer on my question, or chat with a 25 minute wait time.Do Not Recommend, no real support for people with a busy life.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Bought this for my wife for Christmas. We recently ditched DirecTV and installed an over-the-air TV antenna. The Roku is simple to use and works well with our streaming services: Amazon Prime, Hulu Plus and Netflix. Also with You Tube and Pandora. Simple to set up and my wife is discovering new programming all the time. Much easier than using the apps build in to the TV or Blu-ray player.", "verified": true, "helpfulness": "0/0", "author": "T. Richardson"}, {"rating": 5.0, "review": "Very satisfied. Came quickly and even though it said refurbished, it looked brand new and worked perfectly from the beginning. Easy set up and very easy to operate.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If you don't need a DVD player, this is they way to go!  I love that you don't see it and it works great!", "verified": true, "helpfulness": "0/0", "author": "jbird"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Deborah M. Jacobs \"DJ\""}, {"rating": 4.0, "review": "Great way to stream NetFlix or Hulu.", "verified": false, "helpfulness": "0/0", "author": "Thomas Lower"}, {"rating": 5.0, "review": "Works for what we needed which is to watch JW.org which is a great website to get meaningful answers to the deeper questions of life and living.", "verified": true, "helpfulness": "1/1", "author": "LAB of E Tennessee"}, {"rating": 3.0, "review": "it may just be that I received a defective remote, but I have tried this stick and it works ok.  Wish I had gone for the amazon fire stick.  The roku is ok, the chromecast  really didn't work out either.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing is awesome. I primarily use it in conjunction with my iPad to sling box and it works perfect. Tons of apps to choose from so there is something for everyone in that tiny box.", "verified": true, "helpfulness": "0/0", "author": "Eric Glass"}]