[{"rating": 1.0, "review": "I'm giving this one star because I could never get it to access the internet through AT&T; Uverse.  Evidently others have had the same problem with a very detailed work-around which I did not want to go through.  I'm sure it works nice when it can connect to the internet. I  gave it to my son so he can use it.", "verified": true, "helpfulness": "0/0", "author": "Gaspasser"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Pepe"}, {"rating": 4.0, "review": "It costs half that of a Roku 3, and does everything the 3 does except for the input on the 3's remote to plug in headphones. It's also a fraction the size of a Roku 3, and doesn't have to sit out in front of the TV all the time, as it plugs into and sits in the back where the USB ports are.It costs more than a Chromecast stick, but it comes with lots more apps and a remote that is way more useful than I first thought it would be.Adding channels activation codes, and inputting data like username, passwords is annoying because the only way to do it is by tapping one letter at a time on an on-screen keyboard... you only have to go through this once per channel or service that you want to add, but it can be a lengthy process. To solve this, Roku should offer the ability to take care of all the setup stuff via a computer browser, once signed into your Roku account.Bottom line is it's basically as good as the more expensive Roku 3, and way more functional than Chromecast for only $10 more. To me it's currently the clear winner of all the app streamers.Apple is missing from my comparison; of course, because everything about Apple TV it is way to proprietary for it to ever be in the final running to win this war.", "verified": false, "helpfulness": "0/0", "author": "BeachBum"}, {"rating": 5.0, "review": "a wonderful replacement for expensive cable", "verified": true, "helpfulness": "0/0", "author": "Elaine Garfield"}, {"rating": 5.0, "review": "I've had all the streamers. Roku, Amazon fire tv, chromecast and apple tv. The Roku Stick is by far THE BEST I've ever had! It's second to none in content and I've yet to have a single issue with streaming....one of the best buys on the market today.", "verified": false, "helpfulness": "0/0", "author": "W. Rapanault"}, {"rating": 2.0, "review": "We've only had it a few days and the remote is giving us tremendous problems.  We have re-started several times, unplugged, re-paired the remote with the roku box, you name it we have done it.  My son looked up the problem with the remote freezing up and found that the remote can \"lose\" the connection because of the Wi-Fi connection.  If other devices (computer, tablet etc...) are being used it can disconnect leaving the remote frozen.  It's totally frustrating and makes using it not satisfied with what we paid for.  Don't even know how to exchange remote if indeed the remote is flawed.  :(  :(", "verified": true, "helpfulness": "2/3", "author": "Bonnie Luinski"}, {"rating": 3.0, "review": "I expected much more from this but most of the channels are either asking for money to see anything without interruptions or just like regular cable with the abundance of commercials. Sometimes the show would lock and you can't get back to where you were on the show. The remote was just as reviewed. Sometimes it worked other times it didn't. (Best to download the app and use your smartphone remote.) Netflix was pretty good though. Some of the other channels were quite useless.", "verified": true, "helpfulness": "0/0", "author": "Garry L. Clemons \"Rorschach\""}, {"rating": 3.0, "review": "It's really good for Netflix and pandora", "verified": false, "helpfulness": "0/0", "author": "Monster"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Todd Dressen"}, {"rating": 5.0, "review": "I hate to say it but this is so much better then the fire stick. We always used box style Roku's but started using a Amazon Fire stick when they first came out on a bedroom tv.  The firestick apps are just so limited right now.  You really don't have many to choose from. The roku has hundreds and hundreds of apps plus the ability to add private channels.  One thing that always bugged me about the firsestick was that it had no time warner cable app.  Roku's do so I am able to watch my cable from any tv it's hooked to.  The navigation and set up is also more user friendly on the Roku.  After using the firestick for 4 or 5 months it's just so nice to get back to a Roku and the stick form makes it easy to set up on a wall mount tv.  Maybe Amazon firesticks will be able to compete eventually when more apps and channels are available but for now Roku is the best on the market in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Sarah Nerd \"Sarah Nerd\""}]