[{"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "Carlos Mota"}, {"rating": 5.0, "review": "~LOVE LOVE LOVE my Roku stick!!! If you aren't familiar with what Roku is and whether or not you \"need\" it... well I was going to purchase a new \"SMART\" tv.. I had been researching them for a long time having trouble deciding whether it was worth it and had read in some reviews that the \"Smart\" televisions have some technical problems (this is not a fact, just what I learned per researching and reading many reviews)!So I knew about these, but never really understood that they essentially turn any TV into a \"smart\" tv (so to speak).... I bought this stick option (they also make a little box) but this one I believe cost less and it is the easiest thing to use and has more streaming options than anything or any smart tv that I know of.I love now that I have this little easy stick, that I can even take it and plug it into another tv... I am thinking to just purchase another for the tv I am doing this with)  --- but let me just say, that if you are wanting a smart tv just to have Netflix or Hulu or the like on it, then this is the far smarter more efficient choice.Roku has so many channels that you can choose to add or not have on your own personal stick/box(if you get that one)...I am pleased with this purchase and am surprised it took me so long to get one... I ended up buying a brand new LG 42 inch television for a pretty good price, but had I not decided to just add this for the ($30-40), the \"smart\" version of my LG 42\" TV costs nearly or roughly $200 more!!!!So let's see, if you are wise and frugal and want to buy the best for the least; this little gadget for the price, is so cool....it is like turning any television in your house into a computer (so to speak)--because there are so many channels besides the major movie/tv streaming apps... You can access and play Vevo, Youtube, Pandora and just really any thing that one may have interests or pursue hobbies in, they have a channel that you won't even know existed until you plug this in or go online and check out all the channels you can add and view if you have a Roku.It is very easy to setup and use and I also enjoy that once you sign up and login to the channel, it is always there no matter where you end up sticking it or viewing your Roku channels on....The only negative I have with the version I have (the stick)-- is that the remote is not super advanced, it is very basic and will not be able to do any commands for the tv itself, I would like it if could also be used as a universal remote to be able to at least change the volume...but if you have been ambivalent about this or had the same issue I had about the benefits or lack thereof to buying a \"smart\" tv....buy one of these instead, that is the \"SMART\" choice!", "verified": true, "helpfulness": "0/0", "author": "victoria"}, {"rating": 5.0, "review": "I absolutely LOVE this product.First the background: I have a Samsung 55 inch Smart TV and have been using the apps to access Netflix, HBO Go and a couple of other movie channels. I cannot access my Amazon Prime account because this TV is one generation short of supporting it; very frustrating (I have complete access on 4 other TV's in my weekend home which are all of later vintage then the one in my apartment). Since this model Samsung does not have the ability to update via the web (USB Flash drive only) I have a bit of problem as you will see below.Due to a variety of built-ins in my bedroom, my TV is hung on a \"Ultra Slim Thin Picture Style Hanger Wall Mount\" and is flat against the wall, I cannot access the HDMI port (there is a big built-in dresser over which the TV is hung and  that makes access almost impossible) so I needed a work around. To do that I purchased the Kinivo 3 port HDMI high speed switch along with a Blue Rigger 3' HDMI cable (both of these are also terrific products). My cable box took up one input slot and my Roku stick the other. It took all of 10 minutes to set up the hardware (crawling into a cabinet no less). The Roku software was fantastic and everything was working literally in a matter of minutes. Very gratifying to have something work so well out of the box, Setting up all the accounts (Netflix, HBO, Amazon, etc) took me another 45 minutes due to the input method they all use plus entering the codes generated by the TV. Took some time, but not really a problem. When all was said and done everything worked perfectly. The picture quality is impressive (780/1080 option) and the Kinivo switch works perfectly (unfortunately it is IR wireless and not RF so I had to add a IR repeater which is not a big deal - I will review this later). At the end of the day everything is working perfectly and I am totally satisfied with my Roku Stick. BTW, I utilize Time warner Cable wi-fi (Extreme option) and so far there appears to be no buffering with the Roku (which I did have running from my Smart TV option). I will update if any change.UPDATE: Today I received the missing piece, the IR Extender the Arrela®-Infrared-Extender-Receiver-Repeater). Took me all of 5 minutes to set this up and the entire system now works seamlessly. The good news about this extender, even though it says \"line of sight\" to work, I found that just pushing the buttons on the remote, aiming anywhere in the room, the Kinivo instantly changes the video source (Roku/Cable box). Now, IMHO, I have the perfect adjunct to my Samsung and access to Netflix, Amazon Prime and a bunch of others. Even made my wife smile since there was no cursing in any part of the setup and the controls are a snap to understand and use.Happy campers all around.", "verified": true, "helpfulness": "1/1", "author": "Howard S."}, {"rating": 5.0, "review": "I was very surprised how fast the channels play and the quality of the picture.  There are hundreds of different channels to choose from, a majority of them free of charge!!  A must buy for anybody trying to save on cable, and a better product than Chromecast!", "verified": true, "helpfulness": "1/1", "author": "captjack8"}, {"rating": 4.0, "review": "It doesn't work for people that live outside of the US, even when some services like Netflix are able on your country, Roku remove all of them and leave you just Youtube channel, there is not way to put it back on your list.I had to bought a DNS service (from a thirdparty) to make it work.... Otherwise, the product is a great option for those who love stream channels.Note: Roku Streaming Stick is almost as fast as Roku 3.", "verified": true, "helpfulness": "0/0", "author": "kamikaze_cr"}, {"rating": 5.0, "review": "Works as advertised and no problem after 3 months of daily use.", "verified": true, "helpfulness": "0/0", "author": "Dawit Yimam Seid"}, {"rating": 1.0, "review": "freezes and doesn't connect with the remote frequently. I was very disappointed, buy the little box till this majorly improves", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 2.0, "review": "This review is based on the 3500R's performance with Netflix. We haven't used it with any other services.We purchased this to use instead of a PS3 we had been using, which worked great but had overheating issues in our TV cabinet. We installed the Roku, and appreciated not having to boot up and pick an app every time. That was the good part.Netflix takes much longer to load, videos often start streaming in very low quality (think 10 year old cell phone), which is frustrating. The PS3 (same location relative to the router), starts videos almost instantly at full resolution.The worst part is the 'replay' button, which seems unresponsive, then ends up jumping some random amount of time, or pausing the stream, or hanging, etc. I get that the stick probably has a tiny buffer compared to a larger device, but rewinding 10 seconds (or FF/REW in general) should not be so painful.The Netflix experience on this device is similar to what you'd get on a \"smart\" BD player, kind of clunky and slow. Jerky scrolling, wondering whether or not the button you pushed has registered, etc.I already got rid of the packaging so I probably can't return this, but I'm wondering whether I should give the Roku 3 a shot given how disappointing this purchase was. We've gone back to using the PS3.", "verified": true, "helpfulness": "0/0", "author": "leapfrog"}, {"rating": 4.0, "review": "I purchased a Chromecast (with all the hype) prior to the Roku stick and returned it shortly afterwards. The Chromecast UI was not smooth at all. I'm not sure if this is a function of the apps on my iPhone 5 or Chromecast itself; i.e. pausing a Netflix movie and then coming back to it 5 mins. later required me to close the app down and then restart it, and then it was a pain getting back to the \"paused\" screen. Also the screensaver took a real long time to show on my TV in which sometimes I thought it wasn't even working. The Roku's remote worked great pausing the movie for any length of time plus the screen saver works as expected...", "verified": true, "helpfulness": "0/0", "author": "GKC \"YoMon\""}, {"rating": 5.0, "review": "Great and simple product. It's for my son.  He loves it.", "verified": true, "helpfulness": "0/0", "author": "booyame"}]