[{"rating": 5.0, "review": "Easy to set up. Works great.", "verified": true, "helpfulness": "0/0", "author": "JHF"}, {"rating": 5.0, "review": "I love it and it was easy to install!", "verified": true, "helpfulness": "0/0", "author": "Wild22"}, {"rating": 5.0, "review": "I bought this after having the Roku HDMI box for a couple years. I like that it's small & doesn't take up much room so it's perfect for a bedroom TV. Love the Roku products & highly recommend if you have Netflix.", "verified": true, "helpfulness": "0/0", "author": "Tiffany D. Martin"}, {"rating": 3.0, "review": "Great overall device but me personally the UI is slow.  Forget using a USB port for power unless you want to wait as long as a minute for it to fire up every time.  UI just seems laggy, and loading apps takes time.  But As far as media playback, there's no lag there and it works great.  Wifi radios are solid too, no issue with either band, and the remote works great, but I really hate the stupid shortcuts to blockbuster online and MGo.", "verified": true, "helpfulness": "0/0", "author": "Cory D. Wilson"}, {"rating": 1.0, "review": "Video streaming stopped after 7 months, audio and menu are working but no picture with Netflix, Amazon, etc..  Just a disposable toy.", "verified": true, "helpfulness": "0/0", "author": "Bill Doyle"}, {"rating": 5.0, "review": "We have basic cable service and this has opened up all kinds of viewing opportunities! I just learned that I can add channels and watched The Interview this morning. The Amazon Prime collection is awesome, too. Very happy with it!", "verified": true, "helpfulness": "0/0", "author": "Bobbi"}, {"rating": 5.0, "review": "Excellent purchase.", "verified": true, "helpfulness": "0/0", "author": "Anthony C."}, {"rating": 3.0, "review": "Cannot get any channels as Comcast/Xfinity are not supported, so this makes this device useless for the upstairs room. Had I known this before I would not of purchased. Nowhere online is a list letting you know what companies support this item. That's the con...for the pro, it does have a nice selection of other channels.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So cool!", "verified": true, "helpfulness": "0/0", "author": "Lori Lute"}, {"rating": 3.0, "review": "Would not fit behind our 1st TV, no problem on 2nd.  Works great otherwise.", "verified": true, "helpfulness": "0/0", "author": "jes"}]