[{"rating": 5.0, "review": "Easy to install and use.  Great addition to any non-smart TV.", "verified": true, "helpfulness": "0/0", "author": "Thomas T. LoPresti"}, {"rating": 5.0, "review": "Another great Roku product!", "verified": true, "helpfulness": "0/0", "author": "Patrick J. Garot"}, {"rating": 5.0, "review": "So nice to have the stick rather than the box, I've been using Roku since the beginning and really like the user interface and the great selection of channels.  I bought this for my motorhome, plug it in and forget it. No cables to worry about no need to find a space for the box.  It's perfect.", "verified": true, "helpfulness": "0/0", "author": "Mema \"Wife, Mother, Mema, Sister\""}, {"rating": 5.0, "review": "I'm ditching my Apple TVs (all 3 of them) and getting Roku for all my TVs. The fast forward and rewind features, alone, make it worth it not to mention the ease with which it plays all of my streaming media. I have yet to see it pause or have issues with the audio & video getting out of sync. It just works!  Wow, I had no idea streaming media could be this good....and this one is using the wireless signal (my Apple TVs are wired into my network).  I can't speak to the difference between the Roku stick and the box, but I can tell you that the Google Chromecast device sucks even worse, and this device blows both of them away. All of these years that I've been loyal to Apple products, and I had no idea how much better life could be (ha!).", "verified": true, "helpfulness": "0/1", "author": "Bethany Jenkins \"B. Jenkins\""}, {"rating": 4.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "Vicki Slater"}, {"rating": 5.0, "review": "Fast shipping. I liked the price. I had the streaming box so had to try the stick. Love it, no wires!", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 2.0, "review": "Netflix is missing", "verified": true, "helpfulness": "1/2", "author": "Ryan Ragbir"}, {"rating": 3.0, "review": "Much more elegant solution than the Roku devices. Doesnt sit on top of my entertainment center awkwardly. Solid Roku performance, but the menus are somewhat sluggish and I wish I could get the old menu structure back.Not having the main categories to browse on the TV any more is not good. Netflix/Roku, please fix this.", "verified": true, "helpfulness": "0/0", "author": "Christian H."}, {"rating": 5.0, "review": "I like the ROKU Stick because it is completely out of the way.  Nobody would know your using Roku.  Netflix was slow loading when I first bought it but not anymore.  Someone fixed that problem.  Great buy..  You'll love Roku.  Try it....  You won't be sorry you did..", "verified": true, "helpfulness": "0/0", "author": "echo heart \"echo2009\""}, {"rating": 1.0, "review": "terrible product i threw mine out the window!!!!!!!!Save yourself 50$ and go get a rabbit tv for 5$ and find more satisfaction. this thing freezes up, I constantly had to turn it off and on... it never works and gave me a headache!", "verified": false, "helpfulness": "0/3", "author": "Tabitha Miera"}]