[{"rating": 4.0, "review": "Great device, easy to set up and use, but not all channels work good.", "verified": true, "helpfulness": "0/0", "author": "Dmitry"}, {"rating": 5.0, "review": "easy to use", "verified": true, "helpfulness": "0/0", "author": "Vicki G \"happy customer\""}, {"rating": 5.0, "review": "We love our new stick.  Much more simple than ever before.  One more remote,  but you can download the remote App on your smartphone.  Great product", "verified": true, "helpfulness": "0/0", "author": "Amy Mobley"}, {"rating": 2.0, "review": "So I purchased this in May 2014 and now in Oct 2014 it is no longer working properly and 90 day return policy has expired.  I suggest maybe getting extend warranty.  I called Roku and they will send me a new one after returning defective one-which is very nice of them :)  What happened is the male HDMI connector attached to the stick became loose.  I recommend being very careful, plugging and unplugging into TV HDMI.  I have only unplugged it once since initially installed and thought I was careful but who knows, that was today when it stopped working.  I feel that this product is poorly constructed.  When it did work initially, it was great.  For the past few weeks I have not been able to watch some channels, this is not an issue with the product/Roku, but comcast as they are not listed with certain channels like fox, A&E;, History, HBO and others to activate streaming.  Must be something to do with these networks and comcast so be prepared to have limited channels with comcast even if these channels are available on your cable line up. Very frustrating!!", "verified": true, "helpfulness": "0/0", "author": "AEW"}, {"rating": 4.0, "review": "Takes a while to start up when you switch it on but otherwise it performs well.  The lack of settings - particularly the inability to control DNS etc is unfortunate.", "verified": true, "helpfulness": "0/0", "author": "Luke"}, {"rating": 5.0, "review": "works great! easy to set up love it!", "verified": true, "helpfulness": "0/0", "author": "Melissa H."}, {"rating": 5.0, "review": "If you need your Roku to just go about pretty much anywhere with out the hassle of cables, this is the best bet.", "verified": false, "helpfulness": "0/0", "author": "Kris"}, {"rating": 4.0, "review": "Works great. I did not know that I would have to be a service subscriber of a cable company to get a lot of the channels but it does give me a lot of viewing choices without it.", "verified": true, "helpfulness": "0/0", "author": "Dwight C."}, {"rating": 4.0, "review": "Overall I've been very pleased with this device.  Only complaint I have is the slow boot up time when you turn on your TV.  Using the outlet power option instead of USB power option is one way to get around this.  I really like the form factor and ability to keep it hidden behind TV with minimal cords.  Keeps the TV stand uncluttered.", "verified": true, "helpfulness": "0/0", "author": "Daniel S. Lah"}, {"rating": 4.0, "review": "This product was easy to install.  What I did not like about it is that it requires you to give a credit card in order to set it up. I was not aware of that when I purchased it.  I already have a NetFlix account, so I primarily wanted this device to be able to watch Netflix movies.  A friend of mine purchased this device last year and at that time it did not require the use of a credit card to set it up.  I know technology changes, but I found this misleading....", "verified": true, "helpfulness": "0/0", "author": "poetic jewel"}]