[{"rating": 1.0, "review": "I really wanted this to work, but it simply could not connect to the internet. It kept getting a DNS error. I was on live chat with roku for a while. They troubleshot it as far as changing the DNS settings. But, on a comcast internet & telephone modem/router combo, there is no way for a customer to do that.  At least not on an Arriss TG862. To Comcast's credit, their tech support was on the phone with me for an hour and remote controlling my computer to do it themselves. They could not change the DNS settings. So, I returned is, went to a local store and got the Roku 3, which works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Kay"}, {"rating": 5.0, "review": "It was easy to hook up. There are lots of free shows for viewing. Downloading is fast and easy to do..", "verified": true, "helpfulness": "0/0", "author": "Dani B"}, {"rating": 5.0, "review": "It was easy to install and gives great reception.  I don't have the box sitting on the table anymore. Very pleased with it so far.", "verified": true, "helpfulness": "0/0", "author": "Betty Harbin"}, {"rating": 5.0, "review": "I love the Streaming Stick !! It can access as much as the Roku 3 as far as I can see, and it is easy to use. I have both this and a \"3\" and love them both.", "verified": true, "helpfulness": "0/0", "author": "hornet64"}, {"rating": 1.0, "review": "I bought the Roku because HBO go wasn't available to time warner cable customers on apple TV. My video streaming blue ray player and apple tv do just fine, but in the same location the Roku will stop multiple times while I'm watching a show.", "verified": true, "helpfulness": "0/1", "author": "Sean Walcott"}, {"rating": 4.0, "review": "Excellent range of channels on offer with an intuitive and attractive GUI.had to knock a star off as it is painfully slow when compared to the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I bought this for my main entertainment center because I can't get amazon through my Apple TV. Some people are complaining about Netflix being slow, it takes a few seconds to open, but once you're there the roku stick actually gives a better picture then my Apple TV(last generation on the newest), and amazon prime works almost instantly, I would definitely recommend this to any one looking for a streaming device.", "verified": true, "helpfulness": "0/0", "author": "Guardian239"}, {"rating": 5.0, "review": "Plugged cleanly into the HDMI port of my TV and started working immediately.  It was quickly recognized by my wireless Ccable modem and was up and running.  Jim Ungari", "verified": true, "helpfulness": "0/0", "author": "Jim Ungari"}, {"rating": 3.0, "review": "Well, it works, and works like my old Roku box.  EXCEPT, when I don't use it for more than two days, when I do go to it, I have to unplug the power and replug it to get it to work.  Pain in the butt.  Like I said, though, when it works, it works just fine.  I'm thinking I may go to Amazon TV instead.", "verified": true, "helpfulness": "0/0", "author": "R. Hoppe"}, {"rating": 1.0, "review": "Used twice and now is not working.  Very disappointed had the original and wanted an update.  Probable sending back now.", "verified": true, "helpfulness": "1/1", "author": "Jackie"}]