[{"rating": 5.0, "review": "I love the Roku stick and how it integrates all my online streaming services. The software could be better designed to help with searching and navigating, but it's workable", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 4.0, "review": "I wish I had researched more heavily as Roku does not have a contract with HBO and therefore I cannot access HBOGO on my Roku", "verified": false, "helpfulness": "0/0", "author": "Bryce Gardner"}, {"rating": 1.0, "review": "This product was a refurbished product and did not work on a consistent basis. I kept trying to get it to work but would intermittently freeze up. I went on vacation and when I returned it still would freeze up. I tried to return it, but the window to return had closed 5 days before. I would never again buy a refurbished item.", "verified": true, "helpfulness": "0/0", "author": "Kathy Anderson"}, {"rating": 5.0, "review": "Great product for non smart tv's. I use it all of the time, mainly for Netflix and Amazon prime shows. If it were up to me I would get rid of cable and be very content with just this roku for streaming.", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "It is necessary to provide the service in Spanish subtitle . A market of 600 million people would gain .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I absolutely love m Roku 3500R. The only apps that I use regularly are netflix, youtube, hbo go, amazon instant, and hulu plus, and these all work great on the Roku 3500R. At $50 this also is a great gift. I bought one for my father and one for my grandfather, and they both love the device.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "No complaints. I plugged it in as suggested snd I've had no issues.", "verified": true, "helpfulness": "0/0", "author": "DiDi"}, {"rating": 5.0, "review": "We love this little memory type stick and we don't get all that reset stuff we used to with the Roku XD. Was very easy to set up and it has a quick reset button if you need.", "verified": true, "helpfulness": "0/0", "author": "Timothy Emmons"}, {"rating": 5.0, "review": "I have other Roku boxes in my house. This is a great device since I use it on a TV mounted on the wall. No wires to a box below. All self contained.My only complaint is that it is a little slow in responding to the remote sometimes, but nothing to really worry about.Otherwise, it provides a great HDTV picture and sound like the other Roku boxes I have. Seamlessly attaches to my Roku account.What else could you ask for?", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 3.0, "review": "Gets hot and sometimes I have to reboot it. Also it could be faster, not bad though.", "verified": true, "helpfulness": "1/1", "author": "Mike"}]