[{"rating": 5.0, "review": "Haven't used it enough to really explore all of its features, but I think its cool.  I turned my work out room into a haven to watch all my trash TV, and I can even do work out videos off of Roku channels.I just wish there was a better search function.  It may exist, but I've just haven't found it yet.", "verified": true, "helpfulness": "0/0", "author": "Crazylabrat"}, {"rating": 5.0, "review": "This unit is excellent. I bought it for my upstairs bedroom so I could watch Netflix without moving the Xbox up and down the stairs. It's small and convenient. You do need a power source beyong plugging it into the TV. You can use a USB or a standard power cable. I reccomend the power cable since it says using USB may not give the unit sufficient power", "verified": true, "helpfulness": "0/0", "author": "Heisenburg"}, {"rating": 2.0, "review": "Have had the Stick for 2 months now and have noticed a series of issues with picture freezes and unable to connect to Netflix and other channels.  The stick seems to heat up excessively and if disconnected and allowed to cool it seems to improve performance.", "verified": true, "helpfulness": "0/0", "author": "XN"}, {"rating": 5.0, "review": "Its amazing/ I love it.", "verified": true, "helpfulness": "0/0", "author": "Ligia Brealey"}, {"rating": 4.0, "review": "I love this thing, except for 1 issue.  If you use your TVs USB to power it, the initial loading time is pretty long, at least 1 minute, which is forever for a device like this.Amazon Prime is my main usage with the Roku, and does a good job.  I've had a couple buffer issues, but only because I'm running a ton of stuff off my wireless router.", "verified": false, "helpfulness": "0/0", "author": "Justin N."}, {"rating": 5.0, "review": "Perfect interface is much better then any other devise i love this thing its small so you dont even see it get one as soon as possible!!!", "verified": true, "helpfulness": "0/1", "author": "Blake"}, {"rating": 3.0, "review": "Can't get it to work on non MHL HDMI input.  They don't tell you that!  Can't return it to Amazon cuz I opened it:(", "verified": true, "helpfulness": "0/0", "author": "Ken Schims \"sstunning\""}, {"rating": 1.0, "review": "Have not been able to get it to work", "verified": true, "helpfulness": "0/2", "author": "Brenda G Thomas"}, {"rating": 4.0, "review": "Two words............LOVE IT!!!!!", "verified": true, "helpfulness": "0/0", "author": "Dolores Tisil"}, {"rating": 5.0, "review": "So fantastic!  I can now watch all of my Amazon movies on my TV and I can listen to Pandora any time I want.", "verified": true, "helpfulness": "0/0", "author": "JodiHuff"}]