[{"rating": 5.0, "review": "great alternative to cable tv", "verified": true, "helpfulness": "0/0", "author": "jlwin"}, {"rating": 1.0, "review": "I purchased a roku ready TV. Had the first roku for a week. It would continually fall out of the hdmi port. I returned the item through Amazon and it was replaced. The second roku stick worked but the remote wouldn't stay paired. We re synced the remote multiple times a day, changed batteries until the remote died. Now the seller won't replace the faulty remote or take it back even know I have directly contacted roku customer service. Too much hassle.", "verified": true, "helpfulness": "0/0", "author": "Stacey"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Jon M."}, {"rating": 1.0, "review": "Product stopped working after 45 Days - thought cord was bad so bought new cord and still doesnt work. Please credit my account due to defective product or send me a new roku (not a stick) and I'll pay the difference", "verified": true, "helpfulness": "0/1", "author": "Lysellio"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Jacobo Saad Hamui"}, {"rating": 5.0, "review": "Perfect for our TV. It's not visible so it's perfect", "verified": true, "helpfulness": "0/1", "author": "Angelica C"}, {"rating": 5.0, "review": "Bought this as a Christmas gift for my in laws. They are cutting cable now as their contract is up. They love it!", "verified": true, "helpfulness": "0/0", "author": "Christen"}, {"rating": 1.0, "review": "Terrible product.  Won't stay connected,slow, keeps reloading.  not worth the money.", "verified": true, "helpfulness": "0/0", "author": "James Roberts"}, {"rating": 5.0, "review": "Love this system. All the options that it gives you, you can really lower your cable bill. I also loved that we are able to take this with us in our camper for places that have wifi. Makes it really nice for the kids to have some quiet time or if it's a rainy day.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Very pleased with this item.", "verified": true, "helpfulness": "0/0", "author": "Nikkei"}]