[{"rating": 5.0, "review": "It works", "verified": true, "helpfulness": "0/0", "author": "MyNameGoesHere"}, {"rating": 5.0, "review": "\"Great Seller,Would Bid On Your Products' Again.\".Thanks'.Five Stars.AAA+++!!!!!", "verified": true, "helpfulness": "0/1", "author": "David  Kohls"}, {"rating": 2.0, "review": "I have had this for about 3 months now and am not satisfied. Hard to say if it is the fault of my modem or the Roku itself but I have had nothing but problems with this losing connection/not being able to connect.  Started out having it on the floor below my modem and it wouldn't connect.  Moved it on the same floor of the modem and would work about half the time.  Moved it to the same room as the modem and it worked great.  To me, it kind of defeats the purpose of having wireless capabilities if you have to have it in the same room as the modem.  Again, i suppose it could be an issue with my modem but I have no issues with any other wireless device in my house including a Google Chromecast and wifi blueray player.  Have been in contact with Roku support of my issues with no remedy being offered.  I will say when it does connect it is pretty cool and there are tons of channels to pick from.  I run netflix, hulu plus and amazon prime through it and they work great (when the Roku decides to work, that is).", "verified": true, "helpfulness": "2/3", "author": "Dave"}, {"rating": 3.0, "review": "Bought this as a Christmas gift for a nursing home. This was not a simple setup as my own personal Roku at home. Instantly received error message 014 and had to Google for help. The information is below, it worked after that but what a pain!Here it is for you all if you need it:Force a Software Update:  On your Roku remote:Press the Home button 5 timesPress the Fast Forward button 3 timesPress Rewind button 2 timesYou will get an unusual screen known as the 'secret screen'.  There you have to check your IP address that it is not all 0's. Select the option to update software. The Roku player should now restart.Disable Pingback:  Once the Roku completes the setup, enter the following on your Roku remote:Press the Home button 5 timesPress the Fast Forward button 1 timePress the Play button 1 timePress the Rewind button 1 timePress the Play button 1 timePress the Fast Forward button 1 timeThis will take you to the another secret screen.  Select the option to disable network ping.Now you must start your Roku setup from the beginning.  Hopefully this will solve your problem and will get you connected.", "verified": false, "helpfulness": "3/3", "author": "singlegal \"sgal\""}, {"rating": 5.0, "review": "We're really loving this streaming stick! No issues at all. Really easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Julia C."}, {"rating": 5.0, "review": "this device took a while to setup for Amazon Prime, but in the end it works very well.", "verified": true, "helpfulness": "0/0", "author": "Thomas Brammer"}, {"rating": 5.0, "review": "EASY to connect, step by step instructions come up on tv screen telling you what to do next. Plug and play within 15 minutes. Love it!", "verified": true, "helpfulness": "0/0", "author": "L. Fry \"KittyMama\""}, {"rating": 5.0, "review": "Worked instantly out of the box, easy product registration. A must for Amazon Prime users as Chromecast doesn't get Prime.  A bargain for the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"trap49\""}, {"rating": 5.0, "review": "Easy to use, fast interface. I have had similar devices in the past that are frustrating to use, but the Roku is great to use.If you want to play content from your computer, use this Roku with Plex.", "verified": true, "helpfulness": "0/0", "author": "Greg Larson"}, {"rating": 5.0, "review": "Works as advertised.  More expensive than chromecast or the kindle stick, but offers more choices.  Easy to setup, good HD so far.", "verified": true, "helpfulness": "0/0", "author": "Laavy"}]