[{"rating": 5.0, "review": "Great little gadget.", "verified": true, "helpfulness": "0/0", "author": "Pedro C."}, {"rating": 1.0, "review": "Had this for a month, worked fine at first but now all it does is freeze up.  Should of stuck with Apple", "verified": true, "helpfulness": "0/0", "author": "Christine Chicco"}, {"rating": 5.0, "review": "Has Funimation for my boyfriend, PBS kids for my daughter, and tons of footage of random historical stuff (ancient sex ed films? Out-of-copyright Robin Hood movies?) for me. Very very happy.If nothing else the 1000 different evangelical church channels were worth it. Haha.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 5.0, "review": "As advertised, shipped quickly", "verified": true, "helpfulness": "0/0", "author": "Gary Boyer"}, {"rating": 4.0, "review": "I received my Roku refurbished streaming stick in like new condition, installed it in no time and immediately started to enjoy downloading online content. Great service from reseller.", "verified": true, "helpfulness": "0/0", "author": "Gerald Wilkins"}, {"rating": 5.0, "review": "As described...", "verified": true, "helpfulness": "0/0", "author": "lou shapiro"}, {"rating": 2.0, "review": "Very frustrating.  The device continues to \"go dead\" and not communicate with the TV.  Worded fine for about 2 days.  So frustrating I went back to Chromecast until I can return Roku.  Not sure I want it replaced.  It may just be a bad unit, so will probably give it one more shot.", "verified": true, "helpfulness": "0/0", "author": "Ridge"}, {"rating": 5.0, "review": "Very pleased and easy to use", "verified": true, "helpfulness": "0/0", "author": "MLM09"}, {"rating": 5.0, "review": "Works great with my home theater. My theater is in the basement and my wifi is upstairs and it has no problem streaming flawless video. Great little item, thanks.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 4.0, "review": "Our family loves our Roku stick because we don't have cable and don't really get any antenna stations.  Between the free channels and amazon instant video, there is always something to watch.  In fact, we stopped borrowing movies from the library because we have so many to choose from right at home.  The only problem I have with it is that whenever I pass over the \"news\" icon on the main screen, the whole Roku system resets itself.  I'm not sure why this happens.", "verified": true, "helpfulness": "0/0", "author": "sherbet18"}]