[{"rating": 1.0, "review": "Excellent technically, but... It does not have a searcher for channels, so it is a mess to find something.I bought this from Germany and I intend to use it in Uruguay.Do not has even German channels, which were very easy to find and use with Chromecast, like ZDF, the best, and also Arte from France and Germany.There is not any possibility to find anything but also the support does not answer this search question.A good idea destroyed by not functional business people.", "verified": true, "helpfulness": "0/1", "author": "mhandler"}, {"rating": 2.0, "review": "We have updated everything but the controller only works after we remove and then replace the batteries. Batteries are good. Maybe this was the problem you were having. I don't know.  I apologize if I was rude before.  Let me know what can be done to resolve the problem.", "verified": true, "helpfulness": "0/0", "author": "Cheryl  Lewis \"Cheryl\""}, {"rating": 1.0, "review": "not working in Singapore . SO SAD", "verified": true, "helpfulness": "0/1", "author": "huangxiaochen"}, {"rating": 4.0, "review": "The remote lost connection at times and needed a power cycle. Otherwise the product was fine.", "verified": true, "helpfulness": "0/0", "author": "Damith Rajapakse"}, {"rating": 5.0, "review": "I love Roku.  I already have one and decided to add one to my 2nd tv.  It was easy to install and connect to my already existing account.  I love the choices I have to view.  It is easy to use, reliable and the price is right.", "verified": true, "helpfulness": "0/0", "author": "ereader"}, {"rating": 4.0, "review": "It would be good but it keeps going off and on not connecting to the wifi", "verified": true, "helpfulness": "0/0", "author": "mary ann fletcher \"mary ann fletcher\""}, {"rating": 5.0, "review": "This is the best streamer the only thing that could make it better is if it had auto play for TV show seasons so you could watch all the episodes without having to select the next episode after you watch one.", "verified": true, "helpfulness": "1/1", "author": "Dorothy"}, {"rating": 4.0, "review": "Is ok but not great.", "verified": true, "helpfulness": "0/0", "author": "James Calderon"}, {"rating": 5.0, "review": "Second one I've purchased. Love it. works fast, easy to install.", "verified": true, "helpfulness": "0/0", "author": "M. Wasserman"}, {"rating": 4.0, "review": "Very cool", "verified": true, "helpfulness": "0/0", "author": "Raj Thakur"}]