[{"rating": 4.0, "review": "everything it was advertised to be", "verified": false, "helpfulness": "0/0", "author": "Kent Backus"}, {"rating": 4.0, "review": "It is great for what it needs to be used for, unfortunately I wish the device was quick going from screen to screen, but I cant complain it works wonderfully", "verified": true, "helpfulness": "0/0", "author": "Walter"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "michael kirwin"}, {"rating": 5.0, "review": "Works great! Just plug it in and it is hidden back among all the wires and stuff.  I got the free remote control ap for my iPad.  No more trying to enter a search in that stupid little grid.  Just type it in in the screen!", "verified": true, "helpfulness": "0/0", "author": "Ralph Freeman \"Ralph Freeman\""}, {"rating": 5.0, "review": "Now this, I did order and it came safe and sound. I really liked browsing Amazon, but I cant afford all the money they are stealing from me.", "verified": true, "helpfulness": "0/1", "author": "joanna murillo"}, {"rating": 4.0, "review": "Good streaming Netflix, boots up slow but works pretty well, few bugs (Amazon apps particularly buggy) and remote app will eat you ph battery and get very warm. Use the remote it comes with, I only use the ph app to type in letters if you need to search or setup wifi pw etc. five stars if app and OS boot speed was fixed.", "verified": false, "helpfulness": "0/0", "author": "Happykitty"}, {"rating": 4.0, "review": "Pretty good for streaming Netflix etc, boot up times pretty slow would give 5 stars if improved with an OS update. The remote app for android and Apple also eat battery VERY quickly, around 1-2% a minute, testing it out iPhone6 got very warm- like it was running an intense game. Scary, use quickly and close the app asap.", "verified": true, "helpfulness": "0/0", "author": "irian"}, {"rating": 3.0, "review": "In terms of working for the channel I bought it for, it works fine.Pros:Price is great for what you get.Lots of channelsSmall and portable.Cons: when sharing photos, it gets slow. Also with sharing videos, not as good. I have an Iphone 4s and it is really laggy.", "verified": true, "helpfulness": "0/0", "author": "Trav"}, {"rating": 5.0, "review": "Great quality product. Easy to use", "verified": false, "helpfulness": "0/0", "author": "C. Seth Andrews"}, {"rating": 4.0, "review": "It's size limits using a back HDMI port on wall mounted TVs, have to use the side port and let it hang out.", "verified": true, "helpfulness": "0/0", "author": "Craig G \"Shaggy\""}]