[{"rating": 4.0, "review": "Sure wish it had a headphone port on the remote like the Roku 3 and the remote is a far cheaper plastic than the Roku 3, but for the price it is a great value. I enjoy my Roku products. I got this to test in hope of using it to give my grandchild a safe viewing experience. Roku offers such a broad viewing selection that buttoning it down for a child proved daunting. We are using the old Apple TV device for my grandchild because the parental controls were much easier to use.", "verified": true, "helpfulness": "0/1", "author": "Cynthia E. Castro"}, {"rating": 5.0, "review": "This is our second Roku Stick, we love them!", "verified": true, "helpfulness": "0/0", "author": "Jessica Mendenhall"}, {"rating": 3.0, "review": "I have 2 roku 3's and two sticks.  No comparison - the 3 is much better.  The stick is slower at start up and tends to freeze.  That's my experience anyway.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Works as good as regular  roku but more discreet.", "verified": true, "helpfulness": "0/0", "author": "DELIA gonzalez"}, {"rating": 5.0, "review": "Always a great item to own if you require the extra free channels. Does not disappoint.", "verified": true, "helpfulness": "0/0", "author": "especial"}, {"rating": 5.0, "review": "Had an old model Roku for years then I purchased a Samsung smart TV. Big mistake. After dealing with the constant Samsung cloud issues (all Samsung apps run through Samsung cloud) and lack of certain apps, I purchased the streaming stick.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It performs as advertised, but is slower than I was expecting it to be. I don't know whether the problem is with the stick or my internet provider, but given that I can stream on my tablet without the same delays, I think the primary issue is with the stick. If I had it to do over, I'd opt for the Roku 3.", "verified": true, "helpfulness": "1/1", "author": "Donald W Sigmon"}, {"rating": 3.0, "review": "Works okay so far, but the remote is poorly designed (who puts the \"ok\" button beneath the selector???) and it doesn't work with my Harmony 700.  (I'm told it works with the Harmony \"hub\"-style remotes, but not the IR ones.)  Also, responsiveness on SlingTV is just slow enough to be disorienting.", "verified": true, "helpfulness": "1/1", "author": "S. Trombley"}, {"rating": 1.0, "review": "We have had a Roku 3 for over a year and a half that works almost flawlessly. The Roku Stick constantly buffers, making it unusable. Don't waste your time on the Stick; buy a Roku 3!", "verified": true, "helpfulness": "0/0", "author": "Kris R Campbell"}, {"rating": 4.0, "review": "Works well. Made my son happy. Only reason I did not give it 5 stars is because of the length of time it takes for it to load.Crazy thing is I see it as a network device. And my son has been able to connect his iPhone to his roku which is connected to his tv (which is not a smart tv) and use his phone as a remote. Love that.", "verified": true, "helpfulness": "0/0", "author": "Josh D."}]