[{"rating": 2.0, "review": "Did not hold up very well.", "verified": true, "helpfulness": "0/0", "author": "Cynthiawilliams"}, {"rating": 1.0, "review": "freezes up so much it is unusable.  This does not hold a candle to even the least expensive Roku Box.  We have several, but I am going to replace this.", "verified": true, "helpfulness": "2/2", "author": "music nut"}, {"rating": 2.0, "review": "I've had the Roku 3500R streaming stick for just over a week now and I really wanted to like it, but it's just too frustrating. I believe the main problem with the Roku stick is that it is severely under powered. When other reviewers wrote that it was slow, I was wondering how bad could it possibly be? Well, they werent joking - its about as fast as my 15 year old PC trying to run Windows 10. When you move from screen to screen or simply just move the crossbar to type something in you have to wait and wait and wait. Often you push the enter button and nothing happens for what seems like an eternity. Once you frustratingly shuffle through lagging menus that skip and stutter, the device freezes and needs to be rebooted.Despite its shortcomings, the streaming stick does well once you're able to successfully navigate to a title and get it to play. The actual streaming is what you've come to expect from any quality media device. Full 1080 and sound that plays well.I have a Roku 3 with no problems at all and the menus and user interface between the two devices is visually exactly the same. But unlike the streaming srick, the Roku 3 is able to smoothly and seamlessly navigate menus. As I said earlier, I believe the main problem is the stick is severely lacking power in terms of ram, processing power, and whatnot. I have no idea why Roku would release something so obviously buggy. Simply using the Roku 3500R is such a headache that I will be returning it and exploring offerings by other companies.", "verified": true, "helpfulness": "2/2", "author": "MRB"}, {"rating": 5.0, "review": "Bought this as a refurbished unit and it works great!  I was concerned with the speed of the interface since it was a stick but it seems faster than my Roku 2 XS that takes up more space behind the TV.  I have both Rokus and Chromecasts and I highly recommend both.  But if I could only get one, it would be this Roku stick.", "verified": true, "helpfulness": "0/0", "author": "rod"}, {"rating": 1.0, "review": "Defective remote control which makes the roku useless.", "verified": true, "helpfulness": "1/1", "author": "Ginger"}, {"rating": 3.0, "review": "Need a really strong wireless.  Not too happy.  My wiired roku is awesome", "verified": true, "helpfulness": "0/0", "author": "Mark Jean"}, {"rating": 1.0, "review": "It's slow when it loads up and it takes to long to open up...don't like it and want my money back.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 3.0, "review": "I would be happy with streaming stick if the remote wasn't such a pain..Have to reset it often.", "verified": true, "helpfulness": "1/1", "author": "Ms Carrie"}, {"rating": 1.0, "review": "It already broke the remote won't work and I have to keep resetting it just so the roku turns on", "verified": true, "helpfulness": "1/1", "author": "Rene Ibarra"}, {"rating": 5.0, "review": "Works great . VERY LIGHT", "verified": true, "helpfulness": "0/0", "author": "John W."}]