[{"rating": 4.0, "review": "Does everything claimed.  But it is a bit slow adding channels and browsing Youtube without a keyboard takes lots of patience.", "verified": true, "helpfulness": "1/2", "author": "Trung N."}, {"rating": 4.0, "review": "I am very happy with the roku streaming stick, I had no trouble setting it up and it worked right out of the box. The quality of the video and audio is very good.I have only two issues with it:- Netflix is very slow, it can take up to a minute for it to start up, a problem that I haven't encountered with other channels.- Sometimes it appers as if the TV has \"lost\" the signal from the roku (ie. you get \"snow\"), and the image starts up again. I have the impression that this is due to a power issue, but I'm not sure.All in all, I would definitely recomend it to someone that has a wall mounted TV or that ust doesn't need all the power features that the other models have.", "verified": true, "helpfulness": "0/0", "author": "tamiby \"tbreque\""}, {"rating": 4.0, "review": "The streaming stick is good. Must be right near the router to catch WIFI initially, but overall a good device. I love that it syncs right up with my iphone which already syncs with the home roku. I also like that it travels well. Buying another for a friend.", "verified": true, "helpfulness": "0/1", "author": "MonetDM"}, {"rating": 1.0, "review": "Thank you Amazon for your return policy. Stopping pairing with remote after two weeks. Tried all Roku help, nothing worked. Unit gets extremely hot.  Stick would not fit my HDMI port until I bought an elbow adapter. Very slow to load and then would buffer even  with Verizon's 50 MBs router. A great idea but too many bugs. I have the regular Roku and it works fine.", "verified": true, "helpfulness": "30/34", "author": "Dr. H \"Dr. H\""}, {"rating": 5.0, "review": "I got tired of plugging my laptop into my 46\" Samsung flat screen to watch MLB.TV.  So when this product came out, I figured I would give it a try.  Set up was straight forward.  I followed the instructions provided for the hardware set up and created a Roku account for myself.  The Roku plugged in nicely to the HDMI2 port and the power cable into the USB port.  I downloaded the MLB.TV app and after linking the device to my MLB account, I was in business.  Wow!  The picture quality, including color and resolution, far exceeds anything I obtained using my laptop.  I also have no buffering issue which used to plague me from time to time when using the laptop.  I'm going to assume that the ability of this device to see my 5 GHz network while my laptop could only see my 2.4 GHz network might have something to do with this.  I currently use AT&T; DSL (6 Mbps).As others have noted, make sure that you change the default screen resolution of the device from 720p to 1080p, if your TV supports it.", "verified": true, "helpfulness": "0/0", "author": "J. Buckley"}, {"rating": 5.0, "review": "I had been considering purchasing a Roku or other streaming device for some time and when the new Roku stick was introduced with almost all the bells and whistles of the most expensive Roku unit at half the price at Amazon, I jumped. One of my better decisions. I am thoroughly enjoying searching of the many, many channels available and have begun watching Netflix and Acorn feverishly.The stick was easy to install and works effortlessly. I think it was designed for non-techies like me. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Robert A. Olson \"Opera Nut\""}, {"rating": 5.0, "review": "Wo the size is amazing and the quality is fantastic, I couldn't be happier. I would totally recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "David M Parker"}, {"rating": 3.0, "review": "it takes too long to load, otherwise the streaming has a lot of potential. Need more live streaming channels including news", "verified": true, "helpfulness": "0/0", "author": "Wayne W Sayler"}, {"rating": 2.0, "review": "Very excited to get Roku. Got it and it wont fit into the hdmi space on my tv. I have to spend more money to get a hdmi extension now. The cheaper chromecast includes one.", "verified": true, "helpfulness": "1/1", "author": "D Man"}, {"rating": 5.0, "review": "Especially compared to the Chromecast this thing is vastly superior and only $15 more. I cannot believe all the functionality you get with the remote and access to so much content. Plus it is so small! Kudos to Roku for this device.", "verified": true, "helpfulness": "0/0", "author": "MarkyMark"}]