[{"rating": 4.0, "review": "Great product, but I wish the cord that connects the adapter to the plug in was a bit longer. Thankfully I was able to use the USB port on my TV to plug the device in and did not have to try and run an extension cord to reach the wall outlet.", "verified": true, "helpfulness": "0/0", "author": "Anthony D. Hubbard"}, {"rating": 1.0, "review": "This thing locks up and is very slow.  Not sure why it locks up but I have to reset it or take the battery out of the remote control to get it working again.  This is not at all what I expected.  In addition, much of the content seems to require payment or is dated or just short clips.", "verified": true, "helpfulness": "0/0", "author": "personal_reviewer"}, {"rating": 2.0, "review": "The Roku Streaming Stick would NOT connect to my Wireless Comcast internet service - I spent 90 minutes on a Chat Session with Roku and then another 2 hours after calling their Direct phone number.  Finally the girl told me that i would need to call Comcast and they would have to change the internal setting in the Comcast modem.  I sent the Roku back the next day and ordered Amazon Fire TV - I was able to install the Amazon Fire TV  in 5 minutes.  Glad i sent the Roku back because the Amazon Fire TV is working Great", "verified": true, "helpfulness": "0/0", "author": "WM. KALISZ"}, {"rating": 5.0, "review": "Very easy to use and works great", "verified": true, "helpfulness": "0/0", "author": "Donald Rosebro"}, {"rating": 3.0, "review": "Slow", "verified": true, "helpfulness": "0/0", "author": "Max"}, {"rating": 1.0, "review": "Serious waste of money and time, I spent 3 days trying to convince this product to operate. It is a production fail and should only be purchased as a torture device. It does not connect to the network and is not compatible with TV's that are advertised as being stick compatible.", "verified": true, "helpfulness": "0/0", "author": "Paul R \"Fall of the Republic\""}, {"rating": 4.0, "review": "Works perfect!!!", "verified": true, "helpfulness": "0/0", "author": "M. Rosario Rodriguez \"babysitter\""}, {"rating": 5.0, "review": "works amazingly, i prefer it over the chromecast", "verified": true, "helpfulness": "0/0", "author": "Gamer4life83"}, {"rating": 5.0, "review": "Excellent Product and great price", "verified": true, "helpfulness": "0/0", "author": "Stephen C Davis"}, {"rating": 5.0, "review": "Plugged it in to the tv, followed the on screen instructions, and it was ready to go in no time at all. Nice remote came with the Wi-Fi stick, but can also use my iPhone or iPad. The number of channels on Roku can be somewhat daunting and I still haven't finished my selections.", "verified": true, "helpfulness": "0/0", "author": "GrandCanyonGal"}]