[{"rating": 2.0, "review": "I already own a Chromecast and Amazon Firestick so I wanted to see what the Roku Streaming Stick was all about. Read reviews that it has one of the best UI's off all the streaming devices out there. Bought it, got it home and was excited to plug it in and check it out. Entered my wifi information so i could activate the device. Strike One...could not reach Roku's server for authentication. Was online with Roku Support for about 30 minutes trying everything but it was pretty much their server being the issue. So the Roku Stick i just got, i couldn't even use. Finally i was able to connect to the Roku server the next day and start enjoying it. About 15 minutes into playing around in the menus the control stopped working. Hitting the sync button did nothing so i figured maybe the batteries it came with were old. Swapped them out, started working again. Next time i used the Roku Stick...about 15-20 mins in again the remote stopped working. No way fresh batteries could be the problem again. Finally looked up and read other people having remote problems. Only solution out there was to reboot the Roku and re-sync the remote. Yeah, i spend $50 for a streaming stick that I have to constantly reboot to have the remote perform correctly. No thanks. Returned.", "verified": false, "helpfulness": "0/0", "author": "Rich from the Poconos"}, {"rating": 4.0, "review": "Very nice little gadget to have for the home.  Nice to be able to stream Netflix, Hulu, You tube and WWE Network to any HD device in the house.Word of caution make sure that your home network is fast and you may experience issues when in an apartment that is loaded with Wireless signals.  Try to find a wireless channel that is not as busy to get the best results.  The Stick itself works as advertised, very easy to set up and easily able to input your streaming service credentials and start watching Netflix and WWE in a few minutes", "verified": true, "helpfulness": "0/0", "author": "Michael Brinkman"}, {"rating": 4.0, "review": "Had a bit of a hard time hooking it up but works great", "verified": true, "helpfulness": "0/0", "author": "Vicki"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Mark Risley"}, {"rating": 5.0, "review": "Love the Roku,", "verified": true, "helpfulness": "0/0", "author": "Jungo"}, {"rating": 3.0, "review": "A nice unit, but the reconditioned one I got would not insert all the way into the HDMI port. There were two tabs on the Roju dongle that when inserted into the HDMI socket, were pushed out so it would not seat all the way in. Finally bent them back in, but still had problems. Just removed them, and then all was fine. A bit frustrating. I don't know if they're all like this, or only the reconditioned ones. Otherwise, I like it.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 4.0, "review": "A great way to watch Prime video.  I planned To use it in my bedroom but I go to sleep to YouTube playlists and this device continues streaming all night. If it had a stop timer it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "j b"}, {"rating": 4.0, "review": "Bought as a gift for my mom who has a small apartment so no trouble with WiFi signal.  Not as fast as a regular Roku3, but it works great for her to watch Netflix.  I haven't experienced any trouble with it at all.", "verified": true, "helpfulness": "0/0", "author": "DMR"}, {"rating": 5.0, "review": "My mother uses it daily ! Easy to set up...just hard to put down.", "verified": true, "helpfulness": "0/0", "author": "lisa j marino"}, {"rating": 5.0, "review": "I am satisfied 100 %", "verified": true, "helpfulness": "0/0", "author": "David \"David\""}]