[{"rating": 1.0, "review": "Fits only for the us market can't buy apps and streams", "verified": true, "helpfulness": "0/0", "author": "amos"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Videohog\""}, {"rating": 2.0, "review": "Very inconsistentSometimes not worth the effort  of figuring out which fix it method will work", "verified": true, "helpfulness": "1/1", "author": "Betsy Minton"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "MikeRichmond"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "brandi Frantzen"}, {"rating": 5.0, "review": "Work great!  My 78 year old mom can use it.", "verified": true, "helpfulness": "0/0", "author": "Dennis K"}, {"rating": 4.0, "review": "Bought this to use for the Miracast functionality and that it can get the TWC channel app. It works great on my TV because I don't have cable in my room, and Miracast is awesome for streaming, only. The best part of it is you get all these things for the price of 40$ (at the time I bought it) which makes it the cheapest Miracast adapter out there (the next up are dedicated mostly dedicated Miracast dongles, so no internet TV support, and the FireStick doesn't support all Miracast devices yet). The only problem is how slow the darn thing is. The best workaround is probably to leave it plugged into a socket so it stays on and is ready to go when you turn on your TV, otherwise you're going to have to wait for it to boot each time will leave you popping two bags of popcorn before you can even watch anything.", "verified": true, "helpfulness": "0/0", "author": "J-Chord"}, {"rating": 5.0, "review": "LOVE IT FOR STREAMING.", "verified": true, "helpfulness": "0/0", "author": "Sandra Chambers-Rohling"}, {"rating": 1.0, "review": "Not as easy to install as one might think when you are over eighty. There is a learning curve and I am still learning. I did get House of Cards on our TV which is what I was after. So far so good. Press onward.", "verified": true, "helpfulness": "0/0", "author": "maurice Charlat"}, {"rating": 5.0, "review": "Awesome device, great channel selection.  I do recommend buying the protection plan through amazon, it only comes with a 90 day warranty and I have had a few software update scares.  If it gets a bad update and bricks outside of the 90 day warranty you have to buy a new one for $50.  Its worth it to pay $7 for a 3 yr warranty.", "verified": true, "helpfulness": "0/0", "author": "Dennis Smolinski"}]