[{"rating": 5.0, "review": "Good price for all the channels i can now watch.", "verified": true, "helpfulness": "0/0", "author": "Steve R. Ferrier"}, {"rating": 4.0, "review": "So awesome! I love my Roku so much! However, I'm only giving it four stars because the remote sucks. When it's working, it's fine, but I frequently have to take the batteries out and reset it to get it to work. I did download the remote app on my iPhone and that works pretty well.", "verified": true, "helpfulness": "0/0", "author": "Christina K. OGrady"}, {"rating": 5.0, "review": "I purchased this one as a gift for a friend but I have one I have been using for about 6 months now and absolutely love it!  Thousands of movies and tv shows for FREE!!! No monthly bill, no cable needed.  All you need is a television with an HDMI port and a wifi connection.", "verified": true, "helpfulness": "0/0", "author": "Kenneth F."}, {"rating": 5.0, "review": "I love my Roku!!! Saves me tones of money and so easy to use! I have one for every TV and we all love it!", "verified": true, "helpfulness": "0/0", "author": "Lindsey Smith"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "phillip shelton"}, {"rating": 5.0, "review": "Works Great.", "verified": true, "helpfulness": "0/0", "author": "mark thomas"}, {"rating": 5.0, "review": "This is the best device we have purchased in years.  Love Netflix, Hulu Plus, AmazonPrime, Acorn Tv.  No need for cable or dish.  They will be out of business, just like the Video Stores.  Easy to install, great pic.", "verified": true, "helpfulness": "0/0", "author": "Truth"}, {"rating": 5.0, "review": "This is the first Roku Streaming Stick I've purchased. I have a Roku 3 on my living room TV and bought this for the bedroom TV. It works just as well as the Roku 3 in every respect. A heck of a value!", "verified": true, "helpfulness": "0/0", "author": "Maine Rick"}, {"rating": 5.0, "review": "Why, oh why, did I not get one of these sooner! Love it.", "verified": true, "helpfulness": "0/0", "author": "Marjie \"Marjorie Roberts\""}, {"rating": 5.0, "review": "Love it.  Small, uses Wi-Fi.", "verified": true, "helpfulness": "0/0", "author": "Evan Newton"}]