[{"rating": 2.0, "review": "I don't really see what all the fuss is about. I didn't notice many great shows I couldn't already watch through cable. Plus it seemed a bit of a hassle to go through all the options to find shows you like. The stick also was scorching hot after a couple hours.", "verified": true, "helpfulness": "0/0", "author": "Samantha Wright"}, {"rating": 3.0, "review": "The apps and capabilities of the Roku Stick are excellent.  I use it a lot for watching Netflix and Amazon Instant Video.  I do have two complaints, hence the 3 stars.  The remote is rather poor.  It really does not connect to the Roku very good.  I am constantly clicking multiple times trying to get it to do what I want.  The other issue is the internet connection.  Even if it ends up working well, getting it connected to the internet via the router is difficult.  It repeatedly fails the connection.  I think in general, it has a poor wireless chip or something.  Other devices connect just fine right next to it, but it seems to struggle.", "verified": false, "helpfulness": "0/0", "author": "J. Chapman"}, {"rating": 4.0, "review": "Wasnt sure at first if we would really get the usage we thought, but after a little patience and finally getting comfortable with Netflix and Hula...ROKU is awesome. Cant wait till my contract is up for our cable service so that we will be 1 less monthly bill, FREE..", "verified": true, "helpfulness": "1/1", "author": "lucas"}, {"rating": 5.0, "review": "This was a gift and the recipient loves the Roku 3500", "verified": true, "helpfulness": "0/0", "author": "signall"}, {"rating": 4.0, "review": "Works very well. Seems to be just a touch slower in terms of navigation than my Roku 3, but the streaming has no problems. Love the roku!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Work's well,as good as my old Roku,without all the ugly wires.Happy with purchase and price.", "verified": true, "helpfulness": "0/0", "author": "Jeffery Ross Harris"}, {"rating": 5.0, "review": "it is perfect", "verified": false, "helpfulness": "0/1", "author": "john tamas"}, {"rating": 5.0, "review": "Insane fantastic deal", "verified": true, "helpfulness": "0/0", "author": "Christopher S. Daigle"}, {"rating": 3.0, "review": "Occasionally freezes. Haven't yet determined a consistent recovery process.", "verified": true, "helpfulness": "0/0", "author": "Dan Eastman"}, {"rating": 1.0, "review": "I own several Roku boxes and thought I would pick up a Streaming Stick for when I travel. I was already taking one of my Roku boxes with me and figured this would be a bit smaller and size matters greatly to me since half my trips are via motorcycle.It turns out this is a horrible device that is completely and utterly unusable. Copy protection on HDMI has rendered this worthless. I have had a similar issue with some of my Roku boxes, but swapping HDMI cables or rebooting the box and/or TV has aways fixed it. There is no cable to swap with the Streaming Stick. Rebooting it hasn't worked. Unplugging the TV and Roku boxes so they can renegotiate the encryption hasn't worked. The main menu displays fine, but as soon as you actually try to play any content then the screen goes purple and no video is displayed. I have yet to find a TV that works, including TVs that have no problem working with the Roku boxes.Now, the Roku boxes are decent and if this worked as well as one of them then I would give it a 3 star review. There are still several factors that keep it from earning 4 or 5 stars. The interface is noticeably slower than my other Roku devices, it doesn't have any other connectivity options other than HDMI, no memory expansion slot for storing additional channel data. The remote doesn't have the motion sensors, nor does it transmit audio like the Roku 3. I knew all of this when I bought the device, but they all take away from the experience offered by the other Roku devices. Also, Roku doesn't provide an HDMI extension cable (like Google does with the Chromecast) in the event that the device won't cleanly mount directly into the socket on the TV.In the end, I see no reason to recommend the Streaming Stick. If it worked properly and didn't punish people who actually purchase their content by refusing to play their movies then I might bring myself to recommend one. However, an actual Roku box offers a much better experience than the stick could ever provide.", "verified": false, "helpfulness": "4/4", "author": "Michael Bishop"}]