[{"rating": 5.0, "review": "No good reviw", "verified": true, "helpfulness": "0/0", "author": "angeljulioresto"}, {"rating": 3.0, "review": "Stick is great, setup is a breeze, remote sucks. Must have the app downloaded to run the device.", "verified": true, "helpfulness": "0/0", "author": "Susan Summers"}, {"rating": 5.0, "review": "I was slightly skeptical about having this unit on the second floor. Works flawlessly and the wife is happy she can watch a show or movie before bed.", "verified": true, "helpfulness": "0/0", "author": "Brian Roach"}, {"rating": 5.0, "review": "Works exactly as advertised.  Now I can binge watch in one room while my sweet baboo watches sports in another.  Marriage saved, murder avoided!!", "verified": true, "helpfulness": "0/0", "author": "Barbara Valentine"}, {"rating": 1.0, "review": "It does not work.  It worked great the first week and then stopped.  I accidentally delayed returning it before the deadline.  Very unhappy and wish I'd gone with the Apple TV.  Much better product.", "verified": true, "helpfulness": "0/0", "author": "matthew atkins"}, {"rating": 3.0, "review": "The remote connectivity seems to come and go.", "verified": true, "helpfulness": "1/1", "author": "TheBillyGoat"}, {"rating": 4.0, "review": "This is my third Roku product I have purchased.  The original or legacy model, call it what you want, has been retired and replaced with a Roku 3 some time back.  Other than some minor issues with the remote I love this device.The Streaming Stick was recently purchased to use with a Samsung Smart TV in the bedroom.  Now you might be thinking if you have a Smart TV, what need do you have for a different Streaming device? If you have any experience with Samsung's Smart Hub, which you have to use to stream content, you know the answer already.No more endless waiting for updates every time you turn the stupid thing on. And when you only watch about 45 minutes before lights out, the reasons are clear.So far, this Roku device has performed up to the standards I demand from my Roku 3.  The only thing I'm not crazy about is the feel of the remote control. Probably just too used to the 3 remote I guess.This device was chosen as the TV is mounted high up on the wall and would have required me to take it down to install a 3 mount so the Stick was a no brainer to install.", "verified": true, "helpfulness": "0/0", "author": "Gary & Lucy Webb"}, {"rating": 1.0, "review": "In the middle of activating service, the remote stopped working. I unplugged the power to the stick to reboot, abd out new batteries into the remote, but no luck. ( note tge included batteries were dared Jan.2015). I tried to call Roku abd gave up waiting after 25 minutes. I didnt even get far eniugh aling in the set up to add my TV to Hulu and use my ipad as remote. So i will return the device. Unsure if i will try a Roku 2 instead.", "verified": true, "helpfulness": "1/1", "author": "Careful shopper"}, {"rating": 5.0, "review": "I already own a Roku 2 and a Samsung Smart TV.  I like this interface better than both of those, and love being able to watch my favorite shows and movies on Amazon Prime and Netflix.  I like its compact size even better (and really have no use for the game controller ability of the Roku 3).", "verified": true, "helpfulness": "0/0", "author": "m&m"}, {"rating": 3.0, "review": "I love Roku, but I'm not wild about the stick. Compared to the Roku 3 we have in the living room it is slow. Once the streaming starts it is all the same but navigating the menu or entering info on the text screen is slow and can be annoying at times. It also takes longer to start streaming. It's not a huge difference, but enough to make me appreciate using the Roku 3 as the main streaming device.", "verified": true, "helpfulness": "0/0", "author": "Tech Teacher \"Tech Teacher\""}]