[{"rating": 4.0, "review": "I would like to give this product 5 starts, however the remote control just sops working frequently for no reason.  The roku phone app however has a remote control that works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Ryan Anderson"}, {"rating": 5.0, "review": "We had original Roku's set up on two of our tvs, however, after mounting one on the wall we needed a solution for the Roku.  Not being able to find a cheap mount for the oldest Roku model, I decided $49 was a reasonable price to pay for a new one that would not require being mounted behind the tv.  We love the other Roku's but after reading the reviews, I was a little concerned about its performance. We also have a Chromecast that has terrible streaming issues and is rarely used; I was worried we might have similar problems with this little device.  Not at all!  In fact, so far, this Roku had performed better than our older ones and light years better than the Chromecast.  We had no problems with setup and the only issue was that Netflix took a minute or two to load but once it was open, streams with absolutely no problem.  I can't recommend the Roku stick enough, I'm incredibly pleased with its performance and it's wonderfully hidden behind the tv.  If we needed  more Roku devices, I wouldn't hesitate to order another one.  We've been loyal to Roku for several years and this stick reaffirms why.", "verified": true, "helpfulness": "1/1", "author": "Rhiannon C. Morgan"}, {"rating": 4.0, "review": "I recently decided to drop the basic cable service I've had for years, so I was looking for a way to still get some additional channels beyond the regular over-the-air channels without spending a lot of money.  For $50, trying the Roku seemed like a worthy experiment.Setup was easy, and lucky for me, my TV has a powered USB port so I didn't need to plug the Roku into a power outlet in the wall.  I was able to find a Roku remote control application for my Windows Phone that works great and provides a keyboard so searches are much easier to type in.For most browsing, the device seems fast enough.  The start screen loads pretty slowly, showing \"ROKU\" for what seems like well over a minute.  Some channels, like YouTube, also load rather slowly but are relatively fast after the initial load.  If speed is an issue for you, perhaps the Roku 3 would be better for you.One feature I like about the Roku is that I can finally rent ($) and stream good, current movies instead of just the old, B-rated junk movies that Netflix and Amazon allow you to stream w/o Roku.  It would be nice if I didn't need to create an account for every place that rents movies, especially since Roku already has my PayPal info... I'd prefer if they dealt with who gets paid for the movie rental payments.As for free content, well, that's where I'm a bit disappointed and dropped the rating to 4 stars.  There is plenty of free content, but I found very little free content that I actually want to watch.  That's not Roku's fault, but part of the reason I bought the device.", "verified": true, "helpfulness": "0/0", "author": "T. Taylor"}, {"rating": 1.0, "review": "Mine keeps restarting.  Sometimes it gets into an endless loop of restarts.  sometimes I can get a netflix movie up and running, then after it runs awhile, it restarts.  I tried powering it from the USB port on a Samsung TV, then from an external power supply, and I tried both HDMI ports on the TV, all with the same result.  Sending it back and waiting a year when Streamstick 2 comes out and the bugs are squashed.  Right now it's useless.", "verified": true, "helpfulness": "18/24", "author": "Spydie"}, {"rating": 5.0, "review": "After getting this little guy I would be inclined to get rid of my other Roku's, just so I could get more of these ones.", "verified": true, "helpfulness": "0/0", "author": "Patrick Mc \"Patrick\""}, {"rating": 5.0, "review": "I am so glad to finally be able to watch my Amazon Prime movies on my flat screen tv thanks to the roku!  It was so easy to install and it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Janet A. Panagoulis"}, {"rating": 5.0, "review": "finally got it working runs well,Too much security with all the codes that need to be entered for each app.!", "verified": true, "helpfulness": "0/0", "author": "Gary Paraschak"}, {"rating": 1.0, "review": "I thought I'd be able to accumulate all my pay services (Amazon Prime, Netflix, HBOGO) on one device, plus it has 1000s of channels. Wrong. I live in Chicago, 3rd largest market in America, and Roku says adding channels isn't in my area yet. Sure. I bet its more the fact I use Comcast as a net provider. But, anyway I couldn't add any of my paid services, none, zero, zip. So I checked out the 1000s of channels. Its more 1000s of suck. There are maybe a few movies I'd want to watch that I don't have in the services mentioned above, but do I wanna spend a hour with a headache looking for them. Luckily for me I only got the stick dingle and spent the least amount of money on a mistake. Hopefully you'll read this and not make one too.I want to add that this stick interferes with my smart TV and Chromecast when trying to use my iPad to control them. The iPad sees neither. So, another negative.", "verified": true, "helpfulness": "2/9", "author": "Eric \"Audio enthusiast\""}, {"rating": 3.0, "review": "Plug it in, provide account info, and start streaming. I did not have a problem inserting into Vizio tv's HDMI port. The remote works well, occasionally have to hit button more than once but this is the same as the Roku HD2 remote we have on another set.But, after the power went out, I noticed that my mobile devices did not connect to Wifi because the only wireless connection was the Roku hot spot!  Repeated attempts to get my home's Wifi up and running were fruitless. Thankfully, I still had hardwired internet so I checked the Roku forums and noticed that other people had this problem with the Roku 3 but that was quite a while ago. I contacted Roku via online chat and essentially was told it was a problem with my system. I am now replacing my 7-year-old router and hope I can get all devices working. Needless to say, I'm not network-tech savvy enough to fix or do a work-around but I think my router was not capable of handling two Roku's, two iPhones, and iPad.", "verified": true, "helpfulness": "0/0", "author": "Debbie Ford"}, {"rating": 5.0, "review": "I wish I'd ordered it sooner. The Roku is easy to set up and use, there are many free channels to go along with paid services, the search function is great, and the interface is very easy to use. The remote is a nice touch. I would recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "kcruser"}]