[{"rating": 5.0, "review": "The Roku 3500R worked exactly as expected. It was very easy to connect to an HDMI port and to a power outlet, and once initialized it allowed us to access all of the usual download sites. We expect to use it on two TVs that are not connected to a Time Warner cable box, and our experience shows that it works fine for accessing Amazon Prime and other sites.", "verified": true, "helpfulness": "0/0", "author": "Michael Kraft"}, {"rating": 2.0, "review": "It would not work on the TV we would watch it on.  The registration process was a mess.", "verified": true, "helpfulness": "0/0", "author": "Joanna Brackin"}, {"rating": 4.0, "review": "Fast enough. No lagging..easy to use .great overall!!", "verified": true, "helpfulness": "0/0", "author": "wadlin roberty"}, {"rating": 4.0, "review": "Works pretty good.", "verified": true, "helpfulness": "0/0", "author": "brian"}, {"rating": 4.0, "review": "Suited my purposes.  Working fine.", "verified": true, "helpfulness": "0/0", "author": "Lorraine Fischer"}, {"rating": 2.0, "review": "Nice that its small and plugs right in, but the lag on it makes you want to go look out the window rather than watch anything on this Roku.. I have a Roku 3 and I love it, spend the money and get a upgraded one.", "verified": true, "helpfulness": "0/0", "author": "Keems"}, {"rating": 4.0, "review": "It works well, but is a little slow compared to the Roku box. Good for a second TV.", "verified": true, "helpfulness": "0/0", "author": "CruisingSailor"}, {"rating": 5.0, "review": "it's dual band wireless compatable coupled with a Links Active Hdmi to VGA adapter turned an old VGA monitor and an old set of old computer speakers. I turned into a wonderful mini home theater in my bedroom.Works great no line of sight need for the remote, it uses bluetooth to the roku stick. a real plus for my needs", "verified": true, "helpfulness": "0/0", "author": "Ernest G Kolar"}, {"rating": 4.0, "review": "My problem with the Stick was owning two Roku 3's first.  The stick is slower and requires a stronger WiFi signal.  It also requires a power cord that, if you are lucky, can plug into your sets USB port.  My port wasn't powerful enough to operate the stick satisfactory (pauses, lost WiFi signal) so I had to use the included power converter.  I also had to use a Hdmi right angle adaptor so the stick would not lie against the back to the set and overheat.  If you have a strong WiFi signal, don\"t need a gaming remote, and like the lower cost then you'll be happy with the stick.  Otherwise spend the extra money, get a RoKu 3 and Velcro tape and mount the 3 on the back to the set.", "verified": true, "helpfulness": "1/1", "author": "Michigan Larry"}, {"rating": 4.0, "review": "Working as expected. been happy with it so far.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"thorinn\""}]