[{"rating": 5.0, "review": "Still playing around with it, not too hard to set up for a 61 year old woman!", "verified": true, "helpfulness": "1/1", "author": "michele domoracki"}, {"rating": 5.0, "review": "This is the best device on the market for transforming your TV into a smart TV. I have purchased for family and friends.", "verified": false, "helpfulness": "0/0", "author": "Miss Walker"}, {"rating": 3.0, "review": "I though it would be great to be able to stream Amazon Prime music to my TV in my living room. I was thrilled to see that the Roku stick had Amazon apps, and streaming Prime music to my TV was the #1 reason I purchased the Roku stick. Unfortunately, it seems I have not been in Amazon's streaming world long enough to distinguish between Amazon Music and Amazon Prime Music, or similarly, to know that the Amazon Music app on the Roku stick is not all-encompassing and does not stream Amazon Prime Music. Maybe I should have known better? On further investigation, I can add up to 250,000 songs to my Amazon Music library for $25.00/yr. When does the money grabbing end? Well, I refuse to participate, so back to the other free streaming apps I go... (insert sound of flushing money down the toilet here.)", "verified": true, "helpfulness": "0/1", "author": "Canoetripper"}, {"rating": 1.0, "review": "The Roku streaming stick is junk. Remote doesn't respond well. The interface is slow to populate with images. Could not get Vudu to stream HDX or HD. The content had to keep buffering. I have no issues using my Surface Pro tablet in the same area, so its not my Wifi. Go for the full size Roku. I'm sending the Roku streaming stick back to the store.", "verified": false, "helpfulness": "0/0", "author": "MadmaxAmazon \"madmax\""}, {"rating": 2.0, "review": "The unit build is solid. However it has many software issues. It will never stay connected to router. Many times it fails to connect all together. I think this is caused because the wifi antenna is too small on this device. Have it on a closer tv and it works better. Resets itself all the time. I want to love it but I cant. Broke down and bought a Roku 2. Fixes all the issues.", "verified": false, "helpfulness": "0/0", "author": "David Baizley"}, {"rating": 5.0, "review": "This is our second ROKU streaming stick & it is now plugged into our second TV. I had the original (first on your block) ROKU box & loved it for its capabilities. The new ROKU boxes are more capable than the stick, but still require a separate power outlet and a cat5 connection on our router. In the case of the stick, it plugs into the TV's HDMI slot & the power cable plugs into the TV's USB port. No muss, no fuss.", "verified": true, "helpfulness": "0/0", "author": "David Ecale"}, {"rating": 3.0, "review": "It works ok. Very easy to install. Bad thing is that it's very slow. It takes a while to start up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Very confusing to figure out how to use it. And, as we already have Netflix and Amazon Prime, it doesn't tell you how to log into your already existing account. Have NOT even used it yet, because I don't want to be charged twice for the same service.", "verified": true, "helpfulness": "0/0", "author": "Heather Hill"}, {"rating": 4.0, "review": "Works as advertised. Sometimes there is a minor delay in buffering when viewing items on Netflix. But I sometimes have the same issue when viewing on my tablet, so could be an issue with my Internet connection.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "Can't wait to see how it works, but my daughter loved the stick!", "verified": true, "helpfulness": "0/0", "author": "Stuart Morrison"}]