[{"rating": 4.0, "review": "Works well , easy to use - generally pleased with item.", "verified": true, "helpfulness": "0/0", "author": "Curtis J. Starkey, Jr."}, {"rating": 5.0, "review": "Getting smaller and smaller, same amazing performance!", "verified": true, "helpfulness": "0/0", "author": "islandgirl"}, {"rating": 5.0, "review": "I have trouble dragging myself away from the TV!So glad we \"cut the cord\" and got Roku!One evening the signal got \"stuck\" and I searched for Roku CS online, found the live chat, was on hold for13 minutes (it was prime time) and they walked me through fixing it in less than 2 minutes!So many programs with Roku and Amazon that were originally on HBO or Showtime, and great movies, too!", "verified": true, "helpfulness": "0/0", "author": "L. Rockhold \"KeikoasMom\""}, {"rating": 5.0, "review": "This is our second Roku, but our first Roku Stick.  Even though this is my husband's \"toy\", it is user friendly for the rest of us that live with him.  Our 5 year old can access it without our help (he only uses it for PBS Kids).  For me, the menu is simple and ad-free which makes me HAPPY!  We use the Amazon Prime and PBS Kids apps the most.", "verified": true, "helpfulness": "0/0", "author": "Baptist Girl Cooks"}, {"rating": 3.0, "review": "No more cable YEAH!!!!!!!!", "verified": true, "helpfulness": "1/1", "author": "Louize"}, {"rating": 5.0, "review": "I can't imagine an easier to use and more flexible product for streaming entertainment.  It is small, compact, fits easily behind my TV plugged into an HDMI slot and powered from a USB slot.  The interface is easy and great.  I highly recommend this streaming stick.", "verified": true, "helpfulness": "0/0", "author": "Dean in SC"}, {"rating": 5.0, "review": "BUY THIS THING!  Really, it's near perfect for my use.  Netflix is fast enough (thanks to the upgrade, which was already installed on the stick), Amazon Video works well, Plex runs VERY well on it, and channel support is outstanding.  Couldn't be happier!", "verified": true, "helpfulness": "0/0", "author": "Jessica Crafton"}, {"rating": 5.0, "review": "I love my Roku!  I can choose my TV viewing and watch Hallmark movies again.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Reilly"}, {"rating": 5.0, "review": "have gotten so much great use out of this, love it!", "verified": true, "helpfulness": "0/0", "author": "Holly Burgin"}, {"rating": 5.0, "review": "Nothing beats a Roku.", "verified": true, "helpfulness": "0/0", "author": "Frequent buyer"}]