[{"rating": 2.0, "review": "Problems with the unit since opening it... after an hour of trying to enable/activate it with no success, I had to call their tech support. Hold time was almost an hour. After giving the support person the ESN of the unit, it all of a sudden activated. I asked him what he did... his reply was \"nothing\". Hmmmm. Have had to reset (the button) at least twice in the month we have owned it. Unit also freezes often during menu navigation/selections.", "verified": true, "helpfulness": "0/0", "author": "Paul King"}, {"rating": 5.0, "review": "Excellent product. Use it daily.", "verified": true, "helpfulness": "0/0", "author": "Jarrod James"}, {"rating": 5.0, "review": "Easy to setup and loaded with features. It has opened new doors for TV viewing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"lhughes81\""}, {"rating": 5.0, "review": "I absolutely adore this little thing. It works beautifully, the channels (free and otherwise) and terrific, having Pandora in the system is wonderful, and I couldn't be happier. It's tiny, it fits easily behind my wall-mounter flatscreen, and I am totally buying another one for our bedroom. Set up was fast and easy - literally plug and play - and you can even use your iPhone instead of the included remote. I just ripped out all of my ugly cable co-ax cables, and I LOVE it!", "verified": true, "helpfulness": "0/0", "author": "PG \"Cabin Fever\""}, {"rating": 5.0, "review": "I am pleased with my Roku stick. Finding a refurbished one for a 10 dollar saving was a plus. It set up easily with my new. Roku ready tv.  I am amazed as to why anyone would spend so much extra for a \"smart\" tv when for 40 dollars one can purchase a stick and have the same thing. I have experienced none of the problems noted by buyerss with critical reviews.  No remote delays,  no netflix problems sound is fine and no registry problems with the various services.  Wifi connectivity was quick and pain free,  power worked with both USB port and wall adapter which i use so as to avoid rebooting delay Remote was heavy enough to add feel when using it.  Button placement was intuitive and easy to learn so eyes free operation was quickly possible.  It is solid and well made . It is easily operated without concern about precisley aiming it and response to commands is quick and accurate. It has great feel and a look of quality which isunusual with an electronic device in this price range.As with most critical reviews i think the issues described are not general problems with the product but limlted to lack of reviewers expertise or the rare defective item .I reccommend the refurbished product for the savings but would have bought it new if i had to.  The roku is compatible with most newer tv brands and some of the other similar products are not.  TCL  is not compatible with one of the major competitors for instance.", "verified": true, "helpfulness": "0/0", "author": "redcard \"redcard\""}, {"rating": 5.0, "review": "I purchased this refurbished unit and it arrived just like new in the original box. Setup was fast and easy and was exactly as advertised/expected", "verified": true, "helpfulness": "0/0", "author": "S. East"}, {"rating": 5.0, "review": "The Roku Streaming Stick was received and has been working flawlessly for more than two weeks.  This is our second streaming stick and was purchased to be used on our main tv as the first streaming stick is being used on a second tv.  We have a blu-ray player with the Netflix, Amazon Prime, Hulu Plus and several other apps, but the Roku Streaming Stick has so many more options and works so much better that it was well worth the price of purchasing another one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Got it very quickly and it came like new in the original box. Works perfectly! Use it everyday, I don't even miss cable!", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 4.0, "review": "This is my second Roku unit & it works great!", "verified": true, "helpfulness": "0/0", "author": "RB3"}, {"rating": 5.0, "review": "Works perfectly. Why pay full price....this is exactly what I paid full price for.", "verified": true, "helpfulness": "0/0", "author": "Michelle Hamilton"}]