[{"rating": 3.0, "review": "I had owned 4 different roku devices before picking up this one.Pros:- The small form factor and RF remote made for an excellent additional to my already packed entertainment system.- I was able to easily plug in the device into the back of my receiver and the USB power in as well.- The media buttons on the controller are a time saver.- Low cost of entry for a high definition device.Cons:- The device is slow after hours of viewing content. I have had to frequently exit to home or reset the device after marathon watching a series. I have not had to do this for any of my other roku systems.- Never lose the remote. If you ever lose your remote you now have a nice piece of plastic attached to the back of your TV or receiver. They do not stock replacements and no current remote will pair with it and the roku site does not list remotes that can pair with this device.If it was not for the issues with the remote for this device I would give it another star.", "verified": true, "helpfulness": "3/4", "author": "J. smith"}, {"rating": 5.0, "review": "It's great for any room. It has many different things to choose from. I liked that it was definitely delivered on time, too! :)", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 5.0, "review": "Works great. I will never subscribe to cable again. I also have a roku device for the bedroom tv.  I recommend this for the newer sets and the stick is hidden from view.", "verified": true, "helpfulness": "0/0", "author": "Kent"}, {"rating": 5.0, "review": "I received my Roku stick yesterday and within 15 minutes of having it plugged in I had all the updates and had logged into my various streaming accounts and was watching 1080p quality streaming directly to my tv.  I own an older DLP that does not have a usb port on it, but they send  you a regular wall plug with the stick so even if you don't have the usb you can still get power to your device no problem.  The only bad thing I have to say about this device is that it would be nice if you could program the remote to turn your tv on and off and a volume control button. Besides that I would most definitely purchase this item again and highly recommend it to anyone looking for a good streaming device. I have owned several over the past few years, from Blu-ray players that stream to a stand alone device and this one is hands down the best.", "verified": true, "helpfulness": "0/0", "author": "Beau"}, {"rating": 5.0, "review": "Family members had recommended use of ROKU to see movies and TV shows.  Opens up a new avenue for viewing.", "verified": true, "helpfulness": "0/0", "author": "Katherine C."}, {"rating": 1.0, "review": "Have not been able to connect, because of Roku's unique \"pinging\" communication system.  I also own both Amazon and Apple devices.  They were simple to connect.", "verified": true, "helpfulness": "3/3", "author": "Ivers W. Riley"}, {"rating": 5.0, "review": "This is a great product. It has the same features of a Roku box, but in a neat little plug in. It is fast and works just the same as the larger box.", "verified": true, "helpfulness": "0/0", "author": "Tamara"}, {"rating": 5.0, "review": "I love being able to watch netflix, hulu and othes directly on my tv.  Roku works great and this usb style is very handy because it doesn't occupy too much space.  I highly recommend it.  Once I saw how nice it was I promptly cancelled my NEtflix dvds and just left the streaming.  there is always something to watch.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"C. Velez\""}, {"rating": 2.0, "review": "I was excited when I bought my Roku 2 to see advertised a Roku streaming stick, coming soon. And better yet, it was only a few days away from being released! I brought the Roku 2 home, plugged it in and put it right to work. I thought if the new streaming stick is half this good we will be in business. Unfortunately it didn't quite live up to the hype...I didn't expect quad-core speeds or anything, but I also didn't expect it taking minutes to load Amazon or Netflix. I also didn't expect to have such a difficult time with set-up or staying connected to the internet. I had to factory restore twice and finally on the third attempt was able to get everything registered, but then when I would try to connect to Netflix, after about a three to four minute wait, it would give me a 'timed-out' message. I would check the wifi connection and it would say connected, with full strength signal. The connectivity test would show it connected to the local network, but only one in 10 tries would it connected to the internet. And even then, the connection would drop again. My TV is located 15 feet from my wireless router, with only a standard wall in-between (no steel or metal, no electrical wires or anything crazy running through that wall). I am really hoping maybe this is just a defect on my unit and can be replaced? Otherwise, its a nice small size, with USB power it fully conceals itself behind the TV. Thats about it though", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 3.0, "review": "I've been using a WD TV Live box in my bedroom with 6TB of hard drives attached for streaming, as well as streaming Netflix, Hulu, and content from my two NAS servers.  I also have a Chromecast that I tried out and like because of being able to work it with my tablet.  Never had an issue with either of these two devices.  So when I heard about the Roku Streaming stick, I decided to try one.  Now I wish I just would have bought another WD TV Live box. The ROKU's bootup time is similar to an Android TV stick, that is it takes flippin' forever. It does have the advantage of being able to connect to 2.4Ghz and 5Ghz WiFi though, but then again so does the WD TV Live box. I have my Roku stick on the 5Ghz channel, so streaming Netflix or Hulu Plus is lag free, and so far I haven't had any buffering issues. The Roku stick  is actually plugged into one of the HDMI inputs of my stereo receiver and works well there, but I do have to have the USB power cord plugged in all the time. Sound quality going through the HDMI is good.  Streaming with Plex leaves a lot to be desired, and I'm not about to pay $5 a month to stream my own content, so that is a major, major fail. Also not being able to use HBO Go and being a Comcast customer because Roku and Comcast can't agree on anything really stinks.For the most part, I regret buying the Roku Streaming stick.  My Chromecast gets a lot more work as I can use the Synology apps to stream HD content from my NAS servers, and the ROKU has to use PLEX, which stinks. My WD TV LIve, though a little more expensive even when on sale, does a whole lot more.  Granted, the ROKU stick and the WD TV live both have lousy remotes, both have Android and Apple apps that allow those devices to act as a control. The ROKU remote is the worst of all though.I'll keep the ROKU, but I will never buy another one. The Chromecast works better for streaming off Netflix, Hulu Plus and NAS streaming. ROKU has tons of channels that you can pay for, but for free content, and ease of use, it stinks folks. I am totally not impressed and regretting this purchase.", "verified": true, "helpfulness": "0/1", "author": "Bluesky5553"}]