[{"rating": 1.0, "review": "Sloooooowwww.... Had audio issues as well. It would playback very slowly and need to restarted. Now it just keeps rebooting.... Maybe the other Roku's are better?", "verified": true, "helpfulness": "0/0", "author": "James Jones"}, {"rating": 4.0, "review": "It works pretty well. set up was tricky because my wireless signal was weak. I called TWC and got it changed to \"11\" and that seemed to fix it. The remote is sluggish. Called Roku and there was no help on that. for some reason, on my Pana 27 inch 720p TV it only works on the HDMI 2 socket. not sure why but...", "verified": true, "helpfulness": "0/0", "author": "Arbo Unt \"bluesman\""}, {"rating": 5.0, "review": "Love it. Have it set up in detached garage with XFinity as service provider. Now I can watch my football and work in the garage too.", "verified": false, "helpfulness": "0/0", "author": "Christan Kramer"}, {"rating": 5.0, "review": "THIS LITTLE DEVICE WORKS WELL. I AM A AMAZON PRIME MEMBER AND HAD BEEN WATCHING OLD MOVIES AND TVSHOWS ON MY TABLET, NOW THANKS TO THE ROKU I CAN NOW WATCH THEM ON THE BIG SCREEN TV IN MY DEN.", "verified": true, "helpfulness": "0/0", "author": "SHARE WITH YOU"}, {"rating": 4.0, "review": "Bought this for other family members house they enjoyed getting channels from old movies a must have for some of her older parents", "verified": true, "helpfulness": "0/0", "author": "Scott Northup"}, {"rating": 5.0, "review": "Excellent purchase. I love it. Installation is quick and easy to follow, in no time you are up and running. If you don't mind that it does not cast with your IOS devices on Amazon prime movies, then you're good. It does cast with u-tube and Netflix, so that's great! It works well with your devices as a remote and controls from your devices. All in all, a wonderful product for those who don't care for cable, satellite and  direct TV.", "verified": true, "helpfulness": "0/0", "author": "Lauren Taylor"}, {"rating": 4.0, "review": "Easy to get operational, remote makes for easy use and its pretty stable - you have to reset it when it goes into an infinite loading loop - the reset button is small and on the USB stick. Other than that its been great.We use it for Netflix in Canada.", "verified": true, "helpfulness": "0/0", "author": "eddievisser"}, {"rating": 5.0, "review": "I purchased the streaming stick after reading many reviews. I am very happy with it so far. It's an affordable way to stream Netflix and other channels for those who don't have a gaming system. I like the remote, but it does go through batteries faster than most remotes. The Streaming stick was very easy to hook up. There are so many free channels it will take me forever to watch them all. I plan on ordering the Roku 2 for an older model TV in another room soon. If your looking to save money on those high cable bills this is the way to go!", "verified": true, "helpfulness": "0/0", "author": "doloras compton"}, {"rating": 4.0, "review": "I love that I can watch Amazon Prime properly on this, unlike with Chromecast where the audio still comes out of your computer. I think the only drawbacks with this are navigating the screens with the remote is a little annoying and I want to be able to change the quick buttons to channels that I actually use rather than their pre-programmed netflix/hulu etc.", "verified": true, "helpfulness": "0/1", "author": "SDW"}, {"rating": 5.0, "review": "I love it!! I was using my lap top with an HDMI cord to my TV to watch Netflix.  It was hours of use of my computer, couldn't use computer at the same time I was watching something, and I had an ugly cord hanging!  This is so much more convenient and I am not leaving my computer on  for hours at a time.I read many reviews about this before I bought it.  People talked about set up as though it were a problem?  It took me all of 3 minutes to plug it in, let it find my WiFi, and put my security code in.  It was up and running.  What I think people were talking about when they said set up, is the set up of the channels that you want to use.  That does take a while to find the channels that you want, and set those up for use.In order to use channels that are available through cable or satellite TV, like Disney or History, etc, you must have cable or satellite TV.  So, this is not a way around paying for those channels.  And that does take a lot of set up, as you have to obtain codes from your carriers to put in to stream the channels.  If you already have them with a service provider, I don't why you would want to stream them?  But, I guess people do.  This was one of the questions I had at the time of buying, that I couldn't get answered prior to my purchase.  PBS channels are free, and some off the wall channels are really free, but most of the channels there is something offered for free, then there is something  to buy, to get the full version.  Movie channels like Vudu and such are basically Pay Preview channels. You purchase what you want to see.I do not have cable or satellite TV, I do have a digital Antenna and get all the local channels of the major networks.  I do have a Netflix account, and I have purchased a tv series on Vudu.  I already get the channel that airs the TV series, but I have trouble being at home on the night that it airs, and by streaming it I avoid all the commercials.  By not paying the 40.00 to 100.00 a month for television with hundreds of channels that I could care less about, buying one series that I want to watch, and can do so at my convenience with out commercials is wonderful and thrifty in my opinion.The Roku makes this so convenient to do, much more so than using my computer.  I have had no problems with it, and have no complaints at all.  I do think that the speed of your internet probably would make a big difference.  One night I think my internet was slower for some unknown reason and it wouldn't play the movie in HDX, but that was a fluke, and a problem with my internet, not the Roku.For the price, if you have WiFi and you want to stream movie channels, like Hulu, Netflix, or Amazon Prime, you can't go wrong with the this Roku.", "verified": true, "helpfulness": "4/4", "author": "Pip1948"}]