[{"rating": 5.0, "review": "Functions perfectly.  Sonic shipping and unbeatable price.  Very satisfied with refurbished Roku Streaming Stick.", "verified": true, "helpfulness": "0/0", "author": "Layne Murphy (filmclip@aol.com)"}, {"rating": 5.0, "review": "Other than having a trouble getting it hooked up, once we did it has been wonderful.  My husband loved it.", "verified": true, "helpfulness": "0/0", "author": "Joey"}, {"rating": 5.0, "review": "Works great!  Love it!!!", "verified": true, "helpfulness": "0/0", "author": "loridori"}, {"rating": 4.0, "review": "The remote doesn't always work, but at least there's the option of using your phone. Otherwise it turns on pretty quickly and has all the streaming channels one would ever need. Love it!", "verified": true, "helpfulness": "0/0", "author": "Kaitlin Hughes"}, {"rating": 5.0, "review": "this is a great substitute for cable and at a much cheaper price", "verified": true, "helpfulness": "0/0", "author": "R Richardson"}, {"rating": 5.0, "review": "Great Gift, fast delievery!", "verified": true, "helpfulness": "0/0", "author": "Kerri L. Manseau"}, {"rating": 3.0, "review": "couldn't get it to work, so it was returned.  Already having one ROKU and being very happy with it, I decided to buy this second one.  The returned item has been replaced by a good ROKU which came right on line.  I really enjoy the ROKUs because it gives TVs on basic cable (like in my garage or office) a smart capability.  I especially like being able to subscribe to MLB.com so I can watch ALL of the SF Giants games while living in Virginia.", "verified": true, "helpfulness": "0/0", "author": "John C. procida \"John C\""}, {"rating": 5.0, "review": "You get what you pay for. It's a good unit that does what it's supposed to. Get's all the channels it's big brothers get. Convenient for moving from one TV to another.", "verified": true, "helpfulness": "0/0", "author": "B. Kaiser \"B. V. Kaiser\""}, {"rating": 5.0, "review": "Good product and great peoples", "verified": true, "helpfulness": "0/0", "author": "bengery amy"}, {"rating": 1.0, "review": "Too much work around to get it to work outside the US. I blame myself for not doing enough research before buying but for a product that's been around so long I wish this wasn't an issue.", "verified": true, "helpfulness": "0/0", "author": "Ctrini"}]