[{"rating": 3.0, "review": "I like the Roku Streaming Stick but I'm concern as I am currently having trouble with the remote control. I do not yet understand why the remote will work only for a few minutes before it appears to just stop or freeze. I would have to pull the battery and reinstall to get the unit to work again. But then a few minutes later it is the same issue again.I already had to return the first unit for a replacement because no matter what I did, I could not get the remote to work even after contacting Roku support for assistant. Other than the issue with the remote control, the streaming stick is okay.Note: I do not have an issue when using alternative method such as the smartphone as the remote control.", "verified": true, "helpfulness": "0/0", "author": "Otis Johnson"}, {"rating": 4.0, "review": "Very cool and beats out the chromecast in almost every way- if not just a little bit slow.", "verified": true, "helpfulness": "0/0", "author": "Adam T. Witt \"shutupdangit\""}, {"rating": 5.0, "review": "Great value.  If you don't need the USB port, ethernet port, MicroSD slot, or the remote headphone jack that the \"full' Roku models have, then this is just as good for a lot less. Refurbished makes it an even better deal.", "verified": true, "helpfulness": "0/0", "author": "Seabisquick"}, {"rating": 1.0, "review": "Unit failed after eight months of limited use. I have contacted Roku customer support five times over the past four weeks and on each occasion have been promised an email containing instructions on how to return the unit for exchange. To date I have not received the promised emails. Online chat with customer support is better than telephone contact as the representatives' English is very weak. A waste of money!", "verified": false, "helpfulness": "0/0", "author": "Michael J. Cochrane"}, {"rating": 5.0, "review": "We are a current user of Roku, the stick works just as well as the box.", "verified": true, "helpfulness": "0/0", "author": "Cheryl"}, {"rating": 4.0, "review": "i bought one of these to try it out. i currently also have an amazon fire box and cable as well. it works great and the picture is perfectly clear. no issues with connecting to my wifi so far.", "verified": true, "helpfulness": "1/1", "author": "steve m"}, {"rating": 5.0, "review": "ROKU IS THE BEST AND THAT'S ALL I CAN SAY", "verified": true, "helpfulness": "0/0", "author": "C. Johnson"}, {"rating": 5.0, "review": "such a great deal! the boxes run an upwards of $80. as long as your tv has an HDMI port (which most newer models do) you're good to go! finally, tv without commercials. i love it!", "verified": true, "helpfulness": "0/0", "author": "Catherine Lippincott"}, {"rating": 1.0, "review": "This worked relatively well at first (some minor glitches but overall ok), but then recently I got the dreaded \"Purple Screen of Death\". If you search the web, you can see that this is a known issue. I tried every fix possible, none of which worked. I contacted Roku, who essentially told me tough luck, we know we sold a product that self-destructs, but because it took more than a year to do so, we aren't going to replace it, even though it was defective. In short, and in caps for all you skim readers out there, DO NOT BUY THIS PRODUCT UNDER ANY CIRCUMSTANCES.", "verified": true, "helpfulness": "0/0", "author": "Cardinal Academics Tutoring \"Jonathan\""}, {"rating": 3.0, "review": "Remote works less than half of the time. I use my phone as a remote and have zero problems.  Just a pain in the rear. The app channels are decent. Overall, happy with the purchase. Don't believe it would be needed with a smart tv though! I use it on an older model TV with an HDMI plug in.", "verified": true, "helpfulness": "0/0", "author": "itsme"}]