[{"rating": 2.0, "review": "The stick locks up about once a day and the remote is an unresponsive piece of garbage. I have had more issues with one roku 3 stick in one week than I have with the 3 chromecasts I have owned for months. Skip this piece of junk and get something else...anything else.", "verified": false, "helpfulness": "0/0", "author": "HP Support = BAD"}, {"rating": 5.0, "review": "Plug in, set it up....ready to go. You will need a good internet signal and speed...but a solid little product! was streaming netflix in 8 minutes! Bravo! Well Done Roku!", "verified": true, "helpfulness": "0/0", "author": "Henry Martinez"}, {"rating": 4.0, "review": "Like all sticks, it's a pain in the butt to find things and enter wifi information.", "verified": true, "helpfulness": "0/0", "author": "EK"}, {"rating": 4.0, "review": "We have completely cut cable and use only this as our source of television entertainment (subscribed to Amazon Prime, Netflix, Hulu, and CBS All Access which totals @about $30.00 a month). The only issue is the remote. I've found the only way to keep it working is to pull the batteries out when you're not using it... as in even while you are watching TV but not actively using the remote. Otherwise it just chews through batteries. You can use an app on your smart phone as a remote, but sometimes it has trouble loading which can be a little frustrating when you need to pause or change your program. Other than that. I am very satisfied with this device.", "verified": true, "helpfulness": "0/0", "author": "Aundrea"}, {"rating": 1.0, "review": "do not recommend the stick. Set product up and within minutes, nothing working. Not sure if its the stick or the remote. I tried to use the Roku app and used my phone as the remote. Kept getting a message that the stick was not transmitting. Very frustrating for it not to work, its being send back now. I've ordered the regular Roku (no stick), hopefully that's better", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 2.0, "review": "I got this in June because it was rated the best for the sticks. We have had nothing but trouble since day one. I take forever to load then when you select a show to watch it hiccups a lot. I recently moved this to a different TV and now it just won't work past showing the RUKU logo on the screen then going black???? would not recommend buying.", "verified": true, "helpfulness": "0/0", "author": "Denise Dameron"}, {"rating": 5.0, "review": "Works very well.  I also have a streaming blu-ray player, but this picks up quite a few more channels.  Definitely worth the price!", "verified": true, "helpfulness": "1/1", "author": "J.S. Doll"}, {"rating": 3.0, "review": "While it works it's great.  Didn't last long though.", "verified": true, "helpfulness": "0/1", "author": "patricia m. casey"}, {"rating": 1.0, "review": "Purchased this 1 year ago.  Have not been able to obtain 5.1 audio.  Customer support is a joke.  They keep referencing Netflix Dolby Digital Plus. I don't watch Netflix.  I have no issues getting 5.1 audio with my old Roku box while watching Amazon prime.  I purchased a Monoprice HDMI switch box.  This will strip out the 5.1 audio from HDMI and output the 5.1 audio signal to my receiver via digital optical cable.  The Stick never gets 5.1 audio.  The settings are set to 5.1 audio on the stick, but never been able to obtain 5.1 audio.  Emails to Roku keep coming back with suggestions that I require a new TV and receiver to make their $49 item work.  They just don't want to believe that they sold a  defective item.  I chatted with customer support initially when I purchased this.  Nothing good came from the chat.  I received an email to UPGRADE my Roku, which sent back to the initial issue I had with the stick that I currently don't use over my original box.  Waste of money upgrading to the stick.  Further waste of time chatting and emailing customer support with terrible replies back.  All of them mention Netflix as the culprit.  Not the stick.  Even after I stated no Netflix.", "verified": true, "helpfulness": "0/0", "author": "free4u"}, {"rating": 4.0, "review": "Love Roku streaming beyond belief, but the remote is shoddy and needs a lot of batteries", "verified": true, "helpfulness": "1/1", "author": "Amy C. Cogswell"}]