[{"rating": 5.0, "review": "Got this for my daughter's room and it has worked great.  Like that it takes up so little room and can use the TV's USB for power.  The speed is pretty darn close to my Roku 3. About the only place it is notably slow is startup, but really isn't bad.", "verified": true, "helpfulness": "0/0", "author": "Lenny"}, {"rating": 1.0, "review": "awful product! the first streaming stick I owned was constantly going in and out of network, that one broke due to unfortunate accident. I bought another one (although very hesitant) because i like the discreetness of it. Absolutely terrible, spent a day and half trying to set this up, first it didn't want to connect to my wifi and when it finally did, nothing but error codes and endless viewing of the bouncing roku logo. Roku customer service was of no help either! Terrible!!! I have an older version that has worked for years and has never given me problems, just stick to the normal rokus. The streaming stick isn't worth the money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love our Roku!", "verified": false, "helpfulness": "0/0", "author": "Carolyn J. Ries"}, {"rating": 5.0, "review": "I bought the streaming stick as soon as it came out. I thoroughly researched all the other streaming device options before making my decision. What won me over? The price, the remote, and the reputation of Roku.I got the Roku with the hopes of potentially dropping down to a smaller cable package. After using the Roku for 1 month, I realized that I hadn't watched cable in over 3 weeks! That did it. I called my cable company and cancelled. I am now subscribing to Netflix, Hulu Plus, and Amazon Prime. Even with the added subscription costs, I am saving over $70 per month by cutting the cable cord. I would be saving more but I decided to triple my internet speed. I also bought a digital antenna so I still get network TV.Do I miss cable? Sometimes. Like I missed the VMAs yesterday. But whatevs...I'd rather keep my pocket fatter!What I did not account for when Infot the Roku was all of the awesome channels. (I still cry about the loss of Aereo and Justin TV, though.) I can truly fall down the streaming rabbit hole! There are so many strange and interesting private channels. I can spend hours looking at random stuff.There are a lot of stupid channels, too, but isn't that just like cable minus the ginormous bill plus hidden taxes and fees?So in all, I wish I could give my Roku streaming stick infinity stars.", "verified": true, "helpfulness": "0/0", "author": "Erato Calliope"}, {"rating": 4.0, "review": "BUYER BEWARE, it's still a relatively new product and there is a lot of improvements that need to be made. The customer service at Roku isn't the best at understanding (english) the customer and it is a long wait time to get through. Buy the 2 year warranty, it's worth it. I had mine for 2 months and had to return for defective product...meanwhile I'm out tv access until all gets resolved. I had problems with the device freezing. I do like it otherwise because it's a great idea and concept, plus I hate cable. Do take notice of the size of the streaming stick, it does stick out far and since my TV is on the wall it cannot work on the back of the TV, it goes in the side port.", "verified": true, "helpfulness": "0/1", "author": "Jaimee K."}, {"rating": 5.0, "review": "I had had this device sine it came out earlier this year.  I am using it on a wireless 802.11g network.  The router is on the floor below.  Streaming Pandora, Netflix and Amazon Prime is buffer free.  It had easy setup, but I have bought and setup many.  I see that the channel list keeps growing and I like Roku that I can pick and choose the shows on my channels and watch them on my schedule.  Also using my S4 as a remote is nice.  I recommend this device.  My parents love theirs.  My father in law uses his every-night considering he hates technology.  It is easy to sue for him.  Same with my parents.  They enjoy the Netflix and Pandora when they babysit.", "verified": true, "helpfulness": "0/0", "author": "T. List"}, {"rating": 2.0, "review": "Did I get the Wrong Roku Streaming Stick??This was suppose to be a very nice Birthday gift to enjoy on summer vacation, but instead, it turned out to be a High task, very limited, frustrating Chore. According to the info, this was only to take a few minutes to set-up; Nay,Nay! With all the Resets and Lost signals, it took me 2 days to almost set-up!I also thought I would be able to use the same stick on my main TV when I got back home...Wrong again. I called the 1-800-600 ROKU ???Customer SERVICE??? number for 2 days; all I get is some LOUD HORN sound. The phone never even rings!!! I can't even take it back to Walmart (only 15 days to return electronics).CNET thinks you're wonderful... What number did they call?????", "verified": false, "helpfulness": "0/0", "author": "Rwilson"}, {"rating": 1.0, "review": "Maybe it's just Hawaii.....but we tried and tried.....roku works good on only a small number of their channels and streams perfectly, but most are constantly reloading and buffering and interupting the watching....so after more than a week of trying roku we barely use it now....we just stream youtube or other www sites directly onto the phone, pad, or pc....no need roku.", "verified": true, "helpfulness": "0/0", "author": "jo kealoha"}, {"rating": 5.0, "review": "This is a great product if you are looking for an alternative to cable.  We ditched our cable about 6 months ago.  This was a transition for us, but we have survived and aren't really missing out on much!  We do subscribe to Amazon Prime Video and Netflix.  This is much cheaper than paying cable TV prices!", "verified": true, "helpfulness": "0/0", "author": "hksterne"}, {"rating": 2.0, "review": "Everything seems to work well, but it was too slow for my wife and I.  The waiting time to load the home screen and boot into applications such as Netflix was too long for our patience.  We returned it and ordered the Roku 3, which we are very satisfied with.", "verified": true, "helpfulness": "0/0", "author": "TR"}]