[{"rating": 4.0, "review": "These are great products, and a cheaper alternative to the Apple TV with many of the same features.  Did have to return one, which failed due to movement of the power cable.  They replaced it quickly though.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 4.0, "review": "I bought this Roku for my friend because my family loves our Roku.  My friend loves it!  She said the only issue is the battery life of the remote is extremely low.  Within the first two weeks of receipt of the Roku, she had to change the battery twice for the remote. She was planning to call company to see whether she could get a replacement remote.", "verified": true, "helpfulness": "0/0", "author": "Sunshine"}, {"rating": 5.0, "review": "purchased as a gift since I have one and love it", "verified": true, "helpfulness": "0/0", "author": "ajmeema"}, {"rating": 1.0, "review": "Ordered this, then week later ordered another. Hooked both up same time. Even though same thing with same order number have different remotes. This one the remote has dull finish and enter bottom in middle of direction tabs. Freezes and impossible to search for anything. Had I hooked it up first never would have gotten another. The other one has a shiny remote and the enter button is under the directional tabs. It works fine. Feel ripped off.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Brogan"}, {"rating": 3.0, "review": "I have had four Roku devises including this one. The biggest thing I've notice about the Roku Stik is that it is very slow. I have the Roku 2 and the Stick is slower than that.I could have given it 4 stars if that were the only thing. Unfortunately it isn't. The Stick continuously loses connection with my network. None of my other Roku devices do this making it extra annoying. I had originally purchased this for my son's room but because of the connection problems it is now in my master bedroom.It does look very sleek and when it does stay connected it is very enjoyable. Just like other Roku devices. Hopefully the connection bug can be worked out. If that happens it would be great.I will stick with it due to the price. I can get by reconnecting to my network for now.", "verified": true, "helpfulness": "0/0", "author": "Jose Sanchez"}, {"rating": 1.0, "review": "I hate this stick! Takes 30 minutes to set up, and then I had to reset and redo the whole entire process the very next day when it just froze and quit working again. Not impressed!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Very weak in picking up signal.  Also quite slow.  Constantly buffering.Worst of all, it died three months later.  Getting an RMA from Roku was an adventure as it required multiple contacts.  Still awaiting a return on it.  When we get it back, I'm not sure how we'll use it, if we'll use it.If you need a streaming player, I wouldn't buy a stick.  Spend the extra money and get a serious device.  We ponied up extra money for a Roku 3 right after this.  No buffering problems, no signal problems.", "verified": true, "helpfulness": "0/0", "author": "R \"-R\""}, {"rating": 5.0, "review": "Great product awesome purchase", "verified": true, "helpfulness": "0/0", "author": "Krystil Wilson"}, {"rating": 1.0, "review": "Damn thing quit working inside of six months. Not worth a lick if I have to screw with returns. Reliability was the one thing that stuck out when researching the value of this, and indeed it failed me. Gonna do without.", "verified": false, "helpfulness": "0/0", "author": "james gibson"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]