[{"rating": 5.0, "review": "Now that Im streaming I know longer have timefor regular TV. I have opened up a whole newworld of entertainment. Goodbye cable andsatellite FOREVER and Hello to RUKU.", "verified": true, "helpfulness": "0/0", "author": "PatriceA"}, {"rating": 5.0, "review": "OMG....Who needs TV?  Thumb your nose at Comcast.  buy this...one for each TV....everything I like to watch especially British TV.  I am in love!!AND....I installed it myself, without problems.  there you go..", "verified": true, "helpfulness": "0/0", "author": "Miss Belex"}, {"rating": 5.0, "review": "Love this Roku 3500 Streaming Stick (HDMI) that was included with my purchase of my new router Netgear Nighthawk x6. Steams quickly to my older non-smart television. I don't have to rely on my blue-ray as I was before and it's 'iffy' connection issues. Plug it in and wait for it to load and it's fast sailing. I haven't noticed any lag speed (but I have great wireless internet service, plus the new Nighthawk router). There is a slight wait when you click a button, but that's to be expected (as opposed to having my laptop connected via HDMI) and not an issue at all. I wish it had more free apps is my only suggestion. My Sony Blu-ray is loaded with apps that I regularly used.", "verified": true, "helpfulness": "0/0", "author": "I. C. Gonzalez"}, {"rating": 5.0, "review": "Works just fine for kitchen TV and appears to be just as fast as our other Roku devices (2 & 3) or at least its seems that way. We plugged the stick directly into an outlet rather than use TV USB port. No waiting for Roku to powered up after turning on the TV.", "verified": true, "helpfulness": "0/0", "author": "cannon"}, {"rating": 5.0, "review": "I am very happy with the Roku Streaming Stick.  So far I have just used net flex.", "verified": true, "helpfulness": "0/0", "author": "Energybunny"}, {"rating": 5.0, "review": "Awesome stick for those who don't have a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Shaun Liles"}, {"rating": 1.0, "review": "no-couldn't get it to work.  Returned it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "Great purchase! Very easy to install and user friendly.", "verified": true, "helpfulness": "0/0", "author": "Loreen C. Eccleston"}, {"rating": 5.0, "review": "Enjoying this better than the the chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]