[{"rating": 3.0, "review": "It's Okay.  I love all the channel options, but it freezes on a regular basis.  And my WiFi signal is strong so it shouldn't.  But I'm glad that I have it. A little cheaper would be better.", "verified": false, "helpfulness": "0/0", "author": "RG \"treymen\""}, {"rating": 1.0, "review": "This thing only works half the time.  A lot of resetting to get it to work.  We don't have any trouble with the other roku products we have.", "verified": true, "helpfulness": "0/0", "author": "MaryAnn McRae"}, {"rating": 5.0, "review": "I like my Roku! I have had a roku for about two years now. I just upgraded to this one and love it. My old Roku was only 720p and this one is full 1080p. I like the rf remote also. You dont even have to point it at the tv now. Would recommend this so much I bought a few for family members for Christmas.", "verified": true, "helpfulness": "0/0", "author": "Robert Bell"}, {"rating": 1.0, "review": "There are times this won't connect with the bundled remote control. That requires a reboot which takes 3-5 minutes. I've also had to hard reset this which means instead of chilling out and watching some TV, you spend about 30 minutes performing tech support and restoring the Roku settings and your channels/subscriptions.On top of that they have nonsensical status updates like \"Releasing gravity locks\" and \"maximizing fun factor\" (which should really read \"Working on getting you frustrated\"). Really? First of all the product doesn't work as advertised and then they have these stupid update messages on the screen. Roku, get quality engineers as well as a copy writer.And yeah, the odd chance this actually works, you'll be wasting time checking out the loading screen.But it's consistent; no matter what happens, you will be wasting your time. If you want to watch TV, get an Apple TV or Amazon FireTV or something else.", "verified": true, "helpfulness": "0/0", "author": "Sid S"}, {"rating": 3.0, "review": "I bought this for a spare TV in our home office. The price for the Roku is certainly cheaper than the monthly fee for another cable box. It works just fine. It is a little slower to change between apps and shows than the Roku HD we have upstairs. I haven't had any disconnection problems and streaming is uninterrupted. The only con I have is that the remote that came with this refurbished unit was covered with sticky fingerprints. It cleaned up fine but it was kind of gross.", "verified": true, "helpfulness": "0/0", "author": "Paul Kirill"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "Hagen"}, {"rating": 3.0, "review": "only for amazon prime, chromecast works better but they don't have an amazon app", "verified": true, "helpfulness": "0/0", "author": "vuhx"}, {"rating": 2.0, "review": "Remote stopped working.  Keeps blinking and blinking and blinking!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Leslie M. Carey"}, {"rating": 4.0, "review": "I simply love it. It is good to watch shows already aired. However if you want to watch live shows then it is a problem, you need subscription to TV service provider which is like you need a Cable TV + streaming player. Not recommended for Sports fan. It deos not have games as claimed. Good for nextflix or Hulu.", "verified": true, "helpfulness": "0/0", "author": "Baktesh Kamath"}, {"rating": 5.0, "review": "good!!..", "verified": false, "helpfulness": "0/0", "author": "Esteban Acuña Vargas"}]