[{"rating": 5.0, "review": "Easy as pie to set up! We have two tvs and the channel list syncs between them so you only have to add channels to one tv or the other to get your list of available channels once you have an account made with Roku. This little device really is quite ingenious. We have subscriptions to Hulu plus, netflix and since we are already Amazon Prime members we have access to just about every show we were watching on cable.", "verified": false, "helpfulness": "0/0", "author": "Dva \"~W\""}, {"rating": 5.0, "review": "Love this small stick carries a hefty load. Fast streaming, works perfect.", "verified": true, "helpfulness": "0/0", "author": "zeusmom"}, {"rating": 4.0, "review": "I love ROKU.  I would only use this with an onboard USB port if you can set it to always be on with the TV off.  Waiting for the ROKU to boot is annoying.  It doesn't seem to perform quite as fast as my old XS.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is the third Roku device I have owned. What can I say that hasn't been said already?  Mine is responsive and accesses all of the streaming content I'm interested in. I love the fact that it doesn't need shelf space, and I'm now officially spoiled by RF remotes. I have been a fan of the Roku devices throughout their history, and this one is a worthy successor. It's only drawback is that sometimes it starts out in lower resolution while it buffers the start of your program, but that never lasts more than a few seconds. That may be traffic on my network, but it does start streaming faster than my Chromecast. The Roku is the standard by which all other streaming devices are measured.", "verified": true, "helpfulness": "0/0", "author": "M. Kane"}, {"rating": 5.0, "review": "this makes any flat tv into a smart tv. easy set up. tons of free channels", "verified": true, "helpfulness": "0/0", "author": "Miguel B."}, {"rating": 5.0, "review": "The Roku streaming stick is one nifty piece of gadgetry. Plug this flashdrive-sized stick into an available HDMI port on your TV, connect the power supply to the wall, then it's as easy as connecting to your home network and your ready to stream.From opening the box to streaming the first movie, setup took about twenty minutes. You'll have to create a Roku account in which you'll register your device and choose all the channels you want, and there are a LOT to choose from: Netflix, Hulu, Amazon Instant Video, HBOGo, Showtime, Pandora, YouTube, and thousands and thousands more. We've chosen the more commonly used ones such as what I listed above, but there are also many other various channels, such as ones for news. Crackle is another decent free movie channel, and Vevo is on there as well if you're one who watches music videos from time to time.Probably the BEST feature about the Roku streaming stick is that it'll turn essentially any TV into a Smart TV. As long as there's a wireless network and an HDMI port available, you can use your Roku. My boyfriend and I are very excited to take this with us on vacation to use in our hotel rooms at night since we like watching movies while winding down our day.One little gripe: Sometimes the Roku streaming stick can be a little sluggish. Like when you open the Netflix channel, it usually takes a good 30-45 seconds for the Netflix menu to appear. From what I understand, the actual Roku boxes like the Roku 2 and Roku 3 don't suffer from this problem, but it's a small price to pay for the slim size of the device and it's ease of portability. Plus, we weren't interested in the games that come on the Roku boxes.All things considered, I'm very pleased with this purchase. I bought this for my boyfriend for his birthday because I figured he would use it a lot. Plus he's anyways said he hates the way the Netflix app is laid out on his Samsung Smart TV. Now he uses this Roku streaming stick exclusively anytime he wants to stream a movie, a music video, music, or anything else. Can't recommend this device enough!", "verified": true, "helpfulness": "0/0", "author": "Dane Alexander O'Leary \"Dane\""}, {"rating": 5.0, "review": "Real easy to setup. Just as good as roku 3.", "verified": true, "helpfulness": "0/0", "author": "Henry N"}, {"rating": 5.0, "review": "I am extremely happy with this device.  I had been using (mostly) my Blu-ray player to connect to Amazon videos as well as other streaming media.  Connecting through the Blu-Ray was frustrating because it would frequently stop streaming \"network unavailable\" is what it would say.  Initially I thought it was FIOS or Amazon, so I tested it going through my computer (since my computer also uses FIOS and Amazon) to my shock, the streaming was NEVER interrupted using any of my computers, so that left the middleware device - the Blu-ray.  Roku was very easy to connect to my TV and then setup.  (I was worried it might be complicated but was so frustrated that I was willing to take the risk - and to my surprise - NO PROBLEMS!)  The display seems clearer than before but that could be because the icons are shown larger.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "Already had Roku 3. This works just as well at half the price and also enables photos, videos and music from your iPhone or iPad to transmit wirelessly to your big screen TV", "verified": true, "helpfulness": "0/0", "author": "ALAN WEISSBERG"}, {"rating": 5.0, "review": "great travel item for lodging with wi-fi", "verified": true, "helpfulness": "0/0", "author": "Paul Harnad"}]