[{"rating": 5.0, "review": "Great way to get around paying for cable!", "verified": true, "helpfulness": "0/0", "author": "larrimora"}, {"rating": 4.0, "review": "Arrived on time.  Plugged in the device and got an error message when trying to update software from the Roku site.  Contacted ROKU support and spent about an hour on hold but when the tech answered she was very knowledgeable.  We were able to solve my connection issues by changing my default DNS IP's to the ROKU dns and changing the wireless channel to 6.Now the device is working I am loving it.  I would have given it 5 stars but had to minus 1 star for the setup hassles.", "verified": true, "helpfulness": "0/0", "author": "Kiwikid"}, {"rating": 5.0, "review": "Great gadget to have", "verified": true, "helpfulness": "0/0", "author": "rlg"}, {"rating": 5.0, "review": "Why didnt I get this sooner!?Just waiting for my contract to finish and will finally say bye bye to cable and their crapy channels.", "verified": true, "helpfulness": "0/0", "author": "Lorena D Marques"}, {"rating": 1.0, "review": "Although my new Sharp HDTV boasted being \"Roku ready\", I don't think Roku itself was ready.  Lots of software issues.  I returned it in a few days for a full refund.  Now I'm waiting for the Amazon Fire Stick to restock (have Fire TV which works great).", "verified": true, "helpfulness": "0/0", "author": "Joe B Stanley"}, {"rating": 4.0, "review": "It does what I Roku does. The only minor complaint I have about it is that, though you can power it via a USB port and avoid having an extra power cord dangling, if you do the Roku device itself will power off each time you turn off the TV. It takes about 3 minutes for the Roku to power up and be ready for use from an unpowered state.", "verified": true, "helpfulness": "0/0", "author": "Anthony Bopp"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "RandallRussell"}, {"rating": 2.0, "review": "Reception often impaired, able only to receive a rating of \"good\" in location.  More expensive roku device from same location receives a rating of \"excellent\".", "verified": true, "helpfulness": "0/1", "author": "Self Mcgocome"}, {"rating": 5.0, "review": "Fantastic", "verified": true, "helpfulness": "0/0", "author": "Peter D. Zizzamia"}, {"rating": 3.0, "review": "I love the idea of Roku, but it does struggle to stream Amazon and repeatedly needs to update.  Netlix works a little better on it, but still isn't perfect.", "verified": true, "helpfulness": "0/1", "author": "Tracey A McCabe"}]