[{"rating": 5.0, "review": "Love my Roku(s), I have 4 in all. It's been great at home and I take it on vacations, as I'm gone 2 months. Never had a problem - ever.", "verified": true, "helpfulness": "0/0", "author": "Thomas F. Howe"}, {"rating": 3.0, "review": "The set-up is relatively easy. However, it appears that one has to provide a credit card for registration even if no paid content is desired, which put me off the whole experience", "verified": true, "helpfulness": "0/1", "author": "A.R.Viewer"}, {"rating": 5.0, "review": "Works much faster and very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Randall B. Emeterio"}, {"rating": 5.0, "review": "Love this thing! Small and convenient. Great for traveling and home. Never use my apple tv anymore!", "verified": true, "helpfulness": "0/0", "author": "Catsnest"}, {"rating": 5.0, "review": "I love it.  We watch movies,  catch up with tv series. I recommend it to anyone. And it's easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Lori Burdell"}, {"rating": 5.0, "review": "Product as promised and works great!", "verified": true, "helpfulness": "0/0", "author": "William Sigmund"}, {"rating": 5.0, "review": "Setup is incredibly easy and works great. I would recommend this to anyone who wants to stream video.", "verified": true, "helpfulness": "0/0", "author": "Watson Sanders"}, {"rating": 5.0, "review": "I love the Roku stick. I had a good computer screen (with hdmi slots) boxed up in storage, and decided to to purchase the Roku stick to test out on my screen.  After setting up the roku, I am surprised I didn't think to do this sooner! I now have more space in my storage, and do not need to purchase a new tv! The setup takes a little time as you have to input your login with the remote, but that isn't too bad. It is definitely not as fast as say the roku box, but portability was what I was going for. It's convenient and I like that I can easily move it from my room to living room with ease. It's a nice to be able to do so when you want to play some movies in your living room off of amazon or netflix. Just plug it in a power outlet and hdmi slot, and you got your amazon instant, netflix, youtube, and all those goodies on your screen.My sister has a chromecast for her room, and although she enjoys it- she sometimes wishes she had a remote like me lol. Also- she can't watch amazon instant shows conveniently while I can at the push of a button. Not bad at all for $50.", "verified": true, "helpfulness": "0/0", "author": "Cat"}, {"rating": 4.0, "review": "We purchased the Roku 3500R Streaming Stick (HDMI) because it offered the chance to see content not available to us via our Tivo or Apple TV.  This Roku is a terrific complement to a home entertainment system!  It lets us stream from our Amazon Prime to our TV instead of just to our iOS devices, and it lets us search for content across services I didn't even know existed!  This is a terrific feature.  When content is available on multiple services, the Roku will show you pricing information and format, e.g. 'Standard Def' vs. 'High Def'.The only downside is that some apps on the Roku can be a bit sluggish compared to apps on something like the AppleTV (Netflix, for example). All in all, we're glad we got this, especially for the price!", "verified": true, "helpfulness": "0/0", "author": "Ward Fisher"}, {"rating": 5.0, "review": "I'm a \"cord cutter\", which means I do not have cable or satellite service.  So I use my Roku almost exclusively to consume media.  It has a ton of channels, and it's getting more every day.  It's fast, it's reliable, it has the most apps out of all of the streaming devices, and this stick is small and inconspicuous.  I have my TV mounted on my wall, so this is the perfect option.  Even if you have cable TV this is still a great option.  Plex alone is worth the price of admission.", "verified": false, "helpfulness": "0/0", "author": "Derek"}]