[{"rating": 5.0, "review": "I love being able to watch shows without the hassle of a box and more dust - very easy to use", "verified": true, "helpfulness": "0/0", "author": "Mindy Beckman"}, {"rating": 4.0, "review": "What's not to love about Roku? It was very,  very easy to set up. I had it out of the box and set up within 10 minutes of it arriving. It's always on and is still working as good as the day we got it. My only gripe is that for some reason the Roku logs me out of the channel apps every few days. So at least once a week I have to go through and reset every channel.  That is a bit of a headache. Also,  I wish the remote had less buttons like Blockbuster on it. We've bought two of these now and I recommend it to anyone who needs something quick and easy to work with.", "verified": false, "helpfulness": "0/0", "author": "Miss Minx"}, {"rating": 5.0, "review": "Much better than my game console for streaming.", "verified": true, "helpfulness": "0/0", "author": "Ron Landram"}, {"rating": 5.0, "review": "A must for any Time Warner Customer, get rid of your cable box and get a Roku, at $40 is a bargain - plus you get a ton of other apps!", "verified": true, "helpfulness": "0/0", "author": "Areche \"KA\""}, {"rating": 5.0, "review": "gave as a gift.they loved it", "verified": true, "helpfulness": "0/0", "author": "dv"}, {"rating": 5.0, "review": "The Roku Stick is an incredible value. The following review really sums up my take on the device.http://techsmash.net/roku-stick-review-a-stick-of-endless-of-possibilities/15521/", "verified": false, "helpfulness": "0/0", "author": "Curtis Wallen"}, {"rating": 3.0, "review": "Good enough but I'd spend the extra $ and go for the full Roku unit.  Significantly slower than the full Roku.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Awesome once I got my wifi signal strengthened...now works great!", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 5.0, "review": "Works great! This is my second Roku purchase but the first for a streaming stick. Will purchase again as a gift.", "verified": true, "helpfulness": "0/0", "author": "Avid Consumer"}, {"rating": 5.0, "review": "Roku is the way to go when you don't have cable.  Think about it!  This one works as well as our Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Mags_42"}]