[{"rating": 1.0, "review": "Horrific.  I constantly have to reset the stick, and it takes FOREVER to load.  Do not buy.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 5.0, "review": "Very please!", "verified": true, "helpfulness": "0/0", "author": "Reatha L. Logan"}, {"rating": 5.0, "review": "We had an old box so we updated to this. It's amazing, does everything the box does and it goes on the back of the tv instead which is really nice feature", "verified": true, "helpfulness": "0/0", "author": "Eric B. Meyer"}, {"rating": 5.0, "review": "Great product, luv it", "verified": true, "helpfulness": "0/0", "author": "Michael P. Ryan"}, {"rating": 5.0, "review": "Very pleased with this purchase. Awsome gift to give at such a great price! Easy to install", "verified": true, "helpfulness": "0/0", "author": "Eagle28"}, {"rating": 5.0, "review": "Awesome! Now I have two Roku's and loving watching the NBA basketball app in both rooms! Setup was easy, and even though I purchased a refurbished unit (streaming stick) everything worked as intended.", "verified": true, "helpfulness": "0/1", "author": "2AH"}, {"rating": 5.0, "review": "I love it.  To think I was going to buy a Smart TV.  I get the same thing for much less.  It's perfect for my kitchen TV.", "verified": true, "helpfulness": "0/0", "author": "NANNA"}, {"rating": 1.0, "review": "Terrible customer service.  Easy to set up, but it did not function as intended.  I have a Roku 2 box on another TV and it works fine.  Got online to live chat and spent forever in a queue of 69 people.  Finally got a rep who clearly was troubleshooting multiple customers simultaneously.  She could not make it work but did certainly try.  She gave me a case # and said Roku would replace my defective unit  Heard nothing.  Wrote to Roku customer service twice with order info from Amazon and included the case # and have had ZERO response from Roku.  Am returning this device to Amazon.  Saw a comment here that Roku should take lessons from Amazon in customer service, and I agree wholeheartedly.  I no longer want this replaced.  I want a refund.", "verified": true, "helpfulness": "0/0", "author": "gizzie5"}, {"rating": 5.0, "review": "This is the third Roku  gave to My Son for xmas  and He loves it", "verified": true, "helpfulness": "0/0", "author": "mary m jones"}, {"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/0", "author": "Alexander"}]