[{"rating": 3.0, "review": "The remote stopped working almost immediately. I would like to get another one but don't know how without returning the entire purchase.", "verified": true, "helpfulness": "0/1", "author": "Dewey Milby"}, {"rating": 5.0, "review": "Works great.  So happy to get this.", "verified": true, "helpfulness": "0/0", "author": "Ethelette K"}, {"rating": 5.0, "review": "Works great. I can use it while running several other wireless devices at the same time. No complaints! Thanks-", "verified": true, "helpfulness": "0/0", "author": "dlee1820"}, {"rating": 5.0, "review": "works exactly as expected.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Bailey"}, {"rating": 5.0, "review": "I really enjoy it a lot and was easy to use", "verified": true, "helpfulness": "0/0", "author": "Diane DeLeon"}, {"rating": 5.0, "review": "I love this thing. I hooked this up in the same room as my router so I can't speak to it's uses throughout the house. But, I LOVE THIS THING. It has given me streaming to a tv I meticulously installed without wires dangling.  I ordered the small wires that connect to the usb on the tv but they were unnecessary. The roku stick comes with a usb to charger cord that certainly would have sufficed. Unfortunately my usb on the tv was not enough juice to run the roku stick anyway so I used the charging block in the same outlet the tv was hook up to with the addition of an outlet splitter. I now have hi def streaming to this tv and not even once has the remote not worked properly even though the stick is behind the tv. Rarely does a product actually do what it claims, this one does. Best money I have spent in quite some time.", "verified": true, "helpfulness": "1/1", "author": "ultimate diyer"}, {"rating": 5.0, "review": "Wonderful device. Easy to use and install. Am considering getting another one for the bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Patricia Jones"}, {"rating": 1.0, "review": "Piece of junk. Bad consumer help to where i was pulling my hair out.", "verified": true, "helpfulness": "1/2", "author": "Jack"}, {"rating": 1.0, "review": "My remote didn't work and it wasn't worth the time to send back.", "verified": true, "helpfulness": "2/2", "author": "EUGENE"}, {"rating": 1.0, "review": "Refurbished items should have been... refurbished. This product is defective with constant screen flickering.", "verified": true, "helpfulness": "1/2", "author": "S. Peterson"}]