[{"rating": 5.0, "review": "If you're looking to unplug from the cable industry, choose the Roku. It's better than the Chromecast as you don't have to use your computer to operate it. It operates on it's own and fits nicely behind any wall-mounted TV.", "verified": true, "helpfulness": "0/0", "author": "Tim W."}, {"rating": 5.0, "review": "If you have an IOS or Android device, download the Roku app before installing your Roku stick.  That way you'll be able to use your keyboard to enter email addresses and passwords when installing your Roku.  Otherwise, the input is antiquated .. up, down, sideways, choose a letter, enter .. begin again!  Also, the app gives you an alternate remote for when you lose the \"real\" one ..  Installation was simple and straightforward, except for the data entry method.", "verified": true, "helpfulness": "0/0", "author": "SantaFeSue"}, {"rating": 5.0, "review": "Great item easy to use .  It  has a lot of potential  for movies shows  it just takes a while to learn how to get into the workings of it. But we love it .  Thank you", "verified": true, "helpfulness": "0/0", "author": "Buster"}, {"rating": 4.0, "review": "Found out it was HDMI only (DUH!) and replaced it with the Roku 2.", "verified": true, "helpfulness": "0/1", "author": "Paul Mele"}, {"rating": 4.0, "review": "Small, convenient, full function Roku in a stick.  It loses a star as it feels a bit slow at times compared to my Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Jack Madison"}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "James C. Scarborough"}, {"rating": 3.0, "review": "Pay monthly subscription for every channel.", "verified": false, "helpfulness": "0/1", "author": "S. N \"Ning\""}, {"rating": 5.0, "review": "Roku Streaming Stick works great.  Easy to install and use,", "verified": true, "helpfulness": "0/0", "author": "Linda Black"}, {"rating": 5.0, "review": "Loved it so much that I purchased another one for another TV in our house.", "verified": true, "helpfulness": "0/0", "author": "Barbara Campos"}, {"rating": 5.0, "review": "Very happy with this Roku. Amazingly easy to install and get it activated and running. I was also able to download a Roku app for my kindle that allows me to use my Kindle as the keyboard for typing in searches as well as an auxiliary remote. I'm very pleased to be able to stream Amazon Prime and my Acorn TV directly to my TV rather than watching shows on my computer.  Still exploring other channels available, but there is definitely an interesting selection.", "verified": true, "helpfulness": "0/0", "author": "Daisycat"}]