[{"rating": 5.0, "review": "I have a Roku 3 and Streaming Stick - obviously this device is not as fast as the Roku 3 but it works a treat attached to the TV in my bedroom. It streams in Netflix and Hulu Plus in HD and that's all I ask.The device was very easy to setup and runs on the power received via my TV's USB port.Results have been very good; granted it takes an extra 15-20 seconds to load content.I have yet to experience any further issues once the content is loaded.", "verified": true, "helpfulness": "0/0", "author": "Eden Vella"}, {"rating": 5.0, "review": "Easy to switch between televisions. Don't have cable or antenna in my \"country house\", only internet so this is the perfect solution.", "verified": true, "helpfulness": "0/0", "author": "HandyGirl"}, {"rating": 5.0, "review": "The best buy for my family!!! Great business! New in original package as it said!!!We like very much, thanks!", "verified": false, "helpfulness": "0/0", "author": "Maria Hernandez"}, {"rating": 5.0, "review": "This thing rocks. Small, powerful, full HD streaming, countless apps and all at for $50. What's not to love? I mean really!", "verified": true, "helpfulness": "0/0", "author": "Daniel Small"}, {"rating": 5.0, "review": "works as advertised and delivers lots of entertainment for the price.  easy to set up, with simple, clear step by step instructions", "verified": true, "helpfulness": "0/0", "author": "mortlang@cox.net"}, {"rating": 2.0, "review": "I was very excited to buy this product.  However, after 2 months, I would return it if Amazon would let me.  (They won't.)  Here are my disappointments with this product:(1) It is NOT cordless like the pictures display.  There is a very long cord that plugs into the stick that still falls along the wall and plugs into an outlet.(2) The remote is VERY SLOW in loading new channels or programs.(3) ***MOST IMPORTANT****  The stick itself OVERHEATS when left plugged in and simply wont work at all.  I have to remember to actually unplug it from the wall when I am done watching TV - and not just turn off the TV.  THATS ABSURD!!!!", "verified": true, "helpfulness": "1/1", "author": "Lauren"}, {"rating": 5.0, "review": "I bought this for my 60 year old parents and they love it! They were able to set it up easily, and love the fact that they can move it from different TVs in the house. Wonderful purchase! I highly recommend!!", "verified": true, "helpfulness": "0/0", "author": "Tyler Bernard"}, {"rating": 3.0, "review": "Good product that is easy to use. Very slow on startup and netflix. Lots of channels are good, except many require separate paid accounts overall happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "Small, easy to setup, and the best user interface I have seen.  It streams Netflix without any rebuffering even with other heavy usage on the network and only a 3 Mbit connection!", "verified": true, "helpfulness": "0/0", "author": "Traveler"}, {"rating": 5.0, "review": "I bought this Roku doggle because I'm thinking of discontinuing the high cost of cable. After installing it and selecting from the large inventory of channels, I haven't watched cable television in weeks! The only negative thing I would say about it is that it seems to buffer quite a bit, but that may be because I need to update my wireless router. This was not a show stopper, so I bought another one for a different room.", "verified": true, "helpfulness": "0/0", "author": "Ammonia Dee"}]