[{"rating": 5.0, "review": "I think this device is excellect for watching TV and other programs and so simple to use I would buy another one", "verified": true, "helpfulness": "1/1", "author": "augustine saucedo sr"}, {"rating": 5.0, "review": "I love the Roku 3500R.  It allows us to watch movies and shows not only from Amazon but also from HBO Go.  I would recommend the stick to everyone.", "verified": true, "helpfulness": "0/0", "author": "Susan Crow"}, {"rating": 4.0, "review": "Easy to set up, good selection of channels. I wish my TV had a powered HDMI so it didn't have to be plugged in. Kind of defeats the purpose of having a small device that hides behind your TV if it has to be plugged in and the cord always visible. Highly recommended, especially if your TV has a powered HDMI.", "verified": true, "helpfulness": "0/0", "author": "Mitch H"}, {"rating": 3.0, "review": "I bought the Roku because it supports the most streaming channels.  I love the hot buttons on the remote for prime and netflix.  The interface is well done and easy to use.The one big problem is won't connect to my 5ghz network.  It connects to my 2.4 just fine.  I opened a ticket with Roku and they started telling me I should try different channels on my router.  That made me angry because you should never build a product that requires someone to go in and change channels on their router.  I have many devices that connect just fine.  They told me I need to move it closer to the router.  The 5ghz range has a greater range then the 2.4ghz.  If it can connect to 2.4 so it should connect to 5 easy.  I've given up and I'll just have to live with the 2.4", "verified": true, "helpfulness": "1/1", "author": "Bruce Ziegler"}, {"rating": 1.0, "review": "The streaming stick set up very easily.  However the stick would not play any videos from any of the apps, including amazon prime.  I contacted customer support and they could not resolve the issue.  My wifi connection was perfect, but the roku would just say buffering when i tried to play videos.  I am returning this product and getting an amazon fire.", "verified": true, "helpfulness": "3/4", "author": "Jeremy Sanders"}, {"rating": 5.0, "review": "Less cluttering of cables and connections!  Works perfectly well. I have installed them both of them  on Samsung and LG TVS.", "verified": true, "helpfulness": "0/0", "author": "Percy Dahan"}, {"rating": 5.0, "review": "tried it first time in hotel, so had to go through full setup.glad I had my tablet to finish sign on.worked great.  in hotel movies without hotel charges.", "verified": true, "helpfulness": "0/0", "author": "A. Gonzales"}, {"rating": 1.0, "review": "The worst. First ask to make a free account but you have to provided a credit card.The free channels that they announce are not worth to see.If you are overseas, the channel get even worst and they \"DONT SUPPPORT YOUR REGION\"The same with the app. overseas this is nothing but garbage. And they dont said anyware.DONT BUY!!", "verified": true, "helpfulness": "1/4", "author": "Aaron"}, {"rating": 5.0, "review": "The Best! A lot of channels and movies! Simply the technology today is amazing. I bought this item for my mother. A woman without knowledge in today's technology and wow... it was enough and easy to use for her! Thank You and God bless you", "verified": true, "helpfulness": "0/0", "author": "Juan Pablo Rodriguez \"History Maker\""}, {"rating": 4.0, "review": "Despite being relatively close to a wi-fi source -- an Apple Airport Express operating as a range extender, about 25 feet away-- picture is low-res, and pixilates frequently.", "verified": true, "helpfulness": "0/0", "author": "Dean Smith"}]