[{"rating": 2.0, "review": "No to my liking-apparently doesn't support my d/l speed of about 1.3mbps!", "verified": true, "helpfulness": "0/0", "author": "Sterling Johnsen"}, {"rating": 1.0, "review": "Kept turning off because it was overheating sent it back", "verified": true, "helpfulness": "0/0", "author": "Alejandro Villegas"}, {"rating": 5.0, "review": "Awesome. Installed PLEX on it, now we can watch movies from my media server.", "verified": true, "helpfulness": "0/0", "author": "Mattr762"}, {"rating": 1.0, "review": "roku is a great idea but every model of it is has very poor programming. They constantly lose the ability to contect to your wifi signal and will not reconnect. The units do not forget your wifi setup even after doing a factory reset and won't work. Although customer support is available they lack the knowledge of how to fix the issue. Now someay say that I don't know what I'm doing and that I need to reset my router but considering I do know what I am doing and the other 30 pieces of equipment in the house do not have a problem and both of my Roku's do each time they lose electric current there is no doubt it's the product. It's sad because it is a nice product. Also they do not support veriozon fios.", "verified": false, "helpfulness": "0/0", "author": "The Doctor"}, {"rating": 4.0, "review": "The software runs a little slow, but I knew that these units could be a tad slow before purchasing.Other than that, it's a good product and I'm still finding new services and streaming options via third party apps a few weeks after first having set it up.It does seem to be one of the better products of it's kind and the price is very competitive in relation to other competitive devices.", "verified": true, "helpfulness": "0/0", "author": "Mr. J. Macleod"}, {"rating": 5.0, "review": "Everything I expected and more. A great value.", "verified": true, "helpfulness": "0/0", "author": "Don DeFerbrache"}, {"rating": 5.0, "review": "This is my favorite from Roku.Super fast and easy to carry around to watch Netflix and more.Recommended.Easy to use!", "verified": true, "helpfulness": "0/0", "author": "adriana"}, {"rating": 5.0, "review": "the Best", "verified": true, "helpfulness": "0/0", "author": "Luisao"}, {"rating": 5.0, "review": "Great experience", "verified": true, "helpfulness": "0/0", "author": "Nathan Woody"}, {"rating": 2.0, "review": "Very cool. Works great.  Very happy", "verified": true, "helpfulness": "0/0", "author": "Tom Woodworth"}]