[{"rating": 5.0, "review": "With a $49 one time purchase, I'm taking full advantage of Amazon Prime streaming benefits.  Soooo much to choose from with Amazon Prime including PBS programs.Just plug the Roku Stick into an HDMI port on the TV.  No software to load.  Amazon makes it so easy to register.  The menu is super easy to use.  Started streaming 10 min after I got it out of the box.  Would have been faster if I'd have found the HDMI port faster.  No need for instructions.  Glad I waited for the stick because it's a super bang for the buck.  Don't notice any difference in quality of speed between Roku and cable.", "verified": true, "helpfulness": "0/0", "author": "Aileen \"Distinguishing Shopper\""}, {"rating": 5.0, "review": "This little guy works so well that I bought a second one. Just try it out for yourself and see.", "verified": true, "helpfulness": "0/0", "author": "Lmrf10 \"Lillian Flores\""}, {"rating": 1.0, "review": "Roku need to do some work on this product.  The streaming is temperamental on this stick you always have to get up to plug and unplug it to get it to work.  If you have not used this in a couple of days you have to unplug and reset.  It is annoying.  I think I will give this to my daughter and buy a box.  Great concept because you free up space where the box would be but needs a lot of work.", "verified": true, "helpfulness": "0/1", "author": "Pauline"}, {"rating": 5.0, "review": "If you're having trouble deciding which Roku model to get, let me try to help you out.Unless you need/prefer to plug your Roku directly into an ethernet cable, or you really REALLY want to be able to plug headphones into your Roku remote, or if you have children who will be entertained for hours with Angry Birds Space - the streaming stick will save you money and work perfectly fine.By purchasing the HDMI model, there's no need for an HDMI cable. You plug the \"stick\" right into your HDMI port on your TV, and the stick to the power source and you're done. One less cord to buy and have in that mess of cords we all have in our \"entertainment center\".Once you're plugged in, setting it up is so simple, anyone who can read can do it. It does take a little time and typing with the on-screen keyboard is putsy but, once you're set up, unless you change a password, you don't have to worry about it again.I haven't checked out ALL the other channel options yet but Amazon Prime and Netflix stream very nicely. The faster your internet, the better your picture quality of course but, that's not the Roku, that's your internet.Another nice plus I can already see if for traveling. As long as there's an HDMI tv and Wifi where you're going, just slip the Roko, power cord, and remote into a zip lock bad and throw it in your suitcase. Score!", "verified": false, "helpfulness": "0/0", "author": "AMS"}, {"rating": 5.0, "review": "Love it! Wish I had known about it sooner.  Will get another one.Easy to install and use.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "Sharon Moore"}, {"rating": 5.0, "review": "This is a great product for anyone who wants to cut their ties with the greedy cable or satellite tv providers. You can now pay a one time purchase price and receive tons of free programming or you can purchase other programming that you want. Thank you ROKU", "verified": true, "helpfulness": "0/0", "author": "Dennis Weeks"}, {"rating": 1.0, "review": "I have four Rokus in different rooms. I love it but if you want one don't but the stick. it goes out repeatedly and there is l long process to get it going again and often it will tell me there is no internet when all my other wireless devices are working.  I really like the Roku but not the stick.", "verified": true, "helpfulness": "1/1", "author": "Patricia Houttekier \"PAT H\""}, {"rating": 4.0, "review": "The Roku Streaming Stick works, but is a little on the slow side. I say this because I also have a Roku 3 on another TV in the house that is very responsive. The Roku Streaming Stick is good if you are looking for a less expensive Roku device that is more affordable. That said, I love the amazing amount of TV content that Roku brings.  I have since \"cut the cable\" and no longer subscribe to my local cable provider.  Who need to listen to commercials?  Either Roku you pick I am sure you will be happy!", "verified": true, "helpfulness": "0/0", "author": "Robert  S."}, {"rating": 4.0, "review": "This is my third roku the other 2 were both roku 2 xs's both setup very easily and still work great to this day.  This stick however didn't it would see my internet connection and connect to my network but would drop out when it tried to connect.  Finally after 3 or 4 reboots it connected and stayed connected.  After that it was a fairly smooth setup.  Everything else is normal roku greatness.  My only other complaint is the remote has 4 shortcut buttons that are very in the way and easy to hit when picking up the remote.  Its quite annoying to grab the remote to pause or rewind a show and have it switch to crackle or ask me to add the Netflix app. Then I have to navigate all the way back into my plex app or amazon app or whatever I was watching it's a minor thing but kinda frustrating.  Other than that the Bluetooth remote is a dream and requires little effort to learn over the regular remote.  And as always the apps and functionality of the roku can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Richard W. Walker"}, {"rating": 5.0, "review": "I write a review before, doesn't Understand why wasn't posted it, but, here I'm; I do really Like this Roku device, it work Perfet on the back of our tv, is small, very easy to adapt and more easy to use, really like, my Kids love it; it came in perfect conditions, and the deliver from amazons was Faster than what I expected.  The Price is very reasonable and for the amount We use at Home, We are delight with it.", "verified": true, "helpfulness": "0/0", "author": "Negis"}]