[{"rating": 3.0, "review": "the only thing I can find fault with the 3500 streaming stick is, in order to get it to started I have to change the batteries even tho they are new ones. I wish someone could tell me what the problem is, or exchange it for one that works. I contacted roku they helped get the 3500 set up but they could not get the remote to work without changing the batteries.", "verified": true, "helpfulness": "1/2", "author": "charlie t. hodges"}, {"rating": 5.0, "review": "Awesome device for only 50 dollars", "verified": true, "helpfulness": "0/0", "author": "Crazyfish47"}, {"rating": 5.0, "review": "I love this thing.  A great alternative to cable when you have a netflix and prime account.", "verified": true, "helpfulness": "0/0", "author": "Trevor Bellon"}, {"rating": 5.0, "review": "This thing is oh so awesome...You don't have to plug it into an outside power outlet...All HDTV now a day has a HDMI connector and the USB connector on the back of the TV....and that's what I plug the Streaming Stick into...Works like a charm.", "verified": true, "helpfulness": "0/0", "author": "N. Lam"}, {"rating": 3.0, "review": "The product, performs well. But in the description of this product it should say, that NetFlix only works in USA, Canada, Ireland, that this will not work in Latin America. So, if you are thinking to buy this brand, you should verify first if NetFlix can be choose. WD TV Live Media Player Wi-fi 1080p enables Latin America NetFlix without any problems.Consider that Roku has a lot of channels, the majority of the good channels are not available out of those areas, I can say that in Latin America, I do not recommend it, if you live in Latin America.", "verified": true, "helpfulness": "0/0", "author": "Cesar Williams"}, {"rating": 5.0, "review": "I love my ROKU! I have one in my room and one in the family room!  So simple to use!  Just plug into the USB on the back of your tv and use the remote to get you registered!  You will also need to sign up with Netflix to start streaming movies!  I love it!", "verified": true, "helpfulness": "0/0", "author": "Char Diamond \"Mrs. Diamond\""}, {"rating": 4.0, "review": "Terrific item for the price.", "verified": true, "helpfulness": "0/0", "author": "Sylvia \"Sylvia\""}, {"rating": 1.0, "review": "Horrible. Intermitent WIFI connection on this device. Other devices in home are rock solid. Spent more time rebooting Xfinity router than watching Roku. Speed test is good. Will reboot both devices and it will run through network check with three green checks and then fail seconds later. Release this product when it works. Outside Amazon return date. Glad Comcast, Roku, Amazon all made their money. Can watch Netflix fine on other devices like iPad and Mac but Roku blows.", "verified": true, "helpfulness": "1/4", "author": "John A Windus"}, {"rating": 1.0, "review": "This is totally useless if you plan to use this in a Hotel or any other location that requires that you pass through a secondary authentication screen such as \"Accepting Terms od Service\", \"Providing Hotel Room Number\", Etc.The only work arounds available are to purchase a seperate Wifi Router to set up seperately or Hacking your computer to spoof the MAC address of your computer in order to connect the Roku under the pre authorized address.I was drawn to this product by it's convenient size for travelling.  Bringing along a network router or setting a a laptop and going through the complicated process of spoofing my mac address defeats the purpose of buying a pocket sized device.  I would be better off just streaming directly from my laptop.I'll be returning this product on my return from this trip.", "verified": true, "helpfulness": "3/3", "author": "James Connolly"}, {"rating": 5.0, "review": "I really like it to much!", "verified": true, "helpfulness": "0/0", "author": "Sebastian Vallejo \"malchuchaki\""}]