[{"rating": 5.0, "review": "Instant hookup, easy to navigate, no buffering problems. It's a must have for non-smart tv owners or for Amazon Prime users. It's truly a no-brainer...", "verified": true, "helpfulness": "0/0", "author": "R. Vatalaro \"Vat69\""}, {"rating": 5.0, "review": "Worked as advertised. We can even access youtube through the IPhone. Cool trick. Much more flexible than the Xbox and WII.", "verified": false, "helpfulness": "0/0", "author": "digitalsavant"}, {"rating": 5.0, "review": "Having used both chromcast and Roku, I have been happy and impressed with the performance of Roku. Very easy use and the number of channels available in US and UK is great. The Youtube app can be better as once scroll the fwd the video or search easily, at same time the option to pair with smart devices like Ipad and iphone works great.", "verified": true, "helpfulness": "0/0", "author": "N. Chopra"}, {"rating": 1.0, "review": "I put a one star, because I hate it when it has no mentioning of captioning, yes I am deaf, I would love to see if it does have captioning. I would love to hear from anyone. I know that Hulu Plus, has HORRIBLE selection of captioning. We asked the company about this and they admit that not many captioning, so I went back to Netflix, because every show is captioned! WTG Netflix. Now this new gadget...ROKU, is it captioned? Please let me know. I do not want to be wasting my money!", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I use this one when I travel. I plug it into the HDMI port and the USB port on the HD TV and it works great. Only problem is you can not change the DNS address. I guess the DNS is hardwired into the Stick. Older Roku boxes you can alter the network settings. If I could change the DNS like I can with other streaming media boxes, I would give it 5 stars. If you have to use the plug, it is 110/220 so it is great for traveling. The Roku 2 is only 110.  make no sense.Delivery was fast.  Great Product.", "verified": true, "helpfulness": "1/1", "author": "Nomad"}, {"rating": 3.0, "review": "Great to have but remote stopped working after 3 days. Had to download app on phone", "verified": true, "helpfulness": "0/0", "author": "Anthony S Griffiths"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Richard Schneider"}, {"rating": 2.0, "review": "I loved the 3500R for about 3 months but it was very slow in loading, then it stopped working completely. It looks like this is a common problem. I would rather have had the Roku 3 or Amazon FireTV.", "verified": true, "helpfulness": "0/0", "author": "Supeng63 \"supeng63\""}, {"rating": 5.0, "review": "Love it! Between Amazon Prime, Plex (for streaming my own content), and the TWC channel, this is perfect. Super simple set up, no problems yet (had for a few months). Will keep this updated if problems arise.", "verified": true, "helpfulness": "0/0", "author": "Tom Desimone"}, {"rating": 4.0, "review": "I added the streaming stick to my family of Roku players after one of my old ones had some connectivity issues. I really like the updated menus on this interface. The stick plugs directly into my television, however, I do need to attach a power cable to the stick in order to have it work -- my television is about 3 years old and does not have powered USB ports. The only reason I don't give the streaming stick five stars is because the selection and menu load time seems very long compared to all other Roku models I have owned.", "verified": true, "helpfulness": "0/0", "author": "omgsrsly"}]