[{"rating": 3.0, "review": "I LIKE THIS ITEM, BUT IT IS VERY HARD TO LEARN AND HOW TO USE! YOU HAVE TO SIGN UP FOR EVERYTHING, AND IT CAN GET VERY COSTLY! AS THE DIRECTIONS GO, WHICH WERE NOT REALLY HELPFUL. I HAD TO CALL FOR  CUSTOMER SUPPORT WHICH THE CUSTOMER SERVICE REPS WERE GOOD ABOUT ANSWERING ALL QUESTIONS!! THE JURY IS STILL OUT ON THIS PRODUCT...", "verified": true, "helpfulness": "0/2", "author": "Sandra Forgan"}, {"rating": 4.0, "review": "The only shortcoming is the remote. I don't like that I have dedicated buttons pointing to \"Blockbuster\" and \"MGo\".I was able to program it without using a CC by using their technical support chat feature.Amazon Prime and HBO Go is outstanding on this. The quality has been better than using my chromecast (which of course doesn't have prime).", "verified": false, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "I own two(2) Roku 3 units and wanted to expand Roku capabilities to some other locations in the house (Kitchen, Studio) with small screen TV units. The Roku stick is as good as rhe other Roku products (albeit with some less functionality than the Roku 3. The unit plugs into the USB port on the back of the TV ( Samsung HD units) and is powered by the USB so no electrical interface is needed. The remote is the high quality as all Roku units but without the wireless headphone capability of the Roku 3.All app access is the same as other Roku units. If you plug to USB for power the unit must power and load eacch time TX is powered on, as opposed to having unit constantly powered and on when powered by power supply( not a big thing). Would buy Roku 3 where full functionality is desired, but use Roku stick where less functionality and lower price is acceptable.", "verified": true, "helpfulness": "0/0", "author": "Steve Paul"}, {"rating": 4.0, "review": "I had an older model and liked it.  So when the newer, more compact model was available I bought it. Operates real well.", "verified": true, "helpfulness": "0/0", "author": "Bren"}, {"rating": 5.0, "review": "I bought this to replace my 1st gen Apple TV . It arrived well packed and quickly. Set up was VERY easy, about 5 minutes out of the box and I was surfing all the options. (This is amazing because I'm the anti tech) would definitely recommend this my friends.", "verified": true, "helpfulness": "0/0", "author": "jetersan"}, {"rating": 5.0, "review": "After purchasing this and a digital antenna for next to nothing, we were able to cut the cable cord. We now pay $0 and can't tell the difference!! Very satisfied customer. Think about it... one time purchase for half the cost on one monthly cable bill! Boom. Done.", "verified": true, "helpfulness": "0/0", "author": "Debi C."}, {"rating": 5.0, "review": "Roku has a real winner in this streaming stick.  It does the job of its big brothers equally as well.  Plug it in, and follow the simple directions to connect.  Because there is no keyboard on the remote, be prepared to connect to your Roku account with a computer/device.  We own another Roku style, and are pleased with both of them.", "verified": true, "helpfulness": "0/0", "author": "Tuffys"}, {"rating": 5.0, "review": "It plays everything from a media pc through the plex app wireless. You rename your library to organize as needed. Need a good rig though to transcode on the fly with certain mkv files but plex plays all formats and you don't lose quality at all. Even music can be played along with tv shows and home movies/pictures without a cat cable. I do have a nice setup and have a ccna so I know how to setup networks, which may not be the norm so don't take what I say as what you'll experience. From what I've seen streaming through the plex app though at best quality settings, there is no skipping or loading after the initial retrieve and it even streams perfectly through a much slower slower vm.Then you have the other roku apps and a nice menu to navigate through. It has so many channels- even off the wall ones like Hmong Tv. I haven't tried the roku 3.", "verified": true, "helpfulness": "0/0", "author": "Ben B"}, {"rating": 4.0, "review": "I am very pleased with the picture quality of the little stick.  It was easy to install and very discrete behind the screen.  As some have reported it does need to be connected to the external power supply as it will work, but just not as well when connected to the TV USB port.  The only downside other than that is it is slower to respond to controller input than the ROKU HD set top box we were using and Netflix is VERY slow to load up.  The rest don't seem as slow to load for some reason and there is no difference in streaming once loaded.  The excellent ROKU content choice is the same and the price is good.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Although I've not taken the time to do much with the Roku stick as I always use it just for Netflix, I am very pleased with it so far!  Fairly easy set up and I can now watch all my Netflix movies on the big screen!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]