[{"rating": 5.0, "review": "I love this Roku Streaming Stick and highly recommend it.  It is light, fast, functional, and affordable.  I used to have cable, now I don't.  What I do have is more money in my pocket.  Thanks Roku!", "verified": true, "helpfulness": "1/1", "author": "Iron Man"}, {"rating": 5.0, "review": "Cant rave more about this unit. I use it for travel and plug into hotel TVs when the hotel selection is poor.", "verified": true, "helpfulness": "0/0", "author": "phoneman"}, {"rating": 4.0, "review": "So after tons of reviews of apple tv, amazon's tv and roku variations I decided to go with this Roku stick. It was simple and exactly what I needed. I just wanted to get TV in my bedroom for those once in a blue moon lazy Sundays.The only problem was while I have a \"newer\" TV (within the last 5 years) my HDMI port is located directly under the stand for my TV and with the power cable connected to it the Roku it wouldn't fit. Which means I had to buy an adapter if I wanted to keep it. Not a big deal... just a bummer when all I wanted to do was plug and go.I'll check back after I receive the adaptor and let you know if the Roku works with the HDMI 90 degree adaptor.", "verified": true, "helpfulness": "0/0", "author": "Walter L. Fields Jr. \"Soon to be camper\""}, {"rating": 5.0, "review": "I bought this for the small 19\" tv i installed in the kitchen for my wife. The ordinary roku was just too but and required LOS to operate. So i bought this and was pleased with the speed and the ability to operate wwithout Line of sight to the device... HOWEVER one BIG issue. The tv i bought my wife for the kitchen i know would be exposed to grease and steam etc so i did not buy a nice one as i know i woule replace it every so often... so i bought a cheap black friday deal. IF YOUR TV DOES NOT HAVE A POWERED USB PORT YOU NEED TO RUN THE POWER CABLE.... now that is not a huge issue for all the rest of the tv's in the house as all of them have usb ports that work... but check your tv to make sure it has a USB port. ALSO the dongle is not small only a little smaller than the remote... so check thte hdmi port you will be putting this in to make sure it has clearence. I had to buy a 90 degree hdmi adaptor or mine yould not fit as the cheap tv has a down firing hdmi but has a lip blocking the dongle. I later decided i did not like that and used the 90 degree adaptor ro run a short hdmi cable and velcroed the dongle to the back of the tv so the weight of the dongle AND the power cord would not cause connection issues.PROS-SUPER easy to connect...less that 2 minutes-The speed difference between the Roku LT and the Roku HD and this are undetectable.. there is a bit of a difference between this and the roku 3 though.-Remote does not need to be pointed at anything for it to work.-Decent wifi speedCONS-Length of included usb cable could be longer-It has an MGO(what the heck is that?) and a block buster hard button but no HULU or You Tube??? Seriously who approved that?-They seperated the OK button from the cross... sighh i liked it when the OK button was in the middle.. the only thing i do not like about the roku 3 remote.-Battery powered option would be nice for the dongle.", "verified": false, "helpfulness": "0/0", "author": "Robert Kirkpatrick"}, {"rating": 3.0, "review": "I think that the product is good, but MAIN issue is that it's not ready for using outside US. Many channels are not available for using in other countries. Even important ones as Netflix.", "verified": true, "helpfulness": "0/0", "author": "Juan Ignacio Beade Harbin"}, {"rating": 5.0, "review": "Great device. Still trying to hook my Facebook to this device. Their screen days to enter the Access Code appearing on a device logged into Facebook.com/device.There is no site on the net with that address.Where is it and how do you activate the stick ?", "verified": false, "helpfulness": "0/0", "author": "geojerry"}, {"rating": 3.0, "review": "I like ROKU interface and it offers good amount of apps. However, I am rating it 3 stars because of the remote control. I have to change batteries every week!!! It is ridiculous and getting pretty costly. If i didn't miss the deadline for return, I would get Amazon fire TV or ROKU 3.", "verified": true, "helpfulness": "0/0", "author": "antares418"}, {"rating": 5.0, "review": "Works beautifully.  Now I can watch Amazon Prime on bedroom TV.  My speed too slow for Roku3 or Amazon Prime TV but the stick works.  Simple to install and easy to use.  Life is good.", "verified": true, "helpfulness": "0/0", "author": "ThriftMaven"}, {"rating": 5.0, "review": "This is by far THE best value of any streaming device I've ever used, owned, or heard about.I didn't buy chromerap for many reasons, but in that market this 50$ device WITH REMOTE is top notch.I own a Roku 3 for my larger system, but this is all you need for your other TVs in the house.Think of this as the \"Non-DVR\" STB complimentary piece in your system.  It's fast for what you pay for.I heard some users say there's a lag, but you get what you pay for. Get a Roku 2 or 3 (at 75$ +) if you care about the split second delay vs the price and functionality gained from this.It truly does turn any TV into a Smart TV so you don't have to care that the NetFlix (Crap!) software is or isn't pre-installed.The only complaint I have is that it does interfere with my HDTV antenna while plugged into the TV USB.I haven't fully tested it with only being plugged into the wall, but the simple fix is to unplug it when not in use.", "verified": true, "helpfulness": "0/0", "author": "KCMoSoxFan"}, {"rating": 1.0, "review": "This review is for the Roku 3500R HDMI Streaming Stick.When I received the device it would not work with none of my TVs when plugged into the HDMI ports.  When I contacted Roku support about they immediately said that they would send me an HDMI extender that would fix the problem.  I asked them why they were so sure a simple extension cord would fix the problem and they said that there was a known defect with the HDMI connection on the 3500R being too short and not making contact with most TVs.  It took a few days for the part to get to me and it did fix the problem, but just barely.  You have to hold your tongue just right for the 3500R to make a connection, even with the extender, and if it gets moved even the slightest, it loses connection.Once I got it to work, I thought my problems were over.  I thought wrong.  The device gets extremely hot and freezes up and has to be unplugged to unfreeze it.  After a long troubleshooting session and Roku support, it was finally revealed that the Roku 3500R is an HD content ONLY device that requires a minimum of a 3.5 Mbps internet connection to work.  Roku recommends at least a 5 Mbps connection for best performance.  Of course this is stated nowhere in the documentation or on the Amazon.com ad page.  The bottom line is that people who have a basic cable or DSL internet connection cannot use the 3500R.  I have a good solid 3 Mbps connection and I cannot use the 3500R with my connection according Roku tech support.  Roku support emphatically stated that the 3500R will only stream HD content.  I was very surprised to find out about this limitation. Most other internet streaming devices I have used had smart bandwidth sensing technology and would adjust the quality of the video stream according to the speed of the bandwidth connection.  Roku support suggested that the solution to the problem I was having with their device was for me to spend another $30 a month to increase my bandwidth to make it compatible with their device.  I AM NOT KIDDING! I asked them if Roku thought it wise to make an internet streaming device that would only be usable by a small fraction of internet users.  They had no comment.  I asked them why this LIMITATION was not mentioned anywhere in the documentation or in the advertised specs?  Their response was that; \"The 3500R is a beta product and they were still working all the bugs out.\"  These are Roku's words, not mine.THE ROKU 3500R IS A BETA PRODUCT WITH BUGS!  Wow!  Glad to know that Roku has no problem selling a product that is buggy and has known defects and crippling limitation.  Not to mention using all of us as unpaid beta testers.Aside from the hardware defects and software limitations and bugs, the 3500R would be a nice streaming device, but there are some features I immediately found lacking in the interface as well.  Here are the features found lacking.1. No Free Content filter option:The main reason I got the Roku is to watch free content. I have never and never will pay for cable or satellite TV.  I am satisfied with watching commercials to pay for my TV habit.  The problem is that most of the channels that Roku promotes are paid channels or subscription channels that require you to have a cable or satellite subscription.  Now I understand that this may be good for some people, but why not offer an option to list only free content for people like me. I mean, if you are like me and are looking for free content only, you will spend hours wading through Roku's endless menus to find something to watch.  It takes 3 to 4 steps on each channel to find out of there is any free content available, and each time you have to go back to the beginning and start all over again.  This takes several minutes each time you try a new show or channel because the 3500R is very slow to load.  It would be great if Roku would add an option to the menu that would allow you to list only free content.  It would save users hours of time wading through hundreds of paid and subscription only channels and content.2. No Parental Controls or mature content filtering.As a parent that likes to filter what my child watches (especially what they can access when I am not around) I found it to be a huge oversight that Roku does not offer any kind of parental controls or content filtering options.  Just like with trying to find free content, you have to go through multiple steps to see what the ratings of shows are.  If you are a parent, let me warn you right now, the Roku can access almost ANY kind of video on the internet and there are even channels that are dedicated to adult content that your kids can access without any restrictions.  It would be great if Roku would add an option to filter all content by a rating system and/or require a password or pin to watch anything over a certain rating. I find it appalling that in a world where our children are being targeted by perverts, that a responsible company would not make filtering adult content for the protection of our children a priority.3. No Access to Network TV channels like ABC, NBC, and CBS.There are a few shows that I like to watch that are on network TV.  I have an HTPC contacted to my TV as well and I use it to go directly to these channels via a browser and watch these shows.  I was very surprised that the Roku has none of these channels and only offers these shows (which you get see for free in a bowser) as a \"Pay per Episode\" option.The Bottom Line!If you have a Nintendo, X-Box 360, Smart TV,  HTPC or any other device that allows internet streaming, you have no need for a Roku of any kind, especially if you do not have some type of cable or satellite TV subscription service.  A Roku device offers no advantage over a standard internet browser and is actually a lot more limited.  You can access everything a Roku can right on your computer, actually you can access a lot more from your computer.  You can access HULU free from your computer, not from Roku (Paid Hulu Plus only).  You can access Network TV shows (CBS, NBC, ABC etc.) from their home site for free on a computer; not from a Roku.  You can install parental controls on you computer, not on a Roku.  You can connect any desktop or laptop and most tablets to your TV to use it as and HTPC and get all the content on the internet you want right on your TV.If you already have a cable or satellite subscription it might be worth it to get a Roku, but aside from that, I can't really see any advantage to the Roku.  Actually, all I see is disadvantages, and that is not even considering the hardware and software defects and limitations of the 3500R.", "verified": true, "helpfulness": "3/5", "author": "Vaughn \"The answer man!\""}]