[{"rating": 4.0, "review": "Love the ROKU, but this ROKU Streaming Stick would only work on one specific television (not the one I intended to use this on unfortunately). The streaming stick would load on any TV, but would get stuck after the system booked up and there were some connectivity issues.", "verified": true, "helpfulness": "0/0", "author": "Brandy S. Gee"}, {"rating": 5.0, "review": "Works very well, ton of channels and more entertainment than I know what to do with.  It is a bit laggy on the button presses and loading times but only on occasion and never even close to being unusable, just noticeable.  Probably wouldn't even think twice about it if I hadn't used my friends Roku 3 which is pretty obviously faster.  If you want something that is easy to pack up with you then get this, if it will be home all the time go Roku 3.", "verified": true, "helpfulness": "0/0", "author": "R p"}, {"rating": 5.0, "review": "I have this and the Amazon Fire Stick. I prefer this device because the interface is so much nicer. It might be slower than the AFS, but the AFS menus are just one big sales pitch for their services.", "verified": true, "helpfulness": "0/0", "author": "MattyD"}, {"rating": 4.0, "review": "This is my first Roku product and I really like it.  And when the kids misplace the remote, I like being able to use the app on my phone.  If only my wireless modem were as reliable...", "verified": true, "helpfulness": "0/0", "author": "Monica Waitz"}, {"rating": 5.0, "review": "Bought this for my mom as a Christmas present. She already has a roku for her living room, but she was excited knowing she can take this anywhere with her and plug in!", "verified": true, "helpfulness": "0/0", "author": "laurenfrom609"}, {"rating": 5.0, "review": "Smooth little device. We have two of these and a smart tv. Giving up the dish network bill for awhile as these give the kids tons of options! Hook up was easy just plug and play.", "verified": true, "helpfulness": "0/0", "author": "oz \"oz\""}, {"rating": 5.0, "review": "The device is excellent for turning a regular HD tv to a smart one. Easy to connect and the quality is great depending on the Internet connection.", "verified": true, "helpfulness": "0/0", "author": "Shiblee86"}, {"rating": 4.0, "review": "Depending on the USB connection on your TV, it may be out of reach for the remote IR signal, which makes it difficult to change channels. The solution is to download the remote control App on your phone and control it that way. The other issue is that the App is not available for tablets (at least the one from the Apple Store, I don't know about the Android options).It would deserve 5 stars if wasn't for the difficulties of controlling it thru the remote control.", "verified": true, "helpfulness": "0/0", "author": "SG"}, {"rating": 4.0, "review": "I was debating getting a streaming stick vs streaming box, and I am very pleased with the stick. There is a very minor lag between the device and remote, but I don't find that to be much of an issue considering it's about half the price of a box and I use it for streaming only (no gaming).  Plus, I love how compact it is. I don't lose any counter space like I would to a box. I was so pleased I ended up buying second one for a different tv.", "verified": true, "helpfulness": "0/0", "author": "corrie jay"}, {"rating": 4.0, "review": "Surprisingly very good. Watching whatever I want. Remote very convenient.", "verified": true, "helpfulness": "0/0", "author": "Elpeacen \"Elpeacen\""}]