[{"rating": 5.0, "review": "Great delivery, on time...love it", "verified": true, "helpfulness": "0/0", "author": "Cheri Starkey"}, {"rating": 5.0, "review": "Works great,  good as new at a better price.", "verified": true, "helpfulness": "0/0", "author": "J. Schaffer"}, {"rating": 1.0, "review": "The remote control for the Roku Streaming stick is completely worthless. Apparently it uses the same frequency as your WiFi devices and loses it's sync to the stick constantly. It's frustrating and useless. Obviously Roku doesn't understand what kind of devices the average person uses in their living rooms these days and also couldn't be bothered to make the item a little more robust. Don't waste your money as you will just end up throwing it in the trash.", "verified": false, "helpfulness": "0/0", "author": "Garage Days \"World renowned procrastinator.\""}, {"rating": 5.0, "review": "Very quick and easy setup...as all Roku devices are.  It took no longer than 10 minutes to have the device installed, connected, and loaded with all of the apps (channels) that are on my two other Rokus.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 3.0, "review": "We have a regular Roku on one of our other TV's so I was familiar with the service.  I bought this to use on a smaller, wall mounted TV.  I love Roku but find that the HDMI stick version is a bit more finicky than the regular Roku we have in the other room.  It looses connection to our WiFi pretty often.  Sometimes it seems random, other times it will disconnect if someone slightly touches/moves the tv or even walks around the room.  Shouldn't be my WiFi, considering I have other products connected to it, including a computer that's in the same room as this Roku, and they never disconnect.  If/when I need to replace one of our current Rokus or buy a new one, I think I'll stay away from this particular model in the future.", "verified": true, "helpfulness": "0/0", "author": "MD"}, {"rating": 4.0, "review": "As of right now its good so far but you have to constantly set up apps and log back in again and again over time", "verified": false, "helpfulness": "0/0", "author": "khatreyis"}, {"rating": 1.0, "review": "can[t get it to work consistently", "verified": true, "helpfulness": "0/0", "author": "shauna sheridan"}, {"rating": 5.0, "review": "Gave this to my technologically impaired parents and tied all accts to mine and BOOM - they're loving it! My hope is long term, this will get them off of needing DVR and cable. Its super easy to set up - so much so that the troubleshooting page on Roku's site basically is non-existent. If you are looking for a great option for streaming and don't have a smart tv, this is it.", "verified": true, "helpfulness": "0/0", "author": "KD"}, {"rating": 5.0, "review": "This little baby gets a workout in my house. No problems at all. I recommend.", "verified": true, "helpfulness": "0/0", "author": "RB916"}, {"rating": 5.0, "review": "Worked well  easy-to-use. All the virtue of Roku. My only problem was that my HDMI ports were too close together for me to use both at the same time because of the width  of the stick. But the problem was quickly solved by visiting the Roku site and ordering a short extension cable that is free to Roku owners. The cable arrived in two days of ordering.", "verified": true, "helpfulness": "0/0", "author": "Larry hoffert"}]