[{"rating": 4.0, "review": "Does the same as roku 3 and flows as well too. Completely concealed behind ultra thin tv but some times loads a couple times during streaming but could be cuz it's behind the tv not sure", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 1.0, "review": "This Roku device is extremely slow, sometimes you have to wait a few second even to move a cursor frame from one app icon to another (no, I'm not kidding). Netflix app loads at least 15-20 seconds. It took 4 attempts even to establish wireless connection to my router (top-of-the-line TP-Link Archer C7 AC1750). All my other Roku devices (Roku 3, Roku 2XS, Roku MHL Stick) do work just fine in other rooms & floors. Maybe my unit is simply defective, but I wouldn't suggest anyone buy it.", "verified": true, "helpfulness": "5/8", "author": "Alex"}, {"rating": 5.0, "review": "Setup was a breeze. However, after 2 days I still cannot successfully select and stream anything as the screen goes black and then I get the Jumping Roku, and finally back to the menu. Tried to select something again and the death cycle continues. There was one exception. After several attempts, I made it to setting in the menu and determined that my wireless signal strength was rated Excellent. So much for a connection problem.UPDATE: Now upgraded from 1 star to 5 stars. I took the advice regarding insufficient USB power and plugged it into the included Roku AC USB adapter and now the Stick is working properly! The USB port near the HDMI connections on my Sharp LC-70UD1U, though labeled USB1 5V 500ma, apparently does not put out the claimed current (500ma is max for USB 2.0). I did not like the now dangling USB cable below my wall mounted HDTV to the USB adapter and for the helluvit tried powering the Roku stick with the HDTV's USB2 port, labeled the same & near the Ethernet jack, and wallah, the Roku stick STILL WORKED!! When I review the LC-70UD1U I will need to identify this issue.Regarding the complaints about slow response, I am not experiencing this issue and would rate the stick approximately equal to the Roku 2 XS on my gigabit Ethernet LAN to a different HDTV. I am using a WD My Net N900 router, mounted about 18 ft from the stick below the floor on a floor joist with the signal going through a significant amount of wood, but still rated Excellent in the Roku settings. The 5 GHz WIFI band however was weak and not selected and only 802.11n is setup on the 2.4 GHz band. FWIW, the Charter ISP connection is 100 Mbps and it's normal to get that speed with a SB6141 modem. In short, I am pleased with this Roku stick now.", "verified": true, "helpfulness": "2/3", "author": "Pete Moss"}, {"rating": 5.0, "review": "i would recommend this product. Great user interface and remote control. Small size is a plus and it is powered by the usb port on the tv only when the tv is on. Replaced my crappy Netgear player and is night and day.", "verified": true, "helpfulness": "0/0", "author": "texcago"}, {"rating": 4.0, "review": "So far, so good, my first Roku.  Comparable to AppleTV in many ways.If you are going to buy it, and you have a TV mounted to the wall, it is very likely that there is not enough space between the wall and the back of the TV to put this in AND the monstrous power adapter that attaches to the back of it.  I need to spend another $7 and get an HDMI extender.  Roku, c'mon!  You should include a 12\" HDMI extender in the package, most people don't want to see this thing sticking out of the side of the TV with a funky wire dangling from it.And if I have your attention, Roku -- the little purple tag at the bottom of the remote?  Totally unnecessary and annoying.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I currently have several ways to stream video in my house.  XBOX ONE, PS3, XBOX, Roku 1 Player, and this new Streaming Stick is as good or better than all of my current options.  MLBTV is absolute garbage on XBOX and XBOX ONE.  I was able to watch a game with no issues in crisp HD, so needless to say I am pleased.  Netflix and Amazon Prime work without issue as well.One note of warning.  It was a very tight fit on the side of my tv to fit a second HDMI connection in with the streaming stick being a bit too wide for my liking.  Initially I could not get the streaming stick in.  I had to disconnect the HDMI cable next to it and put the Roku stick in first and then reinserted the stick.  Tight, but okay!", "verified": true, "helpfulness": "16/18", "author": "Michael P. Clarke"}, {"rating": 5.0, "review": "This is my first ever Roku and I was very excited to receive it and try it out.  I plugged it in and the Roku immediately needed to update firmware.  This took a few minutes and after that the unit kept shutting off and pausing.  I thought I had a defective unit.  I couldn't scroll through any channels.  Eventually I unplugged the unit from the USB port and plugged it into a power outlet (thinking perhaps my TV's USB wasn't supplying the needed power).  All the sudden, BOOM, it worked like a charm!  I don't know if plugging it into the power outlet helped or if it was just still updating during those freezes and restarts.  I'll have to plug it back into the USB to see if it makes a difference.  Once it got going this thing is amazing!  The image quality is better than my HD cable picture!  I've been using it to watch the WWE network and it's real smooth.  I've also used it for Amazon video and Netflix.  There is no lag, and it takes literally seconds to load the movie.  It couldn't work any better.  I have a SmugMug account and have tons of old vintage family photos and videos uploaded to my SmugMug account.  I just found a SmugMug channel on the Roku so I can view slideshows of all my photos.  I also added Plex, which seems really cool.  Roku really has a homerun with this device.  It's small, it's fast, and the image quality is outstanding.  Be patient if your device doesn't work right away out of the box.  I think it takes time to update.  If that doesn't work, try plugging it into your outlet and see if that makes a difference.", "verified": true, "helpfulness": "29/36", "author": "The Perfectionist"}, {"rating": 4.0, "review": "I started looking for a streaming replacement solution other than my Ps3 slim because i noticed it was awfully inefficient, it was consuming around 80 watts even in idle, and also because i wanted a better solution to stream MKV files specially with subtitles.This stick was the perfect solution in my case, at the end i had to decide between this and the Google Chromecast but after a few months of using my cellphone to control playback of files with a laptop i decided i needed a regular controller, otherwise it is a pain to always have to keep looking for the extra device specially since a cell phone is much more fragile than a controller.I have seen a lot of criticism here, so i will try to point why i think most people shouldn't care about the issues mentioned on the 1 star reviews.1.- It seems like the biggest issue most people have is that it is slow to load in general (startup and loading of channels) and also that the control feels laggy.First i couldn't find the control laggy at all, i think the worse response is in netflix app but it is acceptable, other than that i noticed that the control sometimes has to pair with the roku (in case of long times of inactivity, or when first loading) so in this case the first tap would only make the controller blink and pair but the command will not work until the next tap, other than that keep in mind that the controller connects via wifi-direct, so it is recommended to use the 5ghz network in case the 2.4ghz is too crowded so that could cause lag issues.As for the loading times, here are the ones for the apps i use, so judge by yourselfFull Startup: 1 min 15 secsNetflix: 30 secsYoutube: 22 secsHulu: 22 secsAmazon: 12 secsPlex: 5 secs (only first time takes a little longer)compared to my Ps3:Full Startup: 28 secsNetflix: 33 secsYoutube: 22 secsHulu: 36 secsAmazon: 45 secsKeep in mind this times might vary depending on your connection, in my case i have a tp-link router at around 23 feet away in line in sight using 5ghz network on the roku.Also in case the Startup time is too much for you, you can always leave it connected to a wall plug, and it will be always available, unfortunately it doesn't have any kind of idle state, i checked with a kill-watt and it consumes 2.1 watts when not doing anything and around 2.5 watts when streaming in HD.2.- The initial setup of every channel takes too much timeIn my case i don't use too much channels but i don't see any workaround for this, also since you only need to do this once i don't see this as an issue with the roku stick.3.- the device keeps restarting (crashes, reboot), doesn't connect to network, etc.I didn't have any of this problems but my recommendation is that you need to plug it on a wall instead of a usb port, the restarting could be because the port doesn't give enough continuous power to the device, which in turn could be affecting the device reception. Also try plugging in different places it might be that there is something blocking the signal to the roku stick, in my case i have it connected to my receiver which is around 3 feet from my TV.4.- Can't get it to fit behind my tv.This can easily be fixed with a hdmi extension cable like the one provided by Chromecast, you can see on the roku site reviews that you can contact them in order to get a free one, it is inconvenient that doesn't have one but it also isn't advertised so it is not the product's fault, also i noticed that it is pretty wide so in the case of my receiver there is one hdmi slot that is unusable now, luckily i only needed 3 out of the 4.For anyone interested on the surround output on this device, i checked using a receiver and noticed the following:Netflix, Amazon and Plex do support surround.Youtube and Hulu doesn't, still not sure why youtube, but it seems for Hulu it is normal, their content is all in stereo unfortunately.Now the thing that most impressed me was Plex, it works perfectly i haven't noticed any single dropout or stutter when playing MKV files from my local media. it also doesn't have to transcode most formats even if they have SRT subtitles so that is something my Ps3 was unable to do, when it does need to transcode i don't even notice on the roku, i can only notice because the CPU usage gets higher on my PC, the only problem's i found so far is when the video format is Xvid which is not that common now (The issue i have with this files is that you cannot seek or resume where it left, also sometimes the audio get out of sync).So in general i am very impressed with this little stick so far and will be using my Ps3 a lot less now(only for gaming).Edit 1/15/2015: after many months of use i started noticing some inconsistencies, it sometimes get stuck on some app and need to disconnect it from power to reset it, and it appears to be a little slower, but yesterday i had a major problem the stick kept resetting itself, sometimes i was able to get to the main menu but it suddenly restarted again, i checked the reviews here and feared it may be broken now since it appears this has happened to several users, and in my panic noticed that all roku products have a ridiculous 90 days warranty, basically same as walmart.Anyway i was able to do a factory reset and it appears it all is working well and fast again, but i still have to reduce one star to my original review because of the things i mentioned and because of this major issue i got.", "verified": false, "helpfulness": "25/31", "author": "pedromvu \"pvu\""}, {"rating": 3.0, "review": "I bought this because I mounted my TV to the wall and wanted a slim profile without having to have a TV stand for my equipment.  So, I bought this Roku stick to achieve this goal.  Unfortunately, the description doesn't mention you have to have a power cord out of the side of the Roku stick, which defeats the purpose.", "verified": true, "helpfulness": "0/4", "author": "William McMullin"}, {"rating": 3.0, "review": "I have to say, i am disappointed.  I considered returning one (I purchased two), but think I will keep both, just maybe not use them as anticipated.* The streaming stick is BIG.  It's bigger than you might think.  I put one downstairs, but it doesn't \"really\" fit into the HDMI slot.  I got it to fit, but it's at a bit of an angle.  It's not ideal.  I might want to see if I can get some sort of adapter or just switch it with the older Roku I have in one of the bedrooms.* I kind of felt like a big advantage was that it didn't need a separate power supply, but it does. My newest TV is only a year and a half old.  I need to plug something into the device and then plug it into the outlet.  That's dumb.  What's the point. The older Roku devices aren't that bulky.  Very disappointing.  Finding a power supply, particularly in my 100 year old home, is always a challenge.* It gets HOT.  I am eager to see if it cools down when not in use.  I can't see a way to turn it off, but I assume it will time out and power off.There's just nothing, in my opinion, that's compelling about this device.  I think it is no better than the older devices.  I am disappointed.", "verified": true, "helpfulness": "2/4", "author": "M. L."}]