[{"rating": 5.0, "review": "Very good product ... A+++++++", "verified": true, "helpfulness": "0/1", "author": "Rachel Hall"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "1/2", "author": "Sanders R."}, {"rating": 2.0, "review": "This worked when I first set it up...then 1 month later it wont connect...keeps displayingerror...ive spent hours reloading, restarting, unplugging,researching online & still nothingvery disappointed :( & of course im unable to return now since it's been a few months", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Quality and shipping as advertised.", "verified": true, "helpfulness": "0/1", "author": "Dennis"}, {"rating": 5.0, "review": "It was a great purchase!", "verified": true, "helpfulness": "0/0", "author": "Wendy Besel"}, {"rating": 4.0, "review": "If I had filled this out a few weeks, ago, I probably would have only given the Roku three stars.  The streaming stick requires a power source to operate.  Initially, I chose to plug the USB that provides the power directly into my television.  I had constant problems with the device resetting while I was trying to find shows.However, now that I've plugged that USB into its own outlet, the streaming stick is awesome!  There's sometimes a little lag in responding to the remote, but overall I've found that the device works well.  The streaming stick also seems like the best value for the money (plus I didn't have to find somewhere to stash yet another box or run a hard line for the internet out into the living room).  It's very reliable, and I was surprised by how much free content there is out there for the Roku.The main selling point on the Roku for me is that it's the only streaming device currently supported by Acorn TV.  Roku supports all the channels I want plus hundreds more that I can add if I'm ever feeling bored or adventurous.", "verified": true, "helpfulness": "0/0", "author": "Jen Lamoureux"}, {"rating": 5.0, "review": "Now I can get Netflix and all the other programing I have been missing.  Very easy to set up and works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Joyce A. Holtz \"Ms Slush\""}, {"rating": 5.0, "review": "This is a great purchase.  I've owned the Chromestick, and it's still quite limited.  I do wish I could share my desktop or Android phone screen onto the Roku like the Chromestick, but the massive amount of apps and easy-to-use GUI make it much better.  We have watched several movies, and the quality is excellent.  I really can't say there are any cons to this device.  Registration and set-up was super easy, documentation is good, installation was simple and straightforward.", "verified": true, "helpfulness": "0/0", "author": "Chris Hale"}, {"rating": 5.0, "review": "We like ours so well, we gifted this one to my sister and they are loving it, as well.", "verified": true, "helpfulness": "0/0", "author": "Donna Reese \"dlr\""}, {"rating": 5.0, "review": "I love my Roku streaming stick it's great", "verified": true, "helpfulness": "0/0", "author": "Mari T."}]