[{"rating": 5.0, "review": "The remote is not connecting to the stick. I can netflix to work using my phone. This is how I know it's the remote", "verified": true, "helpfulness": "0/0", "author": "Judith Ho"}, {"rating": 5.0, "review": "quick set up -  works great-  cancelled cable$$$$$$", "verified": true, "helpfulness": "0/0", "author": "elly"}, {"rating": 5.0, "review": "Love my Roku! Trying to cut the cable cord and hoping this will take me there", "verified": true, "helpfulness": "0/0", "author": "L. Stein \"goldengirlz\""}, {"rating": 5.0, "review": "Simple and easy to use!", "verified": true, "helpfulness": "0/0", "author": "rosemary rivera"}, {"rating": 4.0, "review": "The remote is pretty useless, you need to use the app instead. Occasionally the Netflix app freezes or takes awhile to load.", "verified": true, "helpfulness": "0/0", "author": "RJM"}, {"rating": 5.0, "review": "Does exactly what its supposed to,great product.", "verified": true, "helpfulness": "0/0", "author": "James Lamberson"}, {"rating": 5.0, "review": "I put this on my bedroom TV so we can get Netflix on every tv in the house and it works great.  It did surprising well for it's small size.  I just wish that you didn't have to plug it into the wall to get power.", "verified": true, "helpfulness": "0/0", "author": "J. L.Shillingburg"}, {"rating": 2.0, "review": "Great little device and worked when it did.  I tried two of these units and although they are easy to set up and the principal is simple, my remote pause function simply did not work 100% of the time.  When it did not work, it took me back to the beginning of selecting the movie I was watching and then trying to find where I left off.  Totally unacceptable.  I have a great TV, the batteries we NOT the issue and I know how to drive a remote.  Two strikes and you're out ROKU.  I ordered an Amazon Fire stick to replace it.", "verified": true, "helpfulness": "0/0", "author": "Milford Duane Hickory Montgomery \"gotfish\""}, {"rating": 5.0, "review": "Works great! Love it", "verified": true, "helpfulness": "0/0", "author": "Charlie Scott"}, {"rating": 4.0, "review": "I've had ROKU since the first box.  Haven't had cable for years.  The stick takes up way less room and one less cable.  It gets pretty hot when streaming, unlike the boxes.  It stays warm when not in use.  I disconnect the power supply when not in use.  With thousands of channels available, there's always something to watch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Sew Queen\""}]