[{"rating": 4.0, "review": "This little thing is awesome! Read sum of ur horror stories! But as for now rarely if ever do I write these reviews but this little device is so awesome I was compelled to write a review for it any and everything I expected I am getting out of this device!!", "verified": true, "helpfulness": "0/0", "author": "Jii DEUCE"}, {"rating": 5.0, "review": "A really slick product. Easily installed with all that came in the box. More movie and TV shows available than I have time to watch.", "verified": true, "helpfulness": "0/0", "author": "Mr. Tazz"}, {"rating": 5.0, "review": "great product.....I barely use my cable channels .....Roku allows me to watch my amazon prime movies anytime its perfect...great speed I love it...I wish I got it sooner....", "verified": true, "helpfulness": "0/0", "author": "djidjia"}, {"rating": 5.0, "review": "They are great but are famous for the dreaded error 14.  It ALL depends on your router.  My cheap TRENDnet Wireless N 150 Mbps 18 dBm PoE Access Point, WDS, Repeater and AP Client Bridge, TEW-650AP worked GREAT, but my expensive Linksys could NOT be made to work.... Go figure...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"dennis8408\""}, {"rating": 2.0, "review": "Too underpowered. The interface is slow and stuttery. It can't change HDMI inputs like the Chromecast can, and the remote has almost no range at all, I have to have it within about 4 feet to even use it. No volume control at all on the remote either. Once it gets playing the video quality is ok for netflix and amazon. If you spend much time at all surfing through content choices it may drive you nuts, but it works.", "verified": true, "helpfulness": "0/0", "author": "James Paul"}, {"rating": 5.0, "review": "The Roku is fantastic. Easy to install and set up. I love it for Netflix. It is so easy to use. One of the best $50. I have ever spent,", "verified": true, "helpfulness": "0/0", "author": "Laurie"}, {"rating": 5.0, "review": "This is definitely better than my Apple Tv. More choices and is a lot easier to use and setup.", "verified": false, "helpfulness": "0/0", "author": "Michele McDowell"}, {"rating": 5.0, "review": "After purchasing this, we are defenetely ROKU fans. Stream all your netflix, Pandora Radio and more through this. No Cable bill for us. Gotta love it!!!!", "verified": true, "helpfulness": "0/0", "author": "CORA86"}, {"rating": 5.0, "review": "Easy to set up but if buy it used it def be good idea to restore it to factory set then set up your account 😄 then streaming it on but hope cane make it easy to hdmi mirror in future", "verified": true, "helpfulness": "0/0", "author": "pammysue"}, {"rating": 5.0, "review": "I am really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Annie"}]