[{"rating": 5.0, "review": "Bought this to replace an older Roku and this is far superior to the last one", "verified": true, "helpfulness": "0/0", "author": "J. Beane"}, {"rating": 4.0, "review": "Still trying to figure out the channels, but so far, we really like it.  At first we had a difficult time streaming our shows, but I finally did a live chat with someone on roku.com, and now it's great.", "verified": true, "helpfulness": "0/0", "author": "L. Allan \"book junkie\""}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Neermal Boojhawon"}, {"rating": 5.0, "review": "Bought tqo of these for my daughters room. I have three in my household. Since I don't want to pay for cable these are perfect sine I do have netflix and hulu. The only con is they shouls have included the headphone remote with the streaming stick.", "verified": true, "helpfulness": "0/0", "author": "T DeL"}, {"rating": 4.0, "review": "Great for what it does.  Menu can be a little slow.  Prefer Fire TV stick", "verified": true, "helpfulness": "0/0", "author": "Shannon Dillon"}, {"rating": 5.0, "review": "Couldn't program it on my Samsung  t.v. but got it programed  on my Philips and then it worked on my Samsung. My granddaughters were here to visit and it was a big hit with them. We didn't have to go out and buy movies. I would recommend it to anyone who likes to choose entertaining films without the foul language,  etc.", "verified": true, "helpfulness": "0/0", "author": "alicemd"}, {"rating": 5.0, "review": "this is my second roku product. I really like it", "verified": true, "helpfulness": "0/0", "author": "Harvey DeVore"}, {"rating": 5.0, "review": "Great product. Easy to use. Roku is my favorite smart TV substitute", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 4.0, "review": "I was initially frustrated because I plugged it into the TV USB port and the product just kept resetting, but when I called the Roku support the customer support guy told me to plug it into the wall and that solved the problem. In the diagram though it proposes you to plug it into the USB port so I think the product still doesn't work like it is suppose to.", "verified": true, "helpfulness": "0/0", "author": "Ahmed Arsalan"}, {"rating": 5.0, "review": "this stick works as well as my roku three.....at a fraction of the cost.", "verified": true, "helpfulness": "0/0", "author": "sharona \"poker widow\""}]