[{"rating": 5.0, "review": "Absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Gwendolyn Platt \"GWEN PLATT\""}, {"rating": 3.0, "review": "Easy to set up, but it takes awhile to load and to link to the WiFi. My router is in a weird spot downstairs though, so that's probably why. Otherwise, it's working great.", "verified": true, "helpfulness": "0/0", "author": "ALISON B POLING"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "azael aaron"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Henry Philip Squillante"}, {"rating": 1.0, "review": "The remote and stick will not connect.", "verified": true, "helpfulness": "0/1", "author": "Robert L Brown"}, {"rating": 1.0, "review": "Even though we connected with the internet we could not connect with the Roku.  Even with customer assistance.So I am sending back.  Kept getting error message 011.", "verified": true, "helpfulness": "0/1", "author": "PAMELA J LENGEN"}, {"rating": 5.0, "review": "I have 3 Rokus at my house.  The reason I got a stick is because I am on the opposite side of the wall where the router is.  I didnt want to cut into the wall just to put in a hard-wired cat5 cable so, this one solves that problem.  Additionally, the tv is mounted on the wall.  The Roku Stick hides nicely behind it.However, if you have access to hard-wiring using the Roku ethernet port to your router, get the Roku 2 or Roku 3 (the Roku 3 has headphones in the remote).  This will be optimal if you are watching Netflix or the like using your Roku.  The 2 & 3 also have a USB port so you can add a flash drive or external hard drive with all your movies, pictures and music... something the Roku Stick does not have.", "verified": true, "helpfulness": "0/0", "author": "karen"}, {"rating": 5.0, "review": "Our organization JW has a new TV Web site and I wanted my mom to watch at home on her beautiful TV with her grandchildren so my wife and I  purchase this for her. It's was easy to install and she has a good WIFI signal in her apartment and the HD pictures comes in awesome and she loves it.", "verified": true, "helpfulness": "0/0", "author": "full of it"}, {"rating": 5.0, "review": "Very good deal. I use with Netflix and also a lot of other services.", "verified": true, "helpfulness": "0/0", "author": "tom sutton"}, {"rating": 5.0, "review": "Love the streaming feature.", "verified": true, "helpfulness": "0/0", "author": "Bryan Hoffman"}]