[{"rating": 5.0, "review": "Works well. My kids use it daily.", "verified": true, "helpfulness": "0/0", "author": "valerie evans"}, {"rating": 1.0, "review": "I haven't quite finished setting it up...some things have come up, but the home button doesn't seem to take it back to the screen and to choose a language does not work (or maybe I am doing it wrong), anyway I will try again this week to see if I can get it to work.  so far, 1 star as I will try it again this week.  The instructions didn't seem that clear, going to have the roomie try it...maybe I am wrong, I know 2 people that have Roku and they said it was simple as pie to run, but I don't know.", "verified": true, "helpfulness": "0/0", "author": "linda"}, {"rating": 1.0, "review": "I really wanted this to work, but I couldn't get the remote to sync with the stick. It was stuck at the first screen. It ended up being great for me - I got a blu-ray player that does a better job than the stick.", "verified": false, "helpfulness": "0/0", "author": "Rochelle"}, {"rating": 5.0, "review": "Solved all my 'smart tv' issues!", "verified": true, "helpfulness": "0/0", "author": "Lesa Herman"}, {"rating": 4.0, "review": "I love my ROKU...  have one in my living room and one in my office...  I like theportable USB version because it is easy to travel with, as long as I have wifiavailable, I'm set!", "verified": true, "helpfulness": "0/0", "author": "LACQL"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "Duey"}, {"rating": 5.0, "review": "Awesome! Family Loves it, Been a few weeks since I bought it and no problems", "verified": true, "helpfulness": "0/0", "author": "Kevin Fisher"}, {"rating": 5.0, "review": "Fast shipping and so far works great.  No problems setting it up.  Thinking of ordering another for second TV.  Can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "ssgeok"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Rhonda"}, {"rating": 5.0, "review": "I am loving this, great entertainment when coupled with Amazon Prime, and affordable.", "verified": true, "helpfulness": "0/0", "author": "Roger Hall \"calmliest\""}]