[{"rating": 5.0, "review": "It is perfect for viewing Netflix, Hulu, and Amazon on our TV.", "verified": true, "helpfulness": "0/0", "author": "Leah"}, {"rating": 5.0, "review": "Works great, and very convenient to use. The number of channels available seems infinite!", "verified": true, "helpfulness": "0/0", "author": "Beverly"}, {"rating": 5.0, "review": "I decided to get a Roku over the Amazon Fire TV Stick. Roku works great! I never have any problems. It's way cheaper to just buy a Roku than to buy a Smart TV. I highly recommend this device!", "verified": true, "helpfulness": "0/0", "author": "Samantha"}, {"rating": 5.0, "review": "Fast, easy setup. Much better (for me) than Chromecast. The Hulu and RDIO buttons are useless to me and I would prefer customizable buttons, but this is a minor quibble. Completely satisfied and can recommend without reservation.", "verified": true, "helpfulness": "0/0", "author": "Stephen Greenfield"}, {"rating": 5.0, "review": "Amazing video quality and easy to use.", "verified": true, "helpfulness": "0/0", "author": "J. Buenfil"}, {"rating": 5.0, "review": "excellent product", "verified": true, "helpfulness": "0/0", "author": "james gretz"}, {"rating": 5.0, "review": "Works great plugged into wall. Game changer if you don't have cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Vest review\""}, {"rating": 5.0, "review": "I'm super excited about my Roku! I didn't have Netflix on my TV so I would watch it on my computer but now I have it on the big screen! I highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Kirsten Despino"}, {"rating": 5.0, "review": "My wife and I love it. We live out in the country where the only options for Internet are the phone company and satellite. Satellite internet sucks but our phone company internet is quite fast. We both have iPads and I have played Xbox online with no skipping or pauses. That said, we are not big television watchers so paying for cable or satellite TV makes no sense for us. This thing allows us to have a Netflix account and my Amazon Prime for movies and tv shows when we get a chance to sit down and it is fast and streams well. We love it.", "verified": true, "helpfulness": "0/0", "author": "Ramsey"}, {"rating": 5.0, "review": "It's almost pointless for me to write a review. I'm a big Roku fan. I'm not unbiased in any way. I didn't even really need this since I already have a Roku. I figure I'll have it for hotel rooms. Or when I go to someone's house and they want to watch something I can stream.It was easy to set up and works like a champ. They've been doing this for a long time (in streaming terms) so it's just a solid product line.", "verified": true, "helpfulness": "0/0", "author": "Chris Lonsberry"}]