[{"rating": 5.0, "review": "Love this", "verified": true, "helpfulness": "0/0", "author": "Robert Hayes"}, {"rating": 1.0, "review": "The Roku streaming stick worked well for about 3 weeks. It then stopped pairing with the remote, making it completely worthless. Cannot even set it up without the remote. I changed the batteries in the remote, reset the stick, unplugged the stick, you name it - it is dead.  Don't waste your money.", "verified": false, "helpfulness": "0/0", "author": "D. Lawson"}, {"rating": 3.0, "review": "We like Roku but this seems to have a latency issue with the remote. It takes a while to set up and feels a bit slow. Maybe the bigger Roku box communicates with it's remote better? I kinda feel like I should have paid the extra $40 for the box...not sure what convenience the stick provides since we keep it plugged in the TV", "verified": true, "helpfulness": "0/0", "author": "Philip Melito"}, {"rating": 1.0, "review": "Did not work. Returned.", "verified": true, "helpfulness": "0/0", "author": "Cathy M. Penley"}, {"rating": 1.0, "review": "Will not work.  On with technical support for hours. Still won't work.", "verified": true, "helpfulness": "0/0", "author": "Matthew DiDonato"}, {"rating": 4.0, "review": "Purchased the Roku streaming stick mainly to access my Amazon Prime content easily. Love that it's powered by a usb port on the television and not an additional power cord. The unit is not quick to respond, so I deducted one star.", "verified": true, "helpfulness": "0/0", "author": "Chrissy_Over"}, {"rating": 4.0, "review": "Great for watching movies & tv.  only problem was the remote.  I think it had a short in it.  Had to change the batteries 3 times in 2 weeks.  The batteries it came with did not work.  Very frustrating.  It is finally working well.  Sometimes have to still wiggle it around.  I would recommend a Roke for people who don't want to pay for the high cost of cable.", "verified": true, "helpfulness": "0/0", "author": "snugautumn \"healthy eater\""}, {"rating": 3.0, "review": "Compared to Amazon's Fire Stick, I'm not impressed with this. The UI on this device is very slow and sluggish, to the point where moving the cursor for text entry is difficult. I had to go to my desktop and create an account with Roku before using this to stream anything. In other words, Roku has my credit card even though I don't want to buy any video from them.", "verified": true, "helpfulness": "0/0", "author": "Elderberry Dogs"}, {"rating": 5.0, "review": "Very easy to set up and use. I love that the remote can be used from any direction.", "verified": true, "helpfulness": "0/0", "author": "DonHoJr"}, {"rating": 1.0, "review": "I am from Ecuador.I buy the Roku for Netflix, But I can not add this channel.I have netflix account and have to use apple tv because roku in Ecuador can not add the netflix .In Ecuador if you can use netflix .fix thisbad buy", "verified": false, "helpfulness": "0/0", "author": "daniel"}]