[{"rating": 5.0, "review": "Now I can watch something different in my bedroom from what is being watched in the living room if I choose to.", "verified": true, "helpfulness": "0/0", "author": "Linda L. Wood \"i'm lovin my kindle\""}, {"rating": 5.0, "review": "Very easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Kailey"}, {"rating": 5.0, "review": "Works as well as more expensive Roku units for streaming movies and TV shows.", "verified": true, "helpfulness": "0/0", "author": "Smyxlplyx"}, {"rating": 5.0, "review": "Great item,  just need time to work with it...", "verified": true, "helpfulness": "0/0", "author": "Suzan"}, {"rating": 1.0, "review": "doesn't work with mac books, mailed it back", "verified": true, "helpfulness": "0/0", "author": "J. M. paulk"}, {"rating": 5.0, "review": "As advertized", "verified": true, "helpfulness": "0/0", "author": "Rich \"RWS\""}, {"rating": 5.0, "review": "Excellent. Had lots of free channels.. Would definitely buy again if I had too.", "verified": true, "helpfulness": "0/0", "author": "Taylor L."}, {"rating": 3.0, "review": "While the product from the aspect of streaming performs well I've had a huge problem getting 5.1 Dolby out of it. I've spent over an hour on the phone with Roku; I had to finally leave the call when they wanted to start again from the beginning and re-initialize the unit and start again. I have not gotten back to them to start this process.  Btw.. No matter how we tried it only produces PCM liner an not 5.1.  (2) -Btw this was. Referbed unit...that could be the problem.", "verified": true, "helpfulness": "0/0", "author": "Robert Williams \"Bob\""}, {"rating": 5.0, "review": "Great product!!! I have another model of a roku, but the stick was great for the price and no hassle at all to install and great for actual use.", "verified": true, "helpfulness": "0/0", "author": "Diana"}, {"rating": 3.0, "review": "Im enjoying this product very much however I have been having issues with it shutting down frequently the light on the streaming stick keeps flickering and freezes up untill you unplug it and go through the setup again.", "verified": true, "helpfulness": "0/0", "author": "Destany Butler"}]