[{"rating": 3.0, "review": "Purchased a Roku box that I was happy with but have some wall mounted TV's and thought I could use these sticks with them.  One big problem.  They need to be connected to an electrical outlet - I only had a single electrical outlet for the TV in the wall and thus they can't be used in the way envisaged.  I have Samsung LED TV's all around 12 months old.  PS Purchased an Amazon Fire unit more recently - absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Rob Sunny CA"}, {"rating": 2.0, "review": "I wanted to love the Roku stick....but by todays standard is certainly a flawed product.  I understand that one gives up something because of its small size but I never expected to go back to 2001 loading speeds of some of the program (Netflix comes to mind).  I think the UI is a bit barren and could use more sophistication.", "verified": true, "helpfulness": "0/0", "author": "A. Montas"}, {"rating": 5.0, "review": "Just plug it into your smart tv and watch lots of stuff.No wires, no connectors.  Nifty little thing! I love it.", "verified": true, "helpfulness": "0/0", "author": "kitplanesue"}, {"rating": 4.0, "review": "The new Roku Streaming Stick was easy to setup and with the included remote controller made it easy to select what I wanted towatch.", "verified": true, "helpfulness": "0/0", "author": "D. Brill \"Gulfboy\""}, {"rating": 5.0, "review": "Woo Hoo! Happiness is what you want too do. Can I get a witness? Fuzzy Wuzzy was a bear. Cool?", "verified": true, "helpfulness": "0/0", "author": "David Martin"}, {"rating": 5.0, "review": "This little device is perfect. It allows me to watch Netflix and Amazon on any of the TVs in my house by just unplugging it and moving it to the next TV.", "verified": true, "helpfulness": "0/0", "author": "mdilling"}, {"rating": 5.0, "review": "I have a Samsung TV that has apps, but I've been noticing they look terrible on my 55 inch TV. So i looked into it & found out that the apps on the TV are only shown in 720p. So i went out & got this. OMG! It's amazing, the picture is crystal clear & having the CC is also really nice. I can't see the stick from behind my tv, i love it! It is also wayyyyy faster than the apps on the tv. I actually tried to watch Dirty Jobs last week on the TV Netflix app & it looked so bad I couldn't even watch it. So I went to check it out on the Roku & it is absolutely fantastic! I was trying to find out the power of this one Vs the Roku 3 & couldn't find anything. I didn't really want a box & i didn't need the headphones or the games thing that the 3 does. i Love it!", "verified": false, "helpfulness": "0/0", "author": "Kim \"pafpdd\""}, {"rating": 3.0, "review": "I was really excited about this purchase, and liked it very much--with one exception.  If you are a HBO subscriber through Comcast, then you will not be able to utilize the HboGo feature.  It was this feature that prompted be to buy this product in the first place because I loved the idea of being able to watch HBO shows in my bedroom rather than being chained to the living room tv where my cable box is located.UPDATE:Now, I'm completely happy with the device.", "verified": true, "helpfulness": "0/1", "author": "BGray \"Brahms fan\""}, {"rating": 5.0, "review": "its cheaper, its better, its perfect.easy to set up, i set mine up in about ten minutes while i was getting ready for work this morning and running late, no big deal. I didnt realize i would have to have the stick plugged into the wall though, its not an issue but would be nice to know.", "verified": true, "helpfulness": "0/0", "author": "chelsea"}, {"rating": 5.0, "review": "No more wires workes better than my roku box!Easy set up and easy to use!Will be buying another one soon!", "verified": true, "helpfulness": "0/0", "author": "brenda keeton"}]