[{"rating": 5.0, "review": "I have not only this model but an older Roku model as well. But I have to say the new design is refreshing and way less bulky than its older siblings", "verified": true, "helpfulness": "0/0", "author": "Nikki Lightning"}, {"rating": 3.0, "review": "I like the channels available and that it can be controlled with my phone, but I hate that I've had it less than a month and had to reset it three times. It goes completely unresponsive from the inactive screen when it hasn't been used for about 12 hours (when we switch to cable). If it didn't make us set it back up and sign back into everything every time it'd be great, but since it does it's just okay.", "verified": true, "helpfulness": "0/0", "author": "Just Me"}, {"rating": 5.0, "review": "I love the Roku device.  I already had one and wanted to get another one so that I didn't have to take the one I had from room to room.  It was a great price and I get to stream all of my movies along with other great channels available on the Roku.  I would highly recommend this item.", "verified": false, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 2.0, "review": "** Pun intended with review title.If this is going to be your first streaming media device...- Go with the Roku 3 instead, the price difference is worth it because its a much better, smoother, and cleaner experience.If this is your 2nd streaming media player...- this is best used as either a backup or bedroom streamerThis is not...- A primary streamer, it can get sluggish.- A Roku 3 in a smaller package (see above)Final Thoughts:I want to like the Stick, as I wanted to like the Chromecast... However, their price points make sense. The stick isn't as fast as the Roku 3 and this becomes apparent when switching apps, loading videos, and/or searching for movies. On the other hand, the chromecast lacks a physical remote, crashes often, and has a lack of applications! Within a month of purchasing both, I sold my chromecast and I'm thinking about returning my Roku Stick to buy another Roku 3.", "verified": false, "helpfulness": "0/0", "author": "M. Williams"}, {"rating": 5.0, "review": "I love it!  With this little stick plugged into my HD TV I can get Netflicks, MGO, Hulu, Amazon Prime, Blockbuster video and moreOf course you have pay a subscription fee for each one of those, but you can many channels free and it is a lot cheaper than cable", "verified": true, "helpfulness": "0/0", "author": "C Flager"}, {"rating": 5.0, "review": "I bought this for streaming some world tv channels.This is an excellent product.", "verified": true, "helpfulness": "0/0", "author": "Job Johnson"}, {"rating": 5.0, "review": "Excellent device", "verified": true, "helpfulness": "0/0", "author": "M. Simon Atkinson"}, {"rating": 5.0, "review": "Great little piece of electronics and like the rf remote control", "verified": true, "helpfulness": "0/0", "author": "David Kozemchak"}, {"rating": 5.0, "review": "Very Happy", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "I love, love, love this!  I do not have a TV in my bedroom but with this Roku Streaming Stick and a Computer Monitor and I am good to go!  It works perfectly and you can't beat the price.  My only complaint is that I wish there was a way to stream my shows that I previously bought on iTunes.", "verified": true, "helpfulness": "0/0", "author": "#1Amazon Fan"}]