[{"rating": 5.0, "review": "Works great.  Amazing picture!  Use it for Amazon Prime and Netflix.  Don't know about games or other streaming channels.", "verified": true, "helpfulness": "0/0", "author": "mollys#1mom"}, {"rating": 2.0, "review": "Only two stars because they don't advise that netflix or the capacity to mirror notebook or smartphone on tv is available only in USA or Canada.", "verified": true, "helpfulness": "0/0", "author": "Gabriel Prieto"}, {"rating": 5.0, "review": "Great value!", "verified": true, "helpfulness": "0/0", "author": "AshBee"}, {"rating": 2.0, "review": "Blocks other HDMI ports and still requires USB power.  This means you'll need to buy a 90 degree adapter to free up the other HDMI port and a USB port to power it.", "verified": false, "helpfulness": "0/0", "author": "B. Boyd \"Audio Freek\""}, {"rating": 5.0, "review": "The Roku unit works perfectly and I am very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Sam  Shraga"}, {"rating": 5.0, "review": "Easy to set up. Haven't explored all the features, but so far works as well as my Roku 3. We have only used it for Netlix, Amazon and Plex", "verified": true, "helpfulness": "0/0", "author": "Audrey"}, {"rating": 5.0, "review": "I love it !!!", "verified": true, "helpfulness": "0/0", "author": "james szymas"}, {"rating": 5.0, "review": "Excellent received rocky device really fast 5 stars plus", "verified": true, "helpfulness": "0/0", "author": "johnny777"}, {"rating": 5.0, "review": "Roku rocks has many cool channels that you can stream your movies or watch many videos such as news and entertainment.I think with this device most people probably can put down their cable or dish system. Its one of the best and has huge amountof free videos and even live channels. Its small and easy to use just plug it in and go. Just register one time and then its all go.The registration is free just have to put you info in and email.", "verified": true, "helpfulness": "0/0", "author": "Sergei Shulman"}, {"rating": 5.0, "review": "I'm loving my Roku so far. I just plugged it into my TV's HDMI port and the power cable that comes out of the Roku goes into your TV's USB port (that powers the unit so no need to plug it into a wall jack).  It uses your wireless network connection. To set it up you will need to create an online Roku account on their website first (it's FREE) and then when you plug it in for the first time it will run you through an easy setup process where you can enter your wireless user and password, etc. It was very easy to set up.Works great for me.", "verified": true, "helpfulness": "0/0", "author": "Corkky"}]