[{"rating": 5.0, "review": "I bought this for the bedroom.  Works great.", "verified": true, "helpfulness": "0/0", "author": "Eric Moore"}, {"rating": 5.0, "review": "I turned off my cable and bought this roku, I know pay $7.99 for Netflix and $8 for hulu. I do not miss my cable (MOST DAYS).", "verified": true, "helpfulness": "1/1", "author": "CHADRIC DOVER"}, {"rating": 5.0, "review": "excellent product for the price works well", "verified": true, "helpfulness": "0/0", "author": "aprilia"}, {"rating": 5.0, "review": "I can't believe I waited so long to buy this! I love the Roku Streaming stick and the fact that it's so small that fits into the second HDMI port in my TV.  No extra bulky box to fit into my entertainment stand.I haven't had any issues with the stick.  I use primarily the Netflix and YouTube apps and both work very well.Installation was also extremely simple and took a total of about 2 minutes.", "verified": true, "helpfulness": "0/0", "author": "Mccurls"}, {"rating": 3.0, "review": "Works ok. Easy set up. Amazon streaming app not as friendly as with SmartTV. Picture quality is very good except when using screen mirror. Quality of screen mirror image is very poor compared to Chromecast or SmartTV.", "verified": true, "helpfulness": "0/0", "author": "Rico D."}, {"rating": 4.0, "review": "OUR USAGE of the Roku* Netflix (this is what we bough the unit for)* Amazon Prime Instant Video (both free and paid rentals)* YouTubePROS* Easy enough to use our preschooler can easily navigate between shows* Auto play after a shows completion.  (Coming from the Wii, this is a big improvement).* \"Are you still there\" feature.  We've found that this prevents the Roku from using up bandwidth when our attention has shifted away from the television into another room.CONS* Load time/lag.  We have the Roku in the \"always on\" mode where it gets its power from the wall outlet.  There is still a pretty big lag while the unit loads Netflix from the home screen.  If this were fixed, it would be a 5 star product in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Some channels, like Netflix, has no access in Brazil. Besides, the remote control wasn't working properly in my case.", "verified": true, "helpfulness": "0/0", "author": "Agnaldo de Almeida Dantas"}, {"rating": 5.0, "review": "Works as advertised.  The only point to keep in mind, is that it does take a while to connect to your wi-fi after being on stand-by.  I definitely recommend downloading the ROKU remote control app for your smart phone.  Then you can type your searchs rather than use the 'select-a-letter' option.", "verified": true, "helpfulness": "1/1", "author": "literate farmer"}, {"rating": 5.0, "review": "home run perfect in every way", "verified": true, "helpfulness": "0/0", "author": "gerald purvin"}, {"rating": 5.0, "review": "Ez to use.  Great customer service.", "verified": true, "helpfulness": "0/0", "author": "E Frame"}]