[{"rating": 4.0, "review": "I bought this after a Roku connected to the TV in the kitchen became a regular view by my bride.  We just select from shows available through Amazon Prime. I had it set up in the main room, but finally moved/attached it to the TV in the exercise room.  On many days, when I turn on the TV I have to change the input back to regular TV because someone has been watching it a lot. We get a rare disconnect from the network error, but there is no pattern.", "verified": true, "helpfulness": "0/0", "author": "R. J. Benson \"bjornsen\""}, {"rating": 4.0, "review": "I don't like this as well as I did the roku xd. But it is twice as good as the fire xd.", "verified": true, "helpfulness": "0/0", "author": "reader person \"nana\""}, {"rating": 3.0, "review": "Works. VERY VERY VERY weak doc and miserable website support. Maybe consider the Amazon equivalent? I am a tech geek who builds his own PCs and found this device user-hostile.", "verified": true, "helpfulness": "0/0", "author": "Eric Pearson \"eric\""}, {"rating": 5.0, "review": "Speechless,Awesome product. So compact but power house performance. Works well with my HD LED TV.", "verified": true, "helpfulness": "0/0", "author": "Sarath Sivan"}, {"rating": 3.0, "review": "Wasn't thrilled...  ordered new, received used.  Had to contact Roku to have previous account information removed from stick.  It works fine after Roku reset everything, but I shouldn't have had to pay full price or the price for \"new\" if that is not what I am getting.", "verified": true, "helpfulness": "0/0", "author": "Old Fool"}, {"rating": 5.0, "review": "I love it! My computer and iPhone can connect via Bluetooth. Lots of apps to browse, and is completely invisible in the back of my TV. I'll be buying another for my office.", "verified": true, "helpfulness": "1/1", "author": "RenoMike"}, {"rating": 4.0, "review": "satisfied", "verified": true, "helpfulness": "0/0", "author": "darryl bartley"}, {"rating": 5.0, "review": "works perfect! I can see youtube from my 50' TV now!", "verified": true, "helpfulness": "0/0", "author": "ji21ao"}, {"rating": 3.0, "review": "As a Roku 3 owner I would highly recommend forking out the addition coin to buy the Roku 3. I bought this for our 2nd TV. It can be painfully slow at times and needs to be reset every week or so. Also has a tendency to freeze on loading screens. When resetting the unit it is always hot to the touch. I never use the remote for my Rokus and the stick tends to lose connection with my phone remote and lag a bit. Just FYI if you can afford the Roku 3. The Roku 3 has performed flawlessly.", "verified": false, "helpfulness": "0/0", "author": "Nathan Weed"}, {"rating": 5.0, "review": "We got this for the wall mounted tv in the bedroom, goes right on the side of the tv, runs off the power from the usb on the side, wireless remote means don't need line of site to run.  Almost as reponsive as the Roku in the living room which is a full sized unit.", "verified": true, "helpfulness": "0/0", "author": "Inkblaster"}]