[{"rating": 5.0, "review": "Perfect for my bedroom, where I don't watch a ton of TV but still like to access Netflix and Amazon. Fits perfectly into my TV, seems to charge in my TV (so I don't have to plug it in to the wall), and carries a steady stream. Haven't had any real problems with it yet, except it might be a little slower than the regular Roku box but nothing to really complain about. I wish the remote had the drawstring attached so I wouldn't lose it as much but such is life.", "verified": true, "helpfulness": "0/0", "author": "feyc123 \"feyc123\""}, {"rating": 1.0, "review": "GARBAGE! Did not work and tech support was all but useless. They claim it must be less than 20 feet from wireless router. JUNK!", "verified": true, "helpfulness": "0/0", "author": "Georgia Guy"}, {"rating": 2.0, "review": "Be careful! Pretty much anything you can stream, you have to pay for e.g. Netflix etc", "verified": true, "helpfulness": "0/2", "author": "D. P. MURPHY"}, {"rating": 5.0, "review": "Very simple to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Jewel 23 \"jaybird\""}, {"rating": 5.0, "review": "It is so nice to have streaming and was easy to set up!!", "verified": true, "helpfulness": "0/0", "author": "Norma Sutcliffe"}, {"rating": 2.0, "review": "when I ordered this product I was not expecting to see a screen pop up that wanted my credit card info and not having writin instrucs I was put off and not about to give up that info.im sure this is a great product but I would never have ordered it if I had been aware of this.", "verified": true, "helpfulness": "1/3", "author": "mark tidaback"}, {"rating": 1.0, "review": "Did not work at all. Horrible.", "verified": true, "helpfulness": "0/1", "author": "CSD"}, {"rating": 4.0, "review": "Just got it yesterday. Setup was super easy! (although I would have liked the ability to connect a bluetooth keyboard). I love that you can connect your phone and use your phone keyboard! Very simple user interface, great controls on app downloads (using pin) and totally hidden behind the tv. The remote lags a little. Not as much as DirectTV's DVR or Cableone's DVR remotes but enough that I noticed. That's why I didn't give it 5 stars, it needs a slightly faster processor to be worth 5 stars. Overall, great device. I'm sure I'll be getting two more for the kids.", "verified": true, "helpfulness": "0/0", "author": "SushiSan"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Uldis N. Cernonok"}, {"rating": 1.0, "review": "I am a big fan of the ROKU and have several in my house and office so the one star rating is not for the ROKU it is just for these refurbished units.  I figured I would get the refurbished one because this was for the spare room and wasn't going to get used on a regular basis.  Well I should have spent the $9 more and gotten the new one.  The packaging was in good condition but when I opened it up and set up the unit the remote was an issue.  When I opened the box and unpacked it the seams on the remote were slightly separated so I snapped them back together.  Right there I should have just packed it back up and sent it back.  Got everything setup, powered up the unit and tried to configure it and realized the right arrow on the directional pad wasn't working.  I would push right and it would go down.  So basically the unit is completely unusable because I cannot go right to select my channels.  Not only that but upon closer inspection the seams on the remote looks like someone pried on them and opened the unit up.  So now I have to uninstall the unit because the only option I have is to return it for a refund and reorder it.  Why the hell can't I get a replacement when the POS showed up non-functional out of the box.  Now I have to uninstall it, repackage it, wait 2-3 days for a refund, and then order it again and wait 2 days to get it.  So having wanted this for this weekend now I have to wait a week to get one that hopefully works or I will have to repeat the process all over again.", "verified": true, "helpfulness": "2/2", "author": "Albert J. Lapeter"}]