[{"rating": 4.0, "review": "This is great idea.  I think the only drawback it has to be powered by a usb drive.  That's the reason I gave it a 4 star.  I don't mind the stick sticking out from my TV, but we have the usb cord sticking out as well.  Works great.  I love being able to watch my Amazon Prime movies/TV shows directly on my TV.", "verified": true, "helpfulness": "0/0", "author": "zw"}, {"rating": 5.0, "review": "Quick, easy to use...my YouTube, Netflix, PBS, Amazon, so much to choose from. Just plugged into the USB slot, went thru the steps and I am watching my favorite videos and discovering so many more. Sweet little remote. This grandma is happy.", "verified": true, "helpfulness": "0/0", "author": "Nancy J. Green"}, {"rating": 4.0, "review": "Get great viewing with the stick.  Read complaints about slow loading time but seems fine to me.  Great value for the money.", "verified": true, "helpfulness": "0/0", "author": "Ned G"}, {"rating": 5.0, "review": "Unbelievable that such power can come from such a small device.  Works every bit as well as our Roku XD for streaming Amazon and other content and it's totally invisible being plugged into the port on the back of the TV.  Great product!", "verified": true, "helpfulness": "0/0", "author": "NDFan"}, {"rating": 1.0, "review": "We had very high hopes for this device and ordered it to have it the day it was released.  We have it on our upstairs (router is downstairs) TV and are lucky if we can get it to connect to the wifi for a minute on a clear night.  if there is any bad weather or more than one person is using an internet connected device forget it.  Do not buy this, go for the more robust model or a chrome-cast instead.", "verified": true, "helpfulness": "0/0", "author": "Rebecca L Corwin"}, {"rating": 5.0, "review": "Works great, good distance from router to the room with the TV.Lots of free channels but I mostly use it for Netflix", "verified": true, "helpfulness": "0/0", "author": "BSavi"}, {"rating": 5.0, "review": "I had a Wii that I used to watch Netflix and Amazon Prime on, but this device works so much better!There are way more options and it's so easy to use! I plugged it right into my TV and it worked great!It's also nice that they show you how to add channels to your Roku.This is a great product and I would recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "Megan Lee"}, {"rating": 2.0, "review": "Netflix takes too long to load!  I was told the $60 Roku is a much better product than the one I purchased.", "verified": true, "helpfulness": "0/1", "author": "Lena"}, {"rating": 2.0, "review": "I really loved this for two months.  Aside from a few minor complaints about how some of the channels operated, it was great.  And it pretty much paid for itself, saving me on my electric bill since I no longer needed to run my computer to watch Youtube or Netflix.Then one day for no reason at all, it stopped working.  With no rhyme or reason, it would decide not to connect to my local network, or sometimes not to the internet, or sometimes it would connect but then drop that connection a few seconds/minutes later.  Sometimes the connection wouldn't drop at all, but I would get terrible video quality and frequent buffering.  Not only did it not work, but there was no consistency in how it wouldn't work.  In the meantime, multiple cell phones, computers, tablets, printers, and all other manner of wireless device continued to connect to the wireless network and internet without any problems.  I've tried numerous fixes including changing my wireless router's channel to every channel available, disabling wireless security, disabling the firewall, and setting the Roku up in a DMZ, all to no avail.  While I may have simply received a dud, given my experience with it, I can't recommend it.  Your results may vary.Addendum:  Just to clarify and in response to the comment to my review, I have a 15mbps internet connection and I frequently watch Netflix and Youtube videos in HD on my computer without any problems.  This is not a problem with my connection being too slow.", "verified": true, "helpfulness": "0/0", "author": "K. Childers \"Juggernaut\""}, {"rating": 5.0, "review": "Device arrived on time. The setup was very easy. I was using a DVD player with Ethernet connection prior to buying this devicethe re buffering on the DVD player happen about twice doing each movie but with the Roku 3500 once the movie starts therre is no re buffering. Great Device", "verified": true, "helpfulness": "0/0", "author": "smitty"}]