[{"rating": 5.0, "review": "Over the years I have found that Refurbished Electronic devices are just as good as what is considered new.  Warranty is the same anyway.  I own 2 other older Roku streaming video devices and really love them for viewing movies and TV series offered by Amazon.  While I have a Panasonic Video player that does streaming video, I find Roku is much more effiecent and easy to switch from TV mode to Streaming video.  And as my TV has extra HDMI ports, I bought this ROKU STICK and it was easy to install and is less cumbersome to connect to the TV.  I get great streaming video, it offers a good number of other options, some of which are You Tube, Pandora, Net Flix, etc.  I plugged the stick in the HDMI port I wanted, attached AC the power adapter as I  heard that's the best way to be sure your ROKU STICK gets sufficient power to operate well.  I plan to buy another for the guest bedroom TV which is not on the cable so guests can enjoy streaming video.  A great product and it has more options that some other streaming video devices.  A great price and I got great delivery service with my prime order for it.", "verified": true, "helpfulness": "22/23", "author": "Steve"}, {"rating": 5.0, "review": "Works really well on my 2nd tv.", "verified": false, "helpfulness": "0/0", "author": "cheryl lee"}, {"rating": 5.0, "review": "Love this thing!!! We were using our laptop to enjoy Netflix & Pandora and this is a WAY better option. Small easy to use. We can't use all the channels it offers but we do also use PBS & Amazon Prime. So glad this was recommended by a friend. I recommend it too!", "verified": true, "helpfulness": "0/0", "author": "Talainya"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Juan Alberto Mauri"}, {"rating": 5.0, "review": "love this item", "verified": true, "helpfulness": "0/0", "author": "ann vaphiades"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Fran Heitmann,"}, {"rating": 5.0, "review": "Very easy set-up, simple to use, clears space on stand. Works at least as well as the box type. I endorse this item (for what my opinion is worth) to anyone needing an easy to use and install connection to web services. I would definitely use this retailer again.", "verified": true, "helpfulness": "0/0", "author": "Joseph McDowell"}, {"rating": 4.0, "review": "Make sure you have a good strong wifi signal. If you do, this product will deliver everything it says it will. If your wifi isn't strong and reliable, though, you will be frustrated.", "verified": true, "helpfulness": "0/0", "author": "Joel Zimmerman \"Joel Zimmerman\""}, {"rating": 1.0, "review": "Stops working after 2 months. Get the warranty, I didn't think I would need it . Money wasted.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 4.0, "review": "works well wish it had a better op manuel.", "verified": true, "helpfulness": "0/0", "author": "Kim & Lisa Haight"}]