[{"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Bekkah Rashadeen"}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Mr. Gabriel A. Zyserman \"gaby z\""}, {"rating": 2.0, "review": "worked for 5 mins. and then would not do anything with the remote.spent over 1 hour with roku tech, no help, sending it back and start using my old roku 1 not a happy buyer", "verified": true, "helpfulness": "0/0", "author": "filet and release"}, {"rating": 5.0, "review": "So far - so good. Review is for \"XB\"/refurbished model. Took a few minutes to go from \"PSOD\" (purple screen of death) to streaming video properly. At this point (1 day) it appears to be working fine. The PSOD had me worried; I had actually processed a return request (and wrote a scathing review), forgot to do a factory reset so I stuck it back in  and - lo...it started to stream properly. Cancelled return/deleted negative review. I like it way better than Chromecast - and the refurb model is at that price point. Much more intuitive, no reliance on a 3rd device to stream, etc. Will update if it craps out again. Device had some adhesive residue on it, but came complete in original packaging with remote and power adapter/cord.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "its  okay but the remote needs to be paired alot", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 5.0, "review": "If you don't have a smart TV you MUST HAVE THIS!", "verified": true, "helpfulness": "0/0", "author": "Dana Dane"}, {"rating": 5.0, "review": "works great, kids love it", "verified": true, "helpfulness": "0/0", "author": "michelle lopez"}, {"rating": 1.0, "review": "Remote is not functioning", "verified": true, "helpfulness": "0/0", "author": "Rajesh Ponneth Rajan"}, {"rating": 2.0, "review": "I originally liked my ROKU Streaming Stick so much, I ordered a second one 5 days later.  That was January 15th.  Today is 4/4 and it's completely stopped working.  I tried the full factory reset, new batteries, using the remote from the other device and nothing.  It stopped working.  I moved the other ROKU Streaming Stick downstairs and it works fine.  I'm very disappointed that this stopped working in less than 3 months (and I was out of state for the month of March) I'm now concerned about the second one and how long that will last.  I've tried to contact ROKU and work this out to no avail.  I tried the return item link on Amazon only to find the the \"window\" for returns has closed.", "verified": true, "helpfulness": "0/0", "author": "Laura L. Wolfe"}, {"rating": 5.0, "review": "Easy. Works as promised.", "verified": true, "helpfulness": "0/0", "author": "Jim Overbay"}]