[{"rating": 5.0, "review": "Great item. I would definitely recommend it!!", "verified": true, "helpfulness": "0/0", "author": "Marcia Lilley"}, {"rating": 4.0, "review": "If I could go back, I'd get a Roku 3.  There's a definite performance difference in apps and the UI vs a Roku 3.  I have 3 other Rokus all of which are 3s, but since this is more of a guest/treadmill room TV, I didn't see the need for the top of the line Roku.  Unfortunately I like to watch various Podcasts on YouTube while I run during winter months, and it's not near as useful for that if you want to fast forward or rewind the video.", "verified": true, "helpfulness": "0/0", "author": "Julez"}, {"rating": 5.0, "review": "Love it!Only one quibble: The stick can't seem to receive input from the remote in 2/3 of the living room, because the TV blocks the line of sight. As it is for the rest of the room, I have to keep the blinds closed behind it because the signal doesn't bounce of the window effectively.Well, okay, two quibbles: I have to plug it in with the USB power cord on the TV, otherwise it just stays on with no ability to power it off (aside from unplugging it). I opted for power-saving over instant access, and that's fine, but I get a much better picture and streaming rate when it's plugged in to the outlet instead of the USB port.But I love being able to do ONE search for things and see if they're on Netflix, Amazon (and whether it's free with prime), or any other channel. The new watch list feature is great, now if only we could get a universal queue!", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 1.0, "review": "Boo! Less than two months later (and of course past the return time period) this item stopped working. Waste of money! 👎", "verified": true, "helpfulness": "0/0", "author": "Rebecca Crandell"}, {"rating": 4.0, "review": "This is such a useful product  I literally don't even use my cable box anymore.  While I'm sure the roku is great for all those that have \"cut the cord\"  and only stream OTA services but I get such a greater selection than imagined.  Live TV with the TWC app with the ability to change instantly to services like Amazon prime video and Netflix is such a huge advantage.  Bought the streaming stick on impulse when I was looking for a second chromecast for my other TV but opted for this instead because of the live TV options.  Only complaint of the stick compared to the roku boxes is that some apps (Netflix,  hull,  and vudu)  sometimes take longer to load than I'd like.", "verified": false, "helpfulness": "0/0", "author": "James Slade"}, {"rating": 5.0, "review": "I have several Roku's - the stick is the best thing.  there is no problem when streaming and the stick takes up no room and you don't see at all.", "verified": true, "helpfulness": "0/0", "author": "Joy H"}, {"rating": 4.0, "review": "Nice little combo set. I wanted to give it five stars, but we often have to turn the television on and off to get the connection going, when we're ready to watch it. I think this is because of the bedroom location being too far from my Internet router in the living room, only a short seven or eight paces away. We have no connection problems with our wireless ROKU box on the big screen tely in the living room. But otherwise, all features work and we love having our bedroom Tely to watch at night in bed. I wanted to give a good and fair review for this product because I like the ROKU products as an option to very expensive cable TV. We live in an apartment with very limited options for TV (only Comcast are allowed). We have  the basic high-speed Internet package with our land-line telephone provider, so these streaming ROKU devices work very well for us, and our tight budget.", "verified": true, "helpfulness": "0/0", "author": "A. Lewis"}, {"rating": 2.0, "review": "Remote control issues!  No bueno", "verified": false, "helpfulness": "0/1", "author": "carlos vera"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Pamela Guidry"}, {"rating": 1.0, "review": "Horrible, controller doesn't work, a lot of lag time when downloading video Netflix. Buy a Roku 1 instead, it performs much better than this one.", "verified": true, "helpfulness": "0/0", "author": "alex"}]