[{"rating": 5.0, "review": "I love it !", "verified": true, "helpfulness": "0/0", "author": "THOM LUCAS"}, {"rating": 5.0, "review": "I love this thing! We use it every night and haven't had any problem. The actor and movie search feature is pretty cool.", "verified": true, "helpfulness": "0/0", "author": "Jonathon DeVisser"}, {"rating": 5.0, "review": "it is great device to have at home, I love it", "verified": true, "helpfulness": "0/0", "author": "Shirin -Lashgari"}, {"rating": 5.0, "review": "This came in the mail through Prime shipping in literally 2 days (too bad my apartment office closed early on Sunday though...). Finally picked it up today and opened it: box came with directions/info, remote, wall outlet and USB cord, the lovely purple Roku stick, and 2 Duracell batteries!! I was all set.Plugged the USB into my TV, then into the Roku before plugging the Roku into the HDMI slot. First go-round my TV didn't recognize the drive, but kicked in when I plugged everything in again. Went through the prompts, got connected to my wifi, setup the Roku account, selected my \"Channels\"/Roku apps (which there are TONS of including Amazon Prime, Netflix, Hulu, YouTube, Pandora, History, HBO, Showtime...it goes on).Once I logged into my accounts for the different apps, everything was streaming smoothly. Clear picture on the apps I've used so far (Pandora, Netflix, Amazon Prime) and no delay or interruption over my wifi. I like the little remote, very intuitive and quick response with the arrows and selections. One thing that's silly now but will probably be annoying later is that the bottom of the remote is rounded so it won't lay flat when I set it down. It's such a light-weight remote that I've just been laying it on the flat side with the buttons.Other options include screensavers and themes for your home screen, which I thought were a fun touch. So far I love this thing, amazing deal for all that you're getting with great image clarity. The USB charger through the TV is convenient but I appreciate the versatility of plugging it into the wall if I want to. For about $50 bucks, I couldn't be happier nor more impressed - highly recommended. Thanks Roku and Amazon!", "verified": true, "helpfulness": "0/0", "author": "Crystal"}, {"rating": 2.0, "review": "Loses internet connectivity quite often. Today I got a purple screen - audio was happening but no picture. When it works it's AWESOME, but the inconsistency makes this a dud.", "verified": false, "helpfulness": "11/12", "author": "Meredith Webber"}, {"rating": 5.0, "review": "this item was a gift thanks great job", "verified": true, "helpfulness": "0/0", "author": "Robert Lacagnina"}, {"rating": 4.0, "review": "Aside from this Roku 3500R Streaming Stick, I also have a Chromecast and an LG SmartTV.What I like about the Roku 3500R: * a remote (rather than using another device for Chromecast) * far more apps/channels than LG SmartTVMy complaints about the Roku: * as far as I can tell, you're forced to create a Roku account to use the thing (perhaps I didn't look hard enough) * 4 buttons for specific channels (netflix, amazon, blockbuster, and something else) - when presumably most people use only 1 or 2 of these * it's sometimes a little slow, but I've found various SmartTVs to be slower still.  Also it's not clear if it's the Roku or poor implementation of some apps.Conclusions:  If you want a lot of different channels/apps/etc, buy a Roku; I find it more useful/less of a novelty than Chromecast.  If you only want 1-2 apps (eg Netflix or Amazon), get an LG SmartTV or similar built-in equivalent because 1) you don't need to create another account, 2) you don't have another remote to juggle.  Just make sure your tv (or blu-ray player) supports the service you want.", "verified": true, "helpfulness": "2/2", "author": "etank"}, {"rating": 4.0, "review": "This isn't as snappy and responsive as the Roku 3.  It's noticeably laggier but ends up getting the job done.  Everything else is fine, the interface is wonderful and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Brett"}, {"rating": 3.0, "review": "picture is great, sometimes the voice is off from the picture, might want to get the wired unit for best results", "verified": true, "helpfulness": "0/0", "author": "Gmonieful"}, {"rating": 4.0, "review": "Absolutely love this! However, I specifically bought this to get rid of this old crappy RCA streamer I have, and I wanted it in the bedroom... needless to say it will not work on our TV in our bedroom, so it is plugged into our TV in the living room! Bummer!!! But Works GREAT! :)", "verified": false, "helpfulness": "0/0", "author": "Sarah"}]