[{"rating": 3.0, "review": "Overall ok.Remote gets stuck a lot.Slower than expected.", "verified": true, "helpfulness": "0/0", "author": "liran"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Edward F Ebel"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Patty"}, {"rating": 3.0, "review": "I have had this device only for a week. I have Samsung TV I purchased 5 years so its not a smart TV but it does have USB and HDMI ports. The installation is very easy and the video quality is amazing. Now for video streaming. I tried to stream a video from my smart phone to the firestick on my 50 inch LG Smart TV that I purchased last year. The video quality SUCKED. I couldnt see the video. I stucked it out for 2 hours and the quality did not improve.  I will try downloading the movie to my phone and see if streaming it that way improves the quality. I also requested the Roku HDMI extension cable which may also help to improve WiFi reception from my wireless router. I will update my review after I get the extender cable.", "verified": true, "helpfulness": "0/0", "author": "BorgQueen"}, {"rating": 5.0, "review": "Great service...ditched cable...added Sling and Netflix.  Just patiently waiting for HBO Now to finish it's 3 month \"Apple exclusive\" period.  If your flat screen is wall mounted and your HDMI ports point straight to the back, you'll need a 90 degree hdmi swivel adapter.  The Roku stick protrudes about two inches out of the back of the set.  If your HDMI loads on the side...you're all set.  Enjoy!", "verified": true, "helpfulness": "0/0", "author": "earl r freeman III"}, {"rating": 5.0, "review": "works as expected", "verified": true, "helpfulness": "0/0", "author": "rebelbah"}, {"rating": 5.0, "review": "Roku allows me to stream Netflix, Sling, HuluPlus, and watch YouTube videos. Fast and cost effective. You can also download a remote control app on a cell phone or tablet. Other streaming devices are a bit slow and keep having to buffer. Thought it was my router but turns out it was my streaming device. I have bought two Roku players in the last year and am happy with both.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 1.0, "review": "This thing is junk! It doesn't work for me. This is my 2nd one. I will take it back, but then I bought it at Walmart. Don't buy any electrical stuff from them; although, this Gateway laptop from them has worked well for over a year now.  I've had to call up Roku customer service for them to tell me how to reset it. It quit responding to the remote. Now, its pausing to reload every 10 sec and while I'm typing its been stuck for over 10 min. I have a flat panel TV mounted on the wall with a confined space in the back. I've noticed the stick gets a little hot. Maybe this is the problem. I will try another model.", "verified": false, "helpfulness": "1/1", "author": "discountbrains"}, {"rating": 1.0, "review": "When it works, it's good.  The remote only worked 1/2 the time during the first month until we finally installed the roku app remote on our smart phone.  Now one month later, the remote doesn't work at all.", "verified": true, "helpfulness": "1/2", "author": "Brandy Nicole Dorman"}, {"rating": 5.0, "review": "Gift for daughter.  She loves it", "verified": true, "helpfulness": "0/0", "author": "Lynne Pfeifer"}]