[{"rating": 5.0, "review": "Excellent for travel or home.  SlingPlayer for SlingBox app works excellent.", "verified": true, "helpfulness": "0/0", "author": "Harry L Spillman"}, {"rating": 2.0, "review": "The item itself is not great. If you plan on watching regular tv, you have to unplug the roku streaming stick to watch it. I had the original roku box and I loved it. If you are going to purchase a roku item, get the box.", "verified": true, "helpfulness": "0/1", "author": "kaitlynn felth"}, {"rating": 4.0, "review": "I do not have or want cable tv.  This gives me access to channels that otherwise would not be available even though I already have a smart tv", "verified": true, "helpfulness": "0/0", "author": "CabLover"}, {"rating": 3.0, "review": "I was impressed by Roku streaming stick for the most part but I was still required to pay monthly subscription fee for most of the channels. Also, Dramafever channel keeps crashing and the whole system gets stuck in a black-out screen until I reboot it which is a time consuming process (about 5-10 minutes). Other than these two major hiccups Roku stick is a convenient hub of entertainment, user friendly & easy to set up.", "verified": true, "helpfulness": "0/0", "author": "S_Park"}, {"rating": 5.0, "review": "Love it!  I couldn't get my Chromecast to stay logged in.  No issues with the Roku!", "verified": true, "helpfulness": "0/0", "author": "J. G. Contreras \"ScanMan\""}, {"rating": 4.0, "review": "Awesome, love all the features. But it lags from time to time. Takes about 45 seconds to load netflix compared to my google chrome cast which takes about 10 seconds. Other than waiting for netflix to load and sometimes during a show a takes a few buffering second, loving it so far.", "verified": false, "helpfulness": "0/0", "author": "adam salloum"}, {"rating": 5.0, "review": "Within Hours of receiving my Roku Streaming Stick I new I had made a huge mistake. I didn't buy one for every TV in the house! As soon as I realized my mistake I had to correct it. While I'm a huge fan of the Chromecast and I certainly see its advantages over the Roku, the Roku has advantages over the Chromecast that justify the added expense. Both devices will be connected to my TV for the foreseeable future.While the Chromecast is easier for casting content from your browser or mobile device to the TV, the Roku offers more options for channels and services. Additionally, unauthorized channels can be added to the Roku where as the Chromecast appears to be locked down pretty tight by Google. I had to jailbreak my iDevice and add third party apps to my Android device to use unauthorized media sources on the Chromecast. Roku actually has a page on their website that allows you to add unauthorized sources.The Roku store can be accessed directly from the device. I had to hunt down lists for Chromecast compatible apps that were not advertised with the device.My only minor complaint about this device is that it is thicker than the average HDMI connector and there isn't enough room on my TV or HDMI hub to plug in something next to it. Roku offers a free HDMI extender, thankfully. However, when I tried to use the extender that came with my Chromecast, it did present some display issues. Use the extender that Roku will give you instead.https://www.roku.com/support-hdmi", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 1.0, "review": "Very unsatisfied and upset. Broken after using it once (stuck at the bouncing Roku startup logo)What makes me even more upset is: I contacted Roku service , and they promise me to send me a replacement. I was happy at that point. But the package turns out to be unaddressed  (they have the right street #, but because of their negligence they don't have my name on it, so the mail room guys rejected it). I contacted Roku customer service maybe 10 times. I won't contact them again because every time I spend 30min-1 hr (including the time they put me on hold, and transferring me to other reps, and the time I wasted on unresponsive reps) talking with them  (either online chat, email or phone), after a couple times eventually they would just avoid their responsibility and tell me to contact USPS ---The first time they told me to contact USPS I checked with my mailroom guy, from where I know it was rejected because the package was unaddressed.The second time they said the rejected package was not received on their end, so I spent 1 hour (put on hold) with USPS customer service and they showed me their internal tracking information showing they have returned the package to their facility.And for the third time, they asked me to contact USPS again, to get some kind of claim number or whatever --- But I won't do it again for the following reasons:(1) In the first place it is not my fault that your product fail after using once.(2) Second, it is not my fault that you sent an package unaddressed. The package is not even sent to me why do you want me to investigate into that?(3) Third, I did not hire USPS to send the package. If you need information from them, you should contact them, or you should pay me to contact them (I would ask $60/hr, plus the time I already spent on this incident). I've spent more than maybe 5-7 hrs on this case, and you are still asking me to do the work that you should be responsible for. It's ridiculous.Some unacceptable thing that happens when I contact their reps:(1) At one point one of the customer service told me she'll check if their warehouse has received the returned package. And promised me follow-me up in email. But they never did.(2) OK they actually did follow me up --- in the email they said, hi Nelson, we have update on your case, please contact our reps --- first, you did not give me the information you promised to give me (whether your warehouse have received the returned package), and second, my name is not Nelson.(3) There are a couple of times that I connect to their online customer service, they are not responsive, or keep asking me same questions, or transfer me to other un-responsive reps.I won't waste more time with them, and I won't buy or recommend any Roku product again. (because of the low quality and time-wasting customer service). I also own a Chromecast and an Apple TV. Both of them are very good product. Never had an issue with the Apple TV before I gave it to my dad, and I'm still using the chromecast now.*I did not buy the Roku streaming stick here, it comes with my JVC TV I purchased.", "verified": false, "helpfulness": "12/13", "author": "Lang"}, {"rating": 5.0, "review": "The Roku easily plugged into my TV.  No more attaching cables from my laptop to the TV.  Amazon, Blockbuster, Hulu, Netflix and other channels are readily available.  Picture is very good and I have had buffering only once.  It has saved me so much aggravation.", "verified": true, "helpfulness": "0/0", "author": "Mrs. T"}, {"rating": 4.0, "review": "Nice and compact. Wish it had headphone option. For the price it isan excellent buy.", "verified": true, "helpfulness": "0/0", "author": "Laverne W. McKenzie"}]