[{"rating": 4.0, "review": "Just a bit slower then the regular Roku 3 but works just as I'd hope.", "verified": true, "helpfulness": "0/0", "author": "Dane Jenkins"}, {"rating": 3.0, "review": "When the device had been powered down it takes forever to boot up. The Android app works intermittently with the stick, working maybe 1/2 of the time.", "verified": true, "helpfulness": "1/1", "author": "Patrick"}, {"rating": 2.0, "review": "The user interface is clean and intuitive and this small form factor is fantastic. Unfortunatelly the device has a big flaw: it takes a long time to wake up and respond to commands from the dedicated remote control or the smartphone apps. Most of the time it begins to work within a minute after you turn on the TV, but sometimes it can take up to an 3 mins. This may seem like a small amount of time, but when you have a couple of kids who want to see their cartoons it feels like an eternity. I am considering returning the device.", "verified": true, "helpfulness": "0/0", "author": "Luis Neria-Govea"}, {"rating": 5.0, "review": "Love my roku. I recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Melissa Kirkland"}, {"rating": 5.0, "review": "No Problems.  Looks great.  Works Great.", "verified": true, "helpfulness": "0/0", "author": "L. Roshak"}, {"rating": 5.0, "review": "Excellent coverage and perfect reception.", "verified": true, "helpfulness": "0/0", "author": "DenBla"}, {"rating": 4.0, "review": "We bought this for our school and use it to stream Netflix, Amazon Prime, PBS, and other shows to our school room TV. It has worked great. It's super easy to use and both my daughter and myself learned it very easily.It is not readily obvious, by the stick has to be plugged into a power source. If you have a powered USB on your TV, then you can plug it in there. If you don't, you have to plug it into an outlet. I liked that our TV had the powered USB because everything is all hidden behind the TV. It's a little slow to boot up, but, again, that's to be expected because it's essentially a Roku 1.Despite these minor things (I wouldn't even call them isses), I am very happy with my purchase!", "verified": true, "helpfulness": "0/0", "author": "Cofeegirl77"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "samba"}, {"rating": 5.0, "review": "I love roku.  I did cancelled cable years ago when I got my first roku.They keep getting better and smaller.  Good job Roku.  This one works the best (as in not visible at all) if your HDMI connection is on the back of the flat screen tv.  I have a 46\" flat screen that I originally bought it for but the HDMI was on the side and it stuck out sideways off the tv.  I didn't like the way it looked and it was in the way so I went back to the old Roku for that tv and put the stick version on my smaller tv that had the HDMI connection in back. It is great...can't see any wires and the streaming is great, Netflix, Amazon Prime, Hulu Plus, whichever you decide to subscribe to, or all and it is way cheaper than cable.  Highly recommend it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this product.  I see no need for pay T.V. This gives me all the tv I need and more.  I bought Chromecast some months ago and I was thoroughly disappointed.  This is great.  Thank you Roku!!", "verified": true, "helpfulness": "0/0", "author": "D. Westbrook"}]