[{"rating": 3.0, "review": "Remote doesn't always work correctly", "verified": true, "helpfulness": "0/0", "author": "Ken Lofton"}, {"rating": 2.0, "review": "Buggy remote. Very slow load times. loud commercials. poor wifi reception.", "verified": true, "helpfulness": "0/0", "author": "skw"}, {"rating": 3.0, "review": "Works good but could easily be better", "verified": true, "helpfulness": "0/0", "author": "Tanner"}, {"rating": 5.0, "review": "I love how this little stick had transformed my tv into a smart tv! It was very easy to set up and begin using. I like how I can either use the supplied remote to control it, or the smart phone app as well. I used to mainly to stream Netflix and Amazon prime (of course!) and other videos such as vevo and YouTube. The streaming speed is very fast, even though it is located in my basement which is far from my modem. I recommend this over a chrome cast for the better interface and remote control option.", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 5.0, "review": "We had one Roku Streaming Stick and loved it so much we just had to have a second one for our other TV, so when the Stick went on sale for $10 less, we couldn't pass it up. We got it in and used it right away. Wonderful product and saves us tons of money by not having to subscribe to cable and satellite services. Thanks Roku! Best product out there.", "verified": true, "helpfulness": "0/0", "author": "darkmilk"}, {"rating": 5.0, "review": "Works very well. Easy to set up & use. Wife loves it", "verified": true, "helpfulness": "0/0", "author": "Bob B"}, {"rating": 1.0, "review": "From the day 1 it work intermittently, Now after 60 days it stopped all together!Very disappointed !", "verified": true, "helpfulness": "0/0", "author": "SHALABH T."}, {"rating": 5.0, "review": "LOVE IT WORKS GREAT", "verified": true, "helpfulness": "0/0", "author": "fan"}, {"rating": 2.0, "review": "There are serious issues of compatibility between Roku, Netflix and Xfinity. It is just not doing the job.", "verified": true, "helpfulness": "0/0", "author": "Stephen Windhaus"}, {"rating": 4.0, "review": "does the same as the roku 3 but less money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"phil\""}]