[{"rating": 5.0, "review": "Product came in a timely manner and the roku stick is working great!", "verified": true, "helpfulness": "0/0", "author": "Brittany Nealy"}, {"rating": 3.0, "review": "The set up is great. Very similar set up to the Roku 2. Only problem is the remote doesn't work half the time and it's not the batteries. I wish I would of bought another Roku 2 instead. It's worth the extra $20 to save you th frustration.", "verified": true, "helpfulness": "0/0", "author": "Nathan H."}, {"rating": 4.0, "review": "Cheap way to get HD Time Warner Cable to another tv, along with netflix.  Great purchase.", "verified": true, "helpfulness": "0/0", "author": "michelle stephens"}, {"rating": 5.0, "review": "Easy to use device", "verified": true, "helpfulness": "0/0", "author": "mary ann"}, {"rating": 3.0, "review": "The controller stopped working?!?!?!  Now I have to use the ipad or iphone Roku remote.  BOOOOOOOOOO!!!!!!!!!!!!  But no problems with the Amazon Firestick.", "verified": true, "helpfulness": "0/0", "author": "Frank Cutrone III"}, {"rating": 4.0, "review": "I have an old model roku and this new model.  I like the design of the old roku much better.", "verified": true, "helpfulness": "0/0", "author": "Travelgirl \"Del\""}, {"rating": 2.0, "review": "didn't stream anything for me.", "verified": true, "helpfulness": "0/0", "author": "larry"}, {"rating": 4.0, "review": "The Roku stick was purchased with the intentions of streaming the CBS All Access App that only appears to be available with Roku or Google Chromecast. I also have a Smart TV and an Amazon Fire Stick so I am already familiar with streaming devices. The Roku stick does appear to have all the major streaming apps that one would want, i. e. Hulu, Netflix, Amazon Instant Video, YouTube, etc. The set up was pretty easy, have only had a problem a couple times losing the WiFi signal but was quick to be able to reconnect it. The major problem that I have experienced with it that keeps me from giving it 5 stars is that fact that it seems to get stuck sometimes and I'm not sure if it is a problem with the stick itself or the remote. When you push buttons on the remote there is no indication that the command has been accepted, no sound, no vibration, no visible lights. That is not necessarily a problem, but when I push buttons on the remote sometimes, especially if the TV has just been turned on to use the Roku stick I have had a actually take the batteries out and re-insert them in the remote to get the remote to \"wake up\" and start to function.", "verified": true, "helpfulness": "0/0", "author": "Jason Banks"}, {"rating": 1.0, "review": "At this point, I wouldn't recommend the Roku Streaming stick to anyone. It has been difficult, to say the least to get this thing to work properly. Right now, it froze up and I can't get it to unfreeze. It has been frustrating. I didn't read any reviews with this problem. It seemed to work terribly with Hulu, when it was working, and alright with Prime. I hate it!", "verified": true, "helpfulness": "1/2", "author": "squidvish"}, {"rating": 4.0, "review": "We have one of these on each of our TVs and use one for travel.  Overall, I've been pleased.  The four stars is because with the last one, the remote is wonky (it won't pair with the Roku - the green light just keeps blinking forever).  We happened to have an extra remote so I didn't follow up with replacing it.", "verified": true, "helpfulness": "0/0", "author": "I'm a mom"}]