[{"rating": 1.0, "review": "Just a word of advice for those who are not computer and ISP provider savvy.  IF you purchase either the Roku 3500R or the Roku 3 and happen to have Xfinity as your provider, be prepared for a long a frustrating ordeal.  I realize that many people have added these two units to their existing home networks and have had no problems at all, however, should you develop a problem, such as not being able to connect to the internet from either Roku device, there is no one that can help, not Roku, and not Xfinity.  The rumor on the net is that some providers block or disable streaming devices arbitrarily since it cuts directly into their market, but there is absolutely no proof.  However, I can tell you from personal experience that an Xfinity VOIP Gateway and the Roku \"3\" series are a match made in Hades.  Sporadic connections, if any at all, frequent drop outs, extra long buffering times, all the things that make viewing or using a streaming device a pain.  Change your ISP or get a different device, or stick with the Roku 2.", "verified": true, "helpfulness": "2/2", "author": "Mark"}, {"rating": 5.0, "review": "Very nice.  We got rid of our Direct TV and went strickly over-the-air.  The local reception is amazingly clearer than satillite in HD.  We are streaming on Hulu + and Amazon Prime.  This Roku was easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "Miles A. Kudo \"www.KoolPrintz.com\""}, {"rating": 1.0, "review": "Horrible purchase. Run Run Run", "verified": false, "helpfulness": "0/3", "author": "Dominique Rountree"}, {"rating": 5.0, "review": "LOVE!!!! We disconnected our cable and now just use this. Already got 2 more for other tv rooms.", "verified": true, "helpfulness": "0/0", "author": "Pixie"}, {"rating": 3.0, "review": "The concept is great, but hooking up to a secure wifi can be a pain. Their foreign tech support is very frustrating and in my case provided the wrong advice.Once I got past the wifi issue the only remaining issues are its slow to bootup, there is a lag between pressing a key on the remote and the system response, and on occasions it will reboot during menu selection. On the plus side it has never rebooted during the viewing.Having the Roku is better then plugging in a tablet or laptop for viewing, they just need to refine it a bit more.The product does update to the latest fixes, so there is hope some of these issues will be addressed.", "verified": true, "helpfulness": "2/2", "author": "alby"}, {"rating": 5.0, "review": "Fantastic l'il bugger! Does everything a Rocu 3500 does, x-cept play Angry birds.", "verified": true, "helpfulness": "1/1", "author": "Eggzakly"}, {"rating": 5.0, "review": "It's great for watching movies and listening to music!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Heckler"}, {"rating": 5.0, "review": "2nd one.  Works as well as the first.  Simple way to add functionality to your tv.", "verified": true, "helpfulness": "0/0", "author": "Robert Murphy"}, {"rating": 4.0, "review": "Good device.  A lot slower than the Roku3 though.  On the other hand, half the price.", "verified": true, "helpfulness": "1/1", "author": "JWH"}, {"rating": 5.0, "review": "Works really well and solved my problem of not liking wires hanging our from the bottom of my wall mounted TV", "verified": true, "helpfulness": "0/0", "author": "pantcor66"}]