[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "jelbin koury"}, {"rating": 3.0, "review": "It is odd, but it seems that every Roku model operates a little differently.  It is, as a result, a little disconcerting to have to re-educate myself on it's operation every time I use it.  For your part, the order was handled expeditiously and the product is in excellent condition and performs to specifications.", "verified": true, "helpfulness": "0/0", "author": "Terrance L. Wessling \"Terry\""}, {"rating": 3.0, "review": "This would have been a great product if both had worked. I ordered 2 but one had to be returned. The one I returned kept giving me a purple screen. It showed me the text titles and gave me voice but no visual. I tried it on Amazon, Netflix and Hulu channels and tried setting it up in 2 different homes but it wouldn't work. So, I am a half satisfied customer.", "verified": true, "helpfulness": "0/0", "author": "Arletta Carr"}, {"rating": 5.0, "review": "Love how easy it is to use and happy with all of the networks it gets!!!", "verified": true, "helpfulness": "0/0", "author": "canest \"Cat\""}, {"rating": 4.0, "review": "Replaced old roku box with the streaming stick. The R at the end of model number means Refurbished, so beware when you buy. Works great for a few dollars cheaper than new. Was a hassle to setup at first. If you have a certain security setup in your wi fi settings like WPE secure or something like that you will have some goong back and forth between wi fi and stick. I remember doing the same with a Vizio smart TV so it came to me to check settings. Help it helps.", "verified": true, "helpfulness": "0/0", "author": "Juan Guevara"}, {"rating": 5.0, "review": "use on tv in  liv rm", "verified": true, "helpfulness": "0/0", "author": "Steven Lackey"}, {"rating": 5.0, "review": "works better than expected, I figured how good could such a small streaming device work? well as good as the full size Roku as it turns out, know problem picking up the wifi signal from downstairs.", "verified": true, "helpfulness": "0/0", "author": "Joseph Hirt"}, {"rating": 5.0, "review": "Great gives me so many options for great movies and TV.", "verified": true, "helpfulness": "0/0", "author": "mary burk"}, {"rating": 2.0, "review": "If I was doing it again, I would get another Roku 3.  The remote has eaten 2 pairs of batteries in 2 weeks.  Just finished chat who directed me to update the remote firmware.  My 30 day return with amazon is up today;  As I'm writing this I believe I will return it after all.", "verified": true, "helpfulness": "0/0", "author": "BWise"}, {"rating": 4.0, "review": "it works better then I expected it too. the grandkids love it. I like the PBS NOVA on demand.", "verified": true, "helpfulness": "0/0", "author": "Dan Bowman"}]