[{"rating": 5.0, "review": "Got this for family as a gift and they love it. I have a regular Roku (an older model-not stick) but it runs great. The UI is easy to use, easy to set up, and is very user friendly to those who aren't terribly tech savvy. Great product.", "verified": true, "helpfulness": "0/0", "author": "Luke"}, {"rating": 5.0, "review": "Absolutely outstanding!Works better than advertised!The best remote I've seen. Very intuitive and superb quality.", "verified": true, "helpfulness": "0/0", "author": "William T. Patterson"}, {"rating": 1.0, "review": "Piece of junk compared to their standard Roku player. Terrible resolution and long lags in streaming.  Buy the Roku 3.", "verified": true, "helpfulness": "1/2", "author": "Pizza Man"}, {"rating": 5.0, "review": "great just plug in, answer a few question and ready to go", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 3.0, "review": "looses passwords from time to time, have to log into e.g. Netflix and others. Not really that much more convenient than the traditional Roku box.", "verified": true, "helpfulness": "0/0", "author": "CalCritic"}, {"rating": 5.0, "review": "its a bit slower than the larger roku units but i love it.", "verified": true, "helpfulness": "1/1", "author": "Debra Carter"}, {"rating": 5.0, "review": "Best product ever. As other products finally come out with these dongle-style streaming devices, remember Roku was the first. They also have a great selection (better than other competitors). The stick is hidden nicely on the back of the TV. Remember the days when a TV didn't need all those wires and cables? This allows you to relive that feeling!", "verified": true, "helpfulness": "1/1", "author": "Jason F."}, {"rating": 5.0, "review": "Bought as a present for my girlfriend. She absolutely loved it!", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 4.0, "review": "Great little device, much better than chromecast in my opinion. Its a little slow compared to the Roku 3 which is expected but still very much functional. As far as the quality it was great, the content from my other Roku synced pretty seamlessly and they can all be managed from roku's website.", "verified": true, "helpfulness": "1/1", "author": "Mr. Reviews"}, {"rating": 5.0, "review": "I got this because it supported the Acorn Channel, which streams all the good Brit mysteries, but now I also use it for my go-to radio and for music. The set-up was simple and straightforward, the WiFi connected without a problem, and the streaming seems to be flawless.I had a ChromeCast, a Roku and a FireTV Stick. I am not impressed with the ChromeCast, except for the rare times I used it to link my laptop with the TV, and the FireTV Stick did not have all the channels I wanted (but it may in the future).I would definitely buy the Roku again.", "verified": true, "helpfulness": "1/1", "author": "Stephen Wardlaw"}]