[{"rating": 5.0, "review": "I've been a Roku user/owner since the first version. I love the interface, the ease of use, the reliability. I predominantly stream Netflix, Hulu Plus and Amazon Prime content but have enjoyed some of the other channels as well since I do not have cable/satellite and haven't for years. I recently upgraded my living room to a Roku 3 box (which is awesome, btw), but I was looking for something a little smaller for my bedroom TV. This little guy is just as powerful and fast as the Roku 3 but for half the price. And upgrading is SO easy - when you add a device using your Roku login - all your channels that you've spent time selecting and arranging are there and ready to use so setup is super quick. The remote is easy and comfortable to use. I am really impressed with this little device, but not surprised - Roku has been consistently pretty awesome.", "verified": true, "helpfulness": "1/1", "author": "sheeshoo"}, {"rating": 4.0, "review": "At first had a hard time keeping Roku connected with my Cradlepoint router. After some minor adjustments and switch to channel 11 on the router, plus the Roku HotSpot that is included in the product, I am now receiving all the programs I want. Sometimes the downloads are a little slow, but overall I am satisfied with this product. It has a wide variety of viewing options including YouTube.", "verified": true, "helpfulness": "1/2", "author": "Al Galasso"}, {"rating": 5.0, "review": "The stick is great! It does require it's own power which I was unaware of. There is a power cord and a USB adapter if your TV has USB ports with enough juice to power the roku stick.", "verified": true, "helpfulness": "1/1", "author": "D. Mullen \"pontoosuc\""}, {"rating": 4.0, "review": "We are using our new Roku 3500R Streaming Stick all the time.  We especially love that I don't need to find a place to locate a separate unit, because it plugs right into to the TVs HDMI slot.  I am catching up on all the pay channel shows like MadMen, Friday Night Lights, etc.  Sometimes when using YouTube it has to pair with my phone, but that takes very little time.  We get to use common sites such as Netflix, Amazon (especially since we have Amazon Prime), Yahoo, Target Ticket and lots and lots of other channels.The only downside is on a few occasions it will stop working, and the stick seems to be very hot, so I suspect it has overheated.  If I wait 1/2 hour or so, it works with no problem. I haven't seen any news or reviews about this issue, so I don't know if it's something all Streaming Stick would experience.  Without a TV cable or satellite subscription, we can't see current programming (for the most part, though QVC and a few other programs are real time), but we didn't expect that we could. We have so much to watch, it's doubtful we'd ever be caught up enough anyway.Even with the cost of Amazon Prime, Netflix and a few other sevices, this is an excellent, much, much cheaper alternative to cable and satellite programming services. For the price, it exceeds our expectations.  Now back to finish watching House of Cards using my Roku.", "verified": true, "helpfulness": "3/4", "author": "RedRosy \"Perception is reality\""}, {"rating": 5.0, "review": "I already have a roku 2. So I was familiar with the technology. Decided to give this little guy a try and move away from using the XBox as my streaming video device. Guests are often baffled by the game controlled needed to make the Xbox play things on netflix.Popped this out of the box. Plugged it into the HDMI port and the wall, signed it onto the network, got my activation code and POOF, the magic of streaming! The simplicity of the remote after years of using a game controlled sounds like a little thing but feels pretty big to me!Love this!", "verified": true, "helpfulness": "1/1", "author": "Dennis Laughlin"}, {"rating": 5.0, "review": "Exactly what I wanted, and is working perfectly, i can watch netflix/youtube all on my tv very happy with this product", "verified": true, "helpfulness": "1/1", "author": "rick"}, {"rating": 5.0, "review": "We love this Roku device!  We did not cut our satellite TV altogether but we were able to scale it back, saving us money.  Its nice to have all these free on demand shows you can watch through Roku, and all in HD.  The video quality is amazing, just like watching satellite TV.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have had the Roku2, Roku2 XS, and Roku3.  The Roku3 costs twice as much, but is about twice as fast.  The 3500R does have the Roku3 features that I use, but does not support the controller games (XS and 3 support).  Although the stick is small, it does have some length to it that puts it into some TV case molding so there is some torque being applied to the TV's HDMI port.  Also, this is only for HDMI.  No RCA, no composite outputs.  I bought this as I wanted something out of the way in the kitchen, and to keep it dry.  And the USB power feature is nice to keep cables out of the way.  However, if you use your TV to power the Roku stick, you are turning the Roku off with the TV all the time.  The Roku will, \"bootup\", each time you turn your TV back on...  sloooooowly.  I finally just plugged in the AC adapter so the stick would be powered all the time.  That presents a different sort of problem - it doesn't shut down sometimes.  If you listen to Pandora radio, for example, it will be there three days later.  Some sort of check-in or save mode is sort of expected these days.  The shortcut buttons on the remote are nice (Roku3 should have them) if you use Netflix a lot...Biggest issue would be the speed, compared to the Roku3.", "verified": true, "helpfulness": "2/2", "author": "Robert Bentz"}, {"rating": 5.0, "review": "I purchased a Roku XS a few years ago and have been very happy with the purchase. The only thing I was not happy about was having to lug it back and forth from my living room to my bedroom in order to watch Netflix or Amazon Instant Video. The cost of this was low enough that I felt it was worth buying a second one, and it is. I really like Roku products and have not been disappointed with this purchase.", "verified": true, "helpfulness": "1/1", "author": "N's Amazon \"thepoetess\""}, {"rating": 3.0, "review": "Bought this for a wall-mounted TV to reduce wires and not need a shelf for the Roku.Three problems:1.  If you use the TV's USB port to power the Roku (to save from having to run a power cord to a wall outlet), the Roku loses power when the TV is off.  So when you turn on the TV, you have to wait a minute for the Roku to boot up.2.  Remote responsiveness isn't great.  At first, the Roku only picked up one button press in ten. It almost couldn't pick up signals from the remote at all.  I had the Roku plugged into the TV's USB port, and the excess cable was bundled and resting against the Roku.  It was probably interfering, because when I unbundled and moved the power cord to a wall outlet, the remote started working much better.  It still misses about one button push in ten, though, which is annoying.3.  This Roku is noticeably slower and laggy compared to the Roku 3.  Combined with the remote not always working, it makes for a slightly annoying experience when \"channel surfing.\"I'll use the one I have, but I won't buy another until they improve.", "verified": true, "helpfulness": "1/1", "author": "High-Tech Redneck"}]