[{"rating": 4.0, "review": "It was a replacement for my old Clasic ROKU years ago that was discontinued.  So far it is working very good. Thank you", "verified": true, "helpfulness": "0/0", "author": "Franckner Larece \"B.Boy\""}, {"rating": 3.0, "review": "It's nice to have over satellite TV but every once in a while I have to unplug it cause it will only load 25% of a show", "verified": true, "helpfulness": "0/0", "author": "samer quraan"}, {"rating": 5.0, "review": "Small but very efficient, this is my 3rd roku, defintely the best.", "verified": true, "helpfulness": "0/0", "author": "Raymond M. Lane"}, {"rating": 1.0, "review": "Roku should be ashamed at having launched such an inferior product and Amazon should be wary of its reputation for promoting and selling such low quality goods. junk sold through its distribution", "verified": true, "helpfulness": "0/0", "author": "Terry R."}, {"rating": 1.0, "review": "Please do not waste your money on this streaming stick. The remote for the stick is very, very laggy; has a tendency to become stuck and is overall very unresponsive. If you are looking for a streaming device anything else would be a huge improvement.", "verified": true, "helpfulness": "0/0", "author": "Barry"}, {"rating": 5.0, "review": "It met my every expectation.", "verified": true, "helpfulness": "0/0", "author": "Clark S. Vaughn \"clarksv\""}, {"rating": 5.0, "review": "Five star", "verified": true, "helpfulness": "0/0", "author": "mcallencastillo"}, {"rating": 5.0, "review": "So, I wanted to save some money and bought a \"not-so-smart\" display for my exercise room.  After all, I just needed something that would play television shows and movies off my Blu-ray player while I worked out on the treadmill.However, soon enough, I began running out of things to watch.It dawned on me that for that less than $10 per month, I could subscribe to one of the streaming services and have a wealth of content available at my fingertips.  However, since my television did not even have a wireless connection to support any streaming services it offered, I needed to find an accessory that could.Enter the Roku Streaming stick.  Significantly less money than the full-size device, which I did not need. I simply plugged the stick into one of the USB ports on the side of my display.  It has built-in wireless connectivity.  Upon startup, it found my wireless network.Once I registered the product, I signed up for a free month's trial of the most popular streaming service.  I was quite amazed to see how responsive Roku was to remote commands, moving through the streaming service content.  Starting a streamed television episode or movie was pretty instantaneous, with very little buffering delay.It's great that I didn't have to pay nearly twice the price for Apple TV or the full size Roku 3 to get the streaming options I wanted in this device.  It's very compact, yet very powerful.  It really has opened my world to obtaining far more content without having to actually purchase it.", "verified": true, "helpfulness": "1/1", "author": "Ronald Epstein \"Ronald Epstein\""}, {"rating": 3.0, "review": "Difficulty connecting to netflix", "verified": true, "helpfulness": "0/0", "author": "Kamal Sohal"}, {"rating": 1.0, "review": "The roku stick did not work as expected.Netflix amazon Google play seemed to be incompatible in my region.I need some clarification and advise.Thanks", "verified": true, "helpfulness": "0/0", "author": "Kelisha Thomas"}]