[{"rating": 5.0, "review": "The installation was simple and the directions very clear.  I have a wide selection of channels that interest me.  They come in sharp and have no interruptions for speed catch up.  I have saved a bundle and so glad I did it!", "verified": true, "helpfulness": "0/0", "author": "mary kohler"}, {"rating": 2.0, "review": "PROS: It is very easy to setup and use. Just plug-n-play to enjoy more programs than you can shake a stick at (ahem, no pun intended).CONS: Due to the lack of dual band streaming capabilities in a single band streaming device, there are times when the device will force programs to buffer in the middle of a streaming broadcast. After through testing, the 3500XB maxes out bandwidth throughput at about 1.3mbps. This is insufficient for many of today's 1080p streaming broadcasts. As an example, Sling TV's latest release for the Roku family of streaming devices is not supported on the 3500XB due to noted bandwidth restrictions.NOTE: I have a 105mbps connection with a very good wireless router configuration in my home, but this stick simply will not take the bandwidth. That's the bottom line and the only deciding factor that makes the 3500XB obsolete. The Roku 3 has also been tested and does not present these bandwidth or compatibility issues. Therefore, the Roku 3 is the device of choice.", "verified": false, "helpfulness": "1/2", "author": "PDD"}, {"rating": 5.0, "review": "My granddaughter loves this roku stick", "verified": true, "helpfulness": "0/0", "author": "Kat Moore"}, {"rating": 5.0, "review": "The Roku stick works perfectly. Thank you Amazon for selling refurbished products that are as good as new at a used price. You're the reason I can stay inside my budget goals.", "verified": true, "helpfulness": "0/0", "author": "Mark A. Langley"}, {"rating": 1.0, "review": "Refurbished roku stick did not stay connected to my wireless internet very frustrating ordeal spend the extra money buy a new one they work great", "verified": true, "helpfulness": "0/0", "author": "Ashd2525"}, {"rating": 5.0, "review": "Just great . Got rid of cable :) 3yrs ago.", "verified": true, "helpfulness": "0/0", "author": "Jill Kleeberg"}, {"rating": 4.0, "review": "I love my Roku Streaming Stick, enough that I bought a second one.  It is a good way to turn a regular tv into a \"smart\" tv.  I mostly use mine to watch Netflix, HBO Go and Time Warner On Demand.  There are tons of other options but these are the ones I use.  The reason I gave it four stars instead of 5: You must give them a credit card to log in, even if you will not be purchasing any \"premium\" type channels.  It arrived in terrible packaging, I am amazed it was still in the box.  Customer service was not helpful.  If you have any problems during set up good luck.  Mine kept updating the data and then gave me an error code.  I called customer service.  The guy sounded really annoyed with me, plus we were not communicating very well.  I ended up figuring out the problem on my own, with a little help from the Internet.  I am not the most electronic savy person but it was easy to install, except for the error code thing.  All in all a good purchase.", "verified": true, "helpfulness": "2/2", "author": "merricksmom"}, {"rating": 5.0, "review": "I love being able to watch Netflix, Hulu and other stations on my tv, instead of having to sit in front of my computer to do it. The only problem I had was I couldn't get the Lifetime channel and that's only because of the cable company I use. That's not Roku's fault though. I would definitely recommend this to anybody who's thinking about buying one.", "verified": true, "helpfulness": "1/1", "author": "Gail Y."}, {"rating": 5.0, "review": "The quality is excellent.", "verified": true, "helpfulness": "0/0", "author": "Mark Chapman"}, {"rating": 4.0, "review": "We LOVE the Roku 3 that we purchased and enjoy on our main television, it has been so intuitive and easy to use, way easier than streaming though our bluray . On the other hand, we have missed being able to watch content on our other TV’s...Yes I am old school about this, and not really into watching on mobile devices.While this device has also been easy to use, setup was a bit of a pain as it did not readily connect to our wifi (I ended up googling it and found the solution was to change a setting on my router). Also, it can have connection issues with our TV, almost as if a wire or plug is loose (perhaps this is the reason it needed to be refurbished). Neither issue keeps us from enjoying this on a regular basis and we would buy again.", "verified": true, "helpfulness": "0/0", "author": "unreliable source \"Unreliablesource\""}]