[{"rating": 4.0, "review": "The Roku is awesome! My only complaint is that the remote is sometimes a little finicky. But I love the portability of the stick when I travel. Would definitely buy again.", "verified": true, "helpfulness": "0/0", "author": "Rachael"}, {"rating": 5.0, "review": "Love my Roku, works very well (my wifi is very reliable) and using Netflix, got access to many of the shows and movies I wanted to see, especially BBC America stuff.", "verified": true, "helpfulness": "0/0", "author": "JT \"Nova Bball Fan\""}, {"rating": 4.0, "review": "exceeded expectations. remote is sluggish sometimes though", "verified": true, "helpfulness": "0/0", "author": "Albert B. Magnússon"}, {"rating": 5.0, "review": "Great product and super fast delivery.", "verified": true, "helpfulness": "0/0", "author": "P. J. Tuttle"}, {"rating": 1.0, "review": "Get to the same point you left out the movie the night before, the next day takes a very long time.Please advise.", "verified": true, "helpfulness": "0/0", "author": "Peter Gorodesky"}, {"rating": 1.0, "review": "Do not buy! Stick to the fire stick-cheaper and I've never had issues. The roku started acting up a week after my 30 day return window. It's to unstable or loose when plugged into the hdmi port and constantly kicks you out of roku and back to the input channel...tried jimming it to make it more stable and tried other hdmi ports on other tvs. NOT worth the money, got the fire stick a month before I got the roku for the bedroom TV and I've never had a problem...just ordered another to replace this piece of junk.", "verified": true, "helpfulness": "0/0", "author": "Helen"}, {"rating": 3.0, "review": "The power converter and usb cable that came with the stick did not work. Had to substitute another one. Connected to wifi network and setup stick, but wasn't able to stream any content. Worked when I moved it to a TV closer to the router (from 40 ft away to 3 ft away).", "verified": true, "helpfulness": "0/0", "author": "Mary A. Garcia \"Mary Garcia\""}, {"rating": 5.0, "review": "Works just as good as our ROKU 3 - using it on 2 extra tv's so it's easy to switch. Cant tell that it's remanufactured!", "verified": true, "helpfulness": "0/0", "author": "ali \"cotterpin\""}, {"rating": 5.0, "review": "Its hookup was simple because someone knew how to make the instruction manual clear & to the point. Step 1,2,3, done. I am quite pleased.", "verified": true, "helpfulness": "0/0", "author": "randy wittig"}, {"rating": 5.0, "review": "Works exactly as advertised. Everything needed to run it is included in the box. Setup is super simple.", "verified": true, "helpfulness": "0/0", "author": "F. Lastname"}]