[{"rating": 3.0, "review": "it ok.", "verified": true, "helpfulness": "0/0", "author": "Luis O. Casilla"}, {"rating": 5.0, "review": "We love this ROKU", "verified": true, "helpfulness": "0/0", "author": "Brian Hornack \"lori\""}, {"rating": 4.0, "review": "There is a catch for us outside US or Britain. It does not accept very well services like unblock-us, etc.", "verified": true, "helpfulness": "0/0", "author": "Antonio Gomes"}, {"rating": 5.0, "review": "So easy to install. Just cut my cable TV, bought a rabbit ear (not too successful with local stations so far) and the Roku. Easy-peasy, and couldn't be more delighted with technology. Binge viewing after installation.", "verified": true, "helpfulness": "0/0", "author": "Patricia L. Raymond \"Pat on books\""}, {"rating": 4.0, "review": "Works as good as my AppleTV and was quite a bit cheaper", "verified": true, "helpfulness": "0/0", "author": "Richard Nichols"}, {"rating": 5.0, "review": "Absolutely love!  Easy to use and makes me never want to leave home!", "verified": true, "helpfulness": "0/0", "author": "Frances L. Tolley"}, {"rating": 3.0, "review": "OoooookAY!Here we go.It's not bad.I got one, and the first one, the picture was awesome! Except the remote was super buggy. It wouldn't respond sometimes, and then other times, it just took off on its own.Well, okay. I'll exchange it, because I was okay with the picture.Got the exchange, remote works great! Awesome!Nope, now the picture was not as good. At all. It looked like there might have been a pin missing, but I had already packaged up the other and sent it on its way so I couldn't check.Well, by then I decided to browse and see if something else would just suit my needs better anyway, so I went up to the Roku 2.I'd say, if you can get one that works on both counts, it's pretty nifty, but perhaps not for a full time user anyway.", "verified": true, "helpfulness": "0/0", "author": "K. S."}, {"rating": 5.0, "review": "Easy setup. Easy to operate. Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Daniel R. Dunson"}, {"rating": 4.0, "review": "Pretty nice way to get your non-smart TV's hooked up to Roku. Interface is decent and the control is fairly responsive. I would recommend if you want to give your NetFlix account to your family members and they have no other way to hook their TV up. Works as advertised.If your parents struggle with tech they will not figure out how to set this up themselves. Be prepared to do this for them!", "verified": true, "helpfulness": "0/0", "author": "Ryan C OConnor"}, {"rating": 1.0, "review": "Buyer beware. This thing is very frustrating to get up and running. I get error codes 11 and 14. I have spent several hours trying different things that have been recommended on Roku message boards and through chat. But nothing works. I have a Roku XD that works fine, but not the stick. Wish I had bought another one of the old model.", "verified": false, "helpfulness": "0/0", "author": "bullie76"}]