[{"rating": 1.0, "review": "buffers (and my Roku II does not on the same wifi network) and hangs up mid-movie.  Frustrating.", "verified": true, "helpfulness": "0/0", "author": "7twists"}, {"rating": 3.0, "review": "We have 3 of these, the sticks are fine but neither of the remotes work well, does anyone have this problem?  They are just junk, so frustrating.", "verified": false, "helpfulness": "1/1", "author": "Marlena Pfeifer"}, {"rating": 5.0, "review": "This Roku stick replaced another  top brand streaming stick ,that I was constantly haveing to power off and on , Roku is by far the best . I have a Roku 2 in my living room and this streaming stick in my bedroom .and it is equal to the Roku 2 .I just can't say enough about it", "verified": true, "helpfulness": "0/0", "author": "H. Barnes \"Hi Tek Redneck\""}, {"rating": 5.0, "review": "Love it. By By Comcast extras", "verified": true, "helpfulness": "0/0", "author": "John B."}, {"rating": 5.0, "review": "Extremely pleased with it. Shipped quickly and works great!!", "verified": true, "helpfulness": "0/0", "author": "Lynda Collman"}, {"rating": 5.0, "review": "The remote is awful, needs to be paired again and again. Sometimes it stops working in the middle of a show or movie. But using the stick with the remote app works great.", "verified": true, "helpfulness": "1/1", "author": "Courtney Dee"}, {"rating": 5.0, "review": "I love the stick.", "verified": true, "helpfulness": "0/0", "author": "Donnie S Cromartie"}, {"rating": 2.0, "review": "I bought a refurbished unit from amazon to replace the new unit I had bought directly from Roku.  The first unit just wasn't ready for prime time - it's operation was erratic.  The new \"refurbished\" unit suffers from the same problems.  I have other streaming systems on my TV but Roku offers the most options and my earlier, now discontinued Roku box worked very well.  My TV has built-in Netflix, as does my Apple TV so, with the Roku I had 3 sources for Netflix.  The Roku  Netflix sometimes hangs and buffers; when these problems occur I switch to either of the other sources (all using the same Wifi network) and have no problems.  Surprisingly one of the biggest sources of frustration has been the remote control.  It uses RF instead of infrared (probably because the Roku stick is behind the TV) and should be robust and reliable.  I experienced numerous problems both with the the Roku Stick reliably receiving my button presses and also with the unit misinterpreting commands.  Just before writing this review I tried to reverse a short distance and I couldn't stop it from reversing to the beginning of the movie; I just unplugged the Stick.  I have another Roku stick upstairs and have been more successful with it but still have occasional erratic problems.  So 2 out of 3 Roku sticks have been very erratic and the other occasionally erratic.  If I were to rate this product on the available programming it would be 5 stars, but it ultimately has to be reliable to enjoy that programming and on that criteria I have to rate it as 2 \"I don't like it.\"  Many of the other Amazon reviews cite similar problems; the product needs more development and refinement.  If you do decide to purchase one of these units there is one other limitation to consider.  The stick can be powered by the HDMI port and that was one of the features that attracted me to it.  However, if used that way it has to \"boot up\" each time the TV is turned on (at least on my TV) and I ultimately found it better to use the power plug that came with the unit so avoid having to start from scratch each time the TV set is turned on.", "verified": true, "helpfulness": "0/0", "author": "Loyal Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jackie V."}, {"rating": 4.0, "review": "Got a g deal on this, ten dollars off. That was a minor reason for buying this , if you want to cut yourself off from the 200 dollars and more from cable tv I would suggest you start with is. Used Roku for ten years and this is really a good reliable electronic instrument. Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "jjm"}]