[{"rating": 5.0, "review": "Once I figured out the sound issue between the Roku and my TV, love it.  Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "LadyVW"}, {"rating": 1.0, "review": "Worst product ever. I have spent 90 minutes online with customer support trying to get it to connect to WIFI. No success. Huge waste of time! I was forced to give it 1 star because 0 was not an option.", "verified": true, "helpfulness": "0/0", "author": "Colleen Hunt \"NorthernDesign\""}, {"rating": 2.0, "review": "I am not sure what is wrong with Amazon's stock of the Roku product. But I had to go through one player before I got the second one to work. We have two that we have purchased for family from other stores that were local and this one was a disaster. I would recommending purchasing the product anywhere else but Amazon as the ones they stock do not seem to work well.", "verified": false, "helpfulness": "0/0", "author": "Natalie Rhea"}, {"rating": 5.0, "review": "Wonderfu product-easy to use", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 1.0, "review": "Most of the things you see on the selection you have to purchase. .sorry. .", "verified": true, "helpfulness": "0/0", "author": "Yohannes Edward"}, {"rating": 5.0, "review": "The first one arrived with a bad remote and I had to return it, which was disappointing, but when I called, the man couldn't be nicer and sent a new one that day and told me that he would send me a return label and to take my time returning it.  The new one was here in two days.  I like it better than the X-box 360, so easy to navigate and fast downloads.", "verified": true, "helpfulness": "0/0", "author": "Dallas"}, {"rating": 2.0, "review": "This Roku does not work out of the USA. It will not stream and it will not play netflix even if you have an active Netflix account in your home country.A wasted purchase. It should show this on the sales advertising.", "verified": true, "helpfulness": "0/0", "author": "Desmond R. Curtis"}, {"rating": 1.0, "review": "This product was truly a disappointment. The remote is totally ineffective and has to continuously be reset. I am so sad. It's not worth the shipping cost to return it.", "verified": true, "helpfulness": "0/0", "author": "Jessie Sylvester-Smith"}, {"rating": 3.0, "review": "back button does not work", "verified": true, "helpfulness": "0/0", "author": "ray"}, {"rating": 5.0, "review": "What's not to like? It's a Roku in a stick. I am a Roku fan. I have been using a Roku 1 since, well, a very long time. When I needed another device for my TV outside I could not think of any reason to go with anything else. And I don't have to go dig out another HDMI cable!! The only negative thing I could say is that the Slingplayer app is not stand alone but I think that is probably more the Sling team than the Roku team.", "verified": true, "helpfulness": "0/0", "author": "Miggo"}]