[{"rating": 5.0, "review": "I had the Roku with the box . Works the same ,without the clutter on my TV stand .", "verified": true, "helpfulness": "0/0", "author": "PaulS"}, {"rating": 5.0, "review": "Love, love, love my streaming stick, and it connects to the internet a whole lot faster than my new smart tv.", "verified": true, "helpfulness": "0/0", "author": "Barbara W."}, {"rating": 1.0, "review": "Had to return it as it didn't work with my really cheap Seiki TV and satellite hookup.  I'm sure this is a fine product and someone with more electronics knowledge (which is just about everyone else in the world) could have worked around the TV's limitations.", "verified": true, "helpfulness": "0/0", "author": "Adobe Gardener"}, {"rating": 5.0, "review": "Worked much better than the Amazon Fire stick.", "verified": true, "helpfulness": "0/0", "author": "DJ Schmidi"}, {"rating": 3.0, "review": "Not upgrade able not as broad channels and services as Amazon Fire Stick. Don't care for Google Chrome Cast.", "verified": true, "helpfulness": "0/0", "author": "Randy Posey"}, {"rating": 2.0, "review": "The remote stops responding constantly. When that happens, you have to disconnect the power and reboot and HOPE that the remote will pair again when it restarts. If not, you'd better hope you have a smartphone with the Roku app, because you won't be able to do anything to select \"pair remote\" under the system settings menu.I've tried everything, including accessing the \"secret menu\" to update the remote's software. I think I'm going to take it back and try to return it.  Unfortunate.", "verified": false, "helpfulness": "0/0", "author": "Suzann"}, {"rating": 1.0, "review": "Purchased a new one and when it came you could clearly see it was used and the power cord was broken. the batteries we lose in the box and the box was taped up.", "verified": true, "helpfulness": "0/0", "author": "Jeff W."}, {"rating": 1.0, "review": "Roku Sucks!", "verified": false, "helpfulness": "0/2", "author": "Kevin Soliday \"heavykevie\""}, {"rating": 5.0, "review": "this stick is awesome easy to set up. lot of things to watch. get one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "works perfectly fine.", "verified": true, "helpfulness": "0/0", "author": "xena15"}]