[{"rating": 1.0, "review": "I bought this piece of crap for one reason.  So my son could watch his WWE Pay Per Views Without Involving A Gaming console.m It Worked for ONE WEEK!  Since then, it refuses to connect to the internet, even though it is connected properly.  PIECE OF CRAP!!!", "verified": true, "helpfulness": "0/0", "author": "Frank E. Macdonald"}, {"rating": 4.0, "review": "The Roku Stick is great, I'm trying to figure out now if I can stream internet off my mobile device to the tv using this item.", "verified": true, "helpfulness": "0/0", "author": "Matthew Wolanczyk"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Sumii"}, {"rating": 5.0, "review": "Working great", "verified": true, "helpfulness": "0/0", "author": "Ricardo Rodriguez"}, {"rating": 4.0, "review": "Didn't want to spend the extracash for the newer version so got this one instead. Got two in fact and are working good so far. They do run a little slow on most apps and when booting up (especially on USB power). Also get a little warm but not hot (they are small). Overall does the job and streams content well.", "verified": true, "helpfulness": "1/1", "author": "TY"}, {"rating": 5.0, "review": "Love this product. I have 2 streaming sticks for the kids and a Roku 3 for the f family tv. Don't miss cable at all.", "verified": true, "helpfulness": "0/0", "author": "Karyn Workman"}, {"rating": 5.0, "review": "Used perfectly with Netflicks and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "homeoftlc"}, {"rating": 5.0, "review": "Bought this for my husband when he was recovering from surgery....it has been FABULOUS!!!!!", "verified": true, "helpfulness": "0/0", "author": "Colleen M. Ryan \"Colleen Ryan\""}, {"rating": 5.0, "review": "Does the job!! Great deal!!", "verified": true, "helpfulness": "0/0", "author": "Mary Salyers"}, {"rating": 5.0, "review": "This is a great, cheap way of getting internet TV.  The set up was easy, and there are hundreds of free channels!  Love being able to watch netflix directly on my TV instead of my computer.  Since we don't have cable or satellite this is a great way to watch things my family loves: PBS, the cooking channel, a local news channel, and a lot more.  Some things aren't streamed live, but you still have a great selection.", "verified": true, "helpfulness": "3/3", "author": "Amazon Customer"}]