[{"rating": 5.0, "review": "After looking through all the Roku products, I decided to get the Roku 3500R Streaming Stick. Very easy to use and set up with absolutely no problems. The stick is non-obtrusive and fits into any HDMI port that is available on the back of your set. The remote comes with Four quick access buttons which  has Netflix, Amazon, Mgo and Blockbuster. And Kudos to Roku, they actually give good batteries for the remote (Duracell) not those cheap ones that you usually get. As I am a subscriber to Netflix and Amazon this was perfect for me. Highly recommend this product to anyone looking to stream their movies through their Wi-Fi home network.", "verified": true, "helpfulness": "0/0", "author": "Cris"}, {"rating": 5.0, "review": "I've been looking for an inexpensive way to watch television for a long time. Cable is getting really expensive.besides most of the movies are repetitive.  I'm been an  avid user of Netflix for several years but was looking for more variety. Roku has did just that...there are tons of movies that are FREF but there are some you have the option of paying for. The best part is that your in control not the CABLE COMPANY. I highly recommend this product for anyone wishing to save money period.", "verified": false, "helpfulness": "0/1", "author": "Prayn-Diva \"Prayn-diva\""}, {"rating": 3.0, "review": "These seem slow.  I bought two.  One of them is in our office's \"Childrens' playroom\" and you will easily spend a minute trying to get something on Netflix® to play.", "verified": true, "helpfulness": "0/0", "author": "Robert B. Rice \"RICER\""}, {"rating": 5.0, "review": "I just bought another streaming stick for my mom to use.  She is thrilled with it - especially the simple remote because it has so many less buttons than most other technology.  It's perfect for her.", "verified": false, "helpfulness": "0/0", "author": "Jody"}, {"rating": 5.0, "review": "this thing is just amazing.  If you have a home network and like to watch movies at home then I highly recommend purchasing this.Its simply to install and there are million if not billions of movies TV show to chose from. many you have to buy or rent but still some for free. If you have a HDMI on your TV and you like movies this is a must.  You can also watch your  You Tube channel and well as video and photo from your Face book page.", "verified": true, "helpfulness": "0/0", "author": "Matthew Para \"music junkie\""}, {"rating": 5.0, "review": "The Roku works great! I use it with my desktop computer that has a 24\" TV as the monitor with no cable attachment.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Bought this device yesterday, and I absolutely love it!! It's small, inexpensive, and does the job. Very good picture quality. I was initially concerned because ppl have complained about the lack of speed when booting up Netflix, but I found this to be minimal. It takes about a full minute to boot up whenever you open the Netflix library, but it moves pretty quickly after that.  No other issues. I would HIGHLY recommend this little baby!!", "verified": false, "helpfulness": "0/0", "author": "NSippial"}, {"rating": 5.0, "review": "I already had a roku box and this little stick is fantastic.  It's cheap and does everything i need it to do.  The little bit extra you pay compared to the competitor's is in my opinion well worth it for the remote and not being locked in or directed to Amazon or Google content.  I liked it so much when I went on a recent trip and realized I'd forgot to bring it with me I thought nothing of stopping off at a store and picking up a second one.", "verified": true, "helpfulness": "0/0", "author": "L. Mujica \"RayMan\""}, {"rating": 1.0, "review": "Bottom line: did not work. Buffering, slow slow slow remote reaction. We tried watching a show on netflix and it stopped to buffer several times. Turned off laptops, phones, etc. still no good. Ended up just watching the show on our laptop. Which worked fine. So we know the issue was the roku, not the wifi. Tested the other \"channels\" over the next few days and at different times of day to see if there was a difference to no avail. Also, like others have said, it interfered with our antenna set-up. All in all, we were really excited, especially after the incredible amount of great reviews! But we're ultimately disappointed, returned.", "verified": false, "helpfulness": "4/4", "author": "Daron Nicole Walters"}, {"rating": 2.0, "review": "We bought this thing about three months ago.  At first it was pretty good.  Browsing and searching are super clunky but I'm willing to overlook that if the playback is good...  and it is.  It streams beautifully in 1080p.  Here are some problems that we've had with it that make it not worth $50.  The first or second day we had it, we had to reset the remote.  I don't know why.  It just wouldn't work anymore.  It seemed to lose connection to our wireless about once a week.  I guess that may be a problem with my wifi but it's the only device we own that has an issue.  The final straw, though, was that while watching Netflix this afternoon, we paused the movie and the screen went black.  Ok, that's weird.  My tv displayed a \"No Signal\" message.  I tried moving the stick to all the other HDMI ports, using power from the power strip rather than USB power from the tv, resetting the remote, resetting the unit...  Nothing.  I started a live chat with Roku customer support and explained the issue.  The Customer Service Rep was asking questions trying to conclude that my tv is the issue.  Nope.  It's not.  Eventually, they said they were going to replace it.  I just had to ship it back to them, then, once they received the defective unit, they'd ship a new one to me in 3 to 5 business days.  That means in two weeks I might have a replacement that may or may not crap out again in three months.  Thanks, but no thanks.  I think I'll spend the extra money and try the Amazon Fire TV or Apple TV.", "verified": true, "helpfulness": "0/0", "author": "RobBauer"}]