[{"rating": 3.0, "review": "The Roku Stick works fine.  I just have one problem.  I have three HDMI ports on my television.  Because the Roku Stick is wide, I cannot plug my DirecTV cable, my Blu-ray cable, and the Roku Stick into the three ports.  If I want to use the Stick, I have to unplug one of my other devices.", "verified": true, "helpfulness": "0/0", "author": "RONALD A PETRIN JR"}, {"rating": 5.0, "review": "Can't say enough great things about my Streaming Stick! It is perfect for home use and is easy to move from one television to another.", "verified": true, "helpfulness": "0/0", "author": "Neal Umerley"}, {"rating": 3.0, "review": "The streaming stick would not work consistently in my home.  It would function perfectly one night and then freeze on the start up screen another.  The power source cord also made the stick too long so it couldn't be plugged into the TV that I had originally purchased it for. If you can get this thing to actually work in your house, it's great.  Easy format to work with and a bunch of extra channels can be added.  I was also able to add a remote app on my phone so I didn't have to search for the Roku remote at night which was handy.", "verified": true, "helpfulness": "0/0", "author": "Bj"}, {"rating": 5.0, "review": "I love this roku came as expected", "verified": true, "helpfulness": "0/0", "author": "Jasmine"}, {"rating": 1.0, "review": "Went through five just to find out that it's impossible to get a good enough wifi signal to work properly in the room I'm using it in. Not happy with their customer service either. I would NOT recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "Jenn"}, {"rating": 4.0, "review": "Great entertainment - a world of movies, videos and TV shows at my fingertips!  A user's manual would have been very helpful.  The stick works a little too slowly compared it with the instant responses I get from my PC and my cable remote.", "verified": true, "helpfulness": "1/1", "author": "Beth I. Morey"}, {"rating": 4.0, "review": "Like it so far.  I am a Prime member, so I've watch a lot of movies on it, both regular & Prime.  Still trying to figure things out on it like how you stream to it from your laptop.  I have not been able to find a user guide for it online, only a setup guide.  Once you set it up you are kind of on your own.  This is why I gave it 4 stars.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 1.0, "review": "JUNK. Whatever you did to earn the $50 to buy this product, just do it again and buy the Roku 3.We have had a Roku 3 for a year and we love it. Our only complaint is that the 3 freezes sometimes. When we got a second TV we wanted a second streaming device, and the stick, with all the features of the 3, a dedicated remote, and a gentle price tag seemed like a win. NOPE. It's not just the 3 in a sleeker case. The processing speed is significantly slower. It lags, it freezes, it takes forever to load, and that BS about the remote not needing a line of sight is, well, BS. We have it plugged into the wall, but it goes into standby mode and we have to unplug it and replug it to get it to turn on. Plus, for no particular reason, it will stop playing the audio on certain tv shows on Netflix. It will play the audio one day and the next day (wit no changes to our setup or settings or anything) it won't play the audio of a show it was playing the day before.We're going to return it and get another 3", "verified": true, "helpfulness": "0/0", "author": "Red Dog"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "nygirl30"}, {"rating": 1.0, "review": "Stopped working after 8 months.", "verified": true, "helpfulness": "0/0", "author": "Ross W."}]