[{"rating": 1.0, "review": "I have a Vizio TV with wi-fi that has Amazon and several other streaming services (Netflix, Crackle, etc.). The Fire Stick constantly has trouble connecting to the network, while I'm able to connect to the same services with my Vizio TV with no problem. (We live in a rural area, maximum available DSL speed is 1.5 Kbps, we have wi-fi at 6 Kbps and we might be able to get 12 Kbps if we switch to Exede satellite service.) So far, I can't see what the hype is all about.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"mohoosier\""}, {"rating": 5.0, "review": "I love the fire stick.  I used to have a roku.  I would never use anything else.", "verified": true, "helpfulness": "0/0", "author": "Paula Glasgow"}, {"rating": 5.0, "review": "So far it works well, and was very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "danaebug"}, {"rating": 5.0, "review": "Love the stick and the fact that I can carry it when traveling so I can use it in hotels that require passwords on Wi-FI", "verified": true, "helpfulness": "0/0", "author": "john in jax"}, {"rating": 5.0, "review": "Content streams perfectly, little to no buffering, no connectivity issues with my wifi, setup and watching a show in less than 15 mins. Remote works perfectly. Will be purchasing another for a second TV. Love, love, LOVE it!", "verified": true, "helpfulness": "0/0", "author": "victoria"}, {"rating": 5.0, "review": "It is working great,  we love it so far so good. Sling tv has some performance issues but overall everything else has met or exceeded our expectations.", "verified": true, "helpfulness": "0/0", "author": "Johnny Bunch"}, {"rating": 5.0, "review": "I bought this for traveling. It works for all HDMI TV hotel internet setups, even the password portal types. Once you choose the hotel wifi, it pauses for a minute or 2 as if it wont connect...then the hotel login screen opens with no problem. Works great. A must have.", "verified": true, "helpfulness": "0/0", "author": "Adam Lomax"}, {"rating": 2.0, "review": "May I first day, I was very excited for this product.  Unfortunately, it has continually froze while watching Hulu, Netflix, and Sling TV.  Additionally, it disconnects from the Internet fairly regularly.  We upgraded our internet to 50 Mbps, and it still froze.  When we watch on our Wii, it never freezes.  I contacted customer service, and it didn't help.  It was a waste of an hour, while the lady had me reset and unplug every device.  I recommend selecting another product.", "verified": true, "helpfulness": "0/0", "author": "Kyle Lindey"}, {"rating": 5.0, "review": "I love my fire stick. Easy to install. Battery was the only hard part. So many choices of what to watch, especially with the prime membership. Love it!", "verified": true, "helpfulness": "0/0", "author": "Nichole"}, {"rating": 5.0, "review": "We Love our Fire TV Stick.  We brought it to the marina where we keep our sailboat, and had no problem using it.  Since I was bragging about all of the prime movies we could watch, my friend purchased one as well.  Actually, my sister also bought one.  The fire stick turns your tv into a smart-tv without the price. I'm glad we finally purchased one.", "verified": true, "helpfulness": "0/0", "author": "Trish"}]