[{"rating": 5.0, "review": "This is fun, and a lot more convenient than my wireless blu-ray player.", "verified": true, "helpfulness": "0/0", "author": "T. Rathburn"}, {"rating": 3.0, "review": "Bought two of these to be able to playback movies from my NAS using a wifi router. It has been working more or less until the last update. Now all videos hang and just stop every few minutes for some reason. Something wrong with it.The playback for prime content is fine, no problem there. If you want to use it as a setup box, you might not get what you expected.", "verified": true, "helpfulness": "0/0", "author": "PTY_Buyer"}, {"rating": 3.0, "review": "You have to pay for all programs.", "verified": true, "helpfulness": "0/0", "author": "Omar Rodriguez"}, {"rating": 5.0, "review": "Use it all the time", "verified": true, "helpfulness": "0/0", "author": "Patricia Ruggles"}, {"rating": 2.0, "review": "I enjoy fire tv but im getting tired of the stick. The stick will repeatedly restart when i plug the usb into my tv's usb port. It inly works if i plug it into my xbox one usb.  shouldn't most tv's produce enough power to use the stick?", "verified": false, "helpfulness": "0/0", "author": "timothy"}, {"rating": 5.0, "review": "On order", "verified": true, "helpfulness": "0/0", "author": "James Raymond Thacher \"jamesrthacher\""}, {"rating": 5.0, "review": "The best entertainment purchase we've made! Beautiful hi-def images. More than we could have asked for, just waiting for A&E; and HBO NOW to get on board to make it absolutely perfect.", "verified": true, "helpfulness": "0/0", "author": "Emily Halloran \"damaya\""}, {"rating": 5.0, "review": "I cut the cord from cable and I'm saving lots of money. I'm happy. as long as you have Netflix and Hulu Plus you are good. YouTube channel is also very nice and also I heard radio.", "verified": true, "helpfulness": "0/0", "author": "Demetrius"}, {"rating": 5.0, "review": "Excellent, easy to use", "verified": true, "helpfulness": "0/0", "author": "Maritza"}, {"rating": 1.0, "review": "overrated. Very disappointed. the general UI needs more polishing, its just too lazy with animations. amazon pushes amazon's video content over competitor apps, so instead of seeing all of the available ways to watch a movie via prime, netflix, hulu, it doesn't do that well enough for me to recommend this device. Youtube app is slow. All apps other than hulu, netflix, prime apps are all half-assed converted android apps that may or may not work correctly. I am very disappointed in this device. especially the slingplayer app, the main reason I got this device, the sling player app is just so annoying. It gets the job done, and thats about the only pro, too many cons to list: slow ui, no built in channel guide, extreme lag pressing/sending any button commands, Can never do full HD, \"better\" quality skips, its only watchable at \"good\" quality. My slingbox is on a 55Mbps download and 27Mbps upload and plugged directly into the modem (for testing purposes)! and the remote spot is 30Mbps download, so there is no reason to not be getting full HD, let alone skips. I am extremely disappointed with my slingplayer app and the firetv stick in general. BUT it is still better overall than the slingplayer / chromecast!I would not recommend this device. But if you are looking for a simple plug and play slingplayer app, even though it sucks, than this is probably the best option right now since it sucks less than the chromecast.", "verified": true, "helpfulness": "1/1", "author": "TheDude"}]