[{"rating": 2.0, "review": "It says my wifi connection is slow but that only happens with fire stick", "verified": true, "helpfulness": "0/0", "author": "George Carolan"}, {"rating": 5.0, "review": "I love the Amazon Fire TV stick.  I've recommended it to my friends.  The stick was more than I thought it would be.  I watch this more than I do regular tv.", "verified": true, "helpfulness": "0/0", "author": "Eva DeFiglo"}, {"rating": 5.0, "review": "I got this Fire Stick specifically to watch Netflix on my tv at home, and it has been so awesome!  It was very easy and intuitive to set up, although it does take a bit of time to do so because you have to type wi-fi password in with the included remote (and in my case download the Netflix app and put in your password to that as well).  Now that it's connected, it's quick to start up and load my shows.  I have never had cable, so for me this has been a very cheap alternative and a real treat.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 4.0, "review": "So far so good.  Much better than chromecast.", "verified": true, "helpfulness": "0/0", "author": "Daniel Alperovich"}, {"rating": 5.0, "review": "Excellent product I must say that is even better than apple tv", "verified": true, "helpfulness": "0/0", "author": "George Pavesio"}, {"rating": 4.0, "review": "Easy as all get out to install and set up. Now I can get prime movies and Netflix and a bunch of other things.  I love it", "verified": true, "helpfulness": "0/0", "author": "Maureen M. Markunas \"Blizz. Mom\""}, {"rating": 5.0, "review": "Love it! Easy to use, simple, light, better than roku!", "verified": true, "helpfulness": "0/0", "author": "Eunice Murphy"}, {"rating": 5.0, "review": "Well designed and easy to use", "verified": true, "helpfulness": "0/0", "author": "RabidAvid"}, {"rating": 4.0, "review": "this is easy to use", "verified": true, "helpfulness": "0/0", "author": "christ gagliastre"}, {"rating": 5.0, "review": "Has why not to offer than I expected. Very glad I brought it and telling everyone I know about this.", "verified": true, "helpfulness": "0/0", "author": "ALBERT DEWAYNE CARTER"}]