[{"rating": 5.0, "review": "Daughter purchased a Fire Stick several months ago and really loved it.  We are Amazon Prime Members.  So we purchased one for ourselves.  We use it quite often.", "verified": true, "helpfulness": "0/0", "author": "JeffreyH"}, {"rating": 4.0, "review": "We have used this for a couple days now and really enjoy it.  It is very similar to an Apple tv but it is driven primarily around the Amazon prime system.  There are apps and games to play.  The apps download fast and they include hulu and Netflix to name a few.  I like the parental settings that force a pin #to be typed in when purchasing movies.  I also think the remote is easy to use.  I did notice that it seemed to get hung up when our internet slowed down and it persisted to show the spinning loading circle.  When our internet speed caught back up the Fire stick was still slow, so I ended up unplugging it and letting it reboot.  After that it worked fine and the picture quality is great.", "verified": true, "helpfulness": "0/0", "author": "JPants"}, {"rating": 5.0, "review": "Easy installation and good Amazon support.", "verified": true, "helpfulness": "0/0", "author": "Heidi B."}, {"rating": 5.0, "review": "Great device, very easy to use.", "verified": true, "helpfulness": "0/0", "author": "dale"}, {"rating": 5.0, "review": "The Fire Stick was so easy to set up.  I was up and running in less than 10 minutes.  The remote is easy to use and the menu is very easy to read for selections.  Thumbs up!!", "verified": true, "helpfulness": "0/0", "author": "Katherine H."}, {"rating": 5.0, "review": "We really enjoy watching movies when we have time.  It's been so hot lately that we stay home and watch movies.  Why drive into town to a theater,  spend a ton of money to see a movie.  This is the best thing we've done for ourselves this summer.  We love it!", "verified": true, "helpfulness": "0/0", "author": "Elida Jones"}, {"rating": 5.0, "review": "Very easy to implement and start using", "verified": true, "helpfulness": "0/0", "author": "Jack Dickinson"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Doreen Marquis"}, {"rating": 5.0, "review": "very easy to set up. excellent picture. am pleased", "verified": true, "helpfulness": "0/0", "author": "charlieb"}, {"rating": 5.0, "review": "east to set up and use.", "verified": true, "helpfulness": "0/0", "author": "greekpmd"}]