[{"rating": 5.0, "review": "super easy to use and great picture.", "verified": true, "helpfulness": "0/0", "author": "michael  gunter"}, {"rating": 5.0, "review": "This product has completely taken the place of my cable- I love it!", "verified": true, "helpfulness": "0/0", "author": "Erin Lynch"}, {"rating": 4.0, "review": "Excellent, Love it!! Beats DirectV bill every month hands down!!", "verified": true, "helpfulness": "0/0", "author": "John Kinney"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "christian"}, {"rating": 3.0, "review": "Missing crunchyroll from my roku. Touted as been faster that roku stick so far not seeing it.", "verified": true, "helpfulness": "0/0", "author": "KYTimelord"}, {"rating": 3.0, "review": "Whish it had more options to work with home automation, like savant, crestron, or control 4", "verified": true, "helpfulness": "0/0", "author": "Carl Seelig"}, {"rating": 1.0, "review": "The Amazon TV Stick created an audio problem in our system.  We found the installation directions confusing and could not easily find out what prime TV programs were cost free.  For these reasons we are returning it.", "verified": true, "helpfulness": "0/2", "author": "Avid Collector \"Colibri\""}, {"rating": 5.0, "review": "It is an Awsome thing to have.  I dont have to go to the Redbox and stand in line to get the movie that I want just to find out that is not awaiable.  The movies are great and recent, the games are nice (the ones the kids play with), and all the extra features are great to have at your finger tips.  Great Choice.", "verified": true, "helpfulness": "0/0", "author": "m.taco"}, {"rating": 5.0, "review": "The first one I bought had a defective extender in it, but after I exchanged it, it has worked very well. I like the remote rather than the phone to run it!", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "Very fast and easy love it", "verified": true, "helpfulness": "0/0", "author": "Saron  Asseged"}]