[{"rating": 5.0, "review": "We love the Amazon Fire TV stick! There are so many great TV shows and movies available to watch anytime you chose.  I was very impressed with the price, as well as how easy it was to connect to our TV.", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 5.0, "review": "Works even when my Apple TV and cable don't. I love it", "verified": true, "helpfulness": "0/0", "author": "Enchanted Riley"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 4.0, "review": "I think will be fine but the instructions are terrible. There is a lot more to do than it says either in the little book or on screen.", "verified": true, "helpfulness": "0/0", "author": "Deborah Thomas"}, {"rating": 5.0, "review": "Love this thing, hardly watch regular tv anymore.", "verified": true, "helpfulness": "0/0", "author": "Andrew Gale"}, {"rating": 4.0, "review": "The Fire TV Stick is amazing. I wanted to get a Roku box for a long time, but couldn't justify the high price. So when Amazon introduced this product I jumped on it.I've had the product for well over 5 months. I keep using it more and more over the Xbox and PS3 for streaming services. I don't have to turn on any devices or do anything special. All I need to do is change inputs on my tv and the Fire TV stick will fire right up.I love how I can install KODI onto the device, which adds a whole new dimension to the experience.In regards to streaming quality, it is fast and great. Videos streamed from Amazon and Netflix are at 1080p automatically when the applications are launched. There is no slow build up of 480 to 720 to 1080p like on my PS3.All in all, a wonderful product.", "verified": true, "helpfulness": "0/0", "author": "Lisa Yang"}, {"rating": 5.0, "review": "Netflix, Prime right at our fingertips, and absolutely no more infomercials", "verified": true, "helpfulness": "0/0", "author": "Susan H. Bittiker"}, {"rating": 1.0, "review": "Ad is deceiving- did not know I had to plug into an outlet! Nothing seems to be free?? No movies, etc. like Roku!!!Very disappointed!!😢", "verified": true, "helpfulness": "0/2", "author": "Kathleen Faherty"}, {"rating": 5.0, "review": "I bought 1 for each room in my house. Very impressed, Love all the features and the ease of use to set up. I haven't watched cable since I set this up.", "verified": true, "helpfulness": "0/0", "author": "F Williams"}, {"rating": 5.0, "review": "Early to install and use. In the process of using the all the features. A good investment", "verified": true, "helpfulness": "0/0", "author": "Richard Terzigni"}]