[{"rating": 5.0, "review": "Outstanding product! Thank you!!!", "verified": true, "helpfulness": "0/0", "author": "movieman0508 \"Chris Crenshaw\""}, {"rating": 5.0, "review": "Great value. Saves run time on my Xbox.", "verified": true, "helpfulness": "0/0", "author": "cj"}, {"rating": 5.0, "review": "How do I design a complex computer system, bulletproof the software, package it in a 1 cu inch package, sell it for $40, and make it simple and easy for any consumer to use and enjoy out of the box? This has been my challenge for many projects I have undertaken throughout my career. Rarely have I been able to achieve the level of engineering elegance that the Amazon development team has reached with this exciting product. Congratulations on a spectacular job!", "verified": true, "helpfulness": "0/0", "author": "Peyton"}, {"rating": 5.0, "review": "So far, so good.  Equal to the Roku stick, much better than Apple TV.  Great, inexpensive way to turn an older TV into a smart TV.  Easy setup, easy to operate.  Good job, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Gen X Dad"}, {"rating": 4.0, "review": "the device is very easy to setup. functions very fast. plays selected videos almost instantly. If i could change 1 thing about it, im not too crazy about the interface i feel like it could be simplified a bit.", "verified": true, "helpfulness": "1/1", "author": "Christopher Guthrie"}, {"rating": 5.0, "review": "Loving it , though not explored all the options", "verified": true, "helpfulness": "0/0", "author": "sudheer"}, {"rating": 5.0, "review": "Great device, remote app works better than I tought it will. Load times are much improved than others.", "verified": true, "helpfulness": "0/0", "author": "Raul D Villagarcia"}, {"rating": 3.0, "review": "Device it's missing some of the most common applications. The device also present performance problems with navigation, steaming, and audio.", "verified": true, "helpfulness": "0/0", "author": "Efrain Vicente Figueroa"}, {"rating": 5.0, "review": "This item is more than u can imagine. Easy to operate, which being in my seventies titular appreciated. Highly recommend to all ages.  Don't forget there is parental controls.  Thanks Amazon.", "verified": true, "helpfulness": "0/1", "author": "Bill Young"}, {"rating": 3.0, "review": "I have had the Roku, Google Chromecast, and now I have tried the Amazon Fire Stick.  I was going to to send this piece back to Amazon as it is just not where it should be.  The remote is cheap and the interface just doesn't seem to work with the remote.  I started to watch a program and a few minutes later I need to change it to something else.  No clue as to how to go back.  I had to exit out of Netflix completely and then try to go into the app again.  (Edit here I found there is a close Netflix button)When I did the screen would do nothing. . .nothing. . .nothing...then it went crazy and started to scroll uncontrollably.  I had to unplug the unit and found it was extremely hot.  I do not think that should happen.  (Update I have been using this for about a week since this happened and it has not happened since.  I will need to keep am eye on to make sure it does not happen again)A couple of the real downsides to this product are the inability to search on Prime.  If there is a way I could not find it after about a half hour of looking.  I had to log back onto my computer to add a program I knew was one prime.The other is the issue with lack of an apple app. Perhaps searching and running this will be easier with the Iphone/Ipad app.  I really dislike to use of an additional remote.  So now I have one for my tv, one for cable, one for the stereo, one for the Bluray player.  I really do not need anothe remote to look after.  If only I could find a universal remote that actually was good for everything.The Google Chromcast has a nice app that allows me to broadcast from either my Iphone or Ipad.  I have never had an issue with it.  The Fire TV Stick will eventually have an app.  I just don't think I care to wait for that to come out.I am going back to my Chromecast.  I do not need to play games or want to buy an additional controller to do so.I only wish that Amazon Video was available of the Chromecast as an app.This is my first purchase that Amazon has put out that I have been unhappy with.  I am going to keep the product after some thinking about it.  This is the first edition and it looks like they are able to upgrade.  Hopefully some of these issues will be fixed.", "verified": true, "helpfulness": "5/7", "author": "T. Bueschel"}]