[{"rating": 5.0, "review": "I bought this for my daughters room since she didn't have cable in their. It was a great buy.", "verified": true, "helpfulness": "0/0", "author": "Franklin Blackmon"}, {"rating": 5.0, "review": "We did our research on fire stick tv against the other wifi sticks out there.  1.) We have had Netflix with no connection to our tv forever-- 2.) We added the prime tv for the year (Free 2 day shipping is a bonus)-- 3.) We aren't cloud people..i.e. Google or icloud.. It was easy to set up and I did it while drinking a beer..so it was really easy. Now that football season is winding down we need to catch up on shows and movies that we couldn't get on cable. We probably wont be buying the voice remote but we are considering the game remote in the future for the grandchildren.Love the fire stick so far and its 1/2 the price of apple tv.", "verified": true, "helpfulness": "0/0", "author": "Ray Ray"}, {"rating": 3.0, "review": "I'm slightly disappointed that the stick has to be plugged in and all the advertisements make it seem wireless. Where my tv is located the outlet is hard to reach, so sometimes it's not easy to reach.", "verified": true, "helpfulness": "0/0", "author": "S.Scott"}, {"rating": 5.0, "review": "I love it! It's so easy to use! I can watch Netflix or listen to pandora!", "verified": true, "helpfulness": "0/0", "author": "Rachel Reagin"}, {"rating": 2.0, "review": "the stick did not work for me. It did not have the power to stay connected with my router that is at the other end of our house.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Got it on sail for prime members.  Works great/as expected.  Compact.  Wish it could be powered by USB- requires higher amperage.  Can't get my prime music to play.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 3.0, "review": "When it works... it works great!  When it has connection problems... it's a nightmare.", "verified": true, "helpfulness": "0/0", "author": "Travis Hesser"}, {"rating": 5.0, "review": "Love it!  Love it! Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Sweetbabs"}, {"rating": 5.0, "review": "My son wanted one of these for Christmas.  I ordered one for myself as well.  I love it.  I was previously using streaming from my laptop displaying on the TV via an HDMI cable.  Although the laptop worked great - it wasn't great when I had to get up and go pause it!I have only used it with netflix so far, but he has used hiw with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "mdw"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Bryan Divis"}]