[{"rating": 5.0, "review": "This amazingly small, easy to install, device has changed the way that we have our entertainment ! Movies, movies and more movies. Music, music and more music. Simply put the best $35 I've spent in a long time.", "verified": true, "helpfulness": "0/0", "author": "John A. Barron"}, {"rating": 5.0, "review": "Fire TV Stick is perfect. As a previous Roku 2 user, Fire TV Stick is the perfect upgrade. Much faster loading time, mush faster response time to the remote, and so easy to set up when you have an Amazon Prime account. I used to use PS4 to watch Hulu and Netflix, after getting Fire TV Stick, I haven't turn on my PS4 in a week! Also, for a limited time(?), you can get Fire TV Stick for FREE if you sign up with Sling TV for 3 months. That is a really great deal. Side note: Sling TV app is not stable yet, they need to debug, but that doesn't effect how great Fire TV Stick is with other apps. Must get!", "verified": true, "helpfulness": "0/0", "author": "Can't Stop Reading"}, {"rating": 5.0, "review": "Love it and very simple to use!!", "verified": true, "helpfulness": "0/0", "author": "Christina Kornmann"}, {"rating": 5.0, "review": "This was super quick and simple to set up.  I now have access to tons of movies and television shows through Amazon Prime.  A great gift from my son!", "verified": true, "helpfulness": "0/0", "author": "SRMay"}, {"rating": 5.0, "review": "Easy set up.. Easy to use! Love it!", "verified": true, "helpfulness": "0/0", "author": "K. A. Weisenreder"}, {"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Trinity Baughn"}, {"rating": 4.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Linda Carlson"}, {"rating": 3.0, "review": "Better than Chromecast.  Not quite as good as Samsung Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Jonathan M Schneider"}, {"rating": 5.0, "review": "Love it! I used to watch everything on my laptop but now I can just plug in the Fire TV Stick on the HDMI port in my TV and I can watch it in all its glory! Very easy to use and if you have little ones around it has parental controls.", "verified": true, "helpfulness": "0/0", "author": "Maria Arenas"}, {"rating": 5.0, "review": "Love it! I would recommend this product to everyone.", "verified": true, "helpfulness": "0/0", "author": "Hammurabi"}]