[{"rating": 1.0, "review": "Piece of s***", "verified": true, "helpfulness": "0/0", "author": "Neil Johnson"}, {"rating": 5.0, "review": "It was really easy to set up. I can use it for Netflix and prime live streaming, and I don't need to go on to the website to add programs.", "verified": true, "helpfulness": "0/0", "author": "jessica schultheis"}, {"rating": 1.0, "review": "It was easy to install and the voice remote works pretty well. I am disappointed that Amazon forces you to buy the non voice remote ( value 14.99 on Amazon's website ).If you really only want to get the voice remote, you must spend an extra $ 29.99. I consider this unethical and unfair on Amazon's part. This issue has been brought to Amazon's attention by other buyers of this product, but Amazon has yet to stop this abusive sales practice. The Fire Stick does work as advertised although sometimes you have to repeat voice commands.", "verified": true, "helpfulness": "0/0", "author": "dennis j hopkins"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Edward Starostiak"}, {"rating": 4.0, "review": "Simple setup, and as expected.", "verified": true, "helpfulness": "0/0", "author": "Bob Mc"}, {"rating": 5.0, "review": "Add me to the list of thousands of people who worship this thing. BEST $40 I'VE EVER SPENT.", "verified": true, "helpfulness": "0/0", "author": "itsmeagainmargaret"}, {"rating": 4.0, "review": "Works great. Got it free with 3 months of sling TV.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "I've only used it for a week but I love it. Makes prime video easy to watch. Only downside is does not have a Google play app.", "verified": true, "helpfulness": "0/0", "author": "lin2261"}, {"rating": 4.0, "review": "Works great. Not at many free movies as I thought", "verified": true, "helpfulness": "0/0", "author": "daniel vogel"}, {"rating": 3.0, "review": "It works perfectly for what it was designed to do. However, I thought it might have more of the features found in Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Tahri Molifua"}]