[{"rating": 4.0, "review": "Very, Very pleased with the Amazon Fire TV Stick. I ordered two and would recommend to anyone wanting an option to cable tv. The only additional app I would like to see for the Fire TV Stick is one to be able to read and browse Blogs and a browser for the internet.", "verified": true, "helpfulness": "0/0", "author": "dcl"}, {"rating": 3.0, "review": "Lacking an Internet Explorer App. Needs improvement.", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 4.0, "review": "I enjoy Fire TV Stick very much but I have a hard time listening due to hearing problems.  I can't seem to operate the remote in order to obtain CC.  I miss a lot of the dialogue so I am missing a lot of the story.", "verified": true, "helpfulness": "0/0", "author": "Angel"}, {"rating": 2.0, "review": "It seems like they have all these movies if your prime but Tootsie came out in the 1980's. So many movies are old and all the new ones cost 4.99 or 5.99.", "verified": true, "helpfulness": "0/0", "author": "David macdonald"}, {"rating": 2.0, "review": "Just got it in the mail today.  Struggling with opening the back of the remote to put the batteries in.  Afraid I am going to break this thing.. Not sure how this got out of the lab for testing.", "verified": true, "helpfulness": "0/1", "author": "Patrick Tuttle"}, {"rating": 5.0, "review": "This is a great product and when used with the Prime Membership even better.", "verified": true, "helpfulness": "0/0", "author": "Patrick JPeduzzi"}, {"rating": 5.0, "review": "Works great!  Much faster than blue ray!", "verified": true, "helpfulness": "0/0", "author": "Susan Hartman"}, {"rating": 5.0, "review": "Just get one, great buy worth every penny. Especially love listening to all my prime music through the TV surround.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 4.0, "review": "Less features than a Roku but much better looking.", "verified": true, "helpfulness": "0/0", "author": "H. Hidy \"Lamb Of God\""}, {"rating": 4.0, "review": "ONLY started using it.  Wish there were more programs on it that I like.", "verified": true, "helpfulness": "0/0", "author": "Rosalie Kimmerly"}]