[{"rating": 4.0, "review": "The entire family loves the Amazon Fire TV Stick. Apps are available at your fingertips. We mostly watch Amazon and Netflix, but there is a wide variety of other apps available to use.The Fire TV Stick lets everyone watch their favorite shows on the TV. Before we had the stick everyone would only be able to use these apps on laptops and cell phones. Now we are getting more value out of our memberships by using the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Amanda Murphy"}, {"rating": 5.0, "review": "Love Love Love. I'm too obsessed with this. And for $40?! Well worth it.", "verified": true, "helpfulness": "0/0", "author": "Paige Paxton"}, {"rating": 5.0, "review": "Easy to install!", "verified": true, "helpfulness": "0/0", "author": "Anna R Johnson"}, {"rating": 4.0, "review": "The first fire tv stick that I received overheated when I used it. However, I contacted customer service and they replaced it within two days. The new unit seems to be working just fine!", "verified": true, "helpfulness": "0/0", "author": "Teresa Millegan"}, {"rating": 5.0, "review": "I am very pleased with the tv fire stick. The installation went smoothly because the instructions were easy to follow.", "verified": true, "helpfulness": "0/0", "author": "Elaine"}, {"rating": 5.0, "review": "The firestick made getting streaming movies super fun and easy! So simple to use, I was enjoying tons of great movies with the comvient stock! Love, love, love it!!", "verified": true, "helpfulness": "0/0", "author": "Linda Finley"}, {"rating": 3.0, "review": "Works good at times, but after about an 1hr or so, it lags and starts to become unresponsive, but other than that, it is great", "verified": true, "helpfulness": "0/0", "author": "Robert Mack"}, {"rating": 4.0, "review": "I love it!  Doesn't freeze, and it's easy to use.", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 1.0, "review": "Had to keep unplugging it to turn it off.  I went to plug it in and the plug-in was broken.  Looked like the pins got bent.  Had to buy another one.", "verified": true, "helpfulness": "0/0", "author": "Gregory Brown"}, {"rating": 4.0, "review": "Good news: the tv stick helps our poor, little, special, not-so-smart tv keep up with the younger prettier ones ;)", "verified": true, "helpfulness": "0/0", "author": "daddy warbucks"}]