[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Cara Averbeck"}, {"rating": 5.0, "review": "Having used gaming consoles for years to stream video and more recently a Google Chromecast, I must say this is the best way to do so for a great price! It is surprisingly quick for the price, often beating my Xbox One and PS4 when loading Netflix, YouTube, and Twitch. The remote is lovely and makes navigation a great experience! If you are considering a Chromecast, spend the extra money for this for sure! The included remote alone blows away the Chromecast, which annoyingly requires you to use your phone/tablet. I can't recommend this enough. Get it now.", "verified": true, "helpfulness": "0/0", "author": "Xzarron"}, {"rating": 5.0, "review": "I still haven't seen or experienced all the Stick has to offer!  Incredible tool for my new Samsung Smart TV.  With the internet access on the TV now, it's incredible to have the ability to find anything and everything that's able to view.  Amazon couldn't have provided a better product than this for TODAY!  I highly recommend this to all!  Especially those with a SmartTV.  ENJOY!!!!", "verified": true, "helpfulness": "0/0", "author": "MmmDawgy \"MmmDawgy\""}, {"rating": 5.0, "review": "The next generation of \"television\" is here.Great product, super-easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel Levin"}, {"rating": 5.0, "review": "Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Jason Makar"}, {"rating": 4.0, "review": "It is a Gadget I like very much, very easy to manage and to install. I found two problems right now. The first, I don't know why  I can't download the remote app and the second is that watching  NETFLIX sometimes I have a delay in the sound.", "verified": true, "helpfulness": "0/0", "author": "Diego Slucki"}, {"rating": 3.0, "review": "Most all of all I like it and how I can leave it plugged into the tv all the time.  One thing that bugs me the most is how it freezes at times when you are watching something.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love this thing, cancelled all my cable and just use this.", "verified": true, "helpfulness": "0/0", "author": "Leilani Cortez"}, {"rating": 5.0, "review": "Love it! Very fast and user friendly! Would definitely recommend this to everyone.", "verified": true, "helpfulness": "0/0", "author": "Daniel R. Osorio"}, {"rating": 5.0, "review": "Have had for about a month, and it's been wonderful. It was incredibly easy to install. Took mere minutes to start enjoying the benefits of streaming. Would recommend to anyone and looking to get one for family members.", "verified": true, "helpfulness": "0/0", "author": "GatorGirl \"Book Lover in Any Form\""}]