[{"rating": 3.0, "review": "Had issues getting this going, kept saying my network was unavailable. I noticed the prompting to point the stick away from the back of the TV and stuck it in the side port. It finally works!I'm still figuring it out. I switched from Apple TV. I miss my AirPlay. I thought I would be able to mirror any mobile device with this, but it's just Amazon devices. Searching apps is hard, finally found Beachbody OnDemand and am so glad I can use that! Wish I could organize my watch list and separate movies from TV and kids from adult selections. Better filters are also needed. Rather than just entering a password to watch anything I'd like to be able to block certain ratings and content or specific shows from even showing up.", "verified": true, "helpfulness": "1/1", "author": "buzyb"}, {"rating": 5.0, "review": "After having to buy a 3way switch every thing is fine!!", "verified": true, "helpfulness": "0/0", "author": "glennadel"}, {"rating": 3.0, "review": "I am not that impressed with it. It wants to stop and the clarity on screen not that great.", "verified": true, "helpfulness": "1/1", "author": "Eds84Vette"}, {"rating": 5.0, "review": "I absolutely love this thing!  It can connect directly to my Wi-Fi in the next room and bam! I'm watching tv with no wires excect electricity.Got lots of things to watch and play too. Well worth the money, needs a small game controller included in the price Amazon.", "verified": true, "helpfulness": "0/0", "author": "Rick Peace"}, {"rating": 5.0, "review": "Love this thing!!!", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 4.0, "review": "Great entertainment", "verified": true, "helpfulness": "0/0", "author": "Ellen P."}, {"rating": 5.0, "review": "Not a \"tech savvy\" person, and even I figured it out.  Voice search app on the phone works great. Hundreds of apps to choose from. With the prime acct you get a LOT of free stuff. Works faster than our blue ray for Netflix, hulu, etc.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "I bought this because my previous box did not have Amazon on it. It sets up in a matter of minutes and is a breeze to use. I do wish the remote was a little bigger.The cord is just long enough as well. Sometimes I have trouble connecting to WiFi, but I believe it's my Internet service provider. Just make sure you have ample speed and you should have no problem.", "verified": true, "helpfulness": "1/1", "author": "Adrena McDuffy"}, {"rating": 3.0, "review": "It sucks that you can't use this while traveling abroad.", "verified": true, "helpfulness": "0/0", "author": "slpepper"}, {"rating": 5.0, "review": "Great way to watch free and other Prime and HD TV and Movies. I love the Mom'sShare part.", "verified": true, "helpfulness": "0/0", "author": "Nana Holland"}]