[{"rating": 5.0, "review": "Greattttt", "verified": true, "helpfulness": "0/0", "author": "dee wright"}, {"rating": 1.0, "review": "I bought this because the description said it could host MLB.TV. However, I have yet to watch a single game, because the processor is so slow, the games pause and buffer for 30 seconds every 15 seconds. This is NOT truth in advertising. Had I known it wouldn't have the bandwidth to process a MLB game (same for the replays), I would have never bought this thing. Total waste.", "verified": true, "helpfulness": "0/0", "author": "MMiller"}, {"rating": 5.0, "review": "It's cool, and definitely more diverse than Apple TV since it allows you to run your amazonprime.", "verified": true, "helpfulness": "0/0", "author": "Booker Edder"}, {"rating": 5.0, "review": "Easy set up.", "verified": true, "helpfulness": "0/0", "author": "Chris Reed"}, {"rating": 5.0, "review": "Tried to set up on day of arrivai, but was not able to connect. Got messge that my account was not recognized. Tried again next day, and setup was smooth and uneventful. Apparently it takes a whole day before your Amazon Prime account gets recognized by Firstick. Streaming was very good, no stop and go's.", "verified": true, "helpfulness": "0/0", "author": "Max S. Teng"}, {"rating": 5.0, "review": "I had purchased the Amazon Fire TV some months ago and was pleased with it. When it came time to get something for another room TV I went with the Fire Stick. I opened the box and had it running in about ten minutes tops. It works great. I do miss the voice control so that may be next.", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "Easy to install and use! Works great", "verified": true, "helpfulness": "0/0", "author": "K. Woxland"}, {"rating": 5.0, "review": "Love it! Very easy install and setup. Works great and remote is easy to use. My apps on Samsung Galaxy Tab A including the Amazon Fire app, YouTube and Netflix immediately recognized the Fire TV Stick after installed and easily integrate with and use it to display on and interact with tv. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Pen"}, {"rating": 5.0, "review": "Great product. Blows Chromecast away", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"cuthbertalain\""}]