[{"rating": 2.0, "review": "I changed my mind about this, as it stops working all the time during movies on Netflix (it's not my wifi or Netflix that's the problem, because when I switch over to the app for Netflix on my smart TV, it doesn't happen). Also, it stops working while playing music using the Amazon Music app installed on it. Very frustrating, because if it actually was reliable, then it would be great, because it is much more intuitive than using the remote for my smart tv and it has many more apps too. But unfortunately I rarely use it anymore because it freezes or stops working all the time, every time I try to use it. I read that you can re-start, etc. but to have to do that every time I use it defeats the purpose of using it. Too bad.", "verified": true, "helpfulness": "0/0", "author": "PoetDiva"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "an"}, {"rating": 5.0, "review": "This thing is fabulous!  It was obviously very well designed and thought out!  The price is REALLY cheap for what it is and does.  RUN, don't walk to buy this product!", "verified": true, "helpfulness": "0/0", "author": "John Robert Mobley"}, {"rating": 5.0, "review": "Amazing!!!! Bought the fire stick about week ago and its awesome, my younger siblings loved the fact of games being on it, especially flappy bird lolGreat buy, no regrets :)", "verified": true, "helpfulness": "0/0", "author": "Dora F."}, {"rating": 5.0, "review": "Easy hook-up and enjoying many selections offered", "verified": true, "helpfulness": "0/0", "author": "Christine Hicks"}, {"rating": 5.0, "review": "This is one of the best purchases I have ever made.  The stick is easy to use and works flawlessly.  Great job Amazon", "verified": true, "helpfulness": "0/0", "author": "Carlos C Gonzales"}, {"rating": 4.0, "review": "Love it so far but interface could use some tweaking. Not as intuitive to find shows as I would like. Got it on sale for prime members and the value is unbeatable.Have had no problem playing Netflix at all and we watch is almost daily.", "verified": true, "helpfulness": "0/0", "author": "lady \"movie viewer\""}, {"rating": 5.0, "review": "Great!! easy to install, simple to navigate. comes with tons of great apps movies shows and games. love that i can use my phone as a remote! got it for free when we bought 3 months of sling tv awsome deal!!", "verified": true, "helpfulness": "0/0", "author": "Toni M."}, {"rating": 3.0, "review": "I got a fire stick along with the fire TV so we could stream on other TV's, now I wonder if that was a good idea? There was very little info regarding how streaming works, especially when it keeps showing a \"buy it\" box for everything I try to watch. I ended up getting a kindle book to help me understand this device and how it works better. If you aren't computer savvy this is not as easy as they claim.", "verified": true, "helpfulness": "0/0", "author": "Andrea Williamson"}, {"rating": 5.0, "review": "I love my Fire Stick. We use it on the bedroom TV. Its great now we don't have to have all the cable channels plus my husband can watch the WWE Network and all ESPN channels.", "verified": true, "helpfulness": "0/0", "author": "Layla"}]