[{"rating": 3.0, "review": "I thought this was something different.  I don't need it because I have a smart TV with Amazon already.  This is in a drawer somewhere.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 2.0, "review": "Most of the good novies and shows cost money. If you have xfinity on demand and HBO you really don't need the fire stick. Personally I do not thibk it's that wonderful.", "verified": true, "helpfulness": "0/0", "author": "ssysyyhsh"}, {"rating": 3.0, "review": "Amazon sent me a Fire TV Stick with default German language.  Took me about an hour to figure out setup and discuss issue with customer service.  The customer service was good.  However, Amazon should know its American consumer base better and not ship German language default products.  It can't be that hard to figure out based on address.", "verified": true, "helpfulness": "0/0", "author": "joshua berger"}, {"rating": 5.0, "review": "Good...", "verified": true, "helpfulness": "0/0", "author": "Kareem D. Hendeson"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "alice turner"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "A.T."}, {"rating": 1.0, "review": "Never been able to get this to work.  Spent a lot of time on the phone with support and still could not get it working.  I finally just gave up.", "verified": true, "helpfulness": "0/0", "author": "jdunaway"}, {"rating": 1.0, "review": "Why don't you have cbs all access on stick", "verified": true, "helpfulness": "0/0", "author": "laurie hunt"}, {"rating": 3.0, "review": "Let me start by saying I had high hopes for this.  I am slightly disappointed in the performance of the Fire TV Stick.  I bought it primarily for streming Sling TV  Initial setup was a breeze, no issues, connected to my Samsung Smart TV, wifi network and Hulu/Netflix/Sling accounts with no issues.  The first week, it was great, a little lag in response times, but I can live with that.  Then the connectivity issues started.  It will work great and then say that it is connected to wifi but not the internet.  I fought with my network, thinking my modem was almost dead.  Reset everything, and nothing changes, can't connect.I went back to the Smart Hub on my TV and tried connecting there, no issues.  Connected on my laptop, no issues.  Connected on my Fire Stick...still won't work.  I gave up on it at this point as it was late and I was tired.  Came back the next day, ready to call Amazon Customer Service...thing works fine, no issues.  At this point, I'm scratching my head, can't figure this thing out.  So now I've just decided to live with it, it drops quality every now and then, and usually just requires a reset, it loses connection every now and then, so we just bounce back to the Smart Hub.  I plan on buying a second for another TV in the house for Sling, but am waiting for a discounted price and hoping that the 2nd will work a little better.Overall, mine is okay, could be much better.  We'll see how this plays out and I'll update if anything changes.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "haven't run into any issues", "verified": true, "helpfulness": "0/0", "author": "haguet1"}]