[{"rating": 1.0, "review": "IT keeps cutting out !", "verified": true, "helpfulness": "3/4", "author": "william"}, {"rating": 5.0, "review": "Easy Setup.  No problems streaming.", "verified": true, "helpfulness": "0/1", "author": "Jim Ehlinger"}, {"rating": 1.0, "review": "total waste of time. It's super buggy. I need to reset it every 5 minutes. And you have to plug the stick in to a power source. Couldn't be more underwhelmed.", "verified": true, "helpfulness": "1/5", "author": "Pat Mitchell"}, {"rating": 5.0, "review": "Easy to use. I bought the voice remote to pair with it.  Was watching Netflix within 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "Bkelly"}, {"rating": 5.0, "review": "Oh man, this thing is sooo nice.  We have two fire TV at home and hubby wanted one for work too.  We were waiting for after Christmas but in fall we got offered the chance to pre order the Stick at a low price and thought what the heck worth a try. We are happy with all our Amazon products so we ordered.This is another HIT for Amazon.  It is perfect to take to the Engine house and hubby can watch his prime on it or mirror his kindle.  He is really thankful for it.  AND it is nice because it is small and compact. He can put in his locker after his shift.  It just plugs in like HDMI and plug into an outlet and all set.  As a prime member it came with all the info so it was truly plug n play.LOVE us some Prime. :)  Highly recommend this to anyone. Works great and comes with a remote or you can use your kindle.", "verified": true, "helpfulness": "0/0", "author": "CraftsnCoffey"}, {"rating": 1.0, "review": "This is the worst product Amazon has come out with, to date. I've been a Prime Member for a few years, so as soon as I saw that I could get the Fire TV Stick, for $19, I ordered it. It worked just fine the first day, but the next day, it kept taking me back to reconnect to my network. It refuses to reconnect no matter how many times I try. I've reset it, unplugged it...etc. There have been no updates and it is still not working. I will not be recommending this product to anyone.", "verified": true, "helpfulness": "6/7", "author": "Jessica"}, {"rating": 5.0, "review": "Probably one of the best new products this year.  Small unobtrusive device is perfect for bringing content to your HDMI capable TV.Works very well.  Easy to use intuitive remote.", "verified": true, "helpfulness": "0/1", "author": "yellowpixels"}, {"rating": 4.0, "review": "Works well ... Has movies out roky doesn't but wish it charged from the tv instead of a cord", "verified": true, "helpfulness": "1/2", "author": "Tanya Maisch"}, {"rating": 5.0, "review": "I got this the day they came out for pre order. I couldn't wait to see how well it worked. I love it! Best choice for me. You easily use it with any tv in your home that is HDMI capable. It was 1/2 price when I got it, a promo sale, and it's the best $20 I spent. Very pleased! I would pay the full price, no problem. Just happy I didn't need to and got a fantastic deal!", "verified": true, "helpfulness": "1/1", "author": "LJ"}, {"rating": 5.0, "review": "The use of the device started out pretty well.  I had Amazon prime during it's trial run when I first received the Fire Stick.  The user interface is pretty intuitive.  The selection process for Amazon Prime is much nicer on the Fire Stick then it is for my PS3; you can transition between the TV/Movie genre's easier.  One thing I would have against it; when the Prime Trial ended and was basically just running Netflix through the device, it started acting up.  There was a delay in the remote to screen response; I would push the button and it wouldn't respond, so I would press it again, and it would jump two or three selections in the direction I was choosing.  I ended up resetting the device and it went back to normal, but that's going to be in the back of my mind; there could be a delay in the remote response in the future.  So far so good.", "verified": true, "helpfulness": "0/0", "author": "Brendan Barrette"}]