[{"rating": 4.0, "review": "Easy to connect and register expanded my digital TV to smart tv standards.", "verified": true, "helpfulness": "0/0", "author": "Lorraine Flateau"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Sofphia Hall"}, {"rating": 2.0, "review": "Expected more news channels", "verified": true, "helpfulness": "0/0", "author": "AY"}, {"rating": 5.0, "review": "Awesome. Perfect for the kids. Like the parental controls. Will buy a second one for us even though we have a PS3 and ps4 hooked up in our room already.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "we use it for netflix and plex and havent had any issues with it.  Its worth the price.", "verified": true, "helpfulness": "0/0", "author": "Ben \"Ben\""}, {"rating": 5.0, "review": "I love my fire tv stick. Easy to work. I get all my amazon instant and prime videos. Plus my amazon music, pandora and Netflix. My child loves it as well and I love the fact that there are parental controls.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The streaming with the Amazon fire stick works fairly well for Amazon Prime, Netflix, and Youtube.  However, Hulu Plus does not work well at all.  The TV screen keeps freezing the frame, while the audio portion of the program continues.  Sometimes it takes 5-6 minutes for the screen to unfreeze and the picture and audio to sink up again.  Also, in Hulu the programs keep freezing altogether and buffering every five minutes or so.  Hulu's performance with the fire stick is SO BAD that it is not worth watching using Amazon Fire Stick.  If you are a Hulu Plus watcher, you might want to try something else.  In addition, I'm not crazy for the Amazon Fire Stick remote provided with the fire stick.  The remote is extremely small and not very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Laura Carr"}, {"rating": 5.0, "review": "Love this product. Will be getting more and giving as Christmas gifts.", "verified": true, "helpfulness": "0/0", "author": "Lori Jackson"}, {"rating": 5.0, "review": "Very happy with the fire stick", "verified": true, "helpfulness": "0/0", "author": "John  Ulasiewicz"}, {"rating": 1.0, "review": "PLEASE DO NOT BUY! I have owned a Fire Stick for 6 months now, and can say without hesitation that it is an absolute rubbish device. The interface is horrible, it is EXTREMELY third-party unfriendly, and constantly freezes or cuts out video/audio from your media while watching. Again, please heed my warning. You will be blowing your money on a headache. It is as cheap as it is for a very good reason. You will be annoyingly redirected towards Amazon-only content, Netflix won't stream properly, nor will YouTube, and the settings are ridiculously limited. You cannot even adjust streaming resolution to play videos on a taxed bandwidth. The device is so annoying and such a waste, that I went out and purchased a Roku to replace it.", "verified": false, "helpfulness": "2/2", "author": "Unsatisfied Customer"}]