[{"rating": 2.0, "review": "It works well for Netflix, but Amazon Prime video rarely works if at all.  Lots of skips, stutters frozen screens and won't-loads anytime we try Amazon Prime video, but we have no problems at all with Netflix and Hulu using the Fire Stick.  This is consistent over time, at various times of the day, and using different high-speed internet networks.  I thought this would be great to take advantage of the Amazon Prime video benefit to stream free movies and TV shows, but just as it is with the very unreliable two-day delivery benefit, Prime doesn't deliver value even though the cost has gone up.  If you already get Netflix and other services don't waste your money on this--you don't need it.  If you are expecting this to work well with Amazon Prime, think again.", "verified": true, "helpfulness": "0/0", "author": "Texas Rebel"}, {"rating": 3.0, "review": "It's okay I guess. You have to plug in a cable from the wall outlet so it's not a cordless plug and play like the advertisements suggest.", "verified": true, "helpfulness": "0/0", "author": "A. C. Drake"}, {"rating": 2.0, "review": "I have a roku and now a fire stick. I like the resolution on the fire stick better, but it keeps freezing on the plex app. The remote is a little jumpy.  The remote app is way better than the roku. There is no clock on the fire stick. All in all, i am glad i have my roku.", "verified": true, "helpfulness": "0/0", "author": "mamamary"}, {"rating": 3.0, "review": "I really like its functionality so far.  waiting for the iOS app though.  I also really wish you could stream media to it from a computer.  I guess I should have looked into that before I ordered it.  Kind of a bummer since I still need to use my chromecast for that.I honestly haven't used it a whole bunch but the interface is great and the quality seems pretty good.", "verified": true, "helpfulness": "0/0", "author": "Travis Gallagher"}, {"rating": 5.0, "review": "This s*** is awesome. The controller is handy and small. It loads quickly. With Amazon Prime you get some badass shows. All around a good deal.", "verified": true, "helpfulness": "0/0", "author": "Luis Soto"}, {"rating": 1.0, "review": "There doesn't seem to be any place to enter a username on the \"Connect to Wi-Fi\" screens, which means you can't log into EAP networks.  The Help page does claim that the stick supports it, though:http://www.amazon.com/gp/help/customer/display.html?nodeId=201636570* Make sure you connect your Fire TV Stick to one of these network or router types:  - Open, WEP, WPA/WPA2 PSK, and WPA/WPA2 EAP encrypted networks", "verified": true, "helpfulness": "1/1", "author": "Dan Nelson"}, {"rating": 2.0, "review": "My Fire Stick was just delivered. After an hour of playing with it, I've all but decided to send it back.First it doesn't use my TV's usb port for power. Had to plug into the old fashion way. Annoying, but not a deal killer.Secondly, and most importantly, the picture and audio quality is substandard. I watched 1 TV show and 2 movies (not all the way through) to test it, and then compared it to blu-ray. The audio is flat and sounds muffled while the picture quality seems to be standard definition even though it shows outputting in high definition. I have solid bandwidth, so I know it's not my connection. I could live with lower picture quality if I'm simply streaming, but the audio killed it for me.Personally, I would not suggest this device. My TV, roku, and PS3 all do a better job. The only reason I picked this up is the roku kills my CEC and the Fire Stick was $20. Not worth it in my opinion", "verified": true, "helpfulness": "1/2", "author": "TheCloudX"}, {"rating": 5.0, "review": "Eight Stars not five, five minutes after receiving we were watching Youtube and Amazon Prime movies....Super Great purchase.", "verified": true, "helpfulness": "0/0", "author": "REDTEMP67"}, {"rating": 5.0, "review": "So far so good great price better than the chrome stick they suck", "verified": true, "helpfulness": "0/0", "author": "heidi"}, {"rating": 1.0, "review": "It has a problem staying connected to my WiFi even though nothing else in my house does.", "verified": true, "helpfulness": "2/3", "author": "Mark the Builder"}]