[{"rating": 5.0, "review": "Easy set up. Love having access to both Netflix and Amazon Prime instant video! I got a bit confused connecting to a home theater system, but once it was set up correctly, it worked great and still does after several weeks. It really needs more documentation especially on the proper set up when using a sound receiver instead of the TV.", "verified": true, "helpfulness": "0/0", "author": "BluiizCA"}, {"rating": 5.0, "review": "Loved it !", "verified": true, "helpfulness": "0/0", "author": "Tani"}, {"rating": 4.0, "review": "works great, easy setup", "verified": true, "helpfulness": "0/0", "author": "bruce hardy"}, {"rating": 5.0, "review": "Love this! I was still kicking it old school and connecting to Netflix and other apps using my Wii. This provided the solution I needed and so far it works like a gem. I was a little bummed because a few days after I purchased mine, Amazon had the sale day for Prime customers and this was $15 off the price I paid. Almost bought another because of the sale, but didn't for now...", "verified": true, "helpfulness": "0/0", "author": "Michele T"}, {"rating": 4.0, "review": "Good Streaming stick. Interface is a little crowded, but overall I am pleased with the performance so far", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "Fire TV Stick is great! The only possible issue is it sometimes will drop the signal. I found that if you change your router channel to a more clear one, the issue is almost nonexistent. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "SR"}, {"rating": 1.0, "review": "bogus. You need WiFi and I was nor told that.", "verified": true, "helpfulness": "0/2", "author": "Kenney Slatten"}, {"rating": 5.0, "review": "Had trouble setting up at first, but I love it.", "verified": true, "helpfulness": "0/0", "author": "Mayra Villalobos"}, {"rating": 5.0, "review": "Good I like it", "verified": true, "helpfulness": "0/0", "author": "fernando"}, {"rating": 5.0, "review": "Love. It. Now I am watching all kinds of movies and caught up on all back issues of Dowton Abbey. Also now listen to my favorite Christian singers on Pandora.", "verified": true, "helpfulness": "0/0", "author": "cleta phillips"}]