[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Jodi C."}, {"rating": 3.0, "review": "Not much on it yet", "verified": true, "helpfulness": "0/0", "author": "Victoria Pease"}, {"rating": 3.0, "review": "Easy to use. Surprised that there is still a rental fee for some movies. Have not tried Netflix or other options__ fearing more fees!", "verified": true, "helpfulness": "0/0", "author": "charlene m. earles"}, {"rating": 4.0, "review": "Seems to have a lot of features and programs that I am not familiar with. A starter manual would be helpful. Easy to install, but confusing to connect. Starter manual will help with that.", "verified": true, "helpfulness": "0/0", "author": "mal buckey"}, {"rating": 5.0, "review": "Love being able to watch all my shows on Netflix, etc. and Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Ro Sandor"}, {"rating": 5.0, "review": "It very wonderful product, but the shipping is very expensive....", "verified": true, "helpfulness": "0/0", "author": "nebiyou"}, {"rating": 5.0, "review": "I originally ordered an amazon fire modem that did not work properly out of the box. Amazon is not set up to call for assistance so I returned the item and ordered a Firestick. The Firestick  hooked up and works perfectly so I am upset that I was not given a full refund for the original modem. I was sent a defective product and was not given a full refund.", "verified": true, "helpfulness": "0/0", "author": "Veronica Amenedo"}, {"rating": 5.0, "review": "Easy to hook up and use.  Outstanding addition to your tv", "verified": true, "helpfulness": "0/0", "author": "tom mcculley"}, {"rating": 5.0, "review": "I absolutley love the Fire TV Stick. it's so simple to install and start using right away that anyone can do it.  I have been using it for a week now and I enjoy the ease of watching my movies on the TV instead of my laptop. I have quite a few on my \"Watch List\" that i'm planning to watch with my granddaughters. The selection on the Amazon library it's great. I have not use the other options on the Fire Stick like streaming my pictures and home videos yet.", "verified": true, "helpfulness": "0/0", "author": "Yhoney"}, {"rating": 5.0, "review": "Much easier to use than Apple TV! A must if you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "K. B. Moynihan"}]