[{"rating": 5.0, "review": "Easy to use, MANY shows to watch for all of the family.", "verified": true, "helpfulness": "0/0", "author": "Kyzcluk06"}, {"rating": 5.0, "review": "Firestick is a great invention! You can bring it anywhere too!", "verified": true, "helpfulness": "0/0", "author": "Papagambit"}, {"rating": 5.0, "review": "Bought this for my son for his 18th birthday. He loves it", "verified": true, "helpfulness": "0/0", "author": "lisa davidson"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Kathryn"}, {"rating": 4.0, "review": "Enjoying the ease of setup and ease of use.", "verified": true, "helpfulness": "0/0", "author": "Searching \"Bookworm\""}, {"rating": 5.0, "review": "A great alternative to re-runs and those lousy TV nights.  I now understand binge watching. Just tell me there will be a season 3 of Alpha House!", "verified": true, "helpfulness": "0/0", "author": "Terry Bryant"}, {"rating": 3.0, "review": "I have one complaint about the Fire Stick. My TV sits on a stand with a wall plug located behind it and closer to the floor. Using the recommended extender plug, I still was losing my WiFi connection intermittently. I finally realized it was a gravity issue. The stick is heavy. Depending how the cord lies, the weight of the Stick causes it to pull away occasionally from the HDMI connection. It's not something you can see. I accidentally discovered it by jiggling the stick around. Now, knowing that, I adjust it accordingly", "verified": true, "helpfulness": "0/0", "author": "Nancy O."}, {"rating": 5.0, "review": "As expected!", "verified": true, "helpfulness": "0/0", "author": "Karen Bolotin"}, {"rating": 5.0, "review": "Easy to use; dependable!", "verified": true, "helpfulness": "0/0", "author": "CT"}, {"rating": 2.0, "review": "Fire stick stutters when watching TV.  Firestick indicates I don't have enough broadband . I followed their instructions and it didn't help the picture slow down.  Given this situation I would buy another. Save your money or buy roku", "verified": true, "helpfulness": "0/0", "author": "Mark Cautin"}]