[{"rating": 1.0, "review": "HAVEN'T FIGURED IT OUT YET!!!  NEED WRITTEN DIRECTIONS!!", "verified": true, "helpfulness": "0/0", "author": "LAWRENCE HAMILTON"}, {"rating": 4.0, "review": "I really like the fire stick, but it's kind of laggy at times", "verified": true, "helpfulness": "1/1", "author": "koon kong"}, {"rating": 5.0, "review": "Love this got it in the room and plan on getting the box to go in the living room saves me $150 on my direct TV bill", "verified": true, "helpfulness": "0/0", "author": "Jerred"}, {"rating": 5.0, "review": "Love the Fire Stick!!! I bought two so I didn't have to move it from t.v to t.v. And then I canceled my Cable!!! Too much to choose from on the Fire Stick to need it. Works awesome!", "verified": true, "helpfulness": "0/0", "author": "Luca D."}, {"rating": 5.0, "review": "It set up easily and works as well as my Roku. I wanted small for travelling.", "verified": true, "helpfulness": "0/0", "author": "WAYNE"}, {"rating": 3.0, "review": "It has continued signal issues but the Roku much further away from the router does not have nearly these issues.", "verified": true, "helpfulness": "0/0", "author": "C. Rob"}, {"rating": 5.0, "review": "It runs fast and no buffering or any problems what so ever! I have Amazon Prime so I enjoy so many things for free! Well worth the price!", "verified": true, "helpfulness": "0/0", "author": "Christopher Dean"}, {"rating": 2.0, "review": "I'm about to return the 2 out of three we bought. Not what we expected.", "verified": true, "helpfulness": "0/0", "author": "blessed"}, {"rating": 5.0, "review": "Excellent device.", "verified": true, "helpfulness": "0/0", "author": "Donna M. Rosinski-kauz"}, {"rating": 5.0, "review": "This little stick packs a lot of punch. It out performs my Sony Blu-ray DVD in all aspects of streaming services like Netflix and Amazon Prime. It also picks up a lot of good free channels. I especially enjoy the Smithsonian channel. If you have cable, it's even better. The price is great too, about half that of the box, and less than a third of a decent Blu-ray player. Do NOT buy a Sony. They run your services through their own servers and if Sony is down, you're down. Have not had that problem with Amazon.", "verified": true, "helpfulness": "0/0", "author": "LaurieG"}]