[{"rating": 5.0, "review": "It's nice to get off my laptop for prime. It's easy to navigate through the menu, but would have been nice to have initial directions for the little remote.Sometimes speaking symbols only can be challenging.", "verified": true, "helpfulness": "0/0", "author": "TwoSisters"}, {"rating": 5.0, "review": "I really do like the option to watch the movies", "verified": true, "helpfulness": "0/0", "author": "egp"}, {"rating": 4.0, "review": "Love it!  Had an issue at first with distance to the router, but moved the router two feet and now it is fine!  Love the simplicity of it, and until I get a smart TV, this does the job!  It is so much easier than moving the laptop from TV to TV to watch shows.", "verified": true, "helpfulness": "0/0", "author": "Beach Girl"}, {"rating": 5.0, "review": "I love the Fire TV Stick. It turned my TV into a smart TV. I can watch Netfix plus so much more. Started Binge watching Breaking Bad.Thank you Krissy for getting this for Dad. I think I am using it more that he is.  Tee hee.", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 5.0, "review": "Purchased this after reading that I can use this while traveling. Simple to use. Glad it came with the usb extender, makes the remote control work well. Definitely recommend, especially if you don't have a smart TV or if you are a traveler!", "verified": true, "helpfulness": "0/0", "author": "April Sanchez"}, {"rating": 5.0, "review": "Easy to install and \"fire up\". Sorry, couldn't resist.  Better than we expected.  Really an awesome way to watch TV.  Highly recommend.  Thank you", "verified": true, "helpfulness": "0/0", "author": "Ted Nuttle"}, {"rating": 5.0, "review": "This is my second Fire Stick. I would buy more if I had more TV's.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I just put the stick into the HDMI receptacle on the back of the TV and I was in.  No problem.  You need to check  behind your TV and make sure you have an HDMI port.  If you don't have an extra port, you can get a \"one in and two out\" cable that will bifurcate the single port for dual purposes. This cable is usually suggested by Amazon when you buy the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Spete"}, {"rating": 5.0, "review": "Like all the free movies with prime.", "verified": true, "helpfulness": "0/0", "author": "D&D Ventures"}, {"rating": 5.0, "review": "Fire stick was easy to set up.  Connection to the wifi was nice and strong despite being in another room across the house.  Love it!!", "verified": true, "helpfulness": "0/0", "author": "K. N."}]