[{"rating": 5.0, "review": "pretty cool :)", "verified": true, "helpfulness": "0/0", "author": "shawn"}, {"rating": 5.0, "review": "I am very impressed with the Fire TV Stick.My internet connection is a little slow, so I didn't know what to expect; I had been using the app built-in to my Panasonic TV to stream Amazon Prime videos and I would get \"buffering\" 5-6 times during most  movies, each time taking 2-3 minutes to re-start. That's not a pleasant way to watch a movie and I had almost given up on video streaming.Since I connected the Fire TV Stick I have watched 3 movies, 2 without ANY need for buffering and 1 with a 5-10 second buffering. I don't know how they did it, but I'm very happy they did. Setup was a breeze, although I had to use the included HDMI extension to avoid the stick loosening up from its own weight when directly plugged into the TV,", "verified": true, "helpfulness": "0/0", "author": "John Huddleson \"camera geek\""}, {"rating": 5.0, "review": "Exactly as promised. It took 2 minutes to set up, and the UI is seamless. This was a steal for $19 (Prime member special), and is worth the normal price as well.", "verified": true, "helpfulness": "0/0", "author": "Red Cross Client"}, {"rating": 4.0, "review": "Good deal!", "verified": true, "helpfulness": "0/0", "author": "john campbell"}, {"rating": 5.0, "review": "Easy install and setup. Performed as advertised.", "verified": true, "helpfulness": "0/0", "author": "Rodger Johnston"}, {"rating": 3.0, "review": "This device operates as I does not fit my TV. It is just a little too long to work with my Samsung Smart TV (UN60F8000BFXZ) without using the HDMI extension cable. The HDMI inputs on this television are set into a depressed well on the back of the TV. The length of the Fire TV Stick is such that it will not fit completely into the well, causing it to be angled upward at the tail, and therefore cannot be slipped into the HDMI port.There is an HDMI extension included in the box, but using it just adds to the clutter behind the TV. The device itself does not fit, completely negating the \"just plug and play\" advertising.", "verified": true, "helpfulness": "1/1", "author": "C. Robert Farrell"}, {"rating": 5.0, "review": "Fantastic Deal. Primary for the ability to sideload  XBMC and other Android applications onto It basically turning it into a $36 XBMC box.", "verified": true, "helpfulness": "0/0", "author": "Warwagon \"warwagon\""}, {"rating": 3.0, "review": "youtube videos some time delay.", "verified": true, "helpfulness": "0/0", "author": "Ge Cheng Zhan"}, {"rating": 5.0, "review": "It truly is much better and much faster than the Chrome device that I returned and so simple to get started.I am enjoying using this device very much.", "verified": true, "helpfulness": "0/0", "author": "adoracion cortes"}, {"rating": 4.0, "review": "I like it and it did arrive early than expected. The only reason I gave it 4 stars instead of 5 is because chromecast (which I have also) have more movie apps than the firetv. Hopefully Amazon add more apps!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]