[{"rating": 5.0, "review": "Love it. No complaints!", "verified": true, "helpfulness": "0/1", "author": "Endya"}, {"rating": 5.0, "review": "Great deal, The instructions could be better on how to install and operate the hand held", "verified": true, "helpfulness": "0/1", "author": "William Lea"}, {"rating": 3.0, "review": "I'm a little old school.  The menus could be easier to navigate with the remote.  A specific search function would be great for titles andante adding the qwerty keyboard to the app remote on my phone.", "verified": true, "helpfulness": "0/1", "author": "Fred White"}, {"rating": 5.0, "review": "I did have to use the extender so it would pick-up the wifi signal better and after that it has been a dream.Hooked it up in my son's room so he can watch what he wants without paying a fortune for an extra cable box.I also use it to catch up on past seasons of some of the shows I watch.Going to check out the games portion sometime soon.", "verified": true, "helpfulness": "0/1", "author": "Lisa M Heckel"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Brittany way"}, {"rating": 4.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/1", "author": "kevin revelette"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Marat Mitelman"}, {"rating": 5.0, "review": "Worked very well for two months, then became erratic. Eventually it was unusable.Update:  Well, I spoke to customer service (Opal) and was told a replacement would be sent.  How can you not be happy with Amazon?Second update. I received a replacement and it works very well. It's my go to for home music since my TV has surround sound. The whole transaction had only a \"speed bump\" and I'm pleased with the product and the purchase.", "verified": true, "helpfulness": "0/1", "author": "michael g."}, {"rating": 4.0, "review": "Some times hard to get it to link with my wireless router.", "verified": true, "helpfulness": "0/1", "author": "Charles J Cacciabeve"}, {"rating": 3.0, "review": "Not my top choice when it comes to streaming devices. It just buffers a lot and loses signal. I am going back to my Ruko", "verified": false, "helpfulness": "0/1", "author": "Edna Porter"}]