[{"rating": 2.0, "review": "it freezes every app other than amazon prime instant video.  This is so frustrating considering it boasts the fastest processor and streaming storage of all the streaming stick devices.  I have a Roku and Love it, but decided to go with Amazon for a second device considering who they are and the clout they will inevitably have in the market.  I would not recommend this product to anyone who wants to watch more than just Amazon Prime Instant Video.", "verified": true, "helpfulness": "0/0", "author": "JNA82"}, {"rating": 5.0, "review": "I am very impressed with the Fire Stick it's easy to set up. Now I can watch endless movies I will recommend any to get it it's a great buy.", "verified": true, "helpfulness": "0/0", "author": "Margaret Jules"}, {"rating": 4.0, "review": "Had problems getting it to work at first. After a little research, disconnected the DVD player and worked like a charm. My only problem now is deciding what to watch!", "verified": true, "helpfulness": "0/0", "author": "Susan Helton"}, {"rating": 5.0, "review": "very pleased connection was easy and fast service excellent only negative is the image on screen its darker than it should be with no adjustment available", "verified": true, "helpfulness": "0/0", "author": "gary hampton"}, {"rating": 4.0, "review": "First off, the FS makes accessing Netflix and Prime much easier on my ' dumb'  TV than hooking up my laptop to the TV and finding somewhere I can sit it without obscuring the TV screen as I watch.  The streaming is almost flawless, unlike my laptop/TV set up.  At $39, it sure beats buying a new TV!The negatives--  with arthritis, it was almost impossible to open the remote.  After a search, I found several YouTube videos that helped, but I still had to wedge a narrow blade in to get the process started.  The other problem was unlocking my wireless.  I do not know about anyone else, but I have a passkey for the router, a password for my account, another password for Internet access on my computer...  It took me time and patiende to find the right one.  If you enter the wrong one, the screen tells you that and tells you to try again, which did not work.  What did work was turning the TV entirely off, then on again to try the next password/passkey.Definiteley worth the effort, as long as you are stubborn, like me.", "verified": true, "helpfulness": "0/0", "author": "Judith Campbell \"Mum-Z\""}, {"rating": 5.0, "review": "Great device works supererb.One con is that it has to be connected to the wall for. Power with a short cable. Issue if ur tv is hanged up.Deffinatly get this device.", "verified": true, "helpfulness": "0/0", "author": "Baseballmachine5"}, {"rating": 5.0, "review": "Well worth the wait! So convenient and easy to use. No slow thinking time either.", "verified": true, "helpfulness": "0/0", "author": "C. Green"}, {"rating": 5.0, "review": "very user friendly.  love all the options and wide variety of applications/shows/movie", "verified": true, "helpfulness": "0/0", "author": "GAYLE M."}, {"rating": 5.0, "review": "So excited to receive our Fire TV stick.  Very simple to setup and start using.  Plesently surprised that our stick was preconfigured since we already had a Prime account so had instant access to our account and content.", "verified": true, "helpfulness": "0/0", "author": "Paul Giles"}, {"rating": 1.0, "review": "Wasn't what I expected. If your a movie buff than this is for you. I also have the ChromeCast and it lets you stream EVERYTHING from your phone, Fire Stick doesn't.", "verified": true, "helpfulness": "2/2", "author": "Jacques D. Lazenby"}]