[{"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Su T. Huang \"su t huang\""}, {"rating": 1.0, "review": "What a disappointment.. it arrived today, after some trouble getting the battery compartment to open, attached the power and attached to TV. Powered up the remote, which was recognized. But then the setup says \"downloading current software\" which runs a few minutes until a screen pops up saying that it was unable to update the device, either try unplugging the power and try again, or try again later (the heck with you?), or go to www.amazon.com/firetvsupport.Tried putting the power off and retrying..same result.Went to the site as listed..Surprise!! no info on Fire TV stick at all.Guess I will wait till tomorrow and try again, and either see if it works or else return the device.", "verified": true, "helpfulness": "6/9", "author": "J. A. McJohn"}, {"rating": 2.0, "review": "Locks up, it can be very slow. It does not like to mirror my kindle fire hdx.Not at all the quality I was hoping for. I own 2 Kindle Fires and they have been great. This product is not of the same quality.", "verified": true, "helpfulness": "1/1", "author": "B. Gunsher"}, {"rating": 5.0, "review": "Rather than being a Chromestick clone, this device takes the best parts of the FireTV functionality and crams that power into quite the tiny package. It's refreshing to have a menu, and be able to store applications on the device, and the FireTV Stick has met or exceeded my expectations in every category. It is even integrated with your Amazon Prime account before it gets to your door. Well done.Only gripe, It needs a clock! Nowhere on the OS is there a time display that is easy to get to, if at all. This is more of a request though, as it hardly detracts from the experience this device has to offer. 10/10 would buy again!", "verified": true, "helpfulness": "0/0", "author": "jetset125"}, {"rating": 5.0, "review": "I have a Vizio tv, that's a little over 2 years old. When this went on sale for $19, I thought, \"What the heck! I have nothing to lose!\"This thing has made my smart tv, smart again! The apps on my Vizio were outdated, and the Amazon and Pandora apps were pretty pathetic. Now my apps work great! And I have a bunch more to chose from, and can even play games! Thank you Amazon!!Love this Fire Stick so much, I bought another two of these for my kids!!", "verified": true, "helpfulness": "0/0", "author": "lOcO \"lOcO\""}, {"rating": 4.0, "review": "Love it. But it seems that I have to unplug it and re plug if it not used for a bit. But love it", "verified": true, "helpfulness": "0/0", "author": "vicky ashbrook"}, {"rating": 3.0, "review": "Meh. I bought this for one of our TVs when it was on sale for $19. I'm glad I didn't pay more. First of all, I was not expecting to have to plug this into a power outlet as well as HDMI. The instructions say that \"for best performance\" you should plug it in. Actually, it should have said \"for performance\", because the Fire TV stick will not even function unless it's plugged into AC power. Then came the network connection ordeal. I have 4 different WiFi access points, and they are all well in range of the Fire TV stick. When it first powered up I connected it to the Guest WiFi, and it happily downloaded a firmware update (which took a fairly long time to install). Once it rebooted after the update, it made me re-enter my WiFi credentials, which I found annoying. But worse, it would no longer connect. I tried 3 different access points and it would sit there for 30 seconds and ask for the password again. Finally my 4th access point (5.0GHz) worked. Just for fun I decided to switch back to another one, and this time it worked. Amazon has some serious work to do with its \"hassle free\" setup procedure. It's horrible.Then there's the parental controls. When setting it up it asks if you want to enable parental controls so you need a PIN to rent or buy movies and apps. I said \"yes\", because I don't want my kids to rent or buy stuff willy-nilly. But then I noticed that anytime I wanted to play something out of my video library - stuff I had already purchased - it asked me for the PIN. This is insanity.The only reason I have this thing 3 stars instead of 2 is because the interface is fairly slick, and the remote app for Android has voice search, which is really nice. I don't regret buying this but I would not buy another one, nor would I recommend it to a friend, not at $19 and certainly not at $39. Pay just a little more and get a Roku.", "verified": true, "helpfulness": "0/0", "author": "Serge van Neck"}, {"rating": 5.0, "review": "Setup was smooth - both wireless and amazon linkage went sell.", "verified": true, "helpfulness": "0/0", "author": "Robert Cormack"}, {"rating": 3.0, "review": "♠ Content - 3/5I have been an Amazon Prime member since 2009 but have very few movies, songs, photos, etc. stored into my Amazon account. The Fire TV Stick centers around that content and the use of Prime's Instant Video content, so it's not tailored to everyone. Of course, if you have other on-demands streaming accounts, such as Netflix and HuluPlus, the Stick covers those as well. In fact, the Stick, Chromecast, and Roku offer about the same services, with the Stick adding HBO GO in the near future.♠ Delivery and Setup - 3/5As did most people, I received the Stick about a week before the estimated delivery date. I like that Amazon has been over-delivering on their shipping. The product was extremely easy to set up, similar to the Chromecast. However, the placement of the cord on the HDMI plug-in is on top of the plug-in, which depending on your TV's HDMI ports, may block you from keeping other HDMI devices plugged in. In my case, I could barely plug in the HDMI and the USB, since the ports are next to each other (see picture). The wiring is definitely not as elegant as Chromecast.♠ Installation - 2/5Next, was the actual installation, which was very wonky. I installed Chromecast months ago, when I had much slower Internet speeds, and that took less than 5 minutes. For the Stick, I entered my Wi-Fi credentials and then waited for the \"Downloading Updates\" to finish. It looked stuck there and eventually said \"Could Not Update\". I unplugged, re-plugged, and restarted everything and then the download screen started. The download was taking so long that I was on edge and was about to call Amazon. I'm on much faster Internet speeds now, around 100mbps from 10mpbs, and it still took 2 hours. I went to take a shower, heated up some food, and watched two episodes of Friends, which streamed absolutely fine from my laptop.♠ Interface - 4/5Finally, it was done updating and installing. While I was heating up food, I didn't even notice that the intro video started so I missed half of that. Fortunately, the interface is very straightforward to use and is mostly reliant on the remote. There is a left sidebar to scroll between Prime, Videos, Music, Photos, etc. and then a hover option for different categories on the right. My only complaint is that the font and size of the hovered option is extremely large.♠ Control Options - 3/5The phone app is very good and there are voice control options on a different remote. However, I was unable to start videos from my laptop and couldn't find any instruction online, so that was a struggle. The remote is somewhat unnecessary and simplistic, and I hate that it uses 2 AAA batteries, as if we all have so many lying around. I recommend the phone app if you also do not like 100 battery-operated remotes.♠ Speed - 3/5The Stick is supposed to be dual-core and twice the memory of Chromecast and Roku, yet I'm having much slower streaming and reaction speeds. I tested a free video, a free game, and a movie downloaded ages ago. Each time, there was some buffering or a delayed reaction. At the same time, I was watching Friends and other videos on my laptop, which streamed fine. I also tried Chromecast again and it continuously streamed. The buffering happens about 5-10 throughout a 30-minute video so it's not too bad but of course, still a nuisance. I'm still not entirely sure why the speed has been so slow.♠ Price - 3/5I took advantage of the Prime member special at $19, so the price was unbeatable. The normal retail price is $39, which I can see some competitive problems when Chromecast is $35 and Roku is $49. In all honestly, I would not have paid more than $19 for the Stick since the product is not new or innovative, and it really provides convenience to a select few who actively use and download Prime content. Also, I was very disappointed with the organization of free content, which is mostly trailers and snippets of movie premieres from 2010 and before.Overall, as someone without a Smart TV and who had good times with Chromecast, I would have not even considered the Stick at its normal price. It would have been a tough sell. Also, since I'm not an active user of Prime content and Amazon constantly emails to check it out, I wanted to use this opportunity to explore what it has to offer. The cost of shows and movies are so expensive that it's just better to get a streaming service for the price of 1 video per month. There are a bunch of bugs that still need to be worked out in order to better compete with Chromecast and Roku.You should consider the Stick if:1) you actively use Prime content,2) you do not currently own an HDMI device, and/or3) you really do not like Chromecast or Roku.Otherwise, the Stick is late to the game and for someone with a functioning HDMI device and rarely uses Prime content, it can be excessive and unnecessary.", "verified": true, "helpfulness": "5/8", "author": "Icy Y."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Heidi FARRELL"}]