[{"rating": 5.0, "review": "While I don't have other streaming sticks, the Fire TV Stick easily wins in my eyes because it supports device mirroring and works as soon as it is plugged in.", "verified": true, "helpfulness": "0/0", "author": "Steven P."}, {"rating": 5.0, "review": "Great reception, good interface, I still basically just use it for Netflix, but the option to bring it with me when I travel to a random hotel so I won't have to buy a movie there... GREAT BUY!", "verified": true, "helpfulness": "0/0", "author": "Ryan Harger"}, {"rating": 5.0, "review": "Love my fire stick; love being able to use this instead of a gaming console. I need another asap~~~~~Update: 4/4/2015After having this baby for a few months my impression is still the same. LOVE IT! I cast from my iPhone or the kid's can cast from the Kindles (which starts a war). The picture quality is phenomenal on my HD and the sound quality is the same as regular TV (I have a sound bar on another TV that I'm going to try out). The only glitch I have had is trying to cast from my phone to the stick with the Youtube App. It can freeze and stop playing, which is a pain but not enough to detract from the overall performance", "verified": true, "helpfulness": "0/0", "author": "Stuffing's Mommy"}, {"rating": 5.0, "review": "This little thing is great.  I use it to watch Netflix and Amazon prime movies instead of my PlayStation now.  I always hated having to wait for my PlayStation to start up.  The Fire TV stick is already on if my TV is on, I just switch HDMI inputs and I'm ready to watch movies.It would be nice if the built in search feature would search the Netflix movies instead of just Amazon and Hulu movies but maybe they'll eventually figure that out.", "verified": true, "helpfulness": "0/0", "author": "Chris Mitchell"}, {"rating": 5.0, "review": "Cooooool!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "hyunmin"}, {"rating": 5.0, "review": "Surprisingly responsive for such a little computer.", "verified": true, "helpfulness": "0/0", "author": "Lutz M."}, {"rating": 1.0, "review": "There is a power cord that attaches to the stick.  It is not shown in the advertisements.", "verified": true, "helpfulness": "1/1", "author": "Gk"}, {"rating": 5.0, "review": "I like it better than my Roku 3.  Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Sterling Holden \"Sterling\""}, {"rating": 4.0, "review": "Makes viewing of Prime movies much easier on TV than connecting my Kindle Fire HD via a HDMI cable. It is easy to set up and use, especially with the remote control.", "verified": true, "helpfulness": "0/0", "author": "Michael Ooi"}, {"rating": 5.0, "review": "best $40 ever spent. This thing streams flawlessly! I was concerned about streaming via wifi over a stock uverse wap but it has no issues. Pictures quality is great!", "verified": true, "helpfulness": "0/0", "author": "Robert Bindel"}]