[{"rating": 5.0, "review": "Very happy with firestick , had a little trouble with volume until we figured it out", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "CarolynW. Middlebrooks"}, {"rating": 3.0, "review": "The unit technically works OK.  We found it difficult to open battery compartment on the remote.  It appears we were not alone, as we found a few pictures on line showing how to open up the case.  The technology is good, and there are a lot of free things to see, but not much that most will want to watch.  Every item we would watch cost a few dollars to perhaps 20 or more for a full season of a popular show from the last few years.  If you dump your cable for this, be careful, OR you may end up spending as much or more.", "verified": true, "helpfulness": "0/0", "author": "Jerry L Carter"}, {"rating": 4.0, "review": "Got it for $20, prime deal. Use it mainly to watch youtube, netflix, and some amazon movies. Works great. Only problem i'm having is that sometimes it'll be a bit slow while loading videos, quality drops, and internet will random won't connect to my router.(might be a problem with my router though). Theres a small nag with the circle part on the remote, used for direction keys, and to skip some scenes on netflix, but sometimes it just doesn't accept the inputs, and then will do all the inputs at once, skipping a lot of the video.", "verified": true, "helpfulness": "0/0", "author": "John Cao"}, {"rating": 3.0, "review": "Picture good, choices of material good----SOUND-  can't figure how to get sound through speakers  Other than just  the TV speakers---No wrap around sound- So movies not nearly as good as they could  be;;;Is there any solution?", "verified": true, "helpfulness": "0/0", "author": "linda wylie"}, {"rating": 5.0, "review": "I have by now about 5 media players: Apple TV, Roku 1,2, 3 and Roku Stick, the Google Chome Cast and have no doubt the Amazon Fire  Stick provides the best media experience for both Amazon and Netflix alike while preserving the full media settings controls for each. As a bonus, the wonderful \"screen saver\" landscapes when pausing longer time increases the viewing experience even more.The powerful and fast electronics and the exquisite workmanship of the hardware is another Amazon accomplishment.", "verified": true, "helpfulness": "0/0", "author": "Henry Sinnreich"}, {"rating": 1.0, "review": "NO NO its a miss", "verified": true, "helpfulness": "0/4", "author": "Jim R. \"ZB\""}, {"rating": 5.0, "review": "Love this little gadget!  It was easy to install after we contacted our internet service provider and Amazon and got input from them on what was needed.  Started streaming immediately after connection and it is super!  Works smoothly with just seconds of download time to get into the connection.", "verified": true, "helpfulness": "0/0", "author": "JZ"}, {"rating": 5.0, "review": "I've enjoyed wathing Prime movies and TV shows, but my teenage boys have had the most fun playing games now available on our TV.  It's been a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Michelle Gemmell"}, {"rating": 5.0, "review": "Great!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Juli Michel"}]