[{"rating": 4.0, "review": "Works well, nice UI....  Fast, smooth playback.  I'm a Roku & Chromecast user too.  So why did I add a Fire Stick?  Primarily to try the Fire 8.9 HDX mirror/Miracast capabilities and compare the Fire TV stick to my Chromecast & Roku 1st hand.  I'm the tech-geek for my extended family and like trying out different tools & toys.I'd net out the Fire TV Stick as an equivalent to Roku, but not really a breakout, better product.  It's nice to be able to mirror my Kindle 8.9 HDX, but the display mirroring connection is no where near a simple and smooth as a Chromecast connection.  I like the Fire stick, but it's just not \"better than Roku\", and it's not at all as simple and smooth as Chromecast.Here's the one use case where I'd recommend the Fire Stick. A Prime Account, Kindle Fire user who has no other media or display mirroring interests.", "verified": true, "helpfulness": "0/0", "author": "Daddio"}, {"rating": 1.0, "review": "I did mot orfwrntjis amd i looked and you charged my credit card twice!", "verified": true, "helpfulness": "0/1", "author": "Lisa A. Fenton"}, {"rating": 4.0, "review": "Received as Sling tv promotional deal for signing up 3 months. It's not bad once it finally works, as I had to deal with 2 defective units, wasting my time and frustration. It is a great gadget to have, however I prefer my HTPC over Fire stick.", "verified": true, "helpfulness": "0/0", "author": "S.H"}, {"rating": 5.0, "review": "Best streaming device.", "verified": true, "helpfulness": "0/0", "author": "soyalozo"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Kim Brown"}, {"rating": 4.0, "review": "Works well, but I prefer my Roku.", "verified": true, "helpfulness": "0/0", "author": "TaiwanJohn"}, {"rating": 5.0, "review": "Love it, now I can look at my movis", "verified": true, "helpfulness": "0/0", "author": "Edna A. Harrell"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "California Shopper"}, {"rating": 1.0, "review": "This device loses it's network connection every day. After sending me to network settings, it either won't rescan for SSIDs or tries to make me retype my security key then won't accept it. Works fine after doing a hard reset.  My original 2008 Roku is more reliable than the Fire stick.", "verified": true, "helpfulness": "0/0", "author": "Loring Hummel"}, {"rating": 5.0, "review": "Super easy to set up and use. The back of the remote was a little tricky to place the batteries in..but a quick utube video fixed that!", "verified": true, "helpfulness": "0/0", "author": "margaux milchen"}]