[{"rating": 3.0, "review": "I enjoy the numerous selections available nut the remote doesn't work like it should. Instead of advancing the movies one at a time to review, it will advance 4-5 at a time.", "verified": true, "helpfulness": "0/0", "author": "bradrn"}, {"rating": 5.0, "review": "I must say, I was very surprised by the Fire TV stick.  Amazon did a good job in it's design.  It has a small footprint and works just as good as my Apple TVs in what I want it to do.Interface is nice and allows access to the various apps such as Hulu, Netflix, etc.  One of the features I like that this has over things like Chromecast is the remote(I didn't want to use my smartphone as the remote)The price point is also nice as it hit's that sweet spot to where you can buy 2 of these instead of 1 Fire TV or Apple TV.If you are in the market for an add-on to your TV, this is definitely a good way to go.", "verified": true, "helpfulness": "0/0", "author": "MSMJ Shaffer \"FMZ\""}, {"rating": 5.0, "review": "\" LOVE IT \"", "verified": true, "helpfulness": "0/0", "author": "michael griffith"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "gene"}, {"rating": 5.0, "review": "Awesome, its a movie saver when there is nothing to watch in cable T.V. Simply \"LOVE\" it, think I'm hooked.", "verified": true, "helpfulness": "0/0", "author": "Amparo Judy Gonzalez"}, {"rating": 5.0, "review": "A great way to stream. I love it, have bought 2 now.", "verified": true, "helpfulness": "0/0", "author": "Julie Griffiths"}, {"rating": 5.0, "review": "Went to work easily no problems!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It has trouble loading...try again later.  It says HD content not available...I have only been able to watch one show, one time.", "verified": true, "helpfulness": "0/0", "author": "J. DEBLAEY \"Army Mom\""}, {"rating": 5.0, "review": "If you like tons of free movies, this is your buy. $150.00", "verified": true, "helpfulness": "0/0", "author": "dale r blankenship"}, {"rating": 3.0, "review": "Fire TV Stick is alright.  I have not tried the Roku, but it is better than the Chrome Stick in my opinion.  However, this product is terrible unless you buy some sort of hdmi extender.  It does not connect to the WiFi very well unless pointed in the direction of the router.  I was very displeased with this product until I purchased (Aurum Ultra Series - High Speed HDMI Extension Cable Male - Female (10 feet) With Ethernet - Supports 3D and Audio Return Channel).", "verified": true, "helpfulness": "0/0", "author": "Samuel Hayes"}]