[{"rating": 3.0, "review": "Disconnects from the Wi-Fi (2.4 and 5 GHz). Barely use because of this.  It's the only device that disconnects.  For the price and size, it's not a bad deal.", "verified": true, "helpfulness": "0/0", "author": "Juan A."}, {"rating": 5.0, "review": "I had been looking for a budget streaming device for the family that they could pass around and share, and one that would have the WWE Network app. It was either between this or the Roku Streaming Stick.I have been using Amazon for a while now, and it was a tough decision because they both had their pros and cons. The Roku was more open and had no loyalty to certain services like the Apple TV, or the Google Nexus Player. I had seen that Roku didn't have the best customer service through reviews and I knew Amazon was always great about customer service. I've never had an issue with them, so I decided to go with them.I do not have Amazon Prime which this is perfect for those customers because it has a lot of features that pertain to it and the device is of course by Amazon.If your on the fence, I honestly recommend going for the Fire TV Stick just off the specs alone. The extra RAM, memory, and the controller.Pros:- Price ($39.99 for NEW? Roku charges that for a refurbished stick)- The remote- The Specs- The User Interface- The applications- Great for Prime members!- ASAP feature- The included HDMI extension cableCons:- No dedicated sleep or Off button.- Gets Hot while streaming (this just worries me for the \"life\" of this product", "verified": true, "helpfulness": "0/0", "author": "Luis"}, {"rating": 3.0, "review": "It was pretty easy to set up, but it seems that movies are interrupted frequently because the streaming isn't complete. I don't know if that will get better but it does make it difficult to watch a movie when it's broken up.", "verified": true, "helpfulness": "0/0", "author": "Linda Brandhagen"}, {"rating": 5.0, "review": "Easy set-up.  Like that it has parental controls.  Works well.", "verified": true, "helpfulness": "0/0", "author": "mom"}, {"rating": 4.0, "review": "Absolutely love it! Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Barbara Greco"}, {"rating": 3.0, "review": "I thought it had hbo go- it doesnt...........and the price that was purchased for was higher than other web sites-", "verified": true, "helpfulness": "0/0", "author": "Pat Callaghan \"pgc\""}, {"rating": 4.0, "review": "It works fine but my remote did the same thing - I think.", "verified": true, "helpfulness": "0/0", "author": "lucyakers \"lucyakers\""}, {"rating": 5.0, "review": "Nice streaming device", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 2.0, "review": "Sorry, It did not meet my expectations.  Range must be very poor.  When I am able to download a movie it only plays about half way through and then cuts out.  Nothing seems to help getting it back.I do give high marks to Amazon.  They have noticed the difficulties and credited my account for the cost of the movies that we didnot get to complete.  Thanks you amazon.  Now is the Fire TV Stick would only work that well.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 4.0, "review": "Yes, its very easy to use. Plug it in and use it. But, what \"they\" really should tell you is that in order to enjoy it, you really must purchase Amazon Prime at $99.00 per year plus all applicable fees. That being said, I still prefer it along with Netfix, to \"cable\"", "verified": true, "helpfulness": "0/0", "author": "minette"}]