[{"rating": 5.0, "review": "Love this product..I have had Roku for past 2 years and I love the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Crystal Hale"}, {"rating": 5.0, "review": "Love it, but now I'm a coach potato:(", "verified": true, "helpfulness": "0/0", "author": "Safferdian"}, {"rating": 4.0, "review": "For the money, I pad $25 on Black Friday, this has been a real treat! I had another device but it didn't support prime videos. I like the small footprint and compatibility with Prime Video and Netflix. The physical remote is welcomed and works as intended. I like the ability to sideload apps as well using ADB over Ethernet. Plex works especially well for my HTPC content. It's pretty speedy and allows me to do what my HTPC did but without the noise of the fans. My only gripe is it doesn't have the Google framework installed so I can't play my Google Music. I tried using All Cast but it's limited in it's capability. Some have been able to get the framework on the full size Fire TV, but it requires a mouse and currently I haven't figured out a way to connect a mouse and have power on the single port stick.", "verified": true, "helpfulness": "0/0", "author": "Giovanni M."}, {"rating": 5.0, "review": "Darned thing works!", "verified": true, "helpfulness": "0/0", "author": "Rick \"Rick Zach\""}, {"rating": 5.0, "review": "Great purchase meets all expectations", "verified": true, "helpfulness": "0/0", "author": "Damieon Love"}, {"rating": 5.0, "review": "Item exactly as described", "verified": true, "helpfulness": "0/0", "author": "J. Ivaska \"Cubfan3\""}, {"rating": 5.0, "review": "So convenient!! A must have if you have a prime membership! take it with you while traveling!Seamlessly watching netflix, hulu and amazon through one interface! AAA", "verified": true, "helpfulness": "0/0", "author": "spitznetwork"}, {"rating": 5.0, "review": "I love the Fire Stick TV! Very easy to use interface, easy to set up and a lot of options for watching shows/movies.. Listening to music and playing games.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "Love it!!", "verified": false, "helpfulness": "0/0", "author": "Living the dream"}, {"rating": 5.0, "review": "Best purchase I've made in a long time.  So much to offer with the Prime membership I already had.", "verified": true, "helpfulness": "0/0", "author": "T. Kelleher"}]