[{"rating": 1.0, "review": "Sorry.... It didn't work for me.  I do have the Amazon Fire Box which works like a charm and streams magnificently.", "verified": true, "helpfulness": "0/0", "author": "R. ANDERSON \"Admiral Rich\""}, {"rating": 5.0, "review": "I have been using Roku (1, 2 & 3) for a couple of years.  I have also tried Chromecast, which I returned within a week.  I have to say Fire TV Stick is my husband and my favorite.  I will continue to use my exisiting Roku's, but for future purchases, we will buy the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "L Winters \"looneywin31\""}, {"rating": 5.0, "review": "Have not had any issues with the stick. It is what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Charles K. Shull, Jr."}, {"rating": 5.0, "review": "Love this. My son has the Apple TV and. says this seems to work the same. Well worth the money", "verified": true, "helpfulness": "0/0", "author": "S. Champion"}, {"rating": 5.0, "review": "Still needs HBO Go, then it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 5.0, "review": "I travel a lot for business and I like to be in control of what content I have available. The Fire Stick makes that super easy and it keeps getting better. Please take a look at the video.I was not asked to make this video.", "verified": true, "helpfulness": "0/0", "author": "Matthew H. Worley \"Film Maker\""}, {"rating": 5.0, "review": "It was very easy to set up and use/", "verified": true, "helpfulness": "0/0", "author": "Tommy Harrell"}, {"rating": 5.0, "review": "Great way to watch your favorite shows and stream Movies.", "verified": true, "helpfulness": "0/0", "author": "Freddie"}, {"rating": 2.0, "review": "After “unplugging” from my cable provider, I did extensive research to decide which streaming device would best meet my needs and decided on the Amazon Fire TV Stick.I wanted something to stream HULU and a few other internet sites to my television without having to hook up my laptop via the HDMI cable.It was very easy to set up and the printed directions were very clear.  The video tutorial you are forced to watch and can’t get rid of is super annoying however; it would be better if it were optional as all it did was waste my time and frustrate me.Despite the fact that my N900 wireless router is a mere 19 feet away from the stick, it receives a very weak signal.  Every other device I own gets a good, much stronger signal from the basement, attic, back yard and the street in front of my house.I updated the android operating system on my Samsung Galaxy phone so that I could mirror to the stick.  The stick and my phone find each other and connect easily.  The problem is, they won’t stay connected, and as soon as I start to watch something, the stick disconnects from my phone. (one star down)I installed Miracast on my laptop, and it won’t connect to the stick.  (another star down)I picked up a Chromecast from a local retailer.  It was easier to set up, has a better connection and casted with no difficulty.You'll need to try again Amazon.", "verified": true, "helpfulness": "0/0", "author": "Wild Celtic Rose"}, {"rating": 5.0, "review": "i love being able to watch my prime movies and such on the regular tv screen.  works great", "verified": true, "helpfulness": "0/0", "author": "cassie"}]