[{"rating": 5.0, "review": "Didn't know how much I would enjoy the selections on the Amazon TV Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Deborah Carroll"}, {"rating": 5.0, "review": "Easy to setup and to use. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "J. Nance"}, {"rating": 1.0, "review": "We had the hardest time getting it to hold a signal. It kept going out in the middle of watching. Would not recommend this product.", "verified": true, "helpfulness": "2/3", "author": "Cara T."}, {"rating": 4.0, "review": "The Fire TV Stick performs exactly as advertised.  Installation was straightforward and took less than 5 minutes.  Streaming video is seamless and the picture quality is excellent.  My only quibble is that many videos I wanted to watch (all of which are routinely available on basic HD cable) are available from Amazon only for a fee.  Disappointing.", "verified": true, "helpfulness": "0/0", "author": "R S Collins"}, {"rating": 5.0, "review": "Awesome - can't believe it does all this for such a low price.", "verified": true, "helpfulness": "0/0", "author": "Maryanne DiPietro"}, {"rating": 4.0, "review": "Love it and have only had it for a week. Netflix and prime videos run smooth, Plays the music in my cloud, can view photos. Played with a few other apps and that works well too. Best part is I can take it with me when I leave NJ for Idaho next week and still enjoy everything. Great product.", "verified": true, "helpfulness": "0/0", "author": "FogofWar"}, {"rating": 5.0, "review": "Works great! Glad I got it. It was a bit hard to install because the USB ports were tricky to reach since its a flat screen mounted on the wall.", "verified": true, "helpfulness": "0/0", "author": "idonotcook"}, {"rating": 4.0, "review": "The FireTV Stick is working great after having to update my Modem.", "verified": true, "helpfulness": "0/0", "author": "Roy"}, {"rating": 5.0, "review": "Great productWay better than chrome cast", "verified": true, "helpfulness": "0/0", "author": "J. Perkins"}, {"rating": 4.0, "review": "Really nice.", "verified": true, "helpfulness": "0/0", "author": "Alec"}]