[{"rating": 5.0, "review": "Works great!!", "verified": true, "helpfulness": "0/0", "author": "Christian Umlauf"}, {"rating": 5.0, "review": "I was just looking for a device to stream Netflix and I got so much more  I love it", "verified": true, "helpfulness": "0/0", "author": "karen mcCollin"}, {"rating": 3.0, "review": "I love the small device and it streams very well most of the time.  However, I have been having issues with streaming my amazon prime??  Lots of stopping & starting ( i know this is not my internet connection, because Netflix etc. stream fine).  It is frustrating!  You would think that an amazon device would stream amazon shows a bit better!  Sometimes it works for 2-3 seconds, then stops and spins for a minute or more, the plays a couple seconds, then stops again!", "verified": true, "helpfulness": "1/1", "author": "Allison"}, {"rating": 5.0, "review": "Did not show video for 1hr. Then started to work. Only had sound at first with some error. Since then it's been great.", "verified": true, "helpfulness": "0/0", "author": "steven johnson"}, {"rating": 5.0, "review": "Works great. Easy to use.  Great companion to Prime.Should be able to use power from TV.  Required power source is a bit cumbersome and limiting.", "verified": true, "helpfulness": "0/0", "author": "Popcorn fanatic"}, {"rating": 5.0, "review": "I was very impressed that such a small device could work so well.  It was very easy to set up and my daughter loves that she can use her phone as a remote.", "verified": true, "helpfulness": "0/0", "author": "Pam Friedman"}, {"rating": 5.0, "review": "I purchased this to see if it would perform better than the Roku 2 XS as it was constantly stopping and reloading. Roku said it was the internet and ATT said it was the Roku. The Fire TV Stick fired right up and has performed perfectly at half the price. It is fast and easy to use. I am planning to buy another one for the spare tv.", "verified": true, "helpfulness": "0/0", "author": "robert holtzclaw"}, {"rating": 3.0, "review": "Works great! The only negative is that it doesn't allow Kids Time on the stick!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "david carreon"}, {"rating": 5.0, "review": "I like it so far", "verified": true, "helpfulness": "0/0", "author": "DENISE COUGHLIN"}]