[{"rating": 4.0, "review": "Works good for prime and netflix", "verified": true, "helpfulness": "0/0", "author": "mlopez"}, {"rating": 1.0, "review": "Not great at all", "verified": true, "helpfulness": "0/2", "author": "kayla gould"}, {"rating": 5.0, "review": "Works great and I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Lainey"}, {"rating": 5.0, "review": "Great product; perfect addition to cable TV.", "verified": true, "helpfulness": "0/0", "author": "H. Prasse"}, {"rating": 5.0, "review": "I have the chromecast also. I like the firestick better and with the prime membership its a must have item", "verified": true, "helpfulness": "0/0", "author": "Iron17"}, {"rating": 5.0, "review": "Love it!  Best device ever", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 5.0, "review": "Very pleased", "verified": true, "helpfulness": "0/0", "author": "John Zimmerman"}, {"rating": 5.0, "review": "This thing blows Roku out of the water.  It's intelligent and even integrates apps.  I love it!  I have a Roku and Apple TV and the Fire Stick is my favorite.", "verified": true, "helpfulness": "0/0", "author": "David G."}, {"rating": 5.0, "review": "I LOVE our Amazon fire Stick!  We mostly use it in our home, but is a must pack item for vacations!  Small, lightweight, fast processing and low price make this a great buy for anyone’s entertainment needs!  We also own a Roku 3, and honestly this little stick can match the mighty Roku quality and a much lower cost.", "verified": true, "helpfulness": "0/0", "author": "KPOB-TV"}, {"rating": 2.0, "review": "I purchased the Fire TV Stick in March 2015 through my Amazon Prime account.  It does not work properly and there is no way to return it for a credit or get any service as far as I can tell. The content does not sync.  I have tried every troubleshooting tip Amazon recommends.  None of them work.  It is very frustrating when the content does not sync.  The Fire Stick is also very temperamental.  The remote does not effectively navigate the screen and in many cases sticks.  When it finally unsticks, the curser races across the screen.  I would not recommend the device.  The ROKU is a much better product.", "verified": true, "helpfulness": "1/1", "author": "Speaker of the House"}]