[{"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Walter E. Stone Jr. \"Butcher\""}, {"rating": 4.0, "review": "Very happy with this purchase. I bought it during the two-day $19 sale for Prime members and it was a great impulse purchase. I purchased this to use in the bedroom where I do not have cable or internet hooked up and a non-Smart TV. It does exactly as it claims by quickly and easily bringing any pay service you have onto your TV. If you already have a Smart TV this product would be useless, but for those of us that don't, this is the perfect, un-intrusive alternative, where you don't have to add (and house) another box to get the same features. Which actually brings me to a question for whoever would like to answer it - what is the difference between this and Fire TV?? As far as I can tell, you get the same features while not having to have another box sitting on a shelf. Anyway...The only \"minus\" I would give this, and why I gave it four stars instead of five, is that regular Hulu isn't included; only Hulu Plus; which means 100% of the visual content you can get on this device is pay-service: Prime, Netflix, etc. I have subscriptions to both of those, I don't want to have to buy yet another one to Hulu when there is free Hulu available to compliment what I'm already paying for elsewhere. Hulu can make money off me via their commercials.", "verified": true, "helpfulness": "0/0", "author": "Chauna Black \"daffy25us\""}, {"rating": 5.0, "review": "Everything is great.", "verified": true, "helpfulness": "0/0", "author": "Kiho Kim"}, {"rating": 5.0, "review": "I have a chromcast stick and Roku and this is much faster in opening, launching and viewing. I am no longer using my Chromecast but do miss not being able to use Google movies. I can still use my YouTube account and can now also use my Prime account as well. I would recomend this over either of the other wifi sticks on the market.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love, love, love the interface!  Much better than the interfaces on my smart televisions. Bought it when it was 19.00. Wish it was again as I would buy another right now.", "verified": true, "helpfulness": "0/0", "author": "Lupo Roma"}, {"rating": 5.0, "review": "It wasn't what I expected, it was MORE!", "verified": true, "helpfulness": "0/0", "author": "Susan J."}, {"rating": 2.0, "review": "How do you open the remote in order to install batteries?  I am about to try a hammer....", "verified": true, "helpfulness": "0/1", "author": "chuck mabry"}, {"rating": 4.0, "review": "I like this product, it uses an hdmi port and comes with a USB, power adapter, and aaa batteries to use. I got 2 and they are awesome. It has so much to offer for such a small price. I used the USB in my tv to power the device instead of taking up an extra plug. I attached a few photos upon receiving the device and some initial set up. I love the screen saver it's a nice touch. I love love the prime music, I wish it were a little easier to work on the fire stick because you can't search music from it (or maybe I havnt found it yet...)  but I can add music on my laptop and sent it to the stick. Also it would be great to search a movie from its title, so i have to do that from my laptop too. Some of the apps cost coins which is understandable but I would like a demo of the game prior to purchase. You would need a controller for some so that is an extra cost but of course cheaper than a xbox or ps system. It's nice to not have to hook up my laptop to the computer to watch a prime movie with the family. A very convenient and fairly easy to use device!", "verified": true, "helpfulness": "3/3", "author": "M. Krisco"}, {"rating": 3.0, "review": "We are newly cable free, and are adjusting to having to find the TV we want to watch.  After a little trouble getting the Fire TV Stick started (just opening the battery case was a challenge requiring a Youtube search), we are mostly happy with it.  During daytime hours, we've picked up all kinds of great shows and movies we never knew existed. Ironically, we're enjoying the tunein radio app to pick up internet radio of favorite far-off stations.However, both weekend evenings (Dec 26 and 27) after receiving the stick, when we wanted to watch movies on the Netflix app, the Fire Stick stopped recognizing our network, and would not load anything.  All other internet devices in the house worked fine.  Multiple online chats with Amazon customer service did not help. They made suggestions from the online Q&A; (reboot, unplug, etc.).  Finally, they told us just to wait awhile, and it would fix itself.  Instead of using the stick, we resorted to hooking up Netflix directly from a PC.  The Fire Stick finally picked up the network when we checked close to midnight.I'm not a techy person, but this might be a bandwidth issue, though Netflix ran fairly well from the PC for a Saturday night. After looking at Fire Stick forums, I see that others are having the same problem.  I gladly will give more stars when we receive uninterrupted service.", "verified": true, "helpfulness": "1/2", "author": "M Dan"}, {"rating": 5.0, "review": "I absolutely love the Fire TV stick. I also have the regular Fire TV which is amazing. We gave the Fire TV to all our family for Christmas.More about the Fire Stick. When I saw this come out we ordered 2. We are currently using one in the playroom for the kids. Since the kids primarily watch Netflix, Disney Junior, & PbS this is perfect for them. It frees us up from paying for a cable box in the playroom and the kids have the ability to watch there favorite shows anytime.While I still thing the regular Fire TV is worth every penny I think there better used in a room where you watch TV all the time. The sticks are perfect for rooms where the TV is used less but you still get the  convenience & benefits that fire offers. Excellent product. A+ Amazon. Another great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]