[{"rating": 4.0, "review": "Was very excited to get the stick. All ads and commercials shows you just plugging it in and it works like a magic bean. Not so fast pilgrim. Make sure power is close by because this wonder-bar does not work without a nice dose of AC connected to it via a USB cable. So if your planning on hooking it up to a wall mounted TV, make sure you have an extension cord to power this baby up.The good - it is fast. I mean, really fast. NetFlix loads quicker then a PS4 or an Apple TV. Amazon Prime videos load super fast.The bad - needs external power. Amazon Prime Music - you have to setup your playlists on your Prime account if you want to use that feature. The only music that shows up is what you have purchased on Amazon, no browsing like Rhapsody or Pandora. Very limited in Apps. You get more from an Apple TV or Roku.I bought this for $19 figuring it will be a throw away device. Most likely, will give it away as a White Elephant gift.", "verified": true, "helpfulness": "1/1", "author": "Z-Dog"}, {"rating": 5.0, "review": "excelente", "verified": true, "helpfulness": "0/0", "author": "Jose Bladimir Martinez Zambrano"}, {"rating": 5.0, "review": "Works great! Easy to install in less than 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "John Markley"}, {"rating": 5.0, "review": "Great product easy to install and set up. I was concerned that our Internet speed would not be enough at 2 mbs, but it seems to work just fine with no buffering.", "verified": true, "helpfulness": "0/0", "author": "Benjamin d"}, {"rating": 3.0, "review": "I bought this for my brother as a Christmas present and when we got it setup I was shocked that Watch ESPN is not a pre-loaded app, you have to download it, and before you can do that you have to register an account at Amazon.  Guess I got snookered on this one.  The device seems to work well enough otherwise and my brother will reluctantly sign up with Amazon, JUST AS THEY DESIGNED IT ALL ALONG!!!Note to Amazon:  Just go ahead and give these things away free, you'll make it up on the required new accounts!", "verified": true, "helpfulness": "0/0", "author": "D. Smith \"Music Lover\""}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "raymond"}, {"rating": 5.0, "review": "A great addition to my TV.", "verified": true, "helpfulness": "0/0", "author": "Pat Jenkins"}, {"rating": 5.0, "review": "Love it!  Perfect for an older tv that we keep in the garage.", "verified": true, "helpfulness": "0/0", "author": "LamFam"}, {"rating": 5.0, "review": "I really love the fire stick!!!! Still learning everything it does. We only have TV threw this . I have never felt the need to pay the high cost for cable. We only had a dvd player until now . Never liked commercials. Still wondering the differences between the fire stick and fire TV? It was very easy to set up. I would recommend this to every one. I also ordered this when it was out-of-stock but amazon still made sure we got for Xmas. It came 12/24. It wasn't suppose to come until Jan. Thank you amazon.", "verified": true, "helpfulness": "0/0", "author": "Carrie Moore"}, {"rating": 5.0, "review": "I ordered the Fire TV stick since I have the Amazon Prime membership.  Thought, what the heck, give it a try.  Just kept putting off installation because I dreaded it so much.  Decided today to give it a shot.  It took me every bit of 3 minutes to get it up and running.  Tutorial was awesome.  I don't have any negatives.  If I can set it up, anyone can.  I have a friend who offered to assist me with set up, but boy was I proud when I called her to tell her I had done it myself.  You have nothing to lose when you deal with Amazon.  Don't like it, send it back, but I promise if you try it, you will like it.", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Ritchie"}]