[{"rating": 5.0, "review": "Side loaded XBMC and good to go.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Teri A Tompkins"}, {"rating": 2.0, "review": "Not nearly as nice as Roku.", "verified": true, "helpfulness": "0/0", "author": "Shootability \"Sol\""}, {"rating": 5.0, "review": "Great little device that is easy to hook up, even for a 70 year old. Just follow the short instructions that come with it. The remote was the clincher for me so that I could select and control on the TV what we streamed from the computer with Wifi, such as Netflix. You may need help opening the remote's battery pocket. It fits so tightly from the manufacturer that it took the fourth person to get it to slide open. It takes a little practice to figure out how the remote works, but then it's easy.", "verified": true, "helpfulness": "0/0", "author": "Nana"}, {"rating": 1.0, "review": "Not simple to set up and not easy to use. It was next to impossible to open the remote to put in batteries. You need a knife and a lot of pressure to open the remote. After plugging the fire stick into the HDMI outlet on my 6 year old Sony TV, I got... nothing. I called for assistance and they were very helpful and will be sending another fire stick, but I don't believe that one will work either since I'm fairly sure at 6 years old my Sony is not compatible with the fire stick. It would be helpful if Amazon could list the TV's the fire stick is compatible with and if yours isn't on the list, you can pass on the fire stick.", "verified": true, "helpfulness": "0/0", "author": "M. T. Wilson"}, {"rating": 4.0, "review": "Easy set-up and easy to maneuver on screen.  Good choice.", "verified": true, "helpfulness": "0/0", "author": "Leonor Ortiz"}, {"rating": 4.0, "review": "The only thing I didn't realize was that it had a cord and plug. I though it would receive it's power through the tv.  I had wanted to be able to use it with more than one device but the cord makes it difficult.  Otherwise great product. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Susanne M. Sharadin"}, {"rating": 5.0, "review": "Awesome deal!easy to use. I love it.", "verified": true, "helpfulness": "0/1", "author": "someguy"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Pete"}, {"rating": 5.0, "review": "My 3 day with it and my family loves the fire tv stick it's very fast and I will buy more in the future", "verified": true, "helpfulness": "0/0", "author": "alma"}]