[{"rating": 5.0, "review": "Cable is almost out of here!", "verified": true, "helpfulness": "0/0", "author": "C. B. Griffin \"CBG\""}, {"rating": 4.0, "review": "Works very good; easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Jake Blythe"}, {"rating": 5.0, "review": "Love this firestick.  I'm technologically impaired and could still figure it out. Would recommend for anyone who wants streaming but doesn't have a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Anitra"}, {"rating": 5.0, "review": "Exactly what I expected, works great", "verified": true, "helpfulness": "0/0", "author": "Denise Zielinski"}, {"rating": 5.0, "review": "Performs exactly as expected. Easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "Kelly Snider"}, {"rating": 1.0, "review": "I am not WELL PLEASED!!! I don't know if it is just my TV or WHAT(or internet connection) But EVERYTIME I TURN IT OFF & THEN GOBACK TO IT I HAVE TO RE-REGISTER OR IT WILL COME UP, CONNECTION LOST(and that's bs) BECAUSE I'LL HAVE 5 BARS ON ALLMY OTHER DEVICES(go figure) BUT THAT'S MY REVIEW AND I'M STICKING TO IT!!!!!!👎👎👎", "verified": false, "helpfulness": "0/0", "author": "Doug Brewton Jr"}, {"rating": 5.0, "review": "So easy to set up. (Note that there is a wall charger and cord which plugs into the stick - recommended for better performance.) Watched a number of HD movies on Prime so far. No problems. A friend recommended the voice remote; something to consider in the future.", "verified": true, "helpfulness": "0/0", "author": "J.R."}, {"rating": 5.0, "review": "This product is awesome!", "verified": true, "helpfulness": "0/0", "author": "beth redmond"}, {"rating": 5.0, "review": "What a great product. So easy to use and convenient to move to different TVs in the house.", "verified": true, "helpfulness": "0/0", "author": "KB \"KB\""}, {"rating": 1.0, "review": "After it took me about 100 tries to get it registered to my account, it won't stay connected to the internet with a full signal.  I've yet to watch a single thing successfully on it.  It's been a pain from the very beginning.  Since it's out of sight behind the TV, I had forgotten about it until I received this email.", "verified": true, "helpfulness": "0/0", "author": "Christopher T. Porter"}]