[{"rating": 3.0, "review": "I've had Fire TV Stick for about 2 months or so. Generally, I'm very pleased with it. I have Prime so there is a good amount of viewing byway of that. The TV used with Fire Stick is in our downstairs basement rec room. Recently, I've been getting a lot messages on Fire Stick saying there is a problem with connection to wi-fi etc. It's rather annoying and have to fiddle with things. Disconnect Fire Stick reconnect or just keep going back to content as I go through process of scanning network etc. Probably, if I was closer to router (is located on main floor of our home) I wouldn't be having problem. As a side note, I have a Kindle Fire tablet that I alway keep in the downstairs rec room to use when I'm on my treadmill etc. I don't really have any problems with wi-fi connection with tablet. So, I'm thinking probably the Fire TV (not the stick) is better able to maintain wi-fi. But for $39 for Stick I'm fairly happy.Adding to this review a month or so later ... this is more about Prime selection and Fire Stick ... when I use my Macbook to view Prime selection of movies and TV shows there are many more selections (44,000 is what I believe is indicated) than shown when I'm looking via Fire Stick for something to watch ... so I guess the deal is I'll use my laptop to add selections to my watch list and see if that works better. But would rather see same amount of selections when I use Fire Stick.  And, I still have connection issues as stated above ... pretty much every time I try to use Fire Stick. For that reason, I'm less likely to use it. Just don't want the hassle of unplugging rebooting etc. Again, I'm only complaining mildly because of the relatively low price.", "verified": true, "helpfulness": "0/0", "author": "mkobrien3"}, {"rating": 5.0, "review": "Works exactly as described.  No problem setting up with wireless router and establishing account.  Streams media well without interruption.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a great item and was easy to install", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it.  Easy connection and setup.", "verified": true, "helpfulness": "0/0", "author": "Susan M."}, {"rating": 5.0, "review": "a very nice, compact and handy item. I got one for my son who travels more, and he has found that he was able to utilize it on his stays away, which has been very helpful.", "verified": true, "helpfulness": "0/0", "author": "Hunter Eubanks"}, {"rating": 5.0, "review": "You cannot beat the price.  My sister bought the Five TV (she loves it, only has one TV), and I wanted something that would be portable to TV to TV or take it anywhere with me, so I decided to purchase the stick.  I must say I am very happy.  It is very portable and has the apps that I want.  Configuration was simple, once you setup and get the stick on your network and once you download the app to your phone, you do not need the controller at all.  The app on your phone is must easier to use and it has a voice control and a keyboard to search for items within every app on the stick for easy setup for each one.  Being a prime member for years I know how it feels to have something to use to communicate with all the services that amazon offers in a small package, now I do not have to bring my tablet always with me to watch something.Do not take it from me, try it yourself.", "verified": true, "helpfulness": "0/0", "author": "Jason \"Jason\""}, {"rating": 5.0, "review": "I love it! So easy to use compared to the chrome stick.", "verified": true, "helpfulness": "0/0", "author": "Erin Ruel"}, {"rating": 5.0, "review": "Works great best thing that happened for TV yet", "verified": true, "helpfulness": "0/0", "author": "gerald"}, {"rating": 5.0, "review": "Fire stick works great, really enjoying it. Must use the extender cable with it to prevent interference from other electronics in the air. It's speed is amazing.", "verified": true, "helpfulness": "0/0", "author": "Constant Reader"}, {"rating": 5.0, "review": "Excellent...well worth the price!!!", "verified": true, "helpfulness": "0/0", "author": "W. A. Losurdo"}]