[{"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Michael Leung"}, {"rating": 1.0, "review": "Bought these as gifts for others.  Gave one to my girlfriend but it quit connecting to wifi a week later.  It worked perfectly fine for the first week! Don't even want to give my mom hers because she won't be able to handle the frustration.", "verified": true, "helpfulness": "1/1", "author": "Andrew Newell"}, {"rating": 5.0, "review": "The fire tv stick is awesome! very easy to set up and use. I love the interface and all the apps. I just wish there was a remote app for the IOS.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 4.0, "review": "It does what I expect. It has a few quirks but what doesn't these days. I would give it 5 stars if it didn't try to steer me towards Amazon Prime. BE AWARE of what you are doing or you will end up buying stuff you can get for free elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Hansmon"}, {"rating": 1.0, "review": "Device is not recognized by TV on any HDMI port so I never even got to the set up screen.  Everything is well connected and plugged in and the ports work with every other device so it's not the TV.  I posted a help request on Amazon's user forum and will update this review if a solution is found.  But so far, this particular FireStick is a POS.", "verified": false, "helpfulness": "2/2", "author": "ArtemisShopper"}, {"rating": 5.0, "review": "Great product that works flawlessly. If you have a USB port in your TV you can attach the usb power cable to it, thereby avoiding the need for a power outlet. Especially usefull if your TV is on the wall and you don't want cables hanging. Wasn't able to start it through my Denon amplifier. Seem to only work directly from TV. But I used optical out audio of my tv to attach it to my receiver/amp and got the sound to my speakers that way.", "verified": true, "helpfulness": "0/0", "author": "A mum"}, {"rating": 5.0, "review": "No lag, no buffering, works great!", "verified": true, "helpfulness": "0/0", "author": "Guy R. Cook \"If it isn't tested, it doesn't work.\""}, {"rating": 3.0, "review": "For $20 it was worth it. Purchased it mainly for the reason that it was advertise that it could be used in hotels and their wifi. Have yet to test it though. Waiting for the HBO GO app and iOS app. The Netflix app is buggy. It freezes up constantly while watching movies. I can watch on my tablet without the hiccups. The Amazon demand works without the hiccups.", "verified": true, "helpfulness": "0/0", "author": "J. Davila"}, {"rating": 1.0, "review": "I really wanted to give this product a good review.  Unfortunately, it doesn't work.  It will not stay connected to my wireless even though several other devices, including apple tv in the same location experiences no loss of signal.  My wireless signal strength shows excellent.  Fire TV stick connects, then drops the signal after only a few seconds.  I had to reboot the device by pressing play + select because it was stuck on a screen & wouldn't respond.  Sadly my experience with Fire TV is a complete failure.It took several attempts, with several people to open the battery compartment. I almost gave up & returned it for this issue alone.After I got the battery in, setup was quick & easy (less than 10 minutes).  I bought this product to replace my apple tv for streaming on Netflix & my prime videos.", "verified": true, "helpfulness": "1/2", "author": "D. bordelon \"DeeKajun\""}, {"rating": 4.0, "review": "I haven't used it all that much but it seems a little faster than my Rokus.", "verified": true, "helpfulness": "0/0", "author": "Don Weiser \"dweiser\""}]