[{"rating": 5.0, "review": "LOVE THIS!  THIS IS THE BEST INVENTION KNOWN TO MAN, LOL!!!  No more lugging the XBOX to the TV we want to watch Netflix on.", "verified": true, "helpfulness": "0/0", "author": "Mary Duffel"}, {"rating": 5.0, "review": "Very easy, user friendly, lots of options. Love it", "verified": true, "helpfulness": "0/0", "author": "Ccole"}, {"rating": 5.0, "review": "Better than Apple TV!!!", "verified": true, "helpfulness": "0/0", "author": "Rick A Warp"}, {"rating": 5.0, "review": "Awesome! So easy to set up and works great", "verified": true, "helpfulness": "0/0", "author": "Dawn Lynn Pratillo \"Motleygirl 71\""}, {"rating": 2.0, "review": "Doesn't work each evening when I go to watch it.  I have to unplug the power and re-plug it back in.  It says my wifi signal is strong and quality is good, but says \"not connected to Internet\" even though I can get on the internet just fine with a computer or any other wifi device.I simply unplug the fire stick power cord and replug it back in and everything works fine.  Not a big deal except that this is something I have to do literally EVERY single evening when we go to watch something on it.  Just annoying.", "verified": true, "helpfulness": "2/2", "author": "Zach or Martha G."}, {"rating": 5.0, "review": "Glad I bought this!! Had chromecast before and this is way better! So much easier to use with so many options!", "verified": true, "helpfulness": "0/0", "author": "adam"}, {"rating": 3.0, "review": "Would be better if it were wireless, charge as needed rather than have to plug into power source", "verified": true, "helpfulness": "0/0", "author": "Cathy Pede"}, {"rating": 2.0, "review": "I love amazon, but I am sitting here watching my Fire Stick tell me I cannot watch in HD because my bandwidth is too low.  Even though I can pull the same video up on my laptop (through Amazon Prime) and run it through an hdmi cable to my tv and it is in perfect hd.  Same story ALL the time.  The stick was suppose to add convenience.  It is  all but useless.  Sad to say. Really wanted it to work.  Admittedly, it's not the first product I've had with inexplicable streaming problems, but I was hoping for more from Amazon. Oh,  and I know about having it extend away from the tv.  I have the extension cable hooked up and the cable as far from the tv as the cable will allow.  If it's not far enough.....well, you gave me the cable.  Bummer.", "verified": true, "helpfulness": "0/1", "author": "Gfbel"}, {"rating": 5.0, "review": "Love it, easy to use love that I could download an app on my phone", "verified": true, "helpfulness": "0/0", "author": "Jcjdtj"}, {"rating": 2.0, "review": "I am a huge amazon fan but am extremely disappointed in the fire TV stick. It heats up and slows down very quickly and will lag constantly through most TV shows. It will tell me that I have slow internet speed, so I go and check the speed with my laptop and get 55+ mb/s Download and 5mb/s Upload speeds which should be plenty to stream. I contacted customer support and was given the poor solution to basically restart the stick, this worked for about an hour and then went to its normal glitchy mode. I requested a replacement and was ignored, I love amazon and am a avid amazon prime user but this thing needs work, it is a piece of junk and am sad I wasted my money on it.-- This HDMI extender that is claimed to \"help connectivity\" was not included with my stick so I am unable to see if this helps keep it from lagging.", "verified": true, "helpfulness": "1/2", "author": "Bill"}]