[{"rating": 1.0, "review": "Cons:Plugged it in, it immediately wanted to update its software. It was unable to update its software. It refused to run until updated, making it effectively a brick.After a number of reboots and a multi-hour-long download, it rebooted and presented me with a loud, obnoxious, and unskippable intro video.  At this point I removed the Fire Stick from my TV, broke it in half, put it back in the box, and burned the entire thing before its virulent disaster of a user interface could spread to nearby devices.Pros:Included batteries for the remote.", "verified": true, "helpfulness": "1/2", "author": "PNW Adventures"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "James Helfrich"}, {"rating": 4.0, "review": "I currently own a Roku stick, but when the Fire Stick showed up for the promotional price of just $19, I couldn't resist giving it a try.The first thing I noticed was how much faster (responsive) the Fire Stick was.  The Roku seems to have to \"think\" before it responds and preview pictures in Netflix take longer to load.  The fact that Fire has a dual-core processor vs Roku's single-core makes a big difference.Voice search also works very well and is quick.  Keep in mind, that although the Fire Stick does not come with a voice remote, you can use the phone app to control the screen with touch and voice.  I do wish that voice also worked for searching Netflix, however it only searches on Amazon (that I can tell).  That's one of the reasons I did not give it 5 stars.  But Roku has no voice option, so something is better than nothing in this regard.For the price, this was a great investment, and even at the full $39 price, it still beats Roku Stick at $49 (and is faster!).  I went ahead and ordered another one so all of our TV's have something to gain access to Netflix, Hulu Plus and Amazon movies.The main reason somebody might not want a \"stick\" is because it really limits your audio options.  There is no output for hooking up to a surround sound system.  This was not an issue for me because my home theater receiver has HDMI inputs for Bluray, DVD, etc, then it goes out to my TV.  So my receiver can decode the audio and I can enjoy movies in surround sound.However, if you are plugging this straight into your TV, you will be limited to your TV speakers, unless your TV has outputs to your home theater receiver.  If not, a \"stick\" may not be the best option and you may want to go with the \"box\" that has audio outputs for your receiver.  Just something to keep in mind ;)", "verified": true, "helpfulness": "1/1", "author": "Chad C."}, {"rating": 2.0, "review": "It keeps buffering and I have to play with it to get it to work. A window pops up and says I need more band width. My Wii never gave me that trouble. In theory it is a good little device.", "verified": true, "helpfulness": "0/1", "author": "Lynn M.Burns"}, {"rating": 5.0, "review": "Surprised at what a deal this streaming stick was compared to the competing streaming sticks. Amazon offered it for 19 dollars but even at 39 it's an amazing deal. It's good right out of the box and registered to your prime account already it just needs an update and you're good to go! Hopefully HBO Go gets patched in later. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 5.0, "review": "These are great. Love them", "verified": true, "helpfulness": "0/0", "author": "A. Shaw \"aggies1rc\""}, {"rating": 1.0, "review": "I wish zero stars was an option. Hugely disappointing. The unit can not sustain a network connection and the video is intermittent. Totally unusable.How ever decided that this product was ready for release to the public should be canned. It's called testing.", "verified": true, "helpfulness": "48/59", "author": "Tim Chapman"}, {"rating": 5.0, "review": "It is amazing and does even more than I thought.  I was able to get in on the 2 day pre-sale offer too!  Wish I could have gotten 2 more.", "verified": true, "helpfulness": "0/0", "author": "Leona Williams"}, {"rating": 4.0, "review": "I like it so far  (only had for 2 days) and  ordering more for Christmas !", "verified": true, "helpfulness": "0/0", "author": "Becky Schook"}, {"rating": 4.0, "review": "I only give it 4 stars because there is no HBO GO. Other than that everything works great.", "verified": true, "helpfulness": "1/1", "author": "patrickquinn"}]