[{"rating": 5.0, "review": "It's way better than what I expected!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I finally ordered a Fire TV Stick and it was so incredibly simple!  Plug and play after to input your WiFi.  It took a few minutes to review the buttons but I've mastered them.  I love watching my Prime membership shows on my big TV.  I no not consider myself technologically inclined -  this was soooooo  simple.  Wish I'd done it sooner.", "verified": true, "helpfulness": "0/0", "author": "Mrs. B \"fitutzed\""}, {"rating": 5.0, "review": "We bought the firestick for Sling TV and it works great. The remote is a little flimsy and gets stuck, but otherwise this stick is saving us $150/month for cable TV.", "verified": true, "helpfulness": "0/0", "author": "llozano1"}, {"rating": 5.0, "review": "Great for our family. We don't have cable, so the shows that we do watch are on our Apple TV and now the fire stick. I wish I would have saved myself some money and just went with the fire stick from the beginning! Great product", "verified": true, "helpfulness": "0/0", "author": "April \"Oswegostategirl\""}, {"rating": 5.0, "review": "We are loving our new fire stick!!! so happy that we finally got one and can get movies and shows anythime that we want to watch. has tons of movies and tv shows for free on it also!!", "verified": true, "helpfulness": "0/0", "author": "Hotmamanascar"}, {"rating": 5.0, "review": "Love it, easy hook up...", "verified": true, "helpfulness": "0/0", "author": "jolynn ebner"}, {"rating": 5.0, "review": "Received this in a timely manner.  Hooked it up with no problems.  Works great.  When look at my Facebook pictures on my TV now.  Would definitely purchase again.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Stivers"}, {"rating": 5.0, "review": "Love it!  Easy to start using and move to any TV I have.", "verified": true, "helpfulness": "0/0", "author": "customer 10"}, {"rating": 3.0, "review": "First let me say I am a prime member and a HUGE Amazon fan but I am disappointed in this product. It freezes frequently (daily lately and  we've owned it for about 6 months). It often needs rebooting which requires me to sign back into HULU Plus and Netflix repeatedly. Originally when we received the product we thought it was Hulu since they are pretty glitchy themselves but we also have a Sony BluRay and a Roku and have not experienced these problems. I think they should have product tested further.PROS: Home Screen configuration/layout, remote, LOVE that I can view my pics and dome videos from my cloud easily, beautiful screen saversCONS: very glitchy", "verified": true, "helpfulness": "0/0", "author": "K. Barbour \"Kelly B.\""}, {"rating": 5.0, "review": "Best nerd toy ever! At first I couldn't imagine how it was going to improve our TV watching & once we had it installed- an all of 30 seconds to install- plus into the ubs port on the side of the TV & an electrical outlet. It works with our Amazon Prime account & we are watching programs & movies we love instead of the junk on regular TV. Being handicapped I love being able to watch decent fun programs during the day. I loved it so much we now had 2 so we can leave them plugged into our TV's & bought one for my daughter too!", "verified": true, "helpfulness": "0/0", "author": "Francine Warren"}]