[{"rating": 4.0, "review": "Enjoying the Fire TV Stick, Works great when connected, but drops connection to Wi-Fi then wont reconnect at times and when scans foravailable networks wont recognize any. Have to completely shut down Fire Stick and reboot to re-establish network connection.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This is the second one. I had to return the first one because it would not play any audio. This one, since I got it a few months ago, has needed to be factory reset several times to get it to work. The technical support people don't know anything. They just read from a list of steps to try and don't listen to the customer. Now any time I try to watch anything on Prime, of which I am a member, I get an \"unauthorized content\" screen, but I can hear the movie or tv show playing in the background. This thing is a joke.", "verified": true, "helpfulness": "0/0", "author": "Jason S. Jameson"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "So easy to install and when I had a question the person I dealt with was wonderful. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "james Carbone"}, {"rating": 5.0, "review": "Love it!!! Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Paula Ramsey"}, {"rating": 5.0, "review": "I read the other reviews and was slow to purchase this device. I wish I had purchased the Fire TV Stick sooner. But, once I got it, I fell in love with it. I was doing my streaming using a blue ray player, but the Fire TV Stick is much faster. I can do much more with this than the other device I was using. I can even use my smart phone as a remote if I need to and it has voice control. I am impressed. There may be better products on the market with more bells and whistles, but I only need so many bells and whistles and this has all I need. I love it!", "verified": true, "helpfulness": "0/0", "author": "CM Fincher"}, {"rating": 3.0, "review": "Want mirroring on Win 8.1", "verified": true, "helpfulness": "0/0", "author": "Thomas M. Lamarche \"Tom\""}, {"rating": 4.0, "review": "I like the Fire TV Stick, but honestly, I haven't used it much. I have my computer hooked up to the same TV on which I am using the Fire Stick. I understand I would have more features available for potential use if I had Prime, as well, but ultimately, it may be one of those wasted purchase types of things for me because of the fact that I don't use it much. (BTW, I actually got mine from Staples, around the time of pre-Black Friday sales for cheaper than Amazon was selling, so if you're considering jumping on the wagon eventually, shop around.)", "verified": true, "helpfulness": "1/1", "author": "Charles Wang"}, {"rating": 4.0, "review": "I enjoy watching on my TV.  However, since it's WiFi, it buffers a lot.  I wind up finishing what I was watching on my desktop because it is hardwired.", "verified": true, "helpfulness": "0/0", "author": "Nancy Mullin \"Poesmom\""}, {"rating": 5.0, "review": "Sooo EASY makes it hard not to fall in love with the Amazon Fire TV Stick, it's really as easy as 1-2-3 :) I'm a Prime Member so the Fire Stick seemed the most logically choice, as I wanted to take full advantage of my Prime account. The product comes nicely packaged with easy to follow instructions. Plug in and you're good to go, being a Prime member my TV stick arrived already registered to me. Soooo excited as I was able to spend the weekend binge watching Broad City and Drunken History all through Amazon Prime YAY!!!! Comedy Central is one of my most watched channels (I like stoopid humor) so for Comedy Central and Amazon to be paired together, it's like match made in heaven for me :) Streaming is Clear, Smooth and Crisp, no choppy viewing which is always good. The Fire TV stick is fast no waiting for uploading and such you turn on and BOOM it's all there waiting for you :)I see they are giving Amazon Prime FREE for a year so if not a Prime member purchasing this stick for Prime FREE for the next year is worth the purchase in itself.", "verified": true, "helpfulness": "0/0", "author": "Colleen"}]