[{"rating": 5.0, "review": "Plugs right into an HDMI port, and is powered by an outlet. Easy to use.I'm happy with the product.Other than I have had a few issues of it freezing up, and not being able to pick up a wireless connection. Which I am sure they will address in a firmware update.The phone app is great, even though the remote does the job.", "verified": true, "helpfulness": "0/0", "author": "Wesley"}, {"rating": 5.0, "review": "I bought this at Best Buy since it's backordered on Amazon to go with a new TV in my bedroom that is not connected to a receiver. The timing was good since I found myself in a cast spending a lot of time in bed watching movies. This is my first app-based TV device so I can't compare it to others. I chose the Fire TV stick over Chromecast as I found out Chromecast doesn't deliver 1080i and Fire TV does.As always, the packaging is simple, elegant and has that cool factor. It comes with both an AC charger and USB extension cable to power with a USB port in your TV. If you use the USB connection the stick powers off when the TV is turned off. With the AC power connection the stick is always on.Setup took about 20 minutes to connect to wifi, activate and download the software update.The interface is easy to navigate to find pre-installed apps, Prime content and search for apps. I prefer browsing for apps online and having them sent to the Fire TV stick rather than searching with the remote. Searching for the apps online before you buy the stick will also give you an idea of what's available. Mainly I use Netflix, Hulu and iHeartRadio so I can listen to a Classical music station at night. There is a sleep function that turns off the display after so long but the station continues to stream.The buffering thing does happen occasionally, which I'm fairly certain is an ISP thing rather than a device flaw.Since this is still a new device I assume there will be software developments and new apps to come that will offer more content and options in the near future. For now, it has everything I need.All in all if you're a big user Amazon products and content, this is a very affordable and friendly device to bring it all together.  Also, if you should find yourself in a cast with only one usable arm like I did - the Fire TV stick is easy to set up with just one hand. It's about the only thing that is easy these days! I've also moved this between TVs in other rooms without any problems.", "verified": true, "helpfulness": "0/0", "author": "L.L."}, {"rating": 5.0, "review": "Working really great", "verified": true, "helpfulness": "0/0", "author": "Sarath"}, {"rating": 1.0, "review": "Glitchy! I thought this was going to be a good alternative to the Chromecast/Roku, but it's terribly annoying when it freezes continually, makes odd noises, and just doesn't cooperate. It may have been that this was just a defect in the specific device that I received. However, I did not order a replacement device to test this theory.", "verified": true, "helpfulness": "0/0", "author": "Bella"}, {"rating": 5.0, "review": "Surprisingly good. I am using this more then my Roku at the moment. There were some issues upgrading the firmware at the beginning but eventually it worked.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"TheMakerGuy\""}, {"rating": 5.0, "review": "If you have Amazon prime, why don't you have this already? Easy to set up and so much to enjoy.", "verified": true, "helpfulness": "0/0", "author": "777ark"}, {"rating": 5.0, "review": "I was deciding between this and the Chromecast. I went with this because of my loyalty (and slight addiction) to Amazon. I absolutely love it! It was easy to hook up and get started. Once I insweted the batteries in the remote, it automatically synced with the stick. It seamlessly integrates with your Amazon account and if you have any games or compatible apps already downloaded, they will be ok the stick! I was able to play the game of Life within 5 minutes. I previously downloaded this app when I had a Fire tablet. This stick is pretty amazing though. Everything is super fast and the apps look great on it. I mainly use it for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Zach Lonsinger"}, {"rating": 3.0, "review": "It's kind of slow. It may be good enough for some people, but not if your kids are going to use it. The lag is enough to drive the kids crazy. You hit the button, no response, you hit it again, and then it goes twice. It's ok for me. I'm patient. The kids get angry, confused, and it's just not worth it. We bought a regular Fire TV for the main tv, and hooked this to the spare. But then the remote on the regular Fire TV kept draining the battery down in 2 days. This was further driving the kids mad. So I paired the Fire Stick remote to the Fire TV. Now I don't have a remote for the Fire Stick until my new remote that I just ordered gets here. First world problems.", "verified": true, "helpfulness": "0/0", "author": "Chi Son"}, {"rating": 5.0, "review": "Love it. I had bought my kids a 40 inch TV. It wasn't a SmartTV so instead of buying q new TV I bought the fireTVstick. It wasn't easy to hook up. Trust me if I can do it everyone can do it. Now they can watch Netflix in their own room.", "verified": true, "helpfulness": "0/0", "author": "ShoniRenee \"I AM God's BELOVED destined for GREATNESS,\nDevoted to the purpose of LOVING GOD and dedicated to give Him my UTMOST.\nI am focused to fulfill my GOD-GIVEN DESTINY and live my life to its MAXIMUM POTENTIAL.\nI am determined to make a dent in this world as a WOMAN OF INFLUENCE leaving a legacy of FAITH and SIGNIFICANCE.\""}, {"rating": 5.0, "review": "Me and my husband loved it so much, we ordered another one for our daughter.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Gartrell"}]