[{"rating": 5.0, "review": "It work great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "k carmino"}, {"rating": 4.0, "review": "Very pleased except that our cable carrier doesn't provide hbo go access through fire stick. I got it pretty much just for that!", "verified": true, "helpfulness": "0/0", "author": "Katrina I."}, {"rating": 5.0, "review": "I LOVE MY FIRESTICK TV now I watch Netflix HULU Plus and others and its GREAT", "verified": true, "helpfulness": "0/0", "author": "The Reader"}, {"rating": 2.0, "review": "Works most of the time, but you also get skipping video that then quickly speeds up to sync with the audio. This happens in Netflix and Hulu. MLB.tv app is totally useless (skips terribly tells me my Internet speed is too slow) which is one of the main reasons I bought it. After seeing these issues, a quick search finds that this is totally common, none of the fixes work for very long. It's just not a good device. Went with this over Chromecast for the remote, but now that i find MLB.tv stinks, I'm regretting my choice and it's too late to return it. Nearly none of the games are playable unless you buy a $40 controller. I like the slideshow screensaver, that's about the best thing I can say for it. The remote works fairly well. Before this I had a Roku that worked great but maxed out at 720p and was starting to get glitchy after a few years. Some of my friends have Chromecast and rave about it, but we wanted a dedicated remote.", "verified": true, "helpfulness": "0/0", "author": "C. Hedstrom"}, {"rating": 5.0, "review": "love it just what I needed", "verified": true, "helpfulness": "0/0", "author": "Mike Johnson"}, {"rating": 5.0, "review": "Works fine pretty smooth set up is easy", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Easy to use, hooked up in 2 minutes ! Great shows available ! I love it", "verified": true, "helpfulness": "0/0", "author": "Aimee R. Sloat \"AimeeKeyWest\""}, {"rating": 1.0, "review": "I am very disappointed in this product. I cannot watch a single thing on the netflix app without it having to buffer at least 5 times throughout an episode or movie. When i check my internet connection it says very strong yet randomly it will say no internet connection. Right now my Fire Stick isnt even working because it says it cannot find the device meanwhile i havent touched any wires for it to have all of a sudden changed. I made sure everything was connected correctly but it still will not work. I say spend the money for the Apple TV. All of my roomates have it and they have not had any problems.", "verified": true, "helpfulness": "0/0", "author": "cpj9191"}, {"rating": 5.0, "review": "Don't know why I wasted so much money on a smart tv. This thing does everything my 1200 dollar smart tv does and is much more reliable with wifi signal. Also once it is up and running you can use your tv remote to control it.", "verified": true, "helpfulness": "1/1", "author": "Robbiez"}]