[{"rating": 4.0, "review": "haven't been able to use it enough to have a fair statement", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "My Fire stick quit after just one day. !! Really annoying !  Has this happened to anyone else and can you get it working again ?", "verified": true, "helpfulness": "0/0", "author": "Helen"}, {"rating": 4.0, "review": "great addition to watching television", "verified": true, "helpfulness": "0/0", "author": "Joseph J. Shafer"}, {"rating": 2.0, "review": "You get what you pay for. Unless you are a few feet away from your wireless connection, this device will do more buffering than playing. When I first purchased the device, I lived in a small one level townhouse where my internet modem was in the next room. I recently moved to a two level townhouse where the device is now on a separate floor from my wireless internet modem. I now can watch only a couple minutes before the device buffers. I can't even stay connected to some applications.", "verified": true, "helpfulness": "0/0", "author": "123062"}, {"rating": 5.0, "review": "LOVE THIS.Disappointed that I have to buy one for each TV. (unless I'm just an idiot and haven't figured out to make one workfor everything).But love Amazon Prime TV. Finally got through the Downton Abby that I had been wanting to see for all these years.Love that you can do Netflix through it as well. At first had trouble with the internet connection from one room to the other.Fixed and happy.", "verified": true, "helpfulness": "0/0", "author": "KM \"K.Merrill\""}, {"rating": 5.0, "review": "So far .the system is working. But is a little bit slow whenever search or loading. Movies", "verified": true, "helpfulness": "0/0", "author": "Roberto A Contreras"}, {"rating": 2.0, "review": "Directions not clear on how to use Netflix, Hulu, and the other means of watching movies, etc.  No directions on the coins.", "verified": true, "helpfulness": "0/0", "author": "Peggy"}, {"rating": 5.0, "review": "The product arrived promptly and in great shape.It works as expected. Thank you!", "verified": true, "helpfulness": "0/0", "author": "FERNANDO P SPITALIERE"}, {"rating": 5.0, "review": "Love it...my new go to for Netflix, Hulu, and YouTube...threw my chromecast away...plus prime movies which is why I bought it...and the remote is my favorite in the house.  No extra buttons only what you need!  Well played Amazon", "verified": true, "helpfulness": "0/0", "author": "A. Barcia \"Alex\""}, {"rating": 5.0, "review": "Excellent product.  Worked better than expected.", "verified": true, "helpfulness": "0/0", "author": "Jake E. Parker \"Jake\""}]