[{"rating": 5.0, "review": "Works as advertise. Fairly snappy interface and I am appreciating having a remote. In comparison to the chromecast it seems a tad more reliable.", "verified": true, "helpfulness": "0/0", "author": "Lawrence A. Smith III"}, {"rating": 5.0, "review": "Just amazing!", "verified": true, "helpfulness": "0/0", "author": "Emil borje"}, {"rating": 5.0, "review": "If you know what you have. This thing is powerful", "verified": true, "helpfulness": "0/0", "author": "Kenneth Harris"}, {"rating": 5.0, "review": "Works as advertised, which is not at all surprising. As a Prime member, I get free movies and TV shows. From the time I opened the box, I was watching a movie within 5 minutes. Highly, highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Dennis Quinn"}, {"rating": 3.0, "review": "Wonderful device full of potential but limited by allowed ability. Should be able to shortcut any app (xbmc, Kodi, etc..) to the home screen. Plus the remote can be super glitchy!", "verified": true, "helpfulness": "0/0", "author": "Chunk"}, {"rating": 3.0, "review": "I like this device.  Compared to the Chromecast it is superior with a more varied array of options.  My biggest gripe so far is the ability to cast from Windows 8.1.  Although Windows finds the device and FireTV stick recognizes the computer the screen sharing never commences.  This is disappointing.  I need to work on it more.  Perhaps Window 10 will help to solve the problem.  I am comparing the device with Apple TV which works well in an apple environment.  The fact that the FireTVStick allows the download of apps provides great flexibility.  Others need to enable the same.", "verified": true, "helpfulness": "0/0", "author": "gingerbreadman"}, {"rating": 5.0, "review": "My grandchildren love it", "verified": true, "helpfulness": "0/0", "author": "Brenda Greer"}, {"rating": 5.0, "review": "Haven't used it much yet, but so far I am very pleased.", "verified": true, "helpfulness": "0/0", "author": "P. Cozby"}, {"rating": 4.0, "review": "It works fine.", "verified": true, "helpfulness": "0/0", "author": "Gerardo A. Alfaro"}, {"rating": 4.0, "review": "I would enjoy this more if it didn't constantly disconnect from the wireless network. With Chromecast in our living room, we rarely run into a connection problem these days, but this Fire Stick disconnects about every two minutes without reason. It's properly hooked up, powered up, and using the extender, but nothing seems to help it keep the signal. I'm hoping that it just needs a software update, because I absolutely hate shipping things back. Other than that little annoyance, it's great with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Gwynevere"}]