[{"rating": 2.0, "review": "Fails the hype and promise. I am unable to stream from my windows  laptop or iphone, primary reason why I purchased it.Only nice thing is it comes with a remote. I have chromecast and roku and had expected fire TV stick to beat its competitionsince it is the newest one on the market and am utterly disappointed.", "verified": true, "helpfulness": "0/0", "author": "menodude"}, {"rating": 3.0, "review": "It's okay, but the Roku Stick is better based on the total number of channels.", "verified": true, "helpfulness": "0/0", "author": "K. Meyers \"KENKOBRA\""}, {"rating": 4.0, "review": "I'm really enjoying it but I was a little disappointed in that it does not mirror my Apple iPad. Are you planning to make an app for that to happen? I would think you would considering for $35 the Google Chromecast does.", "verified": true, "helpfulness": "0/0", "author": "Ron Regan"}, {"rating": 1.0, "review": "Im very disappointed in this unit it started loosing the connection of my wifi router on the second day after installing and the Network Setting page it show I had a strong signal . My Router was more more than 13' way in the adjacent room. i would have to unplug it to reset it then it would connect but then the 4th day it started to distort the picture with green blur .... Im sending it back for a replacement....", "verified": true, "helpfulness": "6/7", "author": "Richard Koeder"}, {"rating": 5.0, "review": "Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Diane A Cooley"}, {"rating": 5.0, "review": "love it! easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "I love this!", "verified": true, "helpfulness": "0/0", "author": "Deidre Burke"}, {"rating": 5.0, "review": "Love it.I wish it worked with Plex!", "verified": true, "helpfulness": "0/0", "author": "Brian Dunlap \"Bravo Romeo\""}, {"rating": 1.0, "review": "I will add to the folks that had a terrible out of box experience.  After setup and updates it gives the \"We Are Unable to Contact Our Servers\" message, despite strong wifi signals AND the device is able to send me email (photo links)  It is NOT a network problem and all my account features work from a browser.  There are posts online about this issue but no resolution or response from Amazon.Also it wants to bill me in UK currency?!?!  2 hours of my Sunday morning wasted.", "verified": true, "helpfulness": "1/1", "author": "Squeaky"}, {"rating": 3.0, "review": "To be able to watch anything recent or worthwhile one has to be a member of Amazon Prime which is a $100 committment. If the tech geek had explained that to me I probably would not have bought the device. I bought a couple as presents but will definitely explain to the recipients of this device the complete deal before they begin to try to use it. On a good note it was easy to install and start using.", "verified": false, "helpfulness": "0/0", "author": "Anne"}]