[{"rating": 5.0, "review": "Awe some", "verified": true, "helpfulness": "0/0", "author": "Marilyn Beaucher"}, {"rating": 5.0, "review": "Love my fire stick. Need my HBO-Go still. But the website for the Fire stick says \"coming spring 2015\"! :)", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 5.0, "review": "Very cool device.  Easy to set up.  Picture and audio is pure HD.  Perfect if you have Amazon Prime, Netflex, etc.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "Love the fire stick just wish it had the voice like the obox does", "verified": true, "helpfulness": "0/0", "author": "jamie moore"}, {"rating": 3.0, "review": "I'm happy that they made the fire stick. I was tired of watching Netflix on my 22\" monitor or my Iphone.Now I can see all the movies/sitcoms/documentaries etc for less than 5% of what cable companiescharge consumers monthly.  The reason It did not receive 5 stars was the fact that just about everyother day it has to be rebooted because it loses internet connect. It is only 4 feet from my high speedwireless modem. Then you have to disconnect the cable from the Fire stick for 3 seconds to reboot it.Other than that it is worth the $39.99", "verified": true, "helpfulness": "0/0", "author": "gmanbody"}, {"rating": 5.0, "review": "amazing! worth every penny! now I can watch netflix on my tv :)", "verified": true, "helpfulness": "0/0", "author": "Bianca"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Mark W. Baker"}, {"rating": 5.0, "review": "User friendly and easy to install. I purchased another one and plan to do all the TVs in the house.", "verified": true, "helpfulness": "0/0", "author": "Wanda W"}, {"rating": 5.0, "review": "Love it! Easy to set up and use! I love that I can stream the shows I want from different companies all under one device!", "verified": true, "helpfulness": "0/0", "author": "Jessica Lutfi"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "V. Petrova"}]