[{"rating": 4.0, "review": "I was watching my prime video on the Kindle before. Now I can watch it on big screen. And the picture quality is very good. Like it very much. Two small things I don't like. First my kid can see my PIN on the screen (it asks me to select the number on the screen). Second it is easier to browse while it is difficult to search using the remote it provides.", "verified": true, "helpfulness": "0/0", "author": "Yumen Li"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/1", "author": "Kazuya Mori"}, {"rating": 4.0, "review": "The Fire TV Stick installed as per the instructions.  My biggest disappointment was the number of TV shows and movies listed that were not free with Amazon Prime as suggested in the sales material.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super deal! Worksgreat!", "verified": true, "helpfulness": "0/1", "author": "Dave McConnell"}, {"rating": 5.0, "review": "Better than many other streaming boxes.", "verified": true, "helpfulness": "0/1", "author": "G. Cooper \"cooptoons\""}, {"rating": 4.0, "review": "Great purchase that has allowed us to offer programming options in two bedrooms that do not currently have cable boxes nor streaming devices. Great alternative for children that can navigate electronics but may not be responsible with DVDs.", "verified": true, "helpfulness": "0/0", "author": "Holly H."}, {"rating": 1.0, "review": "there is absolutely no user options for organizing your content on the Amazon cloud Drive. All of the movies I uploaded are sorted by date created.Old movies that I had transferred from film to an electronic media show up in my library on the date I transfered them, and I can't sort it any other way. The names of my movies that I uploaded to the Amazon cloud Drive do not appear when viewing them using my fire TV stick. There is no way to make the fire stick display the movie title.pictures I loaded to my cloud Drive appear as one jumbled mess by date on the Amazon fire TV stick.  I spent time with customer service to figure out how to improve the organization of the fire TV stick. They have said that this is not possible right now.  Amazon will never compete with the AppleTV unless they update user interface. Amazon should allow a rating of zero stars for this product.", "verified": true, "helpfulness": "3/4", "author": "eric devine"}, {"rating": 4.0, "review": "works really well on accessing my Prime stuff...navigation a little clunky but eventually I figured it out...instructions could be clearer...I'm quite pleased that I can watch Dr Who on the big screen and since I don't have TV up here (Alaska) just internet it's a big help and the YouTube app works well too.", "verified": true, "helpfulness": "0/0", "author": "Michael Baish"}, {"rating": 3.0, "review": "I'm disappointed that the Fire Stick doesn't have as many apps available like Roku does.", "verified": true, "helpfulness": "1/1", "author": "Barbara Henderson"}, {"rating": 4.0, "review": "Wish there was a shut off button. I keep it plugged to my TV...", "verified": true, "helpfulness": "0/0", "author": "Phillip Lai"}]