[{"rating": 5.0, "review": "I love my fire stick. the apps are easy to navigate and the installation, if you really want to call it that, was super easy. Would definitely recommend this.", "verified": true, "helpfulness": "0/0", "author": "Kim Alaniz"}, {"rating": 2.0, "review": "Bought this so we could watch prime and netflix however it kinda blows. It constantly buffers and yes we have an awesome internet connection, secured network and great wifi. My roommate is a computer wiz so it gas nothing to do with our end. The stick nust cant keep up with the frame speeds, etc... it's pointless to even use it at this point. Worked well for a few months and i even recommended it to all my friends. Guess will either buy the roku or the bigger box fire tv. It's a shame it was such a nice idea.", "verified": false, "helpfulness": "0/0", "author": "Aurora Nebula"}, {"rating": 5.0, "review": "Enjoying this product!", "verified": true, "helpfulness": "0/0", "author": "Kimberly"}, {"rating": 1.0, "review": "Too many connection issues. My five year old blu ray player connects to apps just fine. Waste of money and upsetting", "verified": true, "helpfulness": "0/0", "author": "Oliver Reynolds"}, {"rating": 5.0, "review": "Great deal fast service will tell my friends about product very pleased with it", "verified": true, "helpfulness": "1/2", "author": "Manny Mejia"}, {"rating": 2.0, "review": "I have this and fire tv, it seems like this doesn't work when using the fire tv. It continuously is stalling, like it is buffering. The whole point of buying this was to be able to stream to two televisions at once. I'm not a fan. But I love the Fire tv.", "verified": true, "helpfulness": "0/0", "author": "Chris S."}, {"rating": 1.0, "review": "The features of the Fire TV Stick are great. However, the font size of menu items and descriptions of shows and movies are VERY small. If you have difficulty reading VERY small print from a distance, I would not recommend this product. If there were accessibility options that allow users to increase the fonts of menu items and descriptions of shows, this would be an excellent product. I'm disappointed that Amazon has ignored this drawback that has been mentioned in forums.", "verified": true, "helpfulness": "0/0", "author": "Scott E Whatley"}, {"rating": 5.0, "review": "Best little device for internet access. Super simple to use with no dropped WiFi which requires relogging in.", "verified": true, "helpfulness": "1/1", "author": "Paul J."}, {"rating": 1.0, "review": "We were excited when we received this device and I installed in my living room TV. The first couple of days it work beautifully but them when ever I tried playing any movie either from Netflix or Prime list I am getting an error i think is HDVC error pertaining to content. I have searched and searched for a solution and can not figure it out. Some said to shut off TV and reboot. Others have said to reboot the stick which I have done this thousands of times but to no avail. I now have the Chromecast and it has been working fine. Amazon needs to fix this before offering this stick for $38.", "verified": false, "helpfulness": "1/1", "author": "Jose Laguardia"}, {"rating": 5.0, "review": "I rarely do reviews but I have to say I love this device. It is portable, it is small, it is intuitive, just great. I actually use it on a very old Hitachi Ultravision, circa 2005, through a HDMI-DVI converter (about 35$). I intend to travel with it and believe it will work on most hotel TV's. Still yet to try.", "verified": false, "helpfulness": "1/1", "author": "Will P"}]