[{"rating": 5.0, "review": "Fantastic device, met every expectation!", "verified": true, "helpfulness": "0/0", "author": "Kraig Shelby"}, {"rating": 5.0, "review": "Easy to you for a non-technical person.  Thanks", "verified": true, "helpfulness": "0/0", "author": "Donald Gilberti"}, {"rating": 5.0, "review": "I works as advertised on the Amazon website.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I wish that more shows were free with amazon prime. It feels like as an amazon prime member you should get WAY more for the money than what we get. But the fire stick is super cool. But just as an add on. I wouldn't count on it as your only TV viewing. I do like that you can use other apps on it and connect it to netflix and play games. Overall we have really enjoyed it.", "verified": true, "helpfulness": "0/0", "author": "mama ness"}, {"rating": 3.0, "review": "very user unfriendly and hard to navigate between channels or select menu options. slow response time doesn't help either", "verified": true, "helpfulness": "0/0", "author": "S A"}, {"rating": 3.0, "review": "I was excited about getting this, and using it. However it is stubborn sometimes and doesn't work. I have to turn the TV on and off and take the stick out and put it back in about 3 times each time I want to watch something.I also haven't figured out how to scroll quickly through genres and such... and a lot of the things they offer are not things I would normally watch. However, that part is user error and lack of knowledge on my part.The three stars is because of the issues with getting it to work and it not working all the time.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Hauptman \"rhauptman\""}, {"rating": 5.0, "review": "LOVE THE FIRE STICK AND AMAZON PRIME! FAST AND RESPONSIVE, EVERYONE SHOULD BUY ONE!", "verified": true, "helpfulness": "0/0", "author": "KRISTI"}, {"rating": 5.0, "review": "I love this thing!!  Amazon Prime is already the best thing going, but being able to take ALL my movies anywhere there is WIFI (Which is virtually everywhere now) is simply fantastic.Its a breeze to set up anywhere. The interface is simple and intuitive to use.  And I LOVE that you can buy or rent a movie instantly.  So great for kids.I can put a Disney movie on for my daughter and her friends then switch to more adult fun when they crash.The Fire TV Stick is exactly the way I want to watch my entertainment.  I would highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Scotty B"}, {"rating": 5.0, "review": "Love love love this.. turns any tv into a smart tv! no computer needed!!", "verified": true, "helpfulness": "0/0", "author": "Caleb & Aubrey's mommy \"Michele B\""}, {"rating": 4.0, "review": "Super cool device with a poor selection of apps.", "verified": true, "helpfulness": "0/0", "author": "Simbiosisgroup"}]