[{"rating": 5.0, "review": "I LOVE the FireStick. I does exactly what I need.. and I can watch Amazon Prime Videos, and my HuluPlus account .. thank you Amazon for a GREAT product!", "verified": true, "helpfulness": "0/0", "author": "Joanne LeBlanc"}, {"rating": 5.0, "review": "Very happy with this purchase. Figured I would try Prime for a year and see how we like it. So far we are loving it! While there is not quite as much content offered as Netflix, there is an excellent selection. I enjoy doing business with Amazon, and dislike Netflix after their company and services restructure.  The on-screen interface is much easier to navigate than Netflix as well.", "verified": true, "helpfulness": "0/0", "author": "Bon"}, {"rating": 5.0, "review": "Worked as expected.  The remote is handy, much better than using a cell phone.", "verified": true, "helpfulness": "0/0", "author": "Reviewer"}, {"rating": 4.0, "review": "Good product, much better then the Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Charles Spiteri"}, {"rating": 5.0, "review": "Love love love this stick !  Great picture quality, vast array of things to watch and what a bargain!", "verified": true, "helpfulness": "0/0", "author": "Ravyn"}, {"rating": 5.0, "review": "Works great!!!!  Super easy to set up too!", "verified": true, "helpfulness": "0/0", "author": "C. Hilliard"}, {"rating": 5.0, "review": "Enjoying a lot  of free movies so far, and the ability to access other pay per view features is another good option.", "verified": true, "helpfulness": "0/0", "author": "Kristi R."}, {"rating": 5.0, "review": "Great. Easy to set  up and use", "verified": true, "helpfulness": "0/0", "author": "Tammy Van Kuren"}, {"rating": 4.0, "review": "it's cool!", "verified": true, "helpfulness": "0/0", "author": "Leo"}, {"rating": 1.0, "review": "The control on this device is horrible. It gets stuck in an auto repeat mode. Press any direction arrow and it goes all the way across the on-screen keyboard! Try and search for something with that !!! Removing and re-inserting batteries usually helps. I tried this device too late to return so I guess I'm out the cost of the product.", "verified": true, "helpfulness": "0/0", "author": "Donald B."}]