[{"rating": 3.0, "review": "Too many programs to buy and not enough free", "verified": true, "helpfulness": "0/0", "author": "Terry Robison"}, {"rating": 1.0, "review": "Do it work with out internet", "verified": false, "helpfulness": "0/1", "author": "pinky"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "katrine diehl"}, {"rating": 5.0, "review": "Haven't really tried a lot of these devices, but the Fire TV Stick is quite impressive. I mainly use it to turn a standard HDTV into a Smart TV, and it works great for that. It also does something with pictures, but I haven't tried/needed that. Great for Netflix, Hulu, and Prime. Cheaper than Cable.", "verified": true, "helpfulness": "0/0", "author": "David Wiese"}, {"rating": 5.0, "review": "Love it so easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Darlene K."}, {"rating": 1.0, "review": "I can n not recommend this product because its poor connectivity resulting in choppy video, which freezes, and stops and the voices of the actors are always not in sync with their lips.  I may be a fool, but I am going to buy the Amazon Fire instead of the stick, hopping it will perform better.  I connected my PS3 to the same TV and watched the same episode on Netflix and is was as smooth as whipped creme.  When I switched over to the fire stick, the exact same program was choppy, freezing all the time, and unbearable to watch.When you have Verizon Fios and are getting 866.7 mbps in the air using my laptop next to the TV, its not a shortage of bandwidth.  I was hoping Amazon would take back the fire stick and apply the difference towards the Amazon Fire, but they won't.  I will look around Newegg, Best Buy, Radio Shack, and look for a sale.", "verified": true, "helpfulness": "1/1", "author": "Flex"}, {"rating": 5.0, "review": "I recently bought the TV Firestick from Amazon after trying for two years to use another box with a name starting with RO... Ro.. worked only when it felt like it. which wasn't very often. When my Amazon Firestick arrived I had it installed & working in ten minutes. Easy, easy installation. It works perfectly every time. Easy to install & easy to use Couldn't be more satisfied with this product.", "verified": true, "helpfulness": "0/0", "author": "A.G. Armstrong"}, {"rating": 1.0, "review": "I only have it one star because it wouldn't let me give it no stars. This thing is horrible! It locks up every five minutes or is constantly buffering. I bought a Roku 3 and have had zero problems...same internet but no buffering. It's the fire stick. Don't waste your money.", "verified": true, "helpfulness": "1/1", "author": "Brianna"}, {"rating": 5.0, "review": "If your internet signal is strong the product will perform as advertised.  Conduct a speed test before you purchase.", "verified": true, "helpfulness": "0/0", "author": "dws"}, {"rating": 1.0, "review": "Update: This thing is complete trash. The UI is cluttered and cumbersome. not sure if its because they are trying to constantly \"sell\" you something. The app store installs are annoying. THE ONE APP Plex I actually want to use DOES NOT work with this and never truly has. So that is 5$ down the pooper. Amazon blames plex and plex blames amazonIf I could get a refund (which I cant cause it was free) or trade this for a roku stick I would. Its complete garbage!DO NOT BUY!old review:So here we go and Im trying not to be biased since I did get it free with my SLING subscription.First Im a tried and true ROKU guy. I am an android guy for most stuff but when it comes to streaming television and media ROKU just takes the cake. At the time I didnt know SLING was also giving away a free roku stick or I would have gotten that instead.Anyway here are the prosIts pretty fast and easy to set up.Streams wellThe android remote app is nice (except the navigation sliding is awful just put arrows on it) and gives you the voice funtions lacking in the regular remote..........?Cons are as followed.Very cluttered looking/feeling UI.No dedicated app store you can see. You can use the search function but its iffy and other wise you have to install apps via the amazon app store on another device then sync.I mean in the end it really does nothing that no other device, ROKU included, can do. Plus my ROKU pretty much does it all better.Its also very picky with file formats.Trying to stream from my tablet to the stick via allcast was very picky. It seems the stick ONLY likes Mp4 files where my roku can play almost ANYTHING.Also I purchased PLEX from the android app store yet when trying to run it on the fire stick the same purchase does not work. This is insane since they ARE BOTH ANDROID! Why the purchase needs to be redone through amazon is just garbage to be honest and a rip off.Again being an android guy once you look into hackign and installing full on android apps through your phone/tablet its pretty nice, if they work, but otherwise this just isnt enough to make me switch from rokus.", "verified": true, "helpfulness": "0/0", "author": "Tyler Nicholas Turel"}]