[{"rating": 5.0, "review": "Did as advertised!", "verified": true, "helpfulness": "0/0", "author": "William M. Davidson, Jr"}, {"rating": 1.0, "review": "Its constantly buffing even though the fire stick is 12 inches from the modem. Cant watch movies or shows on Netflix without it buffing through the entire movie. The Fire TV is worth the money than wasting your money on the stick.", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Its great. I also have an Apple TV & this is easier to install and just as good & the price is great. $39 vs $99.  Love it & Amazin Prime.", "verified": true, "helpfulness": "0/0", "author": "Deborah T. Wyrick"}, {"rating": 1.0, "review": "already asked for a replacement.  worked for 4 hours.  we turned tv off and back on few hours later and no longer worked.  I tried everything to get working.", "verified": true, "helpfulness": "0/1", "author": "Gary Lundy"}, {"rating": 3.0, "review": "Jury is still out. The stick has some trouble holding onto the wifi signal. And I live in a small place.", "verified": true, "helpfulness": "0/0", "author": "Charlotte Arboleda"}, {"rating": 5.0, "review": "The Fire TV Stick is amazingly easy to set up, and the range is phenomenal.  It is perfect for the wall TV in the basement.  And it works with the voice remote from the fire TV and the gaming controllers.  It streams movies without pausing or hiccups, just like the bigger box version.  My only complaint is that the power source plugs in on the side, instead of the end, but they provide a short extender so if you can't power it up because HDMI cables are on both sides, it can pop out a little so you don't have to waste an HDMI slot to make room to plug it in.", "verified": true, "helpfulness": "0/0", "author": "Dinubabear"}, {"rating": 4.0, "review": "For $20 this frees my computer from playing instant video.It does what I expected.It really needs a volume control", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 5.0, "review": "Got this stick for the 1 TV in the house that isnt smart.  Exceeded my expectations and does so much and super easy to use to access my PRIME movies/TV shows, Netflix, Flixter and everything else that I access on my Kindle Fire HDX.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Reilly \"Arizona Jen\""}, {"rating": 5.0, "review": "I love my Fire Stick, great design, performance and a good adition to the TV room", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to set up and great that it comes preloaded if you have Amazon prime", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]