[{"rating": 5.0, "review": "Love this!  A must for Prime users!", "verified": true, "helpfulness": "0/0", "author": "B. Blades"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick... I didn't think it would work, as a BluRay player I bought never did sync up with my WiFi.  But, it was SO easy to connect to my TV.  It turned on immediately, showing the step by step set up.  Got connected to the WiFi signal. Showed all the available choices.  I chose an episode of \"The Good Wife\" I had missed, and it started right up!  All High Def.  Just like playing a BluRay movie!  AWESOME! So clear, just - AWESOME!.  I don't know if it will connect to my sound system.  I haven't figured that out yet.  But the speakers on my HDMI Sony are pretty good- not as great as running sound through the audio system.  But good.  I plan on trying out NetFlix, Hulu, everything available through my Amazon Prime subscription.  I am very satisfied with my purchase of the Amazon Fire TV Stick. I think it is terrific!  And I recomend buying one for any one who considers them self any degree of a \"TV-aholic\"!  Happy TV viewing, TV Lovers!", "verified": true, "helpfulness": "0/0", "author": "Kathryn A. Lininger \"K. A. Lininger\""}, {"rating": 5.0, "review": "Love it..", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Neal"}, {"rating": 3.0, "review": "It worked fine, just no local news worthy stuff for the husband who enjoys the news. Then when I wanted to watch the movie of my choice, said I had to pay. I am a prime member. Did not think I needed to pay for a movie. What would be the point of that? Very easy to hook up. Need the high speed internet.", "verified": true, "helpfulness": "1/1", "author": "Jan Stevens"}, {"rating": 5.0, "review": "I'M IN LOVE WITH THIS FIRE TV STICK ITZ GREAT! I'M STILL LEARNING MORE AND SEEING MORE!", "verified": true, "helpfulness": "0/0", "author": "Marilyn Wright"}, {"rating": 4.0, "review": "Arrived quickly and very simple to set up. Would like to see more apps for channels that we currently watch like AMC, NatGeo and TNT. There are tons of movies and music to choose from between Amazon Prime, Netflix, Hulu and many more.", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 3.0, "review": "I love the options that the fire TV Stick provides for Netflix, Prime Instant Video, TwitchTV, and the many streaming options out there. The problem that I'm having though is that the TV Stick will periodically stop working on my WiFi network, all other devices continue working as intended.  I thought it may have something to do with the Xbox 360, Wii, and or DirecTV Genie being nearby, but even with the other wireless devices turned off the TV Stick will still drop the connection, the wireless router is in the next room with a single wall between them.Otherwise, happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Kenneth R. Martin"}, {"rating": 3.0, "review": "Requires a power supply.  I know there's a model that doesn't.  Very disappointed about it not being mobile at all.  Can't use it without plugging it into a USB power cord, plugged into an outlet.  Can't use it with a laptop for this reason without using up 2 USB ports and having a 5ft cord in your way.  False advertising in my opinion.", "verified": true, "helpfulness": "0/1", "author": "daniel r kline"}, {"rating": 5.0, "review": "I love Amazon anyway, but I love their products and Fire Stick is awesome. Had a bit of a problem and had to unplug the cord and plug it in after 30 seconds..worked great. Customer support is awesome . I recommend the Fire Stick to all my friends and anyone interested in streaming movies, games, and music, via your T.V.", "verified": true, "helpfulness": "0/0", "author": "L. Richter \"Redheart\""}, {"rating": 5.0, "review": "Love it, way better than Chromecast.  If the remote just had volume control we'd be set.", "verified": true, "helpfulness": "0/0", "author": "Rob A."}]