[{"rating": 2.0, "review": "As far as getting things like Netflix and Pandora, it works great.  However, it has messed up all of the other channels on my TV.  I can only get one and that is the last channel I was watching before I installed the Fire Stick.  I have tried everything I and my son can think of and I only can receive one channel.  I am still looking for a solution to this problem.  If anyone can think of a way to receive my other cable channels, please let me know.", "verified": true, "helpfulness": "0/1", "author": "Shirley Jensen"}, {"rating": 5.0, "review": "Easy to set up and easy to use.  I like that I can unplug it and use on another TV.  Would definitely buy again!", "verified": true, "helpfulness": "0/0", "author": "Paula S. St Julien \"pstjulien\""}, {"rating": 5.0, "review": "So easy to install. The instruction video was great, a no brainer, what could be better. I will be buying more for the rest of my house!", "verified": true, "helpfulness": "0/0", "author": "Barbara Saulters"}, {"rating": 3.0, "review": "The device lost the internet connection. The rest of the features works good", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the Fire TV Stick.  I was'nt able to get Amazon Prime on my Smart TV.  And, now I can as well as other APPS.  The streaming is great never stops playing.  But you know the really best thing I like about it?  When I put it on pause...after a few minutes it begins streaming the most amazing photography of mountains, beautiful wildflower meadows, etc.  It's just beautiful on a 46 inch flat screen.  Sometimes it takes me bit to get back to the show I was watching.  Just love it!", "verified": true, "helpfulness": "0/0", "author": "Littlebits \"happygolucky\""}, {"rating": 5.0, "review": "Works great with SlingTV!  We also love the Amazon Prime Videos!  Goodbye Cable!", "verified": true, "helpfulness": "0/0", "author": "K. O'Brien"}, {"rating": 5.0, "review": "love my fire stick! since I cut my cable cord I have not thought twice about cable since getting the fire stick. Thank You Amazon!", "verified": true, "helpfulness": "0/0", "author": "Sang H. Lee"}, {"rating": 5.0, "review": "Awesome product, works as it should.  Easy to connect to TV and is a great price!", "verified": true, "helpfulness": "0/0", "author": "carol l schmal"}, {"rating": 3.0, "review": "too far from router.  I guess that's the issue.", "verified": true, "helpfulness": "0/0", "author": "C"}, {"rating": 5.0, "review": "Highly recommend !! Excellent. Getting another for upstairs tv. Easy to use", "verified": true, "helpfulness": "0/0", "author": "nichole graf"}]