[{"rating": 5.0, "review": "I have had this Fire TV Stick for a couple of months now.  We use it exclusively for television programming. With Amazon Prime, Netflix, and Hulu we \"cut the cord\" to cable and satellite company. MY ISP probable isn't happy that I eat up 30gb+ a day. I got this on special for $20. Its worth every penny. As a matter of fact I am thinking about to order another for my kids room.Its fast, almost all shows from Amazon start instantly. I don't know how they do it but it is awesome!  The first boot up of the morning is a little slow. But as soon as the device is up and running it performs very well. I do not have any problems with startup on it unit has set for hours and turned itself off. It's not like it takes a long time, just not instant on. About as long as it takes a xbox 360 to boot.  ONLY during 1st startup of the day or after hours of no use.I have no real cons on the device. Perhaps upgrade suggestions for Fire Stick 2... For one the remote is small. and easily lost. It would be nice to have a \"PAGE\" button built into the FireTV App (Apple/Android) to locate the remote.My internet isn't very fast either, My download ranges from 3mbs/5mbs. And it still plays alot of stuff in HD without any hickups.  So if your afraid your internet is too slow for this I say give it a try. I've even used it on internet that on;y had 1.5mb download and it work pretty good. Watchable TV just not HD.Bottom line very cool, simple to use, and lots of options to see your shows.", "verified": true, "helpfulness": "0/0", "author": "C. Gibby"}, {"rating": 3.0, "review": "This product works well but the selection for neww release moviewwere less than expected and there were more yoy have to pay forthan get free. Netflix seems to be a better choice by far than amazonprime.", "verified": true, "helpfulness": "0/0", "author": "Tony Alexander"}, {"rating": 3.0, "review": "I have had Apple TV for 4 years and never had a problem.  Bought the Fire TV stick because I wanted to see amazon Prime (which apple does not support).  Got the Amazon TV stick a week ago.  Long story, short...power went out last night and now I am stuck on Home with \"Loading Home...\" for the last 30 minutes.  The only suggestion on Amazon is to unplug the stick for 3 seconds...really???  I've done it and it makes no difference...just keeps loading...  I know it is on the connection since I can get on with all my other devices.  I can't find any forum other than Netflix problems.  Poor support on website.  If this isn't corrected ASAP, I will be returning it!Also, while watching Hulu Plus & Netflix it freezes but sound continues...Update...it is still loading...one hour...and when I just unplugged stick it is very hot!  Trick is to unplug it and let it cool down (3 seconds is not enough!)Finally I can watch Downton Abbey!!!", "verified": true, "helpfulness": "0/0", "author": "Teri L"}, {"rating": 5.0, "review": "Works very good, just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "LT"}, {"rating": 5.0, "review": "Easy to operate works great.", "verified": true, "helpfulness": "0/0", "author": "Billy"}, {"rating": 5.0, "review": "Love the stick, easy to use it. Had to use Wii system to go to Netflix or Hulu, now everything is right there one time log in and I'm all set. Thanks.", "verified": true, "helpfulness": "0/0", "author": "Samantha Caine"}, {"rating": 5.0, "review": "Works perfectly! Simple to use!", "verified": true, "helpfulness": "0/0", "author": "Gerald W. Nix Jr. \"Poolman\""}, {"rating": 5.0, "review": "Installed easily and remote is tightly paired at the moment of install. Their is more interesting content that requires more fees that I perceived that may be just me.", "verified": true, "helpfulness": "0/0", "author": "JGJ NYC"}, {"rating": 5.0, "review": "Works very well!", "verified": true, "helpfulness": "0/0", "author": "Marc T. Robinson \"very disappointed 24 fan\""}, {"rating": 5.0, "review": "Good choices.  Works great and with ease.", "verified": true, "helpfulness": "0/0", "author": "Peggy C"}]