[{"rating": 5.0, "review": "I am currently on bedrest and this has been a lifesaver for me!  I can plug it into any TV in the house with an HDMI port and it streams quickly.  I am an Amazon prime customer so all my music is available also.  I also belong to Netflix and can watch movies and TV shows straight from the app.  All you have to do is download it...takes just a few seconds.  The remote is easy to use and I even downloaded the remote app for the Iphone.  When I use my Iphone I also have the option to give voice commands.  All in all... great product and well worth the money! I can't believe I didn't try this sooner.", "verified": true, "helpfulness": "2/2", "author": "NickyC"}, {"rating": 4.0, "review": "Wish it had HBO now. And the app does not work well but great viewing quality.", "verified": true, "helpfulness": "0/0", "author": "Kathleen AM Greene \"Kat\""}, {"rating": 5.0, "review": "Great When Kodi is Installed!!!", "verified": true, "helpfulness": "0/0", "author": "Alejandro Contreras"}, {"rating": 5.0, "review": "I love it. It's pretty fast ! Easy to connect.", "verified": true, "helpfulness": "0/0", "author": "selena"}, {"rating": 5.0, "review": "It's all I could hope for!!!  Now I have access to all the editional TV and cable programs I could not enjoy before.", "verified": true, "helpfulness": "0/0", "author": "Mary Hackett"}, {"rating": 5.0, "review": "Love it!!! We also have Apple TV but we prefer this because of our existing amazon prime membership benefits. The menus are so simple to navigate and the set up was a snap. Love the auto tutorial that launches automatically.  This is such an amazing value...", "verified": true, "helpfulness": "1/1", "author": "Ecb"}, {"rating": 5.0, "review": "Streams videos quickly and reliably, and the interface is very user-friendly. Would absolutely recommend this device over the chromecast, which is often times very glitchy.", "verified": true, "helpfulness": "1/1", "author": "Daniel Santos"}, {"rating": 5.0, "review": "Its the best 40 bucks I never spend. Very happy for my purchase", "verified": true, "helpfulness": "1/1", "author": "Jeff Torres Stockton Ca"}, {"rating": 4.0, "review": "Works great so far.  The only thing I can think of to improve the stick right now would be to add in some sort of control it can have to shut my tv off and control the volume.  That would be dandy.", "verified": true, "helpfulness": "0/0", "author": "Badger2011"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Jennifer H. Plank"}]