[{"rating": 5.0, "review": "I love this device!  I use it to watch BBQ videos on YouTube and couldn't be happier!", "verified": true, "helpfulness": "0/0", "author": "Derrick"}, {"rating": 2.0, "review": "PrettyEasy to set upNice interfaceNo VUDUNo HBO goAmazon prime library is redundantIt doesn't do anything my Samsung TV doesn't. I have no interest in the game apps. So I returned it", "verified": true, "helpfulness": "0/2", "author": "Ali Saad"}, {"rating": 5.0, "review": "It does SO much. And the great shipping, with text updates, amazing. How could you NOT own one?", "verified": true, "helpfulness": "0/0", "author": "Vince"}, {"rating": 1.0, "review": "I am changing my rating from 5 to 1. I would give it zero star if I could.Since setting up the Fire TV Stick when I first received it in November of 2014, I never tried to use it again till April 28th, 2015, and it wouldn't work even after I have spent half a day with three different Amazon tech support reps. They had me running through all kinds of hoops and we could not get the stick to connect to my wireless router, which is just a couple of steps away from the Stick. I have done several reboots of my router and the Stick still no go. I have several devices that connect to the same network with no problems. So I know it is the Stick, not my network. So I am just ditching the Stick as it is not worth the hours of hassles.", "verified": true, "helpfulness": "1/2", "author": "Sahalu Saidu"}, {"rating": 4.0, "review": "So far, the Amazon brand products I've bought have turned out to be great, and the Fire TV Stick dongle is awesome. I am not mechanically inclined whatsoever and I was happy as a pig in mud when I got the dongle to connect and stream content. Buy the Fire TV Stick, you won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "About that..."}, {"rating": 4.0, "review": "Greatvwhen it works. Not working now. Probably a user error!", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 1.0, "review": "I got it for half price and it's still not worth the money. It won't let me log in 80% of the time and the times it does I have no option but to watch some crappy little cartoon walk me through the whole intro video again. No skip option, no ignore option, just have to watch 5 minutes of intro every. Single. Time. Save your money or buy a better alternative", "verified": true, "helpfulness": "1/3", "author": "GetToTheChopper"}, {"rating": 4.0, "review": "so far so good , pretty slick", "verified": true, "helpfulness": "0/0", "author": "Val Pistor"}, {"rating": 1.0, "review": "not much choices like apple-tv nor Roku.", "verified": true, "helpfulness": "1/2", "author": "pamboy \"pamboy\""}, {"rating": 1.0, "review": "icant get it to work. it does not recogognize my amazon account", "verified": true, "helpfulness": "2/3", "author": "gary koarl"}]