[{"rating": 5.0, "review": "It is an amazing product. Amazon's Fire TV is much more powerful than the other more expensive products in the market. You can turn your regular TV into a smart TV for just $39.00.", "verified": true, "helpfulness": "0/0", "author": "Riaz Ahmad"}, {"rating": 4.0, "review": "Awesome! but some streaming issues. cool over all.", "verified": true, "helpfulness": "0/0", "author": "Samuel w. Shaw"}, {"rating": 5.0, "review": "the fire stick works fine and it was easy to setup", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 2.0, "review": "Installation was easy, but will not stream video. Shows signal strength good, but it will not work. Plays about 5 seconds and freezes only to not start again. I am apparently not the only one with this problem and nothing tried seems to help. I plan to either give it away or return for a refund.", "verified": true, "helpfulness": "0/0", "author": "Larry Nelson"}, {"rating": 4.0, "review": "I like my Fire TV Stick.  However, lately it has been getting stuck and I've had to reset by unplugging it.  Since, it's first generation it might be a bug but, all in all I really enjoy having it.", "verified": true, "helpfulness": "0/0", "author": "Smtie"}, {"rating": 5.0, "review": "Love our Fire TV Stick. We just purchased a box yesterday for our parents as well.  We have Google Chrome Cast as well and have replaced it with the Fire all together.  Being a Prime Member has it's perks.  The selection still has room for improvement, but compared to Netflix, we still find more options with Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Emily Cooper"}, {"rating": 4.0, "review": "Cool device, lots of options", "verified": true, "helpfulness": "0/0", "author": "shroudbass"}, {"rating": 3.0, "review": "I love the actual device. We have both an Apple TV and a Fire TV Stick and if I could pick, I would use the Fire TV stick hands down every time. Apple TV has a very clunky feeling Netflix interface compared to Fire TV. We've had only minor issues with the Fire TV stick not wanting to work, all solved by simply restarting the device (who can blame it after being left on for a week straight?).All of this sounds wonderful and deserving of five stars, and it would have gotten 5 stars, if the remote control hadn't stopped working after 2 months of use. We've changed the batteries, hit every button on the thing and still it is lifeless and unresponsive. Luckily, I had installed the remote app on my phone before it died, but my husband is not so lucky. With the last update, they did something that broke the app for new installers so that you are unable to get through the intro and you can't use the actual app until you watch the intro so he has no way to control it.", "verified": true, "helpfulness": "0/0", "author": "Amb4nb"}, {"rating": 5.0, "review": "I only wanted it for Netflix and Hulu, and doing this was soooo much cheaper than buying a smart tv!!", "verified": true, "helpfulness": "0/0", "author": "Shantia C. Ezekiel"}, {"rating": 5.0, "review": "Has so far met all expectations after roughly a month. Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Samuel G Wells"}]