[{"rating": 4.0, "review": "Easy install. Great video instructions!", "verified": true, "helpfulness": "0/0", "author": "Billy"}, {"rating": 5.0, "review": "Was really surprised how easy it was to install and running in no time. Works as advertised. Completely satisfied", "verified": true, "helpfulness": "0/0", "author": "Tom Maldonado"}, {"rating": 2.0, "review": "I had a real hard time to connect the stick to the internet. Finally after spending many hours It was connected. But  now every time I turn it on I have to rescan for connection to WIFI again (5 to 10 minutes). As a matter of fact I am planning to return it. I noticed a lot of people had this problem. Just Google it.", "verified": true, "helpfulness": "0/0", "author": "Bijan G. Tabrizi \"Bitab\""}, {"rating": 4.0, "review": "have not used it much as yet, comes up on TV screen faster than what I did have", "verified": true, "helpfulness": "0/0", "author": "Anthony Tremblay"}, {"rating": 3.0, "review": "Great product not happy that the plug is so short. Even with the extender which is very short as well. Make a longer cord and I'll give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Leslee Ferran"}, {"rating": 4.0, "review": "Very easy to set up, basically a plug and play.  Lots of the popular items (Pandora, Hulu, Netflix), I hear HBO Go is coming soon.", "verified": true, "helpfulness": "0/0", "author": "Greg Hibbard"}, {"rating": 4.0, "review": "So far this is my favorite streaming device. It supports 5.1 audio, Prime Video, Netflix, Sling and Kodi. The interface is modern looking and snappy.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Best TV streaming option.  I love that this comes with a remote but you can also control with your phone if you choose.  My 7yr old uses this with no assistance needed.  It has games as well.  We have owned Google chromecast and it was terrible and inconsistent.  We replaced it with fire stick.", "verified": true, "helpfulness": "0/0", "author": "Candicesmith"}, {"rating": 4.0, "review": "Works as advertised. Some confusion initially as to how to get the Fire Stick to power on after it goes into auto-sleep mode. (Must press the enter key while in sleep mode to get the HDMI port to recognize the device.)  Also, Amazon please expedite the ability to sign-in to hotel and other 3rd party networks such as Comcast's Xfiniti public hot spots. Need some sort of webpage to allow entry of login credentials. (Reportedly in the works.)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"texas oilman\""}, {"rating": 5.0, "review": "Love love love it, easy to use", "verified": true, "helpfulness": "0/0", "author": "kim baise"}]