[{"rating": 3.0, "review": "I thought that I would be able to get more free stuff and internet on TV.  I was not prepared to pay more as I already pay Directv.  Others say I should have gotten another brand instead of Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Mona W. Banton"}, {"rating": 3.0, "review": "I like it but it don't  have the insp. Channel my favorite channel or westerns other than that it's ok", "verified": true, "helpfulness": "0/0", "author": "bee cat."}, {"rating": 3.0, "review": "About what you would expect. Menus are well organized and very easy to navigate. I am still getting glitches about once be 30mins of streaming. There seems to be no easy way to diagnose whether this is an issue with my internet, my router or the stick. Additionally there seems to be no way to update firmware. I would assume there will be updates (hopefully fix the glitching). Finally there is not really as many shows/movie/etc. on amazon prime as I had hoped.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Good product, wished it made searching for movies on prime a little easier. All in all satisfied with it.", "verified": true, "helpfulness": "0/0", "author": "Erin Pfau"}, {"rating": 5.0, "review": "great device for streaming", "verified": true, "helpfulness": "0/0", "author": "todd"}, {"rating": 5.0, "review": "The Amazon fire stick works very well and is easy to set up. I downloaded the fire stick app on my iPhone which allows you to search by voice and works the same as the controller. The app also works extreamy well. I am so happy with the Fire Stick I just ordered another one for our bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Charles Wochele"}, {"rating": 5.0, "review": "We use this all the time. I think it is faster and better streaming than our ROKU. Big Fan. Got it on sale for $19.99! Can't beat it for that price.", "verified": true, "helpfulness": "0/0", "author": "Gina Buchholz"}, {"rating": 4.0, "review": "we love are fire tv stick. we wish more of the movies were free to watch. but we do enjoy are fire stick.", "verified": true, "helpfulness": "0/0", "author": "Sweetiewheaty"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "daniel barraza"}, {"rating": 5.0, "review": "Easy set up. Works great. This is a very good choice.", "verified": false, "helpfulness": "0/0", "author": "Yvette Casey \"Afferore\""}]