[{"rating": 5.0, "review": "I am considering getting rid of cable and thought this item would be good \"for a dry run\". I use it with a streaming service. It's simple to use and set up. I was going to get a book on how to set it up and run it. That turned out not to be necessary.", "verified": true, "helpfulness": "1/1", "author": "Karen Pisarski"}, {"rating": 5.0, "review": "Love it.  VERY easy to install and setup.  Handles my Netflix account without any problems. Only CON is that I wish all the screen shots had a little bigger character size -- they are a bit hard to read with my old eyes.", "verified": true, "helpfulness": "0/0", "author": "Robert Shobe"}, {"rating": 5.0, "review": "great product for a low price", "verified": true, "helpfulness": "0/0", "author": "Joe Hines"}, {"rating": 1.0, "review": "Bought this to replace an xbox that crashed because we only use it to watch Netflix and Amazon Prime movies. It didn't work from the start. Any movies that I tried to stream gave me a blue screen with the words \"HDCP unauthorized content disabled\" on it. I tried the unplugging and re plugging it back in that is recommended and that also didn't work.  I contacted Amazon Support who were patient and walked me through the process of trying to get it to work, by doing a factory reset, and that didn't work either. They did offer to replace the Fire TV Stick, however, I didn't want to get another one to have it not work from the start. I am taking this back to the store.", "verified": true, "helpfulness": "1/1", "author": "Kendra C. Wageman"}, {"rating": 5.0, "review": "Exceeded expectations. Simple to set up, streaming is good no reload pauses, don't have to get out of my chair to access it. Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "thomas mccabe"}, {"rating": 1.0, "review": "Will not work with MLB.tv says it will but it will not work at all I have 50 mb download speed and it stops and starts and stops and stops wish I never bought this netflix amazon prime playing app", "verified": true, "helpfulness": "0/0", "author": "J Trembley"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "F. Flor"}, {"rating": 5.0, "review": "Easy setup just plug in and start watching. Easy to add your accounts very user friendly", "verified": false, "helpfulness": "0/0", "author": "christin page"}, {"rating": 5.0, "review": "Fantastic product!! Does exactly what is says it does in the description and better even, it doesn't weigh down my network!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great Little Device works as advertised easy set up!", "verified": true, "helpfulness": "0/0", "author": "Jerry w Powell"}]