[{"rating": 2.0, "review": "A very important feature: ACCESS TO MY LOCAL OR REMOTE VIDEO, Pictures or MUSIC or other electronic STUFF !With Roku or even Chromecast, and many other cheap devices I can accomplish easily something that I cannot get working on the Fire Stick and Tablet for that matter. Your confusing interface managed to make me unintentionally pay for a TV show, that has some parts for $0 and some for money -- and there is no way to cancel or refund it. Is this a new way of creating revenue for Amazon?Major oversight Mr. Jeff --  now both Kindle Fire tablet and the Stick are major disappointment. I do not think I will even try the Phone.", "verified": true, "helpfulness": "0/1", "author": "Just a customer"}, {"rating": 5.0, "review": "I ordered this on a whim as a preorder so I could finally watch Amazon Prime videos on my TV. I am sure glad I did. To keep this summary short, I will just say that this is a great compliment to other media streaming devices out there. I have long refused to buy a smart TV because of all the options to add streaming to a \"dumb\" TV and in my personal situation, this device combined with a Chromecast fits all of my needs to a t.  I have an android phone and the ability to use the play store for a movie is a big plus for me, hence the Chromecast. I have long strugglednwith how to get prime video on android, which is now available but could not cast it on my tv. That's where the Fillre Stick comes in to play.  Although I can get the same streaming apps on both the Chromecast and the Fire Stick, having access to so much streaming media has solved almost all of my struggles.To conclude, the games on the Fire Stick, Prime videos and apps combined with a Chromecast and the ability to stream from my phone makes my media streaming collection, to me, just what I need.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Penn"}, {"rating": 4.0, "review": "Nice interface ! Very nice remote control and easy to set up. Just wish the service had more new movies for free", "verified": true, "helpfulness": "0/0", "author": "TURNone"}, {"rating": 4.0, "review": "It's good for what it is. I'd like to see some more streaming from my iPhone or iPad (like Chromecast) and I'd like to see Daily Burn get added to this as well. I'd also like to see the remote add a universal feature so I can eliminate my tv remote for power and volume. But, the remote is nice so I don't have to stop what I'm doing on my phone to mess with stuff (like I do with Chromecast).", "verified": true, "helpfulness": "0/0", "author": "Kevin M."}, {"rating": 5.0, "review": "got this for a DEAL! prime members received these for $19 on pre-order. I like that this comes with a remote. I also have a Google Chromecast and I would say they are both worth the money. I don't see myself using the remote often because I had the chromecast first and have got use to using the cast button on my mobile apps. However for people new to the experience I am sure that they would like having the remote.", "verified": true, "helpfulness": "0/0", "author": "W1ll1am"}, {"rating": 5.0, "review": "Love this thing.It is much easier and less of a hassle than using my computer or a console system to play movies and TV through.  It works very quickly and runs on very little energy.Simple to use with a great set of features.Would highly recommend to anyone who doesn't care for regular cable TV.", "verified": true, "helpfulness": "0/0", "author": "Matthew Simmons"}, {"rating": 4.0, "review": "The Kindle Fire TV Stick is a perfect choice for Amazon Prime fans who like the small size, WiFi connection, and remote control.I'll just right to the...\"who should buy this\":1. Amazon Prime Members - you can buy it even if you don't use Amazon, but you get the full advantage of this unit if you have Prime membership.2. Those that want to add streaming to a TV and not have to control the device with a smart phone or tablet.3. Those that want to connect by WiFi (don't have direct network connection) and don't plan heavy streaming usage.The complementary list of \"who should NOT by the Fire Stick\":1. Heavy Goolge or Apple users that want a more seamless connection to those platforms.2. Users that can make a direct Ethernet connection to the streaming device and don't mind a larger device size.3. Users that plan heavy streaming of HD content, voice control, gaming, etc.The Fire Stick falls in between the other sticks like Chromecast and Roku and the \"set top\" boxes like Fire Player, Roku 3, etc.The advantages to the Chromecast are simply price and Google integration, the Fire TV stick will beat it with the added remote control, better processing, and added apps and streaming access.  The Fire TV Stick is limited by the WiFi only connection and moderate processing capability.  If you can make a direct network connection to your streaming device and don't mind the larger size of a Fire Player, Roku 3, etc. then those players will give you expanded options and reliable streaming connection above and beyond this Fire Stick.  The Fire TV Stick is positioned with great value...it is likely the best performance for the dollar you can buy right now.  It does allow some expansion by adding gaming and voice control remotes, but be warned that adding those extras will push the price up to the point that you could have purchased a set top unit with more features from the start.It is a great option for use with a \"spare TV\" such as in a kids play room, bedroom, kitchen, etc.  The benefits of the larger set top boxes are significant if this is going to be your main or only device and it is likely worth the extra $ to go with the Fire TV box or similar player.I have used the Fire TV Stick on a TV in our kids play room.  It is very handy in that application for three main reasons: 1) The size lets it direct mount to the TV with no shelf space required or wires hanging. 2) The remote allows the kids to operate the player without a phone or tablet. 3) Amazon prime movies are directly available where they would not be on Chromecast, etc.There are no issues with streaming speed for basic services, and the remote is very high quality and response time is great.  My WiFi reception is strong, but be warned...there is no antenna and this small device could easily be signal blocked depending on how it plugs into the TV (use the included HDMI extender if that happens).Conclusions:If you were about to purchase a Roku Stick, then go with this Fire TV Stick instead.If you were about to purchase a Chromecast and you are an Amazon Prime member or just want a remote, then buy this stick instead.If you think you want a full featured box like the Fire TV or Roku 3, then you should really consider your needs...this stick could fall short if it is your main player.The price is amazing for the technology and quality packed in this stick!", "verified": true, "helpfulness": "1/1", "author": "Kevin Cahill"}, {"rating": 5.0, "review": "Got it a great price and I am enjoying it.  I have it on my bedroom TV with no cable box.  Who needs to spend an extra $8 a month when you can get this device.  I had chrome on that TV, but this works much better with less buffering.  I have Uverse in my home and this device works perfectly.  The remote is great.  It what makes it 1 star better than chrome.  I feel it's the best wireless device on the market right now.  Very happy with the purchase.  I hope it grows as my favorite device, the Roku 3.  While I love wireless devices, plugging with an Ethernet cord is still the best way to go.  Especially with ultra HD, 1080p, and 4k content.Update:  7/30/2015I have to say this is a good device.  Quality of picture is excellent.  Remote works well.  I made a comment about Ethernet was the way to go.  I have Uverse 24-MBPS service and this device has only buffered once or twice in the year I have owned it.  Otherwise, it works flawlessly with WiFi.  HIGHLY RECOMMEND the FIRE Stick.  One gripe:  The user interface isn't great.  It could be more user friendly, like the ROKU 3.  Roku is much cleaner and just has a better APP screen.  I'm sure Amazon will one day update the welcome screen and clean it up a bit.  Once you get used to it, it is OK.  I see more apps on the device and while the ROKU 3 is maybe a tad better, I would buy this again if needed.  It will be about price.  When on sale this is a no brainier, buy it.  Oh and this works on the road with most hotel wi-fi systems.  Speed can be an issue at some hotels, but a great plus.  Chrome and Roku stick don't work a many hotels, because of hotel wifi log-in procedures.  Amazon Stick works.", "verified": true, "helpfulness": "0/0", "author": "RN"}, {"rating": 1.0, "review": "never Works, always is failling. is a very bad quality and performanceDissaspointed. no recommendedI have being Amazon client During Years. First time I suffer with low quality of the  product you made", "verified": true, "helpfulness": "1/3", "author": "Guillermo Turrent Medina"}, {"rating": 1.0, "review": "very poor", "verified": true, "helpfulness": "1/3", "author": "royal brian walker"}]