[{"rating": 5.0, "review": "Fire TV Stick has done what Roku could not.  It has made me a streaming fool.  I have a Roku 3 and have never stayed glued to the tube like I have with Fire TV Stick.  I have been on Prime Video constantly since it arrived.  Great product.  Great interface.  Smooth streaming.  Love it.", "verified": true, "helpfulness": "1/1", "author": "Chad Gaines \"Blender\""}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "I also have a chrome stick and find I prefer this over it for use.", "verified": true, "helpfulness": "0/0", "author": "Richard Fraley"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "David K Anderson"}, {"rating": 5.0, "review": "excellent quality, incredible movie/music offering", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm pleasantly pleased with the Fire TV Stick. I'm still learning what I can watch and do with it--but it loads fast plus the remote and interface are intuitive. For the most part, I can run the remote without even looking at it. I can't say that with the remote for my TV or my DVD player. I took it on the road with me recently and used it at the hotel--and it worked great! I love that it's portable.", "verified": true, "helpfulness": "0/0", "author": "Brigette"}, {"rating": 5.0, "review": "Awsome!", "verified": true, "helpfulness": "0/0", "author": "Oscar Rodriguez"}, {"rating": 4.0, "review": "has resume function, easy to control, but no power button.", "verified": true, "helpfulness": "0/0", "author": "V. le \"klanva3\""}, {"rating": 5.0, "review": "I liked everything about the Amazon Fire Tv stick but there is only one thing I would like it to have... And it is SPANISH SUBTITLES in it movies and tv shows! Don't forget that there is a huge latin community with the economic power to spend in a service like this but sadly without the hability to understand english at a 100%.Adding that would add a great feature to the service.", "verified": true, "helpfulness": "0/0", "author": "Maarten H. Arguinzones"}, {"rating": 5.0, "review": "I am a huge fan of the Amazon fire stick. It plays my Netflix, but you almost don't need it if you have prime. Music, TV, Movies. It's great. And they have their own shows that they produce which are pretty good.Easy to set up and carry with you. We take it on vacation.Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "tech-ninja"}]