[{"rating": 5.0, "review": "I bought this for a gift, so I can't comment on specifics. Was told it was easy to set up and simple to use. Tons of movies and content if you are a Prime member. Has worked perfectly so far!", "verified": true, "helpfulness": "0/0", "author": "D.M. \"online shopper\""}, {"rating": 4.0, "review": "Just what I was looking for thank you", "verified": true, "helpfulness": "0/1", "author": "Dennis Howard"}, {"rating": 5.0, "review": "easy to work worth", "verified": true, "helpfulness": "0/1", "author": "Patricia B."}, {"rating": 5.0, "review": "I love it so much thank you very much", "verified": true, "helpfulness": "0/1", "author": "jan henry"}, {"rating": 5.0, "review": "I haven't had much time to play with it but so far I love it.  The picture seems better than when I would stream from my PC.  Watching movies it is fast and clear.  If you don't have a smart TV this is the next best thing.Setup took me about a minute, couldn't be easier", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "William Brugger"}, {"rating": 5.0, "review": "If you like movies and remember old ones that you want to see get this ASAP!  For a long time I had remembered seeing \"Paper Moon\" starring Ryon O'Neil and his daughter Tatum, but could never find it to watch.  That changed when I bought the \"Firestick.\"  Now I have access to almost any movie I want to see again. Easy to install and operate - Get it!", "verified": true, "helpfulness": "0/0", "author": "EDMOND P. LULL \"Edmond P. Lull\""}, {"rating": 5.0, "review": "love  it", "verified": true, "helpfulness": "0/0", "author": "PROVIDIAN"}, {"rating": 5.0, "review": "We needed something for our guest room tv beyond just a DVD player. We looked at the major streaming sticks (Fire Stick, Roku, and Chromecast). We loved the idea of using an app on your phone to control Chromecast but that may have made it difficult for guests. On the other hand we have 2 young kids who are obsessed with losing remotes, so we didn't like that Roku didn't offer the app to control it. We found the Amazon Fire Stick to be a perfect happy medium, both in price and in the feature we were looking for! So far we haven't been disappointed. Great picture quality and speed. So far were very happy with our purchase!", "verified": false, "helpfulness": "0/0", "author": "S. Peterson"}, {"rating": 5.0, "review": "Love it. Worth every penny.", "verified": true, "helpfulness": "0/1", "author": "ward1999"}]