[{"rating": 5.0, "review": "This product is the best. While I loved watching movies on my Kindle Fire, it is even better watching them on my television. This is great!", "verified": true, "helpfulness": "0/0", "author": "Jeanette Roberts"}, {"rating": 4.0, "review": "Arrived BEFORE promised..  setup wasn't \"quite\" as easy as I thought, and I'm computer/network experienced, however after only 20 minutes of working through connecting Fire Stick to home wi-fi network, all went well and the gift for xmas has been used several times since !", "verified": true, "helpfulness": "0/0", "author": "Michael K. Kennedy"}, {"rating": 5.0, "review": "Received it as a Christmas gift. Easy to set up -- nearly automatic, except for having to choose HDMI 1 or 2 on TV set. Great access to a variety of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Chav"}, {"rating": 3.0, "review": "You should call this WIRELESS Fire TV Stick, if you got a wired connection IT WON'T WORK. I wasted 2 hours before I read the small print, and realized you need a wireless connection... WIRED won't do. So don't order if you are like me, and think Amazon is honest, wireless should be in the name, and not in the description.I first thought it was a USB stick... my bad...then when it was hdmi stick, then I went to hook up to the TV, and found out it needed a wireless connection, so then I checked Amazon and found that they said I needed a wireless connection.SO I'M telling this to AMAZON, you need to call it Wireless FireTVStick", "verified": true, "helpfulness": "0/0", "author": "2rain"}, {"rating": 5.0, "review": "I absolutely LOVE my Fire TV Stick!!! I was able to set it up in a few minutes and was watching Netflix within 20 minutes!!", "verified": true, "helpfulness": "0/0", "author": "Tammy Nates"}, {"rating": 5.0, "review": "I love it. Specially the ability to side-load android applications on the device, gives you freedom of even installing the XBMC on the device and enjoy it.", "verified": true, "helpfulness": "0/1", "author": "hadi kenarangi"}, {"rating": 1.0, "review": "Not impressed with it.", "verified": true, "helpfulness": "0/2", "author": "Mariana"}, {"rating": 5.0, "review": "Great so easy to use love the selections.", "verified": true, "helpfulness": "0/0", "author": "Ms Kaufman"}, {"rating": 5.0, "review": "I got my Stick, and the set up was so easy.  I have a similar gadget and never could get the thing to work. I was up and going in 2 minutes.  Picture is clear. It is cool to speak and have it pull up my movie, without looking for it.  So long searching.", "verified": true, "helpfulness": "0/0", "author": "Bea"}, {"rating": 5.0, "review": "love", "verified": true, "helpfulness": "0/0", "author": "Stephen D Ledbetter"}]