[{"rating": 1.0, "review": "Be aware, if you do not live in the U.S. A. this fire stick won't work. So don't purchase if you don't reside in the US. Only Netflix is accessible, so it wasn't a complete wasted purchase. Marketing division/department at Amazon please inform the general public of ALL your devices which only work if you live in the US. It is mandatory that all Amazon users know this since folks such as myself cannot return any purchases.", "verified": true, "helpfulness": "0/0", "author": "lori"}, {"rating": 5.0, "review": "Better than roku", "verified": true, "helpfulness": "0/0", "author": "Stephen E. Farlow"}, {"rating": 5.0, "review": "Great for the TV, games, music and movies! The gang love it. I got it for when the cable TV goes out.", "verified": true, "helpfulness": "0/0", "author": "Jack_This"}, {"rating": 4.0, "review": "The fire stick has been great. I just wish I could get access to HBO now. While HBO GO is great, I don't have cable and this is my go-to mechanism for shows etc. I can get HBO NOW on my computer and phone as well as tablet, but stinks that I can't get it on the big screen.", "verified": true, "helpfulness": "0/0", "author": "jloki"}, {"rating": 5.0, "review": "fabulous product, we absolutely love it!!", "verified": true, "helpfulness": "0/0", "author": "dianne harrison"}, {"rating": 5.0, "review": "We got several sticks (Roku, chromecast, gbox) and of all I prefer the fire stick. After the fire stick I would get the Gbox Midnight 2. The fire stick just comes ready, plug and play. The chromecast  stopped working after I decided to change TVs. The Roku cannot play my movies and I cannot download apps.", "verified": true, "helpfulness": "0/0", "author": "Alicia Gimenez"}, {"rating": 5.0, "review": "Fun family devices", "verified": true, "helpfulness": "0/0", "author": "Steve Renfroe"}, {"rating": 5.0, "review": "Amazing 5 Stars.", "verified": true, "helpfulness": "0/0", "author": "kenneth high"}, {"rating": 2.0, "review": "Not as good as I thought it would be so I have gone back to my chromecast it gives me more of what I was looking for..", "verified": true, "helpfulness": "0/0", "author": "Ray Regan"}, {"rating": 5.0, "review": "Love my fire stick. Works great.", "verified": true, "helpfulness": "0/0", "author": "joy"}]