[{"rating": 2.0, "review": "Even when it says my network connection says \"very good, connected\", rarely do any of the apps connect or work properly. Netflix rarely connects, and when it does, it drops after a few minutes of watching a show. I've tried all the troubleshooting techniques, so I'm hoping it's just a bad equipment issue and I can replace it with another one.", "verified": true, "helpfulness": "1/2", "author": "Corey"}, {"rating": 4.0, "review": "It's great, I only have one issue with it. I an a subscriber to Dish TV, and the Dish wires are plugged into my Samsung tv in the  port in the back marked 1 so I had to put the Fire Stick on port 2 , by doing this I need the Dish remote , the Samsung tv remote and the Fire Stick remote do I need to use 3 remotes for different functions to operate the FireStock.  I need the Samsung remote to change source from Port 1 ( Dish tv) to source port 2 to activate FireStick, then the Dish remote for volume control. I am quite sure there may be a fix for this bUT I don't know if it is something Amazon can tell me how to fix or I need to contact Dish TV about a fix. I know I need the FireStick remote for Fire tv, 9 just wish I needed to use only 1 more remote for the rest of my needs.", "verified": true, "helpfulness": "0/0", "author": "Richard Martin"}, {"rating": 4.0, "review": "I would first like to state that I got the Fire Stick for $20 when it was on sale for prime members. Therefore, I will be doing my review based on that price point.Set-UpThe set up was so easy a cave man could do it (Geico Commercial). Since this device is really made for Prime members it came with my account already connected to the device. That is not to say that you can't give this as gift because you still need to enter your password. It just really helps to make the set up quick and convenient. The moment you plug the device into the TV it gives you a series of quick introductions and helps you set up the wi-fi and before you know it you can start using the stick. The only thing I would be careful with is make sure that you have a wall outlet ready. Even though in theory you can plug this into the TV, Amazon recommends a wall outlet to ensure enough power for the device. This may or may not affect the device performance.TV Stick vs. ChromecastThe device itself is very similar to the Google Chromcast in that it supports many of the same features such as Netflix, Youtube, and other apps. The big difference would be that this is obviously made for Amazon Prime members. This means that watching prime videos or listening to prime music is super easy as Amazon has built this into their menu. One of the downsides however, is how the Prime music is set up. Currently there is no option to play all Prime songs. Instead the user must add the songs from a computer onto their play list before playing on the TV. Hardware wise however, the Fire TV stick is better since has it has more ram and a better processor. This made using the remote very responsive as there is no lag. In addition, having the remote itself is a very nice feature that I think should be included with any device such as this. The remote does not support voice search, but it is very simple and makes navigating the menu very intuitive. If voice search is important you can buy an additional remote or install an app on your android/IOS device for the feature.ConclusionIn the end I must say that this device is really worth the $20. The menu is fluid and easy for anyone to use. My only wish was that it had the capability to mirror screens with any device such as a PC or android phone instead of only Amazon devices. Even at the $40 price point it is not a bad device. The Chromecast is at a similar price point (about $30), but is not as well built for prime videos/music.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "Amazon products are Great!", "verified": true, "helpfulness": "0/0", "author": "William Oslund"}, {"rating": 5.0, "review": "This is a great bit of technology.  Simple to install. Simple to use.", "verified": true, "helpfulness": "0/0", "author": "C-Val"}, {"rating": 5.0, "review": "I have really enjoyed using the Fire TV Stick.  It has allowed me to see shows my friend's had been talking about.", "verified": true, "helpfulness": "0/0", "author": "Melinda Moore"}, {"rating": 5.0, "review": "LOVE IT, NOW I CAN ENJOY WATCHING MOVIES IN MY BEDROOM.", "verified": true, "helpfulness": "0/0", "author": "GLADY"}, {"rating": 4.0, "review": "Great product. Easy to install. Easy to use. Only downside is my cable provider (comcast) doesn't currently allow my cable services to be available through this device.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Very pleased. It did everything what I've expected. The setup video was helpful and easy to follow.", "verified": true, "helpfulness": "0/0", "author": "Milorad Matejich"}, {"rating": 5.0, "review": "What a great product! Definitely beats the Chromecast we had before it.", "verified": true, "helpfulness": "0/0", "author": "Anat and Yossi"}]