[{"rating": 5.0, "review": "Like it great product and price", "verified": true, "helpfulness": "0/0", "author": "JPO"}, {"rating": 5.0, "review": "This is great little device, and I was one of lucky few who ordered it when it was out for $20 promo. I hooked this up today, and it was working great in 5 minutes. It may not have all the bells and whistles as the Fire TV, but it still packs a punch. I would recommend this to anyone who wants a small portable device to take with them anywhere. You don't even have to have an extra outlet for it as it can plug into both you TV or and outlet. Amazon recommends using the outlet, so I would go with that option first and foremost, but if need be, it can plug right into your TV for power. The remote is great, and I don't even miss the voice feature as I don't use it much on my Fire TV much anyway. Setup was easy as pie, and my boys love it. I bought it for their room and for taking with us when we go camping. They really like it for not just the video streaming but for the gaming. It does not support all the games that Fire TV does, but they do have enough to keep my boys happy. Who needs a gamebox anymore, when their more than enough mobile games out there. I would not even think about buying a gamebox ever again. At the current price, I still think this is well worth it, just as the Fire TV is. They are better than other device I have used in the past, and because they are sold by Amazon, you get the great customer service I have come to enjoy over the years.", "verified": true, "helpfulness": "0/0", "author": "James Bennett \"Second star to the right, and straight on till morning\""}, {"rating": 4.0, "review": "Perfect replacement for a smart tv. Since, it uses wifi takes a while before the picture quality gets better. Other than that comes with loads of appsand easy to install any Android apk", "verified": true, "helpfulness": "0/0", "author": "Sudhir"}, {"rating": 1.0, "review": "I was initially very happy with the Amazon fire stick and found the search and interface easier to use and the remote more responsive then the Apple TV I was hoping this device would replace. Unfortunately after 3 weeks of use the remote became unresponsive which renderes the firestick completely useless. No improvement was made after checking wifi signal, rebooting device and changing remote batteries so I will go back to using Apple TV which I have owned for over a year and have had no such issues with. Ease of interface and search function do not make up for lack of reliability with this device.", "verified": true, "helpfulness": "0/1", "author": "Ceenstars"}, {"rating": 5.0, "review": "So far so good!", "verified": true, "helpfulness": "0/0", "author": "Cathy Golden"}, {"rating": 5.0, "review": "I enjoy using this, though am disappointed of it's lack of native ability to be used to project a screen from a computer.", "verified": true, "helpfulness": "0/0", "author": "Eric Lang"}, {"rating": 1.0, "review": "Received the product yesterday. Went through the setup process, installing Netflix and signing in. So far so good. Try to play something... Displays \"HDCP content not authorized\". Seems like it's not compatible with TV older than 5 years. Hell if I'll replace my Sony XBR6 because of some badly designed streaming stick. Returning the Fire TV Stick and will replace it with a Roku or Chromecast. Very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Jennifer Beaulieu"}, {"rating": 5.0, "review": "Awesome. Turns your tv into a smart tv for $40. Love it!", "verified": true, "helpfulness": "0/0", "author": "Brandi Carroll"}, {"rating": 4.0, "review": "Everyone has one to offer, and each of them have their own advantages and disadvantages. Google was first then Roku and finally Amazon. Amazon certainly learned from its peers but stopped a little short on the last lap. Google surpasses with app selection, Roku has the best user interface and Amazon has all of its vast content @ your fingertips. If you're an Amazonian  there is no question about getting this device. I have all of the above plus a Roku 3 and the only thing stopping me from getting an Amazon Fire Tv is Vudu. This stick however beats its competitors by sheer processing power, better connectivity and clean content(I feel like Roku is like walking into a flea market)", "verified": true, "helpfulness": "1/1", "author": "DMC \"DMC\""}, {"rating": 5.0, "review": "So easy to use and even with my slower dsl it is extremely fast with virtually no lag. Extremely satisfied at this point and purchased it with intent to cut back on my dishnetwork subscriptions which I can certainly do at this point. I installed the fire tv remote app both on my kindle and android smart phone and the voice search works very well on both as do the controls on the app. Would recommend anyone purchasing the fire stick to download the remote app to your Kindle and android smart phone. Plan to soon purchase the game controller for it to keep grandkids happy and entertained.", "verified": true, "helpfulness": "0/0", "author": "Duane Gee \"Cajun54\""}]