[{"rating": 5.0, "review": "works great, easy hookup, already recommended to family member", "verified": true, "helpfulness": "3/3", "author": "Donna Wilson"}, {"rating": 2.0, "review": "I can play vudu movies", "verified": false, "helpfulness": "1/3", "author": "Omar G."}, {"rating": 4.0, "review": "This little stick is awesome but I'm only going to give it 4 stars for now because some of the software needs a little work like youtube, even though I can sign into account I can't see play list and that sucks also my biggest complaint is the remote why did Amazon not add two more button like a original nintendo controller it would have been so much better for casual gaming, and the more hard core gamers could have bought the controller separate.", "verified": true, "helpfulness": "3/3", "author": "Wulfbat"}, {"rating": 5.0, "review": "We got our Fire TV Stick in early December and have been using it since then. So far, I like it a lot. We use it mostly for Netflix and Amazon Prime Videos, but I also love that I can show off pictures and videos from my phone or tablet easily by using the Amazon Cloud Photo app. That feature makes it nice to show pictures and videos to family when they come over and want to see pictures from our kids' recent activities. I also love that there is a remote app available for when the little remote gets misplaced or when I just don't want to carry it around. I can stop what I'm doing and change a show for my kids just using my phone...love that. The only thing I don't like is that it does freeze up from time to time, but it doesn't happen often enough to make me put it at 4 stars instead of 5. Also, it's worth noting that we only use this about 3 evenings a week. If we used it more, it might have more freezing problems or might be more annoying.", "verified": true, "helpfulness": "2/2", "author": "S \"Mommy to 3\""}, {"rating": 5.0, "review": "Very happy and pleased with the Amazon fire tv stick. It exceeded my expectations", "verified": true, "helpfulness": "2/2", "author": "Cheryl Bosley"}, {"rating": 5.0, "review": "the fire stick is amazing  product and you must remember to let it sleep to work better and not let it over heat, I love it!!!", "verified": true, "helpfulness": "2/2", "author": "Willa"}, {"rating": 4.0, "review": "So far it has worked okay. It does buffer a lot and even though we have a strong router. It also gets blurry once in a while. I don't have anything to compare it to. If we use this enough I might try Roku for our other tv.", "verified": true, "helpfulness": "2/2", "author": "Liz"}, {"rating": 5.0, "review": "If you want to cut the cord with the cable company, this is the scissor. I have two tv's with fire stick and i could not be happier. I use my phone company for internet service, and my phone bill is cheaper with internet. Go figure. I love it's ease of use and all of the content that is now availble.", "verified": true, "helpfulness": "4/4", "author": "Valerie A Mann"}, {"rating": 5.0, "review": "I love them.  My kids n I really enjoy watching the program.", "verified": true, "helpfulness": "2/2", "author": "Felicia Tate-William"}, {"rating": 4.0, "review": "Works great, easy to get started", "verified": true, "helpfulness": "2/2", "author": "Michael Garcia"}]