[{"rating": 3.0, "review": "This is a great device if you are familiar with Amazon Prime video services however I was disappointed I the fact that this has to be plugged into another power source. The main reason for purchasing the stick was so that I wouldn't need the extra cords. The rest of the interface is as expected but it uses too much power for a dongle.", "verified": true, "helpfulness": "1/1", "author": "Brian Wright"}, {"rating": 4.0, "review": "its ok", "verified": true, "helpfulness": "0/1", "author": "romel hernandez"}, {"rating": 1.0, "review": "I'm pretty irritated with Amazon and the FireTV Stick. When I first saw it i thought it was awesome (I'm a prime member so I got the early order discount which was also a bonus). I travel extensively for work so thought this would be a great way to keep up with my shows etc. Before I bought it I made sure to read the compatibility with iOS and it stated that it would work with both android and iOS phones.I've just set it up and low and behold there is no iOS app, but rather one \"coming soon\" which could mean a week or a year. I gave it one star because although it still does everything pretty well, the real reason I purchased it was so I could stream shows from my phone to the FireTV stick (there are certain apps no on Amazon app, such as Acorn TV). I'm a long time prime customer and this is the only real issue I've had with Amazon. Ironic that it's with their own product.", "verified": true, "helpfulness": "2/4", "author": "Jakes \"Jakes\""}, {"rating": 2.0, "review": "Doesn't mirror PC even tho it can find the device", "verified": true, "helpfulness": "0/0", "author": "Josiah"}, {"rating": 2.0, "review": "I love Amazon, but so far this Fire stick keeps making buzzing sounds and it looses connection to the internet occasionally, and sometimes it freezes, and sometimes the remote stops working.", "verified": true, "helpfulness": "3/4", "author": "Ray"}, {"rating": 5.0, "review": "Hands down the best product that I have purchased by Amazon. The Fire TV Stick blows Google Chromecast out of the water. Seamlessly streams movies, music, and can project all of your pictures directly to your TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Multiple tries but always stuck at \"waiting for update\".  Lost internet connection for every device in house and had to reset.  No technical support so checked on line reviews.  Looks like the TV we wanted to use it for could be too old to work with FTS software.  That is information that would have saved a lot of people a lot of aggravation.", "verified": true, "helpfulness": "3/4", "author": "DG"}, {"rating": 3.0, "review": "The Fire TV Stick provides an acceptable alternative to its competitors. However, the lack of apps available for the device, excluding ubiquitous ones such as Netflix, will hinder its ability to deliver content. Until more developers port their apps to this device, it is recommended that other alternatives be retained to make up for the Fire TV Stick's shortcomings.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Would give 5 stars if the power for the fire stick would work if i plug it into a USB port on tv and device always says use original power cord provided for better performance even when I use the provided power cord. But the fire stick is worth it if you use amazon prime", "verified": true, "helpfulness": "0/0", "author": "Dustin"}, {"rating": 5.0, "review": "Just as expected. Would buy it again.", "verified": true, "helpfulness": "0/0", "author": "P. Price"}]