[{"rating": 5.0, "review": "Very easy to use, works great!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jesse Carroll"}, {"rating": 5.0, "review": "Fire stick is the solution that finally works for mirroring onto TV. GREAT PRODUCT!", "verified": true, "helpfulness": "0/0", "author": "terry phalen"}, {"rating": 5.0, "review": "Awesome for the family!", "verified": true, "helpfulness": "0/0", "author": "janco809"}, {"rating": 3.0, "review": "It is works good", "verified": true, "helpfulness": "0/0", "author": "Putter22222"}, {"rating": 5.0, "review": "I really like the Fire TV Stick because it has a lot of apps and you can use it on any tv.", "verified": true, "helpfulness": "0/0", "author": "Analy Aguilar"}, {"rating": 2.0, "review": "It connects to WiFi if the router is in the same room. Shows network with great signal, but will not connect unless I plug it into a room in the same room.", "verified": true, "helpfulness": "0/0", "author": "sarah armet"}, {"rating": 4.0, "review": "Bought this for my daughter's room.  She loves it.  Easy to use, quality of the picture is great.  Didn't know you could play games on this thing... That was an unexpected bonus!", "verified": true, "helpfulness": "0/0", "author": "RkH \"Hauzy\""}, {"rating": 5.0, "review": "Awesome. Upgraded my clunky smart TV to fire stick. Way smoother operating system.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Magdziasz"}, {"rating": 3.0, "review": "The stick itself works out of box. But the setup process was a bit awkward and cumbersome (it ain't no Apple). But once you get past that, the unit works almost as promised by Amazon.Pros:1) Plenty of content2) Easy to navigate and figure things out3) Nice & tiny4) Depending on your TV, you can simply wake up your FireTV Stick by clicking on its remote without turning on the TV, and the stick will power on the TV AND switch to the right channel with you ever having to touch the TV remote. This is a great shortcoming of AppleTV.5) OTA (over the air) software updates6) Access to shows that aren't available on other devices (or will likely cost you extra)Cons:1) The design of the power-in port is stupid and lacks empathy for the user -- It's on the top side of the stick where it'd interfere with other HDMI ports. The most ideal place would have been at the narrow end of the stick. But Amazon did include a HDMI extension unit to remedy the issue. But that seems like a waste of resources had they just designed the power port the right way.2) The stick is probably underpowered (or simply doesn't know how to buffer properly). There were times when a show I'm watching starts to lag and stutter for a few seconds. This almost never happens with an AppleTV.3) Most the \"app\" stuff aren't very useful to me. But this is an opinion, not an actual \"con\" per se.4) The remote is not as intuitive as AppleTV's. But otherwise it works fine.At the price Amazing is selling, this is a good product. But there's clearly still room for improvement on this device. Despite all the \"cons\", I'm keeping mine.", "verified": true, "helpfulness": "0/0", "author": "PowerAtom"}]