[{"rating": 5.0, "review": "we turned off our dirtectv 6 months ago and used our laptop hooked up to the tv to watch amazon prime and Netflix movies and shows. the fire tv stick is amazing, making watching tv so much easier! Love it!!", "verified": true, "helpfulness": "0/0", "author": "betsy rodgers"}, {"rating": 4.0, "review": "Fire stick is easy to install and easy to use.  Has a great variety of movies, games and TV shows. If your schedule allows time to watch enough movies, the price is good.  Sometimes reception isn't as good as other times and the movie has to keep loading.  Overall it is a good product.", "verified": true, "helpfulness": "0/0", "author": "lois hughes"}, {"rating": 5.0, "review": "This thing is awesome!! Easy to install and set-up. Remote works perfectly even though the unit is behind the TV. Can use more apps which I'm sure will come in time. WELL worth the cost.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Better than expected.  Easy to set up with excellent load times and minimal interruptions while streaming.  Works seamlessly with our mobile devices as well.  Access to a large amount of free content with good premium options as well.", "verified": true, "helpfulness": "0/0", "author": "Brandon Litzner"}, {"rating": 5.0, "review": "Very Nice! Quick and clean picture worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Terry Hicks"}, {"rating": 5.0, "review": "Love it!! Easy to use, very stable streaming player.", "verified": true, "helpfulness": "0/0", "author": "Cassidy King"}, {"rating": 3.0, "review": "Brings Netflix and HULU in much clearer and faster but its not easy to figure out what apps are free and what you have to pay for until youve downloaded the apps only to find out they are not free and you have to cough up the money or go through a process to eliminate the app", "verified": true, "helpfulness": "1/1", "author": "donald b stoney"}, {"rating": 1.0, "review": "Did not work with WiFI 15' away. Amazon support said that the WiFi needed to be in same room to work effectively. Wasted 2 hours trying to get it to work. Very disappointing.", "verified": true, "helpfulness": "0/0", "author": "Marmie"}, {"rating": 3.0, "review": "i'm kind of disolutioned. i wanted to like it, but it doesn't function at all with my 2008 RCA tv. it would flash the amazon logo for a split second and do nothing else at all. another customer complained about the same issue. amazon just thought it was defective and sent me another with the same issue. it works with the newer vizio just fine, but i wanted it for the tv that has no cable hook up. we had the kindle hooked up to it for a while but it's connected with an hdmi cable and even that has been finicky. so i think we'll be getting chromecast instead for the bedroom. too bad it doesn't support amazon instant video though. you win some you lose some i guess. not really wild about the kindle app either.  kind of would prefer something where i can see what's going on. with a toddler i have to start the same disney movie about 500 times a day, and come june i'll be strapped to a new baby and a pump while likely recovering from a csection so getting up for random things will kind of suck for a bit.", "verified": true, "helpfulness": "1/1", "author": "Liz"}, {"rating": 4.0, "review": "It is Muy bueno.", "verified": true, "helpfulness": "1/1", "author": "Corry Westinghouse"}]