[{"rating": 5.0, "review": "Great iteam!", "verified": true, "helpfulness": "0/0", "author": "Chris Green"}, {"rating": 4.0, "review": "awesome would recommend box instead of stick", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "100% recommended! You will love it. Our family use it every day and it truly has been a great purchase..", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "Works great!  Great purchase!", "verified": true, "helpfulness": "0/0", "author": "Ernesto D. Cortes"}, {"rating": 3.0, "review": "It's not quite as fast as I expected, in two ways. They brag about how there is more RAM and better wifi on this device when compared to the Chromecast. I have the Chromecast and I can safely say that both the interface and wifi are slower on the Fire TV stick. I never experience any sluggishness or buffering with the Chromecast, but I have with the Fire TV stick. That being said, I love that there are built in apps and a remote with this as opposed to the Chromecast. If a remote is important to you, this is definitely your devices.", "verified": true, "helpfulness": "0/0", "author": "Michael Arabitg"}, {"rating": 5.0, "review": "I love my Firestick.  I'm watching the new season 5 of Hell on Wheels and other amazon prime movies and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Marcia K Dietrich"}, {"rating": 4.0, "review": "I've got 2 fire sticks and a fire box...I love them...so easy to use...and I do love being able to side-load apps that I can't get via Amazon.  Would give it 5 starts if it had more storage for more app's", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "Great product.... A+++++", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install and use and a great way to get all the Amazon Prime videos to your TV.", "verified": true, "helpfulness": "0/0", "author": "M. Wilson"}, {"rating": 4.0, "review": "Works well. Good streaming device for the price. Hope to see more memory on future revision.", "verified": true, "helpfulness": "0/0", "author": "A. Mueller \"Deal Hunter\""}]