[{"rating": 5.0, "review": "Very nice & interesting, my question is can we use this technology alone with out depending on U verse or Xfinity or other companies?!", "verified": true, "helpfulness": "0/0", "author": "cooldrfred"}, {"rating": 5.0, "review": "Love the Amazon Fire TV Stick! Set it up in less than 5 minutes, The intro video was perfectly clear on how begin using it quickly. No problems with streaming HuluPlus, Netflix, etc. So far so good.Yay!", "verified": true, "helpfulness": "0/0", "author": "Sharon L Hackleman"}, {"rating": 5.0, "review": "The best $39 I have ever spent.  Like Roku but much easier.....I just have it on my TV and I never remove it......very easy to switch from TV to Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Swinging Granny \"Pam\""}, {"rating": 5.0, "review": "I am am blown away at how great this is. Seriously Schocked. Quick and easy, plug n' play. No delay in pix. Wow. Super easy remote. I download the app on my Droid. Not so great, the keyboard doesn't really work, but the voice search works great. Quite surprised at the additional apps ( free and no sign ups) that are included to watch old TV shows and didn't know PBS had an app! I can watch missed episodes from Masterpiece!It was either the Fire stick or a smart TV for my bedroom. We have a Smart TV in the living room (50\" Samsung) but the smart part is crap. Thus stick blows it away. My buddy has the Chrome cast stick and loves it. I chose the Amazon stick because I am an Amazon Prime member and it had great reviews. I am glad it did!", "verified": true, "helpfulness": "0/0", "author": "Franny Stevens \"to catch a thief\""}, {"rating": 5.0, "review": "Love it !  We use it with Sling TV", "verified": true, "helpfulness": "0/1", "author": "Deb Coe"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Hutch Johnson"}, {"rating": 4.0, "review": "There are many reviews on this so I won't bother.  If you have Amazon Prime, you might as well spend the small amount to purchase this.  The investment is minimal and you get a lot more for your money on Prime movies/show alone.  Plus, it has Netflix so you get the best of these two services.  As of Feb, 2015, I would like to see Sling TV and that will be my cord cutter moment.", "verified": true, "helpfulness": "0/0", "author": "Phu Ngo"}, {"rating": 5.0, "review": "Love it so far... Being a prime member has its perks.  I was tired of wasting my money on cable and satellite!", "verified": true, "helpfulness": "0/0", "author": "Jodi"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Cosmo J. Barbardo"}, {"rating": 5.0, "review": "Love this little device!  I am very pleased with the size, the features, and the capacity of applications.", "verified": true, "helpfulness": "0/0", "author": "K. DOWNEY \"Califberry\""}]