[{"rating": 3.0, "review": "The functionality is great.  I was anticipating more for free with my Prime account.  I shouldn't be too hard, there are plenty of options to see for free.  I just didn't anticipate the volume of stuff you'd need to pay for.  I was also surprise that the price of a movie is no different than my local cable company.", "verified": true, "helpfulness": "0/0", "author": "Mike \"Just a poster\""}, {"rating": 5.0, "review": "Bought for my GF who doesn't watch a lot of tv.", "verified": true, "helpfulness": "0/0", "author": "Devinnez"}, {"rating": 5.0, "review": "Love it see ya cable. Bought another. These reviews that state they loose connection? Have you noticed that it is on windy days? Well its your wi-fi . its a radio wave. Environmental conditions. Its the way to go the fire stick and run Netflix on it. Its great'", "verified": true, "helpfulness": "0/0", "author": "Carl W."}, {"rating": 5.0, "review": "I showed up later than promised but it works great I would buy it again", "verified": true, "helpfulness": "0/0", "author": "jeff harris"}, {"rating": 3.0, "review": "I want to love it.  Easy enough to set up.  It does a very weird lag thing where the audio continues as normal, but the picture freezes and then rapidly catches up.  I feel bad for anyone who is medicated!! Lol", "verified": true, "helpfulness": "0/0", "author": "MELISSA BAIKIE-RICK"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "gypsy"}, {"rating": 5.0, "review": "You need this!Even if you don't have Amazon Prime, you can still use it for all kinds of video and music streaming.It's an amazing value for what you get, even if you already have a HTPC setup, the menu system & simple remote will have you going back to using this as your main viewing device.It also works great with the newer style Computer monitors that have a HDMI port and an Audio out port built in, so you can turn your monitor into a streaming TV to save space in a smaller room.", "verified": true, "helpfulness": "0/0", "author": "N. H."}, {"rating": 3.0, "review": "Only worth it if you have the ability to log into apps like HBOGO and ShoTime... Some apps, like History Channel, have a limited number of ways to sign in, so if you have DirecTV, you can't use the full History Channel or A&E; App's... Keep that in mind when ordering them. I honestly don't think this would be worth even $39 if you can't sign in to get full access to these apps.The only thing I wish I could have is access to the WD My Cloud App so I could stream audio/video from my 2tb WD My Passport Wireless Hard Drive. It lets you download the VLC Player App, but I can't figure out how to import any .mp3, .avi, .mp4, or .mkv files from my personal library.If I could get rid of my WD My TV Live and use the Fire TV Stick as my only media player, I'd give this a 5 star review.", "verified": true, "helpfulness": "0/0", "author": "ShojoBakunyu"}, {"rating": 5.0, "review": "It works great with perfect mirroring!", "verified": true, "helpfulness": "0/0", "author": "Adonas"}, {"rating": 4.0, "review": "It's ok. It's growing on me. Wish the apps already came pre downloaded like the Apple TV...", "verified": true, "helpfulness": "0/0", "author": "Rochelle"}]