[{"rating": 4.0, "review": "5 stars if you don't force me to sideload Kodi.", "verified": true, "helpfulness": "0/0", "author": "NullDivisor \"Everyday Extraordinaire\""}, {"rating": 4.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "Lilybell Vargas"}, {"rating": 5.0, "review": "amazing!", "verified": true, "helpfulness": "0/0", "author": "Sara Beard"}, {"rating": 2.0, "review": "Can't figure how to use it. Not as easy as advertised.", "verified": true, "helpfulness": "1/1", "author": "Joycelyn C. Cain"}, {"rating": 4.0, "review": "It wa easy to install.  I would give 5 stars but I have not explored all available options.  I did notice that the free movies are very old (1990@up).  I would like to see more recent releases under prime membership and are free.  I will admit that I have some movie watching to catch up on and all the TV specials and series. I works foe me!!", "verified": true, "helpfulness": "0/0", "author": "Drue Hill"}, {"rating": 3.0, "review": "Could have a few more options for ease of use. Would be nice if certain programs I know of which provide current movies free of charge were available. Would like it if more of Amazon's offerings were available free of charge to those of us who have this product and Prime membership. Otherwise, it's a good product at a reasonable price. I enjoy being able to access Netflix without connecting to a computer, and so far Bosch is ok,if not necessarily satisfying.", "verified": true, "helpfulness": "0/0", "author": "PMG Cali \"Paulette Garces\""}, {"rating": 5.0, "review": "Awesome! My Dad 56, Loves this. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "SUSAN AMOR"}, {"rating": 1.0, "review": "Yes there are alot of shows, movies and apps. But alot of them are $2.99 an episode or more. Some you have to login with your cable or satellite provider to watch. Even with Amazon Prime, Netflix and Hulu Plus.", "verified": false, "helpfulness": "2/3", "author": "Michael Shawn Adams \"atexn4christ\""}, {"rating": 5.0, "review": "No complaints, easy to set up easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install and use meets expectations", "verified": true, "helpfulness": "0/0", "author": "Chris"}]