[{"rating": 5.0, "review": "My only complaint so far is that there does not seem to be a way to search just my prime music for songs. You have to look through either artists or albums alphabetically to get to the song you want.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was everything it claimed to be. Extremely easy to set up and once that is done, just enjoy your movies! The price is right too!", "verified": true, "helpfulness": "0/0", "author": "Linda Carpenter"}, {"rating": 5.0, "review": "Works great . Easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "ken"}, {"rating": 5.0, "review": "Easy set up and navigation", "verified": true, "helpfulness": "0/0", "author": "J. Frost \"frosties\""}, {"rating": 5.0, "review": "I bought this last fall when they offered it to Prime members for $19.. We have a fire tv in our den, which we really like, so I went ahead and got this one.. I have to admit, I didn't hook it up for months.. then we decided to cut the cord with Dish, so I hooked it up to the bedroom tv and boy do we love it. The instructions are very straight forward and easy to follow..I had it hooked up within 30 minutes..It works great. We subscribe to Hulu Plus, showtime, Netflix, and Amazon Prime, so we have a large variety to watch. My only complaint is that we can't pick up CBS all access with it.. If the fire stick came up with an agreement with CBS, it'd be absolutely perfect..", "verified": true, "helpfulness": "0/0", "author": "Karen \"Karen of Northern Michigan\""}, {"rating": 5.0, "review": "this thing is like magic.", "verified": true, "helpfulness": "0/0", "author": "G. Paige \"Cody Broken\""}, {"rating": 1.0, "review": "What a let down, this device functions so slow. I bought this mainly for using PLEX, this thing forces you to make an account to use your local plex server and keeps promoting you to pay for plex. I started playing a video and it pauses a ton. It also will not stream movies from prime without issues saying slow internet connection. I tested my Roku doing the same things and there were no issues. After that I decided to return it. It had only been plugged into my tv for 45 minutes, this thing was so hot I could barley hold it. Maybe that is why it is called the fire stick because it can probably start a fire in your home. I will be buying a second Roku.", "verified": true, "helpfulness": "0/1", "author": "Turtleman"}, {"rating": 5.0, "review": "Awesome. Can't believe I waited so long to get this!", "verified": true, "helpfulness": "0/0", "author": "Trish P"}, {"rating": 3.0, "review": "Would be 5 star but.... I had 7 TV's and had it hooked up to one and it worked great. Gave that TV to my mother and guess what? it doesn't work with the other 6. Why? because somehow none of them are HDCP compliant so I get sound but no picture.They need to fix that BS. Luckily I got one for $20 on a sale. it was great while it lasted but I am not happy. Highlight that in bold on the tech details so I would then no that was important. I'm not a tech guy and I'm not happy at all. tech support was great and tried everything to help but nothing worked. FIX IT!", "verified": true, "helpfulness": "0/0", "author": "J. White \"Kindle reading maniac.\""}, {"rating": 3.0, "review": "I've used this with Amazon Video and Netflix. The wireless remote and iPhone apps are great. Setup was easy, it responds quickly and feels responsive. This is a vast improvement over Roku's terrible TV stick. That thing was painfully slow, awkward and requires a credit card for basic setup. Google's Chromecast stick plays video better than this, but it doesn't have a dedicated remote or Amazon Video.When playing Netflix, the video sometimes freezes and jerks a few seconds every 10 to 15 minutes. It looks like Fire TV is causing the problem. My WiFi and cable modem work perfectly and Fire TV is less than 10 feet from the access point. On the same TV, Google's Chromecast plays Netflix perfectly.", "verified": true, "helpfulness": "0/0", "author": "Elderberry Dogs"}]