[{"rating": 5.0, "review": "Love this! Love the parental controls...pin number to purchase or download anything, even if it's free! Picture is super crisp. So much better than hooking up my computer to my tv with an hdmi.", "verified": true, "helpfulness": "0/0", "author": "Christine B."}, {"rating": 5.0, "review": "It exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "troy dworning"}, {"rating": 5.0, "review": "this is awesome. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "sandra thorndike"}, {"rating": 3.0, "review": "I expected much more free viewing with my prime account.  95% of what we want to watch there is a charge.  I'm disappointed.", "verified": false, "helpfulness": "0/0", "author": "Cornerstone C."}, {"rating": 5.0, "review": "I love this.  Much easier to use than the apps found on my blue ray player.", "verified": true, "helpfulness": "0/0", "author": "Michael Young"}, {"rating": 5.0, "review": "Love it! It has given us so many opportunities for movies and TV. Thanks AMAZON!!!", "verified": true, "helpfulness": "0/0", "author": "Lisa Bradley"}, {"rating": 4.0, "review": "I like this a lot. I have it hooked up through my Yamaha receiver, not my tv.  Works great. Only downside is I can't get audio from it for a different zone on the receiver. I could if I paid $3000 for a new receiver that has that capability but can't figure it out otherwise. I do wish you could add your own apps to it instead of using the ones that come with it.", "verified": true, "helpfulness": "0/0", "author": "Celeste"}, {"rating": 5.0, "review": "excellent product!", "verified": true, "helpfulness": "0/0", "author": "Jeremy Stanek"}, {"rating": 4.0, "review": "The Pros:The device itself works great.-Amazing interface-Fantastic picture quality-By far the best way to watch SlingTV and Amazon Instant Video.-Haven't encountered any glitch issues-Hard to beat in this price range (especially with the SlingTV deal, hard to complain when it's free)The Cons:-The remote is junk, it doesn't even work from 2 feet away. I can't believe they are even shipping these remotes with the device. They need to fix this issue, because a remote that won't work from even a foot away is worthless. On the positive side, my TV remote works fine with the Fire Stick and there is also an app for your phone that works pretty good as well.-With the HDMI extension, the device sticks out from the side of my TV and looks a little disorganized.", "verified": true, "helpfulness": "0/0", "author": "Analogue Junkie"}, {"rating": 5.0, "review": "Works wonderfully so far. Very easy to get started and set everything up, userflow is superb. Only critique is that I didn't see anywhere that says it needs to be plugged in while using, so there was a bit of a scramble to find an empty outlet near the TV. Other than that though, truly enjoying the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "LadyKube"}]