[{"rating": 4.0, "review": "It is nice to have access to the movies.  Streaming uses our internet data usage quickly so we have had to up that usage which is costing about $25 more a month.  We were trying the Fire Stick so we could decrease our Direct TV bill, but as you can see that might be a wash.  We are still experimenting, although we find the movie channels on Direct TV don't have much to watch on a regular basis so the Fire Stick does give a lot more options.  We are finding some of the movies we want to watch on the Stick can not be streamed, but to rent them is cheaper than Pay per view.", "verified": true, "helpfulness": "0/0", "author": "schrek"}, {"rating": 4.0, "review": "Worked just as stated. Easy to use and set up. Would have had 5 stars if the remote would have been easier to open, literally needed to google it so I could get the batteries in", "verified": true, "helpfulness": "0/0", "author": "tracy harrison"}, {"rating": 4.0, "review": "need more prime movies", "verified": true, "helpfulness": "0/0", "author": "roger waibel"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "HENRY CARROW"}, {"rating": 5.0, "review": "I was looking for an Android HDMI stick I could use on any of my TV's for watching Netflix and side-loading Kodi (formerly XMBC). I bought an Android set top box for $100+ a year or so ago and this does basically the same thing for much less money. The remote is pretty simple, with no keyboard, which makes entering text kind of a pain, but downloading the Android application to my phone solved that.", "verified": true, "helpfulness": "0/0", "author": "Curtis V"}, {"rating": 5.0, "review": "The whole family loves the FireStick!Complete control with the FireStick app on any phone or tablet (android... not sure about the apple)", "verified": true, "helpfulness": "0/0", "author": "AmaTom"}, {"rating": 5.0, "review": "I've had it a couple of days and it works great so far", "verified": true, "helpfulness": "0/0", "author": "ken farnham"}, {"rating": 2.0, "review": "No one mention that you have paid to watch these movies.  Just brought  one of the fire stick and realize you only can watch certain movies for free as a trail, (like dah)everyone let it sees like it's free once you brought the stick.how about one time fee etc.", "verified": true, "helpfulness": "0/0", "author": "suzan forbes"}, {"rating": 5.0, "review": "So easy to set up and was enjoying programming a few minutes after receiving!!!", "verified": true, "helpfulness": "0/0", "author": "Nancy McCue"}, {"rating": 5.0, "review": "I love it and am still learning all the things I can do with it..I wish I could mirror the videos to my other rooms but have not figured it out yet or even if it is possible..Even if I cannot do that it is still worth the money..", "verified": true, "helpfulness": "0/0", "author": "suzy wellman"}]