[{"rating": 5.0, "review": "it is great works just fine and i love it for the price", "verified": true, "helpfulness": "0/0", "author": "john samberg"}, {"rating": 4.0, "review": "Getting used to it.  Like it..", "verified": true, "helpfulness": "0/0", "author": "Caryl Chrisse"}, {"rating": 5.0, "review": "Great product, working really well. Only if it cud have had a volume button too.. Else it's super", "verified": true, "helpfulness": "0/0", "author": "Saurabh"}, {"rating": 1.0, "review": "This didn't  operate as expected.", "verified": true, "helpfulness": "0/1", "author": "Ronco"}, {"rating": 4.0, "review": "I like my Amazon Fire TV stick! But sometimes it just stops playing and I have to unplug it.", "verified": true, "helpfulness": "0/0", "author": "Karmann Robbins"}, {"rating": 5.0, "review": "I absolutely love my Fire TV Stick.  It works seamlessly with my Prime membership.  I can fast forward 10 seconds at a time.  If I'm watching a series, I have the option to go straight to the next episode.  The remote is easy to use.  Amazon has great suggestions for me based on what I've watched already. It connects to my Netflix account. But probably the coolest thing is, when you pause your show, it shows you at the bottom of the screen the names of all the actors who are in that shot.  How many times have you sat on the couch trying to figure out the name of an actor?? Just press pause and the Fire Stick does the thinking for you.  Couldn't be happier with my purchase!", "verified": true, "helpfulness": "0/0", "author": "serenabena"}, {"rating": 5.0, "review": "Best thing ever!!", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "So nice, I bought a second one during the summer Prime Day Sale when the price dropped to $24. Works great and very small and discreet, hidden BEHIND the television set. Note, you DO have to plug this in to an outlet, so it is not entirely wireless. I have two AppleTVs, but I also really like the UI on this product.", "verified": true, "helpfulness": "0/0", "author": "R. B. ONEAL \"Loves life\""}, {"rating": 5.0, "review": "Smooth and easy to install. The prompts made it so quick, I was done and using it within 20 min.", "verified": true, "helpfulness": "0/0", "author": "MARIA MARTINEZ"}, {"rating": 3.0, "review": "Works mostely, if you use a galaxy tab 4 get the chromecast instead, the galaxy won't mirror through the fire stick", "verified": true, "helpfulness": "0/0", "author": "Chance m Bittner"}]