[{"rating": 5.0, "review": "Great purchase works as advertised", "verified": true, "helpfulness": "0/1", "author": "Shaq"}, {"rating": 4.0, "review": "It's a good device and adds value to having an Amazon Prime account", "verified": true, "helpfulness": "0/0", "author": "Kenny Boustead \"Kenny Boustead\""}, {"rating": 3.0, "review": "haven't used it long enough to form an opinion.", "verified": true, "helpfulness": "0/2", "author": "Jack E. Olden"}, {"rating": 4.0, "review": "We have a smart TV used mostly for watching Amazon and Netflix streaming, and the signal arrives via FIOS through an ethernet-connected router. Nevertheless, we have the occasional glitch in which the signal is dropped, and we usually have to turn off the TV and start from scratch to reconnect. Annoying! We bought the Fire TV Stick in hopes of avoiding this problem.So far--2 weeks--the Stick has performed reasonably well, although jumping from the TV remote to the Stick remote and vice-versa is inconvenient. And the black-on-black navigation ring and select button are impossible to see in a dimly lit room. One possible advantage of the Stick is that when we still have the occasional glitch, we don't lose the signal. Instead, the video stalls while the audio continues. After a matter of seconds, the video recovers and races until it catches up with the audio again. Disconcerting, but less inconvenient than having to turn off the TV.", "verified": true, "helpfulness": "1/1", "author": "Stue Potts \"shippee\""}, {"rating": 5.0, "review": "So glad that I bought this! I never watch \"regular \" tv anymore!", "verified": true, "helpfulness": "1/1", "author": "Rob Carman"}, {"rating": 2.0, "review": "it doesn't say if you are suppose to leave the fire stick plugged into the wall. The only thing it shows you is plugging it into the TV, but it doesn't show whatto do with the other end. Is the USB cable just to charge the stick. I thought this was suppose  to be wireless. I can't really see the difference.  CAN I PLUG IT INTO MY NOTE BOOK AND IF SO HOW?  HELP PLEASE", "verified": true, "helpfulness": "0/1", "author": "Kathleen M Ives"}, {"rating": 5.0, "review": "So much fun to be able to access my Netflix account, along with my Amazon Prime account, right on my tv, great product!!", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 2.0, "review": "I had a 29 inch Smart TV in my bedroom and wanted to upgrade to a larger TV.  I found a great deal on a larger TV but it was not a smart TV.  I ordered the Firestick and it has been nothing but a pain in the butt.  At least 4 times a week I get connected with problems.  I have to delete the connection and reconnect.  So annoying.  I also have a Roku in another room and works so much better.  Wish I would have bought a Roku instead.", "verified": true, "helpfulness": "0/1", "author": "Robert Miller"}, {"rating": 5.0, "review": "Very easy to connect and I like it better than my Apple TV", "verified": true, "helpfulness": "0/0", "author": "S Fl homeowner"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Elianne Tejada"}]