[{"rating": 1.0, "review": "I was so excited to get this stick. We just downgraded our cable and kept our high speed internet and then purchased this stick. The first day I plugged it in I had problems. I called the help number and they did help me in getting the stick to work and to stay connected to the Internet. This worked great all day and night, the next morning....and then started having major internet issues again. It kept dropping the connection. I called Amazon and they said it was on their end and their connection seemed to be like a roller coaster. I had asked if there were others complaining of the same issue and he said yes, quite a few actually. So I am returning this and just bought the Roku 2. Love it. Haven't had one issue yet.", "verified": true, "helpfulness": "0/0", "author": "Danielle Vanallen"}, {"rating": 5.0, "review": "I would highly recommend this product to any one looking to make there TV a smart TV without spending a lot of money. Does a great job of delivering content to all my TVs.", "verified": true, "helpfulness": "0/0", "author": "Pete Giron \"Wake up with a coffee of greatness\""}, {"rating": 5.0, "review": "Amazing what I can watch without paying a fortune. Love my Amazon Firestick!!! Now taking full advantage of my Amazon Prime benefits!!", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 4.0, "review": "We bought this for our child so she can watch her shows in her room.  So far we like it but there are a couple things I wish they would improve.  Navigation is less than desirable.  It's very hard to find what you're looking for on there.  It isn't very intuitive.  Also, we haven't figured out a way to play a whole series of shows, one after the other.  Other than those two minor things (the last one may be user error), this thing is pretty sweet.  Netflix, Hulu, PBS Kids, and more are available.  The remote is nice a sleek looking too.  Works out great for what we wanted it for.", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 5.0, "review": "Great for easy access to online media.", "verified": true, "helpfulness": "0/0", "author": "suzanne0305"}, {"rating": 5.0, "review": "Thanks....", "verified": true, "helpfulness": "0/0", "author": "Pcitllc"}, {"rating": 5.0, "review": "I love my new Fire TV!  It's very easy to use and there are soooo many great apps!", "verified": true, "helpfulness": "0/0", "author": "Christine Engelman"}, {"rating": 5.0, "review": "I haven't watched cable t.v. since I bought the stick. Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Have two. Love them.", "verified": true, "helpfulness": "0/0", "author": "Debra L. Newlin"}, {"rating": 5.0, "review": "Works really well", "verified": true, "helpfulness": "0/0", "author": "Ginger Maynard"}]