[{"rating": 4.0, "review": "I am please with the firestick, and installing it was not too difficult either. However, I am disappointed with the Amazon prime moving selections. The movies I was interested in were all at a rental or purchase fee, that was actually higher than what is available through other movie rental options. When \"Amazon prime\" advertised over 4000 movies available, the implication was they were included in the cost of the \"Prime\" membership, but that is not the case. The one nice thing is that with the fire stick, at least I can access both \"Amazon Prime\" as well as the other movie rental system such as \"Netflex\" and \"Hulu\", so I don't have to change devices for those companies.", "verified": true, "helpfulness": "1/1", "author": "Sandra Robertson"}, {"rating": 5.0, "review": "When the daily programming is so yucky, the fire stick has been a really nice change, allowing us to select movies and tv programs we liked.", "verified": true, "helpfulness": "0/0", "author": "Diana Price"}, {"rating": 5.0, "review": "Absolutely fantastic!!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Peter Thompson"}, {"rating": 1.0, "review": "It was a gift or we would have returned it.  It did not work at all.  All we got was five minutes of buffering followed by two seconds of program, over and over again.  And, the problem is not with our internet provider.", "verified": true, "helpfulness": "2/2", "author": "Kathy D."}, {"rating": 1.0, "review": "Very poor instructions both with the set up as well as the operation. I admit that my technical skills are limitted but even with qualified help it was difficult.", "verified": true, "helpfulness": "1/1", "author": "joseph davis"}, {"rating": 4.0, "review": "Works just as advertised! Easy set up and easy to link to wireless modem. I plugged into HDMI in my amplifier and have great sound and picture.", "verified": true, "helpfulness": "0/0", "author": "Tim Lydon"}, {"rating": 5.0, "review": "I love the Fire TV Stick. Your original Prime programming is excellent. The selection of movies is very good. It is easy to set-up and use out of the box.  Thank you!", "verified": true, "helpfulness": "0/0", "author": "Dan McGuire"}, {"rating": 4.0, "review": "Loses the network from time to time, that's the only thing keeping it from getting a 5 star rating.I paired it with a Netflix subscription $8.99/month) allowing the Fire TV Stick to show 1 show/movie on the TV while my pc or tablet can play a different one.Look out cable and satellite... Internet and On-Demand are growing... and I never see commercials!", "verified": true, "helpfulness": "0/0", "author": "Dan Racette"}, {"rating": 4.0, "review": "This is a terrific product, but unfortunately my high speed internet connection wasn't consistently fast enough to stream movies without interruption. I had to return it for that reason, but if I have access in the future to a faster connection, I will re-order this item. I live in a rural area and do not have access to cable which would provide a sufficiently high speed hook up.", "verified": true, "helpfulness": "0/0", "author": "NevadaStu \"Hayley's dad\""}, {"rating": 5.0, "review": "just wish you did not have to scroll through everything to find a movie, I would like a list of whats available.", "verified": true, "helpfulness": "1/1", "author": "Barb"}]