[{"rating": 5.0, "review": "works really well. I was using WD digital player which needs a ethernet cable to be routed to the device. Problem is that my router is elsewhere in my home so routing cable became near to impossible task for me. Now with fire stick, all clutters are gone. Just stick it in the HDMI port and it is able to connect wirelessly to my router and I am able to enjoy all the apps which was present in WD streaming player.", "verified": true, "helpfulness": "0/0", "author": "Shanmugam Ramanathan"}, {"rating": 4.0, "review": "But it does get pretty hot. Maybe because I have a plasma TV that creates a good bit of heat, but I doubt it.", "verified": true, "helpfulness": "0/0", "author": "Ahmed Roberson \"A.Roberson\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Scott Simpson"}, {"rating": 3.0, "review": "Its alright for the price. Wouldn't recommend. Navigation and streaming is super laggy and network connecting isn't very strong. My Chromecast performs a lot better.", "verified": true, "helpfulness": "0/1", "author": "jesus"}, {"rating": 5.0, "review": "Works a lot better than our older Samsung Blue-Ray/DVD player.  It rarely has the pauses and skips we had while watching MLB.com games.  I also like the fact you don't have to point the remote at the TV to make it change.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 5.0, "review": "Can't do wrong for 40 bucks!!", "verified": true, "helpfulness": "0/0", "author": "Grandeur R. Ipalari"}, {"rating": 5.0, "review": "Use it all the time", "verified": true, "helpfulness": "0/0", "author": "ReeseP"}, {"rating": 5.0, "review": "Very easy to set up and use. I have used the Fire Stick on two different TV's and while traveling (through captive portal access feature) in a motel. The IU is user friendly, and in some ways I prefer it to the Roku Stick I also have; plus the extra channels available on Roku are ones I am not really interested in anyway. I also appreciate the thought that went into the device itself, including the packaging. Features, design, simplicity, quality look and feel all add up to a great device which is one piece of the puzzle of leaving cable behind, or at least reducing service to basic for those channels which are difficult to find elsewhere. Five Stars!", "verified": true, "helpfulness": "0/0", "author": "John P."}, {"rating": 3.0, "review": "Not as good as the amazon fire tv. I bought this first to try it out and the wireless is was slow even next to my wireless access point. The streaming would buffer on hi-def videos. As of right now, I don't even use it. May give it to someone.", "verified": true, "helpfulness": "1/1", "author": "d"}, {"rating": 3.0, "review": "Glad I have it, but it shuts off on me a lot. And  it a lost wifi connection, the device itself just turns off. It's really annoying. Other than that, it works well and it's easy to use.", "verified": true, "helpfulness": "1/1", "author": "Danielle"}]