[{"rating": 5.0, "review": "The Stick takes the frustration out of streaming", "verified": true, "helpfulness": "0/0", "author": "Gary Breen"}, {"rating": 5.0, "review": "It's great! Took me a bit to download the apps I wanted but am glad I purchased this. The movies included through amazon prime aren't as up to date as Netflix but the Fire Stick has SOOOO many channels I've never seen before. I think I'll really enjoy this.", "verified": true, "helpfulness": "0/0", "author": "Ronda L. Ringler \"Ronda\""}, {"rating": 2.0, "review": "I love the the options it gives and simplicity. I only rate it low because it periodically drops the wifi connection. After it does this you have to reset it and reconnect. Many others have same problem. Other devices work just fine on the wifi it won't connect to.", "verified": true, "helpfulness": "0/0", "author": "Brett"}, {"rating": 4.0, "review": "So far, I really love the Fire TV Stick, although my recent busy schedule hasn't given much time to get to know it yet", "verified": true, "helpfulness": "0/0", "author": "Gunny"}, {"rating": 5.0, "review": "Not quite a google chromecast, not quite a roku, but somewhere in the middle. \"Screen-casting\" is not nearly as simplistic or as easy as a chromecast, but I like the ability to use the included remote OR the android app for your phone to control it. A menu-based system on your tv is also helpful when trying to watch things like netflix, hulu plus, etc. Appstore for Fire TV seems to be continually growing, with an already extensive list of applications (and some games too!). Very easy to use and very functional. I use this daily!!", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 4.0, "review": "A little slow, but that's compared to an AppleTV. Being that it's less than half the price and more customizable…it's pretty nice.", "verified": true, "helpfulness": "0/0", "author": "D. Davidson"}, {"rating": 5.0, "review": "love this but has a problem wth weak wifi had to move it closer to router, but works better than chromecast stick", "verified": true, "helpfulness": "1/1", "author": "Deborah J Myers"}, {"rating": 4.0, "review": "Love it !", "verified": true, "helpfulness": "0/0", "author": "Lori N"}, {"rating": 5.0, "review": "This is the fastest streaming stick for Amazon instant video! If your. Prime subscriber there's should be no doubt which streaming device you choose!", "verified": true, "helpfulness": "0/0", "author": "ronak devnani"}, {"rating": 4.0, "review": "works great, with Prime its awesome. Better integration with Spotify would be nice but at least its there.", "verified": true, "helpfulness": "0/0", "author": "Drew B."}]