[{"rating": 5.0, "review": "I really loved the Fire TV stick. The display is crisp, had a concern about how is it going to react to the remote. Loving it!!!", "verified": true, "helpfulness": "1/1", "author": "Suresh K. Medimi \"Cricket Lover\""}, {"rating": 5.0, "review": "Worked like a dream right out of the box , took me less then 5 minutes to set it up and it was all right there , my stuff , videos ,movies, It was easy and I think i will be using it quite a bit , plus all my music from prime was there so its easy to play my music from the TV and stereo , I'm buying one for every tv in the house.", "verified": true, "helpfulness": "1/1", "author": "John Augustine"}, {"rating": 5.0, "review": "Great item works great.", "verified": true, "helpfulness": "1/1", "author": "louis ives"}, {"rating": 5.0, "review": "Brilliant device! Extremely pleased with the fire TV stick. Miles ahead of the it’s in-class competition and better than units costing twice as much.I’m going to admit I have a bit of a problem, I collect gadgets. I own so many other set top boxes including Apple Tv, Roku, Roku Stick, Google Chromecast, Google Nexus Player, and Amazon FireTV. So I think I am able to judge the relative merits of each.If you are new digital streaming, this is the one to get.  No other device even comes close to the price, performance, and features of the FireTV stick.  At $40 this device is a steal, find it on sale and the deal is a no brainer.Compared to roku stickMy biggest disappointment with the Roku stick is it is unusably slow.  The menus can be impossible to navigate, scrolling around the content you have to sit and wait for everything to load.  Click right 3 times and the system may go right 1 square or 7 squares completely randomly.  Try to open a movie to read its description, prepare to wait about 5 seconds for it to load.  In comparison the FireTV stick is incredibly fast.  You can scroll around as fast as you can and you never see loading tiles and have a smooth beautiful experience without frame drops.  The Roku requires a monk like level of patience, the fire stick will impress even the most impatient user.Compared to ChromecastFirst I loved the Chromecast, I bought 4 of them and gave them away as gifts.  The Chromecast is, bar none, the best way to extend your cell phone unto a TV.  But I want to watch movies and tv shows.  I don’t want to have to sit there with my cell phone out just to watch something.  The first time you really see a problem with the Chromecast is that moment you want to watch something only to realize that your cell phone is dead and you don’t get to watch something, because you have to charge your cell phone.  The Chromecast is so simple its complex, great for people who live on their cell phones 24/7 but will collect dust in the house of normal people.What are you waiting for buy one already!", "verified": true, "helpfulness": "2/3", "author": "K. Sturgis"}, {"rating": 5.0, "review": "Nice little product. Great for watching Amazon Prime content. Picture is very clear. It is also very easy to use.", "verified": true, "helpfulness": "1/1", "author": "Cameron Alakija"}, {"rating": 4.0, "review": "One day review:So far the Fire Stick has exceeded the Chromecast in all areas except one, at least for now. I do not have a SmartTV. I have a regular HDTV (meaning no apps). Everything minus the Mirror casting has worked with no problems.Pros: Access to my Prime stuff (movies, music, etc). Of course Chromecast will not do this.Setup: EASY. Entering your wifi password must match exactly. Lowercase or Uppercase DO matter.Remote: Simple, although searching takes time unless you have the voice remote (not included) or the app which works on the Fire HDX 8.9\" with Fire OS 4.5.1. People have been reporting some issues with various things with an update, so far no conflict with the OS update and the Fire Stick, which did update to new software upon setup.Videos: They start almost instantly, at least from Amazon. Netflix videos may take a few seconds longer, but NO complaint there.Music: Great. Much louder with the better speakers on my TV.Photos: Have not used.Games: Have not used through Fire Stick.The Fire Stick app, which can easily be searched for, comes with a voice search option. I'm not 100% sure, but I think it only works on the HDX versions. The app is free and the device, (Kindle or not) must have a built-in microphone. Like the app says and the ad page for the Voice remote you can 'speak' any actor's name, movie name, whatever and control the Fire Stick with the tablet (in my case). A reviewer said he couldn't get out of the app without a hard reboot. Simply swiping up from the bottom in portrait mode will bring up the Home and Back options so you can get out of the App.The four stars was stretching  bit, because at present, I cannot get the Mirror cast function to work. Even if you have a TV that is NOT Mirracast enabled, I 'think' I read somewhere that the Fire Stick eliminates that. So the user is Mirror casting through the Fire Stick. I'm not sure. I hope there is a solution as this is one of the factors in my purchase", "verified": true, "helpfulness": "0/1", "author": "B. Mason"}, {"rating": 5.0, "review": "Absolutely fantastic product and I find it to be far better than the chromecast with the only exception that I'm not aware of anything similar like google cast so I can stream something from my browser to the fire stick.The remote is simple and my nieces already found it extremely easy to use when I was babysitting.", "verified": true, "helpfulness": "1/1", "author": "J Muniz"}, {"rating": 3.0, "review": "I like almost everything about the Fire TV Stick. The problem is the lagging and the hiccups. I know for sure that my connection is fine because I use the same apps on my PS3 and I have no problems with the streaming. I bought this so I could give my PS3 a break, but the hiccups and lagging are so distracting that I don't even want to waist my time streaming on it until they fix the problem. If it isn't fixed in a week I will most likely send it back and by something better from Best Buy...", "verified": true, "helpfulness": "1/2", "author": "Richard Barber"}, {"rating": 5.0, "review": "So far it's awesome I've only had it a week though. I just like the fact that I can actually use my Amazon prime acct with this so I don't have to boot up my PC just to watch a 30min show also it saves me money because I have a high end gaming computer that takes a lot of energy to run", "verified": true, "helpfulness": "1/1", "author": "William Gonzalez"}, {"rating": 3.0, "review": "It was very easy ti install", "verified": true, "helpfulness": "0/1", "author": "Petra Montalbo"}]