[{"rating": 5.0, "review": "I love using this so much more than my Blu-Ray player.  The Amazon Prime and Netflix apps are great and very user friendly.  I especially like how you can browse movies and shows that are not on your queue or watchlist.  I've only used it a few times, so I'm sure there is plenty more of cool things to learn.", "verified": true, "helpfulness": "0/0", "author": "Alex Baldwin \"Lowrider Alex\""}, {"rating": 1.0, "review": "I think it's nice to get Netflix through this, but why do Prime members pay for movies? They are the same price as on Demand from cable. I doubt I'll be renewing my membership. I think I've gotten free shipping twice? Now paying for movies...not what I expected.", "verified": true, "helpfulness": "0/0", "author": "cara1215"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "ANDY"}, {"rating": 5.0, "review": "Pure Awesomeness. Amazon does it again!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 2.0, "review": "This is a 2nd review of Amazon's Fire Stick after using it for about 6 weeks. Initially it worked very well (for a few weeks)- then out of the blue it started to drop connection with my router. I'll be watching a Movie and after a few minutes it freezes and a wheel starts spinning as if it is buffering the movie- but the movie never resumes and the wheel never stops spinning. I get a lost or low connection message and the only way to fix it is to power off the stick, wait for a few minutes, then power it back on. This is happening repeatedly and after googling Fire Stick connection problems a lot of people are having the same issue. No other device in the home is dropping connection. My Playstation 3 streaming/ connectivity (in the same location) is unaffected and I'm tired of having to reboot the stupid stick every few minutes while watching a movie. Guess it's back to the P3 for streaming content- along with its noisy fan. : (", "verified": true, "helpfulness": "0/0", "author": "Victor K. Neumann \"DRM MKR\""}, {"rating": 4.0, "review": "It's great I love it", "verified": true, "helpfulness": "0/0", "author": "kelceymurray"}, {"rating": 5.0, "review": "Love it...and love movies I can get with it.", "verified": true, "helpfulness": "0/0", "author": "Patricia"}, {"rating": 5.0, "review": "I am hooked! An excellent alternative to expensive cable TV.", "verified": false, "helpfulness": "0/0", "author": "Van Scott Ferguson"}, {"rating": 5.0, "review": "The Fire TV Stick is a great little device if you are looking for an easy way to stream Amazon Prime movies/TV or from a Netflix account. Very easy to connect to our wireless network and was already set up for my Prime account. Literally plugged into an extra HDMI port on my TV, plugged it into the a power source (I recommend a surge suppressor) turned on the TV, answered a few questions, added the wireless account info and was watching TV in less than 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My six year old can easily work this which is awesome!!!  We love it!!", "verified": true, "helpfulness": "0/0", "author": "Heather J. Cooper"}]