[{"rating": 4.0, "review": "It's wonderful band easy to use. We have however lost the remote several times. Could be a little bigger.", "verified": true, "helpfulness": "0/0", "author": "Katie Dorsey"}, {"rating": 5.0, "review": "Works great with my cell phone especially the voice command!", "verified": true, "helpfulness": "0/0", "author": "Dennis R Cherry"}, {"rating": 4.0, "review": "This is a great gadget. Bought it when Amazon was selling it \"pre-ordered\" for $19.00. The speed is awesome for such a small gadget. The wireless speed is amazing... My TV (Sony) has built-in wireless (very crappy) this gadget is at least 4 to 5 times faster. Movies never chop or lag. TV is on a different floor, and about two additional walls away. Wireless speed is awesome.HERE IS WHY I WONT GIVE IT A 5 STARS... even though it deserves it.... The bigger brother has a voice search feature that is second to none. WELL... Amazon can sell you the remote SEPARATELY for this unit... why not offer a model with a voice search equipped remote for a few extra dollars.I must also point out that I don't care much for the voice remote search, but my wife and kids really like it. I might have to buy it for an additional $20.00 to $30.00 (I think)Highly recommended. Very fast. The cover flow when showing the movies cover is the smoothest I have seen.", "verified": true, "helpfulness": "0/0", "author": "Ralph Montague \"R. Montague\""}, {"rating": 5.0, "review": "I'm satisfied with all purchases.", "verified": true, "helpfulness": "0/0", "author": "stephen c prokop"}, {"rating": 5.0, "review": "I really like this product. It was easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "Aimee Dietz"}, {"rating": 5.0, "review": "Love this! We had it hooked up within a couple of minutes and streaming movies off Netflix. I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Staci S."}, {"rating": 2.0, "review": "This was great right up until the wifi stopped connecting to it. I am having to constantly unplug it, leave it off for a few minutes and then plug it back in. My wireless router sits RIGHT next to it. I've seen other people with the same complaint and no fix or response from Amazon. Very disappointed!", "verified": true, "helpfulness": "0/1", "author": "Josh Bowers"}, {"rating": 5.0, "review": "What a great product that fits perfectly with all things Amazon. I am sold on everything that Amazon is willing to put their name on.", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 5.0, "review": "best thing since the kindle fire", "verified": true, "helpfulness": "0/0", "author": "PHILIP FRANK"}, {"rating": 3.0, "review": "Remote broken in first week, the cursor circle on remote is broke and no response to replace from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Jimmie Lavender"}]