[{"rating": 5.0, "review": "Easy to use great apps", "verified": true, "helpfulness": "0/0", "author": "Ronald Bollinger"}, {"rating": 5.0, "review": "The Fire TV Stick works perfect on my Samsung TV.  I had bought a Samsung Stick before this one and had some issues trying to watch my Amazon Prime shows but with the Fire Stick, it works much better for both Amazon Prime and Netflix.  Would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "GR \"Ginger\""}, {"rating": 4.0, "review": "Great price for a nice additional streamer. I use it in my bedroom and the remote works well (oddly great for something like flappy birds) and an easy and cheap way to get Amazon Prime on the TV (along with the staples HBO, Netflix and Hulu). Simple interface and gets the job done.", "verified": true, "helpfulness": "0/0", "author": "Stanley"}, {"rating": 2.0, "review": "bad product, often buffering for video, even for youtube cast", "verified": true, "helpfulness": "1/1", "author": "Yanwei Pan"}, {"rating": 5.0, "review": "I was using a Sony USB device which was two times as expensive as the stick.  The Sony device stopped working after 3 months.I am a Prime Member so I decided to try the stick.  Very easy to install.  Love the remote that comes with it.  Much easier than using the TV remote.Have used the product for Netflix and Amazon Prime - Love it!", "verified": true, "helpfulness": "0/0", "author": "Nosemein"}, {"rating": 5.0, "review": "Works great. Simple to install. Very happy overall.", "verified": true, "helpfulness": "0/0", "author": "John C McNamara III"}, {"rating": 5.0, "review": "I LOVE this! Easy installation and use, would recommend this highly!", "verified": true, "helpfulness": "0/0", "author": "Katherine Follett"}, {"rating": 1.0, "review": "Terrific for Amazon Prime & Netflix, especially with its remote, which makes it much easier to use than Chromecast dongle.", "verified": true, "helpfulness": "0/1", "author": "Charles E. McClelland"}, {"rating": 4.0, "review": "Love how it works. Unfortunately could not use it on our main TV (55\") as the USB connection was on the back of the TV which was hung on the wall professionally and locked into place so could not get to it. However it works great on the TV in our bedroom.", "verified": true, "helpfulness": "0/0", "author": "Rocky I Jensen"}, {"rating": 5.0, "review": "I gave this to my husband for Christmas and he really loves it! It has been working great. We recently took it on vacation too. Love it!", "verified": true, "helpfulness": "0/0", "author": "Tamara Coty-Stickevers"}]