[{"rating": 5.0, "review": "awsome", "verified": true, "helpfulness": "0/0", "author": "LEROY  HASSE"}, {"rating": 3.0, "review": "I have good internet service but there have been a few times the movie has quit indicating no internet service. It will not come back on that day.This is not good", "verified": true, "helpfulness": "0/0", "author": "Wes Madrill"}, {"rating": 4.0, "review": "The fire tv stick is well worth the price I paid for it on sale.~ 97% of the time it runs smooth, the other ~3% of the time it drops/loses my wifi. I am aware of wifi channel traffic and signal strength (I use Wifi Analyzer app), and I will concede that my wireless router is in the opposite corner of my house. Beside the occasional wifi issue acting up, it works great, and I love it.The apps I use all seem to work smoothly, and the layout/menus are intuitively easy to navigate. Credit to Amazon for keeping up on updates, and adding new apps regularly.", "verified": true, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 1.0, "review": "This worked good for like two weeks.  After that Netflix would not play anything.  I contacted customer service and got a less than helpful response.  Now about a month later, my Hulu will not work or play anything either.  I have checked (multiple times) if my system was up to date and have unplugged it just as many times.  I am less than impressed with it and even less happy with the customer service I received.", "verified": true, "helpfulness": "1/2", "author": "Kelly Shelon \"ksheldo\""}, {"rating": 5.0, "review": "I travel for a living.  Awesome to take with me to hotels.  Very small footprint in the computer bag and can be powered with tv usb.", "verified": true, "helpfulness": "0/0", "author": "Usafloadc17"}, {"rating": 5.0, "review": "This is incredible I love it, the need to fix some connection problem with the wireless range I moved my router and everything is fine, but is your router is far from your tv, never mind is going to be a mess, so take this advice, you need to be close to the internet source!", "verified": true, "helpfulness": "0/0", "author": "Luis Castillo \"Luis E Castillo H\""}, {"rating": 4.0, "review": "Needed some simple tech support which Amazon provided almost instantly with live voice downloads were almost instant as well", "verified": true, "helpfulness": "0/0", "author": "scott lund"}, {"rating": 5.0, "review": "I never wanted to pay for cable TV because it was too pricey and I do not watch a lot of television due to my heavy work schedule. Amazon Prime and the Fire TV Stick was exactly what I needed. Entertainment without a huge price. The movies tend to be \"B\" movies, but I enjoy all the TV series programs they make available with Amazon Prime. The Fire TV Stick was easy to install. Biggest problem I had was remembering what was my security code for my Wifi since I had not added anything new in years.", "verified": true, "helpfulness": "0/0", "author": "Teacher"}, {"rating": 5.0, "review": "I love it my kids love it great device I definitely recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "jesus estrada"}, {"rating": 5.0, "review": "Loving the fire stick. Best decision we've made - cancel cable and just go with wireless.", "verified": true, "helpfulness": "0/0", "author": "Becky OKeefe"}]