[{"rating": 2.0, "review": "Wont connect to 5GHZ network, even though my Android can connect to 5GHZ network with same password. Verifed plenty of DHCP addresses available, verified no mac address filtering--------------------------------Update: Technician called. We got it connected through 2GHZ. It did a lot of updates and works well. However, still wont work on 5GHZ...it reports 4 bars then disconnect, then 4 bars....over and over. Meanwhile the Samsung TV 5Ghz connection and Android 5GHZ connection work great. Got $5 credit, so raised 1 star.5GHZ is important because the bandwidth is much greater than 2GHZ.", "verified": true, "helpfulness": "1/2", "author": "EmiEmc"}, {"rating": 4.0, "review": "I bought a couple of these because of the lower price for Prime users of $20.00 when they first came out. I have been using it and it's been great. I'm primarily an apple user and typically use my Apple TV.  The interface may take a little getting used to but it's pretty simple and conveniently places recently used apps for quick access. One thing that was kind of a surprise to me (mainly due to my lack of research) was that I was unaware it required a power source. However there is a workaround if the chord does not reach the wall outlet or you don't want to use the power source. All that you need to do is plug the usb chord that comes with it into the fire stick as normal and the other end into a usb spot on the back of the TV.  Most TV's have a usb port in the back and this helps maintain a cleaner look without a chord showing (if mounted) and saves outlet space. However, this may not work for all TV's.  Haven't had any issues with Wifi as some users have claimed.  Overall, am happy with the purchase, and plan to give one as a gift!", "verified": true, "helpfulness": "3/4", "author": "Ethan"}, {"rating": 5.0, "review": "Very cheap and easy.  I bought it for one reason, to watch the new Harry Bosch series on Amazon and found many more reasons to have it.", "verified": true, "helpfulness": "0/0", "author": "chuck"}, {"rating": 2.0, "review": "Right out of the box it has had issues maintaining a stable connection with my home network.  I have an Asus AC68u router (which is fairly high end), and tried both bands.  Keep in mind, my chromecast and FOUR OTHER ANDROID DEVICES (two of which are kindles) IN THE SAME EXACT LOCATION were working flawlessly.Upon plugging in, it would alternate between seeing and not seeing my various SSIDs.  After fiddling with it and rebooting half a dozen times, it finally installed the first update.  I got netflix setup, and then the connections continued to drop.  I brought up a show, and it streamed the first two seconds (without audio) and then stopped streaming.I want the last two hours of my life back.", "verified": true, "helpfulness": "6/7", "author": "DJD"}, {"rating": 1.0, "review": "This product has a very sexy box and is marketed right. It's fast and doesn't lag. HOWEVER, it doesn't do half the stuff a Roku would do because it doesn't support the Playon app. Glad I didn't buy three to replace all of my Roku boxes.", "verified": true, "helpfulness": "7/9", "author": "Dugrace"}, {"rating": 5.0, "review": "Perfect working with high quality video and sound.Piece of cake installation and setup .WiFi Remote control is amazing. very very better than IR remote. If you are a Amazon Prime member then it's all you need to a free life time entertainment .it's also great for kids movie,show,app,and game .unbelievable price for lots of fun. Now you don't need to pay for expensive channel or expensive smart TV.I strongly recommend Fire TV Stick to movie lovers.", "verified": true, "helpfulness": "1/1", "author": "Farid"}, {"rating": 5.0, "review": "Despite its form factor similar to the Google Chromecast and various EzCast stick streaming devices, the Fire TV Stick is much more comparable to the Fire TV in terms of features and functionality. Unlike the cheap, lightweight TVs, it is fully self-contained and does not require a phone, tablet or laptop to initiate streaming: it comes with its own remote, and you can purchase the optional fancy voice control remote (which comes standard with the full size Fire TV) or the Amazon bluetooth game controller.The box contains the stick itself, a short HDMI extension cord (to prevent the stick from protruding, depending on how your TV connectors are laid out), a USB to microUSB cable and power adapter (to power the stick), the remote control and 2xAAA batteries for the remote. Instructions insist that the stick should be connected to the power adapter provided, but I tried the USB port on my TV anyway: this resulted in the stick entering a reboot loop... So, yeah, they mean it. Use the power supply and cord provided!Setup is a cinch: connect to your WiFi (unlike most cheap sticks, the FireTV Stick supports the 5GHz band), update the firmware if necessary, watch the short but thorough animated presentation and you're ready to go.The Fire TV stick sold me on two features: easy access to free Amazon Prime video streaming, and Plex (I have all my videos on a home Plex server). Both work extremely well, much better than on any other streaming device I own. Streaming is just about perfect, and I have yet to see an annoying \"Buffering...\" message. Can't speak for other streaming services, but if you're like me and mostly use these two, it's probably the best device you can get at any price.Recommended -- but check compatibility with your streaming services of choice.", "verified": true, "helpfulness": "0/0", "author": "esanta \"esanta\""}, {"rating": 5.0, "review": "It'doing great", "verified": true, "helpfulness": "0/0", "author": "Ike Lewis"}, {"rating": 5.0, "review": "Best bang for your buck! For $5 more than the chromecast you get a device that combines the best of Amazon, the chromecast and the similarity of the Roku OS/Apple TV OS! You can either select shows/apps on screen or cast them to the tv just like with a chromecast or Roku. For $40 you can't find a better option!", "verified": true, "helpfulness": "0/0", "author": "Amanda Glass"}, {"rating": 5.0, "review": "Amazon as always Under-promises and over-delivers, which is fantastic as a Consumer!I was part of the early adopters and got one for $20, was supposed to arrive at my door on December 3, but came November 28.===== WARNING =====IF YOU ARE GIFTING THIS BE CAREFUL, Fire Stick TV Recognized my Amazon Account and logged me in without Password. All I did was log in through my network, and am unsure as to what got me in so easily, less hassle but I am surprised. So be careful if you are gifting the Amazon Stick. Something to think about.===== Box Contents: =====-Fire TV Stick-Quick Start Guide-HDMI Extender ~4 inches-Micro USB Power cable-Wall power Adapter to USB 5 WATTs-Fire TV Remote-A very good looking Quality box to hold it all in. Quality of Packaging shows that their design team great effort in presenting their product flawlessly.===== Amazon FireTV Stick Installation =====-Used my 54\" HDTV's USB power to power the Stick with no problems.-Logged into my 5ghz internet connection with no issues.-Took a 15 minute Firmware Update.-Recognized my Amazon Account on Start up, I don't remember logging in as this is my first time.-Settings are Pre-configured but can be customized on a needed basis. Setted Video at 1080p 60Hz. Very Very Sharp Details.===== Functionality =====-Youtube requires to be downloaded via \"Search\". I found this odd as FireStick TV was advertised as Having Youtube functionality.-Youtube has a unique way to allow you to sign in to your youtube account via 8-digit unique passkeys.-Synced my Desktop to Youtubes' Mirroring. Basically I can Que up a list of youtube videosCompared to Chromecast, Fire Stick TV has enough processing power to not be in a tug-of-war for what gets processed on the fly. One major Gripe I had with Chromecast was that either the Chromecast Dongle or my Quad-Core Android phone was unable to keep up with me.Of Course it also comes with all the described Subscription options that is boasted. Fortunately for me, I satisfy all my media needs via Youtube and my Audiophile needs from SoundCloud/Pandora. Its sort of overkill for me to be using a 54\" HDTV to play songs with a stagnant image in the backgound, My Xperia Z can handle that fine.===== Fire Stick TV Versus Chromecast =====This is mainly from how I use my Chromecast. This comparison may differ depending on how you use it as well:Chromecast relies on a Smartphone or Laptop and \"pushes\" the content to your TV. This works via a Home network connection. But it ties down a device that is using the chromecast.Well FireStick TV handles it all in the Dongle. All I need is the internet connection. The great thing is that it frees my Smartphone/laptop for other things.==== Downsides =====-Miracast seems to prefer Fire X Devices. Had some trouble connecting my Android 4.4.2 Smartphone and my 4.4.2 Xperia Z.-Does not automatically sync all Amazon Purchased Apps. (Couldn't find it, but I will eventually) I hope you enjoyed this review, and for $20, this is an incredible device.", "verified": true, "helpfulness": "0/0", "author": "Zen"}]