[{"rating": 5.0, "review": "Great for watching Movies!!", "verified": true, "helpfulness": "0/0", "author": "D390"}, {"rating": 4.0, "review": "Updated July 6 2015:Despite my initial negative review, I now almost exclusively use FireTV Stick (FTS). Mainly because it supports 5.x GHz wireless channels. Chromecast doesn't. Important note is to force your FTS to connect to 5GHz channel, or it will default to 2.4GHz and suffer the same way Chromecast does. The other point is Miracast! It now works pretty nicely (not flawlessly though).I can even cast my entire desktop/extend desktop of *Windows 8.1* from my Surface Pro to it using the \"Devices > Project > Add Wireless Display\" path on Windows. Unfortunately you'd still have to manually each time set your FTS to \"mirroring\" mode, but Amazon has added(?) a shortcut in the clock screen in addition to existing Settings>Display>Enable Mirroring route.It also appears they have updated the apps I noted in my review so the experience is smoother now. YouTube works almost the same way it does on Chromecast for casting. It still sometimes gets stuck and I have to disconnect/connect my YT app, but it's a bug they have to fix. Given the above changes, I upgrade it from 2 stars to 4 stars.First version follows:==================[7/6/15: Title was \"Can't compete with Chormecast yet\"]I have had Fire TV Stick (FTS) for a few weeks now, and was excited to get it. Here are reasons why I don't like it:1. Main exciting feature was native Miracast capability. The \"no extra app needed, works on all Miracast devices\" promise was very charming. Unfortunately it doesn't work well. You have to go to Settings > Display > Enable Mirroring on your FTS and stay there to even see it on your phone. And every time I tried using it, it did a combination of these: had an uncomfortable lag, crashed the phone/tablet (Nexus 5 and HP 7 Plus KK),  could not connect, disconnected quickly. [7/6/15: now fixed, partially because of my terrible 2.4GHz noise. Enabling Miracast still annoying.]2. The YouTube app is hard to setup. You have to pair with a string of numbers (my Vizio TV gives a QR code at least). And then it sometimes cannot connect to phone/tablet YT app, it just stays in \"connecting\" state on the phone (tried with Android KK,L, iphone). Clearly the error is in YT on FTS or the FTS itself. [7/6/15: Almost fixed. Still have to connect/disconnect YT app to bring up YT on FTS]There are some reasons I do like it though:1. There is an independent UI on FTS.2. There is a remote! 1+2= you don't need to take out your phone every time, and guest can use it. Which is nice.3. There are many many apps on it. And I hope there will be even more.I got the promotional price of $19 so I will keep it, in case they finally make the Miracast to work. But for my real use, I just ordered a Chormecast :)", "verified": true, "helpfulness": "1/1", "author": "Ehsan \"Ehsan\""}, {"rating": 5.0, "review": "little magic genie. Better than chromecast.Unlike chromecast, you can use the provided remote.The interface is wonderful. It works as you would expect and sometimes even better.I havent tested the optional gamepad and voice remote.Give it to somebody without a Smart TV and they will get used to it very quickly.Hate the power cable which is a little stiff, but i replaced it with a flexible cable micro USB and it works great. (it only affects me because i think cables should be flexible).Try it and you will like it.Best stocking-stuffer.", "verified": true, "helpfulness": "0/0", "author": "Arun Ramakrishnan \"DRKR panel\""}, {"rating": 5.0, "review": "Think it's a great addition to our TV", "verified": true, "helpfulness": "0/0", "author": "Patricia H. Dunham \"AZPat\""}, {"rating": 5.0, "review": "Excellent for streaming apps.", "verified": true, "helpfulness": "0/0", "author": "handsome1"}, {"rating": 3.0, "review": "Remote is awful. Pushing once sends it skittering past where you wanted. Try to go back an it skitters past it the other way.I prefer my Roku stick and its remote. Much more responsive. Which surprised me. I was ready for the Fire stick to be better than the Roku.", "verified": true, "helpfulness": "0/0", "author": "PonyMac"}, {"rating": 5.0, "review": "Way more than I expected. I had a Chromecast for over a year and I have spent a tone more hours on fire stick it's like a entire media experience I can pack up and setup anywhere I can get a Internet connection and a HDMI port", "verified": true, "helpfulness": "0/0", "author": "Jamell Moore"}, {"rating": 5.0, "review": "Everyone in the family loves this thing.  Highly recommend for anyone who has Amazon Prime.  Don't forget to get the game controller also, you will need it if you really want to take advantage of all the things that Prime has to offer on your Fire stick.  Although the specs on the stick are lower than the Fire TV box, there is no noticeable loss of quality or performance from our perspective.  The little controller is now the most fought over controller in the house.  With parental controls, you can manage purchasing and what apps get installed on the device.", "verified": true, "helpfulness": "0/0", "author": "Toddfrog"}, {"rating": 5.0, "review": "I too paid $19 for the stick, definitely well worth it, the built is solid and remote is simple enough that even a toddler can navagate the screens and find shows without problemWhat would be nice perhaps in future updates, I would like to see a spot for third party apps to display on the default launcher screen without having to go into settings, and if can Amazon can add native support for AirPlay or similar feature that a chromecast does would be great, this way I can only keep what's important plugged into my tv instead of all these different media players, for starters the roku is going to the garbage", "verified": true, "helpfulness": "0/0", "author": "alreadyposted \"alreadyposted\""}, {"rating": 4.0, "review": "A bit about me: I am an Amazon Prime user who wanted to beef-up her Smart TV.  I also purchased the Fire Stick for $20 as part of a promotion.The stick is great if you have a lot of Amazon content, photos in the cloud, and the ability to mirror devices via Miracast.  The WiFi connection is not as good as I hoped it would be (particularly as the TV's connection is nothing to write home about), but again, I can mirror my screen in a pinch.  The remote app is...interesting, but I'll put that review on its own product page.  Overall, I have not used the Fire Stick as much as I thought I would, but this is partially due to the placement of the TV it is on and partially due to the lack of FreeTime.The Fire Stick is definitely worth $20, and I think it is also worth $40 in general.  For my particular wants, I think the Fire  TV box would actually have been a better purchase, if not for the promotion.", "verified": true, "helpfulness": "0/0", "author": "AudibleQun, a.k.a. Athena Snark"}]