[{"rating": 3.0, "review": "I was coaxed into buying this. Dad was dealing with a dying Roku box and though I was perfectly happy with my Roku 3, I decided to give it to Dad and try the Fire TV Stick. I'm not very happy with this particular buying decision. To begin with, I wanted to order it through my Prime account, but Amazon was temporarily out of stock. I ended up going to the local Best Buy for an in-store pickup. Pretty amazing that Amazon, with its business model of copious product availability, would get caught with empty shelves on a self-promoted item, but so be it. My bigger problem is that I keep comparing what I have now with what I had with the Roku and there is no comparison. Obviously, Roku has a few years head start, which gives them an unfair advantage currently, but an advantage it is. And as for the included remote control - first, I had to watch two separate YouTube videos to get the battery compartment open and since then, I keep hitting the Home key when I meant to hit Play/pause. The keys are way too close to each other and there's no tactile clue for one over another. Really poor design, combined with a paltry (though growing weekly) selection of apps. I'm not sure it'll be around for much longer in my living room.", "verified": true, "helpfulness": "0/0", "author": "Charles E Accetta"}, {"rating": 5.0, "review": "I traded a Google Chromecast for this, and I was Very Glad I did. I'm watching Netflix on my Big Sony now!!", "verified": true, "helpfulness": "0/0", "author": "GuyBo"}, {"rating": 5.0, "review": "my daughter received the packagea t 630 pm from UPS and I haven't seen her since.... i think it took her to another land....its 845pm!", "verified": true, "helpfulness": "0/0", "author": "Andrea M"}, {"rating": 3.0, "review": "Program is good!  Would like to have a fast forward and fast reverse feature since I watch TV late at night and occasionally doze off.  Would be nice to go back to last remembered spot easil;y", "verified": true, "helpfulness": "0/0", "author": "Philip B \"Philip Blomer\""}, {"rating": 1.0, "review": "You're better off buying a refurbished Xbox 360. Fire stick continuously loses connection. Good apps require subscriptions, very little is free.  I have also been on a loading screen for over an hour and there are no issues at all with my WiFi.", "verified": true, "helpfulness": "0/0", "author": "john geller"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "James S. Cribelar"}, {"rating": 5.0, "review": "A must for Amazon Prime users!  A simple, plug-and-play design makes this awesome!  We also have a Chromcast in our home, which is fine, but the fact that this devise is about the same price point AND comes with a remote is perfect!  Plus, we have access to all the free content with Amazon Prime.  Love love love this!!", "verified": true, "helpfulness": "0/0", "author": "kipper1128"}, {"rating": 4.0, "review": "satisfied :)", "verified": true, "helpfulness": "0/0", "author": "britni moore"}, {"rating": 1.0, "review": "This does not work with older TVs. Even though my Sony TV has an HDMI port, there is no audio or ability to view Netflix and Amazon prime videos. This was not mentioned anywhere on the Amazon site or in their support documentation but customer service told me the news. Just wasted a couple hours of my life trying to get it to work that could have been avoided.", "verified": true, "helpfulness": "0/0", "author": "Jc"}, {"rating": 1.0, "review": "Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Mila"}]