[{"rating": 2.0, "review": "Not impressed! I got this a few days ago and was not able to use it on 2 of the 4 TV's I have ( one a fairly new Toshiba) I've gone ahead and checked all the troubleshooting steps and of course 1 TV is the one I really wanted to use this on.The Only reason I'm giving it two stars is that I've been able to use it on one TV. I really like the menus and it's got potential just not ready for prime time I guess!", "verified": true, "helpfulness": "0/0", "author": "J J Antonetti"}, {"rating": 5.0, "review": "Love the all the features!", "verified": true, "helpfulness": "0/0", "author": "Ashlee"}, {"rating": 3.0, "review": "Works great for what it does.  I have been using a Chromecast and prefer casting my laptop to the TV.  The Fire Stick is not able to do this.  I you don't mind another remote and searching with it, then this device is for you.  I prefer browsing with my mouse and laptop and then casting.It does provide a better picture quality for Prime programming.I had the Fire tablet.  I quit using it because I didn't like the restrictive Amazon software and the inability to load Google Pay apps.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "Very happy with my Fire TV Stick. I love it. But how do I turn it off when done watching it?", "verified": true, "helpfulness": "0/0", "author": "A2J"}, {"rating": 5.0, "review": "Great buy!! No need for the apple tv anymore!!", "verified": true, "helpfulness": "0/0", "author": "Javier"}, {"rating": 5.0, "review": "Great item. A lot of entertainment for the price", "verified": true, "helpfulness": "0/0", "author": "SARGE \"SARGE\""}, {"rating": 2.0, "review": "It is a little erratic and requires rebooting (disconnect the power source).  Does strange thing when trying to watch basketball replays...like not finishing and rendering the fast forward useless. However, for the price, it offers a reasonable alternative yo getting a cable box for TV that is used only occasionally.  I would not purchase this for primary viewing.", "verified": true, "helpfulness": "0/0", "author": "D. hayashi \"dhman\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "KJ"}, {"rating": 1.0, "review": "Need browser app to make this a compelling stick", "verified": true, "helpfulness": "0/0", "author": "Sailesh Suthar"}, {"rating": 5.0, "review": "I've only had it for a week but it was very easy to install.  It took maybe 5 minutes. I purchased it because I'm an amazon prime and Netflix user allowing me to watch it on Mt television instead of laptop.  I'll post updates in the future but for now too new to have complaints.", "verified": true, "helpfulness": "0/0", "author": "M. Rice"}]