[{"rating": 5.0, "review": "I like it especially like the app so I don't have to find the remote", "verified": true, "helpfulness": "0/0", "author": "Marquize Hill"}, {"rating": 5.0, "review": "So simple and easy to install & set up!  Nothing to it and in minutes you are streaming movies, Netflix, Hulu, Amazon, etc.  have a Roku and moved it to the quest room.  Like the ease and functions of the Fire Stick better.  Remote is also responsive and easy to operate.  Will recommend to anyone with \"high speed\" connection.  Cut the cable!", "verified": true, "helpfulness": "0/0", "author": "BakerBob"}, {"rating": 5.0, "review": "Was everything as advertsedSuper easy to set up and use right away. We love it!", "verified": true, "helpfulness": "0/0", "author": "Laurice Bonannella \"Patrick's Ama\""}, {"rating": 5.0, "review": "We got our Fire TV Stick today and after a little snafu (needed to put it in a different port) it is working like a dream! Netflix and Hulu are doing great and I will be getting Prime again in October. I can't wait! I will be telling everyone about how wonderful the Amazon Fire TV Stick is!", "verified": true, "helpfulness": "0/0", "author": "Paula Smith"}, {"rating": 1.0, "review": "Useless, can't watch prime, can't download Netflix, nothing works. Completely useless", "verified": true, "helpfulness": "0/1", "author": "JDC"}, {"rating": 5.0, "review": "Love this!!!!", "verified": true, "helpfulness": "0/1", "author": "carol-lynn"}, {"rating": 5.0, "review": "Worked much better than I thought it would. Excellent purchase.", "verified": true, "helpfulness": "0/0", "author": "frisby"}, {"rating": 1.0, "review": "Constantly reboots.  All Amazon would offer is that I needed to update firmware (didn't work).  Darn near unusable.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jas"}, {"rating": 5.0, "review": "Love my Amazon firestick! I watch tv on my time with no commercials! Fantastic!!", "verified": true, "helpfulness": "0/0", "author": "Mr. Steven McBride"}]