[{"rating": 1.0, "review": "Poor device. Steady cutting off, does not keep internet connection. Which I could locate receiptto return back to store.", "verified": true, "helpfulness": "1/1", "author": "Bryant mayes"}, {"rating": 2.0, "review": "After about a week, Netflix no longer worked on the Fire Stick. The Fire TV Stick loaded very slowly when it did work. We purchased a Google ChromeCast and love it. I would not recommend the Fire TV Stick to anyone.", "verified": true, "helpfulness": "1/1", "author": "Benjamin Gordon"}, {"rating": 5.0, "review": "First off, I have to say I also own a rodku (I purchased that before the Fire Stick). Anyways, I much prefer the Amazon Fire Stick. I found it much easier to set up and use. And since I am an Amazon prime member, there are endless choices of movies and programs to stream for free. I honestly wish I would have purchased this before the Roku. If you are an Amazon prime member and are wondering which to choose between, get yourself the fire stick. It's a great price, easy to set up and use, and you get so much to watch with your prime membership.", "verified": true, "helpfulness": "0/1", "author": "Dawn"}, {"rating": 1.0, "review": "I got charged 100 bucks for something I never bought, don't ever put your debit card number. It's a scam!!", "verified": true, "helpfulness": "1/2", "author": "David"}, {"rating": 4.0, "review": "Need more content on Prime.", "verified": true, "helpfulness": "0/0", "author": "Katrina Haney"}, {"rating": 5.0, "review": "Amazing value! I really wanted to be able to access hbogo.com, showtime anytime, and amazon prime since I pay for those subscriptions and it is annoying to have to plug my laptop into the tv (plus then I can't use my laptop). Set up was easy, downloading the apps was easy, and I really like the remote; the response time is super quick,  much faster than my tivo remote. I was almost regretting buying this because of others' reviews saying the Internet is constantly cutting out, but I have only had one problem(fire tv told me my bandwidth was too low) which was easily fixed by restarting my router and modem. I currently am using the hdmi extender and ac charger as this was recommended. I would recommend this to anyone. Plus,  there's the added feature of fire tv stick being portable. It's easy to take with you on the road.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We love the freedom of not having a cable or satellite subscription. With the Fire TV Stick we can still watch all of our favorite shows at a FRACTION of the cost! I gave this only four stars simply because we have another brand of this device and the Fire TV Stick doesn't seem to get as good of an internet connection.", "verified": true, "helpfulness": "0/0", "author": "AshleyR"}, {"rating": 3.0, "review": "Top-rate only for Amazon Prime. Netflix is jumpy and pauses way more than on my Apple TV. Biggest complaint is that HBO, Showtime, etc. are nor supported on Comcast/Xfinti. Disagree with those who are blaming Comcast entirely -- although surely that always deserve blame. But those apps are supported on Comcast on the Apple TV -- meaning that Apple did manage to reach a deal with Comcast where Amazon did not.", "verified": true, "helpfulness": "0/0", "author": "al1947"}, {"rating": 3.0, "review": "Amazon prime works great.  Netflix app seems to lose connection all the time and you have to exit out and reboot your movie.  Coincidence???  because this is a Amazon product??  maybe.  You decide.", "verified": true, "helpfulness": "0/0", "author": "V. Fallon"}, {"rating": 5.0, "review": "I got the fire stick for my mom to be able to watch Netflix.  Sooo easy to install and use,  even for the technically challenged. Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]