[{"rating": 4.0, "review": "I was flip flopping between Fire TV Stick ; Chromecast and Roku as my streaming device of choice.  Three months ago I finally tried the Fire TV Stick.  It was truly plug and play into my TV.  Finding it would run both PLEX and KODI apps was a real plus since I have an old media center PC with 4 tuners recording OTA Broadcasts.  To stream from the web and lan with one device tops the ROKU and Chromecast.  I was so impressed I bought a second stick last month.  The HDMI2AV converter was necessary for the older composite video tube tv.  But it works flawlessly with Fire Stick.  Last Night I hit the real bummer of the TV Stick though.  You must have an internet connection to Amazon Services for Stick to work.  Loss of the internet means PLEX and KODI which are LAN apps fail cause the Stick Fails. Hope the next software release includes a local mode for local only apps.", "verified": true, "helpfulness": "0/0", "author": "Robert C. Lightfoot"}, {"rating": 3.0, "review": "Its not set up to work with all the channels for att uverse very limited", "verified": true, "helpfulness": "0/1", "author": "J brown"}, {"rating": 5.0, "review": "love this, good-bye cable TV!!", "verified": true, "helpfulness": "0/0", "author": "ELR"}, {"rating": 4.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "andrew sicard"}, {"rating": 5.0, "review": "I have used the Apple TV before, but this device is 100% better. After using the Fire TV Stick for a day it has overtaken my Apple TV already. My review will be sort of comparing the two.PROS:• It has better hardware and is faster than the Apple TV that I have.• It allows for more accessibility. (With the Plex app I can mirror anything from any device that I have without just being limited to Apple devices on my Apple TV)• It recommends you movies and games based on what you have watched or played.• You can use your phone or tablet to control it via the Fire TV app.• The controller has more functionality than the Apple TV remote.CONS:• It does not have that much storage. (Although you won't need that much since you can just stream everything)• You need a very strong connection to get everything to work properly. (I had to move it to the TV that was closer to my router)• There is slight lag when exiting out of applications.", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 5.0, "review": "KODI is your friend", "verified": true, "helpfulness": "0/0", "author": "Misses Qu"}, {"rating": 5.0, "review": "AWESOME product, thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "S.H.Oglesby"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Thomas M. McFarlin"}, {"rating": 5.0, "review": "I took this on vacation with me this summer and found it perfect for watching Netflix and Amazon Prime Video while in a condo.  The setup was dead-dumb easy and everything worked right out of the box.  When we moved from the condo to a hotel later in the vacation, it was again easy to plug in the Fire TV Stick and immediately continue watching a Netflix series.  I can't imaging traveling without the Fire TV Stick on any future trips.", "verified": true, "helpfulness": "1/1", "author": "Kent L. Weitkamp \"kweitkamp\""}, {"rating": 5.0, "review": "Exactly what I needed", "verified": true, "helpfulness": "0/0", "author": "Dorothy Robey"}]