[{"rating": 5.0, "review": "Unless you want to play some intense games there's no need for a set top. This is lower profile and does everything I need it toFire TV + Kodi = win", "verified": true, "helpfulness": "0/0", "author": "Ken Ishiguro"}, {"rating": 5.0, "review": "Love it!  I had Apple TV also and nw this is the one I use. Much faster and no crashes like Appple had. What I mean by crash is the spinning wheel.", "verified": true, "helpfulness": "0/0", "author": "Chris Desani \"Product Man\""}, {"rating": 5.0, "review": "Works perfect, no issues.", "verified": true, "helpfulness": "0/0", "author": "Dustin Twietmeyer"}, {"rating": 5.0, "review": "Great way to buy a non smart tv for cheap & make it just as smart!", "verified": true, "helpfulness": "0/0", "author": "E. Bloch"}, {"rating": 5.0, "review": "Awesome. Better than I thought it would be. Very easy to install and start using immediately. I'm a Prime member so there's lots of free TV to watch. I'm excited to play video games when I get the controller next week!", "verified": true, "helpfulness": "0/0", "author": "crunchtastic"}, {"rating": 4.0, "review": "Excellent and easy so far! No complaints whatsoever!", "verified": true, "helpfulness": "0/0", "author": "Hilary Frisch"}, {"rating": 5.0, "review": "So much fun", "verified": true, "helpfulness": "0/0", "author": "Victor R."}, {"rating": 5.0, "review": "Best thing we've ever bought on Amazon. And we have a Visio Smart TV, but it always slow down during movies. The fire stick is very fast and would love it!", "verified": true, "helpfulness": "0/0", "author": "MTB Man"}, {"rating": 1.0, "review": "NO.  All it does is keep you going to things you either have to pay for or don't want to watch.  I mainly wanted it to watch art videos, especially the 400 free tv art videos that are offered on weekends that are advertised on my kindle fire tablet email.  when I do find art videos with the fire stick it still won't let me watch.  All I get is directed to something I have to pay for which wouldn't be so bad if it was something I actually wanted to watch.", "verified": true, "helpfulness": "0/0", "author": "Kindle customer five stars"}, {"rating": 5.0, "review": "The Fire Stick is awesome.  I like it better than Chromecast!Pros:  Includes a remote so you don't need to use your device (cell phone, tablet) as your remote like ChromeCast.  Video quality is better and faster download speed in my opinion.  Love the additional apps that come along with it.", "verified": true, "helpfulness": "0/0", "author": "jaye210"}]