[{"rating": 5.0, "review": "The more I use this, the more I like it.  It allows me to watch Netflix and Amazon Prime in rooms that weren't possible before.  The best thing, it came per-progammed and I didn't have to do anything with it ... it just worked.  The hardest part of this gadget was figuring out how to install the batteries and that wasn't too tough.", "verified": true, "helpfulness": "0/0", "author": "Rick Utgaard \"Rick Utgaard\""}, {"rating": 2.0, "review": "Just about the most aggravating device I have in my home. Everytime I want to connect with it I have to search and search and search for it then when It finds it I have to try and connect several times. I have a strong fast wifi signal so I don't know what the deal is the thing I've found is that if I search with my phone and tablet at the same time I find it right away but connecting is still hard. I have the Google Chrome and have had no trouble with it at all. One more thing I like all out chrome better is that you can look around for your next show while your watching something and on fire stick you have to wait until your done with your show then hit the home button and shop around.", "verified": false, "helpfulness": "1/1", "author": "unionyagow"}, {"rating": 5.0, "review": "My husband and I easily hooked up this with the simple instructions.  It saved us a lot of money as we have prime and there are so many movies, etc. at our fingertips on our plain TV.  Thanks Amazon!!  cw", "verified": true, "helpfulness": "0/0", "author": "cw"}, {"rating": 3.0, "review": "It works OK. Don't misunderstand though, it's just a vehicle for video and music…you have to pay for access (Amazon Prime, Netflix, Hulu, etc.). Make sure you have two hdmi inputs too, otherwise you will have to switch back and forth between the stick and your cable. My biggest gripe is that the tiny remote is really difficult to control. I can tell they were trying to keep it simple, but there are too few buttons to make all of the commands. And it's so small (are we putting it in our pockets for any reason?) that it's really difficult to control (and easy to lose!). I'll ask it to move one space to the left or right and it'll jump 5 or 6. Lot's of starting over on search when it screws up your letter commands. I've had it a week and a couple of times have just given up. If you have a Netflix subscription, do your searches on your computer. They make it super easy for Amazon video though (surprise!). BUT- improve the remote, and make searching easier and I can see how it'd make me cancel my cable subscription.", "verified": true, "helpfulness": "0/0", "author": "Mark R. Wagner"}, {"rating": 5.0, "review": "Haven’t used it to much yet, but I hope to watch lots of movies on it and use my Amazon Prime more efficiently.", "verified": true, "helpfulness": "0/0", "author": "iltxok2"}, {"rating": 5.0, "review": "AWESOME!!!", "verified": true, "helpfulness": "0/0", "author": "Carrie"}, {"rating": 1.0, "review": "The Firestick seemed like a good product except it apparently does not have sufficient memory to ensure continuous streaming. It became so frustrating that we went back to our old ROKU which worked perfectly with no issues.  The Firesticke control is superb, but lack of memory is a deal killer.  Watching a two hour movie takes four hours because it starts and stops.  Don't buy until this is fixed!", "verified": true, "helpfulness": "1/1", "author": "J. Latimer"}, {"rating": 5.0, "review": "LOVE IT!, glad I waited on this stick!", "verified": true, "helpfulness": "0/0", "author": "Eugene Henley"}, {"rating": 5.0, "review": "It does a good job as advertised.  The price is excellent and very easy to install.  It's important that the USB power comes from the ac adapter supplied and not other sources, otherwise you could experience lockups.", "verified": true, "helpfulness": "0/0", "author": "Gordon"}, {"rating": 5.0, "review": "better than advertised. I highly recommend every one get one.", "verified": true, "helpfulness": "0/0", "author": "Joseph Russo"}]