[{"rating": 5.0, "review": "Cheap way to turn your TV into a smart TV.  If you are a Netflix user, then this is a must.  Would like to be able to take along on hotel trips but I am not sure if they have improved it yet to be able to log onto the hotel web.", "verified": true, "helpfulness": "0/0", "author": "Donald A Chapin"}, {"rating": 3.0, "review": "I haven't had time to use it enough to have a strong oppinion", "verified": true, "helpfulness": "0/0", "author": "Eugene"}, {"rating": 5.0, "review": "This tiny little stick contains way too much amazingness...I'm addicted and totally okay with this fact.  It's super easy to install and use - I'm always a little cautious of new technology but it didn't take me long to figure it out.  Just one more way Amazon is making my life easier...", "verified": true, "helpfulness": "0/0", "author": "Lisa Maurer \"True Story Book Blog\""}, {"rating": 2.0, "review": "I waited over a month to get the Amazon Fire Stick because it sold out on Black Friday in less than 2 hrs at BestBuy. The review looked great but there was no mention of not supporting users outside the USA. I have a second home south of the border in Baja Caliornia near the beach and wanted to use the Amazon Stick with the family instead of having to deal with DISH TV satellite provider. After contacting Amazon customer support and troubleshooting the error the CS IT informed me that Amazon only supports USA IP addresses. No mention of Canada?", "verified": false, "helpfulness": "1/1", "author": "EDUARDO REYNOSO"}, {"rating": 5.0, "review": "Not quite sure how I lived without it!", "verified": true, "helpfulness": "0/0", "author": "Janine Reeder"}, {"rating": 5.0, "review": "Easy installation. Along with my Prime, great choices available.", "verified": true, "helpfulness": "0/0", "author": "Kathy Leviant"}, {"rating": 5.0, "review": "Awesome ! No ugly cords or bulky box. It's just a sleek small remote that delivers tons of entertainment !", "verified": true, "helpfulness": "0/0", "author": "cirilo cabezas"}, {"rating": 4.0, "review": "Better than I thought it would be. Works well!", "verified": true, "helpfulness": "0/0", "author": "Kaiwa W."}, {"rating": 5.0, "review": "I bought this for a xmas gift for my boyfriend.  He hadn't even heard about it yet... thankfully not paying attention to the commercials! lol  After I bought it I talked with a few of my techie friends and was not happy with what I heard... but I have to say I'm pleasantly surprised!  This thing has made my life so much easier... I was gonna have to call the cable company to come out and run a line to the kitchen and this solved that problem.  The glitchieness that I thought I would experience I'm not... it runs flawlessly!  I love this thing so much I'm planning on dumping the expensive cable provider and going with this and Plex.tv as my whole house solution!  I'm so excited I really can't stand it!!!", "verified": true, "helpfulness": "0/0", "author": "Brenda Stephens \"Brenda Stephens\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Craig heatter"}]