[{"rating": 5.0, "review": "We are loving the options we have now with the fire stick", "verified": true, "helpfulness": "0/0", "author": "Alexis Smith"}, {"rating": 3.0, "review": "So, I have to amend my original review, because I discovered that the issues that I was having weren't all related to the Fire TV Sitck. Most of the problems were caused by my internet service. I called and had that fixed and most of my Fire TV Stick issues were fixed, even the issue with the remote not working properly. However, I'm still having issues with HULU Plus, which plays sound but the picture freezes right from the start of the program.If you ask tech support, its my internet provider. If you ask my internet provider, its the Fire stick because I'm not having issues with any of these apps on my other devices. Could be that the Fire Stick just doesn't work well with HULU Plus.", "verified": true, "helpfulness": "0/0", "author": "Mita Joey"}, {"rating": 5.0, "review": "How easy is this to get running on your TV or computer monitor?Even a five-year-old can do it in five minutes. It took me ten minutes though.At 62, 10 minutes is the new 30 seconds, so don't be smug. I mean, when my wife says, please hurry dear, I have to use the toilet, guys my age respond, I'll be finished in 30 seconds... Well, you get my point.I opened the box, glanced at the instructions, plugged the HDMI connector into the TV, and installed the batteries into the remote. Voila? No.Now, I fully read the instructions after my smarter half says, \"Maybe you need to plug the HDMI connector into the wall outlet.\"Grudgingly, after I read it, \"You're right.\"\"I'm always right.\"So, after plugging into my computer monitor, because I've already used all my outlets at the TV, I turn on the monitor. Instantly, I see an icon designed to look like my remote.I pressed the home key, shaped to resemble Flo's horrible drawings on that Progressive Insurance bundle and save TV commercial. Instantly some cartoon character appears. (I would rather have seen the instructor look more like Flo), and he quickly and effectively gives a guided tour.Honestly, it took more time to write this review than to install and become a competent user of Fire TV Stick.I hasten to add, I also own two different versions of Apple TV, which I also love and will continue using at my bedroom TV.All in all, though, I find Amazon's Fire TV Stick superior to Apple TV, but ONLY if you are an Amazon Prime member, which I added when I bought the stick.", "verified": true, "helpfulness": "1/1", "author": "C William Anderson \"Charles Wm Anderson\""}, {"rating": 1.0, "review": "The remote is awful.  It's almost impossible to control program selection.  I don't know whether it's the remote or the firestick.  In any case, if it can't be fixed, I want a refund. By the way, the iphone app is not much better.JHZ", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "My network picture was low quality and sometimes would not connect at all. It finally stopped working altogether.I liked it when it worked.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent, however we've only had it a few days.", "verified": true, "helpfulness": "0/0", "author": "John Pedersen"}, {"rating": 5.0, "review": "This was a gift for my sister and they love it.", "verified": true, "helpfulness": "0/0", "author": "rquiles"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/1", "author": "Lili"}, {"rating": 5.0, "review": "I have 2 of these Fire Sticks. They work great and were easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Phillip Poyer \"pgolfco\""}, {"rating": 5.0, "review": "The fire stick worked just as expected. I read a lot of reviews and the positive far outweighed any negative so I purchased it. Simple to set up and all the Prime movies and shows were instantly available on my \"dumb\" tv. I can tell you to read the reviews and apply your circumstances cause you will usually find someone is or has the same experience. I have not been disappointed with any of my Amazon purchases and come to expect quality from their products and pure marketing from actually users. Thanks again Amazon. (prices are always competitive. )", "verified": true, "helpfulness": "0/0", "author": "Gary Updegraff"}]