[{"rating": 5.0, "review": "This is wonderful! I received it as a gift and have now bought a second one for another TV. How did I live without it???", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 1.0, "review": "I am very disappointed with this. The first did not work so we returned it and got another. This one is junk also.It drops our wifi and now it disconnected our Amazon account.  It is very difficult to pick which movies are free with Prime. We got charged for a movie we couldn't even watch.  Very disappointing.", "verified": true, "helpfulness": "0/0", "author": "Nancy Linwood"}, {"rating": 4.0, "review": "DIFFICULT TO SET UP BECAUSE I HAVE AT&T; WIFI BUT PERSEVERED AND COMPLETED.  RUNS GREAT AFTER I FIGURED IT OUT!", "verified": true, "helpfulness": "0/0", "author": "D.A. DONAHUE"}, {"rating": 5.0, "review": "This was great for me. I was trying to get the \"older\" members of my family to understand the joy of Prime Instant video and Netflix as the originals are some of the best things to watch right now. My Aunt carries hers around from house to house as she works around the coast. My parents and in-laws both got one as well and now cant get enough.", "verified": true, "helpfulness": "0/0", "author": "Curlytopcoffee"}, {"rating": 5.0, "review": "It's better than a seashell. It is very easy to use. We like that we do not have to go through our blue-ray player to watch Amazon Prime TV since the new TV we bought (although it said it was a smart TV) does not connect to Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"mountain reader\""}, {"rating": 5.0, "review": "I love, love, love the Fire TV stick.  I love being able to easily access Netflix and Amazon Prime content.  Plus, they have a bunch of other cool free channels you can subscribe to like a workout channel.  My favorite thing about this is I can start watching something on my Kindle in bed and then move to the couch and immediately have the show play from the same place.  We have a Roku too, and I don't notice much difference between them.  The reason I like the Fire better is simply because of the way it works with my Kindle.", "verified": true, "helpfulness": "0/0", "author": "Kris10"}, {"rating": 5.0, "review": "Love the device . Easy to setup and use.", "verified": false, "helpfulness": "0/0", "author": "David H. Skyers"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Diane Potter"}, {"rating": 5.0, "review": "works just fine.", "verified": true, "helpfulness": "0/0", "author": "K. Henry"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "robdady"}]