[{"rating": 5.0, "review": "Tis a good stick", "verified": true, "helpfulness": "0/0", "author": "Bryson"}, {"rating": 5.0, "review": "This is amazing", "verified": true, "helpfulness": "0/0", "author": "izzy0014"}, {"rating": 5.0, "review": "Very nice for the price", "verified": false, "helpfulness": "0/0", "author": "RAYMOND MAUGERI"}, {"rating": 5.0, "review": "Pure awesome in a tiny package! I just wish they weren't backordered until Jan. I want to give these as gifts.", "verified": true, "helpfulness": "0/0", "author": "Raincity Kyle \"No Day But Today!\""}, {"rating": 5.0, "review": "I am pretty happy just wish that hbo was available", "verified": true, "helpfulness": "0/0", "author": "richard l dorsey iii"}, {"rating": 3.0, "review": "Got mine last night. The good. Super easy to set up and nice clean interface. Pretty zippy too (faster than the roku stick). Three problems so far that I am hoping are just early launch bugs 1) I have a nexus 5 phone and can \"cast\" my screen. That works but video playback is awful. 2) I downloaded the remote app for my android and it couldn't find it when it searched for devices, and 3) allcast didn't work for me either. I was connected to the same WiFi network on my phone and my fire stick, FYI. Other than that, pretty cool. Id probably reccomend this over the roku stick.", "verified": true, "helpfulness": "0/0", "author": "chiefsfan1230"}, {"rating": 5.0, "review": "What a great product! I had previously purchased the Chromecast for use on our main TV in the living room to stream material from a tablet or my smartphone. I have a Fire TV in our bedroom that I use on a regular basis. When I got notice of the discounted Fire TV stick, I jumped on it. Since receiving the Fire TV Stick I have not used the Chromecast a single time.The Fire TV Stick works almost as good as the Fire TV. Out of the box the only difference is the size, the lack of a voice control remote, and the speed. The size is nice because it plugs into the back of the TV and you never see it again. The lack of voice control is not an issue, since I use the Fire TV App to control the stick. The speed difference between the Stick and Fire TV is minimal. If you did not use the Fire TV before the stick, you wouldn't even notice it. As far as the apps, it has everything I would use on the Chromecast except HBOGO.The only problems I have had are getting familiar with the Fire TV app. It is difficult to use at first, but becomes easier with practice.Overall, it is one of the better \"Tech\" products I have purchased over the past few years. In fact I purchased a few as gifts for family members for Christmas (Although, I purchase them through Best Buy who was having an awesome sale on them).", "verified": true, "helpfulness": "0/0", "author": "B. Rod"}, {"rating": 5.0, "review": "I plugged this in to my Samsung smart TV to test it and was blown away...so much so I've decided to use it instead of the smart TV features (in defense of Samsung, my TV is an earlier generation of smart TV...I understand the platforms are improves today)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"jkhinch\""}, {"rating": 4.0, "review": "I have a new favorite budget streaming stick... I used to be a huge fan of the chromecast (and still am) but the interface on the fire stick (at the $19 pre-order price) is an amazing deal!  I just wish there was a way to cast a browser to it (or content from an \"i\" device), but for now I will leave my chromecast connected in another HDMI port for the rare occasion I want to do that.", "verified": true, "helpfulness": "0/0", "author": "The Strader"}, {"rating": 5.0, "review": "Works much quicker than my chromecast and with the remote the kids can setup their own shows to watch without needing my phone or tablet.Still trying to setup the music and secondary apps (some ability to do this online would be nice)", "verified": true, "helpfulness": "0/0", "author": "Trizza \"Trizza\""}]