[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It just doesn't work. When I try to watch a show it wants me to sign up for a free 30 day subscription to Prime. I have been a prime member for years. I have Comcasts fastest internet service but it tells me my internet connection is too slow. When I select a show it brings up a \"loading\" screen and the show never starts. I honestly have been a loyal Prime customer for years and generally have nothing but good things to say for Amazon but this product is simply horrible. I can't recommend it at all.", "verified": true, "helpfulness": "0/0", "author": "Alan \"AEA\""}, {"rating": 5.0, "review": "Easy to set up and quality programs", "verified": true, "helpfulness": "0/0", "author": "Terry Noonan"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Yvonne Ashford-fairwell \"Some times i wonder\""}, {"rating": 1.0, "review": "This item was awesome... For about week. Then it started freezing after watching a few episodes. Now I can't get it to play anything at all. It just freezes. I read some reviews that said plugging the HDMI extender in would help, but this hasn't been the case for me. Besides it sits less than 2 feet from my router. I should've just saved my money for a new BLU Ray player with wifi.", "verified": true, "helpfulness": "1/1", "author": "Reader"}, {"rating": 2.0, "review": "As soon as this device saw third party software,  it shut down my WiFi . The latest update is what Sony should have been using.", "verified": true, "helpfulness": "0/0", "author": "MikeHC"}, {"rating": 5.0, "review": "Pure awesome", "verified": true, "helpfulness": "0/0", "author": "brian kelly"}, {"rating": 5.0, "review": "Just buy it", "verified": true, "helpfulness": "0/0", "author": "13 Faces \"13 Faces\""}, {"rating": 3.0, "review": "Easy to install and use but my internet speed is too slow.", "verified": true, "helpfulness": "1/2", "author": "Lissa Brown"}, {"rating": 4.0, "review": "This was my first time using a streaming device for our tv and I like it. I am not the most tech-savvy person and this was pretty simple to use. The most difficult thing about this was trying to get the back of the remote off to put the batteries in. It was surprisingly difficult to remove, but after looking it up on the internet, I was able to remove it. That definitely needs to be fixed.The name \"Fire TV Stick\" is totally appropriate because I always feel like my device is going to catch on fire from being so hot. I read online that it is fine to leave it plugged into the tv, but I feel like I need to unplug it after each use due to the extreme heat. Not sure if this is a defect or it I just watch too much tv at once. I promise you, I do not sit in front of the tv all day, but I do tend to watch a few episodes of shows after my child goes to bed.Overall, I am happy with my Fire Stick and feel like I am in the loop now, so thank you, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Flora"}]