[{"rating": 1.0, "review": "Replaced first one. The second one won't work, talked to tech support two or three times, said they would resolve it in one to two days, four days ago. No resolution. Trashing the unit, tired of tinkering. Many better alternatives available.", "verified": true, "helpfulness": "0/0", "author": "Stephen Rudolph"}, {"rating": 1.0, "review": "No matter what I tried, I couldn't get it to work. I returned it promptly.", "verified": true, "helpfulness": "0/0", "author": "JEB"}, {"rating": 4.0, "review": "We really wanted this to watch Netflix without watching it on our laptap, it's exactly what I wanted! Was very easy to set up and the remote is very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Lana"}, {"rating": 5.0, "review": "Works very well.  Enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Jerald W. Lang \"Jerry\""}, {"rating": 4.0, "review": "If I didn't have Netflix it wouldn't be any good. Prime wants to charge for episodes that I want to watch", "verified": true, "helpfulness": "0/0", "author": "Charles Spires"}, {"rating": 4.0, "review": "The fire stick is fine I have the firebox and it's memory is full and you can't even clear it tha t is a problem amazon you using up 5g left me not much for apps. Had to go buy another android box the xuum which has 8 gb of storage and a 32 SD card slot a 4 USB ports for the same price and I got an air mouse. You all need to vamp up the firebox for real let's see how long the stick last", "verified": true, "helpfulness": "0/0", "author": "Weekdaygirl"}, {"rating": 5.0, "review": "I already had Google's Chromecast, but when this was on sale during Prime Day, I couldn't pass it up.  What I love is that unlike Chromecast, I don't have to use my computer to cast to the tv, but can use the menu or remote or remote app to search for any movie or genre on the tv screen.  The computer never has to come into play, which is great for my husband who is not a computer geek like myself.  I will probably rarely use Chromecast again, I also recommend downloading the free remote app to your phone or tablet, which allows you to search using voice commands.", "verified": true, "helpfulness": "0/0", "author": "L. Henderson"}, {"rating": 5.0, "review": "Very easy to install, very easy to use ..Great access to lots of TV viewing, thinking about downsizing my cable service now ...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a great value and very good media device. The interface is slick and operates very smoothly. There are many ways you can extend the Fire's capability if you are technically inclined and explore the forums. The device is already registered to your Amazon account when you receive it which is a nice touch. Setup was simple and easier to connect to my network than the Chromecast. The remote is a great add at this price point. Note that the Fire TV/Stick can be controlled with the newer Logitech remotes, but not with the older Harmony IR based remotes. It doesn't seem to like being powered through the USB port on the TV. However the cable is long enough to use the power adapter with a normal outlet.I previously used a Roku as my primary streamer with an AppleTV for airplay. I also have a ChromeCast. The FireTV stick has replaced the Roku as my go to device. While on the surface similar to the Chromecast, it is a different device altogether. The Chromecast has no user interface of its own and relies on a smartphone, tablet, or computer to stream on your TV. While a great device in its own right it is not really the best choice as your primary home streamer. The Fire TV Stick is an equivalent to the Roku stick, but in practice is more comparable to the full Roku streamers - it has a surprising amount of processing power and works just as fluidly as a a Roku 2/3. I prefer the Fire TV interface; even though some technology review sites suggests it pushes Amazon content in your face I don't really find that to be the case and it provides equivalent value even if you are not a Prime subscriber. The Roku has a unified search across all media channels and has a vast amount of channels you can add, but that's less of an advantage if your viewing is focused on the main providers like NetFlix, Hulu, SlingTV and Prime. For me the user experience with the Fire TV is better and negates those advantages. Unless you live primarily in the Apple ecosystem, the Apple TV is a secondary device at best if you use Prime to any extent.In the end your choice for a primary streamer will come down to whether it supports the channels/services you want to view. All of these devices have a gap in their line up. But assuming they all cover what you need in the end I prefer the Fore TV stick. It works as smoothly as the full size streamers but tucks away discreetly in your HDMI port and has a very nice UI that does a great job of blending your Prime content with your normal streaming providers.", "verified": true, "helpfulness": "1/1", "author": "Dennis"}, {"rating": 4.0, "review": "The Amazon Fire TV Stick is great.  We are thoroughly enjoying it.  I especially like being able to mirror my Kindle on the TV, as I make a lot of pictures and videos.  I can now share them with family or friends so easily.  We are enjoying streaming Prime Movies, also.", "verified": true, "helpfulness": "0/0", "author": "Betty C. Haynes"}]