[{"rating": 5.0, "review": "Great product was up and running in minutes", "verified": true, "helpfulness": "0/0", "author": "got riped off"}, {"rating": 5.0, "review": "Easy to set up! We love it!", "verified": true, "helpfulness": "0/0", "author": "Angela S."}, {"rating": 4.0, "review": "It's a nice device but I already have so many others. I like this device well enough but it's still missing some features. I have the Tivo Roamio, Roku 3 and the Chromecast and this guy just isn't compelling enough to make me want to use it full time. The place that I can see this one being useful is on the road. It has a remote (already better than Chromecast for that reason).Pros:Slingplayer for mobile - works with remote and the app is free. Don't need a phone to use it. Just log in and watch.The Remote - who doesn't like that? It helps with so many thingsThe network - save multiple wireless connections. you can't do that on Roku or ChromecastGames - there are several little games to play. You can't do that on the Chromecast and the Roku is very limitedAmazon content - video and music are rock solid on this deviceCons:Missing several apps (google play, vudu, for example. Roku has so many more)Wifi Hotspot not working yet. This will be a big plus when it happens.Can't use your playstation controllers with the games without sideloading apps. This should be officially supported.I used the Amazon Fire Stick on a recent trip but without the hotspot/wifi update for hotels then it's not as useful as it could be. I was able to use it with my TP-Link TL-MR3040 with the wifi bridge for this purpose. It gets past the hotspot login by allowing the device to bridge with a device that has a browser so that you can get past the login page.*** I contacted Amazon support on 3/22/2015 and they still don't have hotspot/hotel update and could not tell me when it will come out. I also asked for firmware update information link so that I could know what has been updated so far but they could not produce it. I don't think they really know anything about their product. At this point....I would say that this is a vapor feature and should not be expected to be implemented. However, if they do they I will change my review to 4 stars.I'll update this post with 4 stars when the update comes out for hotspot/wifi hotel usage. That's really the only reason that I purchased it in the first place.---- Update ----Amazon has added hotspot to the device... so I've changed my rating to 4 stars.", "verified": true, "helpfulness": "0/1", "author": "trek"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "R. Roy"}, {"rating": 3.0, "review": "Installation was fairly easy, but I can't get any sound on the radio apps, and my music will not download.", "verified": true, "helpfulness": "0/0", "author": "Frederick W. Chapman"}, {"rating": 5.0, "review": "LOVE IT! This thing makes any tv a smart tv and is extremely easy to use. I have a little 24\" vizio that is beautiful and works well, but wasn't a smart tv and we were getting ready to throw it out. Instead, I got this and a wall mount and I'm super satisfied with the result. Really a great device. My only gripe is that HBO Go is not supported yet. That's a pretty serious miss... Otherwise, it's fantastic.", "verified": true, "helpfulness": "0/0", "author": "I.B. Miller"}, {"rating": 4.0, "review": "Still getting used to this. So far so good. Hooked up easy. Instructions were easy.", "verified": true, "helpfulness": "0/0", "author": "Linda Grahn"}, {"rating": 5.0, "review": "It's so easy to set up, so fast to load, this thing has been amazing. I bought it with the $20 intro Prime price and should have bought 5 more for every TV in the house. I love it and can't say more good things about it. With Plex it's been perfect.", "verified": true, "helpfulness": "0/0", "author": "That One Guy, Over there."}, {"rating": 3.0, "review": "Luckily I bought the Fire Stick for $19 on sale for being a prime member. After using it for the last few days I am glad I didn't pay full price. It buffers quite often especially while streaming Netflix. As an owner of 3 Rokus I was hoping I would like the Fire Stick just as much however as of now this isn't the case. I hope it improves it's performance because it's lacking now.", "verified": true, "helpfulness": "0/0", "author": "c cook"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]