[{"rating": 2.0, "review": "I was expecting to be able to use a browser and it's not possible at all. But apart from that it's very nice.", "verified": true, "helpfulness": "0/0", "author": "Flavia Igreja"}, {"rating": 5.0, "review": "Love it!  Makes streaming media simple as can be.  Every Amazon Prime member should own one.My only regret is that I didn't buy one sooner.", "verified": true, "helpfulness": "0/0", "author": "Chris Altman"}, {"rating": 3.0, "review": "Week signal reception.", "verified": true, "helpfulness": "0/0", "author": "Darrel Burger"}, {"rating": 2.0, "review": "I found it annoying! I already have a Roku on another TV and thought I would try the Fire Stick. I felt like I had to back out of Amazon to get to Hulu and Netflix. I returned it and got another Roku.", "verified": true, "helpfulness": "0/0", "author": "Terra"}, {"rating": 4.0, "review": "Well, I think I am going to enjoy this. I am not much for network TV but love the idea of streaming movies and the Sopranos. I am sure I will find much more as time goes on.", "verified": true, "helpfulness": "0/0", "author": "Lottie"}, {"rating": 5.0, "review": "No complaints. Awesome device.", "verified": true, "helpfulness": "0/0", "author": "Movie Master"}, {"rating": 5.0, "review": "Easy to use and good quality. There is plenty to look at so you can probably delete some programs you pay for from cable. It is a pretty intuitive software package that runs the programming. The price is so reasonable that I bought two of them; one for upstairs and one for downstairs. I would recommend them to anyone.", "verified": true, "helpfulness": "0/0", "author": "MD"}, {"rating": 5.0, "review": "the fire stick works as advertised. And I enjoy using my smartphone to control the fire stick.", "verified": true, "helpfulness": "0/0", "author": "TA"}, {"rating": 3.0, "review": "Although I love the Fire Stick, I think it might have been better to get the Fire TV.  We have found when we are watching movies, it stops working as it tries to load.  It works fine for series and shows, but not for movies.  I love Amazon Prime, and I am disappointed it doesn't transfer as well to the the tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "best purchase ive made for the money' item works far better than chromecast", "verified": true, "helpfulness": "0/0", "author": "scotty b"}]