[{"rating": 4.0, "review": "I ordered this when it was on a special promotion for $20. I wish I ordered more. My sister has a Roku and loves not paying for cable. I'm not there yet but I love my Prime movies and TV. I set it up, which only involved plugging it in and typing my wifi password and it was good to go. There is not as much content as Roku, but I wanted this for an extra TV that isn't used all the time and not hooked into cable.It works great. The picture is great and I am very happy. It's better than other options that only work with android (I'm an apple user) and I'm waiting for the app to turn my phone to a remote so I have more options. It is worth the purchase. Amazon has yet to let me down.", "verified": true, "helpfulness": "0/0", "author": "And I Quote \"My Soap Marks\""}, {"rating": 2.0, "review": "Who do I upgrade?  Movies are old.", "verified": true, "helpfulness": "0/0", "author": "D walker"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "Yes like others I picked this up for $20 and finally had time Thursday to connect it. It's easy to do and have already put in my favorites. I use a small wireless internet company so I might not be able to watch HD but really don't care. When I get some more time I'll ad the app to my Moto X phone so it will be voice active.", "verified": true, "helpfulness": "0/0", "author": "jo6pac"}, {"rating": 5.0, "review": "Trouble free easy to install and a pleasure to use. I love amazon", "verified": true, "helpfulness": "0/0", "author": "Zamir Tarmu \"z\""}, {"rating": 5.0, "review": "I am very pleased with this device!Solidly built, all the pieces included were well though out logical components;USB/AC brick small enough and with folding prongs to be travel friendly,USB cord long enough to be useful,HDMI 'extension' dongle (which I use at home) to help fit high density plug areasInstant WiFi setupSo far the menu has been easy to use, with seamless mobile app/device integration (Samsung Note 3) voice search and shared watchlists work well.  And having Prime Video  remember play stop locations on the Stick is just plain cool.The PIN to purchase is a great addition for multi-resident/child homes. And quick enough to not slow down normal viewing.Definitely recommending this to friends as a great wi-fi streaming device, both home and portable.", "verified": true, "helpfulness": "0/0", "author": "Celebrin Veladorn \"CV\""}, {"rating": 5.0, "review": "I want to start off by saying this is my first device of this nature. I have only used my Kindles to stream video, so this was a great treat to be able to purchase for such a low price. I have a media center that is set up to accommodate many HDMI devices so it was a snap plugging it in and getting it power (I have a power strip right by my HDMI port hub). It did take some time to get going as it has to update itself, so be patient. Once it is going though, it was very easy to use. It has a very simple interface, which is nice. It is streaming very well. The only streaming issue I have seen is when we have several devices in our home trying to stream all at once. My 4 year old has started watching more of her cartoons on the TV now and not 2 inches from her kindle. It is just a great device and I am very happy about my purchase.", "verified": true, "helpfulness": "0/0", "author": "Sarah B \"Sarah B\""}, {"rating": 4.0, "review": "i like the functions better than apple on the controller", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 1.0, "review": "keeps dropping wifi, worked for 10mins, not worth the hastle", "verified": true, "helpfulness": "1/1", "author": "Luke"}, {"rating": 5.0, "review": "I am no techy. this was easy to use and works well.", "verified": false, "helpfulness": "0/0", "author": "Adele Barnett"}]