[{"rating": 1.0, "review": "Too frustrating to use. Go buy a smart tv and save your sanity.1. Set up was a form of torture2. Every time I try to watch Netflix by the time I figure out how to get to a movie I just give up3. I have to put in the internet password every time4. That remote is too small for mY fat fingersI regret not spending the extra 200 dollars on a smart tv.", "verified": true, "helpfulness": "2/3", "author": "Patricia"}, {"rating": 5.0, "review": "Absolutely love it. We are full time RV'ers  and have been fighting with DTV for 20 years but are telling them goodbye. Also have a Ruku but it has one major flaw... you cannot sign on to a wifi which has a code (most do). The fire tv stick is totally portable and can be used anywhere you can connect to wifi. We are presently in a remote corner of Wyoming and within minutes of its arrival we have tv back. Thanks Amazon, you came thru again. Love you.", "verified": true, "helpfulness": "0/0", "author": ". Thibodeaux"}, {"rating": 2.0, "review": "This is good for getting your parents set up with Netflix/Hulu.There's no way to run the audio through my receiver so I can only listen on my crappy TV speakers. It doesn't stream video files from your network unless you hack it. Therefore it doesn't work well for me, but it may for you.The remote uses bluetooth which I actually think is a negative because I can't use my Harmony remote to control the Fire Stick.", "verified": true, "helpfulness": "1/1", "author": "Craig Patik"}, {"rating": 5.0, "review": "Amazing I watch this more then my tv", "verified": true, "helpfulness": "0/0", "author": "Terri T."}, {"rating": 4.0, "review": "you need to plug this thing into power for it to work reliably, which kind of defeats the purpose of it being a stick. Also, I find myself missing the voice search feature constantly.", "verified": true, "helpfulness": "0/0", "author": "Brian Stensrud"}, {"rating": 1.0, "review": "This is a terrible, terrible product. I have rarely written reviews and when I do, I prefer to leave positive feedback. That said, I have called amazon's customer service about every other day since my fire stick arrived. I adhered to all the installation recommendations and the thing still can't hold an internet connection. It drops all the time and when I called my cable/internet provider, they said they'd received a ton of calls from people with similar fire stick issues. I am beyond disappointed in the fire stick and with amazon for releasing such a faulty product. I will call customer service again and this time I intend to ask for a refund. This thing is the worst.", "verified": true, "helpfulness": "1/2", "author": "AmandaM"}, {"rating": 1.0, "review": "Purchased the fire tv  stick during prime day sale. Thought it would be a cheap easy way to connect the tv in the bedroom to the internet unfortunately  even though the device is one room and only 25 feet from Netgear Nightwawk router the device freezes and locks up constantly making it impossible to watch an entire show. The device is plugged in to AC power as recommended and the network strength is robust enough that the playstation 4 down stairs and the xbox in the basement both connect flawlessly.Also if the device needs external power the cord should be longer since the device plugs into an HDMI slot which is a couple of feet higher and on the opposite side of the tv from the power cord.", "verified": true, "helpfulness": "1/2", "author": "Longtimecustomer"}, {"rating": 2.0, "review": "It buffers constantly and the picture is fuzzy when watching Netflix and Amazon Prime Videos. I do not have that problem when I watch those apps on my blu-ray player. Pretty disappointed.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Even for a non techie who gets excited with a new eraser top for the pencil - this was easy and love the results - great product", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 4.0, "review": "Very easy setup. Works as advertised. Picture quality not so great.", "verified": true, "helpfulness": "0/0", "author": "football fntc"}]