[{"rating": 5.0, "review": "I got this as a gift for my husband and he loves it. We subscribe to Netflix, we have on demand and some premium channels but he has watched nothing but this. He loves how quickly it starts up, as opposed to Netflix and he likes the ease of the remote. It arrived 6 days earlier than anticipated also :)", "verified": true, "helpfulness": "1/1", "author": "Kate Stocke"}, {"rating": 3.0, "review": "Great if you have Hulu, Nexflix, etc, other wise, pretty useless.Also, I don't like how on the commercial, it showed them just plugging into the TV and it working.  No where did it show it needed to be plugged into a power source.  The way my TV is set up, I had to reconfigure the HDMI ports for everything else to accommodate for the power cord placement.", "verified": true, "helpfulness": "1/1", "author": "Josh"}, {"rating": 5.0, "review": "Easy to use and as expected.  use the app to control from iphone.", "verified": true, "helpfulness": "0/0", "author": "leslie bach"}, {"rating": 5.0, "review": "I love my fire stick! Access to pandora, netflix, games and of course the fireplace app for the winter time! I'm still discovery new things I can do on it. It takes two seconds to go from living room to bedroom. I highly, highly recommend the fire stick over the competitors and the price?! Can't beat that!", "verified": true, "helpfulness": "0/0", "author": "Lindsay Reed"}, {"rating": 5.0, "review": "We love amazon prime on our smart tv's. Bought this to use on an older tv and it works great.  Love the amazon original programming.", "verified": true, "helpfulness": "0/0", "author": "K. Campbell"}, {"rating": 5.0, "review": "Great product. Have used prime movies and TV,  Netflix as well as screen mirroring to view numerous movies and HBO series. Easy to setup and navigate. Worth $39.", "verified": true, "helpfulness": "0/0", "author": "Dan Williams"}, {"rating": 4.0, "review": "love it!!! sometimes the buttons on the remote control gets stuck but other than that, it's perf.", "verified": false, "helpfulness": "0/0", "author": "Darlene Holland"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jennifer S. Henne"}, {"rating": 4.0, "review": "Yes it met my expectations thank you", "verified": true, "helpfulness": "0/0", "author": "Victor David Encarnacion"}, {"rating": 4.0, "review": "Some of the movies load pretty slow, there is no free section for movies.Most of the games require a controller for the Play Station and I don't have a controller.", "verified": true, "helpfulness": "0/0", "author": "Sean"}]