[{"rating": 4.0, "review": "Love it I was very happy with how easy it was to set up", "verified": true, "helpfulness": "0/0", "author": "Lynda Mull"}, {"rating": 5.0, "review": "I have the Fire TV Stick and 2 Roku's. The Fire Stick is much faster than my Roku's. My shows start almost instantly with the Fire Stick. I gave it 5 stars because HBO Go is coming soon and I will have everything I want. Great Product!", "verified": true, "helpfulness": "0/0", "author": "Rivmik"}, {"rating": 5.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/0", "author": "ayana maddox"}, {"rating": 5.0, "review": "Love it.  Easiest (and very inexpensive way) to access all my Prime video and music content on the HD tv.  I still have cable for all the sports content so i did not get the full Amazon TV.  This Fire stick is just right for my needs.  Have not even explored any of the apps yet as I have been too busy enjoying the \"free\" Prime movie and music content.  Small and easy to install.  Finds your home wifi network simple as can be.  I have had this for a month and use it almost every day.  Worth every penny in my book.", "verified": true, "helpfulness": "0/0", "author": "hammerhead \"kauff\""}, {"rating": 2.0, "review": "Honestly, I was expecting more from it. I got 2 of them for my house and I'm not a big fan of it. I own the Roku box and the Chromecast, and so far the Roku box is the best. I bought this product when I just came out, so I only paid $20 for it. I have used it for the past 2 months and it just not good. Hulu works every now and then. You could be watching a show and suddenly you get a message from hulu saying that there has been an error. This only happens with the Fire TV stick. Netflix has the same issues. Sometimes the Fire stick loses internet connection for no reason. You have to unplug it and plug it back in. So, I do not recommend this product. Get something else for now. Roku is a reliable product.", "verified": true, "helpfulness": "1/1", "author": "EG"}, {"rating": 5.0, "review": "Love it! Love it! Makes accessing programs and apps on my TV effortless.  Liked it so much I ordered another!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Had no idea that a usb stick would need to be plugged into an outlet.  Also the access it gave us is just a bunch of old movies.", "verified": true, "helpfulness": "1/5", "author": "ActSoft"}, {"rating": 5.0, "review": "Fire TV Stick is everything I expected.  It is intuitive, easy to use and lightning quick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "complete waste of money... It does no work and there are absolutely no instructions with it.  I had to move the TV to a different location and because it took me so long it was too late to return.  I am so totally disappointed with Amazon anyway.", "verified": true, "helpfulness": "1/2", "author": "Andrea"}, {"rating": 5.0, "review": "It's awesome. I love it!", "verified": true, "helpfulness": "0/0", "author": "Sarah"}]