[{"rating": 5.0, "review": "Works really well, I purchased two of them one for the living room and one for the bedroom. I purchased the voice remotes rather than use the remote that comes with the unit. The unit works great, great quality for my subscription services. While the Stick is a gimmick it's a heck of a lot better and cheaper then the Fire TV. The unit does everything that Fire TV does for a lot less money. Save the $99 on the TV and buy the stick with the voice remote..you will be happy you did!", "verified": true, "helpfulness": "0/0", "author": "Roy A. Teel Jr."}, {"rating": 5.0, "review": "My wife and I jumped on the special deal on the fire stick, when Amazon first lunched it(19.99). Wish we would have purchased two but we were not sure if we were going to like it. We do, my wife really likes it because it plays all her music from amazon. We own smart TVs,rokus boxes, a roku stick and now the fire stick;we like the functions of the sticks better because they are faster and don't stop when we are watching them. Thinking about getting the voice remote, Once the fire stick updates to include HBO Go it will be as good if not better than the roku stick. Purchased a second one from B.B. (24.99) during Blue Thursday, because that is it what this day does to your bank account(beats it blue and Friday beats its black). Skip the smart TVs and blue-ray players, buy the sticks (the Amazon fire stick would be a great choice).  We had a issue with it the fire stick dropping our net work, after we contacted Amazon the problem was fixed. No more issues, thanks Amazon for your continued service and great products.", "verified": true, "helpfulness": "0/0", "author": "J. Powell \"Superman\""}, {"rating": 4.0, "review": "Got my Fire Stick on Black Friday from Best Buy for only $24, for the price it's unbeatable. Works great with Amazon Prime but it lags a little with Hulu Plus (must be my internet which is only 1/2 mbps)  . I do prefer my Fire Stick over my Google Chromecast which I hardly use anymore.", "verified": true, "helpfulness": "0/0", "author": "Jainnette T."}, {"rating": 1.0, "review": "Waste of money!  Don't bother!  We've tried everything to get this thing to work.  We even got the remote replaced (which took a 40 minute call with Amazon customer service.)  Bottom line.  Something is defective with this product.  We DO NOT recommend it.  Save your money.", "verified": true, "helpfulness": "0/2", "author": "Carla J. Schuyler \"CJS\""}, {"rating": 4.0, "review": "Love it and bought two with an Amazon introductory 2 for 1 sale.  However, be aware that it will only work with a TV or monitor that has an HDMI input port.  Tried it on an older plasma TV with a DVI port but no HDMI.  Also tried it with an HP monitor w/ DVI.  I used a standard HDMI to DVI adapter that works fine with my DVD player for the connection,  The TV recognized the Fire TV Stick signal but it wouldn't display the picture.  Two conversations with helpful Amazon Tech Support led to the conclusion that DVI is not supported.  So one is attached to my bedroom TV and my sister gets the other for Christmas.", "verified": true, "helpfulness": "1/1", "author": "ben moore"}, {"rating": 4.0, "review": "It's still new and I can tell because it's no Roku. What I will say is, the look of this is absolutely beautiful in comparison to Roku (but I am a minimalist).When I 1st hooked it up, I got the infamous blue screen of death. I was stressed thinking my tv might be too old (32\" RCA DVD COMBO), a problem Roku users do not have to worry about. So all I could do was hope that unplugging everything for 30 seconds before reconnecting would solve the prroblem... IT DID!! ZERO PROBLEMS SINCE, but I do worry it may happen again one day. I brought 2 more as Christmas gifts and I hate that I have to warn them about that possibilty. Anyhow, I love everything else about it, but once again, that's so far. IT IS FAST AND I DO NOT RECALL ANY BUFFERING, so if it has it was an half a second pause. The picture is beautiful. I do not regret my purchase, BUT would have gifted Roku's just to know they wouldn't have any problems. Fx =Fingers Crossed", "verified": true, "helpfulness": "0/0", "author": "JoelTam \"DMV Lady\""}, {"rating": 3.0, "review": "I just got my FireTV stick in today, and I feel so-so about the device. First of all, the one and only major con is the lack or \"buggy\" HDMI CEC support. It is true that if the FireTV is put into Sleep Mode (which is hidden under a bunch of clicks underneath settings) then HDMI CEC works, but if not then good luck with it. It will not turn your TV on when you try to send videos to it from your mobile device, which it shows as FireTV, and it displays it as playing, but it will NOT turn your TV on for you. IT'S 2014 NOW AMAZON; FULL HDMI CEC SUPPORT PLEASE!What I do like about the FireTV is the remote control support. I like that I can use a remote AND my phone to play the shows that I want, and the FireTV has /limited/ support for some smart TV remote controls like the one that came with my NSX40GT1 (discontinued Sony GoogleTV).Maybe (HOPEFULLY) Amazon will be able to add full HDMI CEC support, and I can finally choose FireTV to be the best media dongle to rule them all. But as it is, it's just....alright.", "verified": true, "helpfulness": "0/0", "author": "Linda Phan \"Machinegun\""}, {"rating": 4.0, "review": "The TV Stick is fairly easy to operate, although I find the shape and feel of the remote is a bit off.  In particular, I don't like the feel of the cursor buttons.  The interface is fairly clean and material seems to download reasonably fast--it is faster starting than my PS3.  I do hope that Amazon or someone adds a bowser interface, although since you can screencast an Android tablet to it, that function isn't a requirement.  Also, I can't use it on one of my Tv's since it's HDMI audio is defective  and there is no other audio output built into the Stick.  Was definitely a good deal when Amazon offered it for 1/2 price to Prime members.", "verified": true, "helpfulness": "0/0", "author": "R. N. Shagam"}, {"rating": 5.0, "review": "The Fire TV Stick is a great asset for users of Amazon services.  Set up was quick and easy.  The only thing you have to do is enter the security code for your wireless network. Every thing else is automatic.  The remote is small, but unless you have huge hands that shouldn't be an issue.Streaming video:  Previously I have used a computer and Blu-Ray player.  The Stick is superior to both on speed, and easier to use than the Blu-Ray. The feature to start on the Fire tablet and switch to TV works quite well, though for me it's not likely to get much use.Music:  You can play your Amazon music on your TV.Apps:  I've only checked out a few of them but so far I'm impressed.  Crackle is one of the TV/movie channels that I love and viewing it with the Fire Stick is a snap. I've only scanned through the list, but there are other free channels that I'll be checking out.There are other features that will probably be of use to many.Update: 12/30/14After using the Fire TV Stick for a couple of weeks I've discovered that it isn't quite as great as at first glance. When using Amazon services it works fine.  But the apps aren't quite as good as I first thought.>  If I've listened to Music, then switch to Crackle the play/pause buttons control the music, not Crackle.  So the first time I attempt to pause the video, the video stops and music starts.  The video can not be restarted!  Which means I have to exit and restart it.  The only way to avoid this is to go to settings and do a \"Force Stop\" on the music app.>  Streaming on Crackle is iffy.  Sometimes it works fairly well, but most of the time there is excessive buffering. Sometimes 2 or 3 times per minute.  And at times it simple stops playing.  A couple of times when it got really bad I switched to my BluRay player or Kindle Fire HDX.  Both streamed without an issue.I haven't used the other apps much, so I can't say how wide spread this is.  But it appears the Fire Stick is optimized for Amazon and the other apps are just addons.I didn't lower my rating because it's still a good product.  But that was a close call.", "verified": true, "helpfulness": "0/0", "author": "Walt"}, {"rating": 5.0, "review": "works great love it it made my not so smart TV smart bought it on a preview sale got it fo a great price only with I could have 3 or 4  for Christmas gifts at the promo price", "verified": true, "helpfulness": "0/0", "author": "Trish"}]