[{"rating": 5.0, "review": "Love the portable device. Just had to plug the stick into the port on my T.V. and Amazon did the rest; already had my account info. Perfect for my camper trailer.", "verified": true, "helpfulness": "0/1", "author": "Linda"}, {"rating": 5.0, "review": "The differences between Time Warner internet speeds are negligible. So I hooked up my Fire with a 50 ft. HDMI extension placing the Fire at the far end from the TV and closer, 15 ft. to the router. ROKU LT does not even perform as well at 15 ft. with my other TV. In short, FIRE IS A LOT FASTER!", "verified": true, "helpfulness": "0/1", "author": "FRANK JASKO"}, {"rating": 5.0, "review": "It works just great, if your internet is fast. If the internet is slow, it doesn't work. But we enjoy it.", "verified": true, "helpfulness": "0/1", "author": "Tom D."}, {"rating": 4.0, "review": "Great little streaming device!  The only downside would be that it can't connect to network/DFS/NTFS shares to watch media from a computer or mediacenter.", "verified": true, "helpfulness": "0/1", "author": "Mike Young"}, {"rating": 4.0, "review": "Good product at a good price.", "verified": true, "helpfulness": "0/1", "author": "Charles Maurice"}, {"rating": 4.0, "review": "Works well, just wish it had a way to increase storage; eg. sd card", "verified": true, "helpfulness": "0/1", "author": "George R. Cahlik"}, {"rating": 5.0, "review": "I am thoroughly liking the fire stick. My only complaint is that the remote is so sensitive that I have had to start most numerical or alpha entries over because of double or even triple entries. But to see the larger view of movies, games etc. on my TV screen makes it almost priceless to me.", "verified": true, "helpfulness": "0/1", "author": "B. M. Banks \"book lover\""}, {"rating": 5.0, "review": "...about how much I LOVE my Amazon Fire Stick. I want another for a new TV I will be purchasing. The games are SO FUN!!! Hulu, Netflix, YouTube.. all work flawlessly, and of course your Amazon Prime Video. For $35 bucks you can practically ditch cable - or at least the cable boxes in those rooms that you hardly watch TV in. The remote is excellent and very responsive. This is not the voice remote, however. I will be buying several more of these for other TV's. I just wish there was a way to harness the power from the TV instead of needing to plug it in.", "verified": true, "helpfulness": "0/1", "author": "Bekktek"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/1", "author": "Ray Maxwell"}, {"rating": 5.0, "review": "LOVE LOVE LOVE.  This is exactly what I needed.  Fits my lifestyle perfect.  Super easy to set up and I have used it nonstop since I got it. Thank you for this wonderful product. I would highly recommend it.  Never had any issue with it and I love the apps I can put on it.", "verified": true, "helpfulness": "0/1", "author": "B. Hoover"}]