[{"rating": 5.0, "review": "I saw the two day offer a month ago or so for $19 and decided to buy it for the Sony 32\" 1080P set I use as my monitor for my desktop system, figuring that I could switch to a show if my computer was busy doing something (i.e. processing a video file, virus scan, etc.)  It took a few weeks for it to show up (as expected), so I was excited when it finally arrived.  The packaging is very attractive and for the price, I was pleased to see an HDMI extension included.  I didn't need it, as the Sony has 4 easily accessible HDMI ports that it could fit into without interfering with any of the others.Setup was as easy as inserting the micro USB cable into the stick, inserting the stick into the HDMI port on the television (TV off), and lastly, plugging the cable into the power dongle and into a surge protected outlet.  That's the order I chose to do it in, knowing the HDMI carries current, and this sequence would minimize something frying up.  I've had that happen before (HDMI current frying something), so I'm extremely cautious.From there, it was a piece of cake.  I selected my WiFi network, entered the password, and then waited while the Fire downloaded a large update.  Long enough, that I left the room and came back.  It reboot, and I had to re-enter my network info, and then was good to go.  I've been using Roku's for several years now, so the interface is very familiar, intuitive, and easy to navigate.  I watched a few prime shows and downloaded several games that can be used with the included remote.I'm very impressed.  I started using computers back in the early 80's, and to see a device this small provide an experience like it does is awesome.  The graphics in several of the games rivals full size gaming systems from fifteen years ago, and the speed of starting and fast forwarding movies is quicker than my Roku 2 XS.I really like the experience this device provides, and I really can't believe some of the one star reviews.  People dinging it for not working in their home theater receivers doesn't seem fair, as they specifically state that it's to be plugged directly into the television.  The problem very likely lies with the firmware in the receiver and not the Fire Stick.  Giving it one star for not including the voice command remote is unfair, because it clearly spells out that it's an optional accessory.  People know this going into the purchase.  To each their own, I guess, but I'm thrilled with my purchase, and it will fit the bill for what I'm using it for perfectly.  I bought the two year Square Trade warranty just in case something happens too.Overall, I would highly recommend the Fire Stick based on my experience thusfar, and will update if anything changes.", "verified": false, "helpfulness": "0/0", "author": "Trojan Jon"}, {"rating": 2.0, "review": "Meh. I don't love it.My biggest question is: Will I always have to re-setup WiFi after an update? Seriously, it's annoying having to enter my WiFi password over and over (three times in the first half hour).Setup took about 20-30 minutes. Lot's of downloads, reboots, and installs. The interface is slow and poorly designed. It's hard to see what video I have selected when the tile's color is white like the box that highlights the active tile. They couldn't have used a more distinctive color? Red? Green? Yellow? This seems typical of the lack of thought put into the Fire Stick's UI.The graphics can't keep up with fast scrolling, so you have to stop scrolling through videos for a couple of seconds or you just have a bunch of grey tiles.The remote buttons are really stiff, so my thumb was actually tired after entering my WiFi password and scrolling... scrolling... and more scrolling. It's just not a joy to use.I would go with a more mature product like Roku. At $20 I'm not really too upset, but if I'd paid full retail I would've decided to return it within an hour. I was honestly surprised that Amazon put out such a poor first attempt. I don't think I'd ever trust them enough to preorder an Amazon product again -- even at half off. I won't return it, but I could easily have lived without this uninspired product.", "verified": true, "helpfulness": "2/3", "author": "Misunderstood Computer God \"exodus203.com\""}, {"rating": 4.0, "review": "Please Update the firmwareand use the charger providedit works perfectly after recent updateYoutube does not work yet", "verified": true, "helpfulness": "0/0", "author": "Amado N. Gomez \"DEVENTAQUI\""}, {"rating": 1.0, "review": "Only giving one star because the remote has become practically useless after only hours of use.  Something seriously wrong as another buyer posted.After working for a few hours, suddenly whenever a button is pushed you MAY get your selection, OR more likely, the cursor will jump all over the screen - really, really frustrating and almost a deal breaker at this point, except that I don't want to return the unit I spent so much time setting up in the first place.I will contact Amazon and hopefully they will have a reasonable solution, as I don't see how this could be an isolated instance.I would seriously wait to buy this until the issues are cleared up.  Right now Google Chromecast is for sale at under $25.00 - it uses your phone as a remote - but it WORKS.I contacted Technical support today 12-11-14 - sadly, they knew more than anyone reading these reviews.  VERY frustrating situation that took over an hour to resolve, with one Tech actually telling me that the sticks on work with Samsung TV's!  Not!When I mentioned that I had given one as a Christmas Gift - I was tole \"no problem\" they can set it up and if it doesn't work we will exchange it - even though they KNOW I have sticks from an apparently bad batch.Their solution is to send me a new remote.  I KNOW that this will not help.  Sadly, the supervisor I spoke with acknowledged that the company is aware of problems and \"trying to fix them\" all the while selling bad product.", "verified": true, "helpfulness": "7/9", "author": "S. Tank"}, {"rating": 1.0, "review": "I drove to two different Best Buys to snag the TV Stick.  Brought it home thoroughly excited and hooked it straight up to my Onkyo AVR and was greeted with nothing.  Absolutely nothing.  Turns out the brilliant minds at Amazon engineering decided to make it not work with non HDCP compliant receivers and from other reviews some Samsung TVs.  So buyer beware if you had hopes of hooking this up to something Amazon never bothered to build it for.  Outside of that it works amazingly well.  Interface in nice, a little more laggy than the standard Fire TV but non noticeable to someone who doesn't own both.  The USB port is in an awkward position but is workable.  Setup was easy, however the intro video is amazingly annoying.  Would definitely recommend to anyone using on a TV or an HDCP compliant receiver.", "verified": false, "helpfulness": "27/35", "author": "Albe"}, {"rating": 5.0, "review": "Excellent way to make older tv smarter !!", "verified": true, "helpfulness": "0/0", "author": "Mandar Waykul"}, {"rating": 1.0, "review": "I purchased this for the special prime price of $20 but expected it to work very well and give me 1080p netflix in my living room, like the roku stick I have can do without problems, but no. The stick almost always has a limited connection making it impossible to even connect to netflix services, let alone stream full HD video. Horribly disappointed.", "verified": true, "helpfulness": "2/4", "author": "Grant Linnehan"}, {"rating": 1.0, "review": "A crappy alternative for Amazon getting off their high horse and just releasing an Apple TV app already. I don't want my HDMI ports riddled with sticks I have to toggle between, especially with finicky HDMI handshakes. I already have a great streaming media box, and while the Prime app on iPad is capable of streaming via Airplay to the AppleTV, it bugs out all the time. Very frustrating when you're trying to binge on a show. If Amazon would just release an AppleTV native app like Netflix, Hulu, Vevo, Youtube, Vimeo, and a dozen others I wouldn't have been lured into trying this. Oh jeez I guess their horrible plan worked. Fortunately I picked it up really cheap since I'll probably just leave it in a drawer now.STOP TRYING TO BE A HARDWARE COMPANY.Edit: because netscorer is butthurt over my review, allow me to elaborate on why this IS a review of the product. The Fire Stick and Fire TV are not innovative products, any more than their failed phone was. Even if you double the RAM of a Roku, it's not a new thing. By releasing their own products rather than adding their stream to existing, successful platforms, Amazon is not improving anything. They're creating ARTIFICIAL SEGMENTATION. That's my issue with this. I'ma Prime member, and knowing that Amazon would be 100% fully capable of spitting out a proper streaming app alongside Netflix on every existing piece of hardware, but doesn't so that can push their own plastic stick, is frustrating. I am a fan of Amazon as a service and a store, although I know they cause damage to other retailers in much the same way WalMart does. All I'm saying is, for the love of Jeebus just let it stop there already, and don't go out of your way to artificially make good, existing hardware platforms less useful.", "verified": false, "helpfulness": "2/6", "author": "C. High"}, {"rating": 4.0, "review": "it's cheap, lightning fast, streaming picture is much nicer than any devices I have ( wdtv live, chromecast, ps3, roku).The interface is beautiful, I don't have a smart TV and don't miss anything", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 2.0, "review": "I am starting this review out with two stars based on optimism that this is a brand new product and that Amazon will \"get it right\" with future software updates.First, let me state that I purchased my Fire TV Stick from Best Buy and not Amazon.  Although I know it shouldn't matter, Amazon will likely not call this a verified purchase (even though my account is linked with the device), so please take that into consideration if Amazon flags this as unverifiable.Second, I am a happy owner of three Roku 3 boxes and have been using those for more than a year so I may be a bit spoiled or biased towards what I believe to be the Cadillac of streaming devices.Thirdly, I also own one Google Chrome Cast - a device which I am not really a major fan of.  In fact, I purchased the Fire TV Stick because of a couple of items that generally irk me about the Chrome Cast and is intended to replace that device.  The first issue is the lack of Amazon Prime streaming and the second is the requirement to use your phone or tablet to control the device.Now, on to my review of the device as I see it after having it for less than 24 hours.  I may amend the review as time goes on, especially if Amazon fixes some of the issues with Software Updates.1)  The setup process was not as smooth as it should have been.  After initially connecting to my Wi-Fi, it started to do a Software Update and then failed with a message saying something about being unable to connect to the service and to power-cycle the device.  After restarting the device, I had multiple failures of trying to connect it to my Wi-Fi even though my iPad was working just fine with it, so doubt that the Wi-Fi is truly my issue.  My strength is identified on the Fire TV Stick as \"Very Good\" and the router is about 7-8 feet from the device within the same room, so there aren't any major obstructions of the signal.2)  I have only watched one program on the device so far, and that was via the Netflix app.  However, during that viewing, the streaming was eventually interrupted and I was prompted to restart the device because it could not connect to the network.  After restarting it, I kept getting interrupted with Buffering issues and eventually dismissed the notification because it prompted me so often that at one point less it'd be less than two minutes between notifications.3)  Amazon really should allow people to filter \"Prime Video\" only within the Search option.  Sure, I realize that their goal is to Rent or Sell content, but when you search for something generic like \"Comedy\" and see a bunch of items available for rent, yet you have ZERO intention to pay to watch comedians that you've never heard of, it can be a bit frustrating.", "verified": true, "helpfulness": "14/17", "author": "Mr. Steven Fuhrman"}]