[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Lesslie De Rego"}, {"rating": 1.0, "review": "Audio was intermittent on all channels/apps. Maybe it didn't interface well with my set up, I sent it back", "verified": true, "helpfulness": "0/1", "author": "J. Pardon"}, {"rating": 1.0, "review": "It didn't work. We had to return it, just like the Amazon Fire. I'll stick with my smart tv and my blu-ray player. Wish it worked, had a nice interface.", "verified": true, "helpfulness": "0/1", "author": "greenegalz"}, {"rating": 5.0, "review": "I really like this, there are a lot of features that wouldn't have been available in the chromecast (which I considered buying). For instance, chrome didn't offer amazon prime instant video, a remote, or the option to search the everywhere for a movie. This was a great buy.", "verified": true, "helpfulness": "0/0", "author": "Lex"}, {"rating": 5.0, "review": "Couldn't be easier....so much to watch!", "verified": true, "helpfulness": "0/0", "author": "patti"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "David Aaron Dunn"}, {"rating": 5.0, "review": "LOVE!!!! my friend has chromcast and that doesn't even compare to the Fire TV!!", "verified": true, "helpfulness": "0/0", "author": "April Kelly"}, {"rating": 5.0, "review": "Great product at great prices at Amazon Prime", "verified": false, "helpfulness": "0/0", "author": "Karen R. Trimm"}, {"rating": 2.0, "review": "Desperately needs dish anywhere app.", "verified": true, "helpfulness": "0/0", "author": "Timothy Chester"}, {"rating": 5.0, "review": "Great low cost streaming product.  Much better and faster interface than the smart DVD player that I had been using.  I have Chromecast as well.  I like that the Fire TV stick has its own interface and does not require a \"casting\" device like a smartphone or tablet.  On the other hand, I like the casting feature of the Chromecast when friends come over and want to show video.  It would be nice to have both capabilities in one product but until then I have both.  One thing I have noticed is that some TV streams from HuluPlus have some pauses in the stream that I did not experience with my Chromecast.  I have watched a number of movies on Amazon Prime and have not seen this issue in the movies. Love the voice search capability available in the remote app. and the optional remote.  Would like to see it usable within the supported apps like Netflix. Overall very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Darkstar \"Darkstar\""}]