[{"rating": 4.0, "review": "Its okay", "verified": true, "helpfulness": "0/0", "author": "dman"}, {"rating": 4.0, "review": "It functions perfectly but I would give it full stars if it operated more like a website so I could log into my xfinity online.", "verified": true, "helpfulness": "0/0", "author": "ptowngirl"}, {"rating": 5.0, "review": "The item works well. I would like better instructions. There are other features I would like to use but I have not figured out all the details as I'm not quite as tech savvy as I would like to be. I'm using the fire stick in conjunction with my Directv which gives me even more options thanks to Netflix. I'm also watching You Tube on the TV through the fire stick which I enjoy much more on my 65\" big screen. I understand It is possible to view my photos and videos through my  iphone but I have not figured this out yet.", "verified": true, "helpfulness": "0/0", "author": "Dr. D.M.Mauser"}, {"rating": 5.0, "review": "Very cool and easy to use. Only problem was I didn't discover it sooner. Great variety of movies and games. Not completely clear on exactly how it works with non-prime selections and a little afraid of surprise fees. Too cool for school.", "verified": true, "helpfulness": "0/0", "author": "Gregory"}, {"rating": 5.0, "review": "I really like this so far ....may make my prime subscription  worth it. I'll  continue to evaluate.", "verified": true, "helpfulness": "0/0", "author": "melissa"}, {"rating": 5.0, "review": "Love being able to watch NETFLIX thought the stick.  Have had a few issues with the live streaming sometimes with the internet, but other than that love all variety of shows to watch.  I even ordered one for my parents.  Easy to learn to operate.", "verified": true, "helpfulness": "0/0", "author": "Stacia"}, {"rating": 5.0, "review": "It works!  Very easy to install and easy to access Netflix.", "verified": true, "helpfulness": "0/0", "author": "Lyn"}, {"rating": 5.0, "review": "Easy to set up and a Breeze.to.learn especially with the android app", "verified": true, "helpfulness": "0/0", "author": "Joseph Wood"}, {"rating": 2.0, "review": "The fire stick does work but it doesnt work good they need to do some kinda update because it buffers a lot and the video gets blurry a lot I no its not my internet cause netflix and hulu all work perfect on other device just not the fire stick", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "airanita"}]