[{"rating": 5.0, "review": "I own the Amazon Fire Stick along with the Chromecast and Roku streaming sticks. The Amazon Fire Stick is just as smooth and easy to set up and performs equally as well. Would recommend the Amazon Fire Stick with two thumbs up !", "verified": true, "helpfulness": "0/0", "author": "D. Lawson"}, {"rating": 2.0, "review": "The Fire Stick from Amazon really doesn't do anything special. I already owned a bluray play that did everything this does and more. Also - When I used this there seemed to be an annoying glitch while streaming Netflix. Every 5 minutes or so it would freeze, glitch (like it were loading), and make an annoying beep sound. I would recommend investing in a bluray player if you were thinking of purchasing this for $40.", "verified": true, "helpfulness": "1/1", "author": "Jeff Parshall"}, {"rating": 4.0, "review": "Still getting used to this, seems to be a little slower than my Roku, but I am very happy with it for the price.", "verified": true, "helpfulness": "0/0", "author": "H. Perry"}, {"rating": 4.0, "review": "Easy to install", "verified": true, "helpfulness": "0/0", "author": "PATRICIA SZYPURA"}, {"rating": 4.0, "review": "After a day of using it, I find the selection of films ok,  tv marginal,  operation fine.But,  unlike chromcast, it's limited to what's built in. The latter mirrors everything on the computer screen.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"internetter\""}, {"rating": 4.0, "review": "Fire stick pros:1) If you have an older receiver that does not support Dolby Digital Plus (e.g. any receiver that does not have HDMI) Fire Stick will downconvert DD+ audio to regular DD. As a result I can get 5.1 audio from Netflix, while Chromecast has only stereo.2) The remote is very responsive. It is more convenient to use remote to navigate the Netflix app on a large screen of your TV/projector than having to unlock your phone and navigate a Netflix app there on a tiny screen in order to cast a move on Chromecast.Fire stick cons:1) Grey overcast. Main menu and all apps including Netflix look washed out. Black screen is actually grey.2) Amazon fire tv remote app on my phone is not able to connect to Fire stick. This is not a big deal since I prefer to use remote for naviation.I would give it five stars if grey overcast is removed.", "verified": true, "helpfulness": "1/1", "author": "V"}, {"rating": 3.0, "review": "Pretty Good... My Fire TV Stick double enters characters from the on screen keyboards. I will keep this system though, as I will only use the keyboards to enter app creds. More - the double entry effects selection on the ribbons. 1 out of 5 times it jumps 2 places. Both horizontally and vertically. I down-voted to 3 stars. If I return it, it may be a long time to replace, so I'll put up with the key bounce (or what ever it is).Could use a common keyboard style. Qwerty vs ABC, common layout of special keys. I like the remote shortcuts, something Roku could adopt. User interface is satisfactory, nothing noteworthy. Focus of the GUI is on Amazon Instant Video, I would prefer the GUI be more generically focused on Videos, Music, Apps, etc.Video performance is good, as good as Roku 3 playing Waking Dead S01e03.", "verified": true, "helpfulness": "0/0", "author": "Gunslinger45"}, {"rating": 4.0, "review": "It awesome but I wish most of movies and shows don't cost money to watch", "verified": true, "helpfulness": "0/0", "author": "michael peak"}, {"rating": 1.0, "review": "Netflix app don't work on brasil. This don't happen in chromecast", "verified": false, "helpfulness": "0/2", "author": "Michelly Sampaio Bonates dos Santos"}, {"rating": 5.0, "review": "Really easy to use.  Received yesterday already registered to me.  Thankfully my TV had a USB port so I plugged Fire Stick in TV HDMI port and power cord into TV's USB port so no visible wires.  Device had several setup and how to use videos ready to go.Obviously optimized to buy and watch Amazon videos, it also makes an excellent picture slideshow and music player.  I had already bought and/or uploaded some of my music library to Amazon so I added my favorite family photos to Amazon cloud drive.  QED now I have a 46\" electronic picture frame showing my photos and playing my music.I bought during the initial pre-order so the price was excellent.  Wish I could have ordered more than one.I wish it worked with other video services or webpages but Amazon and Netflix are the only two that I recognized.", "verified": true, "helpfulness": "1/1", "author": "Samuel Abbe"}]