[{"rating": 5.0, "review": "Most definitely worth it. I purchased when it was on super sale for Prime members. We were able to get rid of our cable because this offers a lot of awesome shows and movies for people for purchase and for free. You can play music wirelessly from your phone, access Netflix, Hulu, loads of apps and it's super easy to use. I love that it just linked up to my prime account and it was almost no work to set up. Super awesome product, very comparable to Apple TV", "verified": true, "helpfulness": "0/0", "author": "Ali"}, {"rating": 5.0, "review": "Excelent for my TV. Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to install and use.  Even better for Prime members.  Could use a more intuitive interphase to identify Prime vs Non-Prime content for movies, tv shows and music.", "verified": true, "helpfulness": "0/0", "author": "Ernesto Echeandia"}, {"rating": 5.0, "review": "I gave this to my spouse as a gift . . . WOW is he happy!", "verified": true, "helpfulness": "0/0", "author": "Purple Butterfly Lady"}, {"rating": 5.0, "review": "I had seen others use Apple TV and Google Play to watch TV programs and movies but I never explored the choices until an enticing offer came in from Amazon.  For $39 getting it was a no brainer.  I got my Fire TV stick on December 24 and installed it within minutes on my HD TV. The remote works like magic.  The stick is all it was claimed to be. As an Amazon Prime member I can watch quite a few free movies and rent others as well at competitive rates.  I am very happy with the Stick so far and plan to watch of a bunch old episodes of HBO programs.", "verified": true, "helpfulness": "0/0", "author": "Chakrakodi R. Shastry"}, {"rating": 1.0, "review": "Horrible unit.  You have to reconnect it all the time.  Plus it doesn't show that you have to plug cord into outlet.  You can't just plug into tv.  Amazon doesn't have any apps for it like the ROKU.  The  Roku3 is far superior.", "verified": true, "helpfulness": "0/2", "author": "kevin duncan"}, {"rating": 5.0, "review": "Great product. Just add HBO GO app and Time Warner App and would be perfect", "verified": true, "helpfulness": "0/0", "author": "Matthew Sciarrino Jr."}, {"rating": 5.0, "review": "Easy to install. Like having a bigger kindle", "verified": true, "helpfulness": "0/0", "author": "cindy wright"}, {"rating": 5.0, "review": "Easy to use. It works as advertised.  Great product.", "verified": true, "helpfulness": "0/0", "author": "DWHFlorida"}, {"rating": 5.0, "review": "Love it !! Worth every penny, will get another one for living room.", "verified": true, "helpfulness": "0/0", "author": "mrdesinty"}]