[{"rating": 2.0, "review": "doesn't work half the time", "verified": true, "helpfulness": "0/0", "author": "Danny C."}, {"rating": 5.0, "review": "GOOD GOOD GOOD", "verified": true, "helpfulness": "0/0", "author": "coolmen"}, {"rating": 3.0, "review": "Still kind of disappointed that we have to PAY for a lot of movies, it only seems to be \"old\" movies that are free and they are quite expensive", "verified": true, "helpfulness": "0/0", "author": "Avril Wrynn"}, {"rating": 5.0, "review": "This device is great, use it to watch movies that I haven't seen using my prime membership.  Great!!", "verified": true, "helpfulness": "0/0", "author": "Gary L. Rogers"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "kai seminuk"}, {"rating": 5.0, "review": "exceeeelente, the only thing i would changa is that In Netfllix you can change the resolution, because in some places the intertnet not is the best.", "verified": true, "helpfulness": "0/0", "author": "Jose Guillen"}, {"rating": 5.0, "review": "Awesome product, wish it didn't require the power cable though", "verified": true, "helpfulness": "0/0", "author": "S. Price \"parent, PC and gadget nerd.\""}, {"rating": 1.0, "review": "I'm not sure if it tells you this somewhere in the fine print but Comcast Xfinity is not supported as a cable provider.  Therefore, if you buy this to use the HBO Go and Showtime apps, it will not work if you have the subscription through Comcast.", "verified": true, "helpfulness": "0/0", "author": "J V"}, {"rating": 2.0, "review": "To much jitter instead of a smooth frame rate playing HD titles from Amazon. Very irritating. I have fast internet and Wi Fi so it's not that. Netflix titles play fine.", "verified": true, "helpfulness": "0/0", "author": "Scott D. Brennan"}, {"rating": 5.0, "review": "Great great product love it totally change the way I watch TVWith Netflix subscription it's even better", "verified": true, "helpfulness": "0/0", "author": "Eric Preston"}]