[{"rating": 4.0, "review": "I like it a lot but I have trouble downloading apps", "verified": true, "helpfulness": "0/0", "author": "jamie joy huff"}, {"rating": 5.0, "review": "Best purchase!", "verified": true, "helpfulness": "0/0", "author": "Amanda J. Miller"}, {"rating": 5.0, "review": "Bought during pre-Xmas sale as a stocking filler. For the price it is an amazing addition to our entertainment options. Super easy operations and now have available a myriad of programmes and games both free and via Amazon. Totally opened a new world of available options for weekends when cable TV is devoid of originality. Cannot recommend it highly enough for price, ease of use, and the things available on it", "verified": true, "helpfulness": "0/0", "author": "Rosie S"}, {"rating": 5.0, "review": "Great to have. Works wonderfully. A nice break from cable TV!", "verified": true, "helpfulness": "0/0", "author": "John C."}, {"rating": 5.0, "review": "I love it. I have had it for about 2 weeks and it is so easy to hook up and operate.  I set it up and the tutorial was so simple to follow.  I recommend the fire TV stick to anyone that has a HD TV....I thought I would buy a \"smart\" TV but now for a fraction of the cost, I have the same capabilities.", "verified": true, "helpfulness": "0/0", "author": "Carrie Lee"}, {"rating": 4.0, "review": "It is an awesome device and cool features but, every time I get an app I have to put in a code, and junks up my email every time I make a purchase. Ok I get it I got an app, oh wait I installed it myself and there not even pay but, besides its a great product.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Best thing I ever bought!", "verified": true, "helpfulness": "0/0", "author": "Cynthia Reed"}, {"rating": 5.0, "review": "Simply AMAZING! So glad I bought the Fire Stick - install took minutes and now I can stream my Netflix and Amazon Prime withough connecting my computer! The picture quality is superb!", "verified": true, "helpfulness": "0/0", "author": "Kora Millard"}, {"rating": 5.0, "review": "So easy to install and get started with!!", "verified": true, "helpfulness": "0/0", "author": "Interiorgirl"}, {"rating": 1.0, "review": "A little pricy and the salesman did not explain the cost", "verified": true, "helpfulness": "0/0", "author": "Robert Macias"}]