[{"rating": 3.0, "review": "I already own a Chromecast but when the Fire promised Miracast I was hooked. Chromecast will support Windows only so far as the Chrome browser. I wanted something that would take the entire Windows desktop experience. Miracast promises to do just that.Unfortunately, as of this review there is no support for Miracast on Windows machines. It does support some Android phones/tablets (like my GS4) but you are out of luck if you want to fling your Windows desktop.The product description specifically calls out Miracast certification. At the very least Amazon should explicitly state that Windows casting does not work at this time. I suspect there will be a lot of disappointed users after they fire this device up for the first time.", "verified": true, "helpfulness": "12/13", "author": "W. Coleman \"billandcat4\""}, {"rating": 5.0, "review": "Very nice just like the apple TV", "verified": true, "helpfulness": "0/0", "author": "Sheeco"}, {"rating": 5.0, "review": "It is basically a PROTOTYPE with features you may be used to promised soon. (As Roku user for over 5 years, this \"beta biz\" is a road I have walked before; they will get there.) Great start though. Easy set up. The cloud storage of video & pics is nice. For $19 Cannot beat it.", "verified": true, "helpfulness": "0/0", "author": "LT"}, {"rating": 3.0, "review": "A little slow, has a hard time keeping a connection, but all in all OK.", "verified": true, "helpfulness": "0/0", "author": "Steve Agnello"}, {"rating": 1.0, "review": "I got this for the $19 deal for prime members, but it does not work.  After spending a long time on the phone yesterday with tech support, there is still no resolution to the problem.  Hopefully they will eventually get back to us and fix the problem or send a functioning product.  If they do I will update my review.  But so far, we are very disappointed & researching the Google Chromecast vs. Roku as a replacement.Update:  I called again on Monday but was told there was no update on the trouble ticket yet.  I called again today (Wednesday) and was told there is still no update.  The person on the phone offered to have the unit replaced, but then said the replacement could not be processed because the trouble ticket is still open.  She transferred me to a supervisor who was not at all helpful and had a bad attitude.  He said someone will call me tomorrow (Thursday).  So after another 45 minutes on the phone today (Wednesday) there is no resolution and I am stuck with a non-funtioning product. I am very dissappointed in Amazon's customer service on this issue.  I have am generally an amazon fan - I have their credit card, 2 kindles, and the new echo, but I'm not thinking very highly of them any more!!!  If there is no resolution tomorrow I am returning the fire stick and will spend my $ on a roku - and won't buy it on amazon!", "verified": true, "helpfulness": "1/1", "author": "S. Phillips \"shannon\""}, {"rating": 5.0, "review": "AWESOME . . . nothing more to say.  Have two Chrome casts & the Amazon Fire Stick blows Chrome Cast away.  I was lucky to order one for only $19, but well worth the $39 asking price.Faster than Chrome Cast.Easier to control that Chrome castMore responsive to Fast Forward than Chrome Cast.Higher definition than Chrome CastJust about as easy to set-up as Chrome Cast.  Chrome Cast uses an app.  Fire Stick uses the remote.Only thing Chrome Cast does that Fire Stick does not is You TubeWe used to have to hook a laptop to the TV to watch Prime shows.  Now we do not & I darn happy about it.Chrome Cast does some things right.  Netflix is easier to search on a PC, Tablet or Phone than just send it.  Fire Stick you have to use the remote.All in all. . . side by side . . . Fire Stick comes out the winner.  No going the throw away the Chrome Cast, but it is not going to be used as much.", "verified": true, "helpfulness": "0/0", "author": "tell family"}, {"rating": 4.0, "review": "Love it you can have movie night every night easy to operate an great apps", "verified": true, "helpfulness": "0/0", "author": "Edward Fulton"}, {"rating": 5.0, "review": "I like it - easy to use.", "verified": true, "helpfulness": "0/0", "author": "Pamela"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "TFRANK"}, {"rating": 5.0, "review": "Really have enjoyed this the past two weeks.  Lots of apps and covers many of the things we like to watch.", "verified": true, "helpfulness": "0/0", "author": "J. Joseph"}]