[{"rating": 5.0, "review": "Very convenient, much preferred over using a PC to order and watch online movies and TV shows.  Well worth the cost.", "verified": true, "helpfulness": "0/0", "author": "John Carr"}, {"rating": 5.0, "review": "Works great, love that I can take it on the road.", "verified": true, "helpfulness": "0/0", "author": "Neil Hull"}, {"rating": 1.0, "review": "I have a pretty constant 50 Mbits download and 10 Mbits upload from my service provider but yet in the evening I have constant dropped streaming and interrupted streaming mostly in the evening.  I also have Apple TV and never drop or have interruptions streaming.  I have an HD TV with 1080p support.", "verified": true, "helpfulness": "0/0", "author": "Steven Hreczuck"}, {"rating": 5.0, "review": "Great price. ..very fast and it is very simple to set up. ..wish amazon prime had more up to date titles for free but it's great anyway", "verified": true, "helpfulness": "0/0", "author": "Brad Garth"}, {"rating": 5.0, "review": "I love it!!! Streams perfectly and I love the additional apps.", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 4.0, "review": "I like the Fire TV Stick a lot!  I would have given it five stars if the description/ads explained that you need to plug the stick into a power source for it to work. I am not a fan of that feature.", "verified": true, "helpfulness": "0/0", "author": "Jaime Conley \"addicted to books\""}, {"rating": 5.0, "review": "Love this.  It goes SO much faster than our blu Ray player (since we don't have a smart tv).  The only thing that annoys me is the remote is tiny and VeRY sensitive. So with 3 little kids (4 and under) it gets misplaced easily and when they are jumping on the bed and all around the buttons get pressed LOL!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 1.0, "review": "Using the remote to log in to my Netflix and Amazon accounts is a pain in the neck. I wish I could use it like the Google ChromeCast and just route my choices to the Fire TV Stick. I was also expecting to have free movies and TV episodes, but so far all the movies are pay only.", "verified": true, "helpfulness": "0/0", "author": "Pete"}, {"rating": 4.0, "review": "love it so far.....I dropped my cable so I am having trouble getting Lifetime. *(One day I can get it the next I can't - I have no cable)", "verified": true, "helpfulness": "0/0", "author": "D Foote"}, {"rating": 1.0, "review": "This thing is junk! Constant connectivity issues. Installed exactly as instructed (with the power cord,) router is less than two (2) feet away, and it still drops connection and has to be reset (hard reset.) Will purchase a Roku and solve the problem.  Save yourself the aggravation and go with another brand until Amazon sorts out the bugs, offers solutions, and offers some type of support for this infernal device other than telling you too hard reset the darn thing EVERY time.", "verified": true, "helpfulness": "0/0", "author": "r3p5t1"}]