[{"rating": 5.0, "review": "Awesome awesome awesome", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 5.0, "review": "Loved it !", "verified": true, "helpfulness": "0/0", "author": "Seymour Quimby"}, {"rating": 3.0, "review": "The good: easy installation and fairly quick upload from LAN Wifi.The Bad: the Netflix app crashes after the stick sits idle for a week and requires a logout and sign back in. This might not be an Amazon issue but either way it needs to be fixed. Browsing content is a little awkward and definitely not as slick as Apple TV.  The search function is slow and could be improved.All that said it does work and is fair value for the money.", "verified": true, "helpfulness": "1/1", "author": "Frank"}, {"rating": 4.0, "review": "Overall I love it", "verified": true, "helpfulness": "0/0", "author": "monica Jones"}, {"rating": 4.0, "review": "Like it.  User friendly.  Easy to install.", "verified": true, "helpfulness": "0/0", "author": "TDG"}, {"rating": 5.0, "review": "works so well I bought one for our motorhome!", "verified": true, "helpfulness": "1/1", "author": "Cal Newton"}, {"rating": 1.0, "review": "Does not stream content well. It's very slow, constantly freezes and picture quality is poor. My blue ray player streams video much better, never freezes and has a much better picture. Very disappointed with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Kruger"}, {"rating": 5.0, "review": "Works great to provide lots of options for cable-free living. With Netflix, Amazon Prime movies and music, Sling, Pandora, and various other apps at our finger tips, we aren't missing our whopping cable bill one bit!", "verified": true, "helpfulness": "0/0", "author": "S. Mccarter \"crazy mom\""}, {"rating": 5.0, "review": "The first one we bought wouldn't stay connected. After reading some reviews and realizing it was a problem with some I called Amazon. They were wonderful. The sent a replacement and a return slip for the first one. I could leave the connector on the TV and keep the remote. I only returned the stick. I got the replacement in a couple days and it worked perfectly. Now we have one in the bedroom and well as our Fire TV in the living room. Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "L. Eder"}, {"rating": 5.0, "review": "Amazing device, very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Antonio"}]