[{"rating": 4.0, "review": "works great , returned this to amazon purchased at retail store almost half price!", "verified": true, "helpfulness": "0/0", "author": "guy barbato"}, {"rating": 5.0, "review": "If your looking for a small streaming device, this is a good product.  I use it for Amazon prime video and Nexflix - it is very simple to install with very simple remote.It is very small, I thow it in my travel bag and use in hotels (plugs into their tv and used their wifi) - so far Ive been it three different ones fortunately all of which had accessible inputs on the TVs and acceptable Wifi.  Also took to cabin,  and used my phone as hot spot - used lots of data of course but device worked well.Have not tried any of the other capabilities though, sorry.", "verified": true, "helpfulness": "0/0", "author": "KR"}, {"rating": 5.0, "review": "I've been using it non stop since I got it.  I also have chromecast.  I like this one so much better.  Obviously I still have a purpose for the chromecast because I need it for the shows I purchased on google play.  I like this more because of the remote.  I like being able to pick up the remote pressing home and my tv turning home and going straight to amazon prime shows.  I know some people say its just as easy to use the phone but its a lot of extra steps. The remote is definitely the winning factor for me.", "verified": true, "helpfulness": "0/0", "author": "B.N."}, {"rating": 1.0, "review": "I am really disappointed with this. I purchased this stick as a way to enjoy my media in a more organized way. I like the idea of choosing from channels and getting what I want. Based on the advertising, it may seem that there are many channels like PBS, TNT, Cooking and sports. The basics that I was looking forward to.For starters all of the channels were a huge disappointment. In order to watch the shows, you needed to have a cable password. Hello! what if I do not have a cable password. Better yet, for the channels that did not require you to have the passwords, you could only watch clips and they all started in a commercial. I have no problem watching commercials if I get the full show but to watch a minute commercial to see a half minute clip, so not for me.When it came to cooking, we are huge fans. I was thrilled to see the cooking channel only to be even more disappointed. The cooking channel is a bunch of clips by non professional cooks. If the recipe was good, the resolution was bad. A large majority of the chefs had little to no TV personally and one show did not even have any words. It was all video and text.For the men we then tried the sports channels. From the lack of a  hockey channel to showing mostly clips from old games, this was nothing more then what can be found on youtube.Overall, the only plus was I returned this and got my full refund. Otherwise the amount you need to pay just to get a half decent app is so not worth it. This did not work for my family on so many levels.", "verified": true, "helpfulness": "2/3", "author": "Little Lady Plays \"Lady Lilith\""}, {"rating": 2.0, "review": "If you want a device that doesn't have the same functionality as a 3 yr old Roku box, then this is for you.Showtime + DirecTV provider = success on RokuShowtime + DirecTV = NO success on Fire TV stickFire TV stick NO HBOFire TV stick w/ Netflix buffers constantlyIn fairness, access my Amazon digital music library is great.", "verified": true, "helpfulness": "1/2", "author": "E. Bower \"erb\""}, {"rating": 5.0, "review": "I can't wait to get one because Time Warner has been charging me $179.00 per month to watch nothing but commercials. Isn't that the reason why we all wanted cable in the first place to get rid of the commercials. Anyway with 100 M.G.B.S. Internet there shouldn't be a problem with your new stick and I will be able to buy a new TV. Thank you Amazon you are truly the way of the future.", "verified": false, "helpfulness": "3/3", "author": "R.Maurice Weeks \"RMWeeks\""}, {"rating": 5.0, "review": "Love my Fire TV Stick. Highly recommend getting this to anyone!!", "verified": true, "helpfulness": "0/0", "author": "D. Bourbon"}, {"rating": 5.0, "review": "I got this for a steal just to try it, and I would have bought it full price for what it can deliver. Easy to use and set-up.", "verified": true, "helpfulness": "0/0", "author": "MARK A. DESALVO"}, {"rating": 5.0, "review": "I've been using an Apple TV since the 2nd Generation. This is very similar, but of course in the Amazon ecosystem. But, I love it. It works infinitely better for watching Amazon movies than the clunky interface that came with our Panasonic TV.  It responds much faster than Apple TV, and it communicates via Blue Tooth, so you don't have to point the remote at the unit. Nice packaging, works well. Remote is plastic, not as elegant as the Apple TV remove. But it works great. Took a chance out of curiosity. Glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "US101Rider"}, {"rating": 3.0, "review": "I got my Fire TV Stick last night, it was very easy to setup is certainly dummy proof (my hubby didn't have problems using it ;-) ). I am event thinking about buying the Fire Game Controller, I tried a few games and you cannot play them with the control or with the app on your smart phone, but the good news is that you don't need the voice activated control, because you can use your cellphone for that. Some TVs have only one HDMI port and something may get on the way of the power cord of the stick, but you can fix that very easy by using the extension. I have to say that I really love the device itself, and I would even buy a second one for my living room's TV, BUT I am very unhappy with the Amazon Prime, all the good stuff movies and shows are for rent or buy (you have to pay extra), they should have more stuff available on Prime, I have been thinking to give it a try to Netflix and see if they have more of the good stuff, if that's the case I think I wont renew my prime next year and will use the Fire TV Stick with it, I know there's more stuff  that Prime offers like the 2-day shipping which is awesome, but I don't think I buy enough stuff, or the books but again is the old stuff that's available, music same story.I think Amazon needs to make available more newly movies, and books, maybe even music, but the most important is the movies and shows, I think is the part that people want the most and care the most about.Sorry this turned into an Amazon Prime review (if someone knows where I can review Amazon Prime, please provide me with the link), but most people buy this product because of the Prime, but I think I should clarify you can use it with Netflix and a bunch of other movie services.", "verified": true, "helpfulness": "1/1", "author": "Nancy C. Bauitsta \"Connie\""}]