[{"rating": 5.0, "review": "I received mine right before Christmas and we're able to use it with kids and family .A must have device for those with Prime membershipPro1. Easy to use and setup(you can read this you can setup by yourself)2.compact can go anywhere anytime.Con1. Wish sub cable was little bit longerGOOD JOB AMAZON.COM!!", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 5.0, "review": "I love it! Quick and easy!", "verified": true, "helpfulness": "0/0", "author": "lpickett"}, {"rating": 3.0, "review": "The fire stick is great when it works.  I do NOT want to plug the unit into my TV.  I have a small home theater with 7.1 surround sound.  When I plug the Fire Stick into my TV and take an optical cable back to my audio/video receiver, I only get stereo sound.  When I plug it into one of the HDMI inputs in my A/V receiver, I get Dolby Digital 5.1 surround.  The problem is that when I turn on my system, and use the Fire Stick remote control to access the Fire Stick, it either takes a LONG time to come on OR, the audio comes on but no picture until I turn it off and then on again.  Then It might work.  When it works it is great.  Once I get a picture and sound, I can navigate to what ever I want and watch it.", "verified": true, "helpfulness": "1/1", "author": "Doug B."}, {"rating": 5.0, "review": "It's great. The Netflix app works perfectly fine with Amazon fire stick", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is the best thing ever!", "verified": true, "helpfulness": "0/0", "author": "andrea bowles"}, {"rating": 4.0, "review": "Haven't totally explored it yet but there seems to be less of a selection of free PRIME movies than expected.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Petrus"}, {"rating": 5.0, "review": "This little piece of equipment is a must for anyone that enjoys movies on Netflix, Amazon Prime and others and don't want to watch them on a PC.The price is right and I am very happy with my purchase as a matter of fact I may buy an other one for a smart TV I have that has the Netflix app. but not Amazon Prime, etc.", "verified": true, "helpfulness": "0/0", "author": "MartyB"}, {"rating": 5.0, "review": "I have a Samsung Smart TV, but it did not get very good connecetion via WiFi in my living room. Purchased the Fire TV stick because I already had Amazon Prime and wanted to stream videos and other content smoothly, which it definately delivers. I actually have a 1 amp usb output on my TV so I did not need to use the adapter that came in the box to power the stick.", "verified": true, "helpfulness": "0/0", "author": "Nguyen"}, {"rating": 5.0, "review": "I do recommend. Nice product, easy to use. Offers more than what I needed. My TV has a life now.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Loved it", "verified": true, "helpfulness": "0/0", "author": "jeffery dudley"}]