[{"rating": 5.0, "review": "love all the amazon products.  this is awsome...", "verified": true, "helpfulness": "0/0", "author": "keith gatzemeyer"}, {"rating": 5.0, "review": "I've had the Fire TV Stick for a while.  I also have a Roku 3 and a Roku Stick.  All are great little streaming devices, but the Fire TV Stick has a few features that make it stand out.First, the selection of apps is pretty impressive on the stick for it being so new.  That should only improve as developers can leverage their Android dev skills.  Second, it's a no brainer if you're a Prime member.  Now with Prime music playlists, it's even better.  Please just add Prime stations next, Amazon.  Finally, the fact I can take this with me on the road and use it in a hotel is amazing.  I just tried this yesterday and it worked flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Marcus \"Marcus Schmidt\""}, {"rating": 5.0, "review": "We've never used anything else to compare it too, but it's great for what we wanted!", "verified": true, "helpfulness": "0/0", "author": "BN Flowers"}, {"rating": 5.0, "review": "best with plex app", "verified": true, "helpfulness": "0/0", "author": "Neddal Ayad"}, {"rating": 5.0, "review": "Excellent product. Easy to install and use. Also own 2 Chromecast and prefer the fire stick. The remote is a nice feature as people don't always have a smartphone available to use as a remote. Will purchase more for use with other household TV's.", "verified": true, "helpfulness": "0/0", "author": "Bob C"}, {"rating": 5.0, "review": "Very good I loved, thanks.", "verified": true, "helpfulness": "0/0", "author": "Jose S."}, {"rating": 1.0, "review": "I used the usb adapter and hooked it to the usb port on my vizio 4k tv and it lags b horribly. Due to the tv being flush mounted I cannot use the power adapter because it just will not fit. Trying to browse channels is horrid, the delay in response is super slow. It takes 10 seconds from clicing a button on the remote before it registers on the tv.", "verified": true, "helpfulness": "2/2", "author": "Robbie Andrews"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Sandra Pappalardo"}, {"rating": 2.0, "review": "I have to use the extension cable to plug the stick into my television which creates problems because the connections often become loose. The stick will slip out and this causes it to freeze constantly. I have to continually pull the TV out and tighten the connection. It is a great idea, but something was lost in the design. You probably won't have a problem if you have an HDMI port on the side of your TV, but since the one I have the unit connected to is older I only have HDMI slots on the back. My advice is go ahead and spend the extra money and get Fire TV, it will save you headaches in the long run!", "verified": true, "helpfulness": "0/2", "author": "Kindle Customer"}, {"rating": 1.0, "review": "It does not meet the standards of Roku, many shows Fire Stick wants me to pay", "verified": true, "helpfulness": "0/0", "author": "Joanne Doucette"}]