[{"rating": 5.0, "review": "Fire Stick was a perfect resolution to make a dumb T.V . At least get in to college . There could some changes to make setup easier , I think some people might be frustrated and feel like the might have to go to college to figure it out .. I was not one of them but just speaking for the computer challenged ..", "verified": true, "helpfulness": "0/0", "author": "Jason Atwood"}, {"rating": 5.0, "review": "Great Device!", "verified": false, "helpfulness": "0/0", "author": "Bob"}, {"rating": 4.0, "review": "Easy to set up and to operate. On screen menu is not too intuitive and is sometimes awkward to operate, especially when you want to search a specific movie title. But way better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amiel Moskona"}, {"rating": 5.0, "review": "I bought 2 of these when they were on sale for $19.  Oh. My. Gosh!  My teenage kids love them!  Makes their TVs into smart tvs!!", "verified": true, "helpfulness": "0/0", "author": "Meerkat"}, {"rating": 5.0, "review": "The Fire Stick exceeded my expectations. It enhanced my viewing options at home and is easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "JonesOne"}, {"rating": 5.0, "review": "This was a pre-order that I anxiously awaited and it has finally arrived. The set-up was very easy and within 10 minutes I was enjoying watching all my favorite prime videos, hulu plus and see thousands of more videos at my fingers reach. If you are looking for a gift for the guy who has everything I suggest buying the fire stick. This is a steal at $39 (I got mine for the special offer to Prime members for $19 but I gladly would have paid the full price. It is so nice not to have to tie up my computer to be able to enjoy videos on my bug screen. I do not own a tablet or ipad so I can not comment on the second screen feature offered with the fire stick but I assume it to would be a breeze to do. I would buy this product again and it is on the top of my list of buying as a gift for any need in the future. Thank you Amazon for being not only my favorite shopping site but also for developing reliable and awesome tech equipment. Amazon rocks and the prime membership is something that will always be my go to for not only shopping but for movie and tv entertainment (I am almost ready to stop paying that cable company's monthly bill which has become a rip-off for the shoddy service of an entirely overpriced product).", "verified": true, "helpfulness": "0/0", "author": "Lauri"}, {"rating": 3.0, "review": "Adequate, yet flawed.  The fire stick is an acceptable steamer by all rights, however, there are a few quirks left.  My biggest concern is with screen mirroring from android devices (Sony Xperia Z Ultra).  While attempting to stream the Fire stick would reboot itself almost 100% of the time, the times it would mirror correctly, the sound would not work (it has never worked, not once).  If screen mirroring was not a feature I would bump the score up dramatically, it is however a feature, one that doesn't work well.", "verified": false, "helpfulness": "0/0", "author": "Robert Kratz"}, {"rating": 5.0, "review": "Great gadget, works great.", "verified": true, "helpfulness": "0/0", "author": "Roberto"}, {"rating": 5.0, "review": "This product is great, and satisfied all of my needs and expectations. I recommend downloading the app even if you know you will only use the remote because you never know that moment when you are too lazy to grab the remote you left upstairs when you are downstairs attempting to control the device.", "verified": true, "helpfulness": "0/0", "author": "Derek Casper"}, {"rating": 1.0, "review": "Not impressed at all", "verified": false, "helpfulness": "1/2", "author": "Amazon Customer"}]