[{"rating": 5.0, "review": "Feels like a kid at Christmas time", "verified": true, "helpfulness": "0/0", "author": "james dickerson jr"}, {"rating": 3.0, "review": "The referbished Fire Stick kept resetting itself and would not stay on for more than 3 minutes at a time. I would NOT recommend getting a referbished Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Sap"}, {"rating": 4.0, "review": "Works great. The only down side is that annoying power issue. You have to use that power plug to power the stick. Chromecast doesn't need it", "verified": true, "helpfulness": "0/0", "author": "Big Rob NYC"}, {"rating": 5.0, "review": "Great value and a good alternative to purchasing another wifi-DVD player just to access Netflix, Amazon Prime, etc.", "verified": true, "helpfulness": "0/0", "author": "Doria"}, {"rating": 4.0, "review": "Great way to access Netflix and Amazon Video!  I literally just plugged it in and 10 minutes later was watching streaming TV", "verified": true, "helpfulness": "0/0", "author": "Kevin1064"}, {"rating": 3.0, "review": "I picked this up while it was on sale, hoping to see if it was useful.  What I found is that, unless you want to watch Prime video, or plan to rent/buy streaming movies from Amazon, the Fire Stick is mostly unnecessary.  If it had better integration with Youtube, or if I could figure out how to load as many apps on it as Chromecast, I think it would be a solid contender for an HDMI port on my TV.  Instead, it seems like a way for Amazon to lock you into its rental/streaming services.", "verified": true, "helpfulness": "0/0", "author": "C. Beese"}, {"rating": 5.0, "review": "Good still learning", "verified": true, "helpfulness": "0/0", "author": "doug benedum"}, {"rating": 5.0, "review": "Well done - I really like the device, perfect for the function it serves.", "verified": true, "helpfulness": "0/0", "author": "B. Upshaw \"Nerd Overmind\""}, {"rating": 1.0, "review": "Would not stay connected to the wifi. (Not it was not my ISP) The equipment simply couldn't maintain.", "verified": true, "helpfulness": "0/0", "author": "Yankepeach"}, {"rating": 5.0, "review": "Absolute Love!  I have Fire TV for home since I can hardwire the connection.  However I travel a lot, and I don't like the hassle of only watching things on my tablet or laptop- so I use the Fire Stick.  Worked brilliantly in hotels and Airbnb locations.  Even allowed me to work from my Fire Tablet to beam to the TV for some remote work!And super great is if you have a USB port on the TV, you can run power through the TV rather then using the wall plug for the Fire TV stick.  I still brought the plug just incase, but it worked no problems.", "verified": true, "helpfulness": "0/0", "author": "ginna"}]