[{"rating": 5.0, "review": "I was very upset when I bought my new TV, because it did not have the Amazon app on it. as a Prime member I was used to the benefits that Amazon Prime offered. The Fire Stick gave me back my ability to use my Amazon Prime TV. I love the convenience of accessing my prime  movies, and video library. A plus is the ability to control it all from my cell phone remote  app.", "verified": true, "helpfulness": "0/0", "author": "Melanie Davis"}, {"rating": 5.0, "review": "Great functionality in a small package, allcast works well also. Not quite as snappy as the full size Fire TV, but still good enough. Perfect for portable/mobile flat panel or a bedroom/office.  Personally, I wouldn't use it for a home theatre setup... but you could I guess.", "verified": true, "helpfulness": "0/0", "author": "Brad&May"}, {"rating": 4.0, "review": "Very happy with the freedom of choices I have with the frestick", "verified": true, "helpfulness": "0/0", "author": "Charlotte Feinstein"}, {"rating": 3.0, "review": "Its better than what I thought I was going to get for the $40 investment. But this thing takes forever to stay connected to any wifi source. It'll drop in the middle of a movie and then you have to reconnect again, and again, and again. The quality of the device is great. But until that issue gets patched, I'm going to leave it at 3 stars.", "verified": true, "helpfulness": "0/0", "author": "Lee Fesler"}, {"rating": 5.0, "review": "easy to use", "verified": true, "helpfulness": "0/0", "author": "Bert Gustafson"}, {"rating": 5.0, "review": "The Fire TV Stick is dual-band and doesn't require a smart phone to operate.", "verified": true, "helpfulness": "0/0", "author": "Anh Nguyen \"aqnguyen0\""}, {"rating": 3.0, "review": "Decent, but awkward to navigate to sideloaded apps.  Fix that and provide a better launcher menu and I'll give it a 5.", "verified": true, "helpfulness": "0/0", "author": "Randall L. Ames"}, {"rating": 5.0, "review": "Super", "verified": true, "helpfulness": "0/0", "author": "Yusmany Gil"}, {"rating": 2.0, "review": "Very limited content unless you sign up for prime. Apps r not enoughBlatant lies of claims. some very crucial info that they show in their comparision to other competitor devices is false.The power supply is only good if attached to wall jack. Having a similar setting to chromecast results in lack of power and reduced/horrible performance.", "verified": true, "helpfulness": "0/0", "author": "pratik"}, {"rating": 5.0, "review": "It does everything as advertised. I did get confused on one issue...I thought that this could convert my TV to a \"smart\" TV allowing me to surf the internet however if that is possible I don't know how to do it.", "verified": true, "helpfulness": "0/0", "author": "Duane Sneller"}]