[{"rating": 5.0, "review": "I love my Fire Stick. It is great way to use more of  my Prime benefits. Having access  to not only the Prime offerings but the other apps and games on a big screen is amazing.", "verified": true, "helpfulness": "0/0", "author": "Victoria Fain"}, {"rating": 3.0, "review": "I get serious lag while trying to stream netflix despite a strong wifi signal. Has unresponsive controls sometimes.  Needs occasional restarts.  It still streams better than my cheap smart TV,  so that a bonus.", "verified": true, "helpfulness": "0/0", "author": "M.C. \"Mike\""}, {"rating": 5.0, "review": "I like this better than the Chromecast because it supports 5ghz as well as 2.4 ghz. Streaming is more solid with the Fire Stick and things load quicker. Works very well. I would definitely recommend this.", "verified": true, "helpfulness": "0/0", "author": "Aaron Graves"}, {"rating": 5.0, "review": "Very nice thanks.", "verified": true, "helpfulness": "0/0", "author": "Visa \"corn\""}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Julie Moore"}, {"rating": 2.0, "review": "I like Roku's interface and ease of use better", "verified": true, "helpfulness": "0/0", "author": "T. King"}, {"rating": 3.0, "review": "It did work OK on vacation, but the cord is not long enough to even try it at home. Our TV is mounted on the wall so the cord needs to be long to fish through the wall and down to an outlet. Can't even use it at all", "verified": true, "helpfulness": "0/0", "author": "Lisa Perry"}, {"rating": 4.0, "review": "Got to replace my 2nd generation Apple TV as You Tube is no longer supported. You Tube works great. Interface not as smooth as Apple TV. Big problem is that many streing apps are not supported by my internet provider Comcast. So I find myself using both my. Apple TV and Firestick.", "verified": true, "helpfulness": "0/0", "author": "ERIN PODGORNY"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "jeannette elliot"}, {"rating": 5.0, "review": "Works Great  does everything it needs to and Cheaper then most roku boxes ect", "verified": true, "helpfulness": "0/0", "author": "Vern"}]