[{"rating": 5.0, "review": "Bought this because it was on sale and I wanted to see what it was like. We have Roku players, but I like the Fire TV Stick much better! Simple to use and it plugs directly into the tv. Too bad it still needs to be plugged into a power outlet on the wall.", "verified": true, "helpfulness": "0/0", "author": "RDH2"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Luis M. Gomez"}, {"rating": 5.0, "review": "This stick is amazing!!! The setup was very easy.", "verified": true, "helpfulness": "1/1", "author": "shakeriah brown"}, {"rating": 1.0, "review": "Tried 3x. My reviews keep getting denied. The unavailability of this Amazon product on Prime day is a deal breaker.", "verified": false, "helpfulness": "1/2", "author": "KANONE"}, {"rating": 4.0, "review": "But I can't use it on my TV?? I have a 65 projection screen and I cannot find an HDMI slot?? There is a slot on the back of the Direct TV box but that didn't  work, is there another way or do I just return it?/", "verified": true, "helpfulness": "0/0", "author": "Rosemary"}, {"rating": 5.0, "review": "We really love this....", "verified": true, "helpfulness": "0/0", "author": "Connie"}, {"rating": 5.0, "review": "with prime it is a must ,turned hd tv to fairly smart tv", "verified": true, "helpfulness": "0/0", "author": "diana h. liebla"}, {"rating": 1.0, "review": "Had it for a couple of days and now it won't connect to the internet. Tried everything. No fix. Bought me a Roku, better product.", "verified": true, "helpfulness": "0/0", "author": "cdrice"}, {"rating": 5.0, "review": "I love it. It's perfect for me. It seems to run a bit hot if I keep it plugged in, but I don't usually keep it plugged in unless I'm using it. My son has the Chromecast, but even he uses my Fire Stick more than his Chromecast.It's perfect for travel too. Just remember to pack it back up with you when you're going home!", "verified": true, "helpfulness": "0/0", "author": "Watty Watts"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "joel banda"}]