[{"rating": 5.0, "review": "LOVE it!", "verified": true, "helpfulness": "0/0", "author": "Gayle A Taylor"}, {"rating": 5.0, "review": "I am very happy with my Fire Stick.  I first tried the Chromecast and I have been unhappy with it.  Everything buffers if you can even get anything to play at all.  Not with the Fire Stick, it hardly ever buffers, it's so fast.  I am very happy with it so far, I have only had it for a few weeks.  I will update this review if I have any problems but so far so good :)", "verified": true, "helpfulness": "0/0", "author": "Ginger"}, {"rating": 5.0, "review": "Love this. Easy to use. Simple instructions.", "verified": true, "helpfulness": "0/0", "author": "Ellen R"}, {"rating": 5.0, "review": "Super cool! Easy to set up - MUCH MUCH MUCH better than Chromecast!  Will be buying another Fire TV Stick and throwing the Chromecast in the trash!  LOL", "verified": true, "helpfulness": "0/0", "author": "JHD"}, {"rating": 5.0, "review": "I prefer Roku but it works great.", "verified": true, "helpfulness": "0/0", "author": "Johanna"}, {"rating": 5.0, "review": "Outstanding... absolutely love it and the user friendly setup instructions couldn't have been easier - THANK YOU!!!", "verified": true, "helpfulness": "0/0", "author": "Dorene L. Messieri \"krtherose1\""}, {"rating": 1.0, "review": "I have highest internet in country and the streaming lags, particularly with Netflix on this device. Every week, I also need to re-log in with credentials to Netflix. Overall, this device is for using Amazon only experiences and any experiences other than Amazon is extremely poor. I would save your money and buy a Roku instead. I have a Roku and performance is stunning compared with the Fire Stick. I threw my Fire Stick into the garbage. Complete waste of money.", "verified": true, "helpfulness": "0/0", "author": "Ben and Sibylle Rohling"}, {"rating": 4.0, "review": "My only problem with this is it is a little hard to navigate to other apps such as Netflix and HBO as they sometimes get lost on the home menu. Other than that it works great!", "verified": true, "helpfulness": "0/0", "author": "Ermg"}, {"rating": 3.0, "review": "I can't use my Netflix or hula account. Was surprised how many TV shows you have to pay for. Am I doing something wrong. Can you respond", "verified": true, "helpfulness": "0/0", "author": "brenda cook"}, {"rating": 5.0, "review": "I've tried multiple versions of smart-tv devices. This goes back to old linux version of plesk and FrontRow on the Mac Mini. I've given up on the DIY solution as it's not practical for non-IT members of the family. :)I settled on the Google TV systems, but every time I found one I liked, the hardware company would go out of business. I then went to Apple TV, and that seemed to be ok, but the streaming was really weak and the lack of support for Amazon Prime made it really tough to make it a good solution. Chromecast was about the same.I bought the Amazon Fire stick with pretty low expectations. Very quickly, I was blown away. This thing is perfect. It does exactly what I've always wanted my DIY systems to do.I will updated as I keep using it.", "verified": true, "helpfulness": "0/0", "author": "Stanley"}]