[{"rating": 5.0, "review": "So far so good. Just got it a few days ago. Was easy to set up and started enjoying features right away.", "verified": true, "helpfulness": "0/0", "author": "R.E.K"}, {"rating": 2.0, "review": "Instructions were limited & poor (there should be a reference to pdf online that would carefully and fully explain all of the controls and use). I've loaded software, got it to recognize wifi, and tablet, but can not stream anything from Kindle 7\" HDX, after downloading several apps. For a large company, it's surprising how little instruction is supplied. Even the 'position ring' is never explained.", "verified": false, "helpfulness": "0/0", "author": "Harry Poster"}, {"rating": 4.0, "review": "Awesome system ...but needs to list what is available to you with Amazon  Prime separately...", "verified": true, "helpfulness": "0/0", "author": "S. Morgan \"The 'Gotta Have Gadgets Girl'\""}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is AWESOME! Thank you for creating.", "verified": true, "helpfulness": "0/0", "author": "RLK \"RLK\""}, {"rating": 5.0, "review": "I love this so much! Super easy to use with great features and accessibility to many sites; so far, I've only accessed Netflix but we love having it on our TV via wireless and not having to go 'thru' a phone or laptop like some of the other sticks (google stick).", "verified": true, "helpfulness": "0/0", "author": "Minda R. Lynch"}, {"rating": 4.0, "review": "Love the ease of installation for the Fire TV Stick. Not totally impressed with the television shows selection, but if you are a Prime member, the movies are inexpensive. Really like that if you do a pay per view, it's available for 48 hours. I love that I can access Netflix and Hulu, both of which I subscribe to. The games are a blast!!", "verified": true, "helpfulness": "0/0", "author": "Pamela Erickson"}, {"rating": 5.0, "review": "Awesome and easy to use! Love it.", "verified": true, "helpfulness": "0/0", "author": "L.M."}, {"rating": 4.0, "review": "I love it but there needs to be better instructions with it because Im having a difficult time working through all the features.", "verified": true, "helpfulness": "0/0", "author": "Sherri Gilmour"}, {"rating": 5.0, "review": "This might be the greatest invention since Netflix and DVr.  I was impressed with how quickly the firestick connected me to the various movie/tv apps and how easy it was to install. Definitely worth the investment and the wait :).", "verified": true, "helpfulness": "0/0", "author": "Donna L"}, {"rating": 5.0, "review": "Its perfect", "verified": true, "helpfulness": "0/0", "author": "kenn cotton jr"}]