[{"rating": 5.0, "review": "As a 66 year old Grandma getting ready to retire, I  decided to  get rid of my very expensive cable TV  and land line phone and just stay with  WiFi  and my cell phone. So I  purchased  the Fire Stick.So far, it is working, after I  had to purchase  a \"smart\" TV. My other TV was only 3 years old, but was not WiFi  compatible. I  am still learning my way around the apps, etc.I  think I  will enjoy it, once I get use to it.", "verified": true, "helpfulness": "1/1", "author": "Alice"}, {"rating": 1.0, "review": "Sucks. Although I have excellent email... the fire stick. Keep asking to restore internet connection. Which really sucks sucks sucks!!!!!!!!! Thank you for my input------", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works great!  Just as advertised, small and portable, great for using in different rooms, vacation etc.", "verified": true, "helpfulness": "0/0", "author": "Steve B"}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Knox"}, {"rating": 4.0, "review": "Fantastic purchase.", "verified": true, "helpfulness": "0/0", "author": "jack"}, {"rating": 5.0, "review": "so far, it's working wonderfully!  I love all the apps you are able to use through it.  It's nicer than having to use an additional HDMI cord to connect my computer to my tv to do the same stuff the Fire Stick can do!!", "verified": true, "helpfulness": "0/0", "author": "cheltseabird"}, {"rating": 5.0, "review": "Love it,thanks", "verified": true, "helpfulness": "0/0", "author": "Lawrence Hicks"}, {"rating": 5.0, "review": "This thing exceeded my expectations. I dislike that I cannot use it to watch The Game of Thrones but that is entirely a HBO issue. The stick works extremely well. It is user friendly. Thank you Amazon. Well done. I would recommend this item to anyone.", "verified": true, "helpfulness": "0/0", "author": "Mikel Thompson"}, {"rating": 4.0, "review": "Works well much better than Rok, this one is simple one time setup with tiny remote and great Pic, not quiteHD but close. Failed to start one time, unplugged power for 15 seconds took off again., Runs cooler than thefirst one other brand, it was hot to touch.Cons: Pic quality not quite as expected but ok.The center ring on control is a little hard to make contact.", "verified": true, "helpfulness": "0/0", "author": "Richard Harris"}, {"rating": 5.0, "review": "New in original packaging & works to my expectations", "verified": true, "helpfulness": "0/0", "author": "Katara"}]