[{"rating": 5.0, "review": "4 more GB than Google Chrome and a lot more apps!  Much to enjoy, very clear, watching Netflix or Prime movies from Amazon is great but has so much more to offer.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "...more like a plea for help! I bought this as a Christmas gift for parents, assuming that their TV was young enough to have and HDMI port. Surprise! It doesn't. However, it does have a USB port (not micro). I've searched for HDMI to USB adapters and I know that generally a cable is a cable is a cable, but I just want to know if anyone had recommendations on which one to get? Or am I just gonna have to tell them to buy a new TV?", "verified": true, "helpfulness": "0/0", "author": "Nichole"}, {"rating": 1.0, "review": "I fortunately bought this for $19 when it was on sale. Not even worth that price. Video keeps freezing or just going completely black while sound is still playing. We're going back to our old Roku player as I speak. You failed on this one Amazon!", "verified": true, "helpfulness": "1/3", "author": "K. C. Myers \"KyMy\""}, {"rating": 4.0, "review": "I like it, pretty sleek and easy to use. Use it mainly for Netflix, Amazon Prime Video and Youtube.I am using my Samsung TV's USB port to get the power instead of power adapter and it works perfectly.Here is what I would like to see in future for functionality:- Iphone and Android app to control.- Network drive support (no I don't like to store my videos on cloud)", "verified": true, "helpfulness": "0/0", "author": "Vasif Shaikh"}, {"rating": 2.0, "review": "Its too slow. I first put it on my television in the Family Room which is on the other side of the house from my router. I could not get connected at all as the stick was too slow. I then plug it into my bedroom television which is ten feet from my router. I have cable internet, so the internet is not slow. It played fine on the bedroom television for about 15 minutes, then it froze. After several tries, I was not able to get back in. Later in the day I got in for a little while, then the same problem. The picture quality is very good. Set up is easy. The speed is unacceptable. I only paid $19.00 for it and its not worth that to me, but it would be too much of a pain to return it for that low amount of money. I would just spend the extra and get the Roku 3. That way you could watch a movie without it freezing in the middle of it. I have an old outdated Roku LT, and never had a problem using it even on the family room television. I love Amazon, and they're products are usually really good, but I'm disappointed with this one.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 3.0, "review": "Sometimes it works well and sometimes it does not work well at all.  I have emptied the cache's and still it either has an issue while playing a video, or it will advise that buffering will be a problem, (and it is;  it stalls and the video locks up while the audio continues, or it goes to black) even though the wireless connections indicates \"excellent, 54 mbps\".  I need to try connecting on my computer to see if that will work out better, BUT, the video is much more enjoyable and was intended for my 54\" flatscreen.  The best part of this fire stick are the photos on the screen saver that play  ---  whenever the program that I was watching crashes.  It's a great idea, but I think it needs more work.  By the way, the photos are interesting and beautiful.  Also, ironically, the first time I used it, it worked like a charm and played all the way through \"The Originals\"; even with commercials.", "verified": true, "helpfulness": "0/0", "author": "A. L. Madis \"Foderwing\""}, {"rating": 5.0, "review": "I have a Roku 3, a Chromecast, and just received my Firestik.  To be honest I didn't expect much from a relatively young product like this, but I'm impressed.  It is as fast as the Roku 3 and for watching videos and playing music, just as good. In some ways it is better because Amazon's user interface is easier to browse media and apps within the Amazon cloud and store.  It uses the same UI for Netflix as the Roku 3.  I tried a few games and they were responsive.  I don't have the game controller, but I'll probably get one. One game kept crashing, but I don't blame the device.I love all three for different reasons and I'm happy to add this device to my collection.", "verified": true, "helpfulness": "0/0", "author": "J. Cornett \"supplanter64\""}, {"rating": 5.0, "review": "Love my fire stick! I have the chromecast as well, and this thing is super fast, plus being able to watch amazon prime is awesome!", "verified": true, "helpfulness": "0/0", "author": "NYMama"}, {"rating": 3.0, "review": "Sorry, this review is about Amazon coins and their implementation on the Fire TV Stick.  This may be applicable elsewhere, but I first encountered the coins on the Fire TV Stick, so my feedback for them is going here.Just received my unit and wanted to buy an app.  It showed $4.99 or 499 coins.  I checked the price of 500 coins and it was $4.60.  Seemed like a better buy, so what they heck, I'll try to save $0.40.  I buy the coins and and try to purchase the app.  To my surprise the price was 499 coins PLUS 30 coins tax.  Want 30 coins?  Sorry, that's another $4.60.My chief complaint is that tax wasn't included in the price of coins listed for the app.  I'm sure this is explained everywhere and common sense, making my mistake my fault, but it was a real WTF for me.  I should have known better than to buy another currency.", "verified": true, "helpfulness": "0/0", "author": "Bennett F. Dill"}, {"rating": 3.0, "review": "Pros:  pretty responsive, looks good.cons:  minus one star for being too amazon prime centric.  I feel like the way to get people to use prime streaming more would be to get more content people want, rather than trying to force it upon them via interface.minus one star for the annoyingly square shaped plug, which covers more than one slot on power strip.  seems unnecessary and would have been easy to avoid in the design process.the interface is pretty smooth, but at certain times seems clunky and unintuitive.  overall the fire stick shows potential, but is not ready to replace my roku box.", "verified": true, "helpfulness": "0/0", "author": "Mitchell \"dystopias\""}]