[{"rating": 3.0, "review": "I think it is pretty simple to use, I like the selection and the Prime exclusives.  My husband and I share a Prime membership (he is the primary Prime member).  I do not like that the shares Prime benefits do not include the Prime exclusives. Any time we want to watch any of the free Prime programs we have to deregister and then log in under my husband.  There are many programs you would need to pay for, but I did find a lot of the stuff I wanted to watch that I would have to pay for I can find on Netflix.  I also feel this loses connectivity pretty frequently and the only way to restore is by resetting the Fire stick.  It is not an issue with being far away from the modem (it is literally about 2 feet from the modem).  I gave this 3 stars because I only paid $19 and for that little money it is pretty good.  If I had paid more I would have given 1-2 stars.  Not sure if the FireTV is better with the connectivity.", "verified": true, "helpfulness": "0/0", "author": "Michelle Sullivan"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 4.0, "review": "Nice little portable package that can be carried with you anywhere. Easy setup. I haven't tried streaming a movie yet, but plan to soon, as I am a member of Prime. The only negative that I don't like is that the dongle electric plug is too wide and takes up more than one socket on my surge protector. I suppose that it can also be plugged into the TV's USB port, but Amazon recommends to use the dongle for best results. I did appreciate the $19 offer for Prime members, back in November, which I did take advantage of!Update; I just finished streaming a nature show, it was very smooth and easy with great picture quality. I am tech challenged so I really cannot over stress my appreciation for the ease of setup and use.", "verified": true, "helpfulness": "0/0", "author": "virginia  d"}, {"rating": 5.0, "review": "Very easy to setup. Really nice to have a access to all the benefits.", "verified": true, "helpfulness": "0/0", "author": "Lisa Freetly"}, {"rating": 5.0, "review": "Very nice piece of hardware, did exactly as advertised and does it efficiently. This is basically a shrunken down (an slightly under-powered) Amazon Fire TV, though for the price its more than worth the purchase. This device is Android based so sideloading apks is possible and has extended its use exponentially. By far one of the best purchases I've made - I got it for $20 back when it was just announced with the Prime membership discount - and plan to buy a couple more as gifts for family and friends. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Aundré Grunenfelder"}, {"rating": 5.0, "review": "Easy to use. Was able to load all my apps. Nice quality. Like the remote.", "verified": true, "helpfulness": "0/0", "author": "Sonia Meyer"}, {"rating": 4.0, "review": "I wish the movies weren't so old. Many have been on regular tv.", "verified": true, "helpfulness": "0/0", "author": "Patricia bonds"}, {"rating": 4.0, "review": "So far my experience with the FireTV Stick has been very positive. The user interface is very well done, and really enjoying the access to some of the amazon gaming catalog.So far I've only had 1 issue, where the device started scrolling in random directions, and then was unresponsive. I was only able to fix the issue by unplugging the power to the device and then plugging it back in.Other than that, thumbs up from me!", "verified": true, "helpfulness": "0/0", "author": "Jon W."}, {"rating": 5.0, "review": "Easy set-up!  Purchased two for my guest bedrooms and they loved them.", "verified": true, "helpfulness": "0/0", "author": "Tim Ross"}, {"rating": 4.0, "review": "Hulu App loads slowly and runs a bit choppy at times. also removing the unified parental locks of the Fire TV is a bit of a disappointment. Other than that I love it!", "verified": true, "helpfulness": "0/0", "author": "Ropodope"}]