[{"rating": 5.0, "review": "I haven't subscribed to cable for over 3 years.  I have relied on streaming through my PS3 but unfortunately my crappy  internet service provider does not support HBOGO.  I saw that the Fire Stick was reasonably priced therefore I ordered it.  Placed order on a Sunday and it was here by Wednesday (a whole 3days before Amazon said it would be here).  I couldn't wait to get home from work and watch my favorite shows using the Fire TV Stick.  Set up was easy and I was able to watch HBOGO with ease (thank you Mom).  I even downloaded the Amazon fire TV app to my phone so I am able to control my TV with it.  No need to purchase the 39buck remote with voice command.  The app has voice command and the ability to search through a keyboard.  The only regret I have is not ordering this sooner.", "verified": true, "helpfulness": "0/0", "author": "Moe_Moe"}, {"rating": 5.0, "review": "First and foremost, I've tried several of these contraptions. This has been my favorite so far. It's crashed a couple times but only cause we've used it to much and it over heated! It's quicker, it's smarter, it's menu is cleaner. Tossed the Chromecast a day later!", "verified": true, "helpfulness": "0/0", "author": "Amandof8"}, {"rating": 5.0, "review": "I love having this Fire Stick for our TV. WOW!  We get to select from so many movies and TV shows!", "verified": true, "helpfulness": "0/0", "author": "Lynn Bolden Braxton"}, {"rating": 5.0, "review": "I'd like more options for tv but there are lots of movies. Everything you need is in the box. I kept thinking there must be more to setting this up but it really was easy.", "verified": true, "helpfulness": "0/0", "author": "ebrownie"}, {"rating": 5.0, "review": "Very convenient and easy to use for the less technologically inclined such as myself.", "verified": true, "helpfulness": "0/0", "author": "Keri M. Watson"}, {"rating": 5.0, "review": "Good.", "verified": true, "helpfulness": "0/1", "author": "Jigu patel"}, {"rating": 5.0, "review": "It's awesome! Way better than a Chromecast. Easy to use. Recommend.", "verified": true, "helpfulness": "0/0", "author": "Karl Fisher"}, {"rating": 5.0, "review": "It was given as a gift...but I am extremely satisfied with all of its features.", "verified": true, "helpfulness": "0/0", "author": "Gary Hill"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Adrian Chinchilla Borbon"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "victor cruz"}]