[{"rating": 5.0, "review": "The fire TV stick works just fine.Thanks.", "verified": true, "helpfulness": "0/0", "author": "Sol A. Gonzalvo"}, {"rating": 5.0, "review": "Easy setup.Easy use all around.", "verified": true, "helpfulness": "0/0", "author": "London"}, {"rating": 4.0, "review": "I've had a Roku and a smart BluRay player, both really easy to set up and use, but I've been looking for something that doesn't take up a lot of space so I chose the Fire Stick, mainly because of the introductory offer of a discounted $19.99. It comes in a very small black box and has everything you need to connect it to your tv.Set up, for me, was tricky. I have DSL service so, on a good day, get about 7mbps, not great, but better than my old 2.29 mbps from another provider. The Fire Stick, right off the bat, kept giving me error messages that the internet either wasn't connected or was too slow and kept shutting down during the inital connection and download of an upgrade. After about a half an hour waiting for the download to install, the Fire Stick let me into the service.Trying to log in and set up my various accounts on all the services I use, frustrating. Then I tried to watch a show. I kept getting error messages about the slow internet connection and got really frustrated, so went back to watching those services on my desktop. I really wanted to love \"the stick\" (eww, that sounds a bit creepy), but was so frustrated I decided to give it a rest.Well, I tried again tonight and, guess what? OK I'll tell you, it worked great. No error messages, picture was incredible, sound fine, Netflix and HULU loaded and played as they should and an Amazon Prime show played flawlessly.I'm giving it 4 stars because, since I have no problems with my internet connection while watching shows on my Fire HDX I expected the same quality of connection in the Fire Stick. Also I was hoping that Acorn TV (British television) might be in the app line up and isn'tI did try the Fire TV remote app for android and it works pretty good. Haven't tried the voice search option yet, but do like the idea of having a remote always as near as my phone.", "verified": true, "helpfulness": "0/0", "author": "Yodi \"DJ Burma\""}, {"rating": 4.0, "review": "Fairly nice device with fluid navigation. Seems smoother than my roku stick.  Seems like you pretty much need prime to enjoy the amazon content with Netflix and other apps kinda pushed back to page two of the menu but not too difficult to locate and launch any of the apps. The output looked great on my samsung smart tv.  Some of the cable premium apps like showtime don't connect with charter cable company credential, but neither does the Apple TV for that matter. The hardware remote is excellent and intuitive. The remote app for android os seems pretty cool. I would say overall this is a great value for the money.  I have most of the steaming devices Roku xs, amazon stick, roku stick, Apple TV, and chromecast.. I have listed these in the order of my personal preference. I feel an up to date roku box ( not stick) would still be the champ amongst these contenders. I will say I was really surprised that the fire stick does place a solid second for me and when you factor price it almost can't be beat. I personally would not compare this to chromecast the fire stick I feel is a much easier for simple streaming. I hope to see this device give roku a good run in the future.", "verified": true, "helpfulness": "1/1", "author": "DjFRERE \"DjFRERE.com\""}, {"rating": 2.0, "review": "Sluggish. The menu sticks, the video seems to be constant buffering. You could try and blame it on my setup, but I have a Fire TV original and that works flawlessly. I love it. This one was worse than the Chrome cast. I am hopeful that Amazon will work out their performance bugs and improve this. Everall, I only give it a two (vs. a one) because I like the layout of the Amazon TV UX and that they included a remote with the stick.", "verified": true, "helpfulness": "0/0", "author": "Michael Villani"}, {"rating": 2.0, "review": "I must say so far I am disappointed in this product. I already was able to see Netflix, Amazon Video, and many of the other services using my PS3. The only reason I purchased this device was to mirror my Galaxy S5 screen onto the Fire TV Stick. I was excited when I received the device well before the promised date (hence the extra star), but that soon turned into disappointment when the mirroring failed. I have seen others complain about the same issue so I know that it is not something unique to my phone or TV Stick. I am desperately waiting for an update resolving this issue because I don't have a reason to use this device otherwise.", "verified": true, "helpfulness": "0/3", "author": "Vahid"}, {"rating": 5.0, "review": "works just fine", "verified": true, "helpfulness": "0/1", "author": "Adrian Fenesan"}, {"rating": 5.0, "review": "Love this, works like a charm.", "verified": true, "helpfulness": "0/1", "author": "Chris S."}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "1/2", "author": "GEORGE CMIEL"}, {"rating": 5.0, "review": "I enjoy this a lot. I can watch Netflix, Amazon Prime, Flixster, and Hulu Plus easier! :)", "verified": true, "helpfulness": "0/0", "author": "Ben L."}]