[{"rating": 2.0, "review": "Not bad for the price but reception is sketchy at times.  Slow reaction to selections.  Remote is simple but could use some improvement.  I like the USB plug that keeps the stick hidden behind he TV.  Kids liked some of the free games but the remote is not very well suited to play them.  We will likely be returning the unit to try something else.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 1.0, "review": "Normally I am a huge advocate for anything Amazon, but this was a huge let down. When I first started using the fire stick I thought it was really nice and easy to use. That is until I wanted to actually watch something. Netflix and Hulu would repeatedly glitch (I made sure that it wasn't the Internet and even checked on another streaming device with no problems) and the glitches would often cause a black screen that could only be fixed by closing out, going to the home screen, and starting over. Overall, I would not recommend this product to anyone and strongly encourage them to go with a Roku device for streaming.", "verified": false, "helpfulness": "0/0", "author": "Jesssica"}, {"rating": 5.0, "review": "Fire stick is awesome. Made my non wireless smart tv wireless and turns any TV into a smart tv", "verified": true, "helpfulness": "0/0", "author": "Max"}, {"rating": 1.0, "review": "only works w/amazon apps", "verified": true, "helpfulness": "0/0", "author": "Jose F."}, {"rating": 5.0, "review": "Love the Fire Stick...but the HBO Go app stinks.  All of the other apps work brilliantly, but the HBO GO app sticks, stutters, and annoys the heck out of me.  I suffer through it most of the time but will sometimes just get the laptop out when I can't stand it anymore.The Amazon Prime and Netflix applications are seamless and I never have issues.Come on, HBO - get these bugs worked out!", "verified": true, "helpfulness": "0/0", "author": "P. Hardilek"}, {"rating": 5.0, "review": "Two words.....LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent alternative to Chromecast that mates very well with Prime Membership.  My LGTV stopped supporting Youtube and had no support for Prime videos.  Watched Legend of Korra seasons 1 and 2 with it and was worth it just for that.  The screensaver landscapes are also mesmerizing.  I would pay just to update the photos every month and imagine myself there inside the TV.", "verified": true, "helpfulness": "0/0", "author": "Bad Penguin \"bad_penguin\""}, {"rating": 1.0, "review": "I am very disappointed with the fire stick. The video freezes while the sound continues. Then the video goes really fast to catch up. When I watch the same thing on my Apple TV everything is perfect. The audio on the Apple TV is also far superior to the fire stick. I'm playing both thru a high quality sound system. 😎", "verified": true, "helpfulness": "1/1", "author": "Mitch Greenup"}, {"rating": 3.0, "review": "I like it but it just quit working.....Waiting for response from Amazon.", "verified": true, "helpfulness": "0/0", "author": "ALARS"}, {"rating": 4.0, "review": "What can I say about this Fire TV Stick, that has not already been said. I like that fact that once you set it up you don't have to sign in again to your apps, And there is soo much more that what I expected it to be... I have found things to watch or listen to that I never would have watched before. I wish the remote actually had numbers like an actual TV remote... trying to unlock your code with the pin can be difficult. And I am not crazy about the fact that you can't turn the stick off... you can put it to sleep, but its still on downloading and gathering information.", "verified": true, "helpfulness": "1/1", "author": "AC8311"}]