[{"rating": 5.0, "review": "I have had my Fire TV Stick since 12/8/14 and it's very fast no lags.  I also have a PS3, Boxxe Box, 3 Rokus and Chromecast.  The Fire TV Stick play back is fantastic!  The setup only took about 15 minutes and I will retire some of my older stream devices now and use the Fire TV Stick.  I would recommend the Fire TV Stick to any Amazon Prime member.", "verified": true, "helpfulness": "1/1", "author": "Luke"}, {"rating": 5.0, "review": "Great product.  Would love to cut the cord to the monopolistic telephone cable company.  Great programming with my Amazon Prime account for free.  Would wish this controller could be used for both the Fire TV unit and the Fire TV Stick unit, but I downloaded the Fire TV app to my smartphone, so that works well.  I do wish that there would be a way to put the prime members free option on the top of the choice.  Often you have to go to the submenu past the opportunity to rent or buy.  Makes no sense other than trying to sell products.  Have not tried gaming with it yet.", "verified": true, "helpfulness": "1/1", "author": "WhatAboutBob \"BlueJayWay\""}, {"rating": 5.0, "review": "Setup super fast and easy. Receives signals from my network router and has a great selection of sources including ESPN and Netflix, Would really like YouTube to be available.", "verified": true, "helpfulness": "1/1", "author": "Joe Seda"}, {"rating": 2.0, "review": "Disappointed!  Amazon, what were you thinking?  Roku has you beat and it is NP even close.  Too few apps and channels.  Can not search internet.  Can not play movies downloaded fom google play.  Can not play from choke browser.  Unless you do a software upgrade to correct this...I will be asking for a refund.", "verified": true, "helpfulness": "2/4", "author": "DodoDance"}, {"rating": 5.0, "review": "This was the perfect gift!  I absolutely love the fire tv stick.  This allowed me to watch movies directly to my tv.  I didn't even have to use my ipad!  Since my cable company dropped nick jr. This also allowed me to purchase episodes from amazon and allow my kids to view them on the tv. In addition to that if you like watching live streams you can view twitch.  This thing is amazing!", "verified": true, "helpfulness": "1/1", "author": "Victoria bonds"}, {"rating": 3.0, "review": "It's very good but some applications like yup tv keeps crashing", "verified": true, "helpfulness": "0/0", "author": "JSK \"Chhangani\""}, {"rating": 1.0, "review": "I am so not happy with one of my firesticks  It won't even work in my bedroom. I am a Nexflix subscriber. Have any suggestions?", "verified": true, "helpfulness": "1/2", "author": "Cindy Johnson"}, {"rating": 4.0, "review": "I like the Amazon fire stock but u do t like amazon prime it's exactly like Netflix but with older movies", "verified": true, "helpfulness": "0/0", "author": "Kollin Murray"}, {"rating": 5.0, "review": "Has replaced my Chromecast... Just too bad it can't stream YouTube videos!1/17/15: Edit: I was wrong. Found an app on the Firestick that DOES let me stream and interact with my phone for YouTube videos!  6 stars!  (if I could)", "verified": true, "helpfulness": "2/2", "author": "R. Kuipers"}, {"rating": 5.0, "review": "Bought this for my mom, she isn't tech savvy but manages to use this with ease, works well and is easy to set up.", "verified": true, "helpfulness": "1/1", "author": "Kay Jay"}]