[{"rating": 5.0, "review": "Compact, easy to use, works great, and great functionality! Definitely works great for Amazon Prime, Netflix, Hulu, RedBull TV, TED Talks, etc... Very happy I made this purchase (affordable too)", "verified": true, "helpfulness": "0/0", "author": "Mikey Bones"}, {"rating": 5.0, "review": "Worked great", "verified": true, "helpfulness": "0/0", "author": "Joyce Fisk"}, {"rating": 1.0, "review": "Mirroring from the kindle does not work well. Picture is pixelated with multiple audio drop outs", "verified": true, "helpfulness": "0/0", "author": "Melinda Dem"}, {"rating": 5.0, "review": "It shows shows on the TV.", "verified": true, "helpfulness": "0/0", "author": "Gvn Nvt"}, {"rating": 5.0, "review": "Bought this as an alternative to cable. Subscribed to SlingTv for $25/month and can watch enough TV to satisfy my needs. Streaming is very good with little hesitation. My WiFi is running at about 4000 Kb/s download speed. which is fast enough. The HD comes through on the TV fine.The Fire stick basically turns the TV into a giant ipad. Downloading apps is easy although the apps carry their own pros and cons. The remote is easy to use and reasonably intuitive. It takes a little practice like any device. It will be interesting to see how streaming advances in the future. I would love to see more live content.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"DBee\""}, {"rating": 4.0, "review": "Awesome! My family uses Amazon Prime a lot and this is a perfect upgrade to using Amazon", "verified": true, "helpfulness": "0/0", "author": "Allan Long"}, {"rating": 4.0, "review": "It took a little work to get it started, the enclosed instructions were not very clear.  It works as advertised but it is a data hog", "verified": true, "helpfulness": "0/0", "author": "Sherri Clark"}, {"rating": 5.0, "review": "Great product. Easy to install and navigate. Wish I would have bought it sooner. Lots of great content.", "verified": true, "helpfulness": "0/0", "author": "Lisa L Moore"}, {"rating": 1.0, "review": "It did not work after hours with customer service", "verified": true, "helpfulness": "0/0", "author": "thomas mccullough"}, {"rating": 5.0, "review": "Perfect for the bedroom TV!  Remote is very responsive and easy to use.  Easy to set-up!  Very affordable!  Do it!", "verified": true, "helpfulness": "0/0", "author": "The Beave!"}]