[{"rating": 1.0, "review": "Got really disappointed when noticed the device does not allow the network connection DNS to be configured. I hope they add this feature to this unit soon.", "verified": true, "helpfulness": "0/1", "author": "Nariman"}, {"rating": 1.0, "review": "I will be returning mine.I am one to give products the benefit of the doubt.  I do not have expectations other than what they are described as being capable of doing.  While the Netflix and Hulu apps run alright, the live streaming apps (WatchESPN) are junk.  I have 50 Mbps internet and never have interruptions when I run WatchESPN through my Chromecast but with the Fire TV stick it is constantly losing connection.  I re-started my router and modem 10 times, made sure I had the latest firmware, and did my best to give this a chance, but it keeps cutting out every 20-30 seconds.Needless to say, I am back to streaming from the laptop through my Chromecast.  I am extremely disappointed.  If all you want is to run paid subscriptions on your TV, this works OK, but I would get a Chromecast and run it through a laptop instead.", "verified": true, "helpfulness": "0/3", "author": "Steve Anderson"}, {"rating": 5.0, "review": "It fir d", "verified": true, "helpfulness": "1/1", "author": "Rusty B \"Rusty\""}, {"rating": 4.0, "review": "I have not had tv for 15 years (there's never anything good on!), but it has gotten to be a hassle to stream everything from my Mac.  So got a little flat screen and the fire stick.  Has been great, not much hassle to connect (have all those passwords ready, including my 20 character modem password).  Haven't gotten Amazon Prime yet, I use Netflix and Hulu, but plan to get Prime.  Remote control easy to use... haven't found how to 'search' on Netflix yet, but over all... very cool.", "verified": true, "helpfulness": "0/0", "author": "Michelle Young"}, {"rating": 3.0, "review": "Nice streaming device, especially if you have Prime. Setup was easy. Disappointed I can't stream my own photos or videos to my TV directly from my Samsung devices. Must first unload them to the Amazon cloud. Of major concern to me is the stick's data consumption. After little more than an hour of use, streaming a 54 minute episode of Rome, the stick consumed about 3-4 gigs of data. On my 30gb wireless data plan (no cable internet) that means the stick will only get very limited use. Using the Amazon Instant Video app on my smartphone didn't appear to consume nearly as much data.", "verified": true, "helpfulness": "2/3", "author": "Roy"}, {"rating": 4.0, "review": "works well.  I love it.  BUT, the remote control battery case is impossible to open.  Had to pry them both open with a knife.", "verified": true, "helpfulness": "0/1", "author": "Catski"}, {"rating": 1.0, "review": "My internet service is 150 down and 20 up. Blazing speed. But anything I watch on this Fire stick gets continual buffering and a pop-up telling me my available bandwidth is too low for uninterrupted streaming. What? 150 down is too slow? Don't have this problem watching on my computer. Or with my Roku. Just the Fire Stick.  Not sure where the problem lies.. But continually watching that little circle go around and around gets my blood boiling.", "verified": true, "helpfulness": "0/3", "author": "Mark Wallace"}, {"rating": 5.0, "review": "So far, it is working well. I like it better than the Google Chromecast I also have.", "verified": true, "helpfulness": "0/0", "author": "Dorian"}, {"rating": 4.0, "review": "This is NOT a reasonable replacement for Chromecast! I love the flexibility of the Fire TV Stick, but I can't use the apps I have on my tablet to stream content. You MUST use the apps offered by Amazon. And while they're offering a lot of cool apps and games, many that overlap with Chromecast's offerings, there is such a wide selection missing, I am forced to use both devices to get the widest selection of great content! No VUDU, no Crunchyroll, no Disney Movies... and that's just a start of what WON'T play on this device! That is VERY frustrating! I hope Amazon adds a casting option to this soon (there IS a mirroring option, but that's hardly the same!). I can only recommend this for folks who either don't plan on using Chromecast or have a spare HDMI port. Also, word of warning... this device is recommended to be plugged into the wall outlet, not the USB port on the TV, making it \"always on\" and thus, an energy drain if you don't use it a great deal!", "verified": true, "helpfulness": "0/0", "author": "rkr1970"}, {"rating": 5.0, "review": "Very Slick! I also purchased a ROKU Streaming stick at the same time to compare on my own. Well the Amazon stick won at my house!!!", "verified": true, "helpfulness": "0/0", "author": "Radcliff Hester"}]