[{"rating": 5.0, "review": "I love it when people trash a product because they didn't do their homework prior to buying it.  Like assuming that you will get free access to services like Netflix or Hulu. Or not knowing that a huge chunk of the Prime video library is not free. Or not realizing that the stick requires an outside power source (mine works great connected to the USB port of my UVERSE box, did't work on the TV's USB port). If you don't have memberships to the above mentioned services, and are not planning to get one, this product is not for you, unless you don't mind spending 40 bucks to play a few free games on your big screen TV.The stick works as advertised. Immediately detected my 5GHz network and connected flawlessly. No drops in the connection. If your router is \"far\" from the stick, you may want to try a 2.4 GHz connection (reaches farther that the 5 GHz). I don't have Netflix or Hulu, but Prime videos stream without any issues, even the HD ones.  I sideloaded XBMC and I'm enjoying my video and music collection from my NAS, even 1080p movies.  I have access to my Amazon music files, plus playlists provided by Amazon for free. There's a cool Shutterfly app that allows you to see all your albums directly from your online account. Pandora, IHeart radio, etc. And I'm sure many more apps will be available pretty soonThe stick runs a little bit warm, but that doesn't seem to affect performance.The user interface is \"Amazon heavy\", but what do you expect?I pre-ordered it for $20, so it was a no brainer, but if I needed another one now, would not hesitate to buy it for $40.Again, great product if you know what you'll get from it.", "verified": true, "helpfulness": "1/1", "author": "AKW"}, {"rating": 5.0, "review": "Great item - especially for Prime members.", "verified": true, "helpfulness": "0/0", "author": "Brad Burdick"}, {"rating": 5.0, "review": "Works great with our older TV", "verified": true, "helpfulness": "0/0", "author": "lauren"}, {"rating": 5.0, "review": "I can't believe how great this thing is!!!", "verified": true, "helpfulness": "0/0", "author": "Gary Shea"}, {"rating": 5.0, "review": "Absolutely loved it!  Easy to use and it saved us from the endless reruns and holiday repeats. The original prime series are amazing", "verified": true, "helpfulness": "0/0", "author": "Sandra Chafin"}, {"rating": 1.0, "review": "Having multiple issues connecting this device. Works for a while then quits. Screen will go blank or show up with multiple limes or static. It will run for hours just fine, then won't work at all the next time. Sending it back disappointed. Clearly not ready for Prime time yet, Amazon.", "verified": true, "helpfulness": "1/2", "author": "Jeff"}, {"rating": 4.0, "review": "Great. Product works just fine", "verified": true, "helpfulness": "0/0", "author": "Albert"}, {"rating": 5.0, "review": "best product for the end of 2014", "verified": true, "helpfulness": "0/0", "author": "Fernando De Lara"}, {"rating": 4.0, "review": "Great for rooms with no cable jacks or as a way to reduce cable costs,  not as many stations as roku.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Didn't realize I'd  be stuck on Amazon account.  Thought I'd have as much flexibility as roku", "verified": true, "helpfulness": "0/2", "author": "KP"}]