[{"rating": 2.0, "review": "I had to upgrade to a higher band width and I am still having trouble with the stick.", "verified": true, "helpfulness": "0/0", "author": "teresa"}, {"rating": 5.0, "review": "LOVE IT!! Take it everywhere we go!!", "verified": true, "helpfulness": "0/0", "author": "Tami Olney"}, {"rating": 5.0, "review": "Best HDMI Stick on the market.  Love this thing, wish I could have bought more at the introductory price.", "verified": true, "helpfulness": "0/0", "author": "BDK6017"}, {"rating": 5.0, "review": "Great little gadget, haven't had any issues and there is so many options available!", "verified": true, "helpfulness": "0/0", "author": "Bridget"}, {"rating": 5.0, "review": "The Fire TV Stick is awesome! Both Netflix and Prime Videos work flawlessly. It is very easy to use, and it's a great price. It works just as well as the Roku 3, which we use in another room. I would highly recommend the Fire TV Stick to anyone looking for a great streamer. If you're a Prime Member, you can take advantage of all the Prime video movies and tv shows, and it will also stream Prime Music through your TV at no additional cost.  The only negative I can say about the device is that the remote is tiny, so the remote can be easily lost, especially if you have children who like to run off with remotes. Other than that, it is great!", "verified": true, "helpfulness": "0/0", "author": "Joffrey Baratheon"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Frances"}, {"rating": 5.0, "review": "Works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "David C. Armstrong"}, {"rating": 5.0, "review": "I love this! Very Happy with it!", "verified": true, "helpfulness": "0/0", "author": "Patricia Cox"}, {"rating": 5.0, "review": "Love it! I can now watch what I want instead of what is scheduled. I don't have a real fast internet connection and I can still use it without buffering while I use my laptop, except when I have to upload a large file for college. Lots of choices, too! Did take me a bit of trying to get it set up as the instructions aren't real clear.", "verified": true, "helpfulness": "0/0", "author": "fncy713"}, {"rating": 5.0, "review": "Awesome!!! Best investment ever. Get all my shows and entertainment in one spot. So easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Mary Balderas"}]