[{"rating": 4.0, "review": "Easy to set-up and use. Love it so far. Only 4 stars because we've only had it for two weeks.", "verified": true, "helpfulness": "0/0", "author": "James \"James\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Dori"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Nnhunter"}, {"rating": 5.0, "review": "I bought this for my mom and sister to use on a television in my house that doesn't have a cable box. I wish I knew about this months ago as I would have gotten one for myself instead of purchasing my smart TV... Its great... You can't go wrong with this", "verified": true, "helpfulness": "1/1", "author": "Seekret's Corner LLC \"Esty\""}, {"rating": 1.0, "review": "I have yet to be able to view any video- TV show or movie?When I select a video- it loses its connection to my WiFi.Even though it claims the connection is strong.I am totally disenchanted.", "verified": true, "helpfulness": "2/4", "author": "Eric Shepler"}, {"rating": 5.0, "review": "Love it.  We already had the full size Amazon Fire TV and Amazon Fire TV game controller for our living room.  When Amazon offered promotional pricing on the Fire TV Stick, we couldn't pass it up.  We now have one set up in the bedroom and one set up in the man cave.  With Amazon Fire TV and a HDTV antenna, we have been able to cut almost all ties with our cable company aside from internet.  Our cable bill averaged $200 a month and now it's only $79.99!  Plus for us, if you only have internet services, there aren't any taxes and surcharges driving your base bill up.  This means it's only $79.99 to our cable company every month.  The picture quality with the Fire TV Stick crisp and we haven't not had any issues with buffering, etc.  We our very happy with the purchase.  The only real drawback to the Stick versus the full box is that the stick does not include the voice search, but I believe you can utilize an app on your phone for this.  I just haven't found the need to.  There seem to be more and more apps everyday and plenty of free movies and shows, especially with a Prime account.  Even my parents have now made the change to Amazon Fire TV.", "verified": true, "helpfulness": "1/2", "author": "Darth Rob"}, {"rating": 5.0, "review": "Great addition to our home and lets us decrease our cable bill. Lots of great things to watch and listen to.", "verified": true, "helpfulness": "0/0", "author": "Connie Corrigan"}, {"rating": 4.0, "review": "I like it but thought it would have a voice controlled remote. Not that big a deal though. Amazon Prime needs to offer more Showtime programs like Dexter, Shameless, Donavan.", "verified": true, "helpfulness": "1/1", "author": "Greg Gustafson"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Davin Rickson"}, {"rating": 5.0, "review": "My Fire TV Stick works great! We love it!", "verified": true, "helpfulness": "0/0", "author": "DJ"}]