[{"rating": 5.0, "review": "This product more than meets our expectations. It is quick and the remote is easy to use. WE are very, very pleased with our new Fire TV Stick!", "verified": true, "helpfulness": "0/1", "author": "rbmomof4"}, {"rating": 5.0, "review": "Wasn't sure about this, but it has all the apps and works great!", "verified": true, "helpfulness": "0/1", "author": "R. Bazzle"}, {"rating": 5.0, "review": "It's great myself and my family Luv it 👍👍", "verified": true, "helpfulness": "0/1", "author": "EBryant"}, {"rating": 3.0, "review": "I really like the ease of the interface.Set up was easy. After a week or so of regular use I've experienced several instances where the stick stops responding and gets very hot. I have to unplug it for a while before I can use it again. Hopefully a firmware update will be released soon to remedy this. Until then it is alright for the price but performance needs to be better for 4/5 stars.", "verified": true, "helpfulness": "2/2", "author": "Chris Malpass \"robohobo\""}, {"rating": 5.0, "review": "I absolutely love it and plan to get another one", "verified": true, "helpfulness": "0/1", "author": "Marisol F Marquez"}, {"rating": 1.0, "review": "Got it today and it does not work. Spent an hour on the phone with a very nice Amazon tech. No menu came up on my tv screen, did not show on wifi connection. Amazon did not put a return label in the package,,,seems odd. Guess  I'll just throw it away.", "verified": true, "helpfulness": "3/5", "author": "Tom \"curious 1\""}, {"rating": 4.0, "review": "So far so good.The Good: it is responsive, sleek design. Glad they included the HDMI extender - I couldn't use it without it. Manual search function seems fast. I have not tried the voice search via the Android app yet.The Bad: The remote seems a little flimsy. The app selection menus are not multidirectional. You have to start at the very beginning each time. I wish it had more free apps that you could actually test out before handing over your money and then finding out that they don't really work like you thought they would. My other app based devices don't have this issue.Other than that, I am Fired Up.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "According to Amazon customer service, the android app does not work with my ASUS T300.  Amazon's  advertising indicates the app should work.  Considering returning due to false advertising.", "verified": true, "helpfulness": "2/3", "author": "John F. Howes"}, {"rating": 5.0, "review": "Wow, what a great little streaming stick. This item was purchased in a home that already has four PC's, 3 tablets, a Wii U, a PS3, a Roku 3 and a Chromecast stick.The big difference with the Fire TV stick is how fluid and easy it is to setup. If you order from an Amazon Prime account, the Fire TV stick already comes pre-programmed with your Amazon Prime membership info all ready to go.Simply find an outlet, plug the power cable into the Fire TV stick, plug the Fire TV stick into an HDMI port on your display of choice and voila! You are moments away from enjoying all of your Amazon content and Netflix easily within 10 minutes of plugging it in.The interface is very easy to use and the included remote control responds fantastically. It even comes with batteries!Really, you won't find a more elegant, simple solution for watching Amazon content and Netflix, Hulu, etc.", "verified": true, "helpfulness": "0/1", "author": "tiff_tuo"}, {"rating": 5.0, "review": "Love this stick!!! ITS AWSOME!!!!", "verified": true, "helpfulness": "0/2", "author": "Kathy S."}]