[{"rating": 5.0, "review": "I think thefire TV Stick is a excellent product and a good price.  I love using it.For a senior lady I found it very easy to set up.", "verified": true, "helpfulness": "1/1", "author": "Mary H. Joseph"}, {"rating": 5.0, "review": "Love it! I am technically challenged but this was easy to set up and since my iPad died I can watch Netflix and Hulu and movies from Amazon on my tv.", "verified": true, "helpfulness": "1/1", "author": "dmr919"}, {"rating": 4.0, "review": "Enjoying it a lot, it is a great change from TV.", "verified": true, "helpfulness": "0/0", "author": "john  jones"}, {"rating": 2.0, "review": "Remote batteries constantly run down.  I also have a Roku in my house and never have that problem.  Should have gone with another Roku.  They both work well.  The fire stick is going to break me buying batteries.", "verified": true, "helpfulness": "0/0", "author": "shergm"}, {"rating": 4.0, "review": "I have no comment.", "verified": true, "helpfulness": "0/0", "author": "Norbert"}, {"rating": 5.0, "review": "Works very well.  To be honest, it works better than my Samsung smart TV which seems to need a 15 minute update every other day. And a fire stick costs significantly less than the added cost between a dumb and a smart TV.  Portable.  Can be moved from set to set within your house or from house to house.", "verified": true, "helpfulness": "0/0", "author": "Abraham"}, {"rating": 5.0, "review": "Love it. Its the wave of future T.V. watching.", "verified": true, "helpfulness": "0/0", "author": "Luby"}, {"rating": 5.0, "review": "So impressed with this that we ordered 4 more for all the kids tvs. Very easy to set up and use, crystal clear quality and you can't even see it hooked up to your TV. We would highly recommend this anytime.", "verified": true, "helpfulness": "0/0", "author": "Rachael Turner"}, {"rating": 5.0, "review": "This Fire TV Stick is amazing!! Best $40.00 I've spent in awhile. :) It's super fast, easy to use, and the App you can get on your phone to speak the movie/show you are looking for - that rocks! I love everything Fire!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "For $40 this is a great value to get content onto an TV.  I side loaded Kodi and NextPVR to this and added plex to be able to get local content as well.  I do get occasional buffering issues which is hard to blame on the Fire Stick but I do have a nice ASUS AC router.I am docking it a star for having to side load Kodi which is a pain.", "verified": true, "helpfulness": "0/0", "author": "SWKerr"}]