[{"rating": 5.0, "review": "I was not sure I needed another dongle thingy to watch TV with but I like this device. I like that it has a dedicated remote (apps on computers and phones work but not as well as a real remote). It seems to play Amazon video and Netflix without a hitch. It is pretty seamless and took a minute or two to setup. I did not even both with the tutorial. The price they gave it to Prime members (20.00) made it pretty much a no brainer for those of us who crave technology do-dads (is that a real word?).", "verified": true, "helpfulness": "0/0", "author": "Cliff"}, {"rating": 2.0, "review": "I purchased 2 of them when the promotion was on for the price of 19.99 and gave one away as a gift. I did not know it at the time of purchase that Amazon pre-configures each one to automatically log on with my Amazon Prime account. So if my friend decides to give it to someone else then that person plugs it in, all they have to do is scroll down on the menu, select photos and they can see all my personal photos that I have stored in my personal Amazon cloud account. I did not notice any warning during the time of purchase that these devices automatically log on with my account. If you are going to give one away make sure you plug it in first and remove your account log on information before you give it away. Luckily I have sense enough not to store any photos in the cloud that have potential to ruin my reputation. Here is how you remove (or add) your Amazon Prime account from the Fire Stick:  From the Home screen, select Settings, select My Account, and then review the registration information.If no account is currently registered, select Register to register your Amazon Fire TV to the desired Amazon account.If you would like to register a different Amazon account, select the Amazon account that is currently registered, and then select Deregister.", "verified": true, "helpfulness": "1/1", "author": "Amazonian"}, {"rating": 5.0, "review": "The Amazon Fire stick is efficient for the relatively inexpensive cost.  It definitely lacks some features but the price point makes up for them in comparison to the competition.The Good:I found the device to be pretty speedy, occasional lag, but not significantCurrently streaming PLEX, Prime, Netflix, PBS kids, Showtime, and a few other appsMuch easier to use than my homebrew HTPCThe remote is simple and intuitiveThe Cons:No custom menus - this wouldn't be a big deal, except the first 5 options are basically all the same.At $19 it was an absolute steal, at $30 its a good deal. It didn't add a whole of of services (I already had Plex, Prime, and Netflix), but it streamlined them all and made my entertainment center much easier to use.", "verified": true, "helpfulness": "0/0", "author": "D. Lusk \"D\""}, {"rating": 3.0, "review": "It was a good product but it didn't have some programs that I want such as funimation and crunchyroll. It ran fast, I had no problems with it freezing or loading content but it would be a 5 star product for me if it had the programs I wanted.", "verified": false, "helpfulness": "0/0", "author": "Luigi Tassielli"}, {"rating": 5.0, "review": "nice product easy to use and works well so far", "verified": true, "helpfulness": "0/0", "author": "D biker"}, {"rating": 5.0, "review": "WORKS GREAT", "verified": true, "helpfulness": "0/0", "author": "HUTCHINSON"}, {"rating": 5.0, "review": "Love, love love this.  We do not how we did with out it before.  We are catching on series we didn't get see from the beginning or old ones like Star Trek we want to watch all episodes again.  Movies also.  Super easy to use.  I can't say enough about how much easier it is to access what we want to watch.", "verified": true, "helpfulness": "0/0", "author": "Denise R. Mack"}, {"rating": 5.0, "review": "Hands down one of the best things I've bought in awhile. I also got it for $19.99 during that 2 day deal Amazon was offering. I like it as much as my Apple TV. It's way better than my Roku. If you are an Amazon Prime member you get so much free media (movies, music, TV shows). Also, every vinyl or CD I bought through Amazon shows up as a purchased item in my music files. The stick took me literally 2 minutes to plug in a set up.....it was already hooked up to my Prime account. I already told my friends and family to purchase this, I believe it is already back ordered. It is definitely a must have and is worth the $39.99 price tag it now is.", "verified": true, "helpfulness": "0/0", "author": "Slupo"}, {"rating": 3.0, "review": "It does not connect to the internet well.  Slow loading.  Cannot watch videos because not connecting to the internet well.", "verified": true, "helpfulness": "0/0", "author": "carmen 8"}, {"rating": 4.0, "review": "I really like the fire stick.  I love being able to play my prime music through the TV, so I don't have to waste my phone battery, or leave my laptop sitting out inconveniently.  I am still getting to  know all the features, but am enjoying it a lot so far.  I just need another fire device, so I can swipe from the tablet to the tv to watch some streaming shows, since I don't have hulu plus.", "verified": true, "helpfulness": "0/0", "author": "Valerie Schrott"}]