[{"rating": 1.0, "review": "Looses connectivity to intermet. Running Netflix takes time buffering a lot.", "verified": true, "helpfulness": "2/6", "author": "Bryan J Dauphinais"}, {"rating": 5.0, "review": "100x better than chromecast. Super fast. Perfect for college! Works on non-broadcast enabled networks(unlike chromecast)", "verified": true, "helpfulness": "2/2", "author": "Chris H."}, {"rating": 5.0, "review": "I like this a lot, even with all the doffere t media players I have tried.The only but is the betflix app seem to be so slow that some key presses took to long and had to wait a minute or two to cathcup.Video quality is good.Definately worth the investment", "verified": true, "helpfulness": "0/1", "author": "Eben Esterhuyse"}, {"rating": 4.0, "review": "What I expected. This is just another vehicle for Amazon to sell you stuff. This for me was the cheapest way to stream my prime movies that was missing.", "verified": true, "helpfulness": "0/0", "author": "MIkeM137"}, {"rating": 1.0, "review": "I've pretty much early adopted everything from Amazon. Pushed my friends to buy their products on Facebook, and bought multiple kindles, etc. I'd imagine that I'm a pretty ideal customer (order weekly digitally and hard goods). Imagine my dismay when I find 433 reviews and this very product available at my local Best Buy. And yet, I'm still at the back of the line for December??? Oh well, my friend's is inferior to the Roku Stick anyway. Roku, Netflix, and Google play here I come! Along with my 1K + Facebook friends....", "verified": true, "helpfulness": "3/10", "author": "Brooklyn Myke"}, {"rating": 5.0, "review": "It's very easy to set up, and even easier to use!  After only a few days, it's already beginning to change the way my family and I consume our entertainment media.", "verified": true, "helpfulness": "1/1", "author": "Joseph Mevorah"}, {"rating": 2.0, "review": "So I ordered 2 Amazon Fire Sticks on day one. After a lot of anticipation I finally got them yesterday. And the short of it is they are both for sale on eBay today.I liked the idea of these devices but there were a few shortcomings that Roku does better (and is my deciding factor). Going in I knew that HBO GO was not yet available on the Fire platform, I can live with that. What I didn't know is that DirectTV was not a \"provider\" for Showtime Anytime on Fire TV. After figuring this out I didn't even bother seeing how the Hulu or Netflix apps performed. I will stick with Roku for now.", "verified": true, "helpfulness": "1/5", "author": "John E. Williams"}, {"rating": 3.0, "review": "I like the physical device, but there is no HBOGo app, which it needs to compete with roku.  Also the button sensitivity on the included remote is way too high.  Pressing the directional once goes 3-6 clicks away for some reason.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Update -12/12/14The device has frozen on a number of occasions, all media inaccessible.  The fix seems to be remove from HDMI port, discon next from power for five minutes or so, then reconnect. Going back to Roku.Design on remote not well executed.  Battery hatch cannot be opened without a knife or screwdriver, though supposed to be finger slid.Content no better than Roku but certainly better than Chromecast.Interface is well thought out and works well.  I strongly recommend downloading the Android app (iOS app has not been released as of the date of this review) it works well and is fear easier to enter text using the keyboard on your phone or tablet.Good deal for $40 - great deal for the $20 I prepaid.Recommended", "verified": true, "helpfulness": "1/4", "author": "Allen \"Allen\""}, {"rating": 5.0, "review": "Great streaming device, especially with Amazon Prime membership...", "verified": true, "helpfulness": "1/1", "author": "Ralph"}]