[{"rating": 5.0, "review": "I love this.  It is so easy to use.  I had purchased another item like this and could never get it to work.  I plugged in my fire stick and it took me right to a instruction screen on my TV and setting everything up was a breeze.  I would recommend this to others for sure.", "verified": true, "helpfulness": "1/1", "author": "Janet Shute"}, {"rating": 5.0, "review": "Great device for enjoying television. Love it.", "verified": true, "helpfulness": "0/0", "author": "Ron McAllister"}, {"rating": 4.0, "review": "I love being able to use Prime Video and Netflix through the Fire Stick. The interface is great and easy to use.The only problem I am having (which I haven't check to see if there is a fix yet) is that it sometimes drops the network connection in the middle of streaming and needs to be reset. It's really annoying.", "verified": true, "helpfulness": "0/0", "author": "Pirate Pete"}, {"rating": 1.0, "review": "Piece of S*** all it does is BUFFER", "verified": true, "helpfulness": "0/0", "author": "dan erikson"}, {"rating": 5.0, "review": "This is my second one. Now I leave one attached to the \"big screen\" and use the other one for travel and guest tv.", "verified": true, "helpfulness": "0/0", "author": "John E. Semelsberger"}, {"rating": 5.0, "review": "My whole family is enjoying the Fire TV Stick. It's really awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Cutina Watts"}, {"rating": 4.0, "review": "You have to ensure a strong WiFi signal for it to work properly.", "verified": true, "helpfulness": "0/0", "author": "MichMich"}, {"rating": 5.0, "review": "Amazed at how clear this is on my 60 inch television.", "verified": true, "helpfulness": "0/0", "author": "Marie Rapino"}, {"rating": 3.0, "review": "Definitely a much better price than a game system or computer.  But it has issues with wifi diconecting", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 3.0, "review": "It has a tough time picking up my wifi sometimes. I had intended to switch it between my grandkids' bedrooms but it was easier to buy one for each than to try to get it to recognize wifi every time I moved it. I also have the box version and it works perfectly every time no matter where I hook it up. The wifi reception on the Stick is much weaker and less reliable than the box.", "verified": true, "helpfulness": "0/0", "author": "LaDeeDa"}]