[{"rating": 5.0, "review": "Cool", "verified": true, "helpfulness": "0/1", "author": "danybeers"}, {"rating": 5.0, "review": "We really love getting Netflix, Amazon Prime and the others on just one thing. It was easy to set up and cheaper than buying a blue player too.  First it was hard to figure out the remote no arrows for up and down or side to side. But I finally did I think they should put arrows on the remotes.....", "verified": true, "helpfulness": "1/1", "author": "Linda Smith"}, {"rating": 5.0, "review": "Its great!", "verified": true, "helpfulness": "0/1", "author": "cindy hufstedler"}, {"rating": 4.0, "review": "I, too, was able to get the fire stick during the $19 sale. For the price, why not.I like it better than the Chromecast, but it is getting serious competition from my Roku Stick.Like:  Content and access to my Prime account (Kindle user takes a pick and I put it on the TV for a slide show)Dislike:  User interface is lacking, but the biggest hiccup is the remote.  Mine has a tendency to \"run away\" from me when in use.  Here's what I mean:  I click the right side of the 'circle' to go to the next movie in the list.  Click again (next movie), then again, and again, and then all the sudden I see a whole list of movies flying by.  I'm not holding the button down.  There does not seem to be a rhyme or reason for how far it goes or when it starts/stops.  To bypass this I just download the app and use my smartphone.  The remote has been in the closet for a month or so now and I don't miss it (of note, i have the same issue with my Roku Stick remote.  It may have to do with the location of the devices (closet around the corner from the TV).All in all:  A solid 4 stars.  I think the user interface could use a few updates, more apps, and a better remote, but for the money and content, it's a good device, esp if you're an Amazon Prime member.", "verified": true, "helpfulness": "2/2", "author": "JT"}, {"rating": 2.0, "review": "Set up is easy and when it works it has lots to offer...the key being when it works.My Amazon fire stick freezes up each and every time that I attempt to watch something with it.  I'm better off watching in my laptop or my iPad or wth my Apple TV.", "verified": true, "helpfulness": "1/1", "author": "J27712"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "thomas"}, {"rating": 2.0, "review": "Not pleased with the fire stick was not aware u pay for everything u want to watch.", "verified": true, "helpfulness": "0/3", "author": "tasha person"}, {"rating": 5.0, "review": "Love the ui, user experience, and performance", "verified": false, "helpfulness": "1/1", "author": "Seema"}, {"rating": 4.0, "review": "Exceeded expectations!", "verified": true, "helpfulness": "0/1", "author": "justinn warmsley"}]