[{"rating": 5.0, "review": "Its Great.", "verified": true, "helpfulness": "0/0", "author": "Jim Hodge"}, {"rating": 3.0, "review": "Not as clear as my Apple TV.  But the price was right and I will use it!  Better than streaming off my iPad to my TV.", "verified": true, "helpfulness": "0/0", "author": "Gregory Hazard"}, {"rating": 5.0, "review": "Ordered a Google Chromecast.  It was terrible.  Constantly picked up the neighbors wifi and refused to drop even after removing the wifi from its list.  Never worked right.  This is perfect.  Easy to set up.  Don't buy Chromecast.  I am a Google fan but the Chromecast was horrible.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "We love the Fire TV Stick. Plugged it in and immediately enjoyed Netflix, Hulu, as well as free games and TV shows with Prime. It looks great, couldn't be easier to use.", "verified": true, "helpfulness": "0/0", "author": "Bop the boopster"}, {"rating": 1.0, "review": "I guess mine must be defective.  At least, I hope that is the problem.  I installed the stick and power cable, it paired with the remote, and then it was \"scanning for networks\" before stopping on a screen showing \"Connect to your network\", but no networks.  Not my network, not my guest network, and not any of 3-5 neighbor networks all of the other wifi devices in my house see.  No option to cancel and move on.  Reboot the unit and it follows the same process, hanging on a screen that doesn't show the router 7 feet from the tv.  Not happy with my purchase.  Time for a return.", "verified": false, "helpfulness": "1/1", "author": "JR"}, {"rating": 4.0, "review": "Would have given it 5 stars but had one issue with a blue screen error screen saying \"\"HDCP unauthorized....\" when streaming netfilx, which I Googled and got a quick fix for. Otherwise, love this item 100% and have given others a recommendation to buy.", "verified": true, "helpfulness": "0/0", "author": "Martin Mulcahey"}, {"rating": 5.0, "review": "Awesome! Side load capability makes this one of the best deals around.", "verified": true, "helpfulness": "0/0", "author": "DON ARCANGEL"}, {"rating": 2.0, "review": "I am happy that i got smart and using it. Excellent product. Thanks!!!", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 4.0, "review": "Great Product. Works just as advertised. Easy to use with Kindle Fire App. Could use a better search though, No way to refine a search. Makes \"Prime\" much easier to use.", "verified": true, "helpfulness": "0/0", "author": "Michael Miller"}, {"rating": 4.0, "review": "works great.  set up only took a couple of min.", "verified": true, "helpfulness": "0/0", "author": "Rick Brenchley"}]