[{"rating": 5.0, "review": "The Firestick is easy and quick to install. I ordered another one for my granddaughter and I'm thinking of getting more. If you have Netflix and/or Amazon Prime this is an excellent purchase!!", "verified": true, "helpfulness": "0/0", "author": "Lynn"}, {"rating": 5.0, "review": "Impressed : did not synch at first. Synched on 2nd set . And then worked on main sharp tv.Chromecast did not work on 2 tv'S. Sound off and picture poor.Only worked on tv where modem and router located. Fire stick much better. And remote a huge plus.", "verified": true, "helpfulness": "0/0", "author": "bob schechter"}, {"rating": 1.0, "review": "It stopped working after a couple of months. No matter where I plugged it in the device it would not function.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great going to get another one", "verified": true, "helpfulness": "0/0", "author": "Kenneth Chupella"}, {"rating": 5.0, "review": "Simply Awesome!", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 4.0, "review": "I like the feature where if you were to play music in a music app, it will still play while you browse another app or other options of the stick. However multiple apps may not support music play over. Roku doesn't have this sweet feature.The stick does lack channels and possible features if comparable to the Roku Stick, but that may not be much of a turn down. Major items such as hulu and Netflix are available. No worries there. If you're looking to watch/view items from your DLNA or media server, there is a free option (plex), but I would prefer buying the $2 ViMu app. It plainly performs better and  has less hassle.As I've seen from other reviews, the stick burns out. I'll see if I encounter the problem. As of now, its great.", "verified": true, "helpfulness": "0/0", "author": "Malachi Aguirre"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Ricardo"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Travis Stith"}, {"rating": 5.0, "review": "Love the Amazon stick...works well with my television...I can watch hulu, netflix, and Amazon tv without problems...for $30 you get a lot for your money...I definitely recommend...", "verified": true, "helpfulness": "0/0", "author": "nitabk1"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "kenneth velasco"}]