[{"rating": 4.0, "review": "I have been trying to fine a easy way to get netflix and youtube in my bedroom.  This is a slick, easy to use way that beats getting a smart blu ray player.  it's easy to use and navigate and  even the simple remote is nice. it responds quickly unlike older apple tv, where the movement on the cursor when using the remote is slow.  For the price you can't beat it. It's to bad that HDMI isn't like USB where it could power a device that would definately give 5 stars.  great packaging and presentation.  Set up is idiot proof.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "Works as advertised. Snap to install. Menu is simple and clean. More importantly, it streams perfectly - assuming you have decent bandwidth.", "verified": true, "helpfulness": "0/0", "author": "JPro"}, {"rating": 5.0, "review": "Really easy to set up and operate. I bought it for it's 2.5G or 5G capability. I'm running it at 5G and my microwave oven does not bother it one bit.", "verified": true, "helpfulness": "0/0", "author": "Keepwell"}, {"rating": 5.0, "review": "We've had the Amazon Fire TV Stick for about 2 months now. So easy to get set up. It took maybe 10 minutes tops. It walks you through the process. We use it for SlingTV, Netflix and games apps. We have only had one issue and that was that recently it was not picking up the wifi signal.  All our other devices were working properly so we unplugged the Fire Stick for 30 seconds, pugged it back in and problem solved. We love it!", "verified": true, "helpfulness": "0/0", "author": "Seth's mom"}, {"rating": 5.0, "review": "Works great , easy to connect and use ......... I thought there would be more free items available , but overall pleased .", "verified": true, "helpfulness": "0/0", "author": "Foxman"}, {"rating": 5.0, "review": "Very happy with the fire stick!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Loving This !!", "verified": true, "helpfulness": "0/0", "author": "Del'Jean54"}, {"rating": 5.0, "review": "I picked up the fire stick because it was $39. Figured we really couldn't lose. Or return it if it didn't work. We have a complicated home network set up – and use Apple TV with our family room smart TV.  Picked up the fire stick for an HDTV in a bedroom that doesn't have Apple TV.  I was able to set this up in no time, including downloading and activating apps HBOGO, etc.,  not to mention accessing all the stuff from our Amazon prime account. Sweet.  So often promises of \"easy installation\" are patently false. Not so with the Fire Stick,  which is why I took the time to write this review.", "verified": true, "helpfulness": "0/0", "author": "jill"}, {"rating": 5.0, "review": "Does a great job with a very nice price.", "verified": true, "helpfulness": "0/0", "author": "Silvia"}, {"rating": 5.0, "review": "This works great! I don't even miss cable TV.", "verified": true, "helpfulness": "0/0", "author": "Patrick Willis"}]