[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Melanie Martin"}, {"rating": 5.0, "review": "easy hook up. nice that it comes with remote versus other similar products.", "verified": true, "helpfulness": "0/0", "author": "Johnathan Carr"}, {"rating": 5.0, "review": "excellent simply and fast", "verified": true, "helpfulness": "0/0", "author": "Jeromezz \"jeromezz\""}, {"rating": 4.0, "review": "I adore this. Simple to use, but it works wonderfully. The only thing I would suggest changing is making it easier to find the Apps that let you watch through the internet from things besides Amazon. I would love to be able to access international news channels, for instance. But honestly, I will never need cable again.", "verified": true, "helpfulness": "0/0", "author": "Amazon on the Road"}, {"rating": 5.0, "review": "Awesome tool. In my opinion, just as good as Apple TV (I have that also). Fire TV Stick doesn't come with as many APS as Apple TV, however many of the APS on Apple TV, you will never use (just like cable channels). For the cost, Fire TV can't be beat. Bought one for my sister.", "verified": true, "helpfulness": "0/0", "author": "BigDaddy"}, {"rating": 4.0, "review": "a pain the butt to get down loaded, not very clear in the information about the accounts , but it works very well after it is installed", "verified": true, "helpfulness": "0/0", "author": "britta iversen"}, {"rating": 3.0, "review": "Would be 4 or 5 stars if Miracast worked for Windows 8.1 correctly. Video playback and forecast from my fire phone works great.", "verified": true, "helpfulness": "0/0", "author": "Albert Martinez"}, {"rating": 5.0, "review": "Wonderful, if your getting network errors, us the power adapter! Great buy.", "verified": true, "helpfulness": "0/0", "author": "Ya Vue"}, {"rating": 4.0, "review": "I think it pretty great.  Lots of variety.  Wish that old TV series and movies that are not current were free but overall great value for the money.", "verified": true, "helpfulness": "0/0", "author": "Angelique Shirley"}, {"rating": 5.0, "review": "very pleased with the purchase, excellent product.", "verified": true, "helpfulness": "0/0", "author": "jalberto"}]