[{"rating": 3.0, "review": "So cheap, its faults are easily looked over.  Basically works well, but doesn't stack up well compared to Apple TV: - UI is generally clunky, hard to really browse content by themes etc. - Video quality at times choppy/blurry on content that works well on Apple TV - I've already accidentally purchased content where Season X was free w/ Prime but Season Y was not", "verified": true, "helpfulness": "1/1", "author": "Nick"}, {"rating": 1.0, "review": "No longer working with netflix at all.  When it was working, it kept playing shows after the tv was turned off (while chromecast does).  Also unlike chromecast, it requires too much power to use tv usb port and you must connect to dedicated ac adapter (likely why it doesnt turn off when tv does). Dont recommend.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Better Than Roku!!!", "verified": true, "helpfulness": "0/1", "author": "Dawn Wade"}, {"rating": 4.0, "review": "Was a little disappointed that it requires an external power source but should have know. Overall, setup was easy and it is pretty responsive and user friendly. No probs streaming any content. Remote has a great feel.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Bain \"the same decaying organic matter as everything else\""}, {"rating": 5.0, "review": "I really love this, I am so happy that I got this and on the prime members 2 day deal! Now I can play netflix all day without using much electricity. I have 2 Fire tv sticks and an Amazon Fire, I love all 3!!!!", "verified": true, "helpfulness": "0/0", "author": "Danielle"}, {"rating": 5.0, "review": "Easier to use and more stable than Chromecast.  Had been using Chomecast for past year and bugged by frequent dropped connections, problems pausing, etc.  Wondered if Fire TV Stick would be any better and answer is YES.  The small remote is easy to navigate and the commands work.  As so user-friendly, using it much more not just for NetFlix but many other apps too.  And as a Prime Member enjoy the extras.  Great buy for $39!", "verified": true, "helpfulness": "0/0", "author": "Rosehopp"}, {"rating": 5.0, "review": "This is awesome!!", "verified": true, "helpfulness": "0/0", "author": "A. Campbell"}, {"rating": 5.0, "review": "Absolutely love this thing!", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 3.0, "review": "-Wish it played nice with my Synology drive to access all of my internal cloud photos and videos :(  Why Amazon who sells a TON of Synology product would've overlooked this I am not sure...boo - work it out please!-Not too many applications (apps) that you'll likely want here either.  Slower to get to that your phone so that makes a lot of them not so fun.-Do love the lyrics on the songs from my Amazon Prime Music though and Netflix is smooth and effective as is Prime Video.", "verified": true, "helpfulness": "0/0", "author": "B. Mann \"yup\""}, {"rating": 2.0, "review": "I am writing this review from my phone, so I apologize for any typos.I have had not much luck with this so far.After setting it up, it seemed to work okay for the first couple of uses. Then I started using it more to watch showtime, Netflix, and Prime TV. Showtime crashes every time and doesn't play anything.  I have tried uninstalling and evening resetting the stick to factory settings... Nothing. When I watch prime TV, the video and sound will flicker off and on multiple times an episode. Overall it has just been a very frustrating experience. As a big Amazon supporter, I am really upset with the quality of this product so far. I really hope something changes.", "verified": true, "helpfulness": "0/0", "author": "Leah Bromley"}]