[{"rating": 4.0, "review": "Very good product.. A great addition to my prime membership..much easier to watch on my large tv rather than my i pad..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Many of the movies I have rented wont play or it says \"your internet connection is too slow.\"  I have the fastest internet my cable company allows.  I love the fact I can watch free movies when it works, but some of those movies you also have to pay for, that is the downside to it.  I love amazon but I wish the stick worked better", "verified": true, "helpfulness": "0/0", "author": "Kelly L Makuen"}, {"rating": 5.0, "review": "Exceeded my expectations. Easy to use and simple to set up. Will be buying two or three more of them!", "verified": true, "helpfulness": "0/0", "author": "Sylvia Rutledge"}, {"rating": 4.0, "review": "Traditional cable is so irrelevant! The picture quality and content availability is amazing! No need for DVR or TIVO either.", "verified": true, "helpfulness": "1/1", "author": "Tony"}, {"rating": 5.0, "review": "Love it. So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Cathy Civensky"}, {"rating": 4.0, "review": "I wish all electronic devices were as simple and efficient. Netflix lives up to it's reputation.as does the stick", "verified": true, "helpfulness": "0/0", "author": "JohnJ"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "feliz"}, {"rating": 3.0, "review": "Loses sync with wifi far too often, if your wifi is not super strong signal. Buy the tabletop model if you have access to a LAN cable to avoid this disappointing performance.", "verified": true, "helpfulness": "1/1", "author": "Lagarto"}, {"rating": 2.0, "review": "Picture quality was not clear.", "verified": true, "helpfulness": "0/0", "author": "Carlos Temprano"}, {"rating": 4.0, "review": "Works slower with very high speed internet.  Have the new blast package from Comcast and some days net flics runs Alittle slow.  Over all very happy with product.  Super easy set up.", "verified": true, "helpfulness": "0/0", "author": "Frank McGill"}]