[{"rating": 5.0, "review": "this was so easy to use - and it came preloaded with my amazon prime information installed ready to go. highly recommend", "verified": true, "helpfulness": "0/0", "author": "ctorino"}, {"rating": 5.0, "review": "This is awesome! I'm able to stream netflix and my home plex server", "verified": true, "helpfulness": "0/0", "author": "Stuart A Hertzig"}, {"rating": 5.0, "review": "Love it!!!", "verified": false, "helpfulness": "0/0", "author": "M.Ziggy \"zigzag\""}, {"rating": 4.0, "review": "I was a little disappointed that it would not run off the USB power from the television I had to use the 110 volt adapter, it also seems to use more Wi-Fi than my chrome cast did, my chrome cast never use to stop for buffering and the fire stick does. All in all it works and is pretty versatile.", "verified": true, "helpfulness": "0/0", "author": "Warren D Breedlove"}, {"rating": 5.0, "review": "If you're using Amazon Prime and have an HDMI TV I would get this!", "verified": true, "helpfulness": "0/0", "author": "Richard L. West Jr. \"Richard L West\""}, {"rating": 5.0, "review": "It's great.  I'm getting a flat screen TV for the bedroom next week and will be getting one for it too!", "verified": true, "helpfulness": "0/0", "author": "Patti Smith"}, {"rating": 3.0, "review": "Well I had a very bad initial experience because it could not hold a internet connection. My router is in my office and the stick kept loosing connection. I mean constantly. I Do want to note that Crome cast and my smart tv have had to problem connecting and streaming. Also when connecting it said my connection was \"very good\", obviously not. Read a few other reviews and saw similar issues. So... ***NOTE*** only get this if your router is in the same room as your tv*****I ended up buying a wifi extender and now it seems to be working but still not quite as seamless as other devices. I got this so I can try out sling and so far it is working pretty good streaming live TV. If I could go back would probably go Roku stick to avoid having to buy a wifi extender.", "verified": true, "helpfulness": "0/0", "author": "ben sparling"}, {"rating": 3.0, "review": "it's okey...", "verified": true, "helpfulness": "0/0", "author": "Sebastian P."}, {"rating": 5.0, "review": "We also have an apple TV and the Fire stick is much faster! Love the prime video interface. Just wish that the Netflix app had the same user interface as the Apple TV Netflix App.", "verified": true, "helpfulness": "1/1", "author": "Benjamin O."}, {"rating": 5.0, "review": "Love this product.  Easy to set up and use.  Has tutorial to show you how to use remote and what's available.  Definitely would recommend.", "verified": true, "helpfulness": "0/0", "author": "Kim"}]