[{"rating": 5.0, "review": "I love this.", "verified": true, "helpfulness": "0/0", "author": "Melissa Hopson"}, {"rating": 5.0, "review": "This was a gift from my daughter. It's easy to set up . Works just lime the fire box. Now I have one of each for two televisions. Thanks", "verified": true, "helpfulness": "0/0", "author": "gloria Vermef"}, {"rating": 5.0, "review": "Easy to use, easy to install.....have one now for every TV.", "verified": true, "helpfulness": "0/0", "author": "TOKA BALL"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Laura Blastick"}, {"rating": 5.0, "review": "It's an awesome product.", "verified": true, "helpfulness": "0/0", "author": "Rajkumar"}, {"rating": 2.0, "review": "I wish I was able to say that I have been able to try out my fire stick but I haven't been able to connect to the wifi. When I called customer service the customer rep suggested unplugging and replugging the stick, which I did. When that didn't work he said I needed to have my tv and stick 2 feet from the router to trouble shoot. (Wait I have to carry my tv down a flight of stairs to fix connectivity issues, when my high speed internet is working fine with my cellphone, kindle and laptop??) I asked if there was any other way to fix this he said that that was the only way to see...So I asked how I could return it if there's no other way and he was quick to give me the instructions rather than solve the issue. I'm disappointed mostly because I was excited for this device because I use Netflix, Amazon prime and Hulu plus. But, I'll just have to switch back to the roku", "verified": true, "helpfulness": "0/2", "author": "maireadg"}, {"rating": 4.0, "review": "Regarding fire tv stick:It was great & flowless for the 1st few days then had few glitches.  Now it's working well again.  I haven't had it too long to give much details.As far as prime tv, I love it!", "verified": true, "helpfulness": "0/0", "author": "AG"}, {"rating": 5.0, "review": "It is very easy to connect.  I like it a lot just wish they had more current movies.", "verified": true, "helpfulness": "0/0", "author": "Rhonda"}, {"rating": 5.0, "review": "Very satisfied!  Highly recommend 😃", "verified": true, "helpfulness": "0/0", "author": "Kent Fan"}, {"rating": 5.0, "review": "Amazon hit the nail on the head this awesome streaming device!", "verified": true, "helpfulness": "0/0", "author": "Gabriel L."}]