[{"rating": 5.0, "review": "Amazing.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 1.0, "review": "returneed", "verified": true, "helpfulness": "0/0", "author": "Jimmy Merchant"}, {"rating": 5.0, "review": "Very low cost way for me to watch all my amazon content on my tv and not just my kindle. Make sure you set a password if you have kids", "verified": true, "helpfulness": "0/0", "author": "Roy Brown"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "R & M Baker"}, {"rating": 5.0, "review": "I received my Fire TV Stick yesterday 12/13/14. It took around 10 minutes to connect; easy and quick. I wish I would've purchased more at the $19.99 deal for Prime members. Picture quality seems better when I watch Netflix and Prime movies. Thank you Amazon for the Fire TV Stick..", "verified": true, "helpfulness": "0/0", "author": "Demetrius Watson"}, {"rating": 1.0, "review": "Keeps freezing up! Says it's connected with problem. Then I unplug it and plug it back it it works again! I've had to do that twice and Ive had it less than a week! On the plus side, set up was a breeze and works like a charm when it works...lol", "verified": true, "helpfulness": "1/2", "author": "Yvonne"}, {"rating": 5.0, "review": "Highly recommend,excellent device", "verified": true, "helpfulness": "0/0", "author": "RYDELL"}, {"rating": 4.0, "review": "Love the form factor and user interface. The remote is simple and intuitive to use. It has all the typical apps except vudu, which is where my movie collection is located. However, for the price it's the cheapest media player you can find.", "verified": true, "helpfulness": "1/1", "author": "C. Tucker"}, {"rating": 2.0, "review": "keeps telling me 'No Internet Connection\"  I check settings  and the signal strength is \"Very Good\"  but my movies or music still won't load.Not happy with the product.  I have 2 Roku's and they perform very well.  Hope Amazon's upgrades fix the problems.", "verified": true, "helpfulness": "0/0", "author": "LoveToShop"}, {"rating": 1.0, "review": "Does not support Minecraft. No way to lock R rated movie content in parent controls. Very disappointed. Returning the stick.", "verified": true, "helpfulness": "0/1", "author": "Disappointed"}]