[{"rating": 5.0, "review": "Fantastic device with just a few minor tweaks needed.Pros - Ridiculously easy to setup. Has all the major features and apps that you're looking for and literally easy enough for a four year old to use. Seriously my four year old uses it to watch Amazon and Netflix content.Cons - Says that it much be plugged in using the power adapter it came with and I don't think it will power via USB from the TV. That said I don't know how to turn it off or if it turns off automatically when the TV is off or on a different Input, or more likely it just stays on. I don't know.The remote could use some polish. In a dark room you cannot see the button and there is no texture to them so you have to know what they are. Either a simple lighting or relief on the buttons would fix this. A power button would be nice. Oh, and it's small so a way to locate it would be great too.The cons are really just polish things that I'm sure will be improved in future release.", "verified": true, "helpfulness": "0/0", "author": "K. Hollingsworth"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is more than I expected. I can watch movies and listen to music. That frees my computer and kindle up to do other things. I love it and I still can't believe the price. It is well worth it and some!", "verified": true, "helpfulness": "0/0", "author": "Gale Krouser"}, {"rating": 3.0, "review": "Remote quit working after 2 weeks of use. Couldn't find a number to contact for a replacement remote.", "verified": true, "helpfulness": "1/1", "author": "Casey Tate"}, {"rating": 5.0, "review": "Great little streamer. This works perfectly and easily. I have not used any other similar devices so nothing to compare it to but it just works. Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Annie K\""}, {"rating": 1.0, "review": "Worked for one session of movie viewing. Now it just won't connect to my access point. It isn't the AP, all the other devices I have stick to it like glue - Sony, iPad, iPod, Dell, Kindle, Galaxy. Can't comment on the interface, haven't spent enough time on it, obviously.", "verified": true, "helpfulness": "2/2", "author": "arvivaz"}, {"rating": 2.0, "review": "It's ok, but not that impressed.  It has a far way to go.  Navigation is not as easy as the Roku.  Somewhat confusing.  Aren't many GOOD apps. There are a lot they just decided to throw in there. I like qvc and hsn. No shopping, if I did not still have my Roku connected. Also Cruise Addicts for cruising was a very good and informative app. Please try to bring in better apps.", "verified": true, "helpfulness": "1/1", "author": "Brownsugarpanama \"truth alert\""}, {"rating": 3.0, "review": "The directions assume that purchaser has late model tv.  I had to call manufacturer.  Wouæd have been easy add info about set up with older tvs.  Set up was easy after that.  I only use with Netflix so far.", "verified": true, "helpfulness": "0/0", "author": "dc"}, {"rating": 5.0, "review": "There's a lot of potential here with this stick if you think outside the box. The fact that you can sideload apps ( use the adbfire app ) opens this up to lots of possibilities. A mini bluetooth keyboard with touchpad along with the apk app settings.apk can let the stick do things that most people aren't aware of which is to install sideloaded apk versions and opens up the door to a lot more content. So far, outside of what's installed, I've got HBOgo sideloaded ( officially available in the spring ) along with Starz and Encore. All work great and can be controlled with the bluetooth keyboard and touchpad. Tried to do the same thing with Epix, but it runs a bit choppy on the stick. Probably the quad processor on the Fire TV, big brother to the stick, would have a smoother play rate with Epix.XBMC now known as Kodi is also a must have for the stick. With it's countless plugins, it's an entertainment powerhouse on its own. I've got my entire music collection using a plugin for google music running on it. Another sideloaded app I'd recommend is BS player. I use this with my 1tb seagate wireless drive and it can play all the movie codecs required ( avi, xvid, mkv, mp4....etc ) Haven't found a movie yet that this doesn't play using the stick and the seagate. It's great for when you're on the go without wifi access. Just access your wireless hard drive full of movies with B.S player and you're good to go.Es Explorer sideloaded will also come in handy for file management. I recommend installing that. This becomes useful when used with other sideloaded apps. For example you can install a browser which means signing into a hotel wifi which requires a certain procedure and that's now within reach because of the browser and bluetooth keyboard. This opens the door to downloading files which can be viewed in es explorer. You can also install flash on the browser if required with the flash apk file. I prefer dolphin browser to firefox, but you need to do a few things to stop it from crashing. Turn off the jet pack option under settings and don't use full screen. It's not the most elegant way to browse, because the onscreen keyboard can popup causing it to be more trouble than its worth, but you can't root the stick, so apps like null keyboard won't work as when you try to change it to turn off the onscreen keyboard going through settings.apk, it'll just crash. Still, you've got a browser and with that browser opens up other doors, like installing a torrent app to use with the browser. I recommend aTorrent pro which can be used with a proxy. I've got 3.5 gb's of available space so why not use it.Another great feature of the stick is the ability to run a DNS proxy. For expats from the U.K, this can be invaluable. With a proxy region free activated, sideloaded apps like the itv player, bbc iplayer and tvcatchup can run on the stick and regional stream plugins within XBMC or KODI will also function.I also use the slingplayer app, but it seems slingbox only supports the 350, 500 and M1 boxes. That's fine for my 350, but for those with a legacy slingbox....solo, pro-HD, we're left out in the cold. I found out that my slingplayer for android tablet purchase ( Nexus 7 ) apk file can be installed on the stick and with the bluetooth keyboard and touchpad, I can use the stick to remote view my slingbox with speeds that rival my windows 7 laptop, so I've got two different slingplayer versions on my stick; one for my solo using the mini keyboard and touchpad and one for my slingbox 350, which runs off the official slingplayer app on the stick. F.Y.I If you want basic touchpad use with the stick, you can always install the wukong remote app. This allows any android device to control the touchpad requirements on the stick, but you have to be on the same wifi network. That can be a problem in a hotel situation when connecting to their wifi, thus the bluetooth keyboard. I'd recommend the QQ-tech mini bluetooth keyboard. It pairs well with the stick and works great with sideloaded apps. Only thing it doesn't do well is navigate all that great in a browsing situation, when scrolling, as the arrow keys are the only way to go up and down on a webpage and they're small. A scrolling wheel or button would have been more useful, but overall, it's usable for my needs since all my dolphin bookmarks have been synced over. Remember to switch between function w and function e for some sideloaded apps when using this keyboard. Function w held down on the keyboard changes it to a windows format. This allows the menu button on the keyboard to access some features on a sideloaded app that aren't available when the keyboard is in function e ( android ) mode. You'd find this out with sideloaded apps like iplayer where you need to do this to access live channels.As I've said, the fire tv stick can do a lot of things that people aren't aware of and I'm sure others have found various ways to make it even more useful, but Amazon has a winner here and if a stick of gum sized device can do all this and more for the $20 I paid for it, then it's 5 stars all the way from me.P.S It also does an excellent job at mirror casting when used with my Nexus 7 (2013) version running lollipop. This sends an exact copy from the Nexus 7 to my big screen TV. Tested this for a while with various apps and it's been pretty stable.", "verified": false, "helpfulness": "1/1", "author": "Callanish"}, {"rating": 5.0, "review": "I didn't receive the Prime Member perk to buy this for $19. It always seems to be on back order. I was looking at TVs at Best Buy and noticed there was 2 left. I decided to buy because I could watch Amazon video along with Hulu Plus, Netflix, etc. There's lots of apps and games available. I've had the opportunity to watch lots of movies and shows. There's more apps to watch shows, listen to music, watch sports and movies than on Google Chromcast which I purchased when it was released. If you're considering buying this product, go ahead and do it. You won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Hawkstv"}, {"rating": 5.0, "review": "My husband couldn't wait to order this.  My only complaint is that I thought it would plug into a USB port, but it is really plugged into our TV on an HDMI port.  So that takes up one more of our ports.  Other than that, it's nice to have everything 1 click away.", "verified": true, "helpfulness": "0/0", "author": "Jamie Taylor"}]