[{"rating": 5.0, "review": "I like the speed and user-friendliness, and the ablilty to still get my NetFlix, Hulu and Amazon stuff....Great device...I have them throughout my home", "verified": true, "helpfulness": "0/0", "author": "Penny Landry"}, {"rating": 4.0, "review": "Better product the Chromecadt", "verified": true, "helpfulness": "0/0", "author": "Robert Rotticci"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Irene C."}, {"rating": 5.0, "review": "works great I can watch Netflix now.", "verified": true, "helpfulness": "0/0", "author": "Mort"}, {"rating": 3.0, "review": "Be cautious before buying this fire stick over a Roku! We got the fire stick tv for only $19 so I thought it was a no brainer but my Wife warned me. we have had our roku for a few years and just love it (mostly just for netfix) we got it in the mail hooked it up and it worked great but then it kept stoping and reloading every 2-10 minutes which drove us nuts. I wanted to throw it out the window. my 8 years old son didn't want me to get rid of it because of the free games he can play using even the regular remote. I ended up getting smart and switching locations where the roku and fire tv were located. turns out that fixed the issue. my point is the roku still works a far distance from our router and the fire tv does not. for $19 in the end its a great deal but usually the price is the same. if its the same as a roku for you, buy the roku!! also, listen to your wife! Thanks..", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Fantastic device.  Extremely easy to use. I also found that the preloaded apps on the firestick (Hulu, Netflix, etc) worked better than the same apps one web tv.", "verified": true, "helpfulness": "0/0", "author": "In the Day you See"}, {"rating": 5.0, "review": "Awesome as long as you have Prime.  Only thing I wish you could do is sort by the movie rating...PG, PG-13, ect.", "verified": true, "helpfulness": "0/0", "author": "Dan Boerman"}, {"rating": 5.0, "review": "This is really great. And very easy to use with great options", "verified": true, "helpfulness": "0/0", "author": "Arlene Evans"}, {"rating": 3.0, "review": "Great device, but would be better if it has accessibility features like the Apple TV does.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Easy to install easy to use highly recommend", "verified": true, "helpfulness": "0/0", "author": "kelly mazzara"}]