[{"rating": 5.0, "review": "This plus the $5 Plex app and my living room is set. So much better than Apple TV and none of the waste of other $100+ devices.", "verified": true, "helpfulness": "1/1", "author": "Nate Cook"}, {"rating": 2.0, "review": "Can't get it to work! Having trouble connecting to Xfinity Wi-Fi. I enter the wi-fi password. Screen shows good signal. Then indicates connection error.  No indication why. Can't find any Fire Stick tech support to clarify problem and any possible remedy.  Hardware? Software?", "verified": true, "helpfulness": "2/3", "author": "TR7"}, {"rating": 1.0, "review": "Installation was a breeze. Cool little infomercial to show how the device works. Installed the Netflix app. Browsed the content for about 20-30 minutes without issue. Then the device starts freezing. Haven't even watched a show yet. Called Amazon and as usual good customer service. But wasn't offered a replacement (pre ordered the device). Have a roku and will be purchasing another.", "verified": true, "helpfulness": "1/3", "author": "Angel Luis Figueroa"}, {"rating": 5.0, "review": "My AFS just arrived today and, after setting up, I couldn't be happier. Very easy set up and I was able to hook it up to the bedroom TV (I didn't initially read all the specs & thought it was a USB hook up, which would've meant relocating my PS3 to the bedroom to stream movies / tv). I bought the FS strictly for prime streaming; I don't use Hulu, Netflix, the cloud features, etc...very happy with purchase!", "verified": true, "helpfulness": "0/0", "author": "Casper \"M.H.\""}, {"rating": 5.0, "review": "Great. It is a great product in an exceptionally small package.", "verified": true, "helpfulness": "0/0", "author": "Joel Prinster"}, {"rating": 5.0, "review": "I ALREADY HAVE THE Amazon fire tv doI need the stick too? I also have another tv CAME Iuse this on my second Tv? K DIXON", "verified": false, "helpfulness": "0/2", "author": "Anna M"}, {"rating": 5.0, "review": "So far, so good.I bought this at a nicely discounted price, so please keep that in mind as it does color my opinion, I'm sure. I had been eyeing the Google Chromecast for months watching its price fluctuate a little but never really change, so it wasn't enough to sway me to its world (that and the lack of Amazon Prime Video). Then Amazon announced the Fire TV Stick and had a great introductory price, so I ended up taking the risk twice (one for home, another for work). And as soon as I checked mine out, I picked up one on sale at Best Buy for my girlfriend, so I've already bought 3 of these little beauties.From arrival to setup to use was very quick and easy. The box opens easily and is simple to get into, instructions are minimal because it works without much effort. Including a remote made this a pleasure and a great tipping point. Find your wifi, move the cursor to input the wifi password, and it updates itself in a few minutes and reboots to a welcome video that is nigh-unnecessary because it's an easy, effortless experience to use.The unit is a modest little rectangle with a HDMI plug on one end and a micro USB port on a side for power, and that's it, plug and play. The box also comes with a short HDMI extension adapter if it doesn't fit that styles perfectly with the unit, and a Micro USB to USB cord for power, and no complications.I didn't have an available power supply port, so right now I'm using the ~500ma standard USB power supply off the TV, the Fire TV Stick doesn't love it and has the occasional message in settings, but so far it's working. I understand it though, it's a tiny computer, some things will require more power and if it can't draw enough power it can't run them - until that day, I'll be happy as-is, and later I'll accommodate the extra power supply if needed.Amazon Prime Video works right out of the box. If you want Netflix and Youtube and whatever else is possible, they're available as apps to download right from the device's interface. If you have a smart TV or smart blu-ray player or a Playstation 3, the interface to those respective apps in those machines is essentially identical - high-quality, polished experiences with their own styles - and so far they've worked quite well. Playback is equal to or better than my PS3 for video, full 1080p instead of kicking down to 720p.The Amazon cloud photo drive allows you to upload pics and videos to your account via PC and play them back via the Fire TV Stick, nice little touch. So far I've done photos, it comes up as a slideshow, haven't fooled around with it too much more beyond seeing that the slideshow has a few options.Games, I've been stockpiling Amazon Appstore games for a while on my tablet, and it's great to see some available for use on the Fire TV Stick right away. I tried out a puzzle game, Quell, and it looked and played beautifully with just the remote, but I'm sure an action game like Sonic the Hedgehog will need a game controller input.The UI has a few little quirks but nothing major. Not being able to control the Cloud Photos slideshow with the media controls was the oddest for me. I'm still not sure if it's truly asleep after half an hour of not being on that input, I put it to sleep intentionally and by the time I came back it was up and running, but it may just be that fast to boot up from sleep state. Settings are simple, nobody will get horribly lost or broken fooling around with this machine.Using my Galaxy S4 with the Fire TV Stick is a breeze, just download the Amazon Fire TV app and connect to your unit. Controls include voice control; keyboard input pop-up button; the home-back-menu controls from the remote; and a large touchpad space to act as a directional pad. You can also bring up the rewind-play/pause-forward media controls, why they're hidden I don't get, but once you un-hide them they stay unhidden. Basically, it's a fancier version of the included remote, it expects that you'll look at the TV to see what your input means. The input has a tiny bit of lag which can be frustrating when using the directional space to swipe through multiple on-screen elements, but overall is adequate.Voice search brings up results in Movies & TV, Apps & Games, Music Videos, and Music if appropriate. It's a little stupid though, \"Prince\" worked great but it wanted to know if I meant \"prints\", \"Quell\" worked fine but also gave the option for \"Quello\" (???), \"Batman Begins\" worked without trouble by showing me related content available on Amazon, but \"The Ramones\" returned only \"The Ramon's\" - it understood me, but had no understanding of popular context. I expect a little better on this, you're trying to sell me content here, Amazon, you should know what I'm looking for.Screencasting from my Galaxy S4 was way more fun than I expected, it works pretty smoothly, resolution is decent but clearly kicked down. It displays in whatever the screen orientation is, but both orientations are a little narrower than actual. Streaming video over the device occasionally produces stuttering on both devices, so it's not meant for sharing HD video well. This could be a powerful tool in the right hands, and again, easy is the focus. I don't have a Kindle tablet so I couldn't test that sort of thing, but apparently it has even more connectivity there which is cool.Overall, it's not it's not a tablet, it's not a game console, it's not a smart TV, but it has enough of each of those in a small package at a nice price to make it worthwhile, especially if you're an Amazon user with existing content. Actually, I'll take this over a smart TV any day. The instant-on nature of it and small stature make it a replacement for general digital content consumption. It works well and doesn't ask much of the user, it's a good item.", "verified": true, "helpfulness": "0/0", "author": "JT Kirk"}, {"rating": 4.0, "review": "NIce gadget if you don't already have a net streaming device in you system. At the promotional price of $19 that I purchased my pair there is no question this is a bargain. This is not as robust a streamer as the regular Fire TV box but you can sideload XBMC. I would say this is a great choice for the bedroom or guest room TV. There are a few bugs to be worked out but that is true of any streaming device. Don't expect to stream full blu-ray rips over a wireless network, it just won't work for most of us. Not a perfect product but well worth the money and cheap enough to give away for Xmas.", "verified": true, "helpfulness": "0/0", "author": "Cyrus Brown"}, {"rating": 2.0, "review": "Just received the Fire TV Stick today. Updated to the newest software immediately.It's hard not to compare Fire Tv Stick with Chromecast since the prices are very close to one another.Been playing with it for the past 5 hours. Not too impressed to be honest.Wi-Fi connection drops constantly. Would not buffer to HD even though I have 40mbps+ and was able to watch HD video from Netflix and Amazon Prime from other devices just fine.Message \"Please use the include adapter\" appears even when it is already plugged in.Seems to be some glitches within the Apps/Games menu. For some reason while browsing through games, it keeps taking me to the apps menu instead.I also own a Chromecast and don't see any benefit on this fire stick TV over Chromecast. You have to spend times setting up all of your accounts with this Fire TV Stick. Took a while to enter login id and password on 10+ apps.The Apps options are so-so - nothing special and fairly limited.Games played fine. Tested with Castle of Illusion and was able to play fine using the included remote control. I wouldn't say the picture was all that smooth but not to the point of not play-able.Screen mirroring works fine, just not very smooth.Since I only paid $19 for this, I'm likely going to give it to my mother in law since it's easy to use and does not required a smartphone to operate it. Although you could pair it with your cellphone and use it as an interactive remote control.", "verified": true, "helpfulness": "4/5", "author": "Numm"}, {"rating": 5.0, "review": "The whole family loved it! Easy plug n play now gonna have to order another one because my 2 kids want their own in their room. Thanks Amazon for the early pre-sale price!", "verified": true, "helpfulness": "0/0", "author": "J.A"}]