[{"rating": 5.0, "review": "Ok I've had a roku stick for about a year, and wanted a stick for my bed room so i got a fire stick for my living room TV. Both work well. I'll review both. The ROKU works great for me, every now and then I had to reset it to get Netfix to work. not that big of a issue, but about once a month or so i had to reset thru the settings for Netflix, Amazon prime worked without issue. The fire stick runs Netflix great, hulu and of course Amazon prime, the fire stick is Much faster and much more responsive than the roku. Audio and video are equal on both sticks, got 1080p with both. Both came with remote controls and work almost identically (the roku is way less responsive it takes more clicks and runs past what you want often.) The fire stick came with a HDMI extender that will work better for wall mounted TVs, the fire stick is 10 to 15 dollars cheaper. So if you are going to buy a stick, I think the Fire stick is better just slightly.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 1.0, "review": "Sales rep. at Best Buy thought the Fire TV Stick box I purchased from them would work almost similar to the Kindel Fire tablet my daughter bought me that has a fantastic amount of free movies, etc.  Big surprise....complicated, sign up went as far I wanted with little info., costs, etc. plus very few free movies!Anyway FYI - I returned the Fire TV Stick back to Best Buy same day....only answer from their Geek was that the Tablet probably had older apps. on it then the new TV Fire Stick.Thanks - Ken", "verified": true, "helpfulness": "0/0", "author": "Ken Haggard"}, {"rating": 5.0, "review": "Arrived on schedule.  Very easy to set-up.  Had it working within just a few minutes.  Signed up for Amazon Prime, and it's very easy to navigate.  Very Pleased.", "verified": true, "helpfulness": "0/0", "author": "Paul E Blackwell"}, {"rating": 5.0, "review": "great buy", "verified": true, "helpfulness": "0/0", "author": "Shadow"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Harvey"}, {"rating": 5.0, "review": "This is an amazing product for those who don't have a smart TV. I've never had any issues and it works great especially for streaming Netflix! Great product for a great price! I will definitely recommend this to others!", "verified": true, "helpfulness": "0/0", "author": "BethR"}, {"rating": 5.0, "review": "I love it! It has everything my whole family wants and I super easy to use!", "verified": true, "helpfulness": "0/0", "author": "Valerie Harrington"}, {"rating": 4.0, "review": "Amazon fire stick works just like advertised. I prefer this over others because of the remote that's included. Although I was disappointed because my remote doesn't work, I paired up my phone and use it as the remote so I'm fine for now.", "verified": true, "helpfulness": "0/0", "author": "billyloc"}, {"rating": 5.0, "review": "My family loves the Amazon Fire Stick.  The performance for Netflix, Amazon Prime Video, and other apps is on par with my Roku 3.  The menu system is intuitive and looks good.  I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"imanengineer\""}, {"rating": 4.0, "review": "I love this product but I literally lose the remote every other day.", "verified": true, "helpfulness": "0/0", "author": "JL"}]