[{"rating": 5.0, "review": "I absolutely love this thing! It's so much easier than chromecast, and has more features. We will be ordering another one for the other room. Highly recommend. We will be cancelling cable over this!", "verified": true, "helpfulness": "0/0", "author": "April"}, {"rating": 5.0, "review": "Awesome, got a second one two weeks later. Can't wait to see how much further this grows.", "verified": true, "helpfulness": "0/0", "author": "Gary hopson"}, {"rating": 5.0, "review": "Love it smooth and fast", "verified": true, "helpfulness": "0/0", "author": "kamaron"}, {"rating": 5.0, "review": "easy to set up. works great with our Prime account. It has my Amazon music ,too.", "verified": true, "helpfulness": "0/0", "author": "Ron Olsen"}, {"rating": 5.0, "review": "I love this Fire TV Stick!  Use it constantly!  Easy to install and setup.", "verified": true, "helpfulness": "0/0", "author": "E. OConnor"}, {"rating": 2.0, "review": "i haven't been able to watch anything!  Displays a strong internet connection, yet stops playing and say connection lost!  Every time!  Not sure what the problem is!", "verified": true, "helpfulness": "0/0", "author": "K. Hutkay"}, {"rating": 4.0, "review": "Works well...the first one wouldn't load netflix.  Customer support was helpful but finally sent new stick out.", "verified": true, "helpfulness": "0/0", "author": "Jenifer Buttz"}, {"rating": 5.0, "review": "The Fire Stick was given to me as a gift and I am really enjoying it. The olny thing that gets a little confusing is what movies are included at no charge in Prime and what needs to be paid for.", "verified": true, "helpfulness": "0/0", "author": "Rickrunn"}, {"rating": 5.0, "review": "Better than expected. Easy to install and make a watch list", "verified": true, "helpfulness": "0/0", "author": "BAR"}, {"rating": 4.0, "review": "The interface is not as intuitive and user friendly as the Roku stick and is definitely geared to an Amazon-centric presentation of content.  I think it's worth the extra $10 to go with the Roku stick.", "verified": true, "helpfulness": "0/0", "author": "Brian Kurklin"}]