[{"rating": 1.0, "review": "Constant buffering, very slow. It should have come with ethernet option.", "verified": true, "helpfulness": "2/3", "author": "Milforder"}, {"rating": 2.0, "review": "If you've ever used Roku, you won't be happy with this.  Yes, it's got a fast processor, & works fine with Amazon Prime & Netflix.  But, it's limited.  You only have the 10 apps that come with it, at best.  If you are a Comcast subscriber, you can't watch your HBO GO or Showtime Anytime, as Amazon has no agreement with Comcast.  The user interface is not user friendly; I hate the remote.  You can't scan the menu 5 at a time as with Roku, you have to click it once for each item.  The buttons on the remote are difficult to press, quickly becoming an annoyance.  Onscreen menus are confusing, & just about everything defaults to:  \"go to the Amazon website\", which is not usually helpful.", "verified": true, "helpfulness": "0/0", "author": "Pam"}, {"rating": 4.0, "review": "I was anxious to receive this little device over christmas and sadly I found it underwhelming. I have numerous types of streaming devices around the house (Roku's, Chromecast, AppleTV) Compared to the Chromecast if found it restrictive and lacking methods to access much of my online content. For example, I have MANY movies that are in Ultraviolet that can be accessed by apps like VUDU and Flixster that are not available (or do not have streaming functionality) on this stick. With the Chromecast you just have to have the apps on the mobile device or use the Chrome Browser on MAC or PC and you are off to the races.My kids (the primary consumer of TV) found the navigation easier than Roku but they preferred the way Chromecast worked b/c they didn't have to learn a new interface on a new system. They just used their tablets or computers like they normally do and then \"Cast\" the video/songs/webpage to the TV.Another annoyance is having to have YAR (Yet another remote). I feel like between my sound bar/TV/Blue-Ray/Electric Fan I need to have a table dedicated to holding remotes.Even with these IMHO sub par features compared to the Chromecast, I still found the FireTV stick easy to use. I liked the broad selection of games (though my children still prefer to play them on the tablets). I also found the remote easy to use.As it compares to AppleTV.. well it's almost apples to oranges. Amazon is more closely linked to the Android and Amazon ecosystem and AppleTV is obviously linked to that ecosystem. Depending on where your content is. One obvious difference is AppleTV does not have any Gaming capability. Like the Chromecast, my kids found the AppleTV easier to use in many cases.I can see this stick gaining in utility and I can see them wiping out the Roku market if Amazon continues to invest in the product. I still feel like the Chromecast will always be the best stick out there mainly b/c it's so simple my 5 year old can use it.Once VUDU or another method for access Ultraviolet content is added, I may find the device more useful in the future but until this feature is added, this stick will likely rarely get used.", "verified": true, "helpfulness": "0/0", "author": "Rhys Samson"}, {"rating": 5.0, "review": "This device works very well, very glad I purchased it. Previous attempts to stream video on the TV through Blue Ray Disk player were haphazard at the best. Wasn't expecting too much improvement on the stream in my older home as wifi streaming is always a challenge. The Fire TV Stick works unbelievably well. I've watched more streaming movies now than in the past. Well done Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"eclectic buyer\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Rafael Gregorich"}, {"rating": 5.0, "review": "So easy to use!  Will buy one for each of our tv's", "verified": true, "helpfulness": "0/0", "author": "Charity T \"Luvinit219\""}, {"rating": 5.0, "review": "Super easy to setup, this is replacing my chromecast. Found it to be much more responsive and setting it up was easy (just like the chromecast). Menus are easy to navigate and overall I am very pleased with this. May get a couple more for birthday/holiday gifts.", "verified": true, "helpfulness": "0/0", "author": "The Oncoming Storm"}, {"rating": 4.0, "review": "Sometimes it buffers but overall good value", "verified": true, "helpfulness": "0/0", "author": "T. B. \"tbweld\""}, {"rating": 5.0, "review": "The item arrived as promised. Need more time to see if it will do ok. So far very nice little thing.", "verified": true, "helpfulness": "0/0", "author": "Marcus Antonio"}, {"rating": 5.0, "review": "I have a amazon prime and I have been using my LG WiFi tv to access Amazon videos.  I purchased this when it was offered at a very low price that was to good to pass up. I'm glad that I did.  My reception is much better the format is better.", "verified": true, "helpfulness": "0/0", "author": "janga"}]