[{"rating": 5.0, "review": "Enjoying it!!!", "verified": true, "helpfulness": "0/0", "author": "Vicki Lerfald"}, {"rating": 4.0, "review": "Good for the price.  Has some issues: You need to plug it directly into a wall outlet.  I first plugged it into a power cord and none of the apps would load.  Had to call customer service.  The remote is wonky and not the greatest.  The apps - like you tube and Netflix are great and work fine.  A lot of the other apps sound good - but once you get into them they are limited in scope and value - unless of course you want to PAY.  I got this because my son wanted to take the PS 3 to college - I like going through the PS 3 much better for what is on the Fire Stick - but without a PS 3 - this works well for what I use it for.", "verified": true, "helpfulness": "0/0", "author": "JH"}, {"rating": 5.0, "review": "I have 6 streaming devices ranging in age from 5 years old to new.  This is by far the best.  Here's why:-The remote is wireless and doesn't use an optical transmitter.  So you dont have to point it at anything.  You can use it from under a blanket, behind the kids, etc.-The remote is simple,  no need to memorize the locations of 20 buttons, so you can use it in the dark.-Device is always on.  No need to wait for it to boot up.-Service connection is instant.  No need to wait for it to find your internet connection and then needlessly tell you it found the internet now press a button to continue (e.g. Sony).-It's fast fast fast.  The device responds instantaneously to key presses and begins playing video faster than my other devices.-It is able to download apps/services rather than just having those that initially came with it.-The full setup took a couple minutes.  And, it knew my Amazon Prime account immediately.-And I can type in movie searches using my iphone keyboard, and voice.My other streaming devices include WD Live TV, ipad, iphone, LG, Sony.  None of them perform like this device.  The Apple devices come close.I returned my Chromecast device.  It just wasn't very useable.", "verified": true, "helpfulness": "0/0", "author": "Wes Woods"}, {"rating": 5.0, "review": "Great stick streaming option.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel Raymond"}, {"rating": 5.0, "review": "Great product and great value for money.", "verified": true, "helpfulness": "0/0", "author": "Juan Barco"}, {"rating": 5.0, "review": "Works great love it. Remote was hard to open that was the only thing that I had a problem with. But I love it.", "verified": true, "helpfulness": "0/0", "author": "Joe Reed"}, {"rating": 5.0, "review": "just started using it what a great deal with Prime", "verified": true, "helpfulness": "0/0", "author": "colleen antonini"}, {"rating": 5.0, "review": "Love my Fire Stick!!!  This thing is awesome!  If you don't have one get one, it's well worth the price, a very reasonable price.  Super easy to install and use. I am 63 and not electronic savvy, so when I say this is easy to use....trust me.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Works as advertised. Easy to use and no poblems.", "verified": true, "helpfulness": "0/0", "author": "cddaddy"}, {"rating": 4.0, "review": "I was pleased with the ease of installation and set up.My major concern with its use is the \"sensitivity \" of the keypad when typing in search. An \"accidental brush \" over a letter caused numerous mistakes. Overall, a good and useful tool.", "verified": true, "helpfulness": "0/0", "author": "Evan Clay"}]