[{"rating": 1.0, "review": "Works for two smaller TVs but not our main 56\" Samsung.  We tried everything and it keeps coming up \"Not supported mode\"!  Very disappointed!", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 2.0, "review": "Works as described but very let down with the phone app. I already had purchased a Chromecast before the fire stick which I loved! Chromecast seamlessly can stream any content(any videos, songs, web videos) from your phone with the touch of a single button to your tv/home theater system. I Will be buying another chromecast and throwing this in the drawer of other poor purchases.", "verified": true, "helpfulness": "0/0", "author": "Laurie"}, {"rating": 5.0, "review": "Works very well and is a lot faster than the browser on our smart TV.  Tons of stuff to explore and watch.", "verified": true, "helpfulness": "0/0", "author": "Brenda"}, {"rating": 2.0, "review": "Only works well if on the same floor and within 20 feet of router.  Woulda been nice to know before buying.  Customer Service suggested getting the bigger box style.  Looked good, pretty decent interface when it worked.  PBS channel better here than roku.", "verified": true, "helpfulness": "0/0", "author": "Susan A"}, {"rating": 3.0, "review": "i don't believe half the reviews that are posted about this item.after trying different game  controllers nothing linked that was listed  in the reviews. the remote is small to manage as a controller for gaming.the last date for availability of controller i saw posted was early may.amazon support says its set up to link only to that unavailable controller.it plays prime video with no buffering being apparent.i think the description should say its only to be used with the unavailable controller.i would steer clear til the controllers are in if you want play any better games.i wanted it for 6 year old  grandson to move up from tablet for gaming but honest reviews would have said you need that conrtroller only.", "verified": true, "helpfulness": "0/0", "author": "jsnyder47"}, {"rating": 4.0, "review": "I purchased a fire tv a while ago and was extremely happy with the decision. The fire tv is so easy, even people who want immediate \"instantly working\" devices are able to get the device working. I ended up moving the fire tv upstairs and my parents use the thing every day. Unfortunately, that also meant that whenever I wanted to use the device, it was already taken. Rather than fight them for it, I thought I would purchase the fire stick. It seems to be extremely popular at the moment, and I can see why!The fire stick, even without the voice over remote, works perfect. The only complaint I had is that there was no direction to put the batteries in the remote, nor were there any directions on how to open the back of the remote. Aside from that, set up took less than 20 minutes. I did notice that there was a big difference between the picture on the fire tv and the picture on the stick.The fire tv has a clearer picture, while the stick does it's best, but gets a bit fuzzy at times. I do like that there is no HDMI cable required with the stick (part of the reason I got a stick, rather than another fire tv) and I like that there are apps you can get, which allow you to play or stream music and audiobooks straight from your ipad. So even if you don't have a kindle fire, the device can be tricked into using airplay mirroring technology (just look at the different apps available). I'm extremely happy with the fire stick & the fire tv, and plan to use the fire stick for personal use while leaving the fire tv for family use.", "verified": true, "helpfulness": "0/0", "author": "Mary Greenman \"book lover, audio listener\""}, {"rating": 5.0, "review": "All information has proven to be true. Works great and my family is really enjoying all the features. I recommend it.", "verified": true, "helpfulness": "0/0", "author": "vic"}, {"rating": 4.0, "review": "It works well, since the captive portal update, I have no major complaints. Some minor hiccups scrolling through apps occasionally occur and more apps would be nice. Other than that, it is a no brainier for $19 offered to early birds. For $39, some other alternatives might be worth a look at, but it still is worth it's price. The miracast feature does not work well with my android devices; it is enough for showing photos or stills, but almost unwatchable when trying to show videos. With software updates, and additional time for apps, it will hopefully get better.", "verified": true, "helpfulness": "0/0", "author": "Sanhonymous"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "Barbara Ricci \"cheepskate\""}, {"rating": 5.0, "review": "Side loaded XBMC and good to go.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}]