[{"rating": 5.0, "review": "LOVE LOVE LOVE MY FIRE STICK!!!", "verified": true, "helpfulness": "0/0", "author": "Mandy"}, {"rating": 1.0, "review": "Does not work.Looses the signal every time.Very bad product", "verified": true, "helpfulness": "0/0", "author": "GEK"}, {"rating": 5.0, "review": "Installation was a breeze.  I primarily use the Fire TV Stick for streaming Netflix and Amazon Instant Video.  I recommend this device for anyone who doesn't already have built-in streaming capability on their TV.", "verified": true, "helpfulness": "0/0", "author": "Bob Q."}, {"rating": 5.0, "review": "This has been a wonderful addition and greatly enhanced our TV watching since it allows us to effortless choose between all of our options - Prime, Netflix, Cable... - it was so easy to install too. Great product.", "verified": true, "helpfulness": "0/0", "author": "Iam124"}, {"rating": 5.0, "review": "This great product :-)", "verified": true, "helpfulness": "0/0", "author": "Carol-Anne Comardelle"}, {"rating": 5.0, "review": "I love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Nature"}, {"rating": 5.0, "review": "Love it got tired of using Xbox to stream", "verified": true, "helpfulness": "0/0", "author": "marco maravilla"}, {"rating": 5.0, "review": "Much better than Chromecast.  Too bad Fire TV not available right now.  Don't plan on using it to watch anything at a hotel.  Most wireless services I have found at hotels are not fast or consistent enough to provide a video.  Firestick doesn't seem to be able to buffer enough to watch anything.  Otherwise the setup, apps and integration with Prime are easy to use.", "verified": true, "helpfulness": "0/0", "author": "Robert Wallace"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We have the Amazon Fire TV for our bedroom TV and we love it.  We wanted another one for down in the living room but we don't have a lot of room for another peripheral item hooked up to it.  This was the perfect solution.  Works great and takes up no space!!", "verified": true, "helpfulness": "0/0", "author": "Auburn Sky"}]