[{"rating": 5.0, "review": "Love Fire TV Stick!  Has worked well from the moment I took it out of the box!", "verified": true, "helpfulness": "0/0", "author": "Felicia Davis"}, {"rating": 3.0, "review": "For a TV mounted on the wall, an inadequate length of extension is provided for the device to connect to the TV. It cannot pickup wifi or you will get inadequate wifi service required for the stick. I have a 65 inch VIZIO TV and it did not work well at all. I switched to another table top mounted smaller TV and it is working great on that. HOwever, I bought it for my 65-inch TV.", "verified": true, "helpfulness": "0/0", "author": "John Scott"}, {"rating": 5.0, "review": "Easy to use. I love it!", "verified": true, "helpfulness": "0/0", "author": "rowangirl2013"}, {"rating": 5.0, "review": "Love this! So easy to set up, too.", "verified": true, "helpfulness": "0/0", "author": "Madison Stone"}, {"rating": 4.0, "review": "Works right out of the box. Get a great high quality signal and have lots of options to watch. Highly recommended!!!", "verified": true, "helpfulness": "0/0", "author": "Brandon Glen Johnsons"}, {"rating": 5.0, "review": "Only used for 2 days but my husband already is the happiest man in the world.  We have finally joined the 21st century", "verified": true, "helpfulness": "0/0", "author": "Eileen"}, {"rating": 5.0, "review": "Perfect replacement for fable TV", "verified": true, "helpfulness": "0/0", "author": "Dale Young"}, {"rating": 5.0, "review": "THE FIRE STICK ROCKS!I can't even begin to explain how much I love the Fire Stick. I bought a Roku about two years ago for the tv in my bedroom and really like it, but my daughter needed something for her bedroom. I bought this since the cost was so much cheaper and I couldn't be happier. It is super super easy to install (like absolutely anyone can install this in less than 5 mins), the high def quality is great, and the variety of offerings is fabulous. In addition to movies and tv shows, there are also games (I am obsessed with the game Life, have the app on my phone, and now I can play it on Amazon Fire with the Fire Stick game controls!). Also, I have an Amazon Prime account so there are thousands of free options.The Stick is superior to anything similar on the market right now, esp for the price....If you are thinking about buying one, you won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "Works well!  No issues installing or using.", "verified": true, "helpfulness": "0/0", "author": "Oscuran"}, {"rating": 3.0, "review": "The Fire stick did not stay sync'd with our FIOS router on the first try, nor the second try, nor the third fourth, or fifth tries.  I was about to return it but, decided to try one last time.  And, it finally stayed sync'd with the router and we were able finish watching a movie.  The first 5 times it would stop anywhere from 5 - 20 minutes into what we were trying to watch.  It was not a signal strength issue we had 5 bars signal strength.  And, the older Sony Blu-Ray player never, ever, had an issue in the years we used it for streaming.  So, we've used the Fire stick a couple more times since and the issue appears to have resolved itself.  But, powering the thing up and down numerous times was not what we expect from any device we purchase.", "verified": true, "helpfulness": "0/0", "author": "Alfred Closson"}]