[{"rating": 4.0, "review": "Overall, this is a very good product.  I have been using a chromecast for several months now and when this was announced, I jumped at the chance to purchase it.  While it is very similar to a chromecast, this has several major advantages over the chromecast.  First, it can obviously play Amazon Instant Video.  Yes, there are workarounds to get AIV to play using a chromecast, but having something that easily plays TV shows and movies from AIV is a clear plus.  Also, to me, having a physical remote is a huge advantage.  Having spent countless hours watching Netflix on the chromecast, I can say that the Netflix app can be very frustrating to use when you need to quickly pause, rewind, etc. whatever you are watching.  On multiple occasions, the app would not show the chromecast icon to be able to pause the show that I was watching.  While this is not directly a fault of the chromecast, not having a dedicated remote can make it more difficult to use.  The remote that comes with the Fire TV stick is very easy to use and makes pausing or rewinding of shows much easier to do.With all that being said, the Fire TV stick is not perfect.  On multiple occasions, the shows that I am watching with the Fire TV stick have had to pause to buffer or the picture quality has dropped.  While this could easily be chalked up to the wifi speeds, I have never had this same issue with a chromecast.  Also, there is not an easy way, at least that I have found so far, to turn off/put the fire TV stick to sleep when it is not in use.  Because it needs to plug into an outlet instead of being able to plug into the TV like a chromecast, it does not turn on and off with the TV like a chromecast does.  Finally, it seems like you are not able to search for new music using the Fire TV stick while using Amazon Prime music.  You can easily play songs that you have already added to your favorites, but you cannot search on the stick for new music to listen to.  Some of these issues can easily be fixed with software updates, and hopefully they do.  But even with these issues, I would still recommend this to anyone.", "verified": true, "helpfulness": "1/1", "author": "Chris Floegel"}, {"rating": 5.0, "review": "Love it! ... Can't wait for the iOS app to come out", "verified": true, "helpfulness": "0/0", "author": "Michael Langner"}, {"rating": 1.0, "review": "This device set up on my regular TV just fine but when I tried to set it up through my receiver it would not display a picture just sound. After reading other reviews I found out it is not working in this environment", "verified": true, "helpfulness": "8/10", "author": "Thomas A. Natale"}, {"rating": 5.0, "review": "great better than I expected  ...........Bypassed ROKU  picture quality on my smart Tv", "verified": true, "helpfulness": "0/0", "author": "K. Evilsizer \"little one\""}, {"rating": 5.0, "review": "Ridiculous value. This thing is awesome. Took over my old PS3 as the media player for the house. It loads fast, great video quality and I haven't seen it buffer or lag. Will update in a month or two.", "verified": true, "helpfulness": "0/0", "author": "Danny Garcia"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "Tracie Markunas \"Raven\""}, {"rating": 5.0, "review": "Very fast, nice to not have any buffering. Easy to use interface. My only company is that I can't use second screen with my ipad, because it only works with kindle fire's.", "verified": true, "helpfulness": "0/0", "author": "Willyb05"}, {"rating": 5.0, "review": "Excellent little product that destroys Chromecast. Nuff said.", "verified": true, "helpfulness": "0/0", "author": "AR982"}, {"rating": 5.0, "review": "I love the Fire TV stick.  It is very low profile, easy to install, easy to use. Great buy!", "verified": true, "helpfulness": "0/0", "author": "RGM Amazon Customer"}, {"rating": 4.0, "review": "Working very nicely, the only drawback I can see so far is the lack of HBO GO which means you have to have another device to cover this.  Also, this is a great tool for AMAZON to keep you enrolled in Amazon Prime.  Price wise this was a very good purchase.  Also, being able to use my Note 2 as a remote is definitely a big plus.", "verified": true, "helpfulness": "0/0", "author": "Guy Hoyt"}]