[{"rating": 4.0, "review": "Really easy to use, but must have a good wifi signal to stream across. Hope Amazon adds more content so I can completely disconnect from cable TV. Need to include ESPN and standard television stations so I can still watch sports games live", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "This is a game changer - I amVery impressed!", "verified": true, "helpfulness": "0/0", "author": "Bella in VA"}, {"rating": 5.0, "review": "The Fire TV stick works exactly like I wanted. When I bought this product I was a little nervous to buy this over the more expensive Fire TV box wondering if the slower processor would be a big drawback. I was 100% wrong. It was shipped pre-loaded with my prime account and from there adding apps and programs was incredibly simple. We have since watched many programs through both Prime and Netflix and each time it was very easy to navigate and we never had any issues with slowness or buggyness that we had with a competitor's product. We only really watch TV and movies on here so I cannot comment on the games, but as casual viewers, this product meets all of our needs. I am going to purchase this for my parents that should also be able to use the easily navigable interface.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I know that Amazon's purpose in life is to get us to buy more content, but with products like this and their ability to add more value to Prime make me a loyal customer.  Very easy set up and use.  The only complaint I have is that I wish it had HDMI pass-thru and that they integrated it more into the TV experience to control my cable box and search the tv guide as well.  With Google abandoning Google TV in favor of Android TV, I'd like to build around the Fire TV ecosystem if I knew more about where they're going with it.", "verified": true, "helpfulness": "0/0", "author": "rick_in_dc"}, {"rating": 5.0, "review": "There are a lot of streaming devices out there and trying to choose one can be difficult. I really recommend the Fire TV Stick . Its simple to use and requires very little set up. Truly a great product !", "verified": true, "helpfulness": "0/0", "author": "Mo \"Mo\""}, {"rating": 5.0, "review": "The remote is really what makes this stand out from chrome cast, which can be problematic occasionally when controlled by your smart phone", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Buggy software...keep having to log into netflix.", "verified": true, "helpfulness": "0/0", "author": "iFlash"}, {"rating": 3.0, "review": "I really wanted to like it, but after having it a little over a month it's going into storage. Unfortunately I can't compare it to any other streaming sticks as the only other device I use to stream is a playstation, however the stick compared to the playstation is incredibly slow (obviously). If you have nothing else to stream on I would recommend picking one up as they are cheap, but mine freezes up at least once every other night so there are definitely better (more expensive) options out there.", "verified": true, "helpfulness": "0/0", "author": "BillyJack"}, {"rating": 2.0, "review": "Just purchased the amazon tv stick but I live in the Caribbean is the movies free or do I have to pay for them.", "verified": true, "helpfulness": "0/0", "author": "Richard   Chase"}, {"rating": 5.0, "review": "Fabulous!", "verified": true, "helpfulness": "0/0", "author": "Jill Keyes"}]