[{"rating": 5.0, "review": "Excellent, however we've only had it a few days.", "verified": true, "helpfulness": "0/0", "author": "John Pedersen"}, {"rating": 5.0, "review": "This was a gift for my sister and they love it.", "verified": true, "helpfulness": "0/0", "author": "rquiles"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/1", "author": "Lili"}, {"rating": 5.0, "review": "I have 2 of these Fire Sticks. They work great and were easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Phillip Poyer \"pgolfco\""}, {"rating": 5.0, "review": "The fire stick worked just as expected. I read a lot of reviews and the positive far outweighed any negative so I purchased it. Simple to set up and all the Prime movies and shows were instantly available on my \"dumb\" tv. I can tell you to read the reviews and apply your circumstances cause you will usually find someone is or has the same experience. I have not been disappointed with any of my Amazon purchases and come to expect quality from their products and pure marketing from actually users. Thanks again Amazon. (prices are always competitive. )", "verified": true, "helpfulness": "0/0", "author": "Gary Updegraff"}, {"rating": 5.0, "review": "I like it much better than the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Gabe Robinson"}, {"rating": 4.0, "review": "Absolutely a great product. I'm going to cancel cable and add Sling to have a full viewing pleasure.", "verified": true, "helpfulness": "0/0", "author": "Prime"}, {"rating": 5.0, "review": "Using the Fire Stick is so much easier than connecting the laptop to the TV.  Great product, decent price.", "verified": true, "helpfulness": "0/0", "author": "Shuffelin"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Gerard Duffy, Phila.,Pa."}, {"rating": 4.0, "review": "For the price it is a no-brainer to get if you already have Prime. But it's not as sleek or fast as my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Michael"}]