[{"rating": 5.0, "review": "I give the Fire TV Stick 5 stars.  First of all the price is very reasonable.  It is super easy to install.  Once installed it is also very easy to operate.  I love the fact that I no longer have to watch movies just on my Kindle.  I also like the feature that allows you to jump from one device to another.  This is very handy for browsing on a hand-held device and then switching to the big screen when you are ready to watch.  If you are already a Prime Member there is no limit to the number of TV shows, Movies or Music to pick from.  If you are not, with the free 2 day shipping that comes with Prime, it is well worth the $99.00 per year fee.  I have satellite TV also.  I have not watched it since receiving my Fire TV Stick two weeks ago. I guess you can sum it up this way, I LOVE IT !!!!!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Brenda R. Hall"}, {"rating": 4.0, "review": "I've only had the Fire Stick a few days, but I like the viewing potential. I did, however, accidentally purchase a movie without meaning to! Amazon was kind enough to refund and remove the movie for me. I also found out how to enable a password in order to make purchases - no more accidental charges!", "verified": true, "helpfulness": "0/0", "author": "Robson Designs \"I commute about an hour each way to work and listen to audio books enroute. Sometimes I don't want to get out of my car because I'm at a really good place!\""}, {"rating": 1.0, "review": "It don't works in my country. ...Amazon TV or music prime isn't available in Paraguay south America. ....I bought unknowing this fact", "verified": true, "helpfulness": "1/2", "author": "Jorge C."}, {"rating": 5.0, "review": "We are enjoying the firestick catching up on TV series we missed. We are actually watching movies fircrge first time in a long time.", "verified": true, "helpfulness": "0/0", "author": "Lisamouse"}, {"rating": 5.0, "review": "Love it! Easy to set up and use. Don't know how I lived without it! Use it everyday with Netflix and Amazon Instant Video.", "verified": true, "helpfulness": "1/1", "author": "JudyA"}, {"rating": 5.0, "review": "Best thing ever to start the year...", "verified": true, "helpfulness": "0/0", "author": "Daniel Manzur"}, {"rating": 4.0, "review": "Turned an unused computer monitor into a second \"television\" screen.  Fantastic!  Would be 5 stars only if there was a dedicated \"off\" switch; I never really know if it's turned off or not without unplugging.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It has everything I wanted from games to apps like Netflix, Hulu Plus, and etc", "verified": true, "helpfulness": "0/0", "author": "Joshua Martin"}, {"rating": 5.0, "review": "Easy set up, even for a techno tard like me!", "verified": true, "helpfulness": "0/0", "author": "Toni"}, {"rating": 5.0, "review": "Works great!!!", "verified": true, "helpfulness": "0/0", "author": "Rema Newsom"}]