[{"rating": 5.0, "review": "There isn't a lot to be said for this little device that isn't already mentioned about the FireTV. This is a stand in replacement for anyone that uses the FireTV for media streaming, and doesn't use the Game/App features of the FireTV. Even then, several of the apps I use still work on the FireTV, but there is one noticeably missing feature: FreeTime.I ended up using this as a go to gift for Christmas this year, passing out about 6-7 of them, then advising people that Plex was available for free on Christmas Day.The FireTV stick is great at streaming media, so between Plex, Netflix, Hulu Plus, and my Tablo (Used for OTA DVR), this is an easy replacement for all other streaming devices, and potentially a Cable Cutters best friend. I've had a Boxee BOX, Roku 2, Roku 3, Roku Stick, Chromecast, X8 Meida streamer (android based), FireTV, and an Apple TV. Of all of the items, this is on the cheaper end of the spectrum but doesn't disappoint. The Boxee Box was a better interface, but went the way of the dodo when Samsung bought them out. Among the other devices, this is by far the easiest to use interface/device in the list.", "verified": true, "helpfulness": "0/0", "author": "James Erickson"}, {"rating": 5.0, "review": "Better than google chromecast yet missing a few features that would absolutely kill it. I love how you can install many apps and play games on this as well but it's missing the feature of casting videos from your phone. I know you can cast the screen but it's not the same since it leaves your device no functional if you want to watch a movie from your phone to your TV. The screen cast basically mirrors whatever is on your phone so if you exit the video, it'll exit the video on your TV. Chromecast lets you share the video to your TV and it leaves it in the back ground so you can still use your phone or device. If they implemented this feature then it will totally be much better than chromcast.", "verified": true, "helpfulness": "0/0", "author": "CuriousEggroll"}, {"rating": 4.0, "review": "Setup was extremely easy and simple. Netflix, Amazon Prime, and YouTube works great on it.  Amazon integration is great. For non-tech/non-power users, I would recommend this over the Google's chromecast because of the remote.  Also an added bonus is being able to run Apps and Games which the chromecast can't do.However, if you are a power google user and want more integration with Google products, you might want want to go with the chromecast instead.  For example, this device has trouble with casting screens from android devices and sometimes have trouble with playing youtube video sent from the android device like a smart phone.  The YouTube app works fine on the firestick.Also another caveat is that the USB port on the TV wasn't enough to power the device, so I had to use the built in power usb adapter.  However, the cord wasn't long enough to reach the power outlet.In making the choice between the Amazon Fire TV Stick and the Google Chromecast, think about where most of your media will be stored at.  For example, if your digital media and purchases/streaming will primarily be done at Amazon, the Fire TV Stick is the obvious choice.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"technomagefa\""}, {"rating": 2.0, "review": "Worked briefly", "verified": true, "helpfulness": "0/0", "author": "Always October"}, {"rating": 4.0, "review": "Love the stick. Problems with peripherals.Had problems waking from sleep. Replaced included power supply brick with an Apple supply power brick and have had no more problems.Had problems navigating while Pandora was playing - remote lagged. Turned off Pandora in the background and have had no more problems.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 4.0, "review": "Overall really good interface, very intuitive, super easy set up.  Very fast start up time.  Makes getting to my Amazon videos easy.One downside - I really wish they would have included Vudu.  Just want to put it out there - the two competing devices have it.One concern - it seems to put off a lot of heat, or at least more than I would have thought.  So, I tend to unplug it when not in use.", "verified": true, "helpfulness": "0/0", "author": "wjpalmer"}, {"rating": 3.0, "review": "I have this and two Roku Sticks and for me personally, I prefer the Roku setup and main screens.  The Fire TV seems really tuned into Amazon (Yup, I know) and being a prime member that is great, but I don't really use Prime for streaming all that often.  It was a steal at 20 bucks, so why not try it out.  The install of apps was clunky and navigating around was the same.  All in all it is good for what it does, just my taste in navigation.", "verified": true, "helpfulness": "0/0", "author": "mnpilot"}, {"rating": 5.0, "review": "works great, quick load. boyfriend loves it. router is right next to device. only downside is it has to stay plugged in to power in order to use, wish it could draw its power from the HDMI port but... such is life can't expect too much from a $39 device which I got for 1/2 for that prime members offer! Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Steph Q."}, {"rating": 5.0, "review": "We have multiple rokus & are now changing all of them over to fire products. They are much faster than our rokus are.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 1.0, "review": "This is a complete waste of your time and money.  I will break down the pros and the cons however since it has some good qualities.  In the past I have used my xbox 360, my xbox one, a google chromecast and a smart tv, so I am very familiar with what this device should do.Pros:The device is fast.  This is one of the main reasons I purchased the device and as far as speed goes I am happy.  The remote makes navigation a breeze, so that is a big plus over other devices.  I love the remote and I would say the remote itself is the biggest advantage of this device.Cons:I have a real hatred of Android phones and this device basically turns your tv into a big android phone.  The biggest con here is lack of useful applications.  There is no lack of applications, just a lack of useful applications.  You will be able to find all kinds of crappy screen saver applications and lack luster games.  If you look on the reviews of the countless worthless applications you will find that they are covered with negative reviews.  For some reason the youtube app is labeled youtube.com and doesn't really look like youtube.  The main application I use to watch movies is nowhere to be found.  I have 100's of movies on the vudu application that I can access with my smart tv, my xbox consoles, and the chromecast, but for some reason not on this new Fire TV stick.Overall, I feel like this device is a waste.  I have other similar devices that do more.  I bought this because I wanted to replace the chromecast device, but I cannot do that since the device lacks useful applications and replaces them with bloat ware.", "verified": true, "helpfulness": "0/1", "author": "lee"}]