[{"rating": 3.0, "review": "Works pretty much as expected. The interface and remote are a little quirky. Not very intuitive. Over all we like it.", "verified": true, "helpfulness": "1/1", "author": "Jan-Arden Petersen"}, {"rating": 4.0, "review": "works for me.", "verified": true, "helpfulness": "0/0", "author": "Robert E. Hawley"}, {"rating": 2.0, "review": "This is a great idea, but it doesn't work for me.  Our internet isn't the problem as we have a smart tv and amazon prime videos and netflix stream perfectly; this only works half the time.  We have to unplug it to restart it every day and it maybe improves the video quality temporarily.  I don't know if it's our geographic location in South Dakota or if it is a bad device.  Either way, I wouldn't recommend it.", "verified": true, "helpfulness": "0/0", "author": "L.C."}, {"rating": 5.0, "review": "I was surprised how easy it was to set up and use. I am still finding new things to watch and am really enjoying not having to pay for Cable TV anymore!", "verified": true, "helpfulness": "0/0", "author": "Elaine \"Elaine\""}, {"rating": 4.0, "review": "So far so good. Only issues I've had so far has been mild picture quality glitches. The games are fun, and there are plenty of TV apps. Well worth the minimal investment. Especially if you are already a Prime Member!", "verified": true, "helpfulness": "0/0", "author": "Nate Pool"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Lissandra Salinas"}, {"rating": 2.0, "review": "Great tool but slow right out the box. Every move you make with the remote control has a 1-2 second delay. If it was faster would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I decided to order the amazon fire stick as an early father's day present for my husband (he really wants the tv, but  this was as close as I could get lol!). We had gotten rid of cable about a year ago and simply stream television through our ps3. Unfortunately, our ps3 has been nearly depleted from use (we also used it for our movies for the kids). I decided to check out the different fire devices available and after reading some reviews and asking hubs what he thought of it, I bought it. We have been pretty happy with it so far. The only issue is when attempting to watch anything on hulu, it pauses CONSTANTLY! it is really irritating! I am still researching the issue. With everything else (Netflix, Amazon Prime TV) I am very pleased with it and my husband likes it too :) I would definitely recommend it, just be prepared to have hulu pause a lot if you use it (If I find a solution I will post it).", "verified": true, "helpfulness": "2/2", "author": "Firefightingmama14"}, {"rating": 5.0, "review": "perfect for child's bedroom t.v.", "verified": true, "helpfulness": "0/0", "author": "Jane A."}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "jerry noe"}]