[{"rating": 5.0, "review": "I am in love with this item especially since I got the chance to watch #OITNB this weekend.  I had it for a while and just installed it this weekend and I am very impressed with it and I got it when they had the introductory price for it which means I got a great deal.", "verified": true, "helpfulness": "0/0", "author": "Karamel \"A Kreative Reader\""}, {"rating": 3.0, "review": "Not a bad item to get and it does perform as advertised. That being said, the device is dependent on your particular wireless internet connection and having movies/tv start and stop and stop and start is annoying. Not sorry I bought it, but would think long and hard before I did again. My daughter has Apple TV and she told me it is worst than the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Jimmy J. Shaw \"oldbent1\""}, {"rating": 1.0, "review": "I just bought 2 of those devices at Best Buy in Orlando. When I asked the sales executive about it, he confirmed that it was a reliable device to turn a regular led TV into a Smart TV. The problem is that I live in Argentina and when I got back home, I was not able to use any of the options I was interested in. Is there anyway I can connect to my Netflix account for example? When I tried to download the Netflix application it was denied... At this point, it is completely useless for me", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Have a TV in an upstairs room that is directly above where the modem/router is located.  Could not get a strong enough signal, even after verifying with Amazon and internet provider that the incoming connection is strong enough to support the \"Stick\".Had to return it.", "verified": true, "helpfulness": "0/0", "author": "DMTN"}, {"rating": 5.0, "review": "I'm addicted. It's super easy to use, just needs wifi. Where was I before I had all that online programming at my fingertips?This thing is the best $39 I've ever spent!", "verified": true, "helpfulness": "0/0", "author": "miru"}, {"rating": 1.0, "review": "I could never overcome the stuttering problem, which made watching anything, unwatchable.  Tried everything, but could not overcome it.  For me, it's just a piece of junk  Chromecast had no problems, only the fire stick.  Searching the web, it appears that many have the same problem with their fire sticks.", "verified": true, "helpfulness": "2/2", "author": "srdowns"}, {"rating": 5.0, "review": "So glad I sent back that stupid Chrome cast and replaced it was this.  So easy to use and dependable (I struggled with Chromecast for three days, got it connected once for about ten minutes, then nothing.  Good riddance to a terrible product!)  For the same price I get slick, reliable, non-clunky (no phone or pad needed to make it work).Buy this with confidence; then sit back, relax, and enjoy!!!", "verified": true, "helpfulness": "0/0", "author": "druadh \"druadh\""}, {"rating": 5.0, "review": "awesome. Warning: you cannot use HBO go with this device if you have Comcast. They do not sponsor it through the fire stick. That is the only bad thing about it.", "verified": true, "helpfulness": "0/0", "author": "D C"}, {"rating": 5.0, "review": "We travel quite a bit for summer sports and this stick has been awesome.  We enjoy being able to see our favorite shows and movies by accessing prime or netflix. I think the price was fair for the flexibility we get with it.  LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "When it's working it's fine. But it constantly drops the wi-fi connection and buffers. PS4 and chromecast streamed fine on the same tv", "verified": true, "helpfulness": "1/1", "author": "Paul Kasparian"}]