[{"rating": 5.0, "review": "I love this Fire Stick..well worth the money, great movies to choose from. Easy to navigate. I'm a prime member and loving it!!", "verified": true, "helpfulness": "0/0", "author": "Margarita \"Teresa\""}, {"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "Juan Rodriguez"}, {"rating": 3.0, "review": "Good for home use. Very limited when travelling. I have Fire TV for home and Fire Stick for travel. Limit is not being able to connect to hotel network. Use Kindle to cast to the firestick but this has limits also, especially in other countries.", "verified": true, "helpfulness": "0/0", "author": "MFSI"}, {"rating": 1.0, "review": "I must say that I am very dissatisfied with this product. Whenever I watch a show or movie it takes a really long time to load and it pauses several times while I'm watching. I've reconnected it and also tried to restart my wifi but the same problems occur. I used the Google chromecast for a year before the firetv stick and it worked perfectly. The only upside to this product is using Amazon Instant Video.", "verified": true, "helpfulness": "0/0", "author": "Paul Rayes"}, {"rating": 5.0, "review": "Easy setup and install. Love my FIreStick", "verified": false, "helpfulness": "0/0", "author": "Cindy P."}, {"rating": 5.0, "review": "I have a smart TV. The TV was slow with Hulu and Amazon. I am a loyal amazon and prime customer. I purchased this to see if it would be any better. It was. I love my stick. I can use it wherever I want and all my apps are there. Installation was easy. Price was cheap. My hulu, amazon, and netflix load quickly. I'm happy. Good enough for me..", "verified": true, "helpfulness": "0/0", "author": "JR Mile"}, {"rating": 2.0, "review": "Great options but wifi is iffy...!!!", "verified": true, "helpfulness": "0/0", "author": "Tresa \"Tresa 9831\""}, {"rating": 5.0, "review": "My daughter loves this fire stick, hides easily behind the TV, perfect for wall mounted TV. She had it hooked up in minutes, and she hasn't left her room since!  I wondered if this was as good as the larger Amazon Fire (Because it was smaller and cheaper) but size doesn't seem to matter. Maybe if your TV was in a cabinet and had the space for the larger one.... But for what we needed this fit our needs perfectly.I have a Roku, (purchased before Amazon Fire TV) I like the set up on the Amazon one better, will purchase one in the future for our living room TV, maybe even for my bedroom and pass th e Roku to my parents.", "verified": true, "helpfulness": "0/0", "author": "T. Simmons"}, {"rating": 4.0, "review": "Love the features but a bit slower than what I have experienced with the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Cristina Cortez"}, {"rating": 2.0, "review": "Constantly disconnects from my wifi. I don't know if it's the device or my internet but we are not compatible at all. I returned it.", "verified": true, "helpfulness": "0/1", "author": "Tam N."}]