[{"rating": 3.0, "review": "Cons- constantly loses signal- long loading times- struggles to stream videos with on a average Internet connectionPros- it's size- great amount of apps and gamesIn all this can be a good product with the right Internet connection,but for most it will constantly lose its signal and fail to load the videos and movies that you want to watch, instead you'll be stuck in a infinite loop of loading screens and disappointment.", "verified": true, "helpfulness": "0/0", "author": "Eduardo Amarillas"}, {"rating": 5.0, "review": "Unplug from direct tv.  More movies and series.", "verified": true, "helpfulness": "1/1", "author": "Tim Saunders"}, {"rating": 5.0, "review": "Very happy with it. So much cheaper than cable and just as good!", "verified": true, "helpfulness": "0/0", "author": "amy"}, {"rating": 5.0, "review": "Works as advertised.  Simple, easy and lots of TV and movies with my prime membership.  Just wish more of the older movies were free!", "verified": true, "helpfulness": "0/0", "author": "jeff eastlick"}, {"rating": 5.0, "review": "Great,  love.  Able to watch all my shows.", "verified": true, "helpfulness": "0/0", "author": "Sherry"}, {"rating": 5.0, "review": "It works very good as expected", "verified": true, "helpfulness": "0/0", "author": "Carlos N Ballanti"}, {"rating": 5.0, "review": "Besides my Kindle, one of the best purchases I've ever made. Easy to install, you can use it for access to Netfix, HULU, etc via the Home screen.", "verified": true, "helpfulness": "1/1", "author": "CAZ"}, {"rating": 5.0, "review": "Very easy setup, image quality great!  I have a Roku and this is by far a better product.", "verified": true, "helpfulness": "1/1", "author": "Deb"}, {"rating": 5.0, "review": "Fire Stick is completely SPECTACULAR!! My only regret is that I didn't get it sooner. LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "SCOTT D. FORD"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Michael E. Burgess"}]