[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Andrea Goodwin"}, {"rating": 4.0, "review": "Probably my fault but the images make it seem like no cords required... Not true, must be plugged in to wall since TV USB can't provide enough power.", "verified": true, "helpfulness": "0/0", "author": "Brock T."}, {"rating": 5.0, "review": "We love it. My son with special needs has already figured out how to get to pbs kids. Have not used Prime because every thing I want to watch has to be paid. I refuse to pay for a movie that has been out for years.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"mccunesgirl\""}, {"rating": 5.0, "review": "We love our Amazon Fire TV Stick. We have a ROKU stick on our downstairs television and decided to purchase the Fire TV Stick for our master bedroom television because of our Amazon Prime account. It is much faster than the ROKU stick and we've had no issues with it at all. We would definitely recommend it over the ROKU stick, especially if you have an Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "Chelsie Perko"}, {"rating": 5.0, "review": "Does every thing needed, worth the price.", "verified": true, "helpfulness": "0/0", "author": "Iowa farm boy"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "charles king"}, {"rating": 5.0, "review": "Worth every penny. Great for the whole family!", "verified": true, "helpfulness": "0/0", "author": "Lauren McCabe"}, {"rating": 5.0, "review": "I purchased my first Amazon Fire TV stick a few weeks ago to try it out after reading about all that you can do with the Fire TV stick. It's Totally Amazing!!!  this thing is great!!!  Plenty of movies and music and the small remote is awesome!!! I then purchased three more for the kids. You do need to be an Amazon Prime member for $99 annually after your 30 day free trial period. You will also need a good broadband wireless service provider and router with good speeds. It's well worth the $39 for the TV Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Timothy Oravitz"}, {"rating": 5.0, "review": "Even better than expected", "verified": true, "helpfulness": "0/0", "author": "Evelyn James"}, {"rating": 5.0, "review": "Save $$.  Dump premium channels and enjoy Prime and Netflix using the Fire Stick!  I like programs better and I'm saving big money.  No waiting for commercial programs to start...make your choice and get it immediately.  I ordered a second one for my other TV.", "verified": true, "helpfulness": "0/0", "author": "Peppi"}]