[{"rating": 2.0, "review": "Boxing and everything is really cool, love the picture on the TV.  The wifi connection sucks and I can't stay online long enough get any updates.  Moved it around to different places, same problem.  Sucks, was looking forward to this.", "verified": true, "helpfulness": "0/0", "author": "Troy Murray"}, {"rating": 2.0, "review": "The stick has so much promise, until you actually use it for more than 60 minutes. Netflix, hulu, amazon prime video, watch espn, etc always stop streaming after about an hour of watching. Restarting works half the time but in the long run it's just annoying to have to go through the same song and dance to watch an episodic tv show. I got this for $20 so it's hard to complain too much, but if you're paying $40 step back and look at all the other streaming boxes and sticks out there; a roku or a chromecast may be just what you need and more reliable.", "verified": true, "helpfulness": "1/2", "author": "P. Gernale Jr."}, {"rating": 5.0, "review": "I've been accessing my Amazon Prime Video through a \"smart\" blue ray CD player with a terrible, awkward and sluggish interface or through Apple AirPlay from my iPhone - both experiences have huge drawbacks for different reasons.  I love the content on Amazon Prime, but I'm a huge user of Apple TV because of the ease of use and my large iTunes video library.  I received 2 Fire TV Sticks last week and was blown away by their simplicity in set up and use.  No directions needed and I was up and running in less than five minutes.  The interface is snappy, refined and easy to navigate.  Other than the necessary power cable, no HDMI cable to hassle with and no shelf space needed to hold it.  Video from Prime streams immediately - way, way faster than Apple TV and faster than Amazon Prime through my \"Smart\" CD Player.  My Fire TV Stick is now the easiest path to video content now and I'd guess I spent 75% of my time on Fire TV Stick versus 25% on Apple TV (was the reverse prior.)  Amazon nailed the experience on the Fire TV Stick and not only do I highly recommend it, I'd say it's simply a \"MUST HAVE\" if you have Amazon Prime.  I can't wait to try the other features on the device...", "verified": true, "helpfulness": "0/0", "author": "Bobby O"}, {"rating": 4.0, "review": "Has everything the chromecast doesn't. Netflix/prime ie all apps run right from the device itself, so no computer/phone needed. Tons of apps. Video quality is good, dolby digital plus audio is very picky about what devices you connect it to, so check your home audio reciever or there's a chance you'll only have stereo audio. Remote is good, phone app remote is iffy, does not work with a few apps for text entry", "verified": true, "helpfulness": "0/0", "author": "sam lewis"}, {"rating": 3.0, "review": "I like the gadget, and coming from Apple TV, Google TV, Roku 2, Roku 3 and Chromecast I can say Fire TV Stick can be a perfect gift. However, after about a week of use, the Fire TV Stick stopped responding to the remote. At first it was misinterpreting commands, while going through listings, jumping through several titles at once, then confused right with left, eventually left stopped working altogether and now none of the keys on the remote work.", "verified": true, "helpfulness": "0/0", "author": "Alex Lokshin"}, {"rating": 1.0, "review": "Mine wont set up and is stuck in a boot loop.I plugged my stick into my tv. \"Amzon\" logo poped up followed by \"fire tv stick\" logo then screen goes black and my tv hdmi channel number window comes up as if the tv has no video signal. Then it repeats that over and over again. I cant get past that to set it up on my network...Info:  I have a Philips 32\" TV model#: 32PFL4507/F7 manufactured in june 2012", "verified": true, "helpfulness": "1/1", "author": "Alex Mikus"}, {"rating": 5.0, "review": "First roku like product that I have used where I thought - hey - this is as good as a roku.  For the $20 I picked it up for, a great deal!  Now I have a roku like to device in my office!", "verified": true, "helpfulness": "0/0", "author": "Nicholas Winder"}, {"rating": 4.0, "review": "Initial set up was tricky, and I ended up having to enter the wifi information several times over the first few days. Also, it logged me out of netflix once. Otherwise, it's been great. Turns on super quickly, keeps the apps I use often accessible on the home screen. Beats the heck out of my Roku HD.", "verified": true, "helpfulness": "1/1", "author": "Danny H."}, {"rating": 1.0, "review": "Netflix does not work. Amazon prime instant video keeps going offline. The games are lame and streaming anything is a constant battle. I could say that this is a beta version.... and a pretty bad one.", "verified": true, "helpfulness": "0/0", "author": "miguel"}, {"rating": 4.0, "review": "The Fire TV Stick is a very good streaming stick.  It performed very well.  I got it for the prime special $19 and it is a steal at that price.  Previously I used a chromecast for my streaming needs but was frustrated by always needing to stream from my phone and control it from my phone.  At the MSRP of $35 for a chromecast and $39 for the Fire TV stick it is a clear choice to pick the Fire TV stick.  Unfortunately Amazon does such a good job of finding low prices that the chromecast is only $22 and for that price it is a hard decision to choose between the two.  The Fire TV Stick is able to be used independently and also seemed much faster to stream videos than the chromecast.  The Fire TV stick also comes with a remote, the chromecast does not since it can only be operated with a phone or computer anyways.  The only negative I have is that the help page says it supports WPA EAP and from what I can tell it does not.  Not a big deal, I can probably work around it at my dorm and it is possible it is a feature they are still working on implementing.", "verified": true, "helpfulness": "0/0", "author": "Luke Kuprenas"}]