[{"rating": 5.0, "review": "Works as expected", "verified": true, "helpfulness": "0/0", "author": "G. Pruckmayr \"GP\""}, {"rating": 2.0, "review": "I started off by being disappointed that many of the games I had purchased for my Fire TV box was not compatible with the Stick. Secondly, the remote that came with the unit works . . . sometimes. It goes to sleep during the middle of a game or program. When you try to reset it, the screen goes black. Even when it does work, there is a lag time. It's like being on dial up cable again. Select the program, push the button, go make a cup of tea, start the dishwasher, come back and maybe it has decided to work. Overall, I'm very disappointed. I only ordered it because my Fire TV box stopped working everytime I rearranged my furniture.", "verified": true, "helpfulness": "0/0", "author": "BECKY CUMMINGS"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "JIMMY SUTTON"}, {"rating": 5.0, "review": "It was easy to install and it works great, still haven't explored everything it can do as of yet.", "verified": true, "helpfulness": "0/0", "author": "James Stringer"}, {"rating": 5.0, "review": "My family and I like it a lot.  Great price,  good quality product.", "verified": true, "helpfulness": "0/0", "author": "Tiffany Crabtree"}, {"rating": 3.0, "review": "First one would not connect to wifi. Router sees it but fire stick would say it can't connect to Amazon.com. Called support , very friendly , waiting on second one to arrive.", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 5.0, "review": "Makes watching Amazon Prime movies so much easier than trying to get the internet on my blu ray to stream through th tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Frank Allen"}, {"rating": 3.0, "review": "I was really looking for this to be something above and beyond Roku (which I also have) but it is about the same. Plenty of extra things to buy above standard and pretty much the same movies as Netflix on the Amazon Prime movies app. All in all, if you are looking for something to buy, I would consider Roku.", "verified": true, "helpfulness": "0/0", "author": "WP \"NonaP\""}, {"rating": 5.0, "review": "I like the fact that I can be watching something on my Fire TV downstairs, then go upstairs and continue watching the same show from the Stick!", "verified": true, "helpfulness": "0/0", "author": "ilovebooks"}]