[{"rating": 5.0, "review": "Awesome!!! Now our family can enjoy movies together, the kids can play games, and I can use the fitness apps to workout from home.", "verified": true, "helpfulness": "0/0", "author": "MO Mom"}, {"rating": 4.0, "review": "Still fairly new to me, hoping to replace cable with it to save $ so many apps a Lil bit of buffering from time to time, but all in all I am happy with my purchase, I have been recommending to friends.", "verified": true, "helpfulness": "0/0", "author": "tigerclawz"}, {"rating": 5.0, "review": "Convenient, a value, and I cut the cord!", "verified": true, "helpfulness": "0/0", "author": "J. J."}, {"rating": 5.0, "review": "This is a fantastic little device.  it's speedy and does everything I want it to do.  It's currently plugged into our bedroom TV and we love this thing.  It's way faster than my Roku 2 and even a tiny bit faster than my chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jeff Belfiore"}, {"rating": 5.0, "review": "Great device and it came already to plug and go!", "verified": true, "helpfulness": "0/0", "author": "Gregory"}, {"rating": 5.0, "review": "Wow, thank you Amazon.  This is fantastic and I had no problem setting up. It took me about 10 minutes or less set it up, and what I like is the large selection of movies and shows along with other  entertainment.  Well worth the price in fact I used one of my Amazon Gift Cards to make the purchase.", "verified": true, "helpfulness": "0/0", "author": "STEVE O."}, {"rating": 5.0, "review": "So pleased with product. Just what I needed to stream Netlix& Amazon Prime. Well priced", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the stick. Easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Yes, it is easy to install and works well.  I definitely am glad I got it!", "verified": true, "helpfulness": "0/0", "author": "Jeanamo"}, {"rating": 5.0, "review": "love this.", "verified": true, "helpfulness": "0/0", "author": "Sherri C. Bowman"}]