[{"rating": 5.0, "review": "This is great I would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Sherry Hampton"}, {"rating": 4.0, "review": "Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am Thrilled by the Fire Stick. Not only can I now get Netflix, in another room without it being hard wired, it also has a Ton of other Neat Shows & even a few Free Slot Games to enjoy.  I have already recommended the Stick to several Friends.  If your looking for a Simple WiFi stick, this is the one for you.", "verified": true, "helpfulness": "0/0", "author": "Thomas M. Cox"}, {"rating": 1.0, "review": "Dead on arrival. Didn't work on both TVs I tried it on, with or without power plugged in. Nothing would show up on the screen at all.", "verified": true, "helpfulness": "1/1", "author": "James"}, {"rating": 5.0, "review": "I have enjoyed watching Amazon content on something bigger than my Kindle!  Easy for a non-tech person like me to understand!", "verified": true, "helpfulness": "0/0", "author": "Ictkaren"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Peggy"}, {"rating": 5.0, "review": "I have had the fire stick for 2 to3 weeks.  It was very easy to install and start up.  Remote is easy to operate and I have had no problems with playing the videos.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up and great price", "verified": true, "helpfulness": "0/0", "author": "SciFi Girl"}, {"rating": 4.0, "review": "I am anxious to put this to use. It seems to take alot of broadband width and I have not called my Internet provider to see if we can improve ours- so really to be determined if we can use it as we should- so no comment", "verified": true, "helpfulness": "0/0", "author": "Jean C Smith"}, {"rating": 5.0, "review": "The fire stick rocks, super easy to use, our 5 yr old loves the kids shows on Netflix & can operate the simple remote herself.You can move to different rooms if needed easily as well.", "verified": true, "helpfulness": "0/0", "author": "Super Shopper"}]