[{"rating": 5.0, "review": "I use it all of the time!  It is so nice for my older \"dumb\" TV that I had.  Super easy for anyone to just pick up and use and I have not had any issues with streaming.  I also really liked the app that you can download to your phone.  It is pretty cool to just say what you are looking for and letting the fire stick do the leg work.  It also helps find movies you may not have thought about.  Like if you like a particular actor for example, just say his name and all available movies with him in it will appear.  I also like that if for any reason I want to switch TVs it is simply unplugged from one and plugged into the other and takes up no room!  I might even buy a 2nd one to replace and old DVD player I was using for streaming.", "verified": true, "helpfulness": "0/0", "author": "Wags"}, {"rating": 3.0, "review": "Having trouble connecting to TV's to make it mobile.", "verified": true, "helpfulness": "0/0", "author": "JT"}, {"rating": 3.0, "review": "This will be a gift so I really couldn't say much about it", "verified": true, "helpfulness": "0/2", "author": "karen bierle"}, {"rating": 5.0, "review": "Beyond my expectations!!!", "verified": true, "helpfulness": "0/0", "author": "Renato O."}, {"rating": 4.0, "review": "This is my first experience with video streaming and I found this item to be relatively user friendly.  It really makes sense to purchase this if you have a Prime Membership.", "verified": true, "helpfulness": "0/0", "author": "JWM"}, {"rating": 5.0, "review": "Great for streaming", "verified": true, "helpfulness": "0/0", "author": "henry hon"}, {"rating": 5.0, "review": "Good device", "verified": true, "helpfulness": "0/0", "author": "Arnold Sher"}, {"rating": 5.0, "review": "Works as expected... hope to be further impressed!Update: have had it for over a month now, and still working great. I was able to plug it into the tv import of my xbox one. There are many different options for watching shows and movies. Very impressed.", "verified": true, "helpfulness": "0/0", "author": "Randall W Beals Jr"}, {"rating": 5.0, "review": "Yes", "verified": true, "helpfulness": "0/0", "author": "John S."}, {"rating": 4.0, "review": "One of my best purchases!", "verified": true, "helpfulness": "0/0", "author": "14bjackson"}]