[{"rating": 5.0, "review": "I am very happy that I purchased the Amazon Fire Stick. It is easy to use and provides a variety of entertainment. It was definitely worth it, and affordable.", "verified": true, "helpfulness": "0/0", "author": "D Dukes"}, {"rating": 4.0, "review": "Love the choice it gives us. I set it up myself, I was s surprised!", "verified": true, "helpfulness": "0/0", "author": "MARY F BOGUSH"}, {"rating": 5.0, "review": "Much better option for making your TV a Smart TV.  I didn't realize a power source would be needed for the HTML plug but it was not a problem.  So much easier than buying a new TV to get access to Netflix and Amazon Prime movies.", "verified": true, "helpfulness": "0/0", "author": "Utah CJ"}, {"rating": 5.0, "review": "Freaking amazing.  Completely changed how I watch TV, I am cancelling cable asap", "verified": true, "helpfulness": "0/0", "author": "Thomas"}, {"rating": 5.0, "review": "I own both the fire stick and the fire TV. I love them both. After just setting it up and logging into Netflix to watch a movie, I can't tell the difference between the two devices. I'm not sure why anyone would by the $100 fire TV when this less expensive option does it all.The only thing I can tell for sure is loading time seems to be slightly longer. Is that my internet tonight? Is that Netflix's limited bandwidth on a high volume time? Or is it the device quality itself? I can't tell for sure today.", "verified": true, "helpfulness": "0/0", "author": "Jessica L. Robinson \"JL Robinson\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Kieran goss"}, {"rating": 4.0, "review": "Excellent little device - I recommend it", "verified": true, "helpfulness": "0/0", "author": "Julio Palacio"}, {"rating": 5.0, "review": "Wonderful!  Easy to install and easy to use. With Amazon Prime makes it even better. Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Richard Bonillas"}, {"rating": 3.0, "review": "It was worth a try but I had the same experience as some others where the stick just wasn't powerful enough to connect with our wifi. We wanted to use it in our basement; the route is on the first floor. We have a Fire TV that can connect to our wifi from the basement but the stick could not. I also wasn't trilled about having to plug the stick into a power outlet. I had thought one advantage of the stick was the clean look unencumbered by cords. The cord provided seems rather short - I would have needed an extension for it.", "verified": true, "helpfulness": "0/0", "author": "J. Gallant \"mozart32\""}, {"rating": 5.0, "review": "Very easy to install!", "verified": true, "helpfulness": "0/0", "author": "Tosha S."}]