[{"rating": 2.0, "review": "I really like the concept of the fire stick. It has great apps and the remote works well. The main problem I have is that it is slow. When I watch Netflix/Amazon Prime/etc., my shows get interrupted very frequently due to buffering of the system. I know its not my internet connection because I watch Netflix all the time on my Wii/Playstation and never have a problem at all. The fire stick also shows that it has a strong connection to my WiFi and I have the fire stick plugged in which is supposed to improve connectivity.There are times when the fire stick works great, and there are no \"loading\" issues at all, but the majority of the time, if I am watching a 45 minute TV show, it gets interrupted about every 3-10 minutes (no exaggeration here). After it has to \"load\" so many times, I just get frustrated and end up using my Wii/Playstation instead.I really wanted to like this product because I have been a loyal Amazon Prime customer for a while, but I am just not impressed. I think the concept of the Fire Stick is good, but Amazon has some work to do to improve the devices connectivity.", "verified": true, "helpfulness": "1/1", "author": "Ashley Miller"}, {"rating": 1.0, "review": "While it worked the Amazon Fire Stick was as good as a Roku or Chromecast. The stick burned out after a couple of months of use. First it would display a red screen, and now it doesn't power on. Buy a better quality product (one of the aforementioned products).", "verified": true, "helpfulness": "0/0", "author": "E. Reyes \"Stagnant Passerby\""}, {"rating": 4.0, "review": "The Amazon Fire TV stick is perfect for letting me access all of the perks I get with my Prime Membership.  I was able to watch all of the Amazon streaming shows and movies.  I was also able to watch my Netflix with the Fire TV Stick. Unlike Chromecast, I did not need another device to stream my favorite shows.  However, just like the Chromecast there is a limit to what the Fire TV Stick can do, a smart TV will always be better. The only thing I was not too happy about, was the lack of VUDU as an app. I would like to be able to access my digital copies of purchased movies using my Fire Stick (Please, please make this happen Amazon!).", "verified": true, "helpfulness": "1/1", "author": "Ana L. Horton"}, {"rating": 5.0, "review": "I love my firestick this is the second one that I have ordered. The first one worked so great that I just had to order another one. I just have basic cable now because of the amazon fire stick and think this is the best thing ever. It's small and portable.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really solid product. Been using chromecast for awhile and love it. But this firestick is just better. Love the actual interface and remote control. It allows for easier browsing and has a great and easy to use interface. This is chromecast but on steroids. Haven't used Roku or Apple TV, but honestly can't see myself needing much more than what this product provides as for as a streaming device. My blu ray player as well as my tv have apps that I could use Netflix and pandora and things of that nature on as well, but again, the interface and menu layout on the firestick is much better, smoother, and more enjoyable to use.", "verified": true, "helpfulness": "2/2", "author": "Eric Taylor"}, {"rating": 5.0, "review": "I have an Apple TV, Roku box and now a Fire Stick. This is my favorite of the three because of the interface and X-ray feature. I also like that I don't have to have a box sitting out. I haven't used the voice command yet. For the price and ease of use, I definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "ji973245"}, {"rating": 5.0, "review": "I purchased the fire tv stick on prime day and absolutely love it! The user interface is very well done and easy to launch a show with ease. I really like being able to just hit the enter button to watch the next show, but it's so easy to binge watch though!The only thing that I haven't found yet (it may be there) is an easy way to rate episodes right after watching them. I'd like to see that as a feature so you can rate right after finishing.Love the remote, it is what makes this better than any other streaming device I have owned (Have Western Digital, Chromecast, Visio tv apps, and Visio blu-ray apps)", "verified": true, "helpfulness": "1/1", "author": "ck"}, {"rating": 5.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "David Casey"}, {"rating": 3.0, "review": "Bought for MLB, does not work well", "verified": true, "helpfulness": "0/0", "author": "c-bus directv"}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Ilya Polyakov \"Critic\""}]