[{"rating": 2.0, "review": "The fire tv stick will not connect to internet. The internet signal is strong but the fire stick continually loses connection.", "verified": true, "helpfulness": "0/0", "author": "Carrie M. Hanson"}, {"rating": 5.0, "review": "Great product!  Blows away the competition.  Best part is that it's flexible enough to side load your favorite apps! Better than the other streaming boxes", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love our fire tv stick. Its easy to set up and very responsive. I love that there is a phone app to voice search with which also works effortlessly. The only down side to this is that there is no vudu app and the flixter app is shoddy at best.", "verified": true, "helpfulness": "0/0", "author": "nicki_e"}, {"rating": 5.0, "review": "Works as expected.", "verified": true, "helpfulness": "0/0", "author": "Candice"}, {"rating": 2.0, "review": "Disappointing. Why have a stick that you have to plug in for power? I was trying to avoid having yet another cable. Works fine but really disappointed in needing a power source for this. I would have got something different.", "verified": true, "helpfulness": "0/0", "author": "Indee"}, {"rating": 5.0, "review": "The picture is as good as that which we receive from our cable provider. We only use the content that comes as part of our Amazon Prime membership, but even that provides far more content than we could ever watch.", "verified": true, "helpfulness": "0/0", "author": "Jorge Santiago"}, {"rating": 2.0, "review": "It has a difficult time staying connected to my wifi, so it is constantly freezing, skipping, and restarting. No other device has this issue, not even my apple tv, so I know it's not a wifi/connectivity problem. It only works properly about 50% of the time....", "verified": true, "helpfulness": "0/0", "author": "Emily Ripka"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "joshua j. stender"}, {"rating": 3.0, "review": "I didn't! Receive my fire tv stick yet", "verified": true, "helpfulness": "0/0", "author": "monica fleming"}, {"rating": 5.0, "review": "This is a great product.  I bought it as a gift and they have been using it daily to watch movies and tv show off the Amazon Prime. They also been watching shows/movies some from various other platforms included.  It has a lot of pay-for movies and other movie,tv, gaming app's features.One feature they like is the \"recommendation list\" on the bottom of a movie/tv selection, it is really helpful into finding movies they would of never thought of watching.The fire stick was extremely easy to setup, less than 10 minute to finalized all setup and get started.  The Fire stick platform and selection lay out is unbelievably user friendly and i wish my smart tv platform (which has far less options than the Fire TV stick) was as easy to use and navigate around to all the selections.  A definite game changer in the online video and gaming on non-smart Tv's", "verified": true, "helpfulness": "0/0", "author": "JL"}]