[{"rating": 5.0, "review": "So very cool... I can watch pretty much whatever I want whenever I want and it's easy enough my 4 year old can figure it out.  The ONLY thing that worries me is the remote.  I have it up on a shelf because like my Bose system I'm so afraid this tiny remote is going to get lost somewhere.  So far, the whole thing works well -- I can watch my netflix nice and clear on the big screen (so much quicker and easier than waiting for a playstation to link in with the computer, etc. - NTY)  I love that I can also watch my Amazon Prime movies too!  This was really easy to set up (took about 10 minutes) but anyone can do it!  So far, so good - thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "C. L. Sheehan \"wowgirl1975\""}, {"rating": 1.0, "review": "had to return it, kept loosing connectivity to my UVerse router even though it was a foot away from it.", "verified": true, "helpfulness": "0/0", "author": "L. Tadeo"}, {"rating": 5.0, "review": "No problems setting up!", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 1.0, "review": "Fire stick would not recognize my network. I change to several locations even next to roster. Unfortunately I did my testing long after I could return the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Donald Allen"}, {"rating": 2.0, "review": "After a week we got a blue screen with the text, HDCP unauthorized. Content disabled.  We noticed on line that it is a common problem. Through an series of unplug this and plug in that, we were able to get it to work again. It's very disappointed that we are having a well known reocurring issues with it after one week.", "verified": true, "helpfulness": "0/0", "author": "Debra"}, {"rating": 5.0, "review": "Absolutely love it.  Easy to navigate.  Love love love.", "verified": true, "helpfulness": "0/0", "author": "elizabeth ferrell"}, {"rating": 5.0, "review": "Great quick streaming device.", "verified": true, "helpfulness": "0/0", "author": "Sherra"}, {"rating": 5.0, "review": "The fire stick was exactly as described. I have thoroughly enjoyed having it for convenience. Before having the fire stick I used hdmiCable to plug into the tablet. Having the fire stick makes things much less complicated.", "verified": true, "helpfulness": "0/0", "author": "Tommie"}, {"rating": 5.0, "review": "Love it. Easy to use", "verified": true, "helpfulness": "0/0", "author": "Michele T. Pluta \"Michele\""}, {"rating": 5.0, "review": "It is simply outstanding.  All you need is a HDMI port.  Do not need a SMartv, it just works!  I love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Deacon Tom\""}]