[{"rating": 5.0, "review": "Easy to configure. Easy to navigate. Great addition to my Prime Membership!", "verified": true, "helpfulness": "0/0", "author": "Gypsy"}, {"rating": 5.0, "review": "Easy setup/install. Very FAST! Now we can use our Amazon Prime membership for something besides free &/or faster shipping.", "verified": true, "helpfulness": "0/0", "author": "JMO44"}, {"rating": 5.0, "review": "Easy to set up.  Works great!", "verified": true, "helpfulness": "0/0", "author": "uprivergal"}, {"rating": 5.0, "review": "This thing is Amazing. As an owner of both a Roku and Apple TV , I can say with some knowledge , Well Done Jeff !", "verified": true, "helpfulness": "0/0", "author": "Buddy L"}, {"rating": 5.0, "review": "Installed easily, found my wi-fi and connected, snappy performance, all good. It even was able to power from one of the USB ports on the TV. No need to find a wall outlet.The Android app works great as a remote control.", "verified": true, "helpfulness": "0/0", "author": "Rob B,"}, {"rating": 5.0, "review": "Blows Chromecast away!  Easy set up, easy navigation, great selection.", "verified": true, "helpfulness": "0/0", "author": "DJBRyce"}, {"rating": 2.0, "review": "I've only had this for a few days so I can't do a thorough review yet but so far I am not that impressed.  I've been using the Apple TV for awhile and bought the Fire stick to test it out in hopes of it being a hit so I could buy a few more as Christmas gifts.  The price is great and the remote is slightly bigger than the Apple TV's remote so it's easier to use but the interface is harder to navigate through.", "verified": true, "helpfulness": "0/0", "author": "Jean"}, {"rating": 5.0, "review": "Great product better than the chromecast love it", "verified": true, "helpfulness": "0/0", "author": "JOSE CABA"}, {"rating": 5.0, "review": "Super easy set up!  Bought this to replace a Roku and am so happy I did.  I recently tried a chrome cast and the set up on that was terrible.  This fire stick was very easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "Jenn E"}, {"rating": 3.0, "review": "An interesting item, but competing in a market already loaded with many other choices for the same purpose. Got at the intro price so no real complaints about the quality and results. Seems like a good option to take along when traveling. Will be trying out on some upcoming trips.", "verified": true, "helpfulness": "0/0", "author": "E. C. Fenn \"Gizmo nut\""}]