[{"rating": 4.0, "review": "How do you disable auto play of the next TV episode?", "verified": true, "helpfulness": "0/0", "author": "Bryan \"originalbryan\""}, {"rating": 4.0, "review": "Incredibly easy setup. Fast processor and downloads. Very good HD picture quality.Two minor knocks. The interface is intuitive but not quite the equal of Apple TV. Requires user to navigate through too many unnecessary categories. Also, the power adapter is illogically designed. It is too large with the chord attachment located on the side. Some room for Improvement", "verified": true, "helpfulness": "0/0", "author": "Dadhertz"}, {"rating": 5.0, "review": "Way better than my Chromecast. Easy to setup. Even easier for my Dad to use", "verified": true, "helpfulness": "0/0", "author": "seanlikespie"}, {"rating": 5.0, "review": "I loved it and found it to be very easy to use! Get one!", "verified": true, "helpfulness": "0/0", "author": "Stacy N StClair"}, {"rating": 5.0, "review": "I. LOVE. IT!!!!! :D", "verified": true, "helpfulness": "0/0", "author": "Curtis Brown \"Curtis Brown\""}, {"rating": 5.0, "review": "From an owner of the full size Fire TV.  I got this one for a second bedroom expecting the same interface and same ease of use in a cheaper smaller package.  That's exactly what it delivers.  I am running the power for mine off the USB \"service\" port on my TV with no issues at all.  The interface seems to be the same as the Fire HD full size box.  The only difference is the remote so far.  I did not opt for the more expensive microphone remote.  Otherwise it's just fine.  What's a big plus, is they give you a small 3-4\" HDMI \"dongle\" cable in case you need it.  My TV needs it as the back has low clearance.  With the dongle I can bend the stick to hang down flush with the back of the TV.  Response and speed seem OK, I haven't had enough time with it to say if it's much different than the Fire TV.  Video quality was excellent on both Netflix and Amazon Prime videos.  It synced up to my \"N\" wireless network with no issues at all.  Truly a plug-n-play install.  One note, the default video resolution was set to 720p on my TV.  I bumped it up to 1080p 60hz with no problem.  Just keep this in mind if your TV is 1080p, you might have to set this manually.A really nice feature, is that all of the Apps that I had downloaded on my existing Fire TV were shown and click able .  When clicked they downloaded and installed on this device.  Very convenient!This TV used to have a ChromeCast on it, which while nice, lacked a proper remote.  I found it much easier to control the Fire TV with the nice small remote rather than having to mess around with my tablet or smart phone.  Also the Fire TVs have a much wider app selection than what ChromeCast currently supports.The Fire TV Smartphone app is nice, if you would like to use a \"keyboard\" to perform searches.  Controlling the screen with slide / touch / tap is neat, but I personally prefer the remote's hard buttons.", "verified": true, "helpfulness": "0/1", "author": "SJGreg"}, {"rating": 5.0, "review": "Amazing. was tired of streaming netflix on my Nintendo Wii this fire sticks offer HD streaming everything so amazing and this fun stupid little games on it too also TwitchTV is nice and plex need i say more chromecast is good but not as good as this", "verified": true, "helpfulness": "0/0", "author": "Clayton Collins"}, {"rating": 5.0, "review": "I love Amazon Fire TV Stick better than Roku!!", "verified": true, "helpfulness": "0/0", "author": "Igi M."}, {"rating": 1.0, "review": "The sound and picture doesn't match. It's very annoying.", "verified": false, "helpfulness": "1/2", "author": "Alex T"}, {"rating": 1.0, "review": "I am employed in computer technology, and have set up at least a dozen Roku and Chromecast devices. The Amazon FireTV Stick has been impossible to use. It did not have my Amazon Prime account preloaded (as I ordered it directly from Amazon), and trying to put in my true credentials (note that I am able to correctly log on to my Amazon account here) goes in an endless prompt where I have tried every possible combination. Troubleshooting by changing my account password and wireless networks have been done, I've lost hours to just get started using it.", "verified": true, "helpfulness": "2/4", "author": "IBMMuseum"}]