[{"rating": 5.0, "review": "Bought two for the kids & In-laws and they love it!", "verified": true, "helpfulness": "0/0", "author": "Sarley"}, {"rating": 3.0, "review": "Am still undecided on the stick. Have been a Roku user and that's terrific. Amazon has a hard time filling those shoes.", "verified": true, "helpfulness": "0/0", "author": "BBC Lover"}, {"rating": 1.0, "review": "Even the TV ads don't show you that there is a corded AC adapter that must plug into the wall and attach to the USB insert.  My 60\" TV hangs on the wall with the wires behind the wall.  It is all set.  The TV is awkward and heavy to lift when your arms are spread that far out.  I don't want to mess with my TV now it is mounted.  Watch the commercial and it says just plug in the USB insert and away you go.  NOT SO!!!  It was a bear running the wire behind the wall the first time and I don't want to do it again.  I also doubt that the cord was long enough for my needs.  What I can't understand is that most USB's get their power from the TV or computer, like a mouse or keyboard does.  Why didn't they engineer this that way?", "verified": true, "helpfulness": "2/4", "author": "destiny_driven"}, {"rating": 1.0, "review": "After a few days of working, the Fire Stick stopped functioning.  I have tried repeated To get Amazon to either fix the problem or replace the product.  They have done neither.  They say keep saying \"wait 24-48 hours\" over and over again.I do not recommend buying this product.  It does not work!  It is a waste of your money.", "verified": true, "helpfulness": "1/2", "author": "E. Rothman"}, {"rating": 5.0, "review": "This is such a great thing to watch so many things.Just incredible is all i can say.", "verified": true, "helpfulness": "0/0", "author": "scubadiver1963"}, {"rating": 2.0, "review": "Poorly designed UI for app navigation. Routinely droped network (my router was 18\" away and signal strength was very strong). HDCP unauthorized message was displayed near daily. Stuttered when using Netflix. Image froze many times when using HuluPlus. Amazon is capable of so much more - this thing felt like a rush job.  I only paid $19 and didn't feel it was worth that so I returned my Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "CS"}, {"rating": 5.0, "review": "I love the fire stick! So easy to set up and use!!!!", "verified": true, "helpfulness": "0/0", "author": "Jeri A."}, {"rating": 5.0, "review": "Much faster than my Roku stick. Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Robert E. Clack \"Author\""}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "gamer231232"}, {"rating": 5.0, "review": "Love it! Makes streaming so easy!", "verified": true, "helpfulness": "0/0", "author": "KGHarr"}]