[{"rating": 5.0, "review": "The Fire Stick is quick and easy to use. Has everything I need for my kids.  The only improvement would be allowing the device to piggyback off of the power from the TV rather than plugging it in.  Otherwise I love it..", "verified": true, "helpfulness": "0/0", "author": "Doc"}, {"rating": 4.0, "review": "Great lil brother to the fire tv. Out does its competitor by far, packs a big punch for its size. I have to say I was pleased with its performance and from here I can only see great things to come from the Fire TV family.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Honestly, i was skeptic about this. I had heard some bad things about fire TV and of course everyone knows the fire phone. But! We got our fire stick last night, plugged it into our TV and got it running smoothly. It has a great youtube application so that i can watch Lets plays from the Achievement hunters, Of course it has netflix, and since im a prime member i got the prime library plus all the tv shows and movies ive bought in the past. Whats not to love about this? Even better since it was announced i got it for 20 bucks with my prime membership!!! I finally have something i can play on my TV without alot of connections and crap. it runs smoothly, easy to navigate. + i can turn my kindles and phone into a remote!!!! I downloaded the fire TV stick application and its as simple as pressing a button to connect to it!!!to be quite honest this is a great product and i highly recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "Arsenio M."}, {"rating": 3.0, "review": "I'm not writing a review, just wanna know if this stick work in my region, I live in El Salvador (Central America) and I already had a Chromecast and works great, but this seems to be a better choice if I can use it in my country and without having Amazon Prime (just for Netflix, Youtube, Twitch and Spotify).So, will this stick work in my country?", "verified": false, "helpfulness": "0/1", "author": "Roberto Carlos Campos Lopez"}, {"rating": 5.0, "review": "I like it gives me the availability to take and use my prime membership I would recommend it to anybody friends family easy to set up", "verified": true, "helpfulness": "0/0", "author": "Thomas C  Lamendola"}, {"rating": 3.0, "review": "Two stars less because:1. very difficult to open the remote to replace battery, ended up scratching it.2. It doesn't work with iPAD for streaming like Chromecast. Not sure whose dumb idea was it, when millions of iPads are being used in US.Otherwise, it is very good.", "verified": true, "helpfulness": "0/0", "author": "A. Reddy \"Khiladi\""}, {"rating": 5.0, "review": "Easier to use and much more versatile than my old Roku.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Wilson"}, {"rating": 5.0, "review": "Picture quality is amazing", "verified": true, "helpfulness": "0/0", "author": "johnnie rhodes"}, {"rating": 5.0, "review": "Good so far but restrictive in terms of apps available in comparision to google play store. It works for me as i am a prime member", "verified": true, "helpfulness": "0/0", "author": "MOHIT D."}, {"rating": 1.0, "review": "Minmy fire stick is not working. It says I have very good internet reception but will not download anything.", "verified": true, "helpfulness": "0/1", "author": "Dave"}]