[{"rating": 1.0, "review": "stopped workig after one day. will not connect to the interet", "verified": true, "helpfulness": "1/1", "author": "Charlotte Marie Mone"}, {"rating": 5.0, "review": "I was already a prime member and I love this product.  Way better than Roku, very nice and applicable applications.  So worth the money!", "verified": true, "helpfulness": "0/0", "author": "Bill Nelson"}, {"rating": 3.0, "review": "It doesn't stream from your computer.  That's a bummer. And while it works, when it doesn't work it doesn't work. It flips around apps without even touching it.  It's cool. It's convenient, better than chromecast but apple tv is still best.", "verified": true, "helpfulness": "0/0", "author": "Desiree"}, {"rating": 5.0, "review": "It's very niceit met all my expectations Johne thing I believe might make it better if it could mirror your phoned", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This is Fun! I can watch videos from my Prime membership, plus Netflix and Hulu. Great product for the price.", "verified": true, "helpfulness": "0/0", "author": "Gwendolyn Moore"}, {"rating": 3.0, "review": "It works a good for Netflix,Hulu and YouTube. there is no way to have an Internet brower. I expected it to be more app wide based as well. The stick is decent.", "verified": true, "helpfulness": "0/0", "author": "Rachel Gallardo"}, {"rating": 5.0, "review": "Perfect solution for our streaming needs. The fire stick does so much more than I thought it would. I use Netflix, Amazon prime movies,  music, view  my photos as slideshow, and listen to spotify. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 4.0, "review": "Amazon Fire TV Stick is great little toy to turn your not so smart tv into a smart tv. Well made and functionality is very good. Easy to navigate and very intuitive menus. It is pretty standard in device features as the PS3, PS4, Apple TV, Roku, smart DVD players, etc. but the interface is one of the better ones. So, it is totally necessary if you have one of those devices as the features will overlap with those devices. However, Amazon Fire Stick does come with some strings attached. Not all features are compatible with all devices (phones, tablets) and there are limits if not fully integrated into the Amazon family. I bought this purely for the mirroring of your device to the tv screen, but found out my Lenovo Yoga 2 tablet is not compatible with the machine. However, my Samsung S4 works with mirroring screen to the tv but it is not what I was looking for.Here are some key points. Amazon Fire TV stick will be great if...............1. You are member of Amazon Prime.2. You have a compatible device (phones, tablets). Amazon, Samsung, LG, some others they list as compatible.If you are not fully integrated into the Amazon family you will be somewhat disappointed as you will be limited in some of the features. The customer service were very helpful in trying to help so support is decent.", "verified": true, "helpfulness": "0/0", "author": "Benjamin K. Lee"}, {"rating": 5.0, "review": "Easy to use, great to have both Netflix and Prime in one location!  Also love the ability to move to other tv's", "verified": true, "helpfulness": "0/0", "author": "stephanie friend"}, {"rating": 5.0, "review": "great item, able to watch my shows, I just ordered another for basement tv", "verified": true, "helpfulness": "0/0", "author": "Big john"}]