[{"rating": 5.0, "review": "This is amazing!  I highly recommend it.  You don't have to get up and put a disc in.  You don't have to remember to record a movie you want to watch and you definitely don't have to put up with commercials and poor editing.  You can start to watch a movie or show and finish watching it later.  Streaming is the way to go.  You're not restricted to which discs came in the mail, what movies the channels are playing (always the same 4 over and over again) or what time they start.", "verified": true, "helpfulness": "0/0", "author": "Leilani Phillips \"Towergypsy\""}, {"rating": 2.0, "review": "Gave the Fire Stick 2 stars because setup and use (navigating menus) of the stick is very easy and straight forward.  Other than that its a disappointment to use. My TV and hence the Stick, is within 10 feet of my router and my internet connection is cable. While trying to view some trailers and watch a program the Fire Stick constantly had to buffer content. It did this about every 30 seconds or so and then began to pop up a message that my connection was too slow. To test the connection I streamed the same content through my Ps3 and iPad with no problems. Being this is the first generation of the stick it may have some issues that need to be corrected, so I may try one again in the future.", "verified": true, "helpfulness": "1/2", "author": "Ed A"}, {"rating": 5.0, "review": "Works great, I can move it from room to room, to different TV's and never have to worry about setting it up on each individual one. I can even take it with me when I travel, which is not as easy with my Roku, which is quite a bit bigger.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this product!  Works vastly better than connecting your Kindle via mirroring (Kindle HDX verison) or mini-HDMI cable (previous Kindle version).  It's easy to install and use and is reasonably priced.  It makes watching multi-sourced (Amazon, Netflix, Hulu, etc) TV and movies much more convenient.  The only downside for me is that it can't be powered by USB.  You need to plug it into an outlet.", "verified": true, "helpfulness": "0/0", "author": "LilyBook"}, {"rating": 4.0, "review": "I pre-ordered this item when it was first offered back in October. I have had and have used a Roku for several years, but I have to say that Amazon has surpassed Roku with the clean interface of Fire TV. The Fire TV Stick is great, but it just makes me want to buy the full version.", "verified": true, "helpfulness": "0/0", "author": "Jonathon \"jpopphan\""}, {"rating": 4.0, "review": "I like the performance of the Stick. I have had Roku player for few years, and it sucks from time to time because of performance issues.Only contentious point I have about the Fire TV Stick is that it doesn't allow you to have all the video apps that's there in Google Play store. And not all those apps are available in Amazon store either. For e.g. Dishworld TV, Browser, etc.", "verified": true, "helpfulness": "0/0", "author": "Shiva K."}, {"rating": 3.0, "review": "Would be perfect if the identical YouTube.com app on my Kindle HDX tablet and Fire TV stick worked properly.  The mirroring results are unwatchable---constantly jumping. For viewing Amazon Prime content it is great, though entering a PIN every time for viewing Prime videos is a minor nuisance. For YouTube content I will continue using my iPhone / Roku HD combo until Amazon works the bugs out.", "verified": true, "helpfulness": "0/0", "author": "T. Oertel"}, {"rating": 2.0, "review": "Difficult to configure. Required 3 levels of accounts, passwords, and configurations (wifi network, Amazon, & Netflix).Once set up, it does give nice access to Netflix from any TV in the house. Everything else is simply a way to force you to buy Amazon Prime.", "verified": false, "helpfulness": "0/1", "author": "stuart brown"}, {"rating": 5.0, "review": "LOVE it and easy to use!!!", "verified": true, "helpfulness": "0/0", "author": "William Kelley"}, {"rating": 5.0, "review": "Amazing. Better than Chromecast and just as good as my Roku 3! I can rant and rave about these all day!", "verified": true, "helpfulness": "0/0", "author": "Kyle W"}]