[{"rating": 5.0, "review": "At $19 this was a very good deal. I'm not sure if I would pay the full price for it.Pros:  It is a way to watch Netflix and Amazon prime without having to deal with a computer at all. The remote control is very tiny and light weight.  At $19 it's definitely worth what it gives you.Cons:  The controls are not very convenient.  There are not many buttons on the remote control and just about everything requires that you get out of whatever you're watching in order to reach the main menu on the screen because that is the only location for a lot of stuff.  I also do not like the fact that there is no off button and that the sleep button requires very many steps to reach.", "verified": true, "helpfulness": "2/2", "author": "TV watcher"}, {"rating": 5.0, "review": "Received my firetv stick today and must say it is awesome.. First, let me mention that I am the owner of apple TV, roku 3, logitec revue (Old google TV), and the regular fire TV..  The regular FIRE TV replaced my revue on my main television.. I loved it so much and enjoy it much more than my ROKU that I purchased this fire tv stick as a replacement for my roku in my bed room..First, Fire TV (Both the stick and the regular) don't have nearly the \"Channels\" that roku has BUT i honeslty only used 3 or 4 channels on my roku.. Netflix, Amazon Instant video, Hulu, and crackle..  Fire tv has all those channels and does them ALL including netflix, much better than the roku..  PLUS fire tv can play games..Now, let me mention that the stick doesn't play games nearly as well as the regular fire tv, but this was to be expected.. It has a lot less power than the regular fire TV but the stick plays games like sonic amazingly!!!Compared to the fire TV, I would still rather have a fire TV, regular version, for my main TV bc it is much more powerful when it comes to games and even other things, but for a bedroom or for a TV that you don't expect to play games on, the TV Stick is amazing!!It integrates very very well with Amazon instant video and does apps like netflix very well. Still ASAP is amazing on Amazon videos and I wish netflix would be allowed to use ASAP sometime in the future!! Also, just like my regular fire TV, the streaming quality is much much greater than ROKU.. Why?? I really have no idea but the roku never really gets to \"HD\" quality with my internet connection and the fire tv, both my new stick and my regular fire TV always get to \"HD\" quality.. With ASAP on amazon instant video it STARTS in \"HD\" and stays there...  Netflix also has improved streaming quality and again I have no idea why unless the wifi is just better in these than rokus.. Same internet connection!Keep in mind these devices do need power BUT my TV has a USB port that I never use so I just power mine from the TV's USB port.. Works fine!!", "verified": true, "helpfulness": "2/2", "author": "Devin Stephens (I Review, email in Profile)"}, {"rating": 2.0, "review": "Netflix would not play audio. No Plex Pass app. No WWE Network.I'm only giving it 2 star for Amazon Prime. If this is all I wanted to use it for, it would be worth purchasing.However, it works nowhere near as well as my Roku so I cannot recommend anyone spending money on the Fire TV Stick unless you only want to use it with Amazon Prime.", "verified": true, "helpfulness": "0/2", "author": "Mike Sanders"}, {"rating": 5.0, "review": "Outstanding device. I actually prefer this to the Chromecast, which I also own.", "verified": true, "helpfulness": "0/0", "author": "C. J. Peter \"writer\""}, {"rating": 2.0, "review": "You have to plug in the stick to the wall outlet.The electric cord is never shown in the ads.I thought it was running off of the tv power.I do not want one more thing to plug in to the wall!", "verified": true, "helpfulness": "0/2", "author": "M Brooks"}, {"rating": 4.0, "review": "It works and gets several channels, but it doesn't beat the flexibility of my Roku.  I almost returned it, but it was worth keeping as I was able to get it at the discount price. Not bad - I can access my Amazon Prime and Netflix easily.  However, the remote interface is a pain for typing in IDs and passwords, and it has a LOT of trouble mirroring my Amazon Kindle HDX (my Roku does this easily).", "verified": true, "helpfulness": "3/5", "author": "S. Suarez"}, {"rating": 5.0, "review": "I am doing a lot of research for cutting the cord. I own 2 Apple TV's, a Roku 2, a Samsung Smart TV, and a Western Digital WD TV. I just bought a Google Chromecast this week and received my new Amazon Fire Stick today (I ordered it on a whim back in October for $19.95 on a Prime Special Offer). I must say that the Fire Stick was the best installation yet. It started with a video and then went to the setup. Boy, was it easy. The Apple TV was also very easy (I'm a Mac person from way back, so I appreciate most things Apple). If Apple and Amazon merged, they would own the world. They both seem to be stressing ease of use. I was unable to get the Google Chromecast Roku App to work with my Apple Routers, but it finally connected with my Comcast wireless router. When I tried to do HuluPlus playback, it was terrible. Not watchable in any way because of the constant pause for downloading. I have Comcast with 50Mb+ download speeds, so that was not the problem. I use my Apple TV and my Samsung Smart TV to stream video with no glitches. I feel the problem was probably with the Roku 2, which is several years old. I gave up and never tried to get it to work using my iPhone as a remote. I may try again later before I return it. The Fire Stick has it's own remote and works flawlessly. I give it 5 stars and would recommend it to anyone (if you have Apple TV, you can't stream Amazon or vice versa, so you should get both).I have added HuluPlus, Netflix, Vevo and several other apps and they work fine. I may update this after a few weeks of use.", "verified": true, "helpfulness": "3/3", "author": "Jim Melton"}, {"rating": 5.0, "review": "I ordered this on the special for $19.99 - expected delivery was January, it arrived today! Superb!Setup - VERY simple - plug into the wall, plug into the TV, batteries into the remote and follow the instructions.Connect to the wifi and off you go!Very nice introductory video starts playing right away - great resolution and easy instructionsIf you are familiar with Apple TV - this will make a lot of sense - the remote is FAR more user friendly and not a lot larger than the apple TV remote.Content - AWESOME - as a Prime member, there is a HUGE amount of content both audio and video available for no extra cost. Truly impressive!Easy interface, simple watchlist setup, what more could you want?I am VERY impressed - even at the current price a steal! Get this!", "verified": true, "helpfulness": "1/1", "author": "James Ridgway"}, {"rating": 5.0, "review": "What's not to like? It is geared for amazon use.", "verified": true, "helpfulness": "0/0", "author": "Lisa Kennedy \"lovin'Circ\""}, {"rating": 5.0, "review": "This is the beast streaming device I've ever had!  It is a must if you are an amazon prime member.... And if you're not am amazon prime member, you should be!  It the BEST THING EVER.  Back to the device-- Shipped a lot earlier than expected, had everything set up in about 2 minutes, and we were streaming :).  Buying more for gifts for my other prime friends as we speak.", "verified": true, "helpfulness": "0/0", "author": "Jessicam621"}]