[{"rating": 5.0, "review": "Cheap and easy way to access multiple streaming sites. Easy setup.", "verified": true, "helpfulness": "0/0", "author": "Carl Zitofsky"}, {"rating": 5.0, "review": "Works quite well.", "verified": true, "helpfulness": "0/0", "author": "CDP52"}, {"rating": 5.0, "review": "I absolutely love it!  It works great with my Kindle Fire tablet too.  Using it with Amazon Prime gives me easy access to a huge library of movies while maximizing my subscription as well as enabling Netflix streaming. Definitely worth having.", "verified": true, "helpfulness": "0/0", "author": "Contessa Borgia"}, {"rating": 5.0, "review": "I can't believe this item is 39 dollars well worth the money works perfectly and it portable  Look no further for streaming sticks this is the one. Also downloading the app makes it even better  No need to but the 99 dollar streaming stick the app does what the more expensive one does", "verified": true, "helpfulness": "0/0", "author": "Thevee"}, {"rating": 5.0, "review": "So easy to set up and use! Loving it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It's great to have all of your choices in one place. But you still have to pay for each of the movie platforms. You would think paying this much for this item, all the different movie platforms would be included. Maybe for at least a year to see which ones you liked. Then it's up to us to continue anything we enjoyed.", "verified": true, "helpfulness": "0/0", "author": "Tom Schindler"}, {"rating": 5.0, "review": "I absolutely love it. I bought a fire tv for the family room & a fire stick for the bedroom. Here are the minor differences -  both come with a remote but the fire tv remote has voice activated controls. No worry because there is an smartphone app that gives the same control for the fire stick.  If running through a DVR I'm guessing you need the fire tv because you use an Ethernet cable to run through it and hdmi cable to connect it all.  I've had to reboot the stick twice but it was simple, especially with the prompt 24 hour amazon service. I love that I can stream my amazon prime music playlists & watch videos I've uploaded to my YouTube account. This is a fantastic device.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Fit-n-2012"}, {"rating": 5.0, "review": "Great - Just Great. I use this and google chromecast on all of my non smart TVs.", "verified": true, "helpfulness": "0/0", "author": "Gerald Pottier"}, {"rating": 5.0, "review": "Awesome. Bye cable.", "verified": true, "helpfulness": "0/0", "author": "M. Oum"}, {"rating": 5.0, "review": "Better than cable! So convenient!", "verified": true, "helpfulness": "0/0", "author": "Marcus"}]