[{"rating": 5.0, "review": "Not a bad product at all. The only thing I wish it had was voice recognition. I would recommend to my family and friends.", "verified": true, "helpfulness": "0/0", "author": "Toad"}, {"rating": 5.0, "review": "Best invention ever, it has so much to offer. Plus, it's so simple to use. I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Kathleen Mitchell"}, {"rating": 5.0, "review": "Easy set up and user friendly.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Do u have to have wireless for this.", "verified": false, "helpfulness": "0/0", "author": "loretta clark"}, {"rating": 5.0, "review": "Great acquisition!!! It is probably the most cheap streaming device which allows me to use my Amazon Instant Video and my Netflix. I have been using it for a week and the quality is superb.", "verified": true, "helpfulness": "0/0", "author": "Jose L Vara"}, {"rating": 1.0, "review": "Ok plug in stick to tv,,,,, then into the wall(I don't think anybody mentioned that in the commercials).  Starts up easy enough.  Log in to prime account ok.  Instructional video on how to use remote and how to plug in the stick(useless).  Lets watch a show on Amazon prime....stuttering loading...stick is giving me the option to do something else instead.  No, I am watching this show.  It stutters for a couple more minutes then completes whatever buffering procedure and we finish watching the show just fine.  My xbox 360 does this alot smoother.Ok lets try something else...  Lets mirror my computer (win 8) to the tv.  that sounds awesome.  Attempting to connect...  goes on for 20 minutes.  Lets do some research....  Ok, noone can do this....  maybe at some later date but not now....  sigh.Ok lets try something else...  I have a kindle hd  lets try mirroring that....  Nope...  HDX or Kindle phone only....  Damn....Ok lets try something else....  I will use my kindle as a remote.. there is an app and everything  should be easy.  Connecting....success!  Ok lets swipe through the menu.....why isn't it working.....ok no swiping..... to move the menu right, drag finger left to right.  Why is this the opposite of the kindle menu?!At this point I come to the realization that I would only use this device on my secondary tv and rarely at that.  I have a small brick.  At least until some software gets updated.", "verified": true, "helpfulness": "0/1", "author": "ShaggyLa13"}, {"rating": 4.0, "review": "This has been an enjoyable purchase, the only reason why I gave it 4 stars and not 5 is due to the fact that it seems to not connect to a wireless connection very well at times. Often my program I'm watching or my music I am listening to pauses and has to load. Could be my router but all of my other wireless devices have no issue.", "verified": true, "helpfulness": "0/0", "author": "Melissa Mayfield"}, {"rating": 5.0, "review": "very easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Easy set up and lots programs to choose from. Very good price.", "verified": true, "helpfulness": "0/0", "author": "Jeff H."}, {"rating": 4.0, "review": "the fire TV stick remains warm when we are not using it.", "verified": true, "helpfulness": "0/0", "author": "Lanny Anderson"}]