[{"rating": 5.0, "review": "It's amazing. I haven't had any problems with it. Setup was as simple as it gets. Thanks for the low price. I recommend this to any person wanting a good HDMI TV stick.", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 5.0, "review": "My son loved it for his birthday. Unlimited magazines and great shows.", "verified": true, "helpfulness": "0/0", "author": "Do Da \"West1\""}, {"rating": 2.0, "review": "I bought my Amazon Firestick on February 7th and a couple of days ago it just stopped working all together. I've only had it for 4 months. :(  I love it but am afraid to buy another one.", "verified": true, "helpfulness": "0/0", "author": "Nichole Knox"}, {"rating": 5.0, "review": "Great item for wireless Netflix capabilities.", "verified": true, "helpfulness": "0/0", "author": "shannon layne"}, {"rating": 4.0, "review": "Working well so far.  We were using the chrome cast before but this is nice to just have everything right on the stick.  We have cut the cord from cable and are saving a ton.  Right now we are using this w Netflix and Sling TV and also discovered Crackle.", "verified": true, "helpfulness": "0/0", "author": "Christina Nelson"}, {"rating": 2.0, "review": "You look through all these specs and you think, \"Well yeah, this is the best choice?\" Right? That's what I thought.Here's the deal: the stick is slick as hell, it plugs right in and runs automatically with seemingly little problems until you get the first buffering signal and you think, \"What's the deal? My wifi's working fine.\"Then by the 10,000th time of a complete inability to find the wifi signal, it's bloody unforgivable. There is no reason why the stick might be unable to find the signal since the times it can, the signal strength is, \"Very Strong.\" It's not too far away from the router and all my other wireless devices have 5 bars of signal from where the TV sits. This problem is not unique to me: http://www.amazon.com/forum/kindle?_encoding=UTF8&cdForum;=Fx1D7SY3BVSESG&cdThread;=Tx3NZOXPD7O278JIt's clearly a problem with the stick itself and because of it, I'm going to try my luck with one of the other options with \"lesser\" specs.", "verified": false, "helpfulness": "0/0", "author": "Paul Heller \"Paul\""}, {"rating": 5.0, "review": "Purchased this so I could watch Netflix on my TV  It was simple to install and so far has been working well.  Remote easy to use.", "verified": true, "helpfulness": "0/0", "author": "B. SOTTILE"}, {"rating": 3.0, "review": "I bought the Fire Stick to replace my Wii for watching Netflix. Unfortunately, Netflix streams very slowly on the Fire Stick.  The buffering was so bad that I disconnected the Fire Stick and went back to using the Wii to watch Netflix.", "verified": true, "helpfulness": "0/0", "author": "James Banks"}, {"rating": 5.0, "review": "We love this, or tv isn't one of those smart tvs but this makes watching all our favorites so easy", "verified": true, "helpfulness": "0/0", "author": "felicia mom to 4"}, {"rating": 5.0, "review": "EXCELLENT", "verified": true, "helpfulness": "0/0", "author": "JIM ANDERSON"}]