[{"rating": 5.0, "review": "It works very well and love the movies and shows .", "verified": true, "helpfulness": "0/0", "author": "WATCH COLLECTOR"}, {"rating": 3.0, "review": "Still trying to figure out which app will allow me to stream prime on my tablet.", "verified": true, "helpfulness": "0/0", "author": "Rose-Mary Bottom"}, {"rating": 5.0, "review": "I've ran out of TVs around my house to buy these for, if that tells you how much I like them. I have a Plex server in house and Plex loaded on the stick. With Amazon, Netflix, Youtube, and Plex there isn't ever a reason not to be able to find something to watch.", "verified": true, "helpfulness": "0/0", "author": "Stacy"}, {"rating": 5.0, "review": "Found the \"Firer\" to be easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Zockie"}, {"rating": 5.0, "review": "Great product, better than what I expected. Apps are working fine, just $40 made my TV smart + some games.", "verified": true, "helpfulness": "0/0", "author": "Shantanu Dey"}, {"rating": 4.0, "review": "this device works pretty well but the remote is a little awkward as you are trying to press an outer ring and press the middle instead. I couldn't figure out how to use the youtube even though it claims to be able to display their content.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Easy to install and use. I can watch and share all the movies from Amazon Prime on my TV. Nothing to complain.", "verified": true, "helpfulness": "0/0", "author": "Spartan"}, {"rating": 4.0, "review": "its very good product ...easy to use plug and play ... however ut would be awsome if it had a qwerty keyboard maybe in the back of the control to make the typing easier... other than that great product. apple excuse me .... coming through...it would be nice to mirror from ios or osx ...", "verified": true, "helpfulness": "0/0", "author": "cejalive"}, {"rating": 5.0, "review": "This is a no hassle device.. I only plugged it into my TV and within 2 minutes I was watching my Netflix shows.  I will be ordering 2 more for my bedrooms.. Great price and great product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have ridden myself of the annoying cable bill with this single purchase! I LOVE that my favorite shows are at the touch of a button now and so efficiently delivered to my TV with the Amazon Fire Stick!! Quick and simple to install and has been working fabulously for the past 3 weeks...not a single glitch since I purchased it!! So happy with this purchase!", "verified": true, "helpfulness": "1/1", "author": "Sarrah"}]