[{"rating": 1.0, "review": "Not happy that at 7:45 AM there are no Fire sticks for sale.  C'mon. This prime day starting to sound a bit gimmicky.", "verified": true, "helpfulness": "10/14", "author": "Jose T."}, {"rating": 1.0, "review": "I wanted to love it...I was so eager...The GUI looks very nice...when its up.The search function is not as user friendly.The real meat of the crying shame that this is...no apps work on it.I bought back in October last year when they were offering it for 19.  had Amazon set it up.  Left it in the box until June this year.  Spent 6 hours trying to get it to work...first it couldn't see the wireless internet...that was fun.  Then it saw the internet but not consistently, it would come up, stay up long enough to click on the home screen or netflix, go down...you check the signal strength, still 4 to 5 bars,  but no network.  Netflix does not come up at all.  I have hunted forums, deleted the app, added the app, nothing works.  Amazon says it is nothing they can fix.  Finally we went back to the apple tv.Last week, decided to fuss with it again...still useless.  Can't even watch amazon shows on it.  When I can get an amazon show up...it goes for 10 seconds before having to buffer again.  We changed it over to another TV that was next to the wireless router with the same results.Really disappointed.", "verified": true, "helpfulness": "1/1", "author": "Alex White"}, {"rating": 1.0, "review": "Dissapointing! 16 hours left in this lightening deal and the waitlist is full? What is a waitlist? Why is amazon promoting prime day all over the place and then the good deals are sold out right away. Amazon this is disappointing. What good is better deals than black friday if you limit the quantities?", "verified": false, "helpfulness": "16/19", "author": "Timothy J. Hower \"JeepCachr\""}, {"rating": 4.0, "review": "Fast easy install. Helpful instructions.", "verified": true, "helpfulness": "1/1", "author": "R Knuth"}, {"rating": 5.0, "review": "Bought this because it was on sale and I wanted to see what it was like. We have Roku players, but I like the Fire TV Stick much better! Simple to use and it plugs directly into the tv. Too bad it still needs to be plugged into a power outlet on the wall.", "verified": true, "helpfulness": "0/0", "author": "RDH2"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Luis M. Gomez"}, {"rating": 5.0, "review": "This stick is amazing!!! The setup was very easy.", "verified": true, "helpfulness": "1/1", "author": "shakeriah brown"}, {"rating": 1.0, "review": "Tried 3x. My reviews keep getting denied. The unavailability of this Amazon product on Prime day is a deal breaker.", "verified": false, "helpfulness": "1/2", "author": "KANONE"}, {"rating": 4.0, "review": "But I can't use it on my TV?? I have a 65 projection screen and I cannot find an HDMI slot?? There is a slot on the back of the Direct TV box but that didn't  work, is there another way or do I just return it?/", "verified": true, "helpfulness": "0/0", "author": "Rosemary"}, {"rating": 5.0, "review": "We really love this....", "verified": true, "helpfulness": "0/0", "author": "Connie"}]