[{"rating": 5.0, "review": "Love the education app and that you do not need a smart phone or tablet to control.", "verified": true, "helpfulness": "0/0", "author": "Denise Cruz"}, {"rating": 5.0, "review": "So good I had to buy 2!!!", "verified": true, "helpfulness": "0/0", "author": "Curtis Wilson"}, {"rating": 5.0, "review": "Love it! Ordered 2nd one. Bye cable!", "verified": true, "helpfulness": "0/0", "author": "Ric Nelson"}, {"rating": 3.0, "review": "We bought a Fire TV Stick for Christmas. It works as advertised. Today I added the H2 (History Channel) and it wanted me to activate. Specifically, it says \"Free access to all HISTORY and H2 content when you activate\". You have to go online -- address provided -- and type in an Activation Code. When you get to that point (in my case, on my iPad), you have to choose your cable provider before it will activate. Guess what ... Cox Cable is not listed as a provider. I searched online for information regarding this and found my exact query answered already by someone from Cox. The answer was they have no plans to support that action.So, I am apparently out of luck watching History and H2 and probably a bunch of other channels like so inhibited. I'm not sure where to turn, but I am NOT A HAPPY CAMPER with this shortcoming. Unknown whose fault this is. I just know Amazon promotes all these apps and I guess I missed the fine print saying \"some cable subscribers need not apply\"!!!The bottom line remains, BUYER BEWARE!", "verified": true, "helpfulness": "0/0", "author": "Thom"}, {"rating": 4.0, "review": "Easy to install and am enjoying what's available on Amazon Prime.  Only complaint was getting the remote open to put in the batteries.  Appreciated the suggestions found on-line.", "verified": true, "helpfulness": "0/0", "author": "Lrk"}, {"rating": 5.0, "review": "easy to use and worth the purchase!", "verified": true, "helpfulness": "0/0", "author": "T. KASPER \"casper\""}, {"rating": 5.0, "review": "Best thing ever", "verified": true, "helpfulness": "0/0", "author": "Gerry L Wright"}, {"rating": 2.0, "review": "Does not stream well!! I have no problem using the same apps on my Apple TV, but when using the fire stick, it just keeps buffering & buffering. VERY ANNOYING. I was hoping to use Amazon prime more w/ this device, but it takes along time to load & constantly buffers too! Not impressed.", "verified": true, "helpfulness": "0/0", "author": "Ineke Dallas"}, {"rating": 5.0, "review": "Works pretty good, get HBO then we've got it!", "verified": true, "helpfulness": "0/0", "author": "jim reeder"}, {"rating": 4.0, "review": "Above my expectation as I didn't know exactly what it was, so it was quite a surprise to me. There is one thing though which is a little negative in this whole deal. My country not being in the U.S. encounters most of the time when trying to watch a movie or T.V. show with the message \"Location Restriction\". I became a member of \"Prime\" one day just to cancel the membership the next day. I would be crazy to pay $ 99.-- and not be able to avail myself of all those shows and movies. Any suggestions? For the rest I think I'm really going to enjoy this new toy.", "verified": true, "helpfulness": "0/0", "author": "Olivio R. Quilotte \"O.R.Quilotte\"book fan\"\""}]