[{"rating": 4.0, "review": "Great but takes a little while to learn how to navigate. The selection of things that can be are almost limitless! Love it. I recommend this device to everyone!", "verified": true, "helpfulness": "0/0", "author": "Tab Brown"}, {"rating": 4.0, "review": "It works good, its small and was easy to install  But I find the remote is touchy,  often takes me not where I want to go. it is also kinda hard to navigate.  I'm sure it will improve with time.", "verified": true, "helpfulness": "0/0", "author": "R. Kern \"Rachelkayz\""}, {"rating": 2.0, "review": "Hard to understand the tv and movie lineup. After realizing I still needed to join prime, it would still charge me to watch already ran TV shows?  I was hoping to be able to at least watch tv and some movies without a fee. Cannot figure this darn thing out.", "verified": true, "helpfulness": "0/0", "author": "Debbie Witherow"}, {"rating": 5.0, "review": "I don't really have cable and I just absolutely love this. I used to just watch things on Netflix so this just gave me some more options.", "verified": true, "helpfulness": "0/0", "author": "Valeria"}, {"rating": 4.0, "review": "This device is awesome. It would nice if there was more. Newer movies without having to pay for them.", "verified": true, "helpfulness": "0/0", "author": "Frank lugo"}, {"rating": 5.0, "review": "It works great! There are no delays and it dies not constantly reload like my wii did.I definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Lysa Fisher"}, {"rating": 5.0, "review": "Simole to install and easy to use.  It is exactly what I expecter", "verified": true, "helpfulness": "0/0", "author": "Frank Reuter"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Jeff Alexander"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Julius omar"}, {"rating": 5.0, "review": "Love my Fire Stick.  Selection is great and the portability is fantastic!  A super product!", "verified": true, "helpfulness": "0/0", "author": "Dawn L. Collins"}]