[{"rating": 5.0, "review": "I am so happy with our Fire TV stick.  I am planning on ordering a few now as gifts.  Becauseof the position of my tv, I had a slight hiccup with the signal at first.  I ended up purchasinga small hdmi cable to help my WiFi router get the signal out better.  the picture quality isexcellent and I can now use all the services we have with a couple of clicks.  Thank youAmazon!", "verified": true, "helpfulness": "0/0", "author": "Holly T.L."}, {"rating": 5.0, "review": "Wonderful rocked it", "verified": true, "helpfulness": "0/0", "author": "Linda Whittle"}, {"rating": 5.0, "review": "Better than I imagined! This device replaced my other similar devices. The remote is very useful.  Better than that is the android app that takes voice commands.  The mousepad style control in the app is also very cool.  So it seems that what ever type of control you like you are capable of finding it in the form of the remote or the app.With Amazon apps you can get a variety of apps instantly.However what this device lacks that I would like to see is a way to mirror my main screen.  If I had this also in the firestick I would no longer need my screen beam.  I would like that very much.", "verified": true, "helpfulness": "0/0", "author": "D. Rickard \"DanTravels\""}, {"rating": 4.0, "review": "Update - I moved the Fire TV Stick to a room where it is closer to the router. It works much better there. My overall opinion is that this is a good device for streaming, but you need to have a strong, reliable signal nearby. The price and options make it very attractive, but you need to consider placement in regards to your wi-fi signal.I have 4 instant watch devices. This is the slowest one and the Fire TV stick has the most difficulty getting the wi-fi signal. When it works, it's pretty good. But, it is slower than the Roku, Apple TV, and smart TV. It is annoying to have each viewing stop multiple times and then restart.", "verified": true, "helpfulness": "0/0", "author": "Paintrock \"paintrock\""}, {"rating": 1.0, "review": "1 Star because of its wi-fi issues. My friend has the Fire TV (not the stick), and I have to admit, it is an amazing device. And I was hoping this device would be just as great. There are a lot of great apps, even more than on the Roku. With this device, it took a while to find my router even though it is only about 10 feet away. Then when streaming, it keeps on buffering and the connection doesn't seem that stable. My Roku, has no issues streaming. Another thing I do not like about this device is that it requires external power to work. I have a new TV and I can't use the USB on the TV to power it. I would suggest staying away from this product until they fix the wifi issues, unless you like watching choppy video.", "verified": true, "helpfulness": "1/1", "author": "Ryan Rytlewski"}, {"rating": 5.0, "review": "\"The hit\" of all of our christmas presents!", "verified": true, "helpfulness": "0/0", "author": "J. Nance \"Tune Nance\""}, {"rating": 5.0, "review": "This thing is awesome!  I already had chromecast, but this is WAY better!  More programming available, has a remote and isn't dependent on your phone or tablet for those that don't have one.  Another reason that Amazon Prime is well worth the $.  Get one!", "verified": true, "helpfulness": "0/1", "author": "Josh41979"}, {"rating": 5.0, "review": "Much better than Roku and I believe a better selection than Netflix!", "verified": true, "helpfulness": "0/0", "author": "JWLang2"}, {"rating": 3.0, "review": "Did not realize I had to have a power wire coming from stick. Also prime free content and paid content mixed together is a little annoying.", "verified": true, "helpfulness": "0/0", "author": "M. Hicks"}, {"rating": 5.0, "review": "I absolutely love the Amazon Fire TV Sticks.  There are just a few hiccups, but since I was able to purchase this for $20 (I think) as part of the Amazon Prime promotion, I can't really complain.  The interface is easy and once the stick was set-up (a very easy process) we were able to start enjoying our online content asap.  My few complaints are, no HBO access, but I understand that is coming soon in January, the cumbersome screen keyboard (it takes FOREVER to enter searches, type, etc.) and on occasion, the WiFi craps out and you have to re-enter the password to your router.  Other than that, it's been a great return for just $20.", "verified": true, "helpfulness": "0/0", "author": "mafreund \"mafreund\""}]