[{"rating": 5.0, "review": "I 😍 it used it 24/7 1440 min 86400 Sex", "verified": true, "helpfulness": "0/0", "author": "frank"}, {"rating": 5.0, "review": "Worth it", "verified": true, "helpfulness": "0/0", "author": "Troy"}, {"rating": 5.0, "review": "Transferred to work - we love these and they will work almost perfectly for what we want", "verified": true, "helpfulness": "0/0", "author": "D.V."}, {"rating": 5.0, "review": "very nice, easy setup", "verified": true, "helpfulness": "0/0", "author": "L. Rogers"}, {"rating": 5.0, "review": "I bought this device for a specific purpose/need after reviewing the reviews I decided against the Roku and Chrome sticks of similar design.  Besides I already had a Prime account.  So, why not!  I will start with the negative first.ConThe only negative thing I have to say about this device has to do with the accompanying \"extender.\"  It works.  But for me, it did not have enough extension for the location of the tv that it is connected to most of the time.  I solved that issue by buying  an Aurum Ultra Series - High Speed HDMI Extension Cable Male - Female (3 Ft) with Ethernet - Supports 3D & Audio Return Channel [Latest Version] - 3 Feet sold as a Prime item for $6.99.  That cable has a male end for the TV and female end for the Fire TV Stick.  Problem solved no issues...perfect cable if you have the same issue.Pros1.  Compact and arrives nicely packaged.2.  Has sufficient download capacity for a lengthy HD movie to be watched offline.3.  Some may consider this a negative but I do not.  Once the device is connected and powered on for the first time, you are forced to watch a set up video.  I think that is a brilliant way for consumers to learn the basics of the stick (if they don't assume that they have nothing to learn about a device that was just purchased but haven't used yet).  Someone on the tech team probably blurted out in a meeting force feed a set up video to reduce the number of calls from people who don't read.  Oh and we can save on the cost of printing a thick booklet that will get tossed to the side anyway.  Said all that to say set up was simple.4.  The remote has great tactile feel and is easy to commit to muscle memory.5.  And this is the best part...its loaded with all the apps that I needed.Hope this helps someone who is on the fence.", "verified": true, "helpfulness": "0/0", "author": "MadMadWorld"}, {"rating": 5.0, "review": "Meet our expectations, easy to set up and use. Perfect for our bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Freezes a lot in between shows.", "verified": true, "helpfulness": "0/0", "author": "Rajesh O."}, {"rating": 5.0, "review": "This media Streamer was very easy to set up and extremely entertaining.", "verified": true, "helpfulness": "0/0", "author": "Anthony Lopez"}, {"rating": 5.0, "review": "Love the new fire stick!", "verified": true, "helpfulness": "0/0", "author": "Joyce Knapp"}, {"rating": 4.0, "review": "Love this.No need for any dish or direct t.v. with this. I.Have show box and Netflix and between the two I can watch anything I want. And the fact that anything I.Have on my kindle can go up on my tv is great!!Now I didn't realize th when I got this I had to have the hex. Which isn't a big deal, with the monthly payments I just got the upgraded one and im ready to go!Haven't found anything I dislike about it yet, other than.the fact that it sometimes takes a few tries to get the kindle  and the stick talking to one another. But it always works out  the third try. But it doesn't bother me at all.", "verified": true, "helpfulness": "0/0", "author": "Haylie Black"}]