[{"rating": 3.0, "review": "I bought the Fire Stick and I like it, there is just one thing, it has a mind of its own. Not only does it work when it wants, it will either change to something else when you are watching tv, freeze for minutes on end, or it will just go black on the screen and not come back on at all. Amazon needs to send me a new one ASAP!!!", "verified": true, "helpfulness": "0/1", "author": "lenny"}, {"rating": 5.0, "review": "Really impressed with this little device. I decide to got it just to try it and take advantage of the amazon instant video of amazon prime and now i really like it! It works really good, it practically converts my regular hdtv tv in a smart tv. I can use youtube, amazon instant video, netflix, and some free apps like lifetime, vimeo ...  is awesome affordable, I got it in the amazon prime day with a great discount. I don't need a smart tv anymore. I really recommend it!", "verified": true, "helpfulness": "0/0", "author": "lakiky18"}, {"rating": 5.0, "review": "Pleasantly surprised. Make my Chromecasts look silly.", "verified": true, "helpfulness": "0/0", "author": "Dean Gulberry"}, {"rating": 4.0, "review": "Pretty much turns your TV into a giant tablet. Granted you wont get the samerobust list of apps, but there is still enough to serve its purpose.If you could stream directly to it via PC etc, without extra apps or purchases then itwould be perfect. Currently i bought Plex on the TV stick for $5 and with prime saleon this stick for $24. Its a cheap and decent albeit perfect setup for what i needed.Kodi hack was ok for 720 videos, but anything on 1080 just get blurry images.If your looking to boost features on an old or new TV then this is great.Now if your running a PC with Win 8.1 that has built in Miracast then streaming will work.", "verified": true, "helpfulness": "0/0", "author": "Leon_Cloud \"leon_cloud\""}, {"rating": 5.0, "review": "GREAT ITEM", "verified": true, "helpfulness": "0/0", "author": "3fingerjack"}, {"rating": 5.0, "review": "I use it with Kodi (XBMC) and it's great just for that. Can't tell about other functions", "verified": true, "helpfulness": "0/0", "author": "F. Melo \"FM\""}, {"rating": 5.0, "review": "Best thing made!!!", "verified": true, "helpfulness": "0/0", "author": "Meckey"}, {"rating": 3.0, "review": "I like it but, you have to plug it in the picture is a little misleading thinking you do not need a chord, but you do.  The cord comes with it, my TV is on the wall so I had to have the cord hanging from the TV and it just made it to the extension.  The chord needs to be longer but, it would be better if it could self charge or use batteries.  I also could not really play games on it.  It is not even hooked up now.  I also thought it would be nice during vacations but, the hotel I went to, I wouldn't even hook it up to my TV there.  It just didn't work.", "verified": true, "helpfulness": "0/0", "author": "R. Seinfeld"}, {"rating": 5.0, "review": "Worked fine. Was a little hard to figure how to use but after looking at the picture a few times, it became clear.", "verified": true, "helpfulness": "0/0", "author": "Al Linder"}, {"rating": 5.0, "review": "it was a gift for a couple and they love it!", "verified": true, "helpfulness": "0/0", "author": "tim"}]