[{"rating": 5.0, "review": "Cool.  Worked better than any of the Amazon apps on my blue-Ray or tv.", "verified": true, "helpfulness": "0/0", "author": "Paul S. Greene"}, {"rating": 3.0, "review": "When it works it's great.  But mine disconnects often, say no internet.  Go to settings and it's fine.  My Apple TV has no issues.  Not impressed.", "verified": true, "helpfulness": "0/0", "author": "KD \"Kdavenport\""}, {"rating": 1.0, "review": "I was very disappointed with the customer support.  We had a beautiful picture only briefly then we received a message HDCP unauthorized Content disabled.  We made multiple calls to customer service, only to be put on hold for extended periods of time then disconnected! The last representative offered a refund and directed me to return the stick as it may be defective.We had purchased the Fire system and in less than a year the remote or something failed. I purchased a new remote anticipating my tech savvy grandson could get the system going again then purchased the Fire stick.  NO luck at all. I gave this system an excellent review initially, but would not now.Between the system being flawed and poor customer service I am not happy at all !!!!", "verified": true, "helpfulness": "0/0", "author": "M. Matherny"}, {"rating": 5.0, "review": "I own a few different brands of these type of units and this one works just as well as the Roku and Chromecast. I bought this to use in a spare bedroom. It is dead simple to install and works great. We use it mostly for Netflix, Hulu Plus and Amazon Prime. It also works great for many other video and radio services available on the internet. If you are an Amazon Prime member this unit has some great additional features. You can stream all of your cloud sourced family photographs and videos and you can stream any of your Prime Music library. One additional feature of the Fire Stick that I really like is that it turns itself OFF after a short interval of inactivity. The Roku and Chromecast sticks stay ON all the time and are actually quite warm to the touch which means electricity is being wasted.", "verified": true, "helpfulness": "0/0", "author": "kevin \"Old HP Guy\""}, {"rating": 3.0, "review": "I was very disappointed that it would not accept the HBOGO and TWC apps!  Those are the 2 we use most and they weren't compatible.", "verified": true, "helpfulness": "1/1", "author": "Jewelry Lover \"Ann\""}, {"rating": 5.0, "review": "Works great. Different experience than regular cable, but huge savings if you have Prime", "verified": true, "helpfulness": "1/1", "author": "Ronald Hawkins"}, {"rating": 2.0, "review": "Bought this when it went on sale for $19. We have chromecast and thought that this fire TV stick will be better since we watch Amazon Instant Videos. I hate that it still plays ads when you watch Twitch streams and youtube videos. It never did that to us for chromecast. Now, we went back to using our chromecast!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It is easy and convenient to give my other t.v. the viewing capability that my Samsung Smart T.V. has.  I enjoy using this device with my Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Enid W. Gangler"}, {"rating": 5.0, "review": "Love it. What a great buy.", "verified": true, "helpfulness": "0/0", "author": "rvilla"}, {"rating": 5.0, "review": "The fire TV stick plays much smoother than my Chromecast with much better image and sound quality even when playing Youtube videos. Of course, it plays Amazon videos very smoothly (my Chromecast has issues with Amazon instant videos even when I disabled silverlight).The remote is pleasant to hold and the stick is lightweight and easy to setup. I started finding my TV to be much more useful after this purchase.", "verified": true, "helpfulness": "0/0", "author": "Xiaoshan Cai"}]