[{"rating": 5.0, "review": "I think this is a great product and a great value. Easy to install and get streaming. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "J. cornish \"svengali\""}, {"rating": 5.0, "review": "I tried this as an experiment, and I loved it. Easy to use; easy to understand.", "verified": true, "helpfulness": "0/1", "author": "Beth Meserve"}, {"rating": 1.0, "review": "I'm an amazon fan but so far I'm not a fan of this product. Hopefully, the bugs will be worked out of Fie TV Stick in the near future. After setting up which is very easy. The remote with brand new batteries is s-l-o-w and unresponsive. If this doesn't improve I'm sticking with Roku!!", "verified": true, "helpfulness": "2/3", "author": "Cedric Cannon"}, {"rating": 3.0, "review": "Pros:- UI seems pretty fast and responsive.  Its only barely noticeably slower than the FireTV.- Its nice to be able to use a remote control to stream content, rather than always having to use a phone or computer like the Chromecast requiresCons:- They included a pretty small power adaptor, however the plug is in the very middle of the biggest side, which makes it too wide for smaller power strips so it ends up covering up part of the neighboring power outlets.- With my account pre-setup on the device, there was really no authentication confirmation for the device.  I never had to enter in a password or a pin, nor did I get emailed a notice that a device was activated to my account.  Sure, that makes it more \"user friendly\" to just select \"Yes, this is my account\" when prompted if the provisioned account was correct.  However it does so by sacrificing security.- The setup process is the worst for any such digital media player that I've ever used (Chromecast, Roku, FireTV, BoxeeBox, GoogleTV, several others).  The first thing it wanted me to do was to enter in the wireless credentials so that it could do an update.  After doing this, the update failed, and required me to do a hard reboot.  After doing that, it brought up the credentials screen, and made me re-enter the wireless info yet again.  This happened twice, before the update finally succeeded.  Then, upon the next boot, asked me yet again for the wireless credentials before finally getting to the UI.  First off, when the update failed, having to go to the device and physically unplug-replug the power is rather annoying.  It would be nice if it just had a timeout, then auto-rebooted itself and tried again.  Secondly, having to re-enter the wireless authentication over and over is very frustrating and a horrible user experience if you have a complex wireless password.  That alone made me want to just unplug the device and go back to using my Chromecast + FireTV.", "verified": true, "helpfulness": "2/2", "author": "Steve"}, {"rating": 4.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Brian Dumont"}, {"rating": 4.0, "review": "Got my FireTV stick today and a few issues:1) (edited): Netflix working OK now.2) The Android FireTV app doesn't find the FireTV stick, despite both being on the same wifi network at home.", "verified": true, "helpfulness": "0/0", "author": "jared"}, {"rating": 4.0, "review": "So far, it is. Working just fine. I have yet to try all the features. Easy to install, set-up also pretty quick.", "verified": true, "helpfulness": "0/0", "author": "jrbjr"}, {"rating": 5.0, "review": "Love the fire tv stick.....just takes time to load when turning on Tv", "verified": true, "helpfulness": "0/0", "author": "Shanikwa Leggett"}, {"rating": 5.0, "review": "Truly awesome device for watching videos.Good device for gaming. Tried couple of games they are impressive.", "verified": true, "helpfulness": "0/0", "author": "ravi"}, {"rating": 5.0, "review": "Works great, the stick is alittle longer than expected but the wire extension works fine.  Had a little trouble fitting the Hdmi connector to the tv though.", "verified": true, "helpfulness": "0/1", "author": "Jonat Lok"}]