[{"rating": 3.0, "review": "I have both a Fire stick and an Apple tv. I like the Fire stick. I prefer the Apple tv. I find that the Fire stick's functionality is simply...kludgy. It is awkward in its layout. How it fast forwards and rewinds is also awkward. It is slow to respond and I find I have to do a lot more clicking around than I should.When I first got this, it didn't have HBO Go, which I found annoying, but as of March that problem was resolved. I would like to see it offer more television stations than it does however.Fundamentally, the stick is simply not as graceful a device as the Apple tv. Nor does it have as many channels. If you are choosing between the two, I'd go with Apple, unless, of course, you want access to Amazon prime and other Amazon tv/movies.", "verified": true, "helpfulness": "0/0", "author": "J. Ellis"}, {"rating": 5.0, "review": "so far i love it!!! everything is exactly as promised. i even got the SLING TV  as one of the apps on here and let me say it is so much better than cable. being able to play games, listen to music, stream tv. love it love it love it!", "verified": true, "helpfulness": "0/0", "author": "Kathrine W."}, {"rating": 5.0, "review": "easy to set up feature are great games are awesome", "verified": true, "helpfulness": "0/0", "author": "kevin blackwood"}, {"rating": 4.0, "review": "Outstanding for the cost.", "verified": true, "helpfulness": "0/0", "author": "Suede"}, {"rating": 5.0, "review": "I love not having another box sitting under the tv!", "verified": true, "helpfulness": "0/0", "author": "Bethany Bell \"Beebug2002\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Stephen Morrison"}, {"rating": 5.0, "review": "Outstanding product", "verified": true, "helpfulness": "0/0", "author": "O. Allison"}, {"rating": 4.0, "review": "so far i love it. 1 week. we shall see.", "verified": true, "helpfulness": "0/0", "author": "Gregg Oseneek"}, {"rating": 5.0, "review": "Loving the Fire Stick! So easy to set up and navigate!", "verified": true, "helpfulness": "0/0", "author": "Nancy Reiss"}, {"rating": 5.0, "review": "I love it! It's simple to use.", "verified": true, "helpfulness": "0/0", "author": "ND"}]