[{"rating": 5.0, "review": "makes tv a new experience", "verified": true, "helpfulness": "0/0", "author": "redlead"}, {"rating": 5.0, "review": "Awesome we love it!", "verified": true, "helpfulness": "0/0", "author": "SUE"}, {"rating": 5.0, "review": "Quickly delivered, quickly installed and very user friendly. It's nice to be able to watch TV series that we missed out on and so many movies!!", "verified": true, "helpfulness": "0/0", "author": "A. Lucas"}, {"rating": 1.0, "review": "Amazon fire stick is awful! Haven't been able to do anything on it due to the wifi connection not working on it! HUGE waste of money!", "verified": true, "helpfulness": "0/1", "author": "vwarren22"}, {"rating": 5.0, "review": "Love it! Very fast loading and a perfact picture.", "verified": true, "helpfulness": "0/0", "author": "John Hawk"}, {"rating": 3.0, "review": "Keeps kick us out of our Wi-Fi provider. My wife will sit next to me and use her kindle( same wi- fi provider) and not have a problem. Meanwhile, I have to retart and sign in to Wi-Fi a few times before the firestick will recognize the connection.", "verified": true, "helpfulness": "0/0", "author": "Cliff Noyes"}, {"rating": 5.0, "review": "I've had the Fire TV Stick for about a week now and so far I am very happy with it.  There have been a couple of times when either I had difficulty navigating or the video would stop intermittently but I believe that these issues were due to my ISP.  There were a few surprises with the TV Stick.  I didn't expect to have access to YouTube which is nice since there are HBO shows like Real Time and Last Week With John Oliver that I am able to view clips from.  I would think it would be in the best interest of others like NBC and CBS to get on board with Amazon and add there programs as well.  When you team up Amazon Prime with Hulu and Netflix you have a decent library of entertainment at your fingertips and so far at a fraction of the cost cable tv.", "verified": true, "helpfulness": "0/0", "author": "Ed Swayback"}, {"rating": 5.0, "review": "Very easy to install, works great.  I was constantly having to fix Netflix Apps on both my TVs, same with Hulu. The Fire and fire stick are much more stable. Just works every time never loose WiFi I could not be happier.", "verified": true, "helpfulness": "0/0", "author": "Richard Kevin Lish"}, {"rating": 4.0, "review": "The Fire Stick installed easily, simply plug it in to the TV and power and you are on your way.  It connected to WiFi quickly and I was streaming music (Pandora) and movies immediately after signing in.  I have been using it for a week now with no issues.  I cannot wait to try some of teh other apps on the stick.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "WOW! this is such a simple device, and it works just as advertised. Very easy to set up, you just plug it into a HDMI port on your TV and you instantly have Netflix, Amazon Prime, and all the other great content that Amazon offers.  The remote takes a bit to learn, which is always the case, but in no time at all we were able to navigate around perfectly.The only problem is we ordered it to take down to Florida with us for a month, and they were out of stock. We wanted to have our shows and movies where ever we were, as we traveled around the whole state and many times the local cable wasn't very good, or there wasn't much on that night (a frequent problem, which is why we ditched cable and satellite at home and stream everything now). So we couldn't use it on our trip. So I can only review what it was like on our own TV so far.", "verified": true, "helpfulness": "0/0", "author": "horn.trader"}]