[{"rating": 5.0, "review": "We love it!  We got more use out of our membership in a few days than we have in 3 years!", "verified": true, "helpfulness": "0/0", "author": "Amy Reed"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Shirley Swensrud"}, {"rating": 5.0, "review": "I have a fire TV and just got the fire stick last night. I was surprised to see how fast it is and the fact that it has the same amount of gigabytes as the fire TV, for less than half the price. I don't have cable and this is all I use to watch Movies and TV shows through Xbmc \"Kodi\" and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Kelvin"}, {"rating": 5.0, "review": "Great product by Amazon. Bought another one.", "verified": true, "helpfulness": "0/0", "author": "speedbugy"}, {"rating": 3.0, "review": "it froze from time to time....", "verified": true, "helpfulness": "0/0", "author": "benjie castillo"}, {"rating": 5.0, "review": "Love it best purchase in a while", "verified": false, "helpfulness": "0/0", "author": "Teneisha"}, {"rating": 1.0, "review": "Do not waste your money! TV shows Amazon charges money for when they are free on TV. Save your money!", "verified": true, "helpfulness": "0/0", "author": "Fred Dean"}, {"rating": 4.0, "review": "It would be nicer if you had more movies for the prime members, most of the ones you have to buy or rent are on tv and I can record it with my dvr or on HBO.", "verified": true, "helpfulness": "0/0", "author": "shay"}, {"rating": 3.0, "review": "Nice product.  Loved the simplicity.  I really only got it to play Amazon Prime videos, as it was the one thing lacking in my Samsung DVD player.  It does a good job streaming and the picture quality is good. I do wish it had some type of infra-red adapter or sensor, so I could use a universal remote.  Any time I want to watch Prime videos, I have the use two remotes.  Might look into getting a Roku HD.", "verified": true, "helpfulness": "0/0", "author": "Charles Pitman \"chazp\""}, {"rating": 2.0, "review": "Hulu is bad on this, as well as a very annoying delay in response from the remote to tv , constantly try to clear cache and data to no avail , get what  you pay for.", "verified": true, "helpfulness": "0/0", "author": "Caitlyn Wagner"}]