[{"rating": 5.0, "review": "Real nice product", "verified": true, "helpfulness": "0/0", "author": "Logan Bennett"}, {"rating": 5.0, "review": "I'm very satisfied with this small stick wonder. Even though it's hidden at the back of my TV, there's no communication problem between the stick and the controller when I need to search for movies or videos from my library. Even my preschooler easily figured out how the control works in playing games. I would recommend it to my friends.", "verified": true, "helpfulness": "0/0", "author": "Curious George"}, {"rating": 5.0, "review": "Awesome little tool.", "verified": true, "helpfulness": "0/0", "author": "Rudolf \"Avid Historical Fiction Reader\""}, {"rating": 5.0, "review": "We initially bought the fire TV and LOVED it- so I but one of these for all the other TVs in the house- so glad I did!  I feel I could cancel my cable bill if I wanted to.  I also love how on the amazon music portion it lists the words of the song so you can sing along :)", "verified": true, "helpfulness": "0/0", "author": "Loves to Bake"}, {"rating": 5.0, "review": "Love my firestick! I have the chromecast as well and the firestick just has way more apps plus a remote...I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Seleste Cardoza"}, {"rating": 4.0, "review": "Still gettIng used to it but easy to set up and navigate", "verified": true, "helpfulness": "0/0", "author": "Phyllis Moore"}, {"rating": 4.0, "review": "Super simple to use", "verified": true, "helpfulness": "0/0", "author": "krystle iverson krystle"}, {"rating": 3.0, "review": "The picture is beautiful but somewhat difficult to use sometimes the pic just goes dark and remote don't respond", "verified": true, "helpfulness": "0/0", "author": "Michelle McLain"}, {"rating": 2.0, "review": "It is ok and works like it says but I was expecting the voice command feature.  Would have paid for it too.  They also don't give you much of a tutorial on how to use it to its fullest.  Would like to see about using this instead of cable.", "verified": true, "helpfulness": "0/0", "author": "AZ"}, {"rating": 3.0, "review": "Great product easy to set up. The user interface could be cleaner though. I have a appletv as well and the menu is much cleaner to navigate.", "verified": true, "helpfulness": "0/0", "author": "David"}]