[{"rating": 5.0, "review": "link any TV into a smart TV very easy to operate you can even download an app and use your smartphone as a remote. also I have Amazon Prime and I get many TV shows and movies for free that are really easy to access through the fire stick", "verified": true, "helpfulness": "0/0", "author": "Jacque Jacque \"ducky\""}, {"rating": 4.0, "review": "The Fire TV Stick is really great. I really love how it makes so many apps available on my TV screen. I am disappointed with the lack of selection of the movies I get through Prime, though. So without Hulu Plus and my Netflix accounts there wouldn't be many movies to watch. I was hoping the combination of the TV Stick and Prime would allow me to cancel the other two subscriptions. Doesn't look like that will happen.", "verified": true, "helpfulness": "0/0", "author": "HeyWhatchaReading \"Annie\""}, {"rating": 1.0, "review": "Did not work as good as the fire box which I have hooked up with ethernet cable.  The fire stick shows strong WiFi signal but is always buffering, catching up, or saying error retry.  Would not recommend.", "verified": true, "helpfulness": "0/0", "author": "Phil and Emily G."}, {"rating": 2.0, "review": "It works well if it's compatible with the version of HDMI on your TV. It works on one of my TVs but not the other. In the technical details listed under system requirements, it says that only an HDMI is required. It should be more specific. Apparently it requires an HDMI version of 1.4b or newer.I talked to the person in the technical service department at Amazon, they were very nice and offered to refund my money but I kept it to use the TV that it would work on. But I am disappointed!Updated 08/11/2015I bought a Roko-1 and it works so much better than the Amazon Firestick. Its much easier to set up and use. I recommend the Roko-1 over the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Kennedy Jr."}, {"rating": 5.0, "review": "Received as a gift from a special friend that knew that I'd enjoy it, but was hesitant to buy it for myself.  Am I ever glad he bought it!  Even someone as technologically challenged as I am will be able to figure out how to hook it up and use it.  No lie!", "verified": true, "helpfulness": "0/0", "author": "Cindi Putman"}, {"rating": 4.0, "review": "the set is very small and easy to hide no problem setting up device most important thing wife love it she happy life at peace", "verified": true, "helpfulness": "0/0", "author": "james anderson"}, {"rating": 5.0, "review": "It's awesome!", "verified": true, "helpfulness": "0/0", "author": "billy benjamin"}, {"rating": 1.0, "review": "Does not work internationally. Totally annoyed!", "verified": true, "helpfulness": "0/0", "author": "Darelle Wells"}, {"rating": 4.0, "review": "Fire Stick TV is a great product.  My wife loves it and it was extremely easy to set-up and use.  The only problem we are having is the overheating of the stick.  Downloading apps and finding tv shows is really simple.  Fix the overheating issue please", "verified": true, "helpfulness": "0/0", "author": "Kenneth Brent"}, {"rating": 5.0, "review": "This device is the bomb diggity. Setup was kind of a pain, but once it was done, the stick works as it should. I noticed that screen mirroring is was absolutely difficult. So, I did some tests and I got it to work (including the audio) without any more issues. The following is the steps I did  to enable screen mirroring on my Samsung Galaxy Tab S 10.5 with Kit Kit 4.4:1. If you have a VPN, turn it off.2.On the Amazon Fire TV Stick go to Settings > Display & Sounds > Enable Display Mirroring3. On the Tab S, go to Settings > Connections. Turn on Nearby devices. Go to Screen Mirroring and turn on. You should see pictures of a tv monitor and phone with a message that says \"Connecting\".4. It took a couple of times to work, but it does work.It should be connected by looking at the screen. I assume the Nearby devices setting must be turned on for the stick to be identified on the network. In addition, I did try this procedure on my Samsung Galaxy Note 3 with Lollipop 5.2, and it worked after trying a couple of times:1. Turn off VPN, if applicable2. Enable Display Mirroring for the Amazon Fire TV stick as stated above in #23.Go to Settings > More networks. Scroll down to Media share. Turn on Nearby devices. Go to Screen Mirroring and turn on. You should see pictures of a TV monitor and phone with a message that says \"Connecting\".I hope this helps someone. I am happy I purchased this little device.", "verified": true, "helpfulness": "0/0", "author": "mofrosfo"}]