[{"rating": 3.0, "review": "The Pros: It's small and cheap.The Cons: Some of the apps are buggy. The Prime TV app doesn't always remember where I stopped a show and it will start at the beginning when I click \"Resume\". The HBO Go app is a steaming pile of subpar software development. The audio and video don't always line up. If the Fire Stick goes to sleep when HBO Go is up the app has to be exited and restarted. I've had to restart the Fire Stick itself to get the HBO Go app to work properly.", "verified": true, "helpfulness": "0/0", "author": "M. Larson"}, {"rating": 5.0, "review": "Awesome wifi tv the best wifi TV yet", "verified": true, "helpfulness": "0/0", "author": "peterg2461"}, {"rating": 5.0, "review": "Great gift!", "verified": true, "helpfulness": "0/0", "author": "Amanda Rentschler"}, {"rating": 5.0, "review": "Extremely easy to set up took about three minutes. Loads programs quickly. Really nice picture. Great deal for 39.00. Turn a a regular tv into unlimited shows to watch especially with amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "most apps work fine, with the exception of HBO GO, which seems to have audio syncing issues.  after searching, i found i'm not the only person with this problem, but it may be related to using a pioneer receiver.  i have not had a chance to try on other TVs to see if the problem goes away.", "verified": true, "helpfulness": "0/0", "author": "vikram"}, {"rating": 4.0, "review": "I like my new fire stick. sure it has a few glitches but its just like having your whole collection in a stick", "verified": true, "helpfulness": "0/0", "author": "lindsey jackson"}, {"rating": 3.0, "review": "a little complicated for me to realize what it does and if it costs more for me", "verified": true, "helpfulness": "0/0", "author": "pam h hegg"}, {"rating": 1.0, "review": "Got this for my daughter.  Worked great for first week, now doesn't work at all. Tried on multiple tv's, nothing! How do I file a warranty claim?", "verified": true, "helpfulness": "0/0", "author": "Ronald P Gwin"}, {"rating": 4.0, "review": "On May 12, 2015  an email was sent from store_news@amazon.com entitled,\"Watch TV Without Bugging Your Partner,\" stating that ,\"Amazon Fire TV and Fire TV Stick are now compatible with Bluetooth headphones.\" so I happily proceeded to order a Fire TV Stick for a tv in a bedroom ( I already have the Fire TV in the main family room).Well, imagine my surprise when I attempted to pair the bluetooth headphones (which I ordered at the same time as my new Fire TV Stick) and was informed that only bluetooth game controllers not headphones can be paired with the Fire TV Sitck!Thankfully, I am able to use both items in other applications and will not need to return them but I was disappointed that Amazon misinformed me as well as other loyal customers.I phoned customer service, explained the situation and was kindly issued a five (5) dollar promotional credit.FYI -The Fire TV will pair with bluetooth headphones and game controllers.", "verified": true, "helpfulness": "0/0", "author": "Elena M. Phillips"}, {"rating": 5.0, "review": "Simply love it.  Easy to install and operate. Why ever watch \"regular\" TV again?", "verified": true, "helpfulness": "0/0", "author": "Flyingsolo"}]