[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "RLO"}, {"rating": 5.0, "review": "I love it. No problems at all. Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Aleta M."}, {"rating": 5.0, "review": "Great gifts for my siblings. They use it all the time.", "verified": true, "helpfulness": "0/0", "author": "Star Karmel"}, {"rating": 5.0, "review": "Was given to me as a Christmas gift.  It is absolutely the gift that keeps giving.  I love it!!", "verified": true, "helpfulness": "0/0", "author": "Linda HUlse"}, {"rating": 5.0, "review": "Seamless installation and streams fast.  Does exactly what it is supposed to do, without also trying to walk my dog.  Nice to see a smart product these days.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 1.0, "review": "Got my Fire Stick as a gift for Christmas and it worked for 10 minutes. I then changed it to a TV that is 5 feet away from my WiFi system. Again it worked for about 2 hours and now it will not connect to my WiFi regardless of tins of trouble shooting including fiddling with my WiFi! What a shame, and shame on Amazon.... I have found way too many reviews claiming the same issue, about 1/3 of people have trouble.... that is way too much!", "verified": true, "helpfulness": "1/2", "author": "Ann"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "lynn english"}, {"rating": 5.0, "review": "REALLY GREAT PRODUCT LOVE IT IT IS FASTER THEN CHROME CAST AND A REGULAR DVD WIFI PLAYER", "verified": true, "helpfulness": "0/0", "author": "alex c :)"}, {"rating": 5.0, "review": "easy to install and works great! and good price too", "verified": true, "helpfulness": "0/0", "author": "MT Madison"}, {"rating": 2.0, "review": "Bought it to replace a sony smart blu ray player that has been giving me streaming problems for a while now. had the fire stick for a few days easy set up from the get go( 2 stars for the easy set up). Sign in to Hulu and streamed fine the first day. The following day it had trouble with video freezing but audio still going. Netflix had no sound and took a while to load. Not what I expected since I had fairly high expectation for it. Maybe I got a bad one but I just returned it and got my money back.", "verified": true, "helpfulness": "0/0", "author": "Israel Carrera"}]