[{"rating": 2.0, "review": "So, first was the annoying welcome video that you cannot escape.  Then came the extremely busy and annoying menu system, this device is little more than a gateway into Amazon offerings.  Lots and lots of repetitive icons all over the place.  There is an issue with audio popping on many of the streaming apps.  I do not have Prime so I cannot comment on the audio quality but I assume it will pop as well.  Overall I am not happy with this device and may return it.  I have put in an order for a Roku and if I do not have any audio issues, the Fire TV Stick is going back to Amazon.  Also, the remote feels extremely cheap.EDIT:  Removed the Firestick extension cable and moved the device to another TV.  The sound issue went away, not sure if it was the cable or the monitor it was plugged into originally.  I have never had a problem with that monitor with any other HDMI connected to it.EDIT 2:  Comparing this to the Roku stick, I like the Roku better only because their interface is much cleaner.  The Fire stick is much faster than the Roku, but the interface is horrible.  I also bought this for Plex, it is the first device I had to pay for the Plex app, it also has the worst looking Plex app.", "verified": true, "helpfulness": "0/0", "author": "MattyD"}, {"rating": 5.0, "review": "I am happily surprised how easy the interface is to use - and for only $49!", "verified": false, "helpfulness": "0/0", "author": "Robert D."}, {"rating": 5.0, "review": "I love it, but wish it had all the options of the apple tv.", "verified": true, "helpfulness": "0/0", "author": "Roger H Ouellette"}, {"rating": 3.0, "review": "I was really happy with the fire stick until this past month. After watching for a while the video goes out and the audio stays on. The only way to keep it working is to unplug it and plug it back in every few hours.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The firestick is fantastic. I am pretty much tech ignorant but this remote is easy to figure out.  The stick was easy to install and get up and running.Cant go wrong for the price.", "verified": true, "helpfulness": "0/0", "author": "David Mills"}, {"rating": 1.0, "review": "I have to unplug my fire stick and replug it in every time I want to use it. Then after it worked for a month I finally bought an Amazon Prime account and all of a sudden all my videos on the instant stream page and on Netflix just show a blue screen with \"HDCP unauthorized content disabled\" across the screen. I'm so fed up with this product. Definitely not worth the money and I wouldn't recommend it for anyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it was easy to install, worked great.", "verified": true, "helpfulness": "0/0", "author": "Larry W. Liberman \"larry l\""}, {"rating": 5.0, "review": "I love this product so much that I have cancelled my cable service. So much variety, so few commercials...why did I not do this sooner?", "verified": true, "helpfulness": "0/0", "author": "Michelle Anderson"}, {"rating": 5.0, "review": "This is Way over the top. You will be surprised at the ease of use and performance", "verified": true, "helpfulness": "0/0", "author": "garyedavidson"}, {"rating": 4.0, "review": "Set up easy.  Need to be sure modem and internet is fast enough or will slow streaming. Otherwise, well worth the money.", "verified": true, "helpfulness": "0/0", "author": "R. Wayne Stevens"}]