[{"rating": 5.0, "review": "Using it with my Fire phone as mobile hot spot, working good.", "verified": true, "helpfulness": "0/0", "author": "Ramond Keith \"Keith338\""}, {"rating": 5.0, "review": "I was comparison shopping between this and the Chromecast. I am happy that I got this instead. I really like that it's connected straight to my Amazon prime account, so I can watch all my movies and listen to my music. Amazon prime music is amazing. I really love this device. The set-up was super easy and really quick too.", "verified": true, "helpfulness": "0/0", "author": "Dominique Forbes"}, {"rating": 5.0, "review": "Best 40 bucks I spent", "verified": true, "helpfulness": "0/0", "author": "MK"}, {"rating": 5.0, "review": "Oh I love my fire stick and you get all the help you need for technical support", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We Love this!!  The whole family uses it even my technology challenged parents.  Its so easy to use everyone can enjoy it.", "verified": true, "helpfulness": "0/0", "author": "antoinette"}, {"rating": 5.0, "review": "great watching fun", "verified": true, "helpfulness": "0/0", "author": "John D  Guzzetta"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "MeMe Williams"}, {"rating": 5.0, "review": "I had two TV's with \"built in internet\" features, a Vizio and a Samsung.  Both of them constantly had problems loading videos, (Amazon, Netflix, YouTube) the Vizeo had a minimal menu for Amazon, and both would need frequent reloads, while playing a video/movie.  I now use an Amazon Fire TV stick on both TVs, with none of the aforementioned problems.  Also the menus are much more comparable to what one gets on a computer.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Vessel \"New Age Buddihst\""}, {"rating": 5.0, "review": "Works better than my Apple TV. Happy something works.", "verified": true, "helpfulness": "0/0", "author": "Michelle Livermore \"Kid Krazed Mom\""}, {"rating": 5.0, "review": "I bought my Dad and Amazon Fire Stick to replace a \"Smart\" Sony Blu-Ray player that he absolutely hated. I made the recommendation because I already own a full size Amazon Fire TV and love it. Needless to say he went out and bought a new TV and got rid of his Roku 3 because he was amazed at how well this little device works!I am going to go pick up one for myself to replace my PS3 as my Media Hub.", "verified": true, "helpfulness": "0/0", "author": "C. Spangenberg"}]