[{"rating": 5.0, "review": "Great tool to stream all key apps. Waiting for HBOGO this spring. Had to download $5 Airplay/DLNA receiver Pro app to do mirror screen from my ios devicesON BEHALF OF HUNDREDS OF THOUSANDS OF CRICKET FANS, REQUESTING THE CREATORS TO PLEASE ADD WILLOW TV APP TO STREAM LIVE CRICKET", "verified": false, "helpfulness": "1/2", "author": "prasad vadvalkar"}, {"rating": 1.0, "review": "I am not impressed. I have used the fire stick a few times and every single time it gives me trouble. First wouldn't connect to the Internet, had to reset a bunch of time before getting connected. Now every time I use Netflix it always encounters some error message a few times before finally connecting. Once I finally get a show playing on Netflix it's constantly rebufferinng. I know for a fact its not my internet as I use my blue ray to play Netflix on another TV without ever an issue connecting or rebuffering. It has to be the Fire Stick that just doesn't work right. I was hoping for a better product.", "verified": true, "helpfulness": "1/3", "author": "EMM \"EMM\""}, {"rating": 5.0, "review": "It is way better then Chrome Cast. It is very easy to stream videos and movies. I recommend it to everyone. It is also very cheap.", "verified": true, "helpfulness": "0/1", "author": "The Yang Clan"}, {"rating": 5.0, "review": "Love this dongle! Works great out of the box. Setup is very easy and has a pleasant UI... gets the job done. The remote sure beats using an application like ChromeCast. Got one of those, too! Buy one, you'll like it.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "This thing is great! Fast shipping and exactly as advertised. :)", "verified": true, "helpfulness": "0/1", "author": "Darwin Jimerson"}, {"rating": 4.0, "review": "I like this product quite a bit.  My home theater PC broke so I got this on sale for $20 to hold me over until I fixed it.  But I've hardly needed it, because this little guy does quite well on it's own.  The picture quality is great.  It responds pretty quickly and the remote is simple.  You can watch Netflix through this after downloading the Netflix app.  That works pretty well.  What I really like is while binge watching Breaking Bad, it will automatically load the next episode when the previous one ends.  It will start playing about 20 seconds.  Hardly enough time to run to the bathroom.  When you start it up again the next day, it remembers what episode you are on.The only complaints I have are that if I accidentally hit the wrong button, it will take me back to the main menu and then it takes a few seconds to get back to where I was.  Of course, this is my fault for hitting the wrong button.The other thing is mine glitches every now and then.  It's not a bad glitch, just a quick freezing of the picture, enough to miss a single word.  It can be rewound and re-viewed.The rewind is kind of weird.  It sort of shows you a picture of the frame it is on as it travels backward.  This is handy when you are rewinding a long way, because you can see the scene you are looking for.  But it can be hard to rewind just a sentence or two.  Overall, I would call this a first world problem.  They've done a pretty good job with this product especially if you got it for the $20, like I did.", "verified": true, "helpfulness": "0/0", "author": "ozone"}, {"rating": 3.0, "review": "I was so excited to receive this  on Christmas eve as it was scheduled to come mid January.  Easy to install, plug in the USB, plug into the electrical socket.  All was well as I was on episode 3 of John Adams, the screen paused, said that the internet connection was slow and to return later.  After several days of upgrading my modem, changing all passwords, I still have not gotten past episode 3........frustrating to try to understand what speeds are necessary to have streaming movies.  Most likely the device is fine, I just need to consult an expert regarding connectivity..........", "verified": true, "helpfulness": "0/0", "author": "AKG"}, {"rating": 5.0, "review": "This is the best dongle-style device. I personally started out with a Chromecast. The problem with it is I have to have a phone to operate it - guests don't like this. I initially purchased the Fire Stick, but found it was back ordered - I sure liked that remote idea! In the meantime, I bought a Roku stick. It's nice, however the remote is funky shaped. Otherwise, it's really a good device. Finally, the Fire Stick came in (2 weeks early I might add) and this thing is beyond awesome. Now, I just gotta find someone to take the Chromecast and Roku players off my hands. I know, regift them!", "verified": true, "helpfulness": "1/3", "author": "Freakin Ward Love"}, {"rating": 3.0, "review": "Well, I was lucky enough to pick this up at $19.  I didn't have any trouble setting it up and it's very user friendly.  The only problem I'm having is that none of the movies are in HD, even a movie I purchased.  Really a lousy picture, very poor quality. I suppose it's due to my internet  I didn't think it was slow, but apparently it is.  So you live and learn, right?  I'd really like this to work, but I don't think it's going to happen", "verified": true, "helpfulness": "0/0", "author": "judy"}, {"rating": 4.0, "review": "Great device for the $19.99 I spent on it. Good alternative to Chromecast for those folks that don't want to deal with using their phones. Only issue I have is with the mini USB placement. If your only open hdmi is between  2 other taken ports you'll either have change your ports around to accommodate the FireStick due to the power cord plugging in from the side instead of the rear like Chromecast does..  or use the included dongle so it hangs away from the other hdmi cables already plugged in.", "verified": true, "helpfulness": "0/0", "author": "Rich from the Poconos"}]