[{"rating": 5.0, "review": "Fire TV Stick works as well as the Fire Box. It's a lot less expensive, less than half the cost, and does the same job. I believe you may still need Wifi for it to work, and it comes with it's own remote, adaptor, and plug in cord. I love it, I wish I could have had this available to me before I got Fire Box.", "verified": true, "helpfulness": "1/1", "author": "Jean Phoenix"}, {"rating": 4.0, "review": "I like it not a huge fan of the interface but it functions wells.", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 5.0, "review": "Like it a lot", "verified": true, "helpfulness": "1/1", "author": "Makhach Nabiev \"Makhach Nabiev\""}, {"rating": 5.0, "review": "Pretty freaking awesome", "verified": true, "helpfulness": "1/1", "author": "Justin Roberts"}, {"rating": 5.0, "review": "Im Happy that I purchased  fire TVMy old tv is now like smart tv :)", "verified": true, "helpfulness": "1/1", "author": "Florentino"}, {"rating": 5.0, "review": "Very easy to set up, basically a plug in & go which was great!!", "verified": true, "helpfulness": "1/1", "author": "Heather M"}, {"rating": 5.0, "review": "Works great so bought 2 more", "verified": true, "helpfulness": "1/1", "author": "Gulf breeze"}, {"rating": 4.0, "review": "I wish I could give it 4 and 3/4 stars because it is ALMOST perfect. I got the Fire TV stick on release day. Set up was super simple; I think it went from the box to playing movies in less than five minutes. Navigation is fast and smooth; I haven't experienced any of the lagginess some of the tech blogs have complained about.The only issues that keep it from a full 5 stars:1. Netflix isn't available out of the box, rather it is an app that must be downloaded. Not a huge problem, but it is advertized as being right there from the start.2. No iOS remote app (yet). I know Amazon is working on this so I'm not too worried here either.3. The pin system needs work. I get the idea of security and keeping kids from making unauthorized purchases, but this current pin system is janky and annoying.All in all the Fire TV Stick is well worth the money, especially for Prime members like me. To have a device so polished and feature-rich on release is a pleasant surprise. I can't wait to see what Amazon has planned for the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Shawn Fanchette"}, {"rating": 5.0, "review": "Met all of my expectations. A great buy.", "verified": true, "helpfulness": "1/1", "author": "Joshua Bullard"}, {"rating": 5.0, "review": "Everything you could ask for. Quick, great Amazon video integration, intuitive interface. Set up is extremely easy, and the search function is phenomenal. I still wish somebody would create integrated search that would search Netflix, Hulu, and Amazon Instant video at the same time. Anyways, I love this product. Would definitely buy again.", "verified": true, "helpfulness": "1/1", "author": "Kyle Marquardt"}]