[{"rating": 5.0, "review": "Heads and tails better than Google Chromecast!!!", "verified": true, "helpfulness": "0/0", "author": "ZenBuyz"}, {"rating": 5.0, "review": "Easy to setup", "verified": true, "helpfulness": "0/0", "author": "Marie Miller"}, {"rating": 4.0, "review": "This was a Christmas Gift and I love it. I am going to cancel my move package on my TV. I add movies from my computer to the watch list. Then when I am ready to watch a movie, I go to my watch list, pick a movie and watch. EASY", "verified": true, "helpfulness": "0/0", "author": "Janet McQuesten"}, {"rating": 5.0, "review": "Has a bit of cheap plastic feel on the remote but it does the job. Takes a bit of getting used to with having to pay attention to screen and pressing the correct button for the action versus what feels natural button to press.Nice that it comes with a pigtail HDMI extension of about 4 inches.", "verified": true, "helpfulness": "0/0", "author": "Race V. \"In the Art & Style of a Gentleman\""}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "maurice pritz"}, {"rating": 5.0, "review": "wonderful can access all types of programs and great clarity", "verified": true, "helpfulness": "0/0", "author": "Terry Maness"}, {"rating": 2.0, "review": "So I've been tinkering with my FireTV and my Chromecast, and i have to say that Chromecast is winning handily.The only plus to FireTV over my streaming BluRay player which supports Amazon content is I can type searches from the keyboard on my phone. Compared to Chromecast -  it streams Amazon content - which is why I bought it in the first place. I was hoping it was going to replace my Chromecast/BlueRay Player combo to stream... err, no.- The phone app's interface to move around is poor and touchy.- I don't want another remote cluttering my coffee table, but it's necessary to keep it around since the phone app's interface is so poor and touchy.- FireTV text describing movies is way too small on Amazon Video- Trying to figure out which <Option> is highlighted took multiple attempts to turn on captions. When there are only 2 choices, make it EVIDENT which one is highlighted. This was very a bit frustrating as the other option is to restart the movie, which I did inadvertently several times.- The power plug is on the side, which means I have to use the HDMI extender if I have any significant number of HDMI devices, making the device visible from my seated position. Put it on the back like Chromecast did.- For some reason, KF TV wants me to use their power adapter \"for best performance.\" Works fine plugged into the Y cable coming from my USB port on the TV. But include a short cable like Chromecast does; No one likes cables being visible.- I love Chromecast's side role as a changing portrait with their lovely shots. I won't be leaving my KindleFire TV interface up for hours on end.I wouldn't recommend FireTV to my friends, instead will suggest they get a streaming BluRay player for Amazon content, and Chromecast for everything else.", "verified": true, "helpfulness": "0/0", "author": "Eric Deslauriers \"edeslaur\""}, {"rating": 5.0, "review": "Great device, perfect for what I needed it for (to stream videos to my exercise room). Never had a problem connecting, and my wifi source is on the other side of the house. Great picture quality, and easy to use.", "verified": true, "helpfulness": "0/0", "author": "S. Huh"}, {"rating": 4.0, "review": "I have a Chromecast and wasn't really planning on buying a Fire Stick, but a good enough sale caused me to pull the trigger.  It didn't take me long to really like that choice.  I like the remote, I like the interface and it is great having all my Amazon content right there.  It also gives me access to Amazon Instant Video, which was always an issue accessing on my TV outside of using my PS4.  The only negative I can say is that it seems the Wifi antenna isn't the best.  It is touted as being better thanks to being dual band, but I constantly have issues with Netflix, Hulu and YouTube buffering or stuttering.  It's interesting that I don't seem to have those problems with Amazon's video services.  There have been multiple times that I have been watching Hulu and it becomes so annoying that I would start Hulu on my tablet and send it to my Chromecast and the video would play perfectly.  I like it enough that I plan on upgrading to the Fire TV box and moving the Stick to another room.  That way I can connect it by ethernet cable and not worry about WiFi any longer.", "verified": true, "helpfulness": "0/0", "author": "Troy Lyons \"troythegeek\""}, {"rating": 5.0, "review": "really a neat addition.  easy to use, really enjoy the major additional access.", "verified": true, "helpfulness": "0/0", "author": "Old Terp"}]