[{"rating": 5.0, "review": "What's not to love???", "verified": true, "helpfulness": "0/0", "author": "Sue Ann Young"}, {"rating": 4.0, "review": "Unfortunately, our wifi in our bedroom is not strong enough to make this work well...keeps stalling out.  We'll try it in our family rom, but disappointed it is at the mercy or wireless speed.", "verified": true, "helpfulness": "0/0", "author": "Scott Clements"}, {"rating": 5.0, "review": "I love the Fire TV Stick.  I've used a Chromecast since it released and overall I think I like the Fire TV stick a little better.  Setup is certainly easier than the Chromecast because you don't need to have it wirelessly connect to your phone - you just use the remote and put in your wifi password like any other device.The other part of the Fire TV stick that's easier than a Chromecast is simply finding what apps are supported.  Since the Fire TV stick has a full UI, you can see every app available.  This makes it easier to find supported content.Personally, I don't want to use a remote and really like the Chromecast's ability to just use your phone to navigate an app and cast media.  But you can do this with the Fire TV as well.  Just open Netflix or Plex, find a movie and use the cast button to connect to the Fire TV stick instead of the Chromecast.  I still use both devices in my house but the Fire TV Stick seems to have a tad bit more versatility than the Chromecast.The biggest annoyance I have with the Fire TV stick is the mandatory 4 min intro video.  I've set several of these up for various people and I'm so tired of not being able to skip that stupid video.", "verified": true, "helpfulness": "0/0", "author": "Jason Rittenhouse"}, {"rating": 5.0, "review": "I have two Fire Sticks and I am loving the ease of use, and simplistic design.  I had no access Amazon on one tv, and had been using a WiiU to access Amazon on another.  I replaced the use of the WiiU with the Fire Stick, and have loved it.  I can now access content on both tv's, and can control both using the Fire Stick Remote App on my Kindle.  I recommend using the app to search for items as it is much easier to speak what you are looking for, then clumsily typing letters on the screen with the provided remote!", "verified": true, "helpfulness": "0/0", "author": "Kevin Anderson"}, {"rating": 5.0, "review": "So easy to set up and use.  A few of the TV's in my house are NOT Smart TV's so this definitely did the trick!  There's a whole other world to access now!", "verified": true, "helpfulness": "0/0", "author": "Lorraine Riscinti"}, {"rating": 4.0, "review": "Pretty nice product :)", "verified": true, "helpfulness": "0/0", "author": "Chefbrian77 \"computer geek\""}, {"rating": 5.0, "review": "Amazing product! Easy to set up and use. Lots of great content!", "verified": true, "helpfulness": "0/0", "author": "Michael G. Fort"}, {"rating": 5.0, "review": "I'm a diehard Chromecast user, but Chromecast and Amazon Instant Video don't (yet?) work together well, so I happily picked up a Fire TV Stick when it was on sale for Prime users. I'm pretty happy with it -- the remote makes some tasks (searching) a lot harder than on Chromecast, where I've got my phone's keyboard, but some tasks a lot faster, since it's all on the same device -- there's no lag as the phone asks the Chromecast to open Netflix, waits for that, then asks it to start streaming my movie, etc. I have an A/V receiver, so I don't mind having a few redundant streaming options, and the Fire TV STick is certainly a solid one.", "verified": true, "helpfulness": "0/0", "author": "T. Tuttle"}, {"rating": 3.0, "review": "Has problem loading Netflix. An error code comes up saying Netflix server problem yet we can get Netflix on our computer and tablet.So far Amazon and Netflix have yet to help me solve this issue.", "verified": true, "helpfulness": "0/0", "author": "Tom Gamsky"}, {"rating": 5.0, "review": "Organizes all Prime features well. Fingertip service. I am pleased.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel Orange"}]