[{"rating": 1.0, "review": "I was looking for something to replace my aging Roku HD, since newer Rokus and other streaming devices are \"faster\" and more powerful. I had been keeping my eye on the Roku 3 when I saw the promotion for the Amazon Fire TV Stick for only $19. Seemed like a great deal. I love Amazon so I bought 2.  After trying out this device, I decided to return the Fire TV Sticks. Pros & Cons:PROS:1.  Comes with an HDMI extender to avoid crowding issues when plugging the stick into your TV or monitor.2. Packaging looks nice.3. Easy to set up. Wifi setup was super easy. BUT...please read the cons.CONS:1. Wifi signal is extremely weak.  I set this up 5 ft away from my router and it could not maintain a strong signal. I kept getting error messages saying my connection was too slow. All my content was buffering every few minutes - even when I was just trying to stream music. I thought maybe something was wrong with my internet connection, so I turned on my computer and checked out the wifi on there. Everything was fine. Same with my phone, tablet, and my ancient Roku on the other side of the house. The wifi connection was fine on all of my devices, except the Amazon Fire TV Stick.2. The stick gets very hot. After my wifi issues I checked to make sure the stick was plugged in properly and was surprised at how hot it felt, even though the stick had only been plugged in for a few minutes. I checked the heat every so often to see if the stick would cool down, but it never did. I am not comfortable having something this hot touching my TV.3. Miracast does not work. The Amazon Fire TV Stick is described as a Miracast Certified device, yet does not function as one.4. The UI is a hassle to navigate.  Maybe I am spoiled by Roku. On the Roku you have \"grid\" with your apps on it, and you can customize the grid so that your apps are listed in any order that is convenient to you. Having a grid-style layout is nice because when you're selecting an app from your list, you can navigate up, down, right, or left, and easily find what you want.  The Amazon Fire TV Stick UI has no grid, no customization, and there is no pinning of favorites to a convenient location.  Your apps will be displayed in one very long line of icons that you have to click through, one at a time. So if you have 20 apps on your list and the one you want to use is at the end of the list, get ready to click your remote 20 times to get to that app.  Also if you want to look at \"Recently Added to Prime\" videos, you'll come upon a list of 90+ shows.  So you have to click your remote 90+ times to see all of the recently added content. I don't think this is ideal at all.5. I could not use the stick for more than 30 minutes without it crashing. This was the last straw.  All of a sudden the picture would freeze, then go blank. And the Fire TV Stick would reboot. Since the stick has a poor wifi signal, reloading of the homescreen was a painfully slow process.6. Netflix looks terrible when using this. The picture is squished and not displayed at the proper resolution, even though I changed my settings multiple times on the Fire TV Stick.  I tested out the streaming quality by watching \"It's Always Sunny In Philadelphia\" on both Netflix & Prime Instant Video.  The Netflix version was blurry, low quality and squished in the wrong resolution. Meanwhile, Amazon Prime Video looked just fine... Not sure why this was happening but I cannot live without my Netflix, sorry Amazon. BTW, Netflix works flawlessly on my Roku, my computer, tablet, and smartphone. It only has problems on the Amazon Fire TV Stick.Other thoughts:  The remote is uncomfortable to use, especially since I need to click through the long line of apps/shows/content in the Fire TV UI.  If the remote had cushy rubbery buttons it would be better. But as it is, this is not a remote that you can let rest comfortably in your hand while you click away. You need to grip it tight to click the hard plastic buttons down. I have tiny hands and I feel like this remote is too small.I love the idea of the Amazon Fire TV Stick, but sadly it's just not useful to me. Maybe when the 2nd or 3rd generation comes out I will try it again. Till then I will be using Roku.", "verified": false, "helpfulness": "22/28", "author": "J. Gurr"}, {"rating": 2.0, "review": "If your Internet connection requires a login through a Web page,  as many networks in hotels and businesses do,  then this device will not work.  It seems as if once connected to a WiFi network,  if it cannot communicate with Amazon,  it just locks out pretty much everything but the settings option. There is no method I have found to load a browser to login.Even worse,  games and apps I thought were downloaded and installed locally are not accessible.When connected to the internet at home,  it works fine.", "verified": true, "helpfulness": "0/0", "author": "Eric Voskanian"}, {"rating": 3.0, "review": "it's great when it works without any issues. Amazon usb adaptor doesn't seem to provide enough power to the stick. The screen frequently black-out while watching movies...It's such an annoying experience.", "verified": true, "helpfulness": "0/0", "author": "AZ"}, {"rating": 5.0, "review": "I set this bad boy up in under 5 minutes, from package to streaming my first show.  I have a ROKU and love it, but I was excited to get this due to its small size.  I have it on a bedroom TV on a stand with no room to put even a small box.  The stick hangs off of the TV vice on a surface.  Very easy to use, I have tapped into NETFLIX and Amazon Prime (just got it tonight, running it thru its paces).Great price, great capability.  I have stripped back to $24 a month cable (Broadcast) and use streaming for most of my TV viewing.  This helps make the cut from cable even easier.", "verified": true, "helpfulness": "0/0", "author": "TammyinMD"}, {"rating": 1.0, "review": "Although it says \"coming soon\", so far I still cannot mirror any iOS device onto the fire fire tv stick without buying third party apps. I will probably update my comments after Amazon set up their iOS support, but it might be easier to return the device and purchase chromecast instead.", "verified": true, "helpfulness": "1/2", "author": "Samuel"}, {"rating": 5.0, "review": "This is amazing! It does benefit you more if you are a Prime member. It was so easy to install.", "verified": true, "helpfulness": "0/0", "author": "J. York \"Jyork\""}, {"rating": 5.0, "review": "We just opened ours and it was running in two minutes. This puts Amazon at the same level as Apple in terms of product savvy, quality, and easy experience. I LOVE this thing, and I love that I only paid 20 bucks for mine! If you want to belong to Prime, this is how you watch Prime.I find no negatives. The remote is absolutely cool. The stick is lightening fast. The menus make sense, operation is a no brainer, and the picture is gorgeous.", "verified": true, "helpfulness": "1/1", "author": "Mark S. Deneen \"juicymusic\""}, {"rating": 1.0, "review": "Followed instructions but it will not work. Referred me to Amazon.com but I cannot find a number to call or what to do. I have unplugged it several times but it still will not load. It says I am connected to internet.  Guess I will return it.", "verified": true, "helpfulness": "3/3", "author": "Niklee"}, {"rating": 3.0, "review": "Everybody has the same stuff.  If it's interesting you will have to pay, and pay, and pay for it.", "verified": true, "helpfulness": "0/1", "author": "Walter Prochorenko"}, {"rating": 2.0, "review": "Fast and easy to use. Good Wi-Fi reception.However, no support for YouTube. I know Google (Owns YouTube) and Amazon are fierce competitors, but I want, and expected, to have a YouTube app. When companies try to hurt each other, we, the consumers lose. Wise up Amazon.I WANT MY YOUTUBE!", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer \"Savy Shopper\""}]