[{"rating": 5.0, "review": "Doesn't get much better than free with subscription to Sling TV!", "verified": true, "helpfulness": "0/0", "author": "Cara Ng"}, {"rating": 5.0, "review": "Great Transaction!!!!", "verified": true, "helpfulness": "0/0", "author": "Mike blanco"}, {"rating": 5.0, "review": "My family is really impressed. We use it much more than I thought.While there's plenty of video content for adults and kids, what I really like is the ability to play Amazon Music through the home-entertainment system. It also adds extra value to being a Prime member. I like the parental code key. It means the kids have to come ask me first if they can watch something. That way they aren't watching stuff without me knowing about it.", "verified": true, "helpfulness": "1/1", "author": "J.C."}, {"rating": 5.0, "review": "Awesome product it knows my Amazon Prime information", "verified": true, "helpfulness": "0/0", "author": "Azodiac"}, {"rating": 5.0, "review": "This stick will catch a lot of people by surprise.  Once you stick it in, you'll be amazed at all the entertainment this holds.This surprisingly has a huge following of unofficial developers that create great apps you may not find with a lot of other devices such as the Chromecast or Roku.  Some of these apps include streaming of a lot of TV Shows and Movies (some not even available on Red Box!).Make the purchase and start saving money.  Also, great way to take advantage of your Amazon Prime membership if you already are one, this makes the membership much more valuable.", "verified": true, "helpfulness": "1/1", "author": "Terence Rivera"}, {"rating": 5.0, "review": "It for what I needed it to do enjoyed...😊😊😊", "verified": true, "helpfulness": "1/1", "author": "luz"}, {"rating": 5.0, "review": "Love it....so much fun for the whole family!", "verified": true, "helpfulness": "1/1", "author": "Tina"}, {"rating": 1.0, "review": "Very disappointed in how incredibly slow the streaming is.", "verified": false, "helpfulness": "0/1", "author": "Tory Houston"}, {"rating": 5.0, "review": "Fantastic entertainment device with a good price. My TV will never be the same. Great for families who enjoy TV and movies.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it ... very easy setup ... watching movies basically from just out of the box.", "verified": true, "helpfulness": "1/1", "author": "Dantha C Manikka Baduge"}]