[{"rating": 5.0, "review": "Took a bit to update out of the box, and did drop a couple of times on the first day.But otherwise perfect.I like it better than the chromecast cause all you need is the remote.  No loading chromecast on the phone than bringing up the app and casting it.I found the sound on movies and music to be a little better than chromecast.Wish it had HBOgo and maxgo. Also wish it didn't need power connection and used the USB port for power.But pretty cool!", "verified": true, "helpfulness": "0/1", "author": "Kathie Burman"}, {"rating": 4.0, "review": "As we live in the country, our only provider is small-time and has our wifi transmitter on the water tower nearby in our little town.  In the past, we have had slow speeds and frequent stalling on our Netflix and amazon settings, sometimes too the point of discourage-ment and giving up on the shows we were watching.  With the fire tv stick in use for a week now, I can see improvement in both the speed and picture quality of both Netflix and Hulu plus.  We have momentary stalls(Usually at the beginning of a show)but not nearly as bad as before.  I'd have too say my tv experience has improved dramatically since hooking up the stick.  Also, installation is very easy. I certainly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Stephen C. Stone"}, {"rating": 1.0, "review": "Won't work.  Drops the internet connection all the time; took 2 days to get the update downloaded.  My internet is working fine, my Fire TV works great.  Both sticks work like crap as of now.", "verified": true, "helpfulness": "1/3", "author": "Dougie S"}, {"rating": 5.0, "review": "This is the best buy you can get As An Amazon Customer.", "verified": true, "helpfulness": "0/0", "author": "Don W. Torok \"golfboggieman\""}, {"rating": 2.0, "review": "Update: I was eventually able to download AllCast to my wife's Kindle Fire HD for streaming, but if you have an older first gen Fire, it won't even find the app in the appstore.Bought the device today. Took a few minutes to get it up and running. If you are looking to cast from a laptop its not going to happen. If you have an original Kindle Fire, or the Kindle Fire HD which is about 2 years old you will not be able to throw what you're watching onto your t.v. I'm a little upset that its a Fire Stick and I have two Kindle fires and I can't cast my screen to my tv. The actual interface and remote via your tv is outstanding but it doesn't meet my needs.", "verified": false, "helpfulness": "0/1", "author": "t street"}, {"rating": 1.0, "review": "This unit when it works is good, but it losses my wifi signal when my Roku device is working perfectly at the same location. ALso the sticks have broken my existing Wifi connections in my house to ALL MY OTHER DEVICES Grrrrrrrrrr.I really hope they update these units they are good when they work they are very fast,I think they rushed them out the door for xmass but it was not ready...I hope after a few updates these units will work..I want to return them but I am hopefully they will fix these issues", "verified": true, "helpfulness": "2/5", "author": "stephen damico"}, {"rating": 5.0, "review": "I've been looking for a device to stream movies to my minivan's DVD screen which has an HDMI port. I have an Unlimited Data plan on my phone, so I can use it as a hotspot during our family travels. However, the problem was always that devices such as Chromecast required TWO mobile phones: one to be a hotspot and create the wifi signal, and ANOTHER one to connect to the same wifi and control the Chromecast. The way Chromecast works (or is it the tethering app?), you can't stream to it from the same mobile device that creates the wifi signal.So whenever we go on a trip with my wife, we have two phones and we are basically set. But God it's such a hassle to re-configure the Chromecast stick each time we take it to the car and back. Yeah I know for the price of it we could just have two, but I was still hoping to find a solution that would work with only one phone for those occasions when only one of us is in the car.The trick is to have a device that doesn't require a smartphone to make selections and has its own GUI (and it should also be a stick rather than a box because of space considerations in the car). The best candidate for the job was Roku stick. Bought it for some $40 and returned the next week. It's soooo slow. Loses the signal constantly. Even when the signal is strong it's buffering all the time, and when it finally streams there is this weird purple flickering every second which makes watching impossible. For the sake of full disclosure, the Roku stick worked fine (although still slow) when connected to a home TV. It was something to do with the car moving which rendered it useless.As soon as I returned the Roku, the Fire TV stick came out. Boy, what a pleasure!!!Much, much faster. It remembers all the networks it was connected to and instantly finds the one currently on. The response to the remote is lag-less. Streaming is flawless. I'm still waiting to find out how the pre-buffering feature works (they marketed the feature as one that predicts what you're going to watch next and downloading some of it in the background, so when you start it, it begins instantaneously). Oh and the gaming feature - simply fantastic! Made my kids very happy. Even without the separately sold remote controller there are a few games that are pretty good and fun to play with the provided remote.My biggest concern with Fire TV stick was that it would require connecting it to the car outlet rather than to the USB port of the DVD screen. There're a few places in the product description that explicitly mentioned that the stick needs to be plugged to a wall outlet. However for me it works just fine being connected to the USB port.", "verified": false, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Received my Fire TV stick today, and my experience has been phenomenal so far. The apps and functionality is far better than Chromecast, and the idea of cloud storage consolidates almost everything you would like to watch on your fingertips. The remote that comes with the stick is very user friendly and gives total control. Most on-screen keyboards are alphabetical but Fire TV has a qwerty keyboard which makes typing/ searching seamless. I would highly recommend this powerful device.", "verified": true, "helpfulness": "0/0", "author": "Ankit"}, {"rating": 5.0, "review": "Best $19 i have ever spent, really great way to make your TV smarter. It does everything it says it does.", "verified": true, "helpfulness": "0/0", "author": "Necromancer"}, {"rating": 1.0, "review": "Got it today, plugged it in, 10 seconds later serious static noise started then the hdmi port is now fried!!!!  Plugged it into the other port, same static noise, yanked it out just in time.  very disappointed.", "verified": true, "helpfulness": "6/7", "author": "bc"}]