[{"rating": 5.0, "review": "I was so happy with the fire phone that I purchased the fire tv stick and wow for a tiny thing it's fantastic keep up the good work Amazon!👍", "verified": true, "helpfulness": "0/0", "author": "Charles C."}, {"rating": 4.0, "review": "Great for TVs lacking apps. Beware of purchasing by mistake!", "verified": true, "helpfulness": "0/0", "author": "GameDesignDude"}, {"rating": 5.0, "review": "Does what I need it to do. Enjoy the WWE network!", "verified": true, "helpfulness": "0/0", "author": "S. Dunn"}, {"rating": 5.0, "review": "This thing is great! Very user friendly. thanks Amazon for a great little device!", "verified": true, "helpfulness": "0/0", "author": "Bruce J. Goodwater"}, {"rating": 5.0, "review": "Great product for the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Small, works great!", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 3.0, "review": "I think its great that I got it for the cheap price, but I think it's still has some kinks to work out.  Spotify can only be controlled from your phone and it gets buggy at times. I hope future os updates will fix the problem.", "verified": true, "helpfulness": "0/0", "author": "Emil B. Campos"}, {"rating": 4.0, "review": "I've been using the Fire Stick for a week or so now.  I really like the simplicity of the interface.  I have an Apple TV, have for years.  The ATV gets very little use because it's hard to navigate and the remote is finicky in my opinion.  The FTV is MUCH better. The remote for the FTV is great, easy to use, and is easy to navigate in the dark which is how I watch usually.As a prime member, I love having the prime content readily available, and the newly integrated 1TB photo storage is great!  Easy to use and navigate.The only reason I didn't give 5 stars is that I haven't yet found an easy way to display only the free/Prim content.  That would be a nice filter.", "verified": true, "helpfulness": "0/0", "author": "Gexbert"}, {"rating": 5.0, "review": "Love this. We're able to watch so much.", "verified": true, "helpfulness": "0/0", "author": "Joan Davis"}, {"rating": 4.0, "review": "first step to cutting the sat tv cord. With this and a Netflix subscription, we hope to get more viewing variety at less cost and to boot those invidious cable/sat providers who keep boosting prices.", "verified": true, "helpfulness": "0/0", "author": "Rugby3"}]