[{"rating": 5.0, "review": "Was a really nice investment! I downloaded the app so I could control it with my phone so that's real handy given I lose the tiny remote control. :)", "verified": true, "helpfulness": "0/0", "author": "Kaboom"}, {"rating": 2.0, "review": "I'm not too pleased with this item and I think I'm pretty easy to please most of the time.  What I don't like about it most is that it doesn't seem to remember my log ins and passwords to things I subscribe to, such as Netflix or Hulu Plus.  Each time I use the stick, it requires me to log in all over again.  My email is on the long side and its pretty annoying to have log in each and every time I decide to use it.  I can't speak to the content and quality, but what I've seen is pretty ok.", "verified": true, "helpfulness": "0/0", "author": "R. Reyes \"all play and no work\""}, {"rating": 5.0, "review": "I have been using my Kindle Fire HD tablet to watch Prime videos on my flat screen TV but I don't have a remote for it so I had to get up to navigate.  This Fire TV Stick is much easier to use.  However, be aware that an older router may not work with it.  Mine didn't and I was frustrated by that fact.  However, I bought a new router at about the same time and once it was up and running, the Fire TV Stick worked.", "verified": true, "helpfulness": "0/0", "author": "health conscious"}, {"rating": 4.0, "review": "If you do not have a smart TV, this is the ticket. The stick also makes it handy to take your movies and TV with you. I can mark a movie to watch later, take the stick t my parent's, plug the stick in the HDMI slot and watch!", "verified": true, "helpfulness": "0/0", "author": "Karen Durda"}, {"rating": 4.0, "review": "One of several choices of similar devices, as an Amazon Prime member, this one just works for me. Next time I may go for a wired device, but so far good luck with that aspect as well...", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "Fantastic!!  Great for the family - we use this in our playroom for the kids to download movies (cheaper than our TV provider), more variety on Amazon movies and access to our Netflix account.  We bought 1 as Christmas gift & for ourselves.", "verified": true, "helpfulness": "0/0", "author": "K. Boyd \"luv2shop\""}, {"rating": 5.0, "review": "Amazon, this is point on. Plug and Play.  I have the Google Chromcast and yes it pretty good, However I think this is better.  It has a remote..I take it everywhere.", "verified": true, "helpfulness": "0/0", "author": "J. Cart \"packrat201\""}, {"rating": 5.0, "review": "It's great! No need to keep selecting next episodes, they automatically play. Nice remote that won't break like Roku's.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent device and easy to use !  GO Amazon !", "verified": true, "helpfulness": "0/0", "author": "Jumpin Jeff"}, {"rating": 5.0, "review": "Great value, fast shipment, works as advertised and am happy with my purchase", "verified": true, "helpfulness": "0/0", "author": "J. Alexander"}]