[{"rating": 4.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Skyler Lawrence"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "al"}, {"rating": 5.0, "review": "I really enjoy the shows on Amazon and the ease of use to watch netflix.", "verified": true, "helpfulness": "0/0", "author": "steven culverwell"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "JABALI K. JOHNSON"}, {"rating": 1.0, "review": "Unusable.  At first I thought the issue was that I didn't have a good enough WiFi signal, so I moved it right next to the router.  Now, the thing either freezes up completely or works so slowly and chopily (both problems requiring me to unplug/replug to fix) that it's easier for me to simply boot up my Xbox to watch Netflix or Hulu.", "verified": true, "helpfulness": "0/0", "author": "Jonathan P Olson"}, {"rating": 4.0, "review": "Well worth the price. Easy to install, works great.", "verified": true, "helpfulness": "0/0", "author": "Harry Knowles"}, {"rating": 4.0, "review": "Great price and lots of applications and uses.  I take it with me to hotels to watch and for a guest room to give guest something to watch without having to buy another box.", "verified": true, "helpfulness": "0/0", "author": "VIP910"}, {"rating": 5.0, "review": "Cancelled our cable and bought 3 fire sticks. We love them, saves alot of money.", "verified": true, "helpfulness": "0/0", "author": "Cindy Hall"}, {"rating": 5.0, "review": "Rescued my Vizio TV ... our Smart TV was freezing and rebooting running Amazon Instant Video, was sluggish in its built-in apps generally, and I was facing replacing it (or getting it repaired at a cost of hundreds of dollars). Since all we want is Amazon Instant and Netflix, I thought maybe this device could help ... it did! This little stick is *fast* and the UI is better (clearer, faster), and it seldom has any problems ... now the big TV is just a monitor, and it works well. The remote control is simple enough to live with, too. All in all, the best video investment we've ever made.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good for newbies to streaming but not anything like the box in performance. Would not recommend unless you want to start with something cheap. Wireless doesn't work that far either.", "verified": true, "helpfulness": "0/0", "author": "Joseph H."}]