[{"rating": 5.0, "review": "It works way better than expected", "verified": true, "helpfulness": "0/0", "author": "sharknipple1010"}, {"rating": 5.0, "review": "All that I thought it would be.", "verified": true, "helpfulness": "0/0", "author": "john P. Marchione"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Hwa-Chi Wang"}, {"rating": 5.0, "review": "The FireTV Stick has exceeded my expectations, the interface is simple, the RF remote is easy to use and doesn't have to see the other end to work as other set-tops do.  Works great with Amazon Prime, Netflix and works great with All-cast.", "verified": true, "helpfulness": "0/0", "author": "kb9szm"}, {"rating": 5.0, "review": "I have just started exploring the many facets of this product.  First off: it's much easier to use and access features than the Google Chromecast.  I have both.  Fire Stick wins hands down: easier to setup, to navigate, to view.  The remote is excellent, simple, and very useful.  Somehow , the large memories and buffers compensate for even my EXTREMELY slow dsl (0.69 mbps!!!).  There is setup lag time, but once it downloads a significant amount of stuff, the streaming is pretty good.  I did try using it with my Verizon JetPak, but streaming thru that faster tool sucks up quite a bit of data, so unless you have unlimited data, that is NOT a good option!", "verified": true, "helpfulness": "0/0", "author": "Christopher L. Lee \"noteworthy\""}, {"rating": 5.0, "review": "Excellent purchase for the $20 price paid. Works well on Hulu plus, watch ESPN and YouTube. No problem using the youtube by pairing it on my iPad. One of the best device. Now time to sell my roku HD.", "verified": true, "helpfulness": "0/0", "author": "Rishabh Halakhandi"}, {"rating": 4.0, "review": "I cut my cable cord about half a decade ago when the very first netflix player (Roku) was introduced and I have owned nearly every generation of Roku Player ever put on the market since, mostly due to my self gratification (never due to the quality of any given Roku device). So trust me when I say this Fire TV Stick in \"near perfect\". First of there is no lag time between pressing a button on your remote and achieving the desired response on your TV something you experience using the Roku streaming stick (especially if you use to use the earlier Roku box player). Second being a Amazon Prime Member the transition is seamless owing to familiarity with the service and the fact that the product was delivered preset with my account information, but guess what \"No YouTube \" now life is hard enough as it but life without You tube is just excruciating, I really hope this flaw is rectified very soon. But at an introductory price of $19.99, zero delayed response and instant access to everything Amazon Prime and the promise of much from Amazon Just Buy One NOW !!!", "verified": true, "helpfulness": "0/0", "author": "Femstar \"Femstar\""}, {"rating": 2.0, "review": "Took it out of the box.  Plugged in the included power cords.  Plugged it in to my HDMI port in my 40\" Philips TV.  Nothing - Time to get my money back I suppose.UPDATESo after trying My third HDMI port, it finally started working. Now, it seems it is hit and miss if it wants to play my shows on my library. Sometimes it works, other times, I keep getting an error and it won't play.  Not impressed, but it is nice when it does work.", "verified": true, "helpfulness": "1/1", "author": "Scott L."}, {"rating": 5.0, "review": "Works perfectly. Plugged it in, hooked it to wifi & started streaming!!! Movies come in picture perfect. Best part is you can pause, rewind & forward np!! Great job amazon!!!!", "verified": true, "helpfulness": "0/0", "author": "Mertle"}, {"rating": 5.0, "review": "I've been an Amazon Prime member for years but have very rarely taken advantage of all the movies that can be streamed for free. I'm just not a fan of watching movies on my computer or tablet. With the Fire Stick, I can finally watch all those movies on my television. The user interface is easy to navigate and runs smoothly.I have a moderately slow internet connection and was afraid I'd have to constantly wait for the videos to 'buffer' but so far I haven't had any problems. I love the HD picture quality! Might not be 100% that of a blu ray, but it's close. Includes awesome apps like Netflix, Hulu Plus, Pandora and more.OVERALL: Everyone needs one of these TV sticks, whether it be Amazon's or Google's or whoever else's, but for Amazon Prime members, this is the one you MUST get. It makes watching Amazon Prime movies unbelievably easy and also makes it easy to rent new releases. Add the Netflix capability and so many other apps, it's the coolest thing ever. So glad I purchased!", "verified": true, "helpfulness": "0/0", "author": "Tyson"}]