[{"rating": 2.0, "review": "Never could get it to work", "verified": true, "helpfulness": "0/0", "author": "scott morton"}, {"rating": 5.0, "review": "It works much better than any other streaming device's  I've used.", "verified": true, "helpfulness": "0/0", "author": "tim ramirez"}, {"rating": 5.0, "review": "Installed quickly without problems.  If you do not have a close AC outlet to the back of the TV, you may need an extension cord to connect the power cable of the Fire TV stick.  The remote is nice to use because it does not require line-of-sight to work.", "verified": true, "helpfulness": "0/0", "author": "ssondall"}, {"rating": 5.0, "review": "Great item for the price.", "verified": true, "helpfulness": "0/0", "author": "Sherri C."}, {"rating": 5.0, "review": "Really east to install and use", "verified": true, "helpfulness": "0/0", "author": "James B Vargas"}, {"rating": 5.0, "review": "Amazing.  I love amazon, and I love the firestick.  Moreso, I love that apple no longer has me pinched by the tail overcharging for everything.  Amazon is awesome.", "verified": true, "helpfulness": "0/0", "author": "Ben Dunwell"}, {"rating": 5.0, "review": "love the quality of picture and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Marjorie C. Fattori"}, {"rating": 5.0, "review": "Bought it and have been using it every day.", "verified": true, "helpfulness": "0/0", "author": "Lee Xiong"}, {"rating": 1.0, "review": "This is not streaming content for me very well. It's hit or miss but seems to mostly be a miss. I've resorted to hooking my computer up to my TV in the meantime (which streams everything just fine). I mostly use Hulu, but it does it with all of the apps.Any comments or suggestions? Anyone else having any issues? I've switched it to three different HDMI ports on my TV as some have suggested with no luck. Thinking about send it back shortly.", "verified": true, "helpfulness": "0/0", "author": "Darwin K."}, {"rating": 4.0, "review": "Easy. Remote is awesome. A little clunker interface when using other apps to watch video, but maybe I just haven't explored it enough. I enjoy it more than my AppleTV. I just wish my television would turn off when the device times out like it does with the other devices hooked to it.", "verified": true, "helpfulness": "0/0", "author": "Laura"}]