[{"rating": 5.0, "review": "easy installation - the remote works great. Video quality is great!", "verified": true, "helpfulness": "0/0", "author": "Compucat"}, {"rating": 1.0, "review": "Very limit use. I will be using a android tv sick instead of this.", "verified": true, "helpfulness": "0/0", "author": "Allen Farmer"}, {"rating": 5.0, "review": "Quick delivery and very east up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Absolutely the worst designed remote sold - zero instructions to insert batteries - I have wasted anhour trying to get the batteries into the remote - the product is completely useless", "verified": true, "helpfulness": "1/2", "author": "Gman"}, {"rating": 1.0, "review": "received product promptly. When I went to install it knocked out cable service to that TV. Amazon service was not able to help neither was email I got from them. Then called Geek Squad, ABT service(where we bought it). Finally called AT&T; cable and after an hour with them got TV service back. The stick appeared to be interfering with TV & all settings on TV. Could not change HDMI input channel or volume down from max!  Returning device & will not try this again", "verified": true, "helpfulness": "0/0", "author": "D Kahn"}, {"rating": 3.0, "review": "Netflix app is pretty good, but the Twitch and Plex apps are horrible. Can't stream 1080P on Plex because it's too choppy with this device and Twitch app is virtually useless. Can't login or even search for a specific stream...essentially useless..", "verified": true, "helpfulness": "0/0", "author": "Taylor M. Otto"}, {"rating": 4.0, "review": "For Amazon movies and TV shows the stick works  great.  Running plex, Netflix, ESPN, or other channels there are times the media has to buffer or freeze  to catch up. For the intended purpose of watching amazon movies is great.  easy to use and parental controls do keep my kids from buying movies.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "It does what I want it to.  Easy to set up and use, If you have a prime account you should get one of these.", "verified": true, "helpfulness": "0/0", "author": "Jamie Frada"}, {"rating": 5.0, "review": "Works fine. Arrived with hassle free packaging. Plugged into the TV for the first time and it was already tied to my amazon account.", "verified": true, "helpfulness": "0/0", "author": "California Guy"}, {"rating": 5.0, "review": "Lots of content", "verified": true, "helpfulness": "0/0", "author": "S.K. Zuehgelstein"}]