[{"rating": 1.0, "review": "I ordered this with the intent of using it on a tv in my husband's workout area. He isn't very good with technology but can operate Samsung Smart TV features on our tv's that are wifi equipped.  I assumed this would be super easy to use. I've used apple tv and other similar devices but I couldn't get past registration with this device. It kept telling me my amazon password was incorrect and it wasn't (yes I am 100% sure) and I kept getting a notification that if I had enabled device notifications to check my phone (???) that totally confused me but I checked my phone and nothing was there.  Also checked email.  THEN I looked online and saw that others have had the same problem and there are links to connect with the \"fire tv team\".  Problem is that I needed something that was virtually fool-proof in order for my husband to use it. So unfortunately it's going back. I wanted to love it and was excited to get it but the set-up glitch made me nervous", "verified": true, "helpfulness": "1/1", "author": "Picky Customer"}, {"rating": 5.0, "review": "Excellent streaming device, plug it and play it.", "verified": true, "helpfulness": "0/0", "author": "Inder"}, {"rating": 5.0, "review": "I needed to purchase this since I have an older TV but it  seems to work very well. I really like having the Amazon Prime, it has many options for programs and movies to watch that I might have missed", "verified": true, "helpfulness": "0/0", "author": "Mimi"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "melissa koch"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Angel Rosa"}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Corinne Lucas"}, {"rating": 1.0, "review": "I received one of these as a gift.  I was excited when I opened the box to see what all it would do.  I installed it, as directed by the instructions, signed into my home wifi, it went thru its update process, and then it asked me to sign in with my amazon account info.  I have an amazon.com account with a credit card account attached and also set up for \"1-click\" operations.  I still can not get signed on.  I went to help and went thru so many hoops I got dizzy.  I am sure that this is a good product - others seem to like it.  So in Summary:  HEY AMAZON - YOUR \"HELP\" SUCKS!!!!!.", "verified": false, "helpfulness": "0/0", "author": "Frustrated (Very)"}, {"rating": 1.0, "review": "I bought my fire stick from Best Buy. It didn't work well at all. And I tried to return it to Best Buy and they said Amazon is responsible. Amazon said Best Buy was responsible . So I got  stuck with a  piece of junk .", "verified": true, "helpfulness": "2/3", "author": "Amay"}, {"rating": 5.0, "review": "Works great,,", "verified": true, "helpfulness": "0/0", "author": "Tina Tekavec"}, {"rating": 5.0, "review": "Absolutely love it!!!", "verified": true, "helpfulness": "0/0", "author": "S Dominguez"}]