[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Treasured Smiles"}, {"rating": 5.0, "review": "Good stuff", "verified": true, "helpfulness": "0/0", "author": "Zinz \"Z\""}, {"rating": 5.0, "review": "I love it! With Kodi works wonderful!", "verified": true, "helpfulness": "0/0", "author": "Camelia Lazarescu"}, {"rating": 3.0, "review": "I am giving this item 3 stars because I am unable to watch HBO Now with this product.  HBO GO is available but the two services are different and since my reason for buying the Amazon fire stick was to avoid having cable or satellite service and still be able to watch my favorite HBO shows this device does not meet my satisfaction. Other than that the device works fine and was easy to set up. I have even unplugged it from one television to another without having to reastablish my connection to wifi.  I'm not very tech savvy and the setup with this was very easy basically plug it in and you are ready.  My husband has an iPad and I find we still use that to watch shows and news more than using the fire stick.", "verified": true, "helpfulness": "1/2", "author": "Dawn hicking"}, {"rating": 2.0, "review": "It is difficult to use.", "verified": true, "helpfulness": "0/1", "author": "Debra Schmidt"}, {"rating": 5.0, "review": "Works great love it", "verified": true, "helpfulness": "0/0", "author": "Ron L Blanch"}, {"rating": 5.0, "review": "Many programs without having to pay.  The video resolution is great, and it is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Michael Haney"}, {"rating": 5.0, "review": "This device along with my Amazon Prime subscription are just awesome? I wish I would've thought of this sooner. Via Wi-Fi we get to watch shows/movies/play games effortlessly. The device is extremely user friendly & it is very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Mario E. Arroyo"}, {"rating": 5.0, "review": "This is the best thing I've ever done with my TV since going flat screen and adding HD! I disconnected my satellite service and only use the Fire Stick and have not been happier in terms of TV entertainment. In addition, the HD quality is outstanding!! I have never seen it so clear and I was very happy with the quality the satellite service provided! Obviously, I highly recommend it.", "verified": true, "helpfulness": "1/1", "author": "Patti"}, {"rating": 5.0, "review": "it wasn't easy to figure out. However the few things I have figured out I really like. So much better than cable!", "verified": true, "helpfulness": "0/0", "author": "Mieghan Damron \"Mieghan Damron\""}]