[{"rating": 5.0, "review": "I got this expecting to only use it for Netflix but now i'm using it for way more than that! It has a built in Mira-cast adapter which lets me mirror my android phones screen wirelessly to the TV.a few months ago i bought a Mira-cast adapter for $60  but returned it because it would artifact the games and movies and lag considerably, however with this fire stick there is absolutely no problems out of the miracast function.On top of all that i can sync up youtube and control it through my phone while its playing on the tv. I bought 2 of these on black Friday for $24.99 and my sister bought the Google crome cast for the same price.After seeing my fire stick,she actually went back to the store and exchanged it for a fire stick!! This is the best $25 i ever spent.", "verified": false, "helpfulness": "0/0", "author": "Anthony W. Allison Jr. \"wayne\""}, {"rating": 5.0, "review": "Good", "verified": false, "helpfulness": "0/0", "author": "pedro"}, {"rating": 5.0, "review": "VERY HAPPY WITH MY PURCHASE.", "verified": true, "helpfulness": "0/0", "author": "Debbie Robinson"}, {"rating": 5.0, "review": "It was easy to set up. It took a moment to figure out which input it was coming over. For us it was HDMI 4. I can't get it to work with our surround sound system but our TV has pretty good sound on it's own. I'm not sure if is something I did wrong but other than that, I love it. Great user interface. Easy to add new channels. I also own a Roku I like this remote better. I don't have to look at it as much to navigate.", "verified": true, "helpfulness": "0/0", "author": "Charlie & Lola's Mum"}, {"rating": 2.0, "review": "I have to keep resetting the controller because it keeps saying can't do whatever or can't find home. I'm thinking of returning this one because I think it is flawed", "verified": true, "helpfulness": "0/0", "author": "Corinea L. Al-Sayed"}, {"rating": 5.0, "review": "Enjoying this product. I have the fire TV also. Both products are awesome.", "verified": true, "helpfulness": "0/0", "author": "E & J"}, {"rating": 4.0, "review": "Like it better than my chromecast. Not thrilled about it needing to be plugged into power and not just the TV like the Chromecast. Also stutters a lot when using Plex on anything over 4 mbps. Might be a plex issue though. Hopefully VUDU comes to it soon.", "verified": true, "helpfulness": "0/0", "author": "Chris Travis"}, {"rating": 2.0, "review": "Constant issues with connections.", "verified": false, "helpfulness": "0/0", "author": "Kathy C."}, {"rating": 5.0, "review": "yes tha best", "verified": true, "helpfulness": "0/0", "author": "kelvin"}, {"rating": 4.0, "review": "Love this product.", "verified": true, "helpfulness": "0/0", "author": "ali Watson"}]