[{"rating": 3.0, "review": "works fine  needs more low cost rentals", "verified": true, "helpfulness": "0/0", "author": "What for"}, {"rating": 5.0, "review": "amazon nation proud member. amazing value. simple set up. flawless operation.", "verified": true, "helpfulness": "0/0", "author": "Neil A. Depuy"}, {"rating": 5.0, "review": "Love it!  Even a technically challenged oldster such as myself was able to install it and actually use it!  Good buy - highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Tunergal"}, {"rating": 5.0, "review": "I am probably one of the least tech savvy people out there. That being said, this was super easy to install/setup and use. I'm an amazon prime member and all of my account info was conveniently preloaded on to the fire stick. If you want an easy and efficient way to get movies, music and TV, the fire stick is the way to go.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 4.0, "review": "I enjoy one click and you there, however, I do not have Amazon prime yet, and that makes it difficult to see any movies. I was able to connect to Netflix and Cbs news as I do not have tv in my apartment. Overall a nice tool specially if you have prime.", "verified": true, "helpfulness": "0/0", "author": "Sergio de Freitas"}, {"rating": 1.0, "review": "After 1 week of this device working correctly, the apps stopped. The only app that works is Netflix. After 1 hour of being On the phone with customer service, they blamed the apps, our service provider then hung up on me.", "verified": true, "helpfulness": "0/0", "author": "Kaitlyn Brents"}, {"rating": 1.0, "review": "I am really disappointed wit this services. I have apple tv and wanted to try this in my bedroom in my vacation home like I have my apple tv in my living room.  Well my vacation home is in Mexico, guess what. They block all IP's from Mexico to watch any prime content so my prime account and \"fire tv stick\" are both worthless..  Thanks for nothing Amazon. I will stick to Apple TV from now on.", "verified": true, "helpfulness": "0/1", "author": "S"}, {"rating": 5.0, "review": "This is an amazing item, my third one,  BUT could you have made the remote battery compartment any harder to open???  If the point is a nice sleek remote it's all scratched up by the time you get it open to insert batteries.", "verified": true, "helpfulness": "0/0", "author": "Sally Hicks"}, {"rating": 5.0, "review": "Works flawlessly - not much more to say.  I've never had a dropped wifi signal and remote is nice and small and easy to use.  Great product, Amazon!  Love using the various apps and really enjoy the android integration.", "verified": true, "helpfulness": "0/0", "author": "Michael Desimone"}, {"rating": 5.0, "review": "Happy customer", "verified": true, "helpfulness": "0/0", "author": "Cathy"}]