[{"rating": 5.0, "review": "Love it so much to watch so easy to use", "verified": true, "helpfulness": "0/0", "author": "Marisa Vozella"}, {"rating": 1.0, "review": "Expected better from Amazon not impressed its just like the game stick which you can buy from gamestop for $15", "verified": true, "helpfulness": "1/2", "author": "ASIM"}, {"rating": 4.0, "review": "Great device, i just wish it didn't need to be powered from the outlet and took power directly from the tv instead,  that's why 4 stars instead of 5.", "verified": false, "helpfulness": "0/0", "author": "John Wood"}, {"rating": 5.0, "review": "Love it....", "verified": true, "helpfulness": "0/0", "author": "patricia truitt"}, {"rating": 5.0, "review": "Easy to use and does what it should. Great product.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 2.0, "review": "we were very disappointed in this product.  first of all, the software had problems the screen kept freezing. Second, compared to our Roku it was far harder to navigate when it did work. Finally, since we already have Roku and Amazon Prime we were looking for internet access and HBO GO. This product had neither. If you want Netflix and Amazon Prime get a Roku. It is much easier to work", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I really liked this product and I highly suggest it but , the search engine is a little hard to use", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Very happy with it.  Great capability for the price if you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Engineer"}, {"rating": 5.0, "review": "Not bad at all. It's easy to use, easy to set up. If your TV has a usb, use it to power this device. Much faster and a cleaner look instead of being plugged into the wall. Doesn't take long to load videos. Video quality is nice too. I liked it so much, I bought three. Made my dumb TVs into smart tvs.", "verified": true, "helpfulness": "0/0", "author": "Ryan M."}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/1", "author": "jimc"}]