[{"rating": 5.0, "review": "I'm impressed.  For anyone who is reluctant because they're not a \"techie\" - well I'm a 70 year old great grandma and it took me about 10 minutes to get it up and working.  Very intuitive set up.Great picture quality.  Great sound quality.  Great selection of activities.  Movies, TV, Games and more. This is a gizmo that never comes with buyer's remorse.", "verified": true, "helpfulness": "0/0", "author": "Miss Barbara"}, {"rating": 5.0, "review": "Every bit as good as I expected, i am now using this instead of my apple tv which will not allow you to view Amazon Prime, will order another and not use apple tv at all.", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 1.0, "review": "Bought it for Miracast to mirror laptop computer with Windows 8.1.  It does not work. False advertisement...", "verified": true, "helpfulness": "3/5", "author": "tho"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Chas Crane"}, {"rating": 1.0, "review": "I plug it into my TV's HDMI port and all I get is a blank screen, even after reboot. I know the port works because I normally have my cable box output plugged into it. None of the online help is of any use for this fundamental problem. Any help out there?", "verified": true, "helpfulness": "0/2", "author": "Timothy C Smyth"}, {"rating": 4.0, "review": "I am liking this so far!  I must add, I am very limited with what I can do with the Fire Stick because I have a limited data plan.  I bought this in hopes that someday there will be different internet options in my area.I have watched a couple of movies through Amazon Prime and it worked flawlessly, I was quite impressed that it did not buffer at all.  I have watched a few videos and my son has played one game so far.  We just got it this week so we still have  a lot more to check out.  Set up was basically pretty easy, it initially had a hard time finding my internet so I used the included extender and also a booster cradle for my internet.  I downloaded the Amazon Cloud app for photos and am in the process of downloading my videos and photos onto the cloud.  Being able to see my pictures and videos on the big screen is going to be awesome!I would definitely recommend this to people who have unlimited data plans and who have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have a Roku-II and use it to watch Amazon Prime movies & TV shows, I added the stick to my TV in the eating room.  Its coneniewnt, but takes more button pushing than Amazon on the Roku", "verified": true, "helpfulness": "0/0", "author": "Stephen Anderson"}, {"rating": 5.0, "review": "Just got mine right before Christmas.  It works flawlessly!  Setup was easy, and the voice remoter that I purchased separately make it even easier to use.  The remote that comes with the stick is small and fits easily in the hand.  Navigation with the out of box remote is simple, but again I suggest you spend a few more dollars and buy the 'voice' fire tv remote for the stick.  You can pick applications (a serious amount free) to play games and enjoy more content.  The stick works off of a wifi signal, so make sure your router or other wifi device are working well.  I did not have a smart tv before I plugged the fire tv stick in to my tv and behold I don't need to buy another TV to get that functionality.  Also it helps if you look into becoming an AMAZON PRIME member.  You will actually save some money and add thousands of movies to your viewing pleasure", "verified": true, "helpfulness": "0/0", "author": "SBCochran"}, {"rating": 5.0, "review": "This little device is nothing short of fantastic. We have been streaming video for many years at our house and this thing is the best. Better than Sony Netbox, better than Xbox 360, better than Sony Blu Ray, and Better than a PS3. The app for your android phone is superb and the voice control within the app is perfect. Hookup could not have been easier and navigation is simple. I almost bought a Google Chromecast (Nothing Against that product), but I am so glad I waited and got the fireTV Stick for $19 via prime. We will be buying more of these!!! Keep up the great work Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love using this Amazon fire stick to stream TV shows and movies. The fast-forward and rewind actually show you the program moving rather than just the time like a lot of other streaming devices. Actually comes with the remote so that you don't alwsys have to have an iPod or smart phone to control it. Great for kids Tvs so they can use the remote.", "verified": true, "helpfulness": "0/0", "author": "Silver"}]