[{"rating": 5.0, "review": "Love it, fast load times, easy to use, always ready to use and screen saver is great.  Price is nice and haven't had any problems.", "verified": true, "helpfulness": "0/0", "author": "TheCragStar"}, {"rating": 5.0, "review": "I love this Amazon Fire Stick! Now I can watch all of my Amazon prime movies and series on my big screen TV without running a ten foot long cable to it from my computer.  All you need to do is connect it to the HDMI port on the television, spend maybe under ten minutes to set it up and you're in business. Actually it pretty much installs itself by downloading the necessary software needed. The user just has to type in (using the onscreen keyboard that pops up) his or her account info, passwords etc and that's all there is to it. As soon as i connected the stick to my TV it instantly found my router which is located about eight feet from the television. Once it does that it starts installation and you just follow the simple and easy to understand onscreen instructions. Once it is installed, up and running you just use the provided remote to navigate up and down the menu. It's so great to see your prime movies, watch list and games appear on the television screen and so easy to access them as well. There is no lag time and no buffering to deal with. Navigation is smooth and easy and I'm actually watching one of my movies using the Fire stick right now.Get this and trust me you will not regret it for one moment.", "verified": true, "helpfulness": "0/0", "author": "NY Shopper"}, {"rating": 5.0, "review": "It's awesome I recommend it to everybody!", "verified": true, "helpfulness": "0/0", "author": "AMY DUARTE"}, {"rating": 5.0, "review": "This little stick is awsome so easy to use plug it in and your good to go watch hundreds of movies I got my daughter in law one next I'm getting my mom one what took them so long to come up with this little miracle", "verified": true, "helpfulness": "0/0", "author": "karen"}, {"rating": 5.0, "review": "I love this gadget!!! Tons of things to Watch, music and games! RECOMMEND!!", "verified": true, "helpfulness": "0/0", "author": "Rod Hammer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "C.Criner"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Miguel Angel Adrian"}, {"rating": 5.0, "review": "Fire stick was easy to set - up. Well worth the retail price.", "verified": true, "helpfulness": "0/0", "author": "bob vaughn"}, {"rating": 5.0, "review": "Works good in comparison to my Fire TV", "verified": false, "helpfulness": "0/0", "author": "Ramonrey"}, {"rating": 5.0, "review": "Buy lt", "verified": true, "helpfulness": "0/0", "author": "david anderson"}]