[{"rating": 4.0, "review": "Awesome so far!", "verified": true, "helpfulness": "0/0", "author": "Mokihanna"}, {"rating": 2.0, "review": "One of the first to own the Fire TV Stick w remote and although I'm a huge fan of Amazon I was disappointed by this item.  The remote just isn't designed very well and it loses signal/shuts down more often than my ROKU.  Remote design just doesn't make sense to me---u do not place the home button so close or in the middle of the most used functions.  Look at ROKU, the home button is far away from the play, rewind, forward.  Most remotes are designed this way and in Fire TV remote hitting the home button takes you completely out of the program or app you watching.  Very annoying.", "verified": true, "helpfulness": "1/1", "author": "DJL"}, {"rating": 5.0, "review": "Birthday gift for my mom she loved it very easy for her to use once set up ..", "verified": true, "helpfulness": "0/0", "author": "sarah garza"}, {"rating": 4.0, "review": "Wireless connectivity a bit jumpy. My wireless router is 3ft away and still not a smooth stream.", "verified": true, "helpfulness": "0/0", "author": "Juan Alcaraz"}, {"rating": 3.0, "review": "I've owned this item for approximately 6 months. Other positive reviews are true, this product is great and Amazon did a awesome job of creating a small and portable entertainment stick. I will not cover all the things that I like about the Stick, but I did purchase this item for one specific purpose: to attach to the HDMI port in our minivan to allow the kids to control their own content on long trips.For my intended purpose, the Stick connected easily to my phone's personal hotspot and streaming (for the most part) produced great quality for our 7-inch minivan screen.  On AT&T;, when I had at least 2+ bars of service, the Stick had limited buffering. I attribute this to good management of the Stick's streaming quality.I mostly have no complaints about the Stick's performance. However, my intended purpose is to allow our kids control their content on the services we use without me having to help them: Amazon Prime, Netflix, and Hulu Plus. Apparently, the Stick doesn't enjoy being turned off abruptly, such as when the car is turned off or if you have the Stick attached to the USB port on the back of your TV, when you turn the TV off. For me, this is the point of a device like this, to attach it to the display's power supply so that it powers on and off when you turn your display on and off.When I opened the Stick, there were two warnings to use only the power supply that came with the Stick. This is worrisome because I think most people will use the USB port on the back of their TV to power the stick (like we do when it's not in the minivan) or use the USB port (or a regular plug if you have one) in your car. Having to use a regular plug is troublesome because there are no more available plugs where our TV is and it's way more convenient and logical to use the USB port. Additionally, for setups in our house where the TV is mounted, I don't want to see a wire hanging down (we move the Stick around the house and into the minivan for long trips).I'm not sure if using an alternate than the recommended power supply is the issue, but services other than Amazon lose their login credentials from time-to-time. This is a huge inconvenience since the kids cannot log into the service by themselves. It also shouldn't happen. I could understand if this happened from during major firmware updates, but not randomly. If anybody has young kids, then you'll understand when they expect to turn on the TV and settle in for a 12-hour car ride, it's a major hassle when Netflix is asking for login credentials.", "verified": true, "helpfulness": "2/3", "author": "Orange Olives"}, {"rating": 3.0, "review": "Seems to lose internet connection quite often. It isn't my internet because my computer doesn't seem to have that problem. I'm thinking I should have gotten the Fire TV instead", "verified": true, "helpfulness": "1/1", "author": "Traci"}, {"rating": 5.0, "review": "Love Love Love this fire stick what a great tool so worth it, many shows cant say enough good about this product except to get it you wont be disappointed Thank you Amazon", "verified": true, "helpfulness": "0/0", "author": "star"}, {"rating": 4.0, "review": "Pretty cool device. Had a chance to compare it with the Apple TV. Both devices are awesome.I had to use a VPN router to access some of the TV shows though while overseas. On last trip back home, took it back and it works great.  You really need the Prime service to avail the advantages.Somehow could not hook up my bluetooth keyboard to it.One less star since most of the shows are in a rather blurry format - definitely not HD. Maybe its due to the slow speed on my internet connection overseas.", "verified": true, "helpfulness": "0/0", "author": "husainkb"}, {"rating": 1.0, "review": "Would not purchase again I feel it is deceiving definitely not worth it!", "verified": true, "helpfulness": "0/0", "author": "chris brogan"}, {"rating": 2.0, "review": "I was surprised to see that I had to pay for the movies.  The offer gave me the wrong impression.", "verified": true, "helpfulness": "1/2", "author": "Bonita Kiester"}]