[{"rating": 5.0, "review": "Finally started using it last week - Love it so far.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We call the Fire TV Stick \"the magic streaming gizmo\". It has freed my laptop from being the source of all things streamed, which pleases me greatly. It does everything it claimed it would do. As subscribers to Amazon Prime and Netflix, we are now able to access both services quickly and easily. There is none of the annoying buffering that used to interrupt our viewing via our broadband connection, even though this thing uses our broadband connection too. I don't understand it, and I don't need to understand it. As long as it keeps working, I'm a happy camper. If it ever stops working (as reported by some reviewers here) I'll be back to update this review. So far, though, so so SO good!", "verified": true, "helpfulness": "0/0", "author": "CritiCal \"CritiCal\""}, {"rating": 4.0, "review": "Great alternative to Roku.I've used both and so far the Fire Stick is easier to use.  It's also pretty handy to be able to power the device from the USB port on your TV if your TV has this port available.  One less thing to plug into the wall.", "verified": true, "helpfulness": "0/0", "author": "Kris M. Lethin"}, {"rating": 3.0, "review": "I'm really enjoying my fire stick! So easy to use, and came quickly", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 4.0, "review": "I'm satisfied with the product overall. It does what it says it will do, and it's really convenient to move it between rooms to have access to whatever I'd like to watch. The only problem I've found is that it will randomly sign me out of my username and password with Netflix and Hulu so I have to reenter it about every five or six times that I use the device. It wouldn't be such a pain in if we had a keyboard to use to input the information rather than the little remote. I now regret having such a long email and password! Ha! Regardless, I'm a fan!", "verified": true, "helpfulness": "0/0", "author": "Heather Appel-Bailey"}, {"rating": 5.0, "review": "Works as advertised!", "verified": true, "helpfulness": "0/0", "author": "Gee Taylor"}, {"rating": 5.0, "review": "This is a knock out product.  Nice menu easy to use and integrates music and pictures really well", "verified": true, "helpfulness": "0/0", "author": "Jesse Rivera"}, {"rating": 5.0, "review": "This was the best $40.00 that I ever spent. Everything that we used to watch on our laptops and phones, is now on our big screen. Plus we always use the pandora app for music. Fire stick gets used every day... Love it !!!", "verified": true, "helpfulness": "0/0", "author": "patti steben"}, {"rating": 4.0, "review": "It's a great device. I love that I can disconnect and reconnect to any of the TVs in my home. However, I found that when I connect my Firestick to my Samsung 40\" SmartTV it keeps shutting on and Off and resetting Itself. Amazon should be a bit more clear on what TVs are compatible without this issue. I can still watch it, but it's frustration when the movie gets Juicy and then It's a Black screen.", "verified": true, "helpfulness": "0/0", "author": "All4Selene \"Shirley E. Martinez\""}, {"rating": 2.0, "review": "It doesn't do youtube well, and jitters a lot in the UI", "verified": true, "helpfulness": "0/0", "author": "Jason"}]