[{"rating": 1.0, "review": "Set my alarm at 7am to get the happy primeday sale. THEY ARE GONE.  Amazon could do better than this offer next time.", "verified": false, "helpfulness": "3/8", "author": "Weekend binger!!!"}, {"rating": 5.0, "review": "We give these out at my work often in drawings. They are very user friendly and affordable. Our residents love them!", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 1.0, "review": "And shame on you!  Happy Prime Day indeed!What's up with this wait list thing??? How about some REAL customer appreciation?If you're going to have a special sale day like this, you need to make it worthwhile to Prime members. Being completely \"sold out\" of this item (or any of the few other truly worthwhile things that people actually want) in the early morning, with \"wait list full\"- why even bother? Did you only designate 75 units for this \"sale\" or something equally ridiculous? Surely the number of Prime members far exceeds that number, whatever it is... Now here's a thought: for those of us who missed out on this deal, send us a special email coupon so we can purchase this item at sale price?Seems to me a major focus behind the Fire TV Stick (well, besides the streaming in general...;-) is to facilitate Prime members in accessing Prime instant video, yes?We've already paid you money for this privilege- now how about you let us pay you some more money (at a reduced price-) so we can avail ourselves of this privilege with even greater ease and convenience?Walmart has already bested you on real deals today (yes they did!). Don't let them show you up! Take my suggestion. PLEASE. Give over with that discount coupon- support your Prime members! Give us the chance to give a true review for this item- which I will happily do.Don't just leave us hanging!!!", "verified": false, "helpfulness": "4/9", "author": "kittykatmom \"jack of all arts\""}, {"rating": 2.0, "review": "Unhappy Prime Day Sold out before I even had a chance. Not too cool Amazon", "verified": false, "helpfulness": "2/6", "author": "M. Arends \"Mayhem\""}, {"rating": 5.0, "review": "This is really a 4.5 star review.Pros:- Broadcasts in HD-Allows sideloading-Comes with a lot of appsCons:- Interface isn't super user friendly- Sideloaded apps don't come up in the\"home\" \"recently used\" apps section.- Could use a stronger processor.Overall this is a phenomenal stick and will do 95% of things wonderfully. Looking back I wish I had paid a little more for the Amazon Fire TV so I could plug it directly into a router.", "verified": true, "helpfulness": "0/0", "author": "Matt G"}, {"rating": 1.0, "review": "Com'on Amazon. Very disappointed.", "verified": false, "helpfulness": "2/7", "author": "D. Carey"}, {"rating": 4.0, "review": "The amazon fire stick is great! Easy to install to support the use of wireless Internet.", "verified": true, "helpfulness": "0/0", "author": "Troy A. Thibodeau"}, {"rating": 4.0, "review": "Works excellent and very user friendly. Easy to connect and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Transforming Lives, LLC"}, {"rating": 1.0, "review": "So this item was on the lighting deal for $24, as soon as I woke up and took my daughter to her swimming class early in the morning it was fulfilled. However it was on the wait list that I could join.  I tried too join the wait list on my fire phone and on my desktop since both said it was available to join the wait list,  and the button would reset not showing anything other than the wait button would appear again to join.  I called to see if their was something wrong with the website and I was told it was fulfilled on their selling quota and the wait list was full too.  I reiterated that, both my fire phone and desktop said it was available for the wait list. They just said sorry,  bye can't help.  S**** promotion for prime members when they can't get the deals that are offered because it is limited, might as well just not do it. Some of us have responsibilities other than to be first in line to get a deal,  that's why we joined prime to get the deal without the chance of not getting it.", "verified": false, "helpfulness": "3/8", "author": "David Roman-Nichols"}, {"rating": 1.0, "review": "This is the biggest failure on Prime day that will leave a bad test in mouth!", "verified": false, "helpfulness": "4/11", "author": "T. PANDYA"}]