[{"rating": 4.0, "review": "I bought this on a whim when it was $20 preorder and glad I did. Even though I have a computer hooked up to my TV, I'm finding myself using the stick. I get better picture quality and faster loads. Setup was fast and intuitive. Loads are pretty fast.My main quibbles:The phone app remote is very twitchy and hard to control.The Amazon Music app lacks search feature so you have scroll individually through artists and albums. If you have thousands of artists in your library, that's impossible. You have to use the main search and select results from music as opposed to prime videos. then once you find an artist, you have to select a song before you can go to a list of albums. I hope they fix this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "First off, this product isn't for everyone. No product really is, but for me and many like me, it's a great product. Let me also say that I may be slightly partial, because, although I did not get it for free, I did get it half price during the promotion.Like many people, my family has cut the cord and we just use internet services and local streaming of our own movies such as:NetflixAmazon Prime StreamingPlex (for streaming local content from our network)NBA Gametime (to stream NBA League Pass Broadband directly to TV)Hulu Plus (occasionally we get a month. Hate the ads, love some of the content)HBO Go (we'll be subscribing when it is available by itself. Currently pay a friend who has Dish to subscribe so we can use his HBOGO login)Pandora music (free, great for parties)Amazon Music streaming (free, but only has your Amazon music unless you also subscribe to streaming music. Prime Music is awesome, but requires you to manually add albums from their library before playing on the stick-- you can't just browse all and play like you can on the IOS app for iphone)Over the past few years, we've ripped all of our DVDs to PC, so Plex basically lets us use a network hard drive as our own personal movie jukebox. Between that and the streaming services listed above, the device is a one-stop shop. We rarely even change TV inputs unless we are playing games. FireTV is where we go for music, movies, TV, etc.The good+Streaming works flawlessly for all apps tried, except for NBA League Pass which has an occasional hiccup. It looks like it may just be the programming of the app+The 2-3 second boot up for Netflix films isn't terribly noticeable+lots of options+game apps work relatively well with any bluetooth controller, but are limited graphically (still, there are some cool games for it) It's never going to be a gaming console, but you can play a quick round of Tetris while you wait.The bad-well, there is some lag when accessing stuff other than Amazon's stuff. I don't have an issue waiting 3 seconds to pull up an episode I'm about to binge watch for 1-2 hours, but some may complain. It's definitely less pronounced than my Apple TV2, but not instant like the Fire TV box.-Amazon's stuff is front and center and dominates the UI (for obvious reasons), but the \"recent\" bin makes it easy to get to other apps-Within Amazon streaming, it's often difficult to determine what is free and what is a rental. the little blue stripe at the top indicates it, but you are better off looking through their Prime library than actually looking for specific movies.-No easy way to directly stream content to the stick/TV a la Chromecast. As I've said-- I'm thrilled watching streaming services and local content, but I havent found a way to mirror a web browser or tablet screen onto the device. For me, that is inconsequential. For others, that may be a game breaker. Just know what you are in for.-minor hiccup, but with a top-rated USB power port, it told me that the USB port wasn't supported, but still worked flawlessly. Maybe that is an error.It's basically an elegant stick for a cheap price that does everything it does well. It's beefier than all the other \"stick\" form factor streaming devices, but weaker than all the \"box\" streamers (duh). It's missing a couple of features that not many people will notice. It's also held back by the (intentionally?) bad UI within the Amazon Streaming App. Still, this was the best purchase I've made this year at $20 and at $40, it would still be worth it.", "verified": true, "helpfulness": "4/4", "author": "W. baron"}, {"rating": 5.0, "review": "Very easy to set up and use. The remote is basic, but does the job well.Slightly different use case than Chromecast. With Google's dongle you absolutely require a second device (phone, tablet, PC) to control the playback.  Fire TV Stick's remote is quite sufficient for 99% of all navigation and control.  It only get cumbersome for text searches.  The Stick is a low-spec version of Amazon's Fire TV, so don't expect to play resource intensive games on it.  Basic games work just fine on it though.", "verified": true, "helpfulness": "0/0", "author": "Dmitriy Briskin \"DB\""}, {"rating": 5.0, "review": "Makes accessing my amazon prime easy.  I like the interface.  It comes with a handy getting started video that lets you know how to work the fire tv stick right away.", "verified": true, "helpfulness": "0/0", "author": "Marc C Porter"}, {"rating": 5.0, "review": "I happened to go into Best Buy on Black Friday and the Fire TV Stick was such a great price, the techie in my had to give it a try.  Oh boy am I glad I did!  I currently have two Apple TVs, but if I hadn't already bought a bunch of movies on iTunes (or there was a way to stream them through my Fire Stick), there is a good chance I'd switch to Amazon.  The interface took a little getting used to, but ultimately, it offers more everything Apple TV does and more (games) at half the price.  Truly love it!", "verified": true, "helpfulness": "0/0", "author": "Brendan Krasinski"}, {"rating": 5.0, "review": "I've used Chromecast, Roku, Apple TV, smart tv, smart bluray, and now Fire Stick. Works as expected. Remote is almost as nice as ATV's. If u r a Trekkie, the Amazon Instant video source for Star Trek TNG is much better quality than ATV. Appears like higher rez. I also see less \"combing\" in the moving video with Fire stick vs ATV.", "verified": true, "helpfulness": "0/0", "author": "J. Banville"}, {"rating": 5.0, "review": "I am in LOVE with this!  It works much better than any other streaming devices we have in our home! I would recommend to everyone.", "verified": true, "helpfulness": "0/0", "author": "Nichelle Clubb"}, {"rating": 5.0, "review": "Wonderful way to organze everything you want to view.  Its like a Google Chromcast on steroids !!", "verified": true, "helpfulness": "0/0", "author": "eddie01"}, {"rating": 5.0, "review": "just starting to use and enjoy this. Easy to set up!", "verified": true, "helpfulness": "0/0", "author": "MJD"}, {"rating": 5.0, "review": "I really had no expectations for this when I ordered it, but it was on a special sale for $20 and I'd wanted a streaming device for a while. The response time is probably the best feature, and if you have Prime (which you should because it's worth every penny) it's really convenient accessing Amazon Video and Netflix. The device streams extremely quickly off minimal connection speeds. The only downside I can think of is the absence of a reboot feature should the device freeze (which it's only done once during my experience) in case you lose your internet connection. It has completely replaced the need for cable tv with very minimal adjustment needed. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Michael Waldo"}]