[{"rating": 4.0, "review": "First off, as a pre order device, it's pretty solid. The software is easy to use. The device is easy to set up, a part they forgot to mention is the external power source used to give it some oomph. Still, it wasn't an issue.My main concern is the ability to prevent unauthorized purchases made by children. I'm excited an iOS app is coming.", "verified": true, "helpfulness": "0/0", "author": "David H."}, {"rating": 5.0, "review": "Fast , Simple ,easy , and fun. Also use my cell to control it and it works great.", "verified": true, "helpfulness": "0/0", "author": "Count"}, {"rating": 5.0, "review": "Surprised at how well the Fire Stick worked.  Actually works better than my Chromecast, that seems to need to be re-plugged in before each use.  The Fire Stick starts right up.  I like the remote.  Sometimes a little sluggish in response, but overall my goto device now. (Out of Chromecast, Roku 2 and Apple TV 3)", "verified": true, "helpfulness": "0/0", "author": "the hoz"}, {"rating": 5.0, "review": "Excellent device for any monitor/TV with an HDMI port.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "This product has been really great.", "verified": true, "helpfulness": "0/0", "author": "Samantha A. Crowden \"T crowden\""}, {"rating": 5.0, "review": "We have a Roku3 and we have a XBox 360, I figured why not an Amazon Fire Stick on our 3rd TV, so far it's simple we like the interface, and I actually like buying movies I find re-watchable so it's nice that I can buy them on Amazon.com right from my TV.  I personally find Amazon.com to be a reliable company proving it's longevity and titan like business ethic which comforts me in building a cloud library of movies thru amazon with no regrets. So far I like it's size, and setup is a snap.", "verified": true, "helpfulness": "0/0", "author": "Raul Jig"}, {"rating": 4.0, "review": "Arrived early, well boxed, installed easily, works well. Am now able to carry out a comparison with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Harmon Harris \"SD Rowdies\""}, {"rating": 4.0, "review": "Very good, but would like to access non Amazon sites quicker & easier.  Not sure the search feature covers all sites?", "verified": true, "helpfulness": "0/0", "author": "Sal"}, {"rating": 4.0, "review": "I am loving it so far, it works great if you have prime membership, so you can get to watch all the prime content. The remote is quite good for watching prime content. I havent used it on Netflix or other apps yet. The only trouble is when you have to type in passwords or look for titles you have to use the stick to navigate. I have alternatively used the android app remote for this TV stick and that works quite well (the apps has other changes that are required). But overall a good product if you have a lot of prime content that you would like to watch.", "verified": true, "helpfulness": "0/0", "author": "Siddarth Chandrasekaran"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Tiffany Owen"}]