[{"rating": 1.0, "review": "Thing broke after using it once. Keep trying Amazon.", "verified": true, "helpfulness": "1/4", "author": "C. Bowser"}, {"rating": 4.0, "review": "Awesome!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Setup was easy. The device did not like my wireless network at first, but performed to expectation after a reset. Bought it early for 50% off and am very happy with the device for that price point. I wish I had a chromecast to compare it to, but I do not. I use it almost exclusively for Netflix and Prime video streaming.", "verified": true, "helpfulness": "0/0", "author": "RF"}, {"rating": 5.0, "review": "As an Amazon Prime member I was fortunate to be able to order one of these for $19 via pre-order.  I am so glad I did, I am pleased with it.  It within 15 minutes I had it up and running as it is plug and go.  This is a great product if you are streaming Netflix, Hulu, Amazon Prime Instant or using pre-loaded apps (you can even stream video from media server using AllCast app).  Will definitely buy more!", "verified": true, "helpfulness": "0/0", "author": "Amy Wright"}, {"rating": 5.0, "review": "Works awesome!! I plugged it into a TV that is going on 8 years old and it now out performs our $1300 new Smart TV!", "verified": true, "helpfulness": "0/0", "author": "Chelsea"}, {"rating": 5.0, "review": "Very easy to set up, great reception and looks like all of the streaming options I choose are available. It even plays my cloud music. Nice product.", "verified": true, "helpfulness": "0/0", "author": "ibm360 \"old geek\""}, {"rating": 1.0, "review": "Very limited in what I exactly offers, must remain  plugged to experience optimal results", "verified": true, "helpfulness": "1/5", "author": "Lisa Hernandez"}, {"rating": 3.0, "review": "Power cord is too short and antenna is weak.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The FireStick is very responsive and easy to use.  The ability to power it through the included adapter is great because it allows you to instantly begin watching content when the TV powers on.", "verified": true, "helpfulness": "0/0", "author": "JJ Lee"}, {"rating": 5.0, "review": "Work exactly as expected. Hopefully will expand to allow you to use more apps such as facebook and instagram from your phone and shoot them on the tv just as youtube does.", "verified": true, "helpfulness": "0/0", "author": "Shane"}]