[{"rating": 5.0, "review": "Smooth setup! Love the fire tv stick, so easy to use, puts cbromecast to shame. Prefer this over my ATV2", "verified": true, "helpfulness": "1/1", "author": "H. V. Thompson"}, {"rating": 4.0, "review": "Seems pretty cool, needs more expansion to access other video services such as Warner and  MGM. Loads fast , easy to set up!", "verified": true, "helpfulness": "0/1", "author": "Richie Boyster"}, {"rating": 3.0, "review": "This device is just okay.  It didn't pick up my wi-fi very well - and I have excellent service throughout the house and with other devices.  It does have to load content despite claiming it doesn't have to.  I had pauses in my movie as well.  I'm also disappointed that the voice remote is not available for my iPhone yet.  What's up with that?On the plus side, I like Amazon Prime content.  I'm trying to use this to get rid of a couple of other items hooked up.  It looks like it might work out.  I just expected a little better from Amazon - I've been a fan for many, many years.", "verified": true, "helpfulness": "0/1", "author": "Andrew J. Norris"}, {"rating": 3.0, "review": "only tried it for few days now so not sure if it will be a winner or not.  I hooked it up in my bedroom not too far from my router and it would not even download the latest update.  So then I moved it to the living room which is closer to the router and same thing, so then moved to bedroom near router and the signal was better so I could at least download the update to get started.  Moved it back to living room tried to watch a netflix movie and started buffering about 3 mins into the movie, stuck on 25% for a while so I unplugged it, plugged Roku back in and worked perfect.  I then moved the fireTV stick back to the bedroom closer to router and worked good.So my conclusion is the FireTV stick does not have good wifi strength because my google chromecast and Roku XS works great in the other rooms.  I will still keep the firetv stick for $19 and just use it in the room closer to the router.The interface is OK and kinda of like the kindle interface which I never liked but I can deal with it for $19.I don't know if I would buy one for the full price and I would just go with Chromecast or Roku stick for that price.", "verified": true, "helpfulness": "0/1", "author": "Stem \"Stem\""}, {"rating": 5.0, "review": "I found this very simple to use.  I'm a bit technically challenged but had absolutely no problem getting it hooked up.  It was easy to learn the removed functions and I found watching Amazon Prime options very easy.  I would definitely recommend it for people who don't have computers or game stations hooked up to their TVs.  (I do have an old wii hooked up but found the Fire Stick much easier to use - with Wii, it seem to take a long time for the Amazon Prime to load through it.)", "verified": true, "helpfulness": "1/1", "author": "Skpy \"RPCV\""}, {"rating": 1.0, "review": "It pains me to say this,but, this is the most garbage Amazon product I have ever purchased...It can't sense a thing. It doesn't know when it is connected to a power source using the provided usb cord and power adapter...it doesn't know when it is connect to the internet and when it is connected to the internet I get a \"connect with errors\" message. When it is connected and working and you finally get to watch something it stop to buffer repeatedly. While watching ESPN using the ESPN app It stopped to buffer every 30 seconds. While watching a Amazon Prime show...it stopped to buffer 5 times during 20 minutes. There is no issue with my wifi and this product is about 15 feet from my wireless router.", "verified": true, "helpfulness": "1/4", "author": "Jeff S"}, {"rating": 4.0, "review": "I ordered this on release day. The only problem I have is when you fast-forward or rewind sometimes the sound gets out of sync with the video. (No Surround Sound, just HDMI into TV.) If I stop the show & restart it it will usually return to normal. This usually happens on amazon prime TV content at the moment. I also sometimes get a loud sound pop when I start a new episode. Overall, a great device for the money. Hopefully a software update will fix the sound issue.", "verified": true, "helpfulness": "2/2", "author": "Blake"}, {"rating": 4.0, "review": "I really like it. Easy to setup, very simple navigation. It would be great if you could browse Prime Music that wasn't added to your library yet. There is a bunch of apps I hope will eventually come out for it. The Twitch app does allow you to login to your account. It could give you a little more information about the device such as \"Do I need to keep it plugged in? Does it stay on constantly or does it turn off after a certain time?\"", "verified": true, "helpfulness": "1/1", "author": "Raymond Howard Jr."}, {"rating": 3.0, "review": "So far I really like the fire stick - and expect it just to keep getting better. I bought it for my mother who is trying to simplify expenses by maybe one day canceling her hefty cable bill. The $19 dollar intro price, plus tons of free programming is ideal. How can I complain. Smart TV is definitely the way to go. (We haven't had cable in my house for years. We use an Xbox 360 for smart TV programming and access.). However, my mother isn't likely to enjoy the tedious click to type search feature.  A voice search remote should have been included OR the iOS app should have been ready to go. When will that app be ready?  Second, my mother likes a few spanish programs. When will Univision or Telemundo come to fire TV?  Their programming is already on Roku.  C'mon Amazon, keep tweaking the device offerings and stomp out all of the competition!", "verified": false, "helpfulness": "1/2", "author": "James Aurelius \"J Aurelius\""}, {"rating": 2.0, "review": "I was disappointed there was no log-in for Direct TV customers for the TV applications.", "verified": true, "helpfulness": "1/3", "author": "NoleLady"}]