[{"rating": 3.0, "review": "apparently our internet provider isn't very strong, as every movie I have tried to watch with my stick has had constant interruptions in service, making it very frustrating to try to watch a movie.  Won't be using it much", "verified": true, "helpfulness": "0/0", "author": "Peggy L. Simmons"}, {"rating": 5.0, "review": "I ordered this when it was offered to Prime members for $19. The price basically said buy it. I must say it is more functional than a Chromecast. Like the games. Netflix/hulu works as required.I would recommend, but only if you have Prime membership, as only then you can access all it has to offer.Delivered as expected.", "verified": true, "helpfulness": "0/0", "author": "raveye"}, {"rating": 4.0, "review": "When it works, the family really enjoys it.  We've had it one week and three different sets of batteries and multiple uplugings...it mostly works.  It seems to get hot too.  Granted, it is only one week so I'll write more if there are any more developments.", "verified": true, "helpfulness": "0/0", "author": "T. Diaz"}, {"rating": 5.0, "review": "I love the Fire TV Stick! It's fast, easy to use and has allowed me to get rid of cable!  I was able to connect it to my Wifi without trouble and the remote control remote is amazingly responsive.  Amazon recently released the first version of the Fire TV App which also works very well!  I would definitely recommend this!", "verified": true, "helpfulness": "0/0", "author": "Corrie James"}, {"rating": 5.0, "review": "Amazon always does it right.  We've been Prime members for years and having the music and movies on any TV we want is fabulous.  We got a Roku before this, but this is so much more portable and the voice remote option is pretty good.  Anxious to see how Echo is going to interface with it.  ..", "verified": true, "helpfulness": "0/0", "author": "azcoolmom"}, {"rating": 5.0, "review": "So much better than Roku.", "verified": true, "helpfulness": "0/0", "author": "Michael L. Middlemiss"}, {"rating": 1.0, "review": "Crashes all the time. I bought this to take the stress off my ps3. Guess what's running right now yes my ps3 because this system has once again forgotten how 2 run again. Moved it 2 ft from the wifi maybe the Dual band wifi will work. Moved OLD Roku Back in it's place.", "verified": true, "helpfulness": "0/0", "author": "john doe"}, {"rating": 5.0, "review": "Was delivered with all parts. Some assembly but not bad. Placed into humid port and entered my Amazon info and it worked immediately. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Ming18"}, {"rating": 3.0, "review": "I've used both a Chromecast and the Fire Stick TV for about a month. Both were OK in certain ways, and both had problems.The biggest drawback for me with the Chromecast is that it's rarely able to get the correct aspect ratio, so a lot of videos are cut off on the top or edges. The other problem is that without a remote, I have to run to my computer a lot to make changes.The Fire Stick problems are two: it loses the wifi connection if I stop using it for a few hours, so I need to reboot it frequently. Sometimes it doesn't regain the connection at all, and I just give up for a few hours. The other big problem is that the responsiveness of the device sometimes gets terrible; the remote seems to stop responding and commands back up in the queue. After 10-20 seconds, all the commands are run quickly in sequence.The other minor downside of the Fire Stick is that typing out search queries with the remote is pretty irritating. But I hear I can download an Android app that will let me do voice commands, or use a normal keyboard.When it's working, the Fire Stick is pretty terrific. I hope that updates will fix both of these problems.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best bargain around for those of us with Amazon Prime. It's truly plug-and-play, and streaming has been smooth.", "verified": true, "helpfulness": "0/0", "author": "Anita"}]