[{"rating": 5.0, "review": "Thats what I was looking for. Especially as it comes with Remote even younger kids can play. On top of it Child lock helps to restrict adult contents for them.", "verified": true, "helpfulness": "0/0", "author": "Vijay K. Jaiswal \"Newbie\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Duc H. Nguyen"}, {"rating": 5.0, "review": "Amazon Fire TV Stick Works great and was shipped on time. Love the portability", "verified": true, "helpfulness": "0/0", "author": "Jeffery E. Catalucci"}, {"rating": 4.0, "review": "I love this thing!  The only downfall is that many of the apps are still not compatible with certain cable companies (I can't use the showtime app because it doesn't offer Charter as a choice for cable providers, etc.).  That would be the only thing to make the Fire Stick better, along with an Xfinity app (there just isn't one for the Fire Stick, but there's one for my kindle).  But I just mirror my kindle with my tv and can watch everything that way.  Therefore, if you don't have another Amazon product, like a tablet, you should go with another streaming device.  Otherwise this is one of the best purchases I've ever made, I don't know why people still have cable!As a sidenote:  the way this product is listed it misled me to thinking that the voice command remote was included.  It is not, you have to purchase that seperately, just fair warning.", "verified": true, "helpfulness": "0/0", "author": "Audra O'Brien"}, {"rating": 5.0, "review": "It is very comparable to the Fire TV! I haven't used it like I do my Fire TV, but I love it so far!", "verified": true, "helpfulness": "0/0", "author": "Randy Wintjen"}, {"rating": 5.0, "review": "looks and works great. Super easy to use.", "verified": true, "helpfulness": "0/0", "author": "christopher schluntz"}, {"rating": 5.0, "review": "So far I love it.  I was thinking of making this purchase some time ago but had to wait for my satellite TV contract to expire.  I do not recommend this for those who will be using it with satellite internet.  I am making the switch to something else (AT&T; U-Verse or Cable internet) since the satellite internet cannot support the data needed for streaming.  This was probably one of the most simple tech gadgets I've ever installed.  I look forward to utilizing it's full potential when I move into my new house with the different internet service.  Works great with my wireless router and it had no trouble identifying my WiFi signal allowing me to sign on using the remote.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Better than cable", "verified": true, "helpfulness": "0/0", "author": "Darrick S. Williams"}, {"rating": 5.0, "review": "Really awesome , fun to use. I like being able to watch Netflix and YouTube on the TV. Be great if they would get a crunchyroll app for it. You can side load one but it takes time.", "verified": true, "helpfulness": "0/0", "author": "Asuka 24"}, {"rating": 2.0, "review": "It's just ok.  Not as versatile as the Samsung embedded SmartTV app or the ol' Roku.  Plugging the power cord, it sticky on the Fire Stick end.  I thought I had a bad device, turned out it needed a little umphh to make the connection.", "verified": true, "helpfulness": "0/0", "author": "MJK22"}]