[{"rating": 4.0, "review": "I was looking forward to using this to watch my favorite movies and tv shows and set up was very simple, however, every time I try to watch something, it keeps buffering and when it isn't buffering the picture is blurry off and on (same with the Google Chromecast that I have - I thought the Fire TV Stick would be better based on the other awesome reviews).  My tv is semi-enclosed in an entertainment center but is close to the wifi signal/router.  Could the enclosure be interfering with the signal?  I would love to be able to get my money's worth and use this thing, but am starting to regret this purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Its Awesome!", "verified": true, "helpfulness": "0/0", "author": "Lee and random family members"}, {"rating": 5.0, "review": "Awesome sums it up.  The only complaint would be the lack of ability to increase storage.  In my case I should have went with the firetv rather than the stick but I didn't consider this issue until it was too late.  Works wonderfully with xbmc and sling.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Works perfectly fine. Very use to install. Excellent price compared to Apple TV", "verified": true, "helpfulness": "0/0", "author": "mpf9876"}, {"rating": 5.0, "review": "Excellent product.  Very satisfied with my purchase.", "verified": true, "helpfulness": "0/0", "author": "SekodaNme"}, {"rating": 5.0, "review": "Enjoying it very much.  A great addition to my TV choices.  My Son was so impressed he bought one too. I also was happy with what an easy installation it is. Especially for older people like me. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Maggie"}, {"rating": 2.0, "review": "I had a Roku (box) & Chromecast prior to getting this, & so far the Roku is my favorite. The interface of Fire is just not as easy to navigate, & the remote app for your phone is TERRIBLE, you can't even see what you're doing - & it has to reconnect to your TV every time you open the app. Horrible. Also the Fire disconnects all the time, there is almost always a message on the TV when I turn it on & sometimes while I am watching, too. Half the time just hitting home & going back into the channel will work, but far too many times I've had to unplug everything to get it to reconnect.", "verified": true, "helpfulness": "0/0", "author": "Ann"}, {"rating": 5.0, "review": "Wish I had bought this years ago.....", "verified": true, "helpfulness": "0/0", "author": "Karen A. Haack"}, {"rating": 5.0, "review": "It works great.  Enjoying Netflix everyday.", "verified": true, "helpfulness": "1/1", "author": "Helyn Blodgett"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jamie Simpson"}]