[{"rating": 1.0, "review": "First let me say that I am a huge fan of Amazon.  I have experienced lots of great buys and very fair prices, and Customer Service is truly great.  Basically, I do all my shopping with Amazon.  However, I have to be honest and admit Amazon has missed with this product.  It really doesn't work - at least not  well enough.  My experience was that it could not hold a Wi-Fi signal for very long.  One might make the argument that my modem is too far from the TV, etc..  But that argument doesn't hold up because - before and after the Stick - an inexpensive Sony smart blue-ray player has functioned just fine for the same TV in the same place.  Now I must admit that Amazon sent an email suggesting a number of research steps I might go through regarding my Wi-Fi connection so they could better solve the issue.  But the instructions were much too complicated for my interests.  Why would I want to do all that when I can simply use another device?  Let me also note that I use the regular Fire TV box for my primary TV and it works great.  However, that doesn't really mean anything regarding Wi-Fi because I use an Ethernet connection with that device - so I don't know..", "verified": true, "helpfulness": "0/0", "author": "mrliberty"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/1", "author": "Linda Campbell"}, {"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/1", "author": "bubbasan"}, {"rating": 4.0, "review": "Love it!  Get it if you don't have one.  I have a chromeCast which I love even more.  If you get this you may even consider dropping cable.", "verified": true, "helpfulness": "0/0", "author": "Dennis P. Uhlmann Jr."}, {"rating": 5.0, "review": "Great for downloading apps and watching tv! I ordered one for every tv in my house :)", "verified": true, "helpfulness": "0/0", "author": "Cortney"}, {"rating": 5.0, "review": "Love it!!!!!", "verified": true, "helpfulness": "0/1", "author": "Chris R."}, {"rating": 4.0, "review": "I like it so far. Time will determine whether I like it or not.", "verified": true, "helpfulness": "0/0", "author": "Tera Smith"}, {"rating": 5.0, "review": "The Stick preformed as advertized", "verified": false, "helpfulness": "0/0", "author": "Bob Viessman"}, {"rating": 5.0, "review": "Amazon did an amazing job with this device.  We have cut the cable.  Works with 2.4 and 5ghz WiFi (on 5ghz use a low channel).  My wife likes this WAY better than the Chromecast we started out with because of the remote.  Hulu & Netflix work great on this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The first one they sent was defective, second on seems to work fine.", "verified": true, "helpfulness": "0/1", "author": "rick bentley"}]