[{"rating": 5.0, "review": "Love it.  So easy to use. Not only do i use it for my amazon prime, i use it for netflix and hulu.", "verified": true, "helpfulness": "0/0", "author": "Super foods"}, {"rating": 4.0, "review": "I will probably update this review after some time, but I just discontinued my cable for streaming media.", "verified": true, "helpfulness": "0/0", "author": "JB"}, {"rating": 5.0, "review": "It was easy to use. I had a few minor problems but nothing serious.I had a hard time fitting the stick into my HDMI port but I just switched my cable and the stick (with the extender) and it went in fine.I ended up returning the FireStick but ONLY because my wifi kinda sucks and I just ended up buying a MHL Micro USB to HDMI adapter cable for my phone so I can still watch Hulu and other programs with my phone.i LOVE the idea of the Firestick but it just didn't work for me.", "verified": true, "helpfulness": "0/0", "author": "E. Araujo"}, {"rating": 5.0, "review": "Love it. Amazon prime movies and since I have a Netflix subscription it handles that too.", "verified": true, "helpfulness": "0/0", "author": "Clinton Larue"}, {"rating": 5.0, "review": "It's been great.", "verified": true, "helpfulness": "0/0", "author": "Casey P. Ontiveros"}, {"rating": 5.0, "review": "The easiest thing I ever had to install and best options. Far better than Apple TV", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 5.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "Kathy Lockard"}, {"rating": 5.0, "review": "I have a slow internet connection, but with this, I can still watch all my favorite programs. I just add them to my wish list, and they are pre-buffered before I start.  Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Nancy G"}, {"rating": 2.0, "review": "The reviews stating that you don't need anything other than the stick to access free TV & Movies are completely false. You must either be a Prime member and/or have a subscription to Netflix, etc. THERE ARE NO FREE TV SHOWS OR MOVIES.", "verified": true, "helpfulness": "0/2", "author": "Lana's Nana"}, {"rating": 1.0, "review": "I can't get a signal.  So it's useless to me.", "verified": true, "helpfulness": "0/0", "author": "PATRICIA"}]