[{"rating": 4.0, "review": "Was very wasy to install and get started. I like the Amazon Prime selection of entertainment. Am also using the fire stick to access Sling TV. And ots working very well. Am very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Kiran Unni"}, {"rating": 5.0, "review": "Works beautifully, and easy to set up. I have an older TV so this is great for connecting to Netflix, Youtube, Pandora, etc...", "verified": true, "helpfulness": "0/1", "author": "inge steinebrunner"}, {"rating": 5.0, "review": "Much better than a Blue Ray to get on Netflicks and other onlinie services.  I have both and the stick remembers where I left off in a series.  Very cool.", "verified": true, "helpfulness": "0/0", "author": "E. Saltzberg"}, {"rating": 4.0, "review": "There is more that you have to buy or rent than expected. I was under the impression with prime you were able to watch more included than in membership.", "verified": true, "helpfulness": "0/0", "author": "Kalie Popp"}, {"rating": 5.0, "review": "If you're a cord-cutting millennial it's pretty much the best thing in the world.", "verified": true, "helpfulness": "0/0", "author": "Rose G."}, {"rating": 5.0, "review": "I love this device so much, I had to buy a second one for the HDTV in my bedroom.  Extremely easy to use and installation was just a couple of minutes.", "verified": true, "helpfulness": "0/0", "author": "John Carr \"Ducati John\""}, {"rating": 5.0, "review": "I don't have a smart tv at home, but with the device I am able to use The Stick to get my basic Flat Screen TV to work like a smarttv. I really enjoy this device.", "verified": true, "helpfulness": "0/0", "author": "Ryan I"}, {"rating": 5.0, "review": "Works fine", "verified": true, "helpfulness": "0/0", "author": "Marsha"}, {"rating": 2.0, "review": "Once working, this is an awesome tool.Unfortunately, it requires constant plugging/unplugging to reset it for it to work.", "verified": true, "helpfulness": "2/2", "author": "William Hubbard"}, {"rating": 5.0, "review": "Very easy to set up! Perfect for my daughters TV that didnt have Netflix pre programmed in it! Now she can watch whenever she wants", "verified": true, "helpfulness": "0/0", "author": "Karen"}]