[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Pitbull"}, {"rating": 5.0, "review": "Got the fire stick when it was $19.  Was very easy to set up.  I have watched Amazon and Netflix movies with no problems.  Even at the current price of $39 you can't go wrong with this.", "verified": true, "helpfulness": "1/1", "author": "P. Hall"}, {"rating": 3.0, "review": "I really like the device, the remote, and the ability to control it with my smart phone.  BUT, the network connection keeps crapping out on Netflix.  Usually after 4-5 hours.  It is NOT my router or my internet at fault.  When I power the Fire TV stick down then back up (then log back into Netflix) it works fine, for awhile.  I hope Amazon is taking this failure seriously.  One of their own chat boards has over 300 posts on this exact subject.  This is a problem, fix it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "paul price"}, {"rating": 4.0, "review": "I would love to give this 5 stars, but I can't because the user interface needs work. The number of steps you need to take in order to put the device to sleep (you cannot turn the device off unless you unplug it) are completely unnecessary. However, performance-wise, I am impressed. You will need a power outlet nearby for it to function properly, so keep that in mind when buying. Overall, still a great buy (I got mine for $19). But please, Amazon: send a software update to allow easier access to the sleep function!!", "verified": true, "helpfulness": "1/1", "author": "AM15"}, {"rating": 5.0, "review": "Its pretty great!", "verified": true, "helpfulness": "0/0", "author": "JD sessler"}, {"rating": 5.0, "review": "Finally I can cast Amazon videos to a large display.  Great value.", "verified": true, "helpfulness": "0/0", "author": "Wilbur \"Mr. Ed\""}, {"rating": 4.0, "review": "EASY TO INSTALL AND USE. GREAT LITTLE DEAL.", "verified": true, "helpfulness": "0/0", "author": "big Al"}, {"rating": 1.0, "review": "Terrible connect issues. I have Apple tv. Roku where this is not an issue.  Don't buy!!!!", "verified": true, "helpfulness": "1/1", "author": "ccater@consolidated."}, {"rating": 2.0, "review": "Can't connect to wifi networks that require a login like most hotel or public networks. So instead of watching a movie tonight, I post this review...", "verified": true, "helpfulness": "1/1", "author": "Gary E. Stearns"}]