[{"rating": 4.0, "review": "Still learning but looking forward to using it a lot!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product.it does have some glitches but it does work most of the time.", "verified": true, "helpfulness": "0/0", "author": "IdgiGardz \"Ric Ishmael M. Alfonso\""}, {"rating": 5.0, "review": "Great - As advertised", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 4.0, "review": "Easy set up. Ready to use in 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "mark"}, {"rating": 5.0, "review": "Use this to stream Amazon Prime and Netflix, and it works great even across the house.", "verified": true, "helpfulness": "0/0", "author": "Cliff"}, {"rating": 5.0, "review": "Works as advertised....set up takes about 5 minutes. Wi-Fi setup was a breeze....My Netflix and Hulu Plus was easy to register. Netflix movies start up quickly no more waiting for stream time. I'm an Amazon Prime member so I didn't have to do anything for the Amazon movies, it was an automatic register... again movie start up is quick, no waiting on streaming.....I ordered from Amazon and being a prime member I didn't have to register fire stick as it is suppose to be automatic....Hope that is true as I have nothing letting me know the status.I'm using the power cord and adapter supplied and recommended. If you buy this item you won't be disappointed...To you out there who don't think you can do this task, relax, it is a very simple set up. As usual Amazon comes thru again.............", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Amazing product makes watching movies very easy and is simple and easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Grant Albers"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Gwendolyn White"}, {"rating": 3.0, "review": "So cheap, its faults are easily looked over.  Basically works well, but doesn't stack up well compared to Apple TV: - UI is generally clunky, hard to really browse content by themes etc. - Video quality at times choppy/blurry on content that works well on Apple TV - I've already accidentally purchased content where Season X was free w/ Prime but Season Y was not", "verified": true, "helpfulness": "1/1", "author": "Nick"}, {"rating": 1.0, "review": "No longer working with netflix at all.  When it was working, it kept playing shows after the tv was turned off (while chromecast does).  Also unlike chromecast, it requires too much power to use tv usb port and you must connect to dedicated ac adapter (likely why it doesnt turn off when tv does). Dont recommend.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]