[{"rating": 5.0, "review": "Enjoying it.  Great deal and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Toml"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "ROUBEN  OVANESPOUR"}, {"rating": 5.0, "review": "We had no problems with the install.  It's fantastic!!! It does exactly what is advertised!!!", "verified": true, "helpfulness": "0/0", "author": "ilovetobike \"lovetobike\""}, {"rating": 5.0, "review": "Better than Inexpected.  I am watching all sorts of programs and listening to music.  Best of all it was very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Frank L. Manning"}, {"rating": 2.0, "review": "Parental Control sucks  on fire stick. I don't get it, it they can implement it on roku or samsung app and fire tv why can't they do it properly on the fire stick?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really like it! Setup was easy & fast & doesn't buffer as much as my computer did.Has all the Apps I need & is so wonderful to watch it on tv while laying in bed. Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "ZZ Doc"}, {"rating": 4.0, "review": "Works great for my 2nd bedroom, 3rd TV. Good value for the price.", "verified": true, "helpfulness": "0/0", "author": "Cyd \"java diva\""}, {"rating": 4.0, "review": "need to know more on how use it and get more movies", "verified": true, "helpfulness": "0/0", "author": "Diana P. Miller"}, {"rating": 1.0, "review": "I previously purchased the Amazon Fire TV and had no issues with it, I loved it. So, I was very excited when I saw the Fire Stick advertised.  However, if I knew then, what I know now, I would never have purchased it.  First of all, it has never worked on the TV I bought it for.  After reading other reviews, I found out that people were experiencing the same problem I was having (would not connect to WiFi) apparently it has to be within 10 feet of the router for it to get a signal.  Not only was that a disappointment, but the TV ads and pictures are deceiving. What they don't show you... the Fire stick comes with more pieces then what you see, you have to attach an electrical cord to it for it to work in the HDMI slot.  Everytime I see the commercial for this, I see red.", "verified": true, "helpfulness": "4/6", "author": "Mona"}, {"rating": 4.0, "review": "I like it especially for $29 that I got it for before it was launched - I even like it better than my AppleTV.", "verified": true, "helpfulness": "0/0", "author": "AJ \"Cyberthug\""}]