[{"rating": 5.0, "review": "I think this is a great device it turns my dumb tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "jonathan"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Great everything it says", "verified": true, "helpfulness": "0/0", "author": "BigJim"}, {"rating": 4.0, "review": "I own this and a chromecast their is advantages to both but i find myself turning to the firestick because the convenience of the remote versus always using my phone to function he device.", "verified": true, "helpfulness": "0/0", "author": "Ashton Welch"}, {"rating": 5.0, "review": "This is neat little device and great for on the go. We travel a lot and it is so easy to take with us to hotels or other people's houses when we need to catch up on our shows. We elected not to have cable, but have bought into Netflix, Amazon Prime, and Hulu Plus. This is a convenient way to access these and other apps and services. Highly recommend, especially if you are an Amazon Prime member.", "verified": true, "helpfulness": "0/0", "author": "brandi \"Brandi J Roberts\""}, {"rating": 1.0, "review": "My Internet speed was too slow to view more than 1-2 seconds. Yet I can watch movies with it on hulu and other vid players.", "verified": true, "helpfulness": "1/1", "author": "sherri l. hess"}, {"rating": 4.0, "review": "Perfect for my kitchen TV. It isn't HD, and doesn't have an HDMI cable, so I had to buy a little adapter that turns HDMI into A/V Cables from Amazon. Added $25 to the cost, but at least I can start using that older HD TV a bit longer.", "verified": true, "helpfulness": "0/0", "author": "Timothy Lamothe"}, {"rating": 4.0, "review": "works great, gets you right to the apps you need, the only reason i am not giving it 5 stars is it takes a while to download each app. now i dont know if that is my wifi or the sticks speed to download but still very much so worth the money.", "verified": true, "helpfulness": "0/0", "author": "Jim C \"jc\""}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "WN2"}, {"rating": 5.0, "review": "Performed as I had hoped and expected.  I would recommend to a friend.", "verified": true, "helpfulness": "0/0", "author": "Rich"}]