[{"rating": 5.0, "review": "I love my fire stick after I was able to connect to my network.  The functionality of the device is great. I really like the screen savers when you walk away or pause the device. A lot better than Netflix and I can also put parental controls on the device.  I recommend this device to others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Murder Mysteries\""}, {"rating": 3.0, "review": "Works okay but not as good as \"non-stick\" Fire TV. The USB module heats up a bit which I expected and dont know the impact of the heat on its life expectancy. It doesnt sync very well and some applications (hulu+ in particular) often require re-entering of the device code. This is probably a conflict caused by using Fire TV and Fire Stick from the same account. It doesnt seem to have the same memory capacity of Fire TV and loads/updates slower. I would suggest going with Fire TV, not the Stick If you have a choice, otherwise if you need a smaller profile solution go with the Stick. Voice search isnt available on the Stick but the type in search works without hesitation.", "verified": true, "helpfulness": "0/0", "author": "Wesley"}, {"rating": 3.0, "review": "Overall it is a good device, however it lags at times. the stick does not respond to the remote.", "verified": true, "helpfulness": "0/0", "author": "Furman"}, {"rating": 4.0, "review": "The Fire TV Stick really struggles with a weak WIFI signal.  I first set mine up in my bedroom where my Wii and smartphone stream without any major issues; in this location the Fire TV stick frequently got hung on the loading screens and then wouldn't play anything at all.  I haven't moved it yet to try it in a location where I have stronger signal.  That said, I liked the set up process and the feel of the remote.  The on-screen UI was intuitive, feature-rich and looks good.", "verified": true, "helpfulness": "0/0", "author": "Nat Taylor \"Nat\""}, {"rating": 1.0, "review": "Horrible.  I plugged it into the tv and it am unable to watch a movie or listen to music.  Nothing but buffering.  3 seconds of video and then more buffering.  My Internet is 101 Mbps.  So that is not the issue.  My tv is 15 feet from the router so that is not the issue.  My xbox works perfectly.  Customer service was not helpful.  They said they would escalate and now a week later I get an email to send them my tv brand and the brand of the fire stick.  I bought the fire stick from the,.  Not sure why they are requesting that,  will keep you updated.", "verified": true, "helpfulness": "0/0", "author": "Alan Tylar"}, {"rating": 5.0, "review": "This thing is awesome,  we love it.The kids love watching old amazing race  shows, I like the movies you can't beat the price for what your getting. GREAT Buy", "verified": true, "helpfulness": "0/0", "author": "Gr"}, {"rating": 5.0, "review": "Once I figured out installation & found my network password..it was a breeze!  I love it, streams a lot better than on my laptop. but I guess I'll have to buy a couple more for other TVs now.", "verified": true, "helpfulness": "0/0", "author": "NANAMARY"}, {"rating": 5.0, "review": "PROS:I had Pre-Ordered weeks before and it was shipped a month in advanced Excitement.I love the fact that it comes with all the tools and more.Amazon prime members soak in your benefits! hahaEasy to install, cute, afforable!CON:Only thing is that it isn't like the commerical, I hate wires that is the main reason I got the Stick, but you have to plug into the charnger which leaves me with a wire problem.BUT I totally love my Fire Stick... I have prime for over 2-3 years now and finally able to watch my movies on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Janessa Tamayo"}, {"rating": 5.0, "review": "Does exactly what it is supposed to do. I love how small it is and that it comes with a remote.", "verified": true, "helpfulness": "0/0", "author": "TBC"}, {"rating": 3.0, "review": "As many of the other reviews stated my stick would work fine for a while and then just would lose the connection. I would switch over to the Roku and it worked fine. I don't find that there's enough difference with this product to go through any problems. Roku stick also does not need any additional power so that's much cleaner install. Back she goes....", "verified": true, "helpfulness": "0/0", "author": "J. Mast"}]