[{"rating": 5.0, "review": "From early delivery to complete set up - ready to use - excellent!  This little gizmo works fantastic.  My husband is loving it. I want to stress how easy it is to set up and use. Totally impressed with Amazon!", "verified": true, "helpfulness": "0/0", "author": "Oregonian"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "iPhone"}, {"rating": 5.0, "review": "Easy to set up and I love that I can use it anywhere.", "verified": true, "helpfulness": "0/0", "author": "L. Seamans"}, {"rating": 4.0, "review": "My Samsung smart tv is a generation before they were amazon ready. So, the stick makes it possible for me to select something on my kindle and put it on my big living room screen immediately. I love how it does that. However, I only watch amazon prime shows or broadcast content from my kindle. I don't try anything else.", "verified": true, "helpfulness": "0/0", "author": "robert oneil"}, {"rating": 1.0, "review": "used for a week without problem, but today it cannot connect to internet. All my other device has no problem with internet. Tried restore to factory setting, not helpful. Not sure what to do now.", "verified": true, "helpfulness": "0/0", "author": "Liyang"}, {"rating": 5.0, "review": "And the remote is a nice bonus", "verified": true, "helpfulness": "0/0", "author": "Chris W \"Chris W\""}, {"rating": 5.0, "review": "Easy to install.  Easy to use. Made my regular tv a smart one.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Arlene \"AH\""}, {"rating": 5.0, "review": "Awesome product!  I particularly love that it came with a remote at such a low price instead of just a smartphone app. Of course if you prefer a smartphone app the smartphone app does add voice control functionability!  Amazing!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Easy to install and operate.  And very mobile.It is inexpensive and mor powerful than its competitors.", "verified": true, "helpfulness": "0/0", "author": "Sam R \"sr3333\""}, {"rating": 5.0, "review": "Excellent love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "joanna hamilton"}]