[{"rating": 1.0, "review": "I thought It could be more accessible to other apps. Just only apps preloaded are available and there are no options for more apps", "verified": true, "helpfulness": "0/1", "author": "VICTOR A. GOMEZ"}, {"rating": 5.0, "review": "I was especially pleased to find that when I stayed at a Coast Plaza hotel in Canada the Fire tv stick had no difficulty in connecting to the hotel's wireless network!  Unfortunately, since I was out of the country much of the programming wouldn't work for me. (not licensed in Canada!)  I will have to set up a VPN to route through my home network so I can watch those programs.  The fire stick worked flawlessly, though!", "verified": true, "helpfulness": "0/0", "author": "Richard Wooldridge"}, {"rating": 5.0, "review": "Works perfectly. Installs effortlessly.", "verified": true, "helpfulness": "0/0", "author": "Lora Z. \"LAZ\""}, {"rating": 5.0, "review": "Best of the TV sticks....", "verified": true, "helpfulness": "0/0", "author": "David A. Frye"}, {"rating": 5.0, "review": "Love it! Easy to use and it's very responsive - much better than the Chormcast I have. I had to buy an HDMI hub to handle the extra devices since each device needs an external 5v power supply. I highly recommend this if you have Amazon Prime, take advantage of the services offered by amazon with this device.", "verified": true, "helpfulness": "0/0", "author": "JSTARZ"}, {"rating": 1.0, "review": "It's slow Hulu is almost unwatchable.", "verified": true, "helpfulness": "0/2", "author": "Stephen Lim"}, {"rating": 4.0, "review": "I have the Fire TV box in my living room and the Fire TV Sticks in our bedrooms. Sometimes it freezes up for a second but it's not too bothersome. However, sometimes in the middle of a show it would just go back to the home screen. If that happens go to settings and just restart the system. If you do that once every couple of days it keeps that from happening.", "verified": true, "helpfulness": "2/2", "author": "Coppermom"}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "Alex C."}, {"rating": 5.0, "review": "Works great had no trouble with it. Apps work fine. Downloaded my iphone pictures automatically.", "verified": true, "helpfulness": "0/0", "author": "bernie y"}, {"rating": 5.0, "review": "Awesome. I just wish it had The voice search option like the box remote did", "verified": true, "helpfulness": "0/0", "author": "nyle"}]