[{"rating": 5.0, "review": "Great product, the whole family loves it.", "verified": true, "helpfulness": "0/0", "author": "Rhonda Nelson"}, {"rating": 3.0, "review": "The whole thing was un clear.... I was under the impression that it was sort of a \"memory stick\", that once you picked what to view, it would go to the stick and not stream the whole entire time.  Ate up my 15G of internet in 3 episodes of Game of Thrones and I went over my limit.  Cost me 50$ in fees.", "verified": true, "helpfulness": "0/0", "author": "Tammy Bartlett \"Tammy Bartlett\""}, {"rating": 5.0, "review": "Very nice product", "verified": true, "helpfulness": "0/0", "author": "reuben dee martin"}, {"rating": 5.0, "review": "Fire stick works great. Easy to use, love the remote. Great variety of shows.", "verified": true, "helpfulness": "0/0", "author": "Robert F. Canini"}, {"rating": 5.0, "review": "Fantastic. Great picture. I used to stream from a wii which was standard def. I love it and would highly recommend to anyone who uses Netflix or Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Robert Brovold"}, {"rating": 5.0, "review": "Love it.  It is fast and easy to use.  Takes minutes to set up and starts working.  The hardest part is plugging it in.  The only problem we have had is when the power cord accidentally got unplugged.  I ordered another one because I love it so much.  Basically use it to watch movies on Amazon Prime or Netflix.", "verified": true, "helpfulness": "0/0", "author": "J. Perry \"bbon34\""}, {"rating": 5.0, "review": "I love it, works great so small and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Lynn Jennings"}, {"rating": 5.0, "review": "Absolutely love it!  Great buy... A must have!", "verified": true, "helpfulness": "0/0", "author": "Nicole Murray"}, {"rating": 5.0, "review": "Works as advertised. Easy navigation easy use all around. Setup was a piece of cake. Whole fam enjoys using it.", "verified": true, "helpfulness": "0/0", "author": "Aryajet"}, {"rating": 5.0, "review": "AWESOME!  If you already have PRIME - this is a no brainer; you more viewing capabilities with a one time hardware cost.  GET It!", "verified": true, "helpfulness": "0/0", "author": "Fire on a cold day"}]