[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "IK HYUN KIM"}, {"rating": 1.0, "review": "Bought it for one reason, to miracast from my Galaxy S5 to my TV. It does not work. I have had multiple call to amazon tech support and they have no idea when and if the problem will get fixed. Calls were never returned despite repeated promises to do so. I finally gave up and am  returning it. Great idea but not ready for prime time.As a separate note,  I pre-ordered this the day it went on sale and was disappointed that amazon shipped to retailers like best buy before shipping to long time prime members.", "verified": true, "helpfulness": "0/0", "author": "EHLovesBooks"}, {"rating": 1.0, "review": "The Fire TV Stick is a total waste of time & money if you already have an internet compatible tv, blu-ray player, apple tv, roku, or any other streaming device for your tv.  If you can watch Netflix or Amazon Prime on your tv somehow already, then this device just duplicates that ability.  It does not offer anything at all new unless you want to mirror from your kindle (which is why I bought it), but the fine print does not make it clear that it will mirror ONLY three specific versions of ONLY Kindle Fire HDX.  There is still marketing material out there that says it will work with Kindle Fire HD 7, but I was specifically informed today by 3 separate customer service reps (none of whom really seemed to know what they were doing) that this is not so, that only the 3 specific versions of the HDX will work.  The support rep informed me that it is only really designed to work with 2015 Kindle HDX, so my 6 month old Kindle is now obsolete.  In other words, Amazon markets this as the latest greatest thing to be able to watch all your streaming media on the big screen, but in actuality it offers nothing that my 3 year old blu-ray player doesn't already give me, UNLESS I want to buy a brand new Kindle HDX for mirroring.  I had hoped this would allow me to watch XfinityTVGo on a large screen, but though that streaming app works on just about all phones and computers made in the last five years, there is no app for using that service with the shiny new Fire TV Stick.  The Fire TV Stick also will not work with any Apple products such as an iPhone, iMac, iPad, etc.  All in all, the Fire TV Stick is nothing new - just old capabilities wrapped up in shiny new packaging - like putting lipstick on a pig.", "verified": true, "helpfulness": "2/2", "author": "Biblio Phile \"forever learning\""}, {"rating": 5.0, "review": "Full disclosure - I purchased this for the $19 sale. It is easily worth $40.The interface is snappy, loading times are super fast, and the content is outstanding. I have Netflix/Pandora One and this has replaced the \"Smart\" TV apps I have by virtue of just being a better all around device.", "verified": true, "helpfulness": "0/0", "author": "J. West"}, {"rating": 5.0, "review": "I wasn't sure I needed this gadget, because I already had Netflix and YouTube through my blue ray player. Although I didn't have Amazon Prime or any of the other sites, I had gotten along fine without them. The picture is more clear when I use the Fire Stick. The remote really does make watching shows easier. I am very pleased with the purchase.", "verified": true, "helpfulness": "0/0", "author": "G. Robinson \"razorback\""}, {"rating": 4.0, "review": "Required additional technical support with the stuttering audio but they addressed the issue fairly rapidly.", "verified": true, "helpfulness": "0/0", "author": "A. Youngblood"}, {"rating": 5.0, "review": "I love this", "verified": true, "helpfulness": "0/0", "author": "christine nehls"}, {"rating": 5.0, "review": "Bought when we were about 8 months pregnant and tested it out, she loves it. We love it. We have a chormecast but we added this when we got amazon prime. Wish we had on all our tvs.", "verified": true, "helpfulness": "0/0", "author": "bgburk"}, {"rating": 5.0, "review": "Easy to set up and easy to use. We don't miss satellite tv one bit with this product.", "verified": true, "helpfulness": "0/0", "author": "nono"}, {"rating": 1.0, "review": "Purchased the Fire TV Stick because I travel alot for business. This was a small item I could pack in my briefcase. The only problem is the unit doesn't work in hotels where the wifI uses a portal system. If you plan on using it for travel you will need a mobile Hotspot.", "verified": false, "helpfulness": "3/3", "author": "Corbin Asbury"}]