[{"rating": 5.0, "review": "Instructions were insufficient but got help from my internet provider's tech support. As far as how it works, I'm satisfied", "verified": true, "helpfulness": "0/0", "author": "mr or mrs hugh d frazier"}, {"rating": 5.0, "review": "Love it! I cut the cable cord quite a while ago as I'm not an avid TV watcher. The cost just wasn't worth it, even for basic cable. So I hooked up a good indoor TV antenna for reception and rented movies from the boxes outside stores or got them free from my library. The price is right but inconvenient due to picking up and returning them. I had been contemplating this purchase for a while. It's awesome to just select a movie anytime I feel like it. Really like documentaries and there's plenty of movies and shows to choose from. This purchase ties in nicely too with my Amazon Prime membership!Forgot to mention that it's real easy to hook up and use.", "verified": true, "helpfulness": "0/0", "author": "Ellen"}, {"rating": 5.0, "review": "Super excited about the fire stick. Easy to work and totally beats running to the store or redbox for a movie!", "verified": true, "helpfulness": "0/0", "author": "Lauren  Hummel"}, {"rating": 5.0, "review": "Easy to install, easy to maneuver.  Works as well as the Amazon Fire TV Box!", "verified": true, "helpfulness": "0/0", "author": "BPfromKC"}, {"rating": 2.0, "review": "I have a 50\" HDTV and the image quality using the Fire Stick is very rudimentary. I have played with the settings on the Fire Stick but it hasn't made any meaningful difference.In addition, the longer you use it (say, binging on multiple episodes) it starts buffering more and more frequently. Clearly, this is a technical problem that leads to user frustration.I often wonder how new products get released with these types of issues. I wouldn't recommend buying it until Amazon (hopefully) addresses some of these foundational issues, none of which exist with Apple TV.", "verified": true, "helpfulness": "1/2", "author": "Delilah"}, {"rating": 3.0, "review": "Shadowlands with Anthony Hopkins was the first movie I looked for, but you do not carry it.Five Red Herrings in the Lord Peter Wimsey series was also unavailbleClouds of Witness was also absent.Dorothy Sayer's Harriet Vane series was also absent.I've only gotten 2 out of my first 6 choices!", "verified": true, "helpfulness": "0/0", "author": "Thomas P. Arnold"}, {"rating": 5.0, "review": "I really like my fire stick so far. I enjoyed my first one so much... that i bought a second one. Although i have had quite a few setbacks since i hooked up the 2nd one., all in all... i am happy enough to recommend the fire stick to my friends and neighbors.", "verified": true, "helpfulness": "0/0", "author": "Bea Marr"}, {"rating": 5.0, "review": "Works awesome easy install and can be used on any hd tv with ease all my synced info was already there i felt like i was missing something because of how easy it was", "verified": true, "helpfulness": "0/0", "author": "Carolyn Gaines"}, {"rating": 5.0, "review": "Easy to set up and clearly will be exciting to pick out a movie when there is nothing on TV that we like, so thank you Amazon for this low pricedaddition to our viewing experience.", "verified": true, "helpfulness": "0/0", "author": "norrie"}, {"rating": 5.0, "review": "I loved it so much I bought one for my girlfriend and one for my parents.Its easy to use and just useful overall.", "verified": true, "helpfulness": "0/0", "author": "evan"}]