[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Dixie Terry"}, {"rating": 3.0, "review": "It's alright. Glad it was only $40.", "verified": true, "helpfulness": "0/0", "author": "Rebekah"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Rodney Graham"}, {"rating": 3.0, "review": "Had a lot of apps but where missing some I was hoping for. The search was nice but would try to push Amazon content instead of showing you the free or cheapest way first. Had some performance/speed issues and had to restart the stick a few times after apps would not open or crash.", "verified": true, "helpfulness": "0/0", "author": "trevor burch"}, {"rating": 5.0, "review": "Super impressed with this so far! For the price--a steal! ... I just bought the game controller to play the free games included, and its priced as much as the device. Hahaa--still way ahead on savings compared to similar devices out there. The Fire TV has all my music integrated and is by far the best deal around! ... I wonder if my Echo can join in all the fun?  It's much better than my Chromecast was (gave it away after I bought this) and waaaay more versatile than my Apple TVs (I have two of them); I just wish it was as easy to maneuver around the menus as my Apple TV. The movie menus are linear as opposed to grid style.", "verified": true, "helpfulness": "0/0", "author": "TeePizzel \"SacTownTodd\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Todd A. Cordisco \"TC\""}, {"rating": 5.0, "review": "Amazing product. Couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Justin Mendoza"}, {"rating": 2.0, "review": "Need more apps... vudu... bring back kodi.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use, so many options at your finger tips. I used to have satellite, also used to have cable, now I have neither I use the fire tv, between amazon prime, netflix, and Hulu I don't need it anymore.", "verified": true, "helpfulness": "0/0", "author": "Brandon Rodd"}, {"rating": 5.0, "review": "Very fast and easy to use device with remote , installed kodi it works great.", "verified": true, "helpfulness": "0/0", "author": "Manas"}]