[{"rating": 5.0, "review": "Very Happy with it.  Very easy to operate", "verified": true, "helpfulness": "0/0", "author": "Myriam Urrego"}, {"rating": 5.0, "review": "Best purchase I've made from Amazon so far!", "verified": true, "helpfulness": "0/0", "author": "Julie K."}, {"rating": 1.0, "review": "The available library is extremely limited.  I paid $50 for access to Amazon pay per view.. REALLY?? Or I can pay an additional $106 for a so-called FREE 30 day trial amazon prime. Who takes payment before trial period has ended? Amazon Prime does have great features however for $106 I am paying for 2day shipping and a book a month.  Highly disappointed with this stick.. could have used $50 and had almost 6 months of Netflix !!!", "verified": true, "helpfulness": "1/4", "author": "SLPETE"}, {"rating": 5.0, "review": "Easy to use and set up!", "verified": true, "helpfulness": "0/0", "author": "Karen Waun"}, {"rating": 5.0, "review": "This was one of our best purchases. Works really well.", "verified": true, "helpfulness": "0/0", "author": "Birdeee"}, {"rating": 5.0, "review": "I just installed the Amazon fireTV stick, and it was one of the easiest installations I've ever done. I'm very pleased. No more cable bill it's too much every month.", "verified": true, "helpfulness": "0/0", "author": "norberto"}, {"rating": 5.0, "review": "Easy to use and works as expected for a good price!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "Love the Fire Stick for TV!! Now I don't need to attach my laptop to the TV to watch through Amazon Prime!!  Having a Star Trek Enterprise marathon.  It was very easy to install and simple to use.  Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Deborah J. Mccool"}, {"rating": 1.0, "review": "Not working as yet.", "verified": true, "helpfulness": "0/1", "author": "Judith Hansen"}, {"rating": 5.0, "review": "Easiest set up for me so far. In a few minutes you are watching prime movies , shows,etc.Also purchased voice remote. I have a heart condition so tv is one of the few entertainmentoptions.Recommend to get amazon prime also, I've been watching amazons original series(Bosch)they are very well produced ,directed,acted.So if you want to be as glad as I am order a FIRE TV STICK!🔥📺=😃", "verified": true, "helpfulness": "5/5", "author": "REYREY"}]