[{"rating": 5.0, "review": "I have multiple products for streaming and this is by far the easiest to use. Seems to speed up downloads from multiple streaming services.", "verified": true, "helpfulness": "0/0", "author": "M Gardner"}, {"rating": 5.0, "review": "Very easy to set up. VEry easy to use. Lots of movies and shows. Menu system is great. Remote is simple and intuitive.", "verified": true, "helpfulness": "0/0", "author": "J. Hill \"pekasauruserex\""}, {"rating": 5.0, "review": "We love it - very cool!", "verified": true, "helpfulness": "0/0", "author": "Kelly M. Faccone"}, {"rating": 1.0, "review": "Having problems connecting to the wifi from the very beginning. All other devices were working fine on the network when the connection for the fire tv stick dropped. I've tried all suggested measures on the troubleshooting page, but none of those solved the connectivity problem.", "verified": true, "helpfulness": "0/1", "author": "Xiaolu"}, {"rating": 5.0, "review": "Awesome. Perfect for the second bedroom! Make sure you get the App so you can use the mic and keyboard.", "verified": true, "helpfulness": "0/0", "author": "P. Torcivia \"PHT\""}, {"rating": 5.0, "review": "blows other products out of the water!", "verified": true, "helpfulness": "0/0", "author": "Siavash Bonakdar"}, {"rating": 3.0, "review": "Got hot enough to concern us when we used it.", "verified": true, "helpfulness": "0/2", "author": "Willy Lump Lump"}, {"rating": 1.0, "review": "It seemed really cool, but I found it confusing to navigate and misleading as to what free with prime membership. It was all obsolete to us, though. With satellite internet we couldn't get uninterrupted streaming.", "verified": true, "helpfulness": "0/0", "author": "Jeanette R. Lapp"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Chuck Leithoff"}, {"rating": 5.0, "review": "Great inexpensive tool to use to watch movies, TV series and more!  Love being able to view my pictures on a big screen!  Loved the fact that it was so easy to install to my TV.", "verified": true, "helpfulness": "0/0", "author": "M. Miller \"Winemom\""}]