[{"rating": 2.0, "review": "Google Cromecast is better..", "verified": true, "helpfulness": "1/1", "author": "N. Nagalingam"}, {"rating": 5.0, "review": "Had some setup issues to start with, but thanks to the helpful customer support group at Amazon was able to fix all the issues and the device works great.  Very impressed with the interface and the responsiveness of the remote.  Would recommend to anyone looking for  a simple and inexpensive way to make your regular HDTV \"smart\".", "verified": true, "helpfulness": "0/0", "author": "Kenneth Rodriguez"}, {"rating": 4.0, "review": "Set up was as easy as plugging it in and entering my network password.  Love the remote since it can be pointed in any direction and will work...great when your hiding under the comforter on those cold nights, lol.  I would have given 5 stars except that it did drop my Netflix connection and on another occasion the movie I was watching was jittery and stuttering.", "verified": true, "helpfulness": "0/0", "author": "Jasmine Gordon"}, {"rating": 3.0, "review": "It's ok, but nothing is free", "verified": true, "helpfulness": "0/0", "author": "Kandi B."}, {"rating": 4.0, "review": "A great little stick. Really love using it. Just wish the connection speeds were quicker with Plex and the UI was more straight forward or customizable.", "verified": true, "helpfulness": "0/0", "author": "Lloyd"}, {"rating": 5.0, "review": "Great products!!", "verified": false, "helpfulness": "0/0", "author": "Jason Oglesbee"}, {"rating": 4.0, "review": "I waited too long to buy something like this.  Setup was a breeze, streaming via wifi is not an issue.  Only thing you may notice once in a while is a small glitch during play time as wifi cant keep up.I would give it five stars if they figured out a way to enter in key inputs.  They try to resolve this using voice command but having a separate room should have some better efficiencies.  To visualize, an on screen keyboard comes up and you have to use left, right, up, down buttons on the remote to do a basic search or entering in your network details.", "verified": true, "helpfulness": "0/0", "author": "Kevin Huen"}, {"rating": 5.0, "review": "I got this during the pre-order phase when it was available to Prime members for $19.99.  I probably wouldn't have gotten it otherwise, but it seems like a great device so far.  We have a Roku running on another TV and it does much the same thing.  I would say that the Fire Stick is not as user friendly a menu experience as Roku but the Fire's big advantage is the huge game library by comparison.  I know that my daughter (age 6) is going to love that and I like that the games aren't $50 a piece or something ridiculous like coming from an X-Box.", "verified": true, "helpfulness": "0/0", "author": "Fred Ramey"}, {"rating": 3.0, "review": "I love the device but i cant connect to my satellite provider because it's not on the list", "verified": true, "helpfulness": "0/0", "author": "m hawkins"}, {"rating": 2.0, "review": "Not being able to play prime movies is very disappointing.", "verified": true, "helpfulness": "0/0", "author": "marc holder"}]