[{"rating": 5.0, "review": "I love my Fire TV Stick! I've not had a single problem with the equipment or the service. Get one now!", "verified": true, "helpfulness": "0/0", "author": "Lisa Reynolds"}, {"rating": 4.0, "review": "It works for what we wanted from it", "verified": true, "helpfulness": "0/0", "author": "Rakesh Prasad Dhariwal"}, {"rating": 3.0, "review": "honestly spend the extra money and get the box....Main reason, remote to stick communication is poor (keep reading). I have the box and NO ISSUES. I got the stick for buddy and we hooked up and found you need to favor the side of the TV the stick is located for remote control to work proper, 60\" TV. Makes sense I guess since a big TV is blocking communication? Signal was Strong also to be clear. Maybe it was just us and an odd issue, And no one else has noticed this? but it was an obvious issue in our case... Set up is simple and the good thing about stick is it's convenient to move from TV to TV. Other than that everything works as it should.", "verified": true, "helpfulness": "0/1", "author": "BONES"}, {"rating": 5.0, "review": "Great way to watch t.v. Very responsive", "verified": true, "helpfulness": "1/1", "author": "matt scheidenhelm"}, {"rating": 5.0, "review": "So excited -easy to install on my \"non SMART tv\". It must have been back ordered when I first ordered but arrived on the promised delivery date.", "verified": false, "helpfulness": "1/1", "author": "DiDi"}, {"rating": 4.0, "review": "works very well.  Much more convient than using the WI", "verified": true, "helpfulness": "1/1", "author": "michael Carter"}, {"rating": 1.0, "review": "This by far is the worst streaming device on the market. I have two Roku 3's and s chromecast so when this thing came out on special for $19 I thought I would give it a try but that was the worst $19 spent. I put this on my bedroom tv where my chromecast was working just fine and I can't make it through one movie or tv show without it shutting down saying it can't connect. I had a decent wifi signal to start with so I added a wifi extender to see if that was the problem and now I get almost 50mbps in there and it still shuts off. Get a chromecast instead.", "verified": true, "helpfulness": "0/1", "author": "Travis A Burkhead"}, {"rating": 1.0, "review": "Got it yesterday and its going back. It doesn't stay connected. Says weak signal. ALL my other devices work just fine.  Worked once yesterday and wont stay connected.", "verified": true, "helpfulness": "0/1", "author": "Jason Moore"}, {"rating": 5.0, "review": "This is a great product. Especially if you don't have cable.I would recommend getting one. It's easy to set up and I just love it!", "verified": true, "helpfulness": "1/1", "author": "Jhnalxndr"}, {"rating": 5.0, "review": "Very easy to learn and use. Now to just get my husband to enjoy it as well. LOLI am the geek and he is not.", "verified": true, "helpfulness": "1/1", "author": "J Angela"}]