[{"rating": 5.0, "review": "VERY GOOD", "verified": true, "helpfulness": "0/0", "author": "MARCIO HAGIME YOSHIDA"}, {"rating": 3.0, "review": "I have amazon prime but to watch a prime movie in HD I still have to pay. When it's free on A regular smart tv. Other than that it's ok by me.", "verified": true, "helpfulness": "0/1", "author": "Marc Lijoi"}, {"rating": 1.0, "review": "I had a little trouble getting signed up due to a situation where my daughter, who has a very established account, at some point helped me with my first purchase from Amazon and got me signed up for (temp. prime).  This somehow interfered with me signing up for the 30 day trail for video prime. With great perseverance from my daughter, an Amazon manager was able to correct the problem. My thanks to both.", "verified": true, "helpfulness": "0/2", "author": "john owens"}, {"rating": 5.0, "review": "absolutely Love It!!!", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 3.0, "review": "It works as advertised. Once the free month of Amazon prime runs out its going to limit the choices by a lot.  I wish there were a few more apps from the Amazon app store or any from the play store that it would allow.  The availability to stream current TV/movies is based on how much you'd like to spend on rentals, and what cable company you have (many apps are based on you having regular access to that channel already.. AMC, AE, Disc, etc). I guess sideloading is always an option...", "verified": true, "helpfulness": "0/0", "author": "R. McKee"}, {"rating": 5.0, "review": "Love it so far, fast and easy to navigate, got it on sale just to try it and now thinking on getting another one", "verified": true, "helpfulness": "0/0", "author": "luis"}, {"rating": 4.0, "review": "I would like to be able to root it. Any suggestions?", "verified": true, "helpfulness": "0/0", "author": "michael ferguson"}, {"rating": 3.0, "review": "Beware,  no sdcard support,  minimal storage.  Basically limited to what Amazon wants you to watch.  I love my pure Adndroid boxes,  they give me same options and a world of extras..  One + thing is good UI, works well with the remote.", "verified": true, "helpfulness": "0/0", "author": "Moe"}, {"rating": 5.0, "review": "Love it! So easy to control.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "The remote could be bigger and have buttons that illuminate, otherwise its one of the best investments I have made this year.", "verified": true, "helpfulness": "0/0", "author": "William Spero"}]