[{"rating": 1.0, "review": "I was having problems setting this up and no instructions no phone number nothing. I looked up information on the Internet and again no information. Terrible", "verified": true, "helpfulness": "0/0", "author": "Sheri Snyder"}, {"rating": 3.0, "review": "It has started to lag for me and not sure what the cause is.  Speed is still the same for internet.", "verified": true, "helpfulness": "0/0", "author": "Michael Bixler"}, {"rating": 4.0, "review": "Get device, easy to install.  they only thing is it's as good as your cable provider.  Amazon Prime is awesome, but Time Warner will not allow you to hookup to HBO Go or Showtime.  They will not stream.  Has to be a way around it, but I haven't figured it out.", "verified": true, "helpfulness": "0/0", "author": "Theresa T."}, {"rating": 5.0, "review": "Im impressed by how well the Amazon Fire Stick TV streams , and the convenience of having all of my Amazon Prime features , movies, music as well thank you so much Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Daniel Riegle"}, {"rating": 1.0, "review": "First week great! Then it became very slow. After that it stopped all together. Called twice, was told the that there was Suspicious behavior. Explanation, someone was using my code to box? I never gave it out. He didn't have an answer how I could correct this. Best buy will not take back a return because it's an amazon product. So as as a customer get screwed on this purchase. If my code gets hacked into, wouldn't it be just as easy to do it again? I will say I liked the ease of operating it. Wish you had a better safe guard in your system. Thanks for listening.Sherry Carlson", "verified": true, "helpfulness": "3/3", "author": "Sherry L. Carlson"}, {"rating": 5.0, "review": "I'm a movie lover.  The fire stick it's easy to use and you can see almost any movie or TV show from past and present. Any sport, movie, tv shows love this fire stick is for you. Best buy ever..........!!!!!", "verified": true, "helpfulness": "0/0", "author": "Ana"}, {"rating": 2.0, "review": "Freezes up. Called support asked if the device maybe defective, they told me to try it on a different monitor, power down then power up, etc. same results. I told them i don't have any issues with my roku stick. ? So this is my rating for now.", "verified": true, "helpfulness": "1/1", "author": "T.H"}, {"rating": 5.0, "review": "What an incredible purchase.  Now on Sundays, which are bereft on anything worthwhile on satellite or cable TV, I can always find a movie or series that is interesting.  Wanted to get Neflix for a long time and now it is easy.  I put a wifi antenna on to my router and everything comes across without interruption.  It's like a kid in a candy store.Tom", "verified": true, "helpfulness": "0/0", "author": "Thomas P. Welsh"}, {"rating": 5.0, "review": "I love the firestick.  We only have a tv antenna now and wifi in the house.  We are saving over $100 a month by shutting off cable and/or satellite.  There are lots of options with firestick.", "verified": true, "helpfulness": "0/0", "author": "P. Foster"}, {"rating": 4.0, "review": "I'm reserving that last star, going with four stars initially, because I'm still exploring all the available content on my new Firestick since I've not yet had it even a week.  So far, I'm finding lots of movies and TV shows and music videos to watch, and music to listen to, as well.  The only drawback I can find thusfar is that HBOGo and ShowtimeAnytime require a subscription to a TV service in order to access them on the Firestick.  Like many people nowadays, I'm trying to cut the cable, not tie myself back to it again.  So, when will Firestick offer these now exclusive subscription services on Firestick for a fee, just like NetFlix, HuluPlus and AmazonPrime?  I'm very happy with my Firestick, otherwise, and can hardly wait to explore it further!!!  It's an amazing little gadget, opening a world of entertainment!!!", "verified": true, "helpfulness": "0/0", "author": "B. A. Davis"}]