[{"rating": 1.0, "review": "I regret not reading the 1000 technical questions posted as a red flag to this product that still needs to go through numerous updates before it is worthy for the general public. I attempted to set it up from right out of the box and directions. WARNING: No where, no where on it does it state that you need to go to 'settings' on your television remote and scroll down to Fire TV Stick to start the process. I mistakenly clicked 'parental control' after the initial set up and was immediately trying to reverse out by hit the reverse button and could NOT get out. Why? because The up/down/side to side arrows created numbers and I am now stuck in verification page 2/2, no way to get out and NO instruction manual.Here is another huge red flag about this product: there are support manuals for sale! Sending it back!", "verified": true, "helpfulness": "2/2", "author": "Kauai"}, {"rating": 5.0, "review": "Great for movies and video games!", "verified": true, "helpfulness": "0/0", "author": "Nicole Lillie"}, {"rating": 5.0, "review": "The fire stick is awesome the remote makes it very easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Sandra Cabaniss"}, {"rating": 5.0, "review": "I was apprehensive about purchasing the Amazon Fire TV Stick, but I am so glad I did!  It was incredibly easy to set up. It probably took about five minutes, honestly. It is easy to navigate, and I love being able to have all of my favorite programs right there, and accessible to me at any time.", "verified": true, "helpfulness": "0/0", "author": "Samantha W."}, {"rating": 5.0, "review": "Having family fun using the Fire TV Stick to catch up on our movies and shows. Easy to use. Can't wait to take it along on vacation with us!", "verified": true, "helpfulness": "0/0", "author": "Sonshine"}, {"rating": 2.0, "review": "WORST PURCHASE EVER! Freezes...spits and sputters constantly...will not play Netflix uninterrupted...don't even think about playing Hulu on it...totally piece of junk. After trying to get it to work properly for a couple of months..I give up. Going to replace it with a Roku stick.", "verified": true, "helpfulness": "2/2", "author": "Greenporker \"SB\""}, {"rating": 3.0, "review": "It works fine for some uses, but there are problems. Hulu, in particular, works very poorly, with the video freezing but the audio continuing. I researched the issue after experiencing it and found that this has been a known problem.", "verified": true, "helpfulness": "1/1", "author": "Chris in AL"}, {"rating": 5.0, "review": "This is great for Amazon prime members. I just plugged it in to the back of my television and very easy to set up", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 1.0, "review": "This product worked fine at the start. I have a strong WIFI connection (> 50 Mbps), and the stick was plugged in and powered. However, numerous times, the audio would stop working. Doing a reboot, unplugging the device, many times didn't fix the problem. Other times, the screen would flicker a lot. Unplugging and plugging the stick back in solved that, but it meant every time I wanted to sit down and watch something, I had to do this. I thought this would be a good replacement for cable TV, but it is not. It is not a refined product, but what do you expect for $35 ? Amazon did not spend much time fixing the SW & HW bugs here and you can tell. It is not worth the aggravation. It's better to just watch Netflix or Hulu on a laptop. The idea of putting a fast processor in a stick is nice, but you need to do the quality SW development and HW integration to back it up. This is not something which Amazon did.", "verified": true, "helpfulness": "2/2", "author": "MB"}, {"rating": 5.0, "review": "In Love with this!!! Wow! I can't believe how much it does! When i linked it to my Kindle Fire it's even better! Having Amazon Prime helps, There are literally thousands of movies and tv shows!! I'm impressed!", "verified": true, "helpfulness": "0/0", "author": "reflexology_blaque"}]