[{"rating": 5.0, "review": "Love this device, easy to install I had it up and running in a few minutes!!  Very fast with my wi-fi.", "verified": true, "helpfulness": "0/0", "author": "GoodKnight \"GK\""}, {"rating": 5.0, "review": "Amazing product!", "verified": true, "helpfulness": "0/0", "author": "katie rasmussen"}, {"rating": 5.0, "review": "Buy it now! Very useful!", "verified": true, "helpfulness": "0/0", "author": "Sean Mays"}, {"rating": 1.0, "review": "Worst steaming device on the planet! Always buffers using flister because god forbid that greedy owner of amazon allow 3rd party content that works properly like m-go or vudu on it's precious firestick, I have roku's in my house as well as 2 firesticks and guess which devices have issues on a daily basis streaming anything? The rokus never have issues streaming netflix,vudu,amazon prime ect, But on the other hand when i use the firesticks i get playback issues and buffer isuess all the time and i have a 60MB internet connection and a top of the line asus router that works perfectly fine for everything but your firesticks so don't tell me when i call support that it is MY problem and my internet is the issue or my router when we know it isn't, Stop bs'n your customers and telling them when it is a amazon issue and you don't address it and coach your support to lie and blame the customers provider or routers when it is a farse! If i could refund my firesticks i would because nobody on craigslist will even buy them i would have to pay some one to take these things off my hands. If you want a device that works like it is suppost to just get a roku and pay the extra few bucks it is worth it trust me, I have both the roku stick and the roku 3 and am very pleased with both of them and will never use amazon devices again.", "verified": true, "helpfulness": "1/4", "author": "David"}, {"rating": 5.0, "review": "it works great", "verified": true, "helpfulness": "0/0", "author": "greg clark"}, {"rating": 5.0, "review": "Awesome device. Paired with Prime it's a slam dunk.", "verified": true, "helpfulness": "0/0", "author": "K. Olsen"}, {"rating": 5.0, "review": "Works great!  The phone app works well with it also, easier way to enter search text!", "verified": true, "helpfulness": "0/0", "author": "DStark"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "stephanie ford"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kikolicious"}, {"rating": 3.0, "review": "Not Enough apps", "verified": true, "helpfulness": "0/1", "author": "James Rigdon"}]