[{"rating": 5.0, "review": "Definitely buying another for my home in Jamaica", "verified": true, "helpfulness": "0/0", "author": "Ziddy"}, {"rating": 3.0, "review": "It is an ok device. I bought it when it was heavily discounted (around $20 I believe), and that's about what it is worth to me. Now that it allows access to HBO GO and I've owned it for around 6 months, I feel like I can give it a fair review.First, it was easy to install and easy to connect to the wireless network. I like that it comes with a remote which some of the other \"sticks\" don't offer. Amazon Prime (and Amazon non-Prime) content is heavily featured, but the search mechanism also includes results from other applications.As for content, I use Amazon Prime, Netflix, PBS Kids, Youtube, Flixster and HBO GO on this device. Everything *except* Flixster and HBO GO works great. HBO GO is ok, but the UI runs very slow right now on my fire tv stick. I am able to view content though if I'm patient. As far as I can tell, Flixster is the only platform available to watch your ultraviolet movies if you have an ultraviolet collection. The application doesn't work very well. I don't want to turn this into a review of that application, but suffice it to say that I go to the bedroom where the Roku 2 is if I want to watch a UV movie.Another big problem for me is the complete lack of any way to watch movies on my \"Disney Movies Anywhere\" account. There is no DMA app, and the other providers (Chrome, Vudu, and ITunes) also don't have an app. I was able to watch 1 DMA movie on Youtube, but that has since been disabled apparently (by Amazon or Google, I don't know).For a streaming digital device, the inability to access paid digital content defeats the purpose and completely ruins the device for me. I realize this is an Amazon device and if you only purchase movies from Amazon, it will probably work for you. I don't want a device that locks me into 1 provider though when there are other options available.Another somewhat annoying problem is that the remote sometimes \"sticks\" when I push an arrow key. So instead of fast fowarding by 5 seconds, it goes 10 minutes ahead as if I held the button down for 10 or 20 seconds. That is just a minor inconvenience though. Occassionally, the stick freezes up or \"gets confused\" and I have to unplug it and plug it back in, but that is also a minor issue for me.If the fire tv stick had a VUDU application which allowed access to UV and DMA movies, it would be a 5. If my Amazon account connected with my Ultraviolet and DMA account, it would also be a 5. For now, I'd say to skip it and go with a roku. My roku 2 is still going strong and I prefer it much more than the fire tv stick. That said, if you don't need access to your ultraviolet or DMA account, it is a decent device at a decent price. If you've never used a streaming device before and have an account with Amazon Prime and/or Netflix, it should do the job for you.", "verified": true, "helpfulness": "1/2", "author": "Zack M"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Robert A Casper"}, {"rating": 5.0, "review": "Easy to install and it works great!", "verified": true, "helpfulness": "0/0", "author": "Marilyn Belenky"}, {"rating": 3.0, "review": "Works great but ,Most you would like to see. You will need to pay extra. There are better options out there.", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 2.0, "review": "I actually purchased mine from Best Buy.  I am not impressed with the Amazon Fire TV Stick.  The number of apps is pitifully small when compared to the Roku devices.  I could not even get the subscription CBS app for the Fire TV stick.  The buffering is most annoying.  The constant freezing and then starting up again is very distracting.  Returning this for a the new Roku 3!", "verified": true, "helpfulness": "0/1", "author": "Curious Reader \"curious reader\""}, {"rating": 5.0, "review": "I have two of these now and use them frequently since we cut the cable. very easy and intuitive to use. Set up was a breeze.", "verified": true, "helpfulness": "0/0", "author": "nikk410"}, {"rating": 5.0, "review": "So easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Kelly A Cassise"}, {"rating": 2.0, "review": "It's just an okay vehicle for movie streaming.  I", "verified": true, "helpfulness": "0/0", "author": "Trevon Delisle"}, {"rating": 4.0, "review": "I LOVE this thing, when it works.  And honestly it works, most of the time.  It has a weird habit of randomly dropping the internet connection and then refusing to reconnect until I put it to \"sleep\" and then \"wake\" it up again, but this is a minor annoyance.  When I bought it I wasn't sure that I would really use it.  I had my old PS3 in the bedroom which was perfectly capable of watching Netflix and Prime Video, and most of the other things the Fire TV Stick does, and I had my PS4 in the living room capable of the same things.  But the real advantage came in ease of use, noise, and portability.  The Fire TV Stick remote is a much simpler interface than either iteration of the Playstation, and with the app installed on my phone I can control it even when the little remote comes up missing for a few days here and there (my kids usually blame the dog for this).  It is also completely silent, thanks to no spinning hard drive or whirring fan (this is a big help for late night binge watching in the bedroom while my wife tries to sleep, that PS3 is a noisy machine)!  Last but certainly not least, portability.  You can take it anywhere.  It's small, virtually weightless, and pretty much plug and play.  As long as you have a TV with an HDMI port, a power outlet and a WiFi connection you can access this thing is ready to go.  It remembers your account information, so aside from setting up the new WiFi connection there is no complicated login and setup process.", "verified": true, "helpfulness": "0/0", "author": "BT"}]