[{"rating": 5.0, "review": "So far, we've been very happy with the Fire TV Stick. Super easy to set up and start using and the remote is a bonus that the other players in this area are missing. Would love it if it included YouTube, but don't really expect that to become a reality anytime soon.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 3.0, "review": "I don't think the stick works as well as the Fire Box. It stops a lot in the middle of music or others things that I'm watching. It is annoying. What I didn't realize is that you can not have both the Stick and the Box on in the house at the same time. They will not work. My recommendations would be to spend the extra money and get the Fire Box.", "verified": true, "helpfulness": "0/0", "author": "Irene Clemeno"}, {"rating": 5.0, "review": "Both my wife & I were surprised how easy it was to navigate through the menu. It is much easier to use  than our downstairs (Smart) TV. This stick is for our living room TV.  We're already a Prime member so we have access to all of that on an additional TV. Best 40 bucks we've spent in a long time!", "verified": true, "helpfulness": "0/0", "author": "A. C. Dargavel \"Ripkenfan\""}, {"rating": 4.0, "review": "Love it!  Turns your TV into a \"smart TV\" without having to purchase one!  Easy enough for this grandmother to use!!!", "verified": true, "helpfulness": "0/0", "author": "Beverly Kurtz"}, {"rating": 5.0, "review": "First I bought this because I have had amazon prime for 2 years and never been able to enjoy the free movie portion of it without my PC.  So for $20 I thought why not?!  Well I plugged this thing in (it already knew me), ran through on screen instructions (which were so simple they were not needed) and boom I was watching a movie for free within 3 minutes of plugging the thing into the back of my TV.  Now i only boght it for prime stuff but I see I can also use it for Showtime anytime (yeah) and they are getting HBO to Go soon so I will be better able to utilize my showtime and HBO subscriptions.  Oh and I also tried my net flix off this instead of my DVD player and played like a charm, no freezing nothing, was fabulous! I love this thing for what i bought it for.  For the money it met adn exceeded my expectations.  I will play around with the other options but it is great! :)", "verified": true, "helpfulness": "0/0", "author": "N. Tedford \"finnickie\""}, {"rating": 5.0, "review": "Love my fire TV stick.  Works great.  Doesn't have the voice search but since my son stole my Fire TV from the living room, I was happy to be able to replace it with the Fire TV stick and such a reasonable cost.", "verified": true, "helpfulness": "0/0", "author": "christine zurica"}, {"rating": 5.0, "review": "Fantastic! We have been using our Fire TV Stick so much since it arrived. Extremely easy to use and portable. Our favorite use for it is to hook it up to our projection screen and watch movies for free from Amazon Prime. It keeps track of movies we are watching if we need to stop for whatever reason. The kids love to listen to our music on it too because the lyrics appear on the screen and they have impromptu karaoke sing-alongs. So many other functions that we haven't even utilized yet. I highly recommended this device to relatives over the holidays!", "verified": true, "helpfulness": "1/1", "author": "Limes"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "1/1", "author": "Shelly Schrome"}, {"rating": 4.0, "review": "The Fire stick is fantastic for viewing anything you can imagine.  The apps are great (Netflix, Prime, Hulu, YouTube, etc.).  The connection is quick, haven't had any big lag issues where I've had a strong WiFi signal.The two issues I've had are somewhat minor, but I wanted to note them.  The remote, after only a month or so of use has become a bit \"glitchy\".  What I mean is, if I'm trying to type in a subject for YouTube or look up a movie on Prime, I'll click on each letter and it'll just keep scrolling through the letters and stop whenever it wants.  Or, I can click to select a letter, and it'll scroll a few letters away and select that one.  It can be VERY annoying.  I know I can use the android app, but you can't use the keyboard on YouTube thru the app.The other issue I've had is that, I normally keep the stick plugged into a surge protector, but if I unplug it while using the stick, it automatically cuts off.  It's like it doesn't have a the \"sense\" to know that it still has working power and doesn't need to be plugged in all the time.If it wasn't for those two issues I would give it 5 stars.  Great product, may end up getting another one later on.", "verified": true, "helpfulness": "1/1", "author": "Justin W."}, {"rating": 5.0, "review": "I am a lover of Chromecast because of the simplicity and the low cost, I have a bunch of them throughout the house.  I picked this Fire TV Stick up when it was on sale for $20, figured I had nothing to lose.  I must say, it is now the primary media player used on my living room TV.The remote is the main benefit over Chromecast.  Sometimes I would rather just browse on the TV screen than from my phone.  Another surprise is that I can \"Cast\" from my phone to the Fire TV Stick from Netflix and Pandora.Hopefully, the available apps will expand in the near future, there are a few that I use regularly that are not yet available.Overall, I like the product.  Even at full price, I think it is worth the extra $10 over Chromecast for the remote, at least for my living room TV.", "verified": true, "helpfulness": "1/1", "author": "Chris"}]