[{"rating": 1.0, "review": "I have high speed internet, and have multiple apple TV devices, multiple computers and mobile devices that all have no problems working.  I have yet to be able to use the fire stick to watch a program where it does not reset and disconnect multiple times saying device error an internet connection is required.  The setting show I have a full strength \"Very Good\" signal strength and this is the only device that continually fails.  Even with no other devices turned on.. I cant watch more than 3 minutes of a show before it drops signal and resets.  If this was more than $35 I would be more upset - but it just isn't worth the time and frustration to fight with it.I renewed Netflix and have effectively moved on from even trying to use firestick.  I tested it again because I got the request to review.... 4 minutes in to a show and it disconnected.Gary Busey was wrong, the sea shell is much more valuable - it doesn't waste my time.", "verified": true, "helpfulness": "1/1", "author": "Adventure Dives"}, {"rating": 5.0, "review": "It's great.", "verified": true, "helpfulness": "0/0", "author": "Mattie Logan"}, {"rating": 5.0, "review": "I love this.  Easy to use, easy to set-up and cheap compared to other brands.  Please note that this does need to plug into as USB port or a power outlet.  I didn't realize that when I bout it. It worked out fine, but it did make it a little bigger than I was expecting.", "verified": true, "helpfulness": "0/0", "author": "PAK"}, {"rating": 4.0, "review": "Very smooth and fast. Also have a roku stick and prefer this.", "verified": true, "helpfulness": "0/0", "author": "Adam Moskowitz"}, {"rating": 5.0, "review": "Works well.  Easy to use and packed full of functionality.", "verified": true, "helpfulness": "0/0", "author": "oja7"}, {"rating": 4.0, "review": "shipped in 2 days, very easy to set up happy with the stick so far", "verified": true, "helpfulness": "0/0", "author": "Raymond A. Vallilee \"Ray V\""}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Duchess"}, {"rating": 5.0, "review": "I am extremely pleased with the Amazon Fire Stick! It more than met my expectations.", "verified": true, "helpfulness": "0/0", "author": "Kenda"}, {"rating": 1.0, "review": "Advertise 100s to 1,000s of free movies etc. Only through 30 intro to Amazon Fire and only on select items. After that you can go to Red Box and rent the same things for $1.... Rip Off ! No advantage here.", "verified": true, "helpfulness": "0/1", "author": "E. McDougall"}, {"rating": 5.0, "review": "EASY TO INSTALL.WORKED EXACTLY AS EXPECTED.", "verified": true, "helpfulness": "0/0", "author": "GANDALF THE WHITE"}]