[{"rating": 1.0, "review": "I bought this when it was only $19 as a prime member. I was ecstatic and couldn't wait for it to come, as I do not have a smart tv and currently was streaming everything with my laptop through a HDMI cable. Which the quality of my feed  was mediocre. After waiting over a month for my stick to arrive, I was excited as can be when it was delivered. The packaging was very sleak, and the device itself had a nice look to it. I spent 25 minutes setting the firestick up because it was quite slow. When I finally got it set up I was ecstatic to start watching something. It immediately brought me back to network settings, and stated that I was connected to the internet but with problems. I spent over two hours rebooting the system, my router, and moving the router closer to the system. I decided to just try again another day because at the point I was irritated. So i tried again about a week later, and got online with amazon customer support. They stated it was a problem with my router and that it must have a firewall up blocking my FireStick. I proceeded to get on the support line with my internet provider and we took down all the firewalls with still no luck.  I decided to try the stick at my parents house who have the roku stick and Roku 3, and were interested in getting the FireStick for another one of the TVs. We had the same issues there. I ended up returning the device and they are sending a replacement after three rounds with amazon customer support. The device was returned on Christmas eve, and now I have to wait till after February to get my new replacement. When I receive my replacement and IF it works, I will update my review , but, as of right now, this has been my worst purchase from amazon ever.", "verified": true, "helpfulness": "0/0", "author": "Lauren Hartley"}, {"rating": 5.0, "review": "I enjoy unlimited movie", "verified": true, "helpfulness": "0/0", "author": "QUINTINA HAWKINS"}, {"rating": 5.0, "review": "Awesome and very smooth interface. I was pleasantly surprised with everything except the stupid intro video.", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 5.0, "review": "Perfect addition to a second tv.", "verified": true, "helpfulness": "0/0", "author": "Kingwood Judy"}, {"rating": 4.0, "review": "very cool product, eliminated having to use my PS3 to stream amazon and netflix.  my only gripe is that they tuck netflix into a separate menu rather than it being instantly available.  i'll reserve judgement since they obviously want to promote use of their own streaming service first.  I wish I didn't need to plug it into a power source either.  it would be much more convenient if it could power from the tv.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "Good implementation with a polished UI.  Makes watching Amazon Prime video much easier given the streaming services isn't available on a host of other devices.  Very easy setup.  Bought one as a gift as well - and they love it.", "verified": true, "helpfulness": "0/0", "author": "ARLeggett"}, {"rating": 5.0, "review": "I love this thing! I asked for it for Christmas and it was my favorite gift. I love that its portable and has access to some useful apps already. The price is affordable and totally worth every penny compared to other options. Definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "ARS1709"}, {"rating": 5.0, "review": "I mostly use it for amazon prime videos and running the Plex app on my bedroom TV.  Both work great over wifi.", "verified": true, "helpfulness": "0/0", "author": "D. Gibson \"dobs\""}, {"rating": 3.0, "review": "It has a poor signal to our router. I have yet to figure it out. I'll update when I do.", "verified": true, "helpfulness": "0/0", "author": "Morgan O'Neil"}, {"rating": 5.0, "review": "Oh I love my fire stick.  I'm about to take it on a trip for the first time this week and I am excited to have amazon with me.  So far at home it is working great.  I'm not sure how it does it, but movies start instantly when I want to watch them and I have zero latency issues even with my slow internet.  This stick is wonderful and it will be what I buy if I need another multi-media box.", "verified": true, "helpfulness": "0/0", "author": "Derek C. Bernard"}]