[{"rating": 1.0, "review": "Very disappointed. All set up and connected and according to the fire tv stick, the signal strength is 'very good'.  When I try to actually watch a movie or listen to music though, I get a message that I'm connected, but with problems. Optimistic me, I think \"Ok, I can work with that.\" Only, there's no troubleshooting option available to me on the device. Tried the advanced settings, which only takes me back to the available networks screen. Called Amazon to find out how to return it and the VERY pleasant person (no sarcasm here - really nice) I reached wanted to troubleshoot with me. Okay, sure. I'm agreeable to that. When the 'tech' troubleshooting doesn't work I'm offered a replacement device. Again, I'm agreeable. However, I will have to wait until my 10 year old turns 18 (yes, a bit of an exaggeration because I have no kids yet, but you get the idea) to get the replacement device as there's a backlog. Really??  Well, to say I'm disappointed in Amazon's new device would be an understatement - (I didn't even get to mention the limited app options. However, full disclosure, I would not be bothered by that if the thing actually worked.) This was my first venture into purchasing an actual amazon-created device. It will be my last.  I realize that my experience may be the anomaly.  So, I hope you all have a better experience than I've had. My device is being returned and I'm looking into a roku instead. Still love Amazon for purchasing other peoples' products though! In fact, I will probably purchase my roku from Amazon!", "verified": true, "helpfulness": "230/258", "author": "Customer 2"}, {"rating": 5.0, "review": "Súper", "verified": true, "helpfulness": "0/1", "author": "cesar guillen"}, {"rating": 5.0, "review": "Easy to setup, already synced to my Amazon prime account out of the box. Uses wifi to connect to Internet which is a plus over Google cromecast, easy to operate remote control. Turns your TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Charles Hance"}, {"rating": 5.0, "review": "Amazing product. Blows my roku away. Great job Amazon", "verified": true, "helpfulness": "0/0", "author": "Mark McDonald"}, {"rating": 5.0, "review": "It just arrived today. It is easy to install and easy to use. I haven't used the free movies and videos I get with my Prime membership because I don't think watching a movie on a laptop is much fun, but now I can watch them on my regular television!", "verified": true, "helpfulness": "0/0", "author": "Nelda S. Mohr"}, {"rating": 5.0, "review": "Amazing piece of technology. Highly recommend. Simple and easy to use. Couple it with the Android Application and it is just great.Buy with confidence", "verified": true, "helpfulness": "0/0", "author": "A.B.S."}, {"rating": 4.0, "review": "I had little trouble getting it to work, but not really plug and play on my Samsung TV. It wouldn't download the latest update, and won't work until it does. It occurred to me that everyone was probably trying at the same time, so I waited and eventually it downloaded. The auto resolution set automatically set the wrong resolution, but there is a manual adjustment so everything can fit on the screen. Once those issues were solved, we were good to go. I have a Belkin wireless link which does pretty much the same thing, except the Belkin will not show Amazon Instant Videos without reloading every 60 seconds. It works great for Netfilx and everything else. The Fire Stick, on the other hand works perfectly for Amazon Instant Video as well as the others, and for that alone I'm happy with the purchase. The cons are that it won't hook up to my home theater, my install required the HDMI extension, so it's not exactly esthetically pleasing, and on the Samsung it only works on 720. The pros are it works perfectly, picture is great, and at $19 I should have bought 2.", "verified": true, "helpfulness": "0/0", "author": "Lou"}, {"rating": 5.0, "review": "it is compact and has done  a good job so far.", "verified": true, "helpfulness": "0/0", "author": "Keith D Rauch SR"}, {"rating": 5.0, "review": "Blows the Apple TV and the Roku and the Chromecast out of the water. For $0.99, you can download an AirPlay app from the Amazon store which allows you to AirPlay from your iPhone/iPad/Mac directly to your Amazon Fire TV Stick. It works flawlessly. That, combined with Plex, Twitch, YouTube, and Netflix and I have everything I need (and Amazon Prime Instant Streaming, of course).To be fair, there are two slight flaws. 1) the YouTube app is really laggy for some reason. I expect more from Google. 2) it's not quite as responsive as \"full-sized\" TV boxes, like the AppleTV or the bigger Amazon Fire TV box (non-stick). But it plays videos flawlessly — which is what it's designed to do – and for less than half the price of its competitors, it's hard to argue with.Oh, also, it's got games, although I'm not a heavy gamer, but they look fun and run well for the few I've tried.", "verified": true, "helpfulness": "0/0", "author": "Philip B. \"Philip\""}, {"rating": 4.0, "review": "I bought this stick under the $19 offer for prime members and I was hugely optimistic.I'm a huge purchaser of nearly every new electronic device that comes out so I figured I'd take the plunge on this. There is a huge lack of Amazon store related content. What you see advertised on the product listing is literally just about all there is available. The GUI is snappy and clear, but initially the streaming was horrendous. I had the stick set to 1080p 60hz hooked up to my 240hz LED tv and the picture would come through blurry, slightly distorted on whatever I play (flixster, prime content). I couldn't get a single device I own to miracast to it (iPad, HTC one, galaxy s4). Upon unplugging it after getting immensely frustrated, I also noticed the thing to be quite warm.Since it wouldn't work well on the tv I wanted to use it on, I set it up on a 720p Toshiba and adjusted the settings to 720p. I sidelpaded XBMC and began playing a bunch of content on that. After about a week of use, my sluggish stick seemed to pick up juice. So, I plugged it back into my tv that I wanted to use it on (1080p 240hz LG LED) and low and behold the thing works fine now. Don't know why it would take a week to shake off the dust, but it's up and operational. No WiFi issues as most are reporting. I use an Apple airport extreme (get yourselves a good WiFi hotspot people, yes the Apple ones are pricy, but the quality and performance outmatch netgear, linksys, and others) with no issues whatsoever.I still rank this at 4/5 stars due to lack of initial content. The fire tv box has much more for some reason. My hope is that there is a firmware update to improve the app store content and ability to customize the home screen a bit.", "verified": true, "helpfulness": "2/3", "author": "Jason A."}]