[{"rating": 5.0, "review": "I paid $100 for an apple tv and cant even watch Amazon prime on it because apple doesn't like amazon.  Shame on them for putting out a crappy product.This product, which is a fraction of the cost of the apple tv, lets me watch both amazon prime and netflix.  I love it.", "verified": true, "helpfulness": "1/1", "author": "Steve"}, {"rating": 5.0, "review": "Shipping=EXCELLENTPRODUCT=EXCELLENT", "verified": true, "helpfulness": "0/0", "author": "Alberto Ong"}, {"rating": 1.0, "review": "Slow and didn't pick up wireless as well as chromecast which worked every where.  Kind of disappointed purchased mainly because it played amazon prime but never got a good feed.I have not given up yet but for now I would not rrecommend this product.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works very well, easy to set up.", "verified": true, "helpfulness": "1/1", "author": "JC"}, {"rating": 5.0, "review": "Great product that I feel is far superior to Chromecast. Was lucky to purchase the first day for $19 but evenat current price would recommend to anyone. Very easy setup and use.", "verified": true, "helpfulness": "1/1", "author": "BobJam"}, {"rating": 5.0, "review": "Love the firestick.No problems with it.", "verified": true, "helpfulness": "1/1", "author": "Mary Radimer"}, {"rating": 3.0, "review": "The stick itself is fine, I don't like that I have to pay for Amazon Prime to get movies free ($99/year) or pay Netflix or Hulu per year. That adds up to lots of $$$ just to watch movies. I will probably just use On Demand on my TV for movies", "verified": true, "helpfulness": "2/3", "author": "Wanda Cushing"}, {"rating": 5.0, "review": "I had know problem with set the set up was very easy I am enjoying the movies  Thank you very much", "verified": true, "helpfulness": "1/1", "author": "Darlene Thompson"}, {"rating": 4.0, "review": "Works well as advertisedOnly draw back is need for 3 remotes instead of one", "verified": true, "helpfulness": "1/2", "author": "Jo Ellen Marks"}, {"rating": 5.0, "review": "Easy to set up, easy to use and a great way to get your money's worth from Prime.  The need for a wall outlet that so many people mentioned should not be a deal breaker.  I am hoping that the movie and TV offers improve with time but for now the selections work for me.", "verified": true, "helpfulness": "0/0", "author": "Gracie C"}]