[{"rating": 5.0, "review": "exactly what I expected", "verified": true, "helpfulness": "0/0", "author": "S. Lynch"}, {"rating": 4.0, "review": "This is a great addition for me.  I watch Netflix, and not a whole lot of modern television.  I don't think I would have this on it's own, but as an added form of entertainment.  The prices of the movies are very high, and even rentals are high compared to Hulu and Vudu.  I also wish that the selection of \"classic\" movies (Carey Grant, Lauren Bacall, etc.) was more extensive.  It's very limited right now, but I'm sure there are coyright and other issues to contend with.  The interface is very easy to use, and the speed is excellent.  I'm also enjoying some of the original programming Amazon offers.  All in all, a worthy tool.", "verified": true, "helpfulness": "1/1", "author": "mapolson"}, {"rating": 5.0, "review": "Fantastic a great buy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I replaced my Roku stick with this. Hands-down, this is the way to go. Great picture, great UI and all that apps I love are on it.", "verified": true, "helpfulness": "0/0", "author": "Mark Pilipczuk \"Managing Director, MAP Consulting LLC\""}, {"rating": 5.0, "review": "Very convenient!", "verified": true, "helpfulness": "0/0", "author": "MP Legare \"teacher\""}, {"rating": 4.0, "review": "love the remote's simplicity. Also, besides Amazon content it has other features. Easy to plug in and out. Installation a breeze. My purpose for this stick was to enjoy the Prime Video. I did cancel my Netflix membership because Amazon prime had almost same content. However, they are lagging behind and therefore I don't use the Prime video as I would love too. If this product is to be totally successful, at least for me and many others, it must have same or more quality content and updated movie video collection for Prime members rather than trying to sell me episodes or movies that are easily viewed by competition or available at Netflix.", "verified": true, "helpfulness": "0/0", "author": "Cooldude"}, {"rating": 3.0, "review": "Video frequently jerks and has to buffer even though my older Roku does not have any of these issues.  Does not play friendly with my Plex media server either.  If I try to play a TV show through my Plex server that Amazon also offers on a pay basis through them,  my audio mysteriously doesn't work on my Plex tv show.  Go figure.  I also did some Speedtest tests while streaming and the Firestick seems to pull twice the bandwidth than either my Panasonic smart tv or my Roku.  One of my Speedtest reports showed that my Firestick was using 6mb/sec.  That's absurd for a standard 1080p video over Netflix.", "verified": true, "helpfulness": "0/0", "author": "Thomas Fish"}, {"rating": 5.0, "review": "I got this when Amazon was running a special so the price was great and between this and nextflix we are actually thinking about canceling our Dish, if not reducing some of the channels. In addition I have stopped buying DVDs.", "verified": true, "helpfulness": "0/0", "author": "D. Clemons"}, {"rating": 5.0, "review": "One of the best thing I ever bought from Amazon besides the Kindle Fire. This item is so easy to use and plug into your TV that you really don't need the instruction booklet. Just plug it into the TV and electrical outlet and then turn it on. Then follow the instructions on the TV.", "verified": true, "helpfulness": "0/0", "author": "G. Tung \"GT2of3\""}, {"rating": 5.0, "review": "This thing is amazing. I love that it is not another box that I have to add to my entertainment system.", "verified": true, "helpfulness": "0/0", "author": "Texas Droid"}]