[{"rating": 1.0, "review": "Update - I've lost the remote, so now it is a brick - totally useless, so I wasted my money on it.  I can't use any app or anything to reset it so I can use it anywhere.  I wouldn't recommend getting it to anyone - now maybe something improved since the original review, but I will never know without spending extra money for another remote.Bottom line - This is a buggy beta device, wait for a few months to see if they fix the problems, then reconsider.TL;DR - If things are just right and for certain things it seems to just work, but there are enough things broken, not-yet-implemented, or rough that you are likely to encounter and get frustrated by.Update - TL;DR the second try was as bad if not worse than the first.I got an email from Amazon saying to try customer support.  And it got worse.  When I plugged it in, it wanted me to adjust/confirm the video settings, which I did, but then for some reason the Vevo app started immediately.  It might be because the remote has a \"repeat\" if you hold the button down for more than the shortest tap (since it wouldn't go past the screen until I hit OK), but in any case I got blasted again with sound with a video starting and had to pull it out of the port.  I don't want anything to ever autoplay at startup, and if it asks me to input something, it should ignore a continued press or a repeat.  A remote control is not a keyboard!  A select key shouldn't be a touchy \"enter\" key that quickly starts repeating.  And Apps shouldn't have a stupid intro animation with sound - none of my tablet or computer apps do, at worst they just have a simple splash screen if startup takes a while.I did find the \"parental control\" that allows me not to have to type my PIN in for everything, but still many things.  The lack of 5GHz is probably because it is using EAP authentication, so it just acts as if there is no 5GHz since it doesn't see the 2.4GHz networks either.  The network isn't the best for such things, so maybe that is why it is slow (think latency, not throughput), but I can't connect to the better networks so can't tell.More stupidity - I used the \"contact customer service\" menu entry on the fire TV, and Amazon called me.  But it was NOT Fire TV support, but Kindle support, so I had to spend 5 minutes describing something, then get transferred and explain it again.  The rep had no answer but was going to \"escalate\".  That seems to be the most common answer.  At least it didn't complain about my power supply this time - I don't know why not.My Kindle Fire HDX works fine with the networks and such, and it would be nice if it could just detect and copy the setup and \"just work\".  Instead it is just frustrating.  The remote is too sensitive, or the menus are badly setup, or something, so navigation is difficult.  Oh, and now you can add voice for an upcharge - or use \"the app\", but if it can't see wifi, I don't know how it would talk with the app.Original follows:It complains at startup (and hangs there until you press the remote) if you don't use the Amazon wall-wart that came with it (instead of say, my Photive or Anker 2.1A that has no trouble supplying 2x the current).  It is painful to setup wifi.  It won't find half the networks, or maybe just doesn't support WPA.  Then it has trouble getting through to the network (maybe because the more open ones are firewalled).  It doesn't seem to support 5GHz Wifi, but that might be the WPA security.First thing, it connects and downloads an update and forgets the Wifi pairing so I have to go through that again.  (Why not let me use a USB or bluetooth keyboard?).  If it won't connect it asks again for the password so I have to go through the stupid remote thing again.  Then it sits there for a long while checking for updates.  I mean Amazon could have released another update in the 5 minutes since it did so last.Then after asking about my account it blasts a very loud (I had to pull the stick out to stop it) annoying intro animation.  I'm quite sure someone thinks it is cute, but I thought it was horrible and I'm at work.  No warning, just blast.Ok, then it asks about parental controls.  I NEVER want to do any purchases without the PIN, so I set one.  Then it spins for about a minute \"checking network speed\".  Ok, I find a FREE prime video on my watchlist to check it out.  It asks for my PIN!  No!  I don't want to have to type in my PIN for every FREE video.  It didn't ask me my PIN for the apps!  Ugh!It is out now, but it isn't ready for prime-time.  Maybe they can fix the software.After the phone, they should know better than to use their customers as beta-testers.  I wouldn't have minded this if it was a beta, but this is supposed to be a released, finished product.", "verified": true, "helpfulness": "9/12", "author": "tz"}, {"rating": 5.0, "review": "We bought a Chromecast last year, but decided to get this since we have a Prime Subscription.  This thing beats the Chromecast in every way - Prime access, dual-band WiFi, remote control, downloadable apps, etc...  My android phone even recognizes it as a Chromecast device.  We got it cheap from Best Buy during Black Friday, and it was a great deal.  Thinking of getting another one, or maybe a Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Michael Alexander"}, {"rating": 5.0, "review": "Works like a champ. Android app works great too!", "verified": true, "helpfulness": "0/0", "author": "Sean Quinn McClellan"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "joseph reynolds"}, {"rating": 4.0, "review": "This is a good streaming device for the price you pay. Here are some observations (Likes and Dislikes):1. The specs on the device is amazing.  It is fast and with a good amount memory and storage. It has a straight forward setup and moving around is pretty fast.2. There aren't much free stuff online.  You would need to subscribe to Prime or have individual subscriptions to other providers to get content.  Since I already have a few connected devices this was just a toy to have for the price.3. The interface is user friendly.  However, it feels like Amazon wants you to buy everything.  There is no way to know if something is free or the cost.  You will have to go couple screen deep to find out that you didn't want to pay for it.  Amazon, please modify the images to include the cost.4. I am not fond of the Fire Stick design.  The USB power input is on the side.  Which means you can't use the HDMI next to it. Before you buy this device, please make sure you have room.  I could barely squeeze it in :(.  The HDMI extender cable can help you but then it is short and will dangle around and look ugly...Not ideal.5. The Remote is pretty simple and does what it is meant to. What we need is a keyboard.  Searching for content using the remote is a chore.  Wish Amazon comes up with a remote with keyboard feature. There isn't any external USB input that you can use for a USB keyboard either.6. Content delivery is pretty fast and I haven't experienced any lags.  However, Fire Stick can only use WI-FI.  So, you will have to make sure that your router is close by and have good reception so that you get good streams.7. Amazon's Fire TV Remote app is a companion to your device.  Please download it and it will save you time.  It does have the keyboard feature that may come in handy.  Please note that the navigation is not intuitive...You will be moving around all over the place.  It does come with a voice feature to search...didn't work for me very well though.8. For those who have kids and want to set up parental control, Fire Stick comes with it.  It is a basic 5 digit code that you can set up.9. Last but not least, I wish the it had a built-in browser app for web surfing.Overall, for the price you pay, it is a good device to have.  If you are tech savvy, you can go about adding other streaming and productivity apps but I won't bore you with those :).  Good luck with yours..", "verified": true, "helpfulness": "0/0", "author": "Shafiq Islam"}, {"rating": 5.0, "review": "Works for me!  I have a guest/sewing room in my home that has no cable hook-up, but wanted streaming content from Amazon, Netflix, Hulu etc, so I purchased a reasonably priced flat screen TV with inputs on the back and inserted the Fire TV Stick. In no time at all I was streaming movies, TV shows, and spending more time in my sewing room than ever before because I WAS CONNECTED!!! Love this little stick!", "verified": true, "helpfulness": "0/0", "author": "Pamela J. Nesler"}, {"rating": 3.0, "review": "So I was really excited that I got one of these during the $19 sale and it arrived today. My first impression out of the box was great, just what I've come to expect from Amazon, minimal packaging and quickly opened. I plugged the stick into my TV and then into the USB port of my TV where I encountered my first disappointment, a warning that I needed to use the wall power adapter for the best performance. Back to the box and I plugged the stick in to the wall (not needed with my Chromecast). Then I needed to connect to my network. That took two tries because I use a random security key that I have to enter using the remote on a non-QWERTY keyboard since the phone app with a keyboard doesn't work until you're on the network. Once I did that I had to sit through a tutorial video that I had no way to skip.Now, once the device is set up, I have zero complaints. It's fast, easy to use and the keyboard makes logging in to the other apps a breeze. I also like that ordering one from your account auto links the two so I don't have to log in when it arrives. All in all I think it's a solid product and it will compliment my viewing, if only because Amazon doesn't let you Chromecast from their video app.", "verified": true, "helpfulness": "0/0", "author": "T. Webb"}, {"rating": 5.0, "review": "Fantastic now. If you were having trouble with Netflix buzzing and slowing down I managed an easy fix. One, I plugged it into a more reliable power source- no extension cord, but a power strip. Additionally, my TV is HD but only 720p, so I set the fire tv stick to 720 60hz instead of auto. When I first got the Fire TV stick, I tried to power it via the USB in the back of my TV. It does not like this, and it would not start up consistently. It needs one reliable power source and use the adapter included. No more lag or annoying buzzing! Hope this helps some people.That being said, it is the perfect media streaming stick. Great for Netflix, Amazon Instant Video, and Amazon Music. Over the years I have been looking for the perfect Netflix \"box\". I have used a blue-ray player, wii, Wii-U, xbox 360, and the Fire TV Stick is my current favorite. The best feature is that it is designed to always be on, no start up loading, so you get to everything quicker.Remote is tiny but functional. If you're like me and have a kindle fire, you can pause and fling stuff to your TV, which is cool. I highly recommend picking one up.", "verified": true, "helpfulness": "0/0", "author": "AcidBot"}, {"rating": 5.0, "review": "Much better than expected", "verified": true, "helpfulness": "0/0", "author": "Anthony B."}, {"rating": 3.0, "review": "Good for apps or music but unless you have Amazon prime movies and shows cost a lot", "verified": true, "helpfulness": "0/0", "author": "phillip bryant"}]