[{"rating": 5.0, "review": "It is wonderful!", "verified": true, "helpfulness": "0/0", "author": "Patricia R. Podach"}, {"rating": 1.0, "review": "It worked great for a day. Now I can't do anything on it except for watch amazon prime. I spent hours tinkering with it and I contacted customer support. No help thus far. I'd give it 5 stars if my unit worked. I got one day out of it and it just quit downloading my apps. No Netflix, no YouTube, no nothing. I am very disappointed with this unit. If I get a replacement that works, I would give it a 5 star. Either these are crap units or I was just unlucky with mine. I'm not happy with this purchase.", "verified": true, "helpfulness": "1/1", "author": "kevin"}, {"rating": 2.0, "review": "Just not pleased with the Amazon prime. Also I would think if Amazon knew charter communication didn't participate in the app program they would tell people in charters area.", "verified": true, "helpfulness": "0/0", "author": "Dirk DeFord"}, {"rating": 5.0, "review": "best streaming device on its price range.", "verified": true, "helpfulness": "0/0", "author": "MrRhyne"}, {"rating": 2.0, "review": "Over it is an ok product. Do NOT buy if you want to watch Hulu Plus. It rarely works. I am disappointed that I bought two. I would not recommend buying the Fire Stick. It also randomly restarts on my fire stick", "verified": true, "helpfulness": "1/1", "author": "Darci Brush"}, {"rating": 4.0, "review": "Then it does what it's supposed to, & does it well.", "verified": true, "helpfulness": "0/0", "author": "Togafree"}, {"rating": 5.0, "review": "It's extremely easy to set up. We housesat for a friend and brought it with us, it worked wonderfully!", "verified": true, "helpfulness": "0/0", "author": "Stacy A. Rude"}, {"rating": 5.0, "review": "Good for what I needed.", "verified": true, "helpfulness": "0/0", "author": "Sue Long"}, {"rating": 1.0, "review": "Very bad", "verified": true, "helpfulness": "0/0", "author": "Hadi100"}, {"rating": 5.0, "review": "It's great. Love it.", "verified": true, "helpfulness": "0/0", "author": "John Gregory"}]