[{"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Kevin L. Conrad"}, {"rating": 3.0, "review": "Fire tv needs more free tv shows and more free movies", "verified": true, "helpfulness": "0/0", "author": "Eric Amato"}, {"rating": 4.0, "review": "The device is easy to install, even for a technophobe like me.  Once I figured out my Wifi password, I was in business. I do like the films and  series (e.g. \"Justify\") that are included with the Amazon Prime package.  A couple of cautionary notes:  not all movies in the Amazon library are \"free,\" only those categorized as part of the Amazon Prime package.  Other films, especially new releases will require a fee to watch.  New releases are more expensive than older films.  Secondly, if you want to play games you will need to purchase the game console.  The remote that comes with the Fire-Stick is great for surfing but not so good for playing games.", "verified": true, "helpfulness": "0/0", "author": "William D. Angel"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Ange"}, {"rating": 5.0, "review": "Love it .. Works perfectly for me and I can bring it everywhere", "verified": true, "helpfulness": "0/0", "author": "Kora"}, {"rating": 5.0, "review": "So far, so good! It is much easier to navigate around than the product we replaced.Note: If you have a smartphone, there is no need to get the voice remote for the unit.", "verified": true, "helpfulness": "0/0", "author": "Tim C"}, {"rating": 5.0, "review": "I love this unit, I have two of these, one in the family room, and the second in the master bedroom.", "verified": true, "helpfulness": "0/0", "author": "Michael W Pritchett"}, {"rating": 5.0, "review": "Nice", "verified": false, "helpfulness": "0/0", "author": "salvador"}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Jerome Overstreet Jr"}, {"rating": 3.0, "review": "Roku is better. The Fire TV Stick has to be in line of sight to the router and I can't load Netflix. Wish I would have bought another Roku.", "verified": true, "helpfulness": "0/0", "author": "Maxwell"}]