[{"rating": 5.0, "review": "My son loves it", "verified": true, "helpfulness": "0/0", "author": "TINA STOCKLEY"}, {"rating": 5.0, "review": "I'm close to canceling cable TV. I'm very disgusted with high priced garbage TV. Too expensive for what I'm being offered. Amazon Fire Stick is a much less expensive alternative to cable. I purchased an amazon flat screen antenna for the basic channels. I use the Amazon Fire Stick and subscribe to Sling TV which offers 21 channels of good live TV and subscribe to Netflix. Many other apps are available on the Amazon Fire Stick such as You Tube, Hulu, etc. This works for me. 😄", "verified": true, "helpfulness": "0/0", "author": "Stella C."}, {"rating": 5.0, "review": "Amazing...Fast, easy setup, user friendly.", "verified": true, "helpfulness": "0/0", "author": "Gerald Mitchell \"1951 Nash\""}, {"rating": 5.0, "review": "Plugged it in. Turned on the TV and select the input source. Entered Wi-Fi code and was up and running.", "verified": true, "helpfulness": "0/0", "author": "DustyIowan"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "vinakia morrison"}, {"rating": 5.0, "review": "Absolutely love it.  I followed the directions to install the stick and it downloaded within 2 minutes, unbelievable. Great watching the old shows from the 60's, 70's and 80's.", "verified": true, "helpfulness": "0/0", "author": "Debra M"}, {"rating": 5.0, "review": "It has everything I need on here and very easy to set up.", "verified": false, "helpfulness": "0/0", "author": "Delene Arnold"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Cameisha Green"}, {"rating": 5.0, "review": "I bought this to replace the Samsung smartTV blu-ray player that I had purchased to accompany my Samsung LED dumbTV. Needless to say, the Amazon Fire TV Stick is more responsive and faster than the blu-ray player that I was using before. I'd definitely recommend this product to a friend.", "verified": true, "helpfulness": "0/0", "author": "Cole"}, {"rating": 5.0, "review": "This thing is awesome! I bought it for my daughter's room so she could watch cartoons, but it never made it past my room. I was setting it up and it was super easy. The instructions were very simple and I also had an on screen guide. It is very easy to use and I have all the video and tv apps I use right at my fingertips. I watch this all the time instead of satellite tv. if it weren't for my husband (and football), I would cancel my satellite subscription. I am extremely happy with this purchase and plan on buying another one.", "verified": true, "helpfulness": "0/0", "author": "Amanda A"}]