[{"rating": 5.0, "review": "so easy to install and lots of fun with movies", "verified": true, "helpfulness": "0/0", "author": "phan tran"}, {"rating": 5.0, "review": "Love it!  I had been streaming Amazon through my Wii, but it was slow and picture quality was awful.  The HD through Fire TV is sooo much better.  Also get Netflix, Showtime, Hulu, etc. We have an Apple TV and this is surprisingly comparable for less than half the price.", "verified": true, "helpfulness": "0/0", "author": "J. Tucker"}, {"rating": 3.0, "review": "I bought this to replace the Chromecast in my master bedroom. My wifi signal is a little weak in the master bedroom (1-2 \"bars\" on my Android phone), but that was never an issue for the Chromecast. The Fire Stick, however, lost signal constantly (and before you ask, yes, I did use the included AC adapter as recommended by Amazon). I have since switched back to the Chromecast in the master bedroom, and plan on deploying the Fire Stick somewhere else in the house that is closer to the wireless router.Setting up apps like Netflix was slightly confusing at first. When you first plug in the Fire Stick, it almost appears as though Netflix and a few other apps are pre-installed. However, this is not the case. They are pre-loaded, I guess, but not pre-installed.I find navigation on the included remote a little tedious as well. The round circle (for up, down, left, right controls) at the top takes getting used to. I don't have fat fingers or anything, but I still often found myself accidentally hitting the middle \"enter\" button instead of the navigation controls.All in all, it's not a bad device. Definitely the best hardware specs for the current generation of \"stick\" devices. Once it gets HBO Go, I'll definitely consider using it as a main device again. But for me, the ease of use of the Chromecast and the fact that the Chromecast works well under less-than-ideal wifi conditions, makes me hesitant to \"stick\" with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Shane"}, {"rating": 5.0, "review": "Upon plugging the Fire Stick in, it was immediately clear that this is a far superior product to Chromecast, with extensive app support from the start.  And once you are able to instantly play videos with ASAP, it's really frustrating to go back to Netflix, which often takes 15 seconds or more to load.", "verified": true, "helpfulness": "0/0", "author": "Mitch \"Soli Deo gloria\""}, {"rating": 5.0, "review": "This is a great little device. It'll be even better once the ios app is released. It does everything we need. We used to access Netflix and Prime TV through our Wii, but the battery life of the wiimotes was terrible and we needed to reboot the wii every time we wanted to watch Netflix. We got this, plugged it in, downloaded the Netflix app and we're off and running. We've had only minor buffering issues, not enough to take a star. Overall, very pleased.", "verified": true, "helpfulness": "0/0", "author": "Deborah Estes"}, {"rating": 5.0, "review": "It just arrived, installation was easy can't wait to have time to explore the movies", "verified": true, "helpfulness": "0/0", "author": "Mary B"}, {"rating": 5.0, "review": "Finally I am able to stream Amazon Prime easily to my TV. Love it!", "verified": true, "helpfulness": "0/0", "author": "A. Brown"}, {"rating": 5.0, "review": "Much better than Google Chrome in my opinion and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Chris N."}, {"rating": 5.0, "review": "It is very comparable to the Roku 3 I have for less money and has more content delivered to the user than the chromecast. The only thing that really sets it a part from the others is the android remote app and being able to find content through voice search.", "verified": true, "helpfulness": "0/0", "author": "PWMac"}, {"rating": 5.0, "review": "So nice not to have to hook up the computer to the tv anymore in order to watch Amazon videos!  Remote works great.  Plus we can view our photos from our phones when using the cloud app.", "verified": true, "helpfulness": "0/0", "author": "Zoë \"Zfish\""}]