[{"rating": 3.0, "review": "It's no different then any other box you can buy!  If you have prime membership then you will get use our the music and food apps. Everything I wanted to watch cost money, yet I watched it free on my Neo box.", "verified": true, "helpfulness": "0/0", "author": "C.Evans"}, {"rating": 2.0, "review": "I am seriously considering going back to a Roku box. Just about every week or so I have to clear the data to be able to watch Netflix. I'm not very happy with this item. I got it on sale so I'm not out too much money.", "verified": true, "helpfulness": "0/0", "author": "Barbara J. Skiff \"kidzkornerdaycare\""}, {"rating": 5.0, "review": "I ordered this to replace my Google TV box which was difficult to use.Set up took 2 min & it's so user friendly.I plan on ordering for all my tv\"s.", "verified": true, "helpfulness": "0/0", "author": "Ana"}, {"rating": 2.0, "review": "I am not too happy with the fire stick.  A lot of the free movies and shows are something that I never heard of.  The old movies and TV shows that I like you still have to pay rent for.", "verified": true, "helpfulness": "0/0", "author": "Mary Johnson"}, {"rating": 5.0, "review": "A great addition to the digital viewing options. Coupled with my Prime subscription, there is no better product on the market. I had already purchased the Fire Tv system, and this equal to it.", "verified": true, "helpfulness": "0/0", "author": "Jim Curry"}, {"rating": 5.0, "review": "Love it!  Connecting the device was simple.  Plug the Stick into the HDMI port and the power adapter to a 110V outlet and it finds the media sites immediately.  I have an advantage that my network modem is three feet from the Stick, but there is no buffering even though my internet speed is only 5mbps.", "verified": true, "helpfulness": "0/0", "author": "Techie in Iowa"}, {"rating": 4.0, "review": "Works great. Home interface could be a bit cleaner, its a bit too cluttered and just needs getting use to navigating. Otherwise works great.", "verified": true, "helpfulness": "0/0", "author": "Teddyk"}, {"rating": 5.0, "review": "bought this for a second tv along with the hd fire box. This arrived first and in only 2 days. Works perfect with the sling tv. I did have an issue with it not working at first but it was because you have to realllly push that power cording into the stick. Once we did that, it worked flawlessly. I will say that this is great for a second tv or laptop, etc. However, I prefer the hd box in the living room because you can plug the internet cord into it and it is a lot faster. The box can handle more applications at once since the processor is twice the size of the one in the stick. Have not had any issues with stick though. have only had it a short amount of time though. This does not have the remote with voice control. However, once again, this works good and is an excellent choice if you want portability.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 2.0, "review": "I got this because of the special offer that prime members got when it was released. Honestly, I did not hook it up right away since I already have a smart tv in the living room and a roku in my bedroom. One day, I got curious while seeing the box again and set the stick up. Set up was pretty easy and UI seemed easy enough to navigate. However playing anything, that is a totally different situation. It constantly buffered and paused to reload the show that I was watching. It did not matter if it was Amazon or Netflix, any show would do the same thing several times during the viewing. I called support and the version I have on the stick is the most recent. I have the highest upload/download speed offered by my provider, so streaming on multiple devices at any time has never been an issue. I resorted to unplugging this, and going back to my smart tv and using Prime there. I figure after some more L and D on this device, the next generation could be better. But for now, I am good with what I already have.", "verified": true, "helpfulness": "0/0", "author": "whijapxican"}, {"rating": 5.0, "review": "Got the stick to turn my dumb tv into a smart tv. I love being able to stream my shows and movies on my big tv.", "verified": true, "helpfulness": "0/0", "author": "brock"}]