[{"rating": 5.0, "review": "Fire TV Stick is great!  I found it very easy to set up and easier to use.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Steve I."}, {"rating": 1.0, "review": "Beautiful design and concept.  Would not retain my wireless settings so essentially not able to use device.  Returned to Amazon for a refund.  Just bought a Roku which works great.", "verified": false, "helpfulness": "1/2", "author": "Better Life 2006"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Mrejmck"}, {"rating": 5.0, "review": "Easy to set up and everything I was expecting. Best Christmas present I got.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "BEST.  THING.  EVER.", "verified": true, "helpfulness": "0/0", "author": "Anthony P. Tenold \"ZeroT62\""}, {"rating": 5.0, "review": "Love my Fire TV Stick!!!", "verified": true, "helpfulness": "0/0", "author": "Angela LaPointe"}, {"rating": 5.0, "review": "It has met my highest expectations.  Easy to install and connect with media on line and on my computer.", "verified": true, "helpfulness": "0/0", "author": "Michael L Davis"}, {"rating": 3.0, "review": "It sometimes stop working or the picture becomes really small and goes into the right upper corner of the tv screen and we need to unplug it and start over.  We've had it since Christmas and that's happened like 5 times now and just yesterday it happened twice in the span of an hour.", "verified": true, "helpfulness": "1/1", "author": "Carla johnson"}, {"rating": 1.0, "review": "It has trouble staying connected to my wireless router.  I can stream Amazon Prime from my computer sitting right next to the Amazon Fire Stick and it works perfectly, but if I try streaming from the Fire Stick, it buffers every 30 seconds and the picture is extremely grainy.  Would not purchase again unless Amazon fixed the wireless signal and the picture quality.", "verified": true, "helpfulness": "1/1", "author": "Kelly F."}, {"rating": 3.0, "review": "Enjoy the interface. Ordered 2. One work work. Tried on 6 networks but wont connect. Need to send back. The one that works did well for a.few.weeks but now having lots of connection issues", "verified": true, "helpfulness": "1/1", "author": "Captain Struggle"}]