[{"rating": 5.0, "review": "Great!!! I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Cotto"}, {"rating": 5.0, "review": "I love this item...it is small enough and out of the way and we have never had an issue.", "verified": true, "helpfulness": "0/0", "author": "Rory"}, {"rating": 5.0, "review": "We just ordered this last month it was delivered just as promised and we have very good service from it no lag as other products have had in their reviews all I can say about it so far is it has worked even better than expected. I would recommend this to anyone wanting to stream to your tv", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "I love the fire stick.  before we got it, we went into prime video thru our WII which was messed up.  the fire stick is much more simple to use without all the in between  things we used to have to do.  We are watching more prime movies and videos now.  much more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "P. J. hugill"}, {"rating": 5.0, "review": "love it! and  it's simple to connect.  I just wish it came with a keyboard on back of remote for typing, guess I will just order one from amazon", "verified": true, "helpfulness": "1/1", "author": "janet Robison"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "mary"}, {"rating": 5.0, "review": "I didn't plan on getting one.  I figured I didn't need it.  I watch Netflix and HBOgo on my laptop.  Then, I got one for my birthday and I quickly went into a tv/movie coma for a few days!  The picture is crystal clear.  It's easy to use.  Awesome!", "verified": true, "helpfulness": "1/1", "author": "CC"}, {"rating": 4.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Valentin Vasilev"}, {"rating": 1.0, "review": "1st unit wouldn't stay connected to our wifi - had a new one sent and the second one wouldn't stay connected either ... Called for support and they were really nice but ultimately not helpful. Calling today to get a shipping label sent so we can have it sent back and get a credit hopefully. Maybe it was just us ( though I can't imagine how since we have other stuff - smart TV, phones and Tablet on our network ) but personally I wouldn't buy it.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "Met and exceeded expectations", "verified": true, "helpfulness": "0/0", "author": "cperry"}]