[{"rating": 4.0, "review": "Do you need cable to use the fire TV stick?", "verified": false, "helpfulness": "0/0", "author": "Diana Pantelos"}, {"rating": 3.0, "review": "Not what was expected, limited internet use, cant add foreign  chann", "verified": true, "helpfulness": "0/0", "author": "Yekaterina MIshina4388575229048868"}, {"rating": 5.0, "review": "See more get smoking hot movies and Television on all your devices...Small as a Thumb drive  with the power to deliver...Smoking Hot Fire Stick...Why pay the high price for a sling box? Don't order now..You won't believe it...Totally awesome...Another Amazon device..I can afford And can't live without.. Amazon does it again...", "verified": false, "helpfulness": "0/0", "author": "pamlovas"}, {"rating": 5.0, "review": "Absolutely love this!  I haven't watched cable since I got it!!", "verified": true, "helpfulness": "0/0", "author": "Stephania Williams"}, {"rating": 5.0, "review": "Excellent piece of equipment,  for streaming.", "verified": true, "helpfulness": "0/0", "author": "Winston Burnett"}, {"rating": 5.0, "review": "We love our Amazon Fire TV Sticks!  There are tons of apps, including Hulu Plus, Netflix, and lots of others.  Also, the variety of movies and televisions available on Prime is great.  There are lots of games and other things we haven't taken advantage of, but we definitely don't miss cable!", "verified": true, "helpfulness": "0/0", "author": "Megan Bohanan"}, {"rating": 2.0, "review": "It's not what I expected.", "verified": true, "helpfulness": "0/0", "author": "Mario Quintanilla"}, {"rating": 5.0, "review": "FANTASTIC PIECE OF EQUIPMENT. MAKES WATCHING TV GREAT.", "verified": true, "helpfulness": "0/0", "author": "RICHARD C. ESPINOZA"}, {"rating": 2.0, "review": "would be nice if it were a value, seems there isnt much included, most shows have to be paid for, cheaper to get hulu or netflix or both", "verified": true, "helpfulness": "0/1", "author": "Tim A. Alvesteffer"}, {"rating": 4.0, "review": "I have both the Fire TV and the Fire TV Stick.Take my advice...Spend a little more and get the regular Fire TV... You will be much happier with it.Fire TV Stick requires power source from either the TV's USB port or with the included AC adapter.Some TVs do not put out enough continuous juice on their USB ports to power the stick.The stick tends to buffer more often.Amazon did a great job with Fire TV (and the stick as well). Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Vazz44"}]