[{"rating": 4.0, "review": "Now that is is working it is fine so far.  I had to upgrade my modem and router costing me $140.  When I first installed it, it stopped in the first part of the movie telling me my speed was not capable of running.  I did not notice this when I read the reviews.  We shall see now if it keeps working.  So far so good.", "verified": false, "helpfulness": "0/0", "author": "Lynda Johnson"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "robert c"}, {"rating": 4.0, "review": "This device beats the Google Chromecast by a nose. The Amazon Fire Stick just feels a little faster. I like how easy it is to play Indie games (some games Amazon Fire Game Controller is needed). The interface is cool, very easy to navigate. Enable the Screen Mirroring on the AFS and on your smartphone to view your Pictures or home videos. On the flip side, when streaming, the content is slightly too bright and video might be a little pixelated at times. Just FYI, you do have to input your name and password for each service you use like Netflix and Pandora, just once. Over all I'm satisfied. Those few extra bucks are worth it if you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "David Hernandez"}, {"rating": 5.0, "review": "GREAT ITEM, WORKS AS DESCRIBED, VERY FAST DELIVERY.", "verified": true, "helpfulness": "0/0", "author": "Ted"}, {"rating": 5.0, "review": "Easy to install- easy to use- great product, I was a previous chromecast user-- this is SO much better!", "verified": true, "helpfulness": "0/0", "author": "bobby"}, {"rating": 5.0, "review": "I love my Fire TV Stick. I've been able to catch up on shows I didn't get to watch and I love that I can remove it and put on another TV,", "verified": true, "helpfulness": "0/0", "author": "Faye C"}, {"rating": 4.0, "review": "Easy to install and works freat.", "verified": true, "helpfulness": "0/0", "author": "Bill Stanfield"}, {"rating": 1.0, "review": "It never works.  Always says network connection unavailable, but then when I run my prime though my DVD player, there is always a connection available.  It would be easier to use then going through the dvd player every time if it actually worked, but unfortunately, we haven't had any success since buying it.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 4.0, "review": "Easy to set up.  Works each time - hassle free.", "verified": true, "helpfulness": "0/0", "author": "E Kowalski"}, {"rating": 5.0, "review": "Works as advertized. Doesn't need the strongest wi-fi signal to function anywhere in the house.  Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Mark Bacon"}]