[{"rating": 4.0, "review": "It's taking binge watching to a new level!", "verified": true, "helpfulness": "0/0", "author": "Rex"}, {"rating": 5.0, "review": "its wonderful!! Bettet than I thought .. UPGRADE TO PRIME. Its,worth it!!", "verified": true, "helpfulness": "0/0", "author": "Dorothy Dunleavey"}, {"rating": 5.0, "review": "I love it!! Best purchase ever made", "verified": true, "helpfulness": "0/0", "author": "Kameeshia Gray"}, {"rating": 1.0, "review": "I bought the Fire Stock this past week on sale for five dollars off - $34. My package containing the fire stick was two days late, which already put me in a mood, but I quickly turned my frown upside down when fedex finally dropped my fire stick off this afternoon. Downloaded Netflix, woo, yay, this is fun. Okay, what now... Hbogo, of course. Okay... Where is the charter login? Nope, don't see it... Okay, where is the xfinity log in, then to sign in my boyfriends account. Nothing. Google the issue and imagine my surprise when I have read several reviews and specs of this fire TV, that this stick naturally does not work with charter OR Comcast xfinity. Okay, not a big deal. I have my iPad, I can just keep do what I'm doing with plugging my iPad into my tv to stream... Okay. Showtime! Yay! They have xfinity. Okay, go activate that on my iPad. Showtime does not accept fire stick TV. At this point I have little hope my xfinity or charter is gonna work with anything else. If I had known this previously, I would've gone with chrome cast. If you're a Comcast or Charter user and you wanna use this app for anything other than Netflix and Hulu, you mind as well look elsewhere.", "verified": true, "helpfulness": "1/1", "author": "AB"}, {"rating": 5.0, "review": "It was so easy to set up and it works great!", "verified": true, "helpfulness": "0/0", "author": "Betty Boop \"Melody Skurdahl\""}, {"rating": 5.0, "review": "Its great I can catch up on all my programs and watch great movies, there's a variety of choices; very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Redfeather"}, {"rating": 4.0, "review": "Works nice", "verified": true, "helpfulness": "0/0", "author": "james myers"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Brenda Campbell"}, {"rating": 5.0, "review": "Bought as a gift for my mother in law. She is on a fixed income and only has the internet. This allows her to access my amazon video library, and netflix accounts, and many more progams. She has nothing but love for her Fire stick...", "verified": true, "helpfulness": "0/0", "author": "SciFiChikie"}, {"rating": 5.0, "review": "works perfect, few minors details with some apps", "verified": true, "helpfulness": "0/0", "author": "Jose Moreno"}]