[{"rating": 5.0, "review": "Works great and easy to set up !", "verified": true, "helpfulness": "0/0", "author": "Rob Hart"}, {"rating": 5.0, "review": "It's been the best for the family", "verified": true, "helpfulness": "0/0", "author": "Roland Prejean"}, {"rating": 5.0, "review": "Love the selection of movies...Very easy to set up..", "verified": false, "helpfulness": "0/0", "author": "THE MOD MECHANIC"}, {"rating": 5.0, "review": "I'm actually in love with this thing. I just bought a 125\" projector screen and an Epson projector. The Fire Stick works with the projector seamlessly, and it's better than going to the movies. It's fast, so easy to use, and I love that it's not a giant console to carry around. The only issue with it is that I'm mad at myself for not getting one sooner!", "verified": true, "helpfulness": "0/0", "author": "Marjorie Gelso"}, {"rating": 5.0, "review": "Works great! I read a lot of people griping unnecessarily about the stick freezing or not working. Yeah, that happened to me too, on the third day. Know what I had to do? I had to walk all the way over to the TV and unplug the Stick then count to twenty and plug it back in. Sort of like a re-boot, you know? And then it happened. It worked again.People, just cuz you don't realize that a simple unplug and re-plug will fix the problem nine out of ten times, and you're too lazy to think or (god forbid) to actually call and ask customer support, don't blame the Stick. Your inability to use that gray sludge between your ears is YOUR problem, not Fire TV Stick's.The Stick works wonderfully, just as described. I couldn't be happier. Now if I can just get up the courage to cancel that damned cable connection!", "verified": true, "helpfulness": "0/0", "author": "Linda R"}, {"rating": 5.0, "review": "Fast, easy set up right out of the box. We were watching our Netflix and Amazon Prime videos in less than 20 min. We already had home Wi-Fi access, Netflix and Amazon Prime accounts, so all we had to do was login.  (Previously we accessed Netflix through our BluRay player, but it was slow and took several steps to connect.) The Firestick  remote is so easy to use. Our family is VERY pleased.  I highly recommend this device!", "verified": true, "helpfulness": "0/0", "author": "Packerfan1960"}, {"rating": 5.0, "review": "I have 2 Fire TV sticks and we love them. One word PRICELESS. The best purchase ever. Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Maritza Perez"}, {"rating": 4.0, "review": "It is so much easier to use than plugging in my computer. only thing is it didn't wanna stay connected to my Wi-Fi so when I'm searching it keeps cutting out.", "verified": true, "helpfulness": "0/0", "author": "m.cogis"}, {"rating": 5.0, "review": "Bought this for my wife and installed it on a TV I mounted in our florida room. Was very easy to configure and setup and she loves watching it while using our elliptical. Also configured it to work with our Slingbox so it's even better, she can watch anything she wants or listen to Amazon music. Worth every penny", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "great compact product!", "verified": true, "helpfulness": "0/0", "author": "Ellen J. Siddiqui \"kindle lover\""}]