[{"rating": 4.0, "review": "It's a stick! Simple to set up, love the android remote app with voice recognition.  Wish I didn't have to pay per episode of Madmen and Gotham.  Would recommend to others.", "verified": true, "helpfulness": "0/1", "author": "Raymond Dutelle Jr"}, {"rating": 5.0, "review": "it really good price for video streaming", "verified": true, "helpfulness": "0/0", "author": "RIK"}, {"rating": 5.0, "review": "Great and at a great price.", "verified": true, "helpfulness": "0/0", "author": "Robert W. Lasalle Jr."}, {"rating": 3.0, "review": "The lesson I need to learn is that you get what you pay for.  $20 too good to be true. Problem 1, Amazon prime is next to worthless for video or music.  Free apps like YouTube and Pandora are better.  Tv? 3 month old cbs news listed as recent? Come on Amazon.  Problem 2., network speed.  Fire will choke your Comcast connection,I guarantee it.  Problem 3,  tv what tv?  Problem 4, internet connections really don't exist.  Don't give up on cable or satellite tv yet.", "verified": true, "helpfulness": "0/3", "author": "Scott A. Krohn"}, {"rating": 4.0, "review": "Received the fire stick last sunday. (quite surprised by postal delivery on a Sunday).  plug in was very simple and it was already registered since I am a prime member.Very very simple to use. even downloaded the Fire TV app on my phone to test out the voice commands.  Google chromecast has been banished to one of the bedroom tv's", "verified": true, "helpfulness": "1/1", "author": "Larry Wiggins"}, {"rating": 2.0, "review": "I bought this on the prime sale for $20 the stick will not stay connected to the wireless network and has to be power cycled and the wireless reset daily to continue working.", "verified": true, "helpfulness": "4/4", "author": "Roger Herling"}, {"rating": 5.0, "review": "More than I expected", "verified": true, "helpfulness": "0/0", "author": "Mahmoud Nassan Al makhzoom"}, {"rating": 3.0, "review": "Having problems with non amazon apps like pandora", "verified": true, "helpfulness": "0/0", "author": "Ingrid"}, {"rating": 5.0, "review": "Wow LOVE IT easy to install and it's fast!!! love the phone app!!", "verified": true, "helpfulness": "0/0", "author": "Isaac.F"}, {"rating": 5.0, "review": "Great value for prime members, easy set up. Love this for the second TV in the house. All of our content in a compact stick, easy to access.", "verified": true, "helpfulness": "0/0", "author": "Rebekah Bailey"}]