[{"rating": 5.0, "review": "So easy to set up. Needed to adjust the display size, but even that was easy. I downloaded the remote app to my phone - also easy to use. I think I'm going to love this thing!", "verified": true, "helpfulness": "0/0", "author": "B. Hineline \"Big B\""}, {"rating": 5.0, "review": "Amazing device. So easy to use and to install. We love it!!", "verified": true, "helpfulness": "0/0", "author": "Shannon Bunkers"}, {"rating": 5.0, "review": "This works well and connects easily to Amazon Prime videos.  It works good and is easier to use than other similar products.  I had an older TV and wanted smart functions.  It's kind of thick so it may have difficulty fitting into some HDMI ports.  I had to pick another port as it didn't fit into the side port due to the TV body being in the way.", "verified": true, "helpfulness": "0/0", "author": "K-9"}, {"rating": 5.0, "review": "Compared to the Chromecast, it definitely wins. With a Chromecast, you have to use apps to access it. That is a pain.  Apps fail and have to be closed and opened a million times. The Fire TV Stick allows you to access to a broad assortment of movies and tv shows. It has a remote when is God sent. Lol. It is so easy to control the Fire Stick with. The Fire TV Stick is reliable where the Chromecast is not. It would take like fifteen minutes to get the Chromecast to work and then it would pause a million times to load. With the Fire Stick, it is easy, quick, and reliable. It is finally nice to be able to watch my Amazon Prime Instant Video. The Chromecast wasn't \"compatible\" with it. The Fire TV Stick really offers so much more than you can get from the Chromecast. Like games, music, and more. Love it.", "verified": true, "helpfulness": "0/1", "author": "Sunshine"}, {"rating": 1.0, "review": "Lame, pointless, frustrating, poorly designed.  I mean, it's supposed to be streamlined & simple - it's anything but.  The many hangups include needing the 'fire stick' to have external USB power - from an outlet!  a port isn't enough.  NO VOLUME CONTROL ON THE REMOTE.. having to sit through an idiotic CARTOON, which is mandatory, to baby-step you through the content spoonfeeding process.  In the end?  The same pathetic, overpriced, lame content selection you ALREADY HAVE THROUGH YOUR GDMF WEB BROWSER!  WHY???This piece of useless nonsense is getting stuffed right back in the box it came in & shipped back to BS HQ (Amazon) for a MFing REFUND.", "verified": true, "helpfulness": "2/9", "author": "Setyourpenname"}, {"rating": 1.0, "review": "I'm not able to get the Fire TV stick running from Germany (\"not able to connect to our servers\").My Amazon Fire TV, purchased in Germany is working fine.Are there any restrictions to use the Fire TV stick outside the USA?", "verified": true, "helpfulness": "1/2", "author": "Holger Boerchers"}, {"rating": 5.0, "review": "came with a nice HDMI extender.wished it was more intuitive on how to add apps", "verified": true, "helpfulness": "0/0", "author": "J. Chang"}, {"rating": 1.0, "review": "One word - No Audio outputHow the hell can I connect this to an external sound device", "verified": true, "helpfulness": "0/1", "author": "Kimberly Bean"}, {"rating": 5.0, "review": "So far, I love it! For anyone with Amazon Prime, get your full monies worth with this addition. I was streaming video previously off of my iPad to the TV and there would be repeated syncing issues with the video and sound. So far this is far superior and have only watched a few hours to date, but not a problem robe found. Setup was easy and fast. Surprised that it needed to be plugged into a power source (thought it would draw directly from the TV?) but it all worked out to be a fast and easy install. Setup was easy as it detected my wifi and my Amazon account automatically. The kids selection on Prime are pretty awesome...plenty of PBSkids, Nick jr episodes that don't air as much anymore...my kids are thrilled. All in all, very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Marilyn \"DivaMomma\""}, {"rating": 2.0, "review": "I got my Fire TV Stick today, plugged it in, set it up, and went to watch one of my favorite movies (in under 5 minutes). However, there appears to be some sort of interference between the Fire TV Stick and my SONOS system. Once the Fire TV Stick is selected through my TV input, no audio will play through the SONOS Playbar (No matter which input is selected). After hours of troubleshooting, I found the only way to circumvent this frustrating situation was to turn off the TV and unplug both, the Fire TV Stick and the SONOS Playbar power cord. Then, plug in the Playbar and turn the TV on but leave the Fire TV Stick unplugged. Unfortunately, I could not find a solution for me to use the Fire TV Stick and my SONOS system at the same time. Sorry Amazon, sound quality outweighs convenience in my book so it is back to my HTPC for all my digital entertainment needs.As for the Fire TV Stick itself, it was a breeze to setup right out of the box and I really liked the menu structure and feel. I am not going to return the Fire TV Stick because of my issue, I am just going to give it to someone who doesn't have a SONOS theater system.", "verified": true, "helpfulness": "1/1", "author": "Evan"}]