[{"rating": 4.0, "review": "Am very pleased with the Amazon Fire Stick.  Tried the Roku, extremely difficult to get set up.", "verified": true, "helpfulness": "0/0", "author": "Skequen"}, {"rating": 5.0, "review": "Was very easy to set up and easy to use. The power cable is a little short, but it works just fine.", "verified": true, "helpfulness": "0/0", "author": "Rosie"}, {"rating": 4.0, "review": "Very inexpensive way to get Netflix, Amazon Prime and Plex all on one box.  With wireless being the only network option, I have seen some latency issues with all three services, but nothing bad enough to warrant returning it.  With Plex, I have actually had shows stop and go back the show menu.  In hindsight, I would probably spend the extra money for the Fire TV as it has an Ethernet port, more RAM and a faster processor.", "verified": true, "helpfulness": "0/0", "author": "Rob & Jenni Davis"}, {"rating": 1.0, "review": "I am very disappointed in the wireless performance. The unit will not allow HD playback without losing connection, however a Roku XD plugged into the same port on the same TV in the same exact spot  works flawlessly. I bought the Firestick to replace an older BluRay because it was cheaper than adding another Roku. Got what I paid for. After a week of frustration went and purchased another Roku.", "verified": true, "helpfulness": "1/1", "author": "Patrick Shaw"}, {"rating": 5.0, "review": "EXCELLENT", "verified": true, "helpfulness": "0/0", "author": "C. Bartholomew"}, {"rating": 4.0, "review": "Was very happy with it. Very easy to install", "verified": true, "helpfulness": "0/0", "author": "Jana bryant"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Jae"}, {"rating": 5.0, "review": "Very happy with the quality", "verified": true, "helpfulness": "0/0", "author": "Jsilva"}, {"rating": 2.0, "review": "The unit I received seemed buggy from day one but I figured that I would just have to live with it since it was such a new product that the rough edges just hadn't been smoothed out yet.I only use it for an hour or two a couple of times a week so I fugured with such light use it would las t a while and I could just live with the occasional freeze-ups...well, those \"occasional freeze-ups\" have become more and more frequent and now, not quite a year later, the unit has pretty much dies on me. I will be very liberal and say that it only had about 120 hours of actual use on it before it died.", "verified": true, "helpfulness": "1/1", "author": "T. Moffitt"}, {"rating": 5.0, "review": "super easy to use and great picture.", "verified": true, "helpfulness": "0/0", "author": "michael  gunter"}]