[{"rating": 5.0, "review": "Great device.. I also have the fire phone so it syncs everything from my phone except the apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it... but I got it for the $28 sale going on initially.  Wish I got more for that price.  if I was going to spend $50 for a new one.. I would just consider the bigger Fire TV.. with the better remote.All in all... great product.  Just wish more apps worked with it.  Time will tell I guess.  I was hoping the Slingblade app would let my DISH programing come to the TV, but sadly DISH is not supported.  They want you to get a Joey I guess.", "verified": true, "helpfulness": "0/0", "author": "Neofactor"}, {"rating": 1.0, "review": "It simply just does not work. We have a fire phone and watch prime video on it and it works flawlessly so I thought we should get the fire stick so we can watch prime video on our tv, If you can even get it to stay connected to your wifi the video constantly has to load and apps just simply stop loading for no reason. prime works fine over our wifi on our tablets, pc, and fire phone but fire stick is just a constant struggle to make it do anything.", "verified": true, "helpfulness": "1/1", "author": "Wendy N. Wells"}, {"rating": 5.0, "review": "$20, can't beat that for promotional pricing.  It does what xbox one or chromecast also does.  Wifi is excellent on it and its very simple to connect.  I would buy it again for another room.", "verified": true, "helpfulness": "0/0", "author": "Blaze"}, {"rating": 4.0, "review": "worked fairly well. Had a little problem with it picking my router for wi fi. I had it plugged straight into the tv hmdi. it would not pick up the router. I went on line and ran a trouble shoot and noticed it said if I used the extension provided it would help. I did so and ti picked up the wi fi from my router. I had a little more of a problem in not understanding the shows I am permitted to view under the \"Prime\" offering. I think amazon could be a little more forceful in stating and posting clearly what can be viewed within the confines of the Prime offering.", "verified": true, "helpfulness": "0/0", "author": "William E Mayes"}, {"rating": 4.0, "review": "Love the interface.  Have 2 Chromecasts and would like to replace all Chromecasts with a Fire TV Stick. Enjoy having the remote to control rather than needing to use phone or iPad.  Ability to have Amazon Prime material in addition to Netflix is a great plus.One issue: Streaming seems to drop more frequently than with other uses.  Not sure if FireStick related (however, Chromecast and streaming on laptops and iPads drop less).", "verified": true, "helpfulness": "0/0", "author": "Dayna A."}, {"rating": 4.0, "review": "The Fire Stick is not as easy to set up as promoted.  We had to work with technical service in order to get it installed.  Once we got it working, it is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "anne"}, {"rating": 5.0, "review": "super value", "verified": true, "helpfulness": "0/0", "author": "C. Hayes \"retired\""}, {"rating": 5.0, "review": "Great device so far. Initial setup was a little long as it kept dropping the wifi connection. Wish the device had an integrated browser so that I could us it in hotel rooms when I travel. Most hotels require authentication through a web browser to access wifi services. Currently, the Amazon Fire Stick does not have this capability.", "verified": true, "helpfulness": "0/0", "author": "Phillip S."}, {"rating": 4.0, "review": "This thing is awesome. I LOVE the remote. It's RF so it doesn't require line of sight with the device which is very convenient. The UI is quite quick except for right after startup. The interface itself is very easy to see and understand. I really wish it didn't need the wall adapter as I already have enough stuff to plug in around the TV. I got it during the Prime member discount, not sure if I would have payed full price for it.", "verified": true, "helpfulness": "0/0", "author": "Brandon Hawkins"}]