[{"rating": 1.0, "review": "the accessibility to programs and movies is fantastic however the sound does not come through my surround it only comes from the television speaker it kind of sucks to watch a movie and knowing it's an 5.1 surround and all I get is sound from the small speakers in my television. I have one online I've asked people I've contacted cable company to find out is there anyway I can get it to run through my surround and doesn't seem like that's possible so anyway it is what it is maybe the next generation f havI'll fire stick will have that  capability......", "verified": true, "helpfulness": "0/0", "author": "R.J.Vance"}, {"rating": 5.0, "review": "Completely awesome.", "verified": true, "helpfulness": "0/0", "author": "Matt Lillig"}, {"rating": 5.0, "review": "Great tool!  Allows us to use computer monitors for streaming.  Great for the kids playroom too - very portable.", "verified": true, "helpfulness": "0/0", "author": "TeeCee \"TeeCee\""}, {"rating": 5.0, "review": "Took less than 5 minutes to install. \"Fired\" right up. Within 10 minutes, watching 1st movie. Love it!", "verified": true, "helpfulness": "0/0", "author": "Bob C"}, {"rating": 5.0, "review": "I love this! We have so many options for movies now. Really a quality product.", "verified": true, "helpfulness": "0/0", "author": "Rachel Mueller"}, {"rating": 4.0, "review": "Happy with this product , simple set up and simple to use..", "verified": true, "helpfulness": "0/0", "author": "bobby"}, {"rating": 4.0, "review": "A good product for me as a traveler. The one drawback is that it is hard to hook to hotel internet networks that require a web browser to sign in.", "verified": true, "helpfulness": "0/0", "author": "Author Don Massenzio \"Don Massenzio\""}, {"rating": 5.0, "review": "I like being able to watch my amazon watch list anywhere in my house. Great product!", "verified": true, "helpfulness": "0/0", "author": "Alison Schriver"}, {"rating": 5.0, "review": "Works as advertized.", "verified": true, "helpfulness": "0/0", "author": "John Edwards"}, {"rating": 5.0, "review": "Makes watching Amazon's Prime Movie's so much easier.", "verified": true, "helpfulness": "0/0", "author": "Lighthouse \"Thankful for miracles\""}]