[{"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/2", "author": "dionicio diaz"}, {"rating": 5.0, "review": "Very quick response time amazing for its size!", "verified": true, "helpfulness": "0/0", "author": "Walter M."}, {"rating": 5.0, "review": "GREAT item", "verified": true, "helpfulness": "0/0", "author": "Jorge Paredes"}, {"rating": 3.0, "review": "This firetv stick is good to use esp. when you have the option to sideload many great apk from other sources. The remote is small and light but it lack a keyboard.", "verified": true, "helpfulness": "0/1", "author": "Andrew"}, {"rating": 5.0, "review": "No review.", "verified": true, "helpfulness": "0/1", "author": "Michael J. Lynch"}, {"rating": 5.0, "review": "Love it!  Cancelled cable service (trying to cut down on expenses), and this is all we use now.  Great selection especially for kids.", "verified": true, "helpfulness": "0/0", "author": "JENGR \"JENGR\""}, {"rating": 5.0, "review": "Awesome !! Set up is so easy!! Everyone should have one of these", "verified": true, "helpfulness": "0/0", "author": "BRENDA IMHOFF"}, {"rating": 3.0, "review": "The downside is that unless you have amazon prime you wont be able to access a lot of the same programs that are available for free elsewhere. ok product  but not thrilled.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "In on word: Glitchy. Sometimes there's no sound. I have to go up a channel and come back to the HDMI channel for the Fire Stick for the sound to work again. The only electronic device I have a problem with lag is the Fire Stick. Often, when watching either Prime instant videos or Netflix, there's a lag that doesn't manifest on either my Android phone or Kindle Fire.", "verified": true, "helpfulness": "1/1", "author": "Bruno Castelhano"}, {"rating": 2.0, "review": "I have used a Roku2 for years. I don't watch much TV and have used it for Netflix and Amazon Prime and have had no problem. I recently decided to try SlingTV and got a promotional code for a free Fire TV stick, which I thought was a great deal as I had been wanting one, and had been torn between the Roku stick and this product. With that being said, I will never purchase Fire TV products over Roku again. It takes longer to buffer, and frequently has to be unplugged to be reset so it will pick up my wireless - a problem I've never had with any other device including my Roku. While the Fire Stick's interface does look more streamline, it's actually harder to use, and the tech savvy kids around here have a harder time using it. I thought maybe it was just getting use to the change, but I've been using this product for over a month now and still do not care for it much. If it weren't for the losing connection and having to be unplugged to work, I would probably give it 4 stars, as the rest, I feel, is just my preference.  I'm glad I got it for free, and in the future will stick to Roku products.", "verified": true, "helpfulness": "0/0", "author": "rnone"}]