[{"rating": 5.0, "review": "We have a Samsung Smart TV and I hated that every time I turned on the TV it would say \"Preparing the TV\" for several minutes before letting me get into Netflix or Hulu. The interface was also klunky toggling between all the streaming services. And the remote response was very slow. Enter the Amazon Fire TV stick. For $25 (we got it on Prime Day) it changed everything. It is so fast - very responsive to the remote. The remote is also Bluetooth so no trying to point it at the TV at the exact right angle. It has changed our viewing experience and made it much more pleasant for my husband who no longer has to listen to me complain about our TV.", "verified": true, "helpfulness": "0/0", "author": "photofan"}, {"rating": 4.0, "review": "Works good but a little quirky on the WiFi connection. Mine would not work at all when plugged directly into the HDMI port. But, it worked fine when I used the very short HDMI extension cable that was about 3 inches long???? I've got this, a Roku, and apple TV and for most people, I'd say they are mostly about the same. Each one seems to offer a channel or two that isn't available on the others...", "verified": true, "helpfulness": "0/0", "author": "Jimmy Singer"}, {"rating": 5.0, "review": "Wonderful product so glad we bought one", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Excellent quality and so easy to use! I have horrible wifi in my house and have never been able to get my blurays or other wifi enabled devices to stream without constantly pausing and taking forever to load. I was nervous this would have the same issue but I did not have this problem at all with the fire stick. This is an excellent product! I recommend it to anyone!", "verified": true, "helpfulness": "1/1", "author": "Giovanna"}, {"rating": 4.0, "review": "I am enjoying this, but I really wish it had the availability of the TWC app, which Roku has.  Does anyone know if this will be something that will be offered?", "verified": true, "helpfulness": "1/1", "author": "judy walker"}, {"rating": 5.0, "review": "Setup was super easy! I was watching movies in seconds. It s a great addition to my home theater! The one drawback is purchased content isn't clearly marked.", "verified": true, "helpfulness": "1/1", "author": "Collin"}, {"rating": 5.0, "review": "very quick and efficient product and delivery", "verified": true, "helpfulness": "0/0", "author": "Sherif Antoun"}, {"rating": 5.0, "review": "I had bought this on Prime Day. I use Netflix, Prime Video and my son loves playing games. I have slower internet than most, but I am able to stream Netflix and Prime Video Perfect. There are tons of apps to use.", "verified": true, "helpfulness": "1/1", "author": "fjre tv stick"}, {"rating": 1.0, "review": "Shows seem to load quicker than my Roku stick, but has constant problems with shows hanging and had to reboot.", "verified": true, "helpfulness": "0/0", "author": "J. Griffin"}, {"rating": 5.0, "review": "Got for my son's for Christmas.  They love it!", "verified": true, "helpfulness": "0/0", "author": "Jenifer Olson"}]