[{"rating": 5.0, "review": "I bought one when it first came out for $19, and it turned out great.  I love the interface, it's easy to get around.  The device is fast too.  I have started watching more streaming content from Amazon and Netflix.  I liked the device enough to buy another one on PRIME day for my bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "LJ"}, {"rating": 5.0, "review": "It's so small, I wasn't sure how well it would work.  To my surprise it works better than my full fledged MacBook.All you need is an HDMI input on your tv and a wireless internet connection and your older TV will be a full fledged smart TV.", "verified": true, "helpfulness": "0/0", "author": "Eric M"}, {"rating": 5.0, "review": "This thing is awesome! I have Netflix and Amazon Prime and with the stick I can watch almost 500,000 movies, shows, listen to music, etc.", "verified": true, "helpfulness": "0/0", "author": "LarryJ"}, {"rating": 4.0, "review": "convenient and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "Great way to navigate wifi for your TV", "verified": true, "helpfulness": "0/0", "author": "Nicestcars"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "dalewaynemilam"}, {"rating": 3.0, "review": "I was disappointed when either it doesn't have the ability or I cannot locate the ability to lock down ALL apps except one.  I only wanted this for Netflix for a child's room.  Also I didn't understand why the extra USB power is necessary, especially when I plug it into my TV and it states it will not work properly, yet it still works...Although the children can watch Netflix easily, unsure how the remote will hold up to abuse.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Get it.", "verified": true, "helpfulness": "0/0", "author": "Kyle"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Ashley Batstone"}, {"rating": 5.0, "review": "Did everything we needed.  Great for our extra room and kids love the cartoon series on it.", "verified": true, "helpfulness": "0/0", "author": "Heather Drao"}]