[{"rating": 5.0, "review": "Easy to use , fast, fun, have you watching you favorite show in minutes, we love it !", "verified": true, "helpfulness": "0/0", "author": "Gilda McCullough"}, {"rating": 5.0, "review": "We are happy with how easy it is to use. And the great selection of movies and shows.", "verified": true, "helpfulness": "0/0", "author": "Nan \"Nan\""}, {"rating": 3.0, "review": "this thing freezes several times in a day having me to have to turn it off and reset it several times in a day.  very inconvenient.  device heats up and there's no way to turn it off by remote.  i have to unplug it from the wall and back of tv.  very unhappy with the performance of the product.", "verified": true, "helpfulness": "1/1", "author": "matthew wooton"}, {"rating": 5.0, "review": "I am more than happy I purchased the Fire TV Stick! I have been comparing other products and Amazon has been the best choice for me!!", "verified": true, "helpfulness": "0/0", "author": "T. Walker"}, {"rating": 3.0, "review": "Lovely screens and menus. Remote can get a little sticky and you can't mirror your computer which is what I thought I'd be able to do. Overall good but I'm really not getting anything new other than a remote and prettier menus.", "verified": true, "helpfulness": "0/1", "author": "H4nnita"}, {"rating": 5.0, "review": "Awesome device & so sweet to cancel cable!", "verified": true, "helpfulness": "0/0", "author": "Rachael Wagner"}, {"rating": 1.0, "review": "BEWARE OF BEING BLACKMAILED BY AMAZON.  THEY ARE NOW SAYING I HAVENT PAID FOR THIS ITEM 14 MOMTHS AFTER I BOUGHT IT. THEY ARE THREATENING TO DISABLE IT. I PAID WITH A GIFT CARD AND HAVE NO RECEIPT. BEWARE BEWARE BEWARE", "verified": false, "helpfulness": "0/4", "author": "Christine Broderick"}, {"rating": 5.0, "review": "I like it and it takes the place of my Blue ray player and it is simple to hook up so I will tell my friends to get one", "verified": true, "helpfulness": "0/0", "author": "Anthony wynn"}, {"rating": 5.0, "review": "great item", "verified": true, "helpfulness": "0/0", "author": "mad jake"}, {"rating": 3.0, "review": "The device itself isn't too bad, though I would prefer a Ethernet connection versus WiFi.  The remote feels a little on the cheap side, and the fact that a separate power connector is a little off-putting.  I am not fanatical about the prime video service, though, as more and more of the content requires extra \"rental\" fees even though I pay for the prime service.", "verified": true, "helpfulness": "1/1", "author": "Arland M Smith"}]