[{"rating": 4.0, "review": "Good and cheap way to make any TV \"smart\", with the wealth of Amazon-branded and general apps available. Only real drawbacks are that it's only wireless, and you need ADB/Plex to push anything to it over the network. The first is fine considering the size, the latter can be fixed by having a PC/Mac/Whichever be able to read and write to it via the USB for media file transfers so you're not clogging the network bandwidth.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Loved it til we got smart tv. Works well and is easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "MBC"}, {"rating": 1.0, "review": "Your refusal to honor my prime membership agreement will result in my failure to renew it. Further i will avoid making purchases on amazon. Com to the best of my ability. DAMN YOU!", "verified": false, "helpfulness": "1/2", "author": "stephen b boucher"}, {"rating": 5.0, "review": "Being an older guy(67) this was a big leap for me! BUT, i had just about ALL the commercials memorized and realized THAT was my clue to buy this thing! And, i am SO glad i did...what a joy and so simple to install and use! Once i figured out the VERY FEW ins and outs of the thing - i cant wait to get back to it to ENJOY something else. When i watch regular TV now, the commercials are irritating & again, cant wait to get back to my stick...thank you so much for this pleasurable device!", "verified": true, "helpfulness": "0/0", "author": "JOHN B MCCOY"}, {"rating": 5.0, "review": "Surprise by all means as to how great this works. I am so glad I brought this", "verified": true, "helpfulness": "0/0", "author": "josie"}, {"rating": 2.0, "review": "The picture is bad, especially for Netflix.  I was hoping for HD quality.  It is better to hook up my computer and stream from there.", "verified": true, "helpfulness": "0/0", "author": "karen monte"}, {"rating": 3.0, "review": "It works but not as well as the google tv I have that you informed me you were stop supporting software for so I had to have the fire stick to keep watching your services.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Nice tool that I have used to start down the path of \"cutting the cord\". The only significant shortcoming I have observed is almost the complete lack of live TV. Therr are a few OTA stations that can be picked up via Sling and some of the other sunscription services, however not finding a good way to get NFL games or CNBC or live national or local news is a definite constraint.", "verified": true, "helpfulness": "0/0", "author": "S. Margolis \"Vidiot\""}, {"rating": 1.0, "review": "If I have purchased this in US and travel around the world it should be my Pal everywhere I go , but recently I travelled and could not use it in a region which kept on telling me I cant use in this region and stuff ....... its really bad", "verified": true, "helpfulness": "0/0", "author": "Syed Tehren Shah"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}]