[{"rating": 5.0, "review": "I gave a couple perfectly serviceable HDTVs that are only a couple years old. For the last several years, I have been using my PS3 to stream Amazon and Netflix content. About three years ago I had to send the thing in for service, apparently due to overheating. So I got this thing when it was $20 to reduce up time on the PS3. That is what I have to compare this to.The menu is easy to navigate. It is fast and responsive. Load times for apps and videos are faster all around. Netflix will start streaming really quickly with a lower quality stream, but it takes less than a minute for it to catch up and start streaming HD. It feels like I have a smart TV, and I only spent $20. The only thing I miss is control with my Logitech, but at the price that issue is no big deal.I would have kept using the PS3 if it were not for the sale price. $40 seems too much for something I truthfully already had. But at $20, jump on it and enjoy the device.", "verified": true, "helpfulness": "0/0", "author": "Christopher R"}, {"rating": 5.0, "review": "Great little device! Just received my preorder and am really impressed. I put it on my TV which is farthest from my WiFi and it is working great. I had a problem with the signal as the TV is in a cabinet but when I used the extender it picked up the WiFi right away. It plays seamlessly, no buffering, and the picture is great. I have had over 8 Rokus  and this stick is such an amazing bargain. Works just as well for a fraction of the cost. Can't wait to try it on the road in hotels. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Robin"}, {"rating": 2.0, "review": "Lot's to be desired with regards to App. Just another way to promote Amazon products without offering anything new to it's customers.", "verified": true, "helpfulness": "0/1", "author": "Sanjeev Sharma"}, {"rating": 4.0, "review": "So far, it is working great. My biggest problem is that the games are not free. In the description, it is implied that the games are included for free. My kids were looking forward to playing many games, but cannot. Also many of the games require the game remote. So the 200 games isn't really 200 games. Otherwise I'm pleased.", "verified": true, "helpfulness": "0/1", "author": "Amy Adair"}, {"rating": 5.0, "review": "Excellent device.  The only regret is it won't play personal photos, videos, music from server on same network without moving media to cloud.", "verified": true, "helpfulness": "0/0", "author": "Richard C."}, {"rating": 3.0, "review": "I snatched one of these when they first went on sale at half-price for Prime members. After receiving it, I was disappointed that it needed a power outlet, since I already have so many things plugged in behind my television. I got it connected and found it to be a snappy device, but quickly realized I preferred the simplicity of ChromeCast to this device. One thing that worried me was the feature that tries to figure out what you want to watch so it can download and have things ready without buffering. Since my internet has a data cap each month, I was afraid of how much background data this thing was going to use. I decided to return it, but Amazon wanted $7 just to send it back. Considering I got it for $19 with free shipping, I figure I will just give it away before I do that.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Brian\""}, {"rating": 5.0, "review": "Seriously impressed with the Fire TV Stick so far!  Set up was easy and I was even able to hook it up through my Yamaha receiver's HDMI port to run the sound through my home system (with ARC hdmi to the TV).  I got this mainly because my (slightly) older Samsung HDTV doesn't support Amazon Prime Instant video.  I found a couple of pretty good apps including FilmMovement which plays great indie films in many languages for free (with ads, of course).  The usual familiar apps are also offered (Pandora, Youtube,Hulu+, etc).  If I were to offer any suggestion for improving this device would be to make the power cord somewhat longer to support having to run from the TV to a power outlet.  I'll update this review if any problems should present themselves :)", "verified": true, "helpfulness": "0/0", "author": "R. Stott"}, {"rating": 5.0, "review": "received this today and hooked it up easily... started watching a show from my watch list immediately.  I am sure I have a lot more to learn, but so far this beats the blu ray player we had been using.  I have to \"train\" my husband how to use it since he loves to watch crappy movies he finds on Amazon Prime.  I got in on the $19 sale and I may be wishing I had purchased more than one!  I have a Roku 3 as well in our bedroom, but I am the only one who knows how to use it.Glad I made the decision to jump in and buy it!", "verified": true, "helpfulness": "0/0", "author": "Lynnea"}, {"rating": 5.0, "review": "Got the Amazon Fire Stick after work today....watching Amazon Prime Videos within a half hour....very very easy to set up and start enjoying", "verified": true, "helpfulness": "0/0", "author": "Maxie \"MTV\""}, {"rating": 5.0, "review": "Easy to setup. Works faster than I expected. Perfect if you have Amazon Prime. If you want to try out distancing your self from cable, this is a small, cheap investment. I have an older Roku XDS and this thing kills it. I also bought a Roku 3 and it has a lot more choices, but this is a great deal and product.", "verified": true, "helpfulness": "0/0", "author": "D. Reprince \"Robo Ape\""}]