[{"rating": 5.0, "review": "We have really enjoyed Amazon Prime on the fire stick.  We binge watch all the time now.  No issues at all with video jitter or audio.", "verified": true, "helpfulness": "1/1", "author": "NewtonP"}, {"rating": 5.0, "review": "It is better than I thought. Still have to see all the features.", "verified": true, "helpfulness": "0/1", "author": "Nancy Anne Tremblay"}, {"rating": 5.0, "review": "Works great. Had to have it replaced once so far. But we have been enjoying this little gadget. Using Amazon Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Edgeofcenter"}, {"rating": 5.0, "review": "Love it.. I now can get Netflix and a host of other networks and didn't have to upgrade my old blueray player.. :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product. Just plug and play. Great selection of videos and movies. I had an older model TV that wouldn't hook up to wifi and this solves my problem. I can also watch my phone through the Fire TV Stick.I am not technologically savvy and this has been a great tool for me to use.Thanks Amazon!", "verified": true, "helpfulness": "1/1", "author": "Farmwife68"}, {"rating": 5.0, "review": "Amazon has done it again! The Fire Stick is a must have for anyone who is an Amazon Prime subscriber.", "verified": true, "helpfulness": "1/1", "author": "afamilyofamazoners"}, {"rating": 4.0, "review": "at first it did not work, picture quality was not good and kept loading on Netflix and amazon prime video. being frustrated with all the good reviews and mine not working being right beside my router, I reset my gateway, apparently my wifi was the problem , not the fire stick.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "10 minute setup-no problems-thanks very much-great product especially the included, remote-thanks very much. I have never been disappointed with anything  from Amazon. You people are fantastic. Thanks again.", "verified": true, "helpfulness": "1/1", "author": "Chester Martin"}, {"rating": 5.0, "review": "Love it so much", "verified": true, "helpfulness": "1/1", "author": "Little Starfish Boutique \"little-starfish-boutique\""}, {"rating": 5.0, "review": "Works and no problems for me", "verified": true, "helpfulness": "1/1", "author": "Larno"}]