[{"rating": 5.0, "review": "Easy to use. Awesome product!", "verified": true, "helpfulness": "0/0", "author": "chad miller"}, {"rating": 5.0, "review": "Best tv experience ever", "verified": true, "helpfulness": "0/0", "author": "marco hermoza"}, {"rating": 2.0, "review": "The Firestick is ok. I guess i should have researched it more. Unless you have amazon prime you have to pay for the additional shows and movies to watch. But it works well for Netflix.  Otherwise its good. Maybe for ease of use its an upgrade from chromecast.", "verified": true, "helpfulness": "0/0", "author": "V. Walker"}, {"rating": 4.0, "review": "I have the Amazon Fire TV for one of my tvs.  I decided to buy the stick for another tv.  It seems to work just like the Fire TV and for half the money.  My only complaint is this. The remote has a ridiculously hard to open battery compartment.  The remote for the Fire TV is plain and simple - it has a little lever that you push and no problems opening it.  The remote on the Fire Stick is just the opposite.  There is a little line that apparently one is supposed to push real hard on and then the back will move open.  Well luckily I found a site where everyone was complaining about  this terrible design.  It was suggested that you use a thin knife to insert near the line.  We used a very thin screwdriver and pried it open.  Come on Amazon!  Terrible design - get with act and make that remote easy to insert batteries!", "verified": true, "helpfulness": "0/0", "author": "patm"}, {"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "megan"}, {"rating": 3.0, "review": "Works precisely as advertised however I would rather not deal with the clunky remote as opposed to the netflix or pandora etc app that I can project onto Chromecast from my computer or iPhone. If you like the remote, the devise itself is pretty solid. I moved this to a TV that I rarely use.", "verified": true, "helpfulness": "0/0", "author": "John Doe \"John Doe\""}, {"rating": 5.0, "review": "We got the amazon fire stick so we can enjoy Netflix, etc.  programming.  All my husband did was plug one end of the HDMI cable (came with the fire stick) into our TV, and  then the other end into one side of the fire stick.  Then he also plugged one end of the USB cable (came with fire stick) into the other end of the fire stick.  The opposite end of the USB cable plugs into the transformer (came with the fire stick) which ultimately plugs into your outlet.  You're done.  In other words it's TV-HDMI port to HDMI cable-fire stick-USB cable-transformer-outlet.  Once everything was in place (2 minutes) we turned on the TV, then hit 'source' or 'input' (depending on your TV remote) and select the HDMI you want (they are usually numbered on your TV).  After that your fire stick remote can be used to navigate through the options such as Netflix.  Of course you'll have to sign up for Netflix in order to get the programming.  We signed up on our computer for a 30 day free trial.  The same thing can be done for Hulu Plus and any other options.  It's fun, it's easy, and it's addicting.  We got rid of our cable company since we were barely watching it anymore what with so many shows being stupid or reruns.  This way we can watch what we want when we want.  And if we want news, we just watch that on the computer.", "verified": true, "helpfulness": "0/0", "author": "Fallgirl"}, {"rating": 5.0, "review": "Love the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Laney"}, {"rating": 1.0, "review": "Not exactly I wanting since barely picks up a signal my wireless router and picture quality poor... still pondering returning and trying a roku.", "verified": true, "helpfulness": "0/0", "author": "Mikkiw22"}, {"rating": 2.0, "review": "Although the device is practical the remote has a weak construction", "verified": false, "helpfulness": "0/0", "author": "Geo"}]