[{"rating": 4.0, "review": "Obviously,  I am loving this product. It works exactly as described and the features are amazing.  It beats my Roku device hands down, no question a much superior product.  The Roku, I have keeps dropping the wifi signal and is very annoying.  This Amazon Fire TV Stick has not dropped the wifi signal once.I only have two minor issues which is why I dropped one star.1. The device is a bit hard to plug in to my HDMI spot on the back on the TV. I had to use the \"Extender\" that came with it.  But once plugged in it was very simple to set up and it works like a dream. Unfortunately I have to unplug it nearly everyday. which leads me to point ...2. The device interferes with my HD Antenna signal.  I have to unplug the Fire Stick to get signal from the HD Antenna and watch the local HD broadcasts. It is a minor inconvenience but one that I did not anticipate.Even with these inconveniences I still think this is the next best thing since sliced bread.  Once I upgrade my other TV to a HD TV I will definitely be getting another Fire Stick and throw out the Roku.", "verified": true, "helpfulness": "0/0", "author": "Carrie"}, {"rating": 3.0, "review": "I expected more out of this device. First, it wasn't compatible (???) with the HDMI ports on my receiver. It would not boot up no matter what I did. Just got stuck on the Amazon logo. Once I connected it directly to my TV it booted up fine. No big deal. However, I purchased this primarily for the plex functionality, and after paying for the app on Amazon (which I already own on other platforms as well as plex pass lifetime) I found out it doesn't support 5.1 audio. Hopefully Amazon can fix this in the future and I can improve my review. It would also be great if Amazon could include an option to boot directly to an app. Google TV's aging platform supported this and it was great for plex usage.", "verified": true, "helpfulness": "0/0", "author": "SwinginFriar \"swinginfriar\""}, {"rating": 5.0, "review": "Love the new fire stick and the unlimited movies", "verified": true, "helpfulness": "0/0", "author": "Roschanda"}, {"rating": 5.0, "review": "Have a computer monitor. Works perfect!!", "verified": true, "helpfulness": "0/0", "author": "Radhakrishna Dasari"}, {"rating": 5.0, "review": "Awesome little stick.  It feels a lot more like a standalone device than a chromecast does.  Although it has a companion application for your phone, it's not compulsory to use it.Even better, it allows sideloading after two steps.  Even apps not in Amazon's store can work on it including XBMC.My only complaint is that apps that you can \"cast\" using Chromecast can't also cast here.  Particularly, Pandora and Netflix can't be cast.  You have to use the app on Amazon FireTV stick.  The only one that i've found works for casting is YouTube.", "verified": true, "helpfulness": "0/0", "author": "Mario Limonciello"}, {"rating": 5.0, "review": "So far so good... Get the HBO App and it will be perfect.", "verified": true, "helpfulness": "0/0", "author": "James Williams"}, {"rating": 3.0, "review": "Nice interface, too slow to be used comfortably", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I would highly recommend this. In fact I bought two.", "verified": true, "helpfulness": "0/0", "author": "PompJoggie"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Jason Koehler"}, {"rating": 5.0, "review": "Pleasantly surprised by the speed of navigating through TV & movies, apps, pictures and songs.  Set up very easy, it still took about 20 minutes after needing a software download and getting connected to my network.  All in all, it exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "D. Scammell"}]