[{"rating": 5.0, "review": "Just like magic....really amazed", "verified": true, "helpfulness": "0/0", "author": "Sandy Silver"}, {"rating": 3.0, "review": "I own the Fire TV Stick and the Fire TV. Here is a list you may find useful. My conclusion? Had I known what I know now, I would have simply bought a second Fire TV instead of the Stick; however, if budget was a concern, I would get the Stick instead of the Fire TV.- The first thing I noticed about the Stick was that the commercials kind of lie to you through omission about how it connects to your TV. The stick requires power! The package comes with two power options: a USB cable and a wall adapter. The USB cable can be used if the USB port on your TV is powered sufficiently (older USB interfaces won't be sufficient). If the USB doesn't work for you, you can use the wall adapter. The power cable is ugly and plugs into the long side of the Stick and was therefore impossible to hide the cable entirely behind my TV.- The stick doesn't plug into the USB port! It plugs into an HDMI port instead. I wasn't expecting this.- The Fire TV Stick interface isn't as smooth as the Fire TV; the menu animations are a little jittery.- The remote, surprisingly, has a different shape and texture, and the buttons are harder to press than the Fire TV remote.- There is no voice searching on the Stick! I was REALLY sad about this as this feature was a huge selling point for me for the Fire TV.", "verified": true, "helpfulness": "1/1", "author": "John Durden"}, {"rating": 5.0, "review": "5 Stars nuff said", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 5.0, "review": "I'm in love with my Fire TV stick ,  the installation is easy you don't have to be a techie to be able to install this device it takes but 10 minutes and then TV viewing delight Like I said I like it very much.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I happy", "verified": true, "helpfulness": "0/0", "author": "Tomasz Szablowski"}, {"rating": 5.0, "review": "It was very easy to set up...  The only thing that was not clear was the 30 day free Prime Offer..  The tab came up to sign upfor the Prime Account, but there was no mention of the free offer, so I declined it..  The Fire Stick is pretty amazing,,  all the servicesthat are immediately available...  I like it...", "verified": true, "helpfulness": "0/0", "author": "ken ludlow"}, {"rating": 5.0, "review": "easy to install, easy to use.  great value", "verified": true, "helpfulness": "0/0", "author": "Mike Heal"}, {"rating": 2.0, "review": "You get what you pay for- As far a streaming devices go, this one is very basic, but what can you expect for $39? It is small, easy to set up and provides very nice HD images of the programs it streams- HOWEVER, it is mostly to sell you Amazon content, and does NOT incorprate a full web browser. It will NOT convert you TV into a \"smart TV\". You get the standard  built-in apps (Amazon, Netflix, Hulu, YouTube, etc) but you cannot go outside of Amazon's  programmed plan for this. That said, the remote is small (about half the size of a smart phone), and the set- up is fairly simple, although I had to call Comcast to re-configure my router output to match what the Fire Stick would pick up. All in all, I say wait for the next generation, this one is too limited in its scope~", "verified": true, "helpfulness": "1/1", "author": "Hozer"}, {"rating": 4.0, "review": "The fire stick is easy to install and easy to use.  The hardest thing I found was installing the batteries in the remote.  This is much quicker than a blue ray player when it comes to streaming movies.", "verified": true, "helpfulness": "0/0", "author": "K. Stevens \"susieQ192\""}, {"rating": 4.0, "review": "Easy to set up. Worked great for first 4 days, but then I had to reboot it. Screen was freezing, and then could only get black screen.  Works great again now.", "verified": true, "helpfulness": "0/0", "author": "S. Kelley"}]