[{"rating": 5.0, "review": "yes very good indeed", "verified": true, "helpfulness": "0/0", "author": "Kimberly M. Raab \"Kim R\""}, {"rating": 4.0, "review": "works well for the most part. Remote is limited but i just use my phone if i need to do something with text. Some apps work well like netflix and some dont work at all like RedbullTV. The interface is nice and very smooth and easy to use.", "verified": false, "helpfulness": "0/0", "author": "Pilar DiVittorio"}, {"rating": 5.0, "review": "Great product. My daughter uses it. Being a Prime customer, I don't know why someone would not get this (unless you have the regular Fire TV). Only issue I have is that in no pictures posted by Amazon on the site and in no TV adds do you see that there is an adapter that needs to be plugged in. Sure, I should have thought of that, but I didn't, and then I was annoyed when I opened it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Big Boss\""}, {"rating": 2.0, "review": "Your missing a lot of apps that Roku and Chromecast provide, i.e. Time Warner app. I can watch my cable with both my chrome cast and roku without having physical cable.", "verified": true, "helpfulness": "0/0", "author": "Jason L."}, {"rating": 4.0, "review": "Was easy to set up, works pretty well.  I didn't realize it had to be plugged into the wall though.  Also, if you HDMI connections aren't on the side of your tv, you won't be able to use it--signal doesn't get to it.", "verified": true, "helpfulness": "0/0", "author": "Linda Holder"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Teresia"}, {"rating": 5.0, "review": "We have a little trouble with the wifi, other than that its OK.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Better than the Chromecast stick", "verified": true, "helpfulness": "0/0", "author": "Carolyn Thomas"}, {"rating": 5.0, "review": "We enjoy having many movies and programs at our fingertips.", "verified": true, "helpfulness": "0/0", "author": "Susan M. Evanoff"}, {"rating": 4.0, "review": "It not as good as the box but it's cool. I usually don't use it too often so it does the job. Not that great at keeping the wifi signal it seems but its a good buy.", "verified": true, "helpfulness": "0/0", "author": "S"}]