[{"rating": 1.0, "review": "Disney Junior not working as that is the main reason I got it", "verified": true, "helpfulness": "1/3", "author": "Karthikeyan"}, {"rating": 5.0, "review": "Love it, excellent quality overall!", "verified": true, "helpfulness": "0/0", "author": "coldhluke"}, {"rating": 4.0, "review": "This is my first amazon TV device. The unboxing and setup was straight forward.  I was surprised that there was an included HDMI extender, which I used, in the lower end option for amazon TV. The device took some time to download the updates but I also received it the same time as a lot of other people so I assume the server(s) were getting hit pretty hard.  I activated all of my shared applications - Pandora, Netflix and Hulu plus.  The connection is seanless and its hard to believe its going over wireless.  I streamed a couple of TV shows and movies and had minimal if any lag time.  I plan on exploring the options of the device more as the weeks go on. I have heard that HBO GO maybe included in the future and that is a feature that I'm really excited about.  This device has replace my smart TV option and the family is loving it.", "verified": true, "helpfulness": "0/0", "author": "Keith Erichsen"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Loree Hickman"}, {"rating": 3.0, "review": "It has problems with Hulu. !", "verified": true, "helpfulness": "0/0", "author": "Chad J. Livingstone \"annapolitan\""}, {"rating": 5.0, "review": "Love this product. We have  in our home and use them all the time now. Hopefully we will be cutting the cord on cable very soon!", "verified": true, "helpfulness": "0/0", "author": "s"}, {"rating": 5.0, "review": "Easy to set up, easy to use and the price was terrific!", "verified": true, "helpfulness": "0/0", "author": "Mike Moore"}, {"rating": 3.0, "review": "Would love to give this five instead of three stars. The good--easy to plug in and start using. Fairly easy to navigate and works great with the app on my phone. The bad--and this is pretty bad--it messed up the screen resolution on our tv. After installing the YouTube app it asks to adjust your screen to optimize for viewing YouTube videos. Like a fool I did it thinking it would go back to normal once out of the app. We did a reset on our TV and our cable box and while it is better it is still not back to normal for widescreen. Tech assistance for our TV says it is something we would have to take in to have recalibrated.", "verified": true, "helpfulness": "2/2", "author": "magentalizarin"}, {"rating": 3.0, "review": "underpowered. waiting for updates.", "verified": true, "helpfulness": "1/2", "author": "Chris Ellis"}, {"rating": 5.0, "review": "I absolutely love this fire stick. My kids can play games with the extra controller you can buy just like the ones they play on their phone. When they saw they could play their shark game it was over! I had to get another one. It's easy to navigate with lots of apps you can add. I don't normally write many reviews but I truly love this little stick. Way better than original roku I have.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]