[{"rating": 5.0, "review": "well thought out product, simple to install and simple to use.", "verified": true, "helpfulness": "0/0", "author": "Neal \"line worker\""}, {"rating": 4.0, "review": "While having many apps and providing access to movies and tv shows with relative ease, it falls short by not addressing a simple streaming access question from a pc. I am still unable to have a stream on my pc wirelessly picked up on the tv.", "verified": true, "helpfulness": "0/0", "author": "stephen marksamer"}, {"rating": 1.0, "review": "Kept losing wifi signal.  I tried all troubleshooting tips but nothing would work.  Its not my wifi, all my other devices work just fine.  All the tech troubleshooting directed me to moving my wifi closer, trying to get the stick into range of my wifi. etc.  my wifi is just in the next room.  very disappointed.  I really wanted to like this.", "verified": true, "helpfulness": "1/2", "author": "melisa m."}, {"rating": 5.0, "review": "Easy to use and quick to set up anywhere you go.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Long"}, {"rating": 5.0, "review": "Says what it does, does what it says. Flawlessly.", "verified": true, "helpfulness": "0/0", "author": "MissThang71"}, {"rating": 4.0, "review": "Works well enough.  I have not tested other sticks, so I can't compare.  Overall it lets me watch tv without cable.", "verified": true, "helpfulness": "0/0", "author": "tpadge"}, {"rating": 5.0, "review": "Perfect for our family! Hulu, Netflix and much more! Ditch the high Direct tv bill.", "verified": true, "helpfulness": "0/0", "author": "Wendy"}, {"rating": 4.0, "review": "It is amazing but not quickly accomplished. We installed it with no problems and found it somewhat easy to check programing. Some of the shows we wanted to watch are not covered free by PRIME. RED BOX is a better alternative to a new movie. We have watched several of the older programs and have enjoyed it. We may try other things later.", "verified": true, "helpfulness": "0/0", "author": "jimglo845 \"handy man 137\""}, {"rating": 5.0, "review": "So Worth it!", "verified": true, "helpfulness": "0/0", "author": "Rosemarie Berardi"}, {"rating": 4.0, "review": "It's been great, except the remote is so small I lost it.  Thankfully I just use the app on my phone as a remote so it hasn't been that inconvenient.", "verified": true, "helpfulness": "0/0", "author": "Sean O."}]