[{"rating": 4.0, "review": "Easy to use, perfect", "verified": true, "helpfulness": "0/0", "author": "Jodie Allen"}, {"rating": 5.0, "review": "I ordered this because I like to try all kinds of new tech.  I already owned an Apple TV and a Chromecast so I was skeptical of my need for another gadget of this type and figured if I wasn't wowed, I'd simply return it.  I was INCREDIBLY impressed.  So much easier to use than my Chromecast and I hardly use my AppleTV anymore.  Definitely worth $40.", "verified": true, "helpfulness": "0/0", "author": "R. W. Foutty \"RW\""}, {"rating": 1.0, "review": "charges for watching dated films is a rip off.  I am sorry I bought Amazon's Firestick.  Netflix is much prefered.  jb", "verified": true, "helpfulness": "0/0", "author": "John M Buckholz DPM"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "margarito ruiz"}, {"rating": 5.0, "review": "I love my new Amazon Fire TV Stick!  It was easy to set up and is very easy to use.  So glad I made this purchase and would recommend it to anyone who does not have a \"smart\" TV but would like the ability to stream movies and TV shows and more right to their TV sets.", "verified": true, "helpfulness": "0/0", "author": "Michele S."}, {"rating": 3.0, "review": "I wanted it to work like a Chromecast to push my stuff from a browser from my iPhone/pad to the tv. doesn't do that. Otherwise, nice remote, Netflix, all work ok.", "verified": true, "helpfulness": "0/0", "author": "Kevin Shirey \"SineQuaNon\""}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Kiley Renae Smith"}, {"rating": 4.0, "review": "Can't get my Wi-Fi to work so I can't use any features... not even miracast...which is why I bought it... for my Fire phone... you must have internet to use this.", "verified": true, "helpfulness": "1/1", "author": "Andrea Bisson"}, {"rating": 5.0, "review": "Awsome but hard to get all it needs is user friendly for uploading....and external camera will pay a lot more for extras...", "verified": true, "helpfulness": "0/0", "author": "juan"}, {"rating": 5.0, "review": "LOVE IT sooooo much!!!!", "verified": true, "helpfulness": "0/0", "author": "M. Farmer \"SongBelle\""}]