[{"rating": 4.0, "review": "Simple to install.  Started using it right away. I wish there were more new shows & movies included with prime but I'm sure they will soon.", "verified": true, "helpfulness": "0/0", "author": "Carlie Cunningham"}, {"rating": 1.0, "review": "I'm extremely disappointed with the Fire TV Stick. It's almost useless. I can't watch anymore than 10 seconds of a show/movie at a time before it starts to buffer. The signal strength is \"very good\" and the TV is 3 feet from the router so I shouldn't be having these problems. Disappointing. I can watch Prime Instant Video on my iPad with no buffering but the second I try using the Fire TV Stick, it's pointless. This was a waste of money.", "verified": true, "helpfulness": "2/2", "author": "cpre"}, {"rating": 1.0, "review": "Drops wifi connection constantly and freezes picture when it finally does connect... not worth the money yet. Our Roku works MUCH better.", "verified": true, "helpfulness": "1/1", "author": "E. Shepherd"}, {"rating": 5.0, "review": "Easily connects to my wi-fi and delivers outstanding service from multiple online providers.", "verified": true, "helpfulness": "0/0", "author": "Bruno J."}, {"rating": 3.0, "review": "so far, seems to not be faster than our blu ray at streaming. Disappointed as this is the main reason for the purchase. We already could stream from our wifi but in the evenings we would get a lot of buffering and the speed would sometimes almost shut down mainly with netflix. The fire stick is a little better but still have buffering and sometimes frequent on netflix. Also the voice and video get out of sync but this may be because we have the firestick plugged through the blu ray so we can get use our surround sound speakers, not really sure. Will keep tweaking it and see what happens.", "verified": true, "helpfulness": "0/0", "author": "Just a sinner saved by grace"}, {"rating": 5.0, "review": "Great little gadget!", "verified": true, "helpfulness": "0/0", "author": "Renee"}, {"rating": 5.0, "review": "Perfect little add-on to the other TVs in the house!", "verified": true, "helpfulness": "0/0", "author": "Christopher S Judd"}, {"rating": 5.0, "review": "Love it but some hotels don't all you to change the input source on the TV. Just know this going in and you'll minimize disappointment. Awesome product though...hotels just need to get onboard.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "It is amazing and we are really enjoying streaming movies and games!!", "verified": true, "helpfulness": "0/0", "author": "SusanH"}, {"rating": 5.0, "review": "It came registered and ready for use.  It works great, so far we haven't had a problem.  I love how easy it is to find Amazon Prime movies using the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Mommy on a budget"}]