[{"rating": 4.0, "review": "Great Picture & Sound !Very functional  Blue Tooth Remote,Amazon was out but got it for $10.00 off at best buy .If you have Prime you really need to check this out !", "verified": true, "helpfulness": "0/0", "author": "S. Brinck"}, {"rating": 4.0, "review": "It gives what it says it gives. It has your apps; netflix, hulu, amazon prime video, being the popular ones for watching movies. It has some music apps too along with it's own amazon music app. Difficult to watch football if you don't have cable though. You need a service provider to sign up for the espn app, and college football is on the local channels. So if you want this looking for a good way to watch sports, mainly football cause it's America and everyone should watch football, then don't get this thing. Otherwise, for what it is, the OS is pretty easy, plays movies and loads quickly, and it hasn't given me trouble at all. The way to get apps is annoying though. No App Store app or a good way to browse apps.", "verified": true, "helpfulness": "0/0", "author": "Julio Angel Ruiz"}, {"rating": 5.0, "review": "I already had a smart tv with most of these features but it was so slow in comparison to the firestick", "verified": true, "helpfulness": "0/0", "author": "Anthony c"}, {"rating": 3.0, "review": "The wifi receiver is very poor if more than 12'away.  Need to now get a signal booster.  My other wifi devices never have a problem receiving the wifi signal", "verified": true, "helpfulness": "1/1", "author": "Dennis L. Kitch"}, {"rating": 5.0, "review": "I purchased this for half price as a prime member. I'd figure for $20 something bucks it's hard to pass a deal like that up. I received the order quicker than I expected and was able to plug it in to an available HDMI port. In a matter of seconds I connected to my wifi network and was able to use the stick. It came preconfigured with my info so I didn't have to enter my login. That was a nice feature. I was able to install Netflix and my other streaming apps with no problems. The interface works great. I like it a little more than the Roku stick I have setup in the bedroom.", "verified": true, "helpfulness": "0/1", "author": "init2winit"}, {"rating": 4.0, "review": "Just got it yesterday and it seems to work just like the Fire TV.  However I didn't know you had to plug it into a power source to work..would be 5 if not for that.", "verified": true, "helpfulness": "0/0", "author": "KJSDAD619"}, {"rating": 1.0, "review": "Sparked and hung up", "verified": true, "helpfulness": "2/4", "author": "Jonathan Sears"}, {"rating": 1.0, "review": "It doesn't work Verizon.", "verified": true, "helpfulness": "1/4", "author": "Vemula"}, {"rating": 5.0, "review": "excellent piece of equipment all the way around", "verified": true, "helpfulness": "0/0", "author": "Mike Steinman"}, {"rating": 5.0, "review": "This works and it operates very snappily.  Quick and easy to set up!  Anybody could make this thing work!  Why no voice recognition on this one but on the full size TV?  You can do it from the app for your phone or tablet so I guess that makes up for the lack of this feature.  Overall I'm very pleased.", "verified": true, "helpfulness": "0/0", "author": "KIRK A."}]