[{"rating": 1.0, "review": "This product should really still be in beta, as it's definitely not yet ready for prime time (no pun intended). Apps often crash, the UI is confusing to navigate, and we have had to hard reboot the stick at least once a week with daily use because the software would hang.I do not recommend this to anyone. We're getting an Apple TV to replace it.", "verified": true, "helpfulness": "1/1", "author": "Brian Kichler"}, {"rating": 5.0, "review": "great stuff but needed a wifi extender", "verified": true, "helpfulness": "0/0", "author": "sal terrano"}, {"rating": 2.0, "review": "My fire tv stick is amazing give me chance to have my own privacy in my room", "verified": true, "helpfulness": "0/0", "author": "mary powell"}, {"rating": 4.0, "review": "For what it is, it's alright. I have the original Apple TV (with 40GB HD) and it moves about as fast. Some videos load waaaaay faster on FTV than ATV could ever wish to do. But I think the wifi only makes this dongle lag slightly. I've noticed video jerkiness and audio out-of-sync frequently, which I rarely see on my integrated smart tv or on ATV. I'll keep it because it was cheap and it does a few nice things (Prime video, Netflix, Hulu) that I can't do otherwise easily. The prime interface is waaaaay Better than on my old Samsung TV.", "verified": true, "helpfulness": "0/0", "author": "B. A. Hendricks"}, {"rating": 5.0, "review": "works as it should", "verified": true, "helpfulness": "0/0", "author": "MR ALAN CONNOLE"}, {"rating": 5.0, "review": "It's a great gadget to have! However, it totally sucks that Amazon has now placed this at 39.00 when it wasn't long I ordered this and paid $99.00 ! Are you Kidding me..(laughing ) Well here goes the review first wait a while before purchasing and I do mean wait as you can see the price lowers drastically. Next, this little gadget is nice especially when traveling and staying in hotels. Our teen enjoys watching movies , playing games and such. So, on rainy days when on vacation this is sure to keep you entertained if you prefer not to be out in a down pour. It saves money as well from buying movies when your on vacation..thats a plus as hotels charge a bit much.Waiting in an airport on long lay overs wahlah you've got the magic stick to keep you from being bored out of your mind. It's a good deal at 35 bucks so I'd certainly grab a few perhaps for your child that's going off to college this fall!!Thanks Amazon for dropping the price after I purchased at 99.00! 😏", "verified": true, "helpfulness": "0/0", "author": "lovingfall"}, {"rating": 5.0, "review": "Love it. Now I don't have to pay the cable bill. I watch what I want, when I want and am so happy. I need other ones for the bedrooms. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Sherry O'Neill"}, {"rating": 4.0, "review": "Very responsive, interactive menu. One thing I'd like is having the voice command feature work with other non-Amazon products such as Netflix, YouTube when using free downloadable Fire TV app for phones, etc.", "verified": true, "helpfulness": "0/0", "author": "bmg \"bmg43\""}, {"rating": 5.0, "review": "Love the big variety of movie's available.", "verified": true, "helpfulness": "0/0", "author": "William Riley"}, {"rating": 5.0, "review": "It's works great.  Love it.", "verified": true, "helpfulness": "0/0", "author": "William Hammond"}]