[{"rating": 4.0, "review": "Very nice. The games are fun and there are lots of content possibilities. I would rate this 5 stars but Chromecast is still better for handling YouTube, remote or not.", "verified": true, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 1.0, "review": "I was on the fence with this and I made the plunge... wish i had not of. It buffers all the time. Really terrible.", "verified": false, "helpfulness": "0/0", "author": "Jennifer Barber"}, {"rating": 5.0, "review": "Exactly as described.  Great to have to supplement viewing.", "verified": true, "helpfulness": "0/0", "author": "Ronald J. Menousek"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Levon Atterberry"}, {"rating": 5.0, "review": "So far I really like my Amazon Fire Stick it was very simple to set up and is extremely easy to use!", "verified": true, "helpfulness": "0/0", "author": "Sandra J Moore"}, {"rating": 5.0, "review": "Love", "verified": true, "helpfulness": "0/0", "author": "charles miner"}, {"rating": 5.0, "review": "I had roku for a decade, and my tivo, xbox and dvd have streaming ability as well, so I have a lot of versions of streaming devices to compare, and in my experience, the early roku I had was the best of the rokus. This was a decade ago, one of if not the first streaming device. I found it far superior to my second and last roku that the fire stick has replaced. So far the fire stick is superior to all gor many reasons. Being dedicated to the task it is designed for seems to make it superior to all others with my sony dvd streaming coming in as a tie or close second. The streamlined design and cost make it an excellent deal if you need or want a streaming device that will deliver consistent quality as I can not say that my xbox, last roku or even my TiVo have been quite as good with issues of their own. If streaming comes as a secondary feature I have found it to be somewhat less reliable in getting solid and consistent streaming without buffering issues among other things. I am not sure why.Fire stick has a vast game selection as well as a very relaxing photo stream if you are not currently streaming. Both these put it miles ahead of the competition and frankly I love to just keep it on for the beautiful images in the background.For the price, this simply is the best deal around as you get great quality for it and some great extras too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I've been testing it out for a few days and I love it! I have cable as well and it's so hard to choose to watch cable instead of using the fire stick. I wanted to see if with this device I can cut cable off and still enjoy all the shows I like to watch..... And the answer is yes! And I can watch anything whenever I want! Also I can put music on while I do something or play games. It's like your whole digital world in one. I'm definitely gonna keep it and cut cable off for good!! =)P.S. I have HBO, STARZ, etc in the fire stick but keep in mind that you still need to have cable access to log into these movie apps. Also if you don't already have Netflix or Hulu, you need to start paying for it per month if you want access to them.", "verified": true, "helpfulness": "0/0", "author": "Cris"}, {"rating": 5.0, "review": "Fabulous for the upstairs TV. Why didn't I pay attention to this a year ago???", "verified": true, "helpfulness": "0/0", "author": "Lynda"}, {"rating": 2.0, "review": "Laggy Android app performance and no volume control across apps makes this a poor imitator of the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Travis"}]