[{"rating": 3.0, "review": "Was disappointed because - I thought youtube was on the stick", "verified": true, "helpfulness": "1/1", "author": "paulette hartwell"}, {"rating": 4.0, "review": "When it works, I LOVE it (and now the iphone app is out, letting me control it from my phone and do voice search.) I've had a little bit of connectivity problems...not sure if that was a temporary hiccup in my generally very high speed internet, or problems with a new product. Would recommend it for sure. I got it for only $20 (first day it was available,) so I pretty much view mine as a steal of a deal.", "verified": true, "helpfulness": "1/1", "author": "Dani and Jimmy"}, {"rating": 5.0, "review": "Watching premium content for free with Prime... what's not to like?", "verified": true, "helpfulness": "1/1", "author": "Not at all upset"}, {"rating": 1.0, "review": "a piece of junk", "verified": true, "helpfulness": "1/4", "author": "yalinwyan"}, {"rating": 5.0, "review": "It's great, works as advertised.  just wish you didn't need the power cord, since they show just the usb stick and the remote, but there's also the need to power the device, so you need a power output nearby.  Annoying, but still awesome.", "verified": true, "helpfulness": "1/1", "author": "anonymous"}, {"rating": 3.0, "review": "The ui is not fluid compare to the fire tv box", "verified": true, "helpfulness": "1/1", "author": "Kuo-hua Tseng \"robert\""}, {"rating": 5.0, "review": "I love the fire stick, it's amazing I bought an amazon gift card and was able to rent movies and I also connected my hulu and netflix account. If your considering to purchase this product do so it is awesome! Beats having a blue ray player", "verified": true, "helpfulness": "1/1", "author": "drew"}, {"rating": 4.0, "review": "We received this just before Christmas and were excited to use it.  We did however find it difficult to start up.When it would not hook up to the internet.  We called customer service and at first the tech was no help what-so-ever.  He did not know what to do, so he graciously insisted on refunding my money.  Which would be fine,but I wanted to use it.  So he handed me over to his supervisor, who work diligently to help us get started.  Wefound that we had to first hook it up to the TV in our home that was already hooked to the Internet to get it toconnect to the internet.  Once we did that, we were able to move it to our not so smart TV and use it.We totally enjoy it...with a few exceptions.  Since there is no shut off, we find that it will turn itself on.  It willflip our TV over to the source it's on, when ever it feels like it.  So we have had to unhook it inbetween uses.", "verified": true, "helpfulness": "1/1", "author": "J. Malley \"dancingangel\""}, {"rating": 4.0, "review": "It works great for Netflix and the like. The games are some lame stuff that was ported over from android or apple. The only problem I have with it is there is no good way to stream video from your computer over your home network.", "verified": true, "helpfulness": "1/1", "author": "B. Webb"}, {"rating": 5.0, "review": "This is a wonderful product.  I have yet to go searching for something to watch without finding something great.  It connects seamlessly with my TV, which is not the newest one around, so it should really do a number with a newer TV.  Setup took about two minutes.  It just slips into your TV's HDMI port.  They even give you an HDMI extender in case it's hard to get the stick into the small space on the back of the TV.  I needed to use it.  It's very easy to use as well.  I'm really pleased with it and am getting a lot of use out of it.", "verified": true, "helpfulness": "1/1", "author": "Linda Abbott"}]