[{"rating": 5.0, "review": "worth the price", "verified": true, "helpfulness": "0/0", "author": "sm abbas"}, {"rating": 1.0, "review": "Never worked", "verified": true, "helpfulness": "0/0", "author": "AHAMMED R"}, {"rating": 4.0, "review": "Pro  it is easy to set up and use.  it enhances the quality of the HD picture by 50%. We have a Netflix account so we can access it though fire stick.  I like the music channels. and the photos channel.Con  BUT  because we do not have a TV provider (cable or satellite )we have  antenna only, we  can not access  the channels that are on cable or  satellite.  We can get some of the older shows and movies for free, but would have to pay for the newer releases.", "verified": true, "helpfulness": "0/0", "author": "BBQ Queen \"aray\""}, {"rating": 5.0, "review": "it works very well I like it", "verified": true, "helpfulness": "0/1", "author": "shyheim"}, {"rating": 3.0, "review": "For the use of Amazon Prime content the Amazon Fire Stick is great. As far as streaming other apps goes I have had to move everything from my Fire Stick to my Roku because of streaming issues. I love the Prime music aspect of the Fire Stick as well. I really hope that Amazon works on the streaming of apps on the Fire Stick so I can move all of my apps back to the Fire Stick because the picture quality is much better. I love the clarity of picture on the Amazon Fire Stick and I love the volume clarity as well. Amazon, please work on slow, jumpy,and laggy streaming on the apps on the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Jamie Wolfe"}, {"rating": 4.0, "review": "Disapointed that we can't watch Game of thrones free", "verified": true, "helpfulness": "0/1", "author": "Becky"}, {"rating": 1.0, "review": "it broke before I used it for 2 months. I was very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Hobbs"}, {"rating": 5.0, "review": "I bought this as a gift for my 72 year old mother,  Finding most technological gadgets hard to understand, my mother was able to comprehend the Fire TV Stick's instructions and steps.  She has no problem navigating Fire TV Stick's various channels/programs and loves its simplicity and benefits.  I thank Amazon for creating and offering it.Beth", "verified": true, "helpfulness": "0/0", "author": "beth"}, {"rating": 5.0, "review": "Great, I could see my favorite TV shows and series.", "verified": true, "helpfulness": "0/0", "author": "Luisin"}, {"rating": 5.0, "review": "Simple to setup.  Simple to use.  Reliable.  Customer support is excellent.", "verified": true, "helpfulness": "0/0", "author": "John Sloat"}]