[{"rating": 5.0, "review": "Great product, great compliment to Netflix. Extremely satisfied!", "verified": true, "helpfulness": "0/0", "author": "Zach"}, {"rating": 5.0, "review": "Awesome must have", "verified": true, "helpfulness": "0/0", "author": "tazgolf"}, {"rating": 4.0, "review": "Very simple to set up.  Works great!", "verified": true, "helpfulness": "0/0", "author": "Modawg"}, {"rating": 5.0, "review": "Love it.  Unplug Chromecast, insert Fire TV Stick.  Any questions?", "verified": true, "helpfulness": "0/0", "author": "MattMurdock"}, {"rating": 3.0, "review": "I have a couple issues with this device. It drops my wifi connection periodically and the signal strength should be excellent as the router is very close. Also it doesn't have the kids app \"Free time\" on it like my fire tv does. Since I bought this for my daughters room, that was really what I thought to be a buying feature and since it was on the fire tv and our kindle I thought for sure it would be on the stick. She got very familiar with how to navigate through free time on the fire tv and kinde so this has been a pain for her to try to use, and a pain for me to have to keep tring to teach her how to navigate the menus to find kid friendly programming.", "verified": true, "helpfulness": "0/0", "author": "Drebeesie"}, {"rating": 2.0, "review": "Slow processing speed. Interface and app selection are good, but streaming apps, such as live games on MLB, are constantly buffering with wifi. Might work better when plugged directly into internet router.", "verified": true, "helpfulness": "0/0", "author": "EHank8"}, {"rating": 5.0, "review": "Nice.  Works well.", "verified": true, "helpfulness": "0/0", "author": "Wendy R."}, {"rating": 5.0, "review": "Glad I bought this an basically made my tv into a smart tv", "verified": true, "helpfulness": "0/0", "author": "Robert j Molloy III"}, {"rating": 5.0, "review": "Best item ever purchased. Never knew I needed this product until we received it. Does everything as promised.", "verified": true, "helpfulness": "0/0", "author": "DebPickRamsey"}, {"rating": 5.0, "review": "Great purchase/value as the kids love it and so do my wife and I . Fire Stick is much better that Chromecast in my opinion and it was so easy to install and begin. I  will be buying three more for my daughters bedrooms. As always, Amazon had it to my house in two days as promised with my Prime membership. I recommend that everyone become a Prime member as the free content on Amazon for Prime members is amazing.", "verified": true, "helpfulness": "0/0", "author": "Bradley E. Elzeer II"}]