[{"rating": 5.0, "review": "So for so good ,now I watch all my Prime video and Netflix on TV . On top of that I got it at 1/2 price !", "verified": true, "helpfulness": "0/0", "author": "Tomas T. Lee"}, {"rating": 5.0, "review": "I like it a lot.", "verified": true, "helpfulness": "0/0", "author": "John F. Byron"}, {"rating": 2.0, "review": "Too much unfriendly content.  Its more about the content - Amazon Prime has taken a sad road and I feel I am left behind and discarded as a Father in a family who cherishes traditional family values.  Features to control content on the Amazon Fire Stick are lame.  The system requires you to set a pin and openly enter the pin for each parental consideration.Asian TV and Movies are displaying superior morals.  Why isnt this available?  BYUTV provides clean content, intellectually stimulating entertainment such as Granite Flats series.  Gortimer is ok, but not in the same league as BYUTV's Granite Flats.Secondly regardless of parental settings all content is shown.  There is no simple way to use the long standing well established ratings of movies or TV content.For example you cant just say - no “R” rated material, or no “PG-13” material.  Numerous tantalizing and nearly obscene images are displayed as “cover art” for the thumbnails regardless of the settings.Numerous homosexual and transvestite materials are listed in the menus showing females kissing females, or men dressed in female clothing, as well as other intimate acts barely hidden but fully suggested.Almost all of Amazon’s own published series seem to creative capacity to do anything but show scenes of intimacy, apparently following HBO’s perspective that the only way to tell a story about history is to show erotic details that have little to do with history.Why cant we have intellectually stimulating programming without the emphasis of humanity’s inhumanity.I am paying Amazon, I hope they understand the reason why I choose to pay for programming - it isnt so I can dine on more immoral slop.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install and easy to use. Now, I'm one-step closer to cutting off my Dish subscription service.", "verified": true, "helpfulness": "0/0", "author": "James D. Howell"}, {"rating": 5.0, "review": "I love it!  Directions could be much better.  Use TV remote to enter router password.  Once you get it connected to router, it is super!  So much content it is overwhelming!  Best tech buy that I have made!", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "It's great - I am preparing to cut the cable.", "verified": true, "helpfulness": "0/0", "author": "B. M. L. Gregory"}, {"rating": 5.0, "review": "All hooked up. Easy to use. Lovin' it.", "verified": true, "helpfulness": "0/0", "author": "Linda C Pearman"}, {"rating": 3.0, "review": "I have a rOKu lite which works much better then this..stick keeps loosing wi Fi signal and screen mirroring does not work most of the time. .I'm giving it 3 star coz of the price which was on $24  at best buy..", "verified": true, "helpfulness": "0/0", "author": "manny"}, {"rating": 5.0, "review": "Wonderful as its faster than smart TV", "verified": true, "helpfulness": "0/0", "author": "Ahmed Khattab"}, {"rating": 5.0, "review": "This works great, especially if you are a prime member. I love having my music available, and prime misic.", "verified": true, "helpfulness": "0/0", "author": "Shari L. Laginess"}]