[{"rating": 5.0, "review": "I cut cable and this device fills the gaps.  It is smooth and quick.  Many Apps to add.  The gaming apps are a neat add on.  I have no need to use my Smart Blu-Ray players anymore for the app part of them.  This is faster than those players.  I have two of these.  A Fire TV box will be next, soon!", "verified": true, "helpfulness": "0/0", "author": "RT"}, {"rating": 1.0, "review": "I wanted to love this device and for the first day i did, but since then i can not get it to connect to nmy wireless network anymore.  Keeps saying authentication error and asks me to re-enter my PSK over and over and over...  I have many other devices from laptops to a chromecast that use the same wireless without issue.  Amazon needs to find the issue with this and resolve it quick or the Stick is going back.UPDATE:  After messing with my wireless settings it seems the FireTV stick is taking to long to finish the the wireless authentication so I upped the timeout to 500ms and since then i haven't had any issues with it (so far).  All my other devices continue to work fine. Hopefully someone will read this and it will help them.", "verified": true, "helpfulness": "2/3", "author": "Ben N."}, {"rating": 5.0, "review": "My Fire TV Stick Arrived earlier than I anticipated which was a plus! I Plugged it in to find that it works without the supplied power supply and usb cable, however it does run slightly faster with the power supply and cable that it came with. This is an amazing asset in our home! no unsightly cables hanging behind the tv and the possibilities are endless. I have put it through its paces and love every aspect of it..... if only it could control the tv volume I would never need to reach for my tv remote again! all-in-all I am fully satisfied with the Fire TV stick and all of the options it comes with! I was up and running as soon as I turned my TV on! Way to go Amazon, you have once again exceeded my expectations!", "verified": true, "helpfulness": "1/1", "author": "Michael Goulet"}, {"rating": 4.0, "review": "This was the bust buy ever.  So easy to set up, and the kids are thrilled.  They love to play the games.  Now, if it would have VuDu it'd be perfect!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great for the price! This is my new go to for streaming media. I got tired of booting up my computer to watch tv. I wanted instant gratification and I got it. Thanks Amazon!", "verified": true, "helpfulness": "1/1", "author": "flancito"}, {"rating": 4.0, "review": "This review is based on the promotional $19 price for Prime members. At that price, it's hard to fault the unit. But you need to set your expectations accordingly.I wouldn't want the Fire TV Stick as my primary source of video. But as a way to get Amazon Prime Instant Video and Netflix and other things to a spare HDTV, it's a heck of a bargain and it seems to do the job.Most of my TVs have modern TiVo devices connected. The user interface of the Fire TV Stick is similar to the new Amazon interface in the latest TiVo software update. Compared to Amazon's TiVo software, the Fire TV Stick has pretty good interface performance. However, occasionally it seems like the unit doesn't register a button press on the remote. That may be due to the low cost construction of the remote's buttons, or due to 2.4GHz interference with the Bluetooth used by the remote. Even so, the Fire TV Stick does a reasonable job presenting Amazon's corporate TV UI. (That UI is a bit clunky, but that's common to the Fire TV devices and the Amazon TiVo software.)What concerns me the most is that the video quality of the Fire TV Stick isn't as good as advertised. Amazon says the Fire TV Stick supports \"up to 1080p\" resolution. That may be technically true, but I have yet to see the Fire TV Stick reach 1080p. I have a 150Mbps Internet connection that consistently operates at or above the advertised speed. My TiVo devices, which use wired Ethernet, rarely have trouble playing Amazon streams at 1080p. That same content streams at \"HD\" quality on the Fire TV Stick... even when it's located 10 feet away from a simultaneous dual-band 802.11n WiFi access point, in the same room, with no other substantial use of the WiFi. If it cannot reliably stream 1080p under these conditions, I find it hard to imagine what's needed to get 1080p video out of it.For a 23\" LCD TV in the spare room, you can't tell the difference anyway, and it will keep the kids or the visitors happy. On a 42\" plasma, you can definitely see the quality difference. The 1080p stream of \"Orphan Black,\" for instance, is almost Blu-ray quality on Amazon's TiVo app; the Fire TV Stick's HD stream sometimes struggles to maintain DVD clarity. With a smaller set, where you can't tell the difference between 720p and 1080p from a reasonable viewing distance anyway, who cares? Especially at this price!But if you're buying a $19 or $39 \"stick\" player to plug into a large TV, whether the Fire TV Stick or another brand, chances are you're going to be disappointed. Better to spend on the larger, more capable devices that support wired Ethernet and have better processors.", "verified": true, "helpfulness": "2/2", "author": "Robert Levandowski Jr."}, {"rating": 5.0, "review": "Here to order a second stick and will be shelving chromecast once it gets here. Most of our video library is through Amazon (and we're prime members) so it's perfect for our needs. I had zero problems with set up and the remote app for Android works fine if you care to try it.", "verified": true, "helpfulness": "0/0", "author": "Kitty Yttik"}, {"rating": 5.0, "review": "added to my arsenal of Video room gadgets great fun", "verified": true, "helpfulness": "0/0", "author": "Chad D Ulrick"}, {"rating": 5.0, "review": "3 days on our wireless network plugged into my AV Receiver HDMI port usign extender due to space..Rright near my Uverse Wireless Access point.No connection issues, no stuttering.Setup was very simple. So far so good.We only watch - we don't stream local content or media.Played 2 Netflix movies all the way through with no issues.Played 1 Prime movie all the way and no issues.Watched 1 or 2 tv shows.Always had some issues on our Sony Bluray with apps watching Netflix - Stuttering, buffering.None here.Roku didnt play Prime videos well.So we were always hopping from one device to the other.I don't see the interface as being confusing at all.It seems to be almost as easy to use as the Roku which is really nicely done, and that is almost as great as the Wii which was the best in my opinion.. But that device left the house so I moved to Roku and Bluray.Took a try or two to find Recently Watched to get back to resume play of a movie..my Daughter and Wife like it the remote is responsive and simple.This may work out.Got this at the $19.99 price..Got the voice remote - Very niceHave the APp on my Kindle Fire HDX,, works well there.", "verified": true, "helpfulness": "0/0", "author": "james f"}, {"rating": 3.0, "review": "I've been having problems with both the Netflix app and the Showtime app.  I'm getting a strange audible buzz sound at random times which detract from the show we are trying to watch.  Frustrating.On another note, still waiting on the iPhone app to come out...", "verified": true, "helpfulness": "0/0", "author": "Bud"}]