[{"rating": 4.0, "review": "Fire stick is working well.  I initially tried using the extension for the HDMI stick that goes into my TV, since the instructions said that I would get a stronger pickup of my Wifi signal.  But my extension must be defective, since it would only work for a couple of seconds before the screen went blank.  Since the system is working well without the extension, I'm not going to bother asking for a replacement for now.  If I moved my router further from the TV I might need it.", "verified": true, "helpfulness": "0/1", "author": "Thomas W Metzger"}, {"rating": 1.0, "review": "Amazon becoming too big ... will lie just to sell a product .", "verified": true, "helpfulness": "1/9", "author": "Emmett Rice"}, {"rating": 1.0, "review": "I have a kindle  fire 7\" HD.  What I am looking for is some device that will let me watch movies on my kindle fire HD without needing an internet or wifi connection.  For example, perhaps a stick that you can record several movies on and then plug into your kindle fire HD and watch wherever you happen to be where wifi or internet is not available.  Is such an application available at a reasonable cost?", "verified": false, "helpfulness": "1/10", "author": "Jed Kelson \"Big Kahuna\""}, {"rating": 5.0, "review": "This little stick works like a charm.  Easy to setup and use.  I can stream ESPN SportsCenter while I workout without having to pay for an additional cable box in my workout room.", "verified": true, "helpfulness": "1/1", "author": "R. Harris"}, {"rating": 1.0, "review": "Would not connect to wifi.  Airport Extreme AP with a Chromecast and Laptop connected to same Wifi, same TV, same distance from access point.  Tried all the tricks in the \"Can't connect to Wifi\"  troubleshooting doc, including resetting it, nothing worked.  Enter the Wifi password, it sits for about 15 sec, then bounces back to the password screen.  Seems to be a pretty common problem, with no real solution, so had to return it.", "verified": true, "helpfulness": "2/3", "author": "Joseph Boren"}, {"rating": 1.0, "review": "Just received the Fire TV Stick in the mail.  Immediately installed and set up.  Experiencing two troubling issues:1) Screen flickers every ten or fifteen seconds.  There is an audible click sound and a thin green line horizontally across the screen.  Then video returns to normal/expected play for ten to fifteen seconds, then flicker again. Repeat, over and over again.2) TV seems to not realize it is receiving input and goes to sleep.  Reselect HDMI input and works again, until next sleep cycle.", "verified": true, "helpfulness": "2/3", "author": "Leo5280"}, {"rating": 5.0, "review": "My son loves this! Turned his non-smart tv into a very smart tv! Lots of movies, games and apps to chose from. Excellent purchase!", "verified": true, "helpfulness": "0/1", "author": "Upstate NYer"}, {"rating": 5.0, "review": "I like this product very much. Have never owned any other streaming device, but this works as advertised. Love the simplicty of the remote, easy to navigate in the dark.", "verified": true, "helpfulness": "1/2", "author": "Tim Kish"}, {"rating": 3.0, "review": "I'd give it a higher rating IF it had YouTube.  But it works as advertised and is a sweet little package.", "verified": true, "helpfulness": "0/2", "author": "Robert F. Schoenert"}, {"rating": 5.0, "review": "Easy to set-up and works great.", "verified": true, "helpfulness": "0/1", "author": "SAH \"SAH\""}]