[{"rating": 5.0, "review": "Beats Apple TV to pieces. Great performance and great UI.", "verified": true, "helpfulness": "0/0", "author": "Mark E. Peltz \"Marked\""}, {"rating": 5.0, "review": "excelente!!!", "verified": true, "helpfulness": "0/0", "author": "Francisco Nuñez"}, {"rating": 5.0, "review": "We are impressed with this TV stick.  It is user friendly and up to date.  It has opened up a whole new world of TV watching for us.", "verified": true, "helpfulness": "0/0", "author": "Sandra D. Beeman \"Sandra in PA\""}, {"rating": 5.0, "review": "Love the portability of the stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fast interface & the GPU delivers a nice crisp picture", "verified": true, "helpfulness": "0/0", "author": "Nimbo"}, {"rating": 5.0, "review": "Simple to set up; easy to use;", "verified": true, "helpfulness": "0/0", "author": "Em"}, {"rating": 5.0, "review": "I got the Fire TV Stick for my fiance for Christmas. He LOVES it. It was  very easy to set up and get connected. Navigation is easy as well. The remote is small sleek, very easy to use. Netflix and Hulu work great. We haven't messed around with any of the other apps too much. One that we couldn't find was Vudu which was dissapointing. However I guess it makes sense, amazon wants you to rent movies from them, not a 3rd party. Overall we are very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Mary A."}, {"rating": 5.0, "review": "Love the stick! Was extremely easy to hook up. It took me about 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "lisa pfeuffer"}, {"rating": 5.0, "review": "Originally purchased this item due to the sale for Prime members. I have a Google Chromecast, so I am familiar with a lot of the casting features. The Fire TV Stick is awesome because it gives you an interactive interface.You DO NOT need to be a Prime member, but it is definitely recommended because it will show you the TV shows and movies that are available on Prime. In addition, you can download apps and games to play. Some games do not require the game controller, sold separately, but some do. Some apps and games are free, while others are not (just like regular app store). Parental controls are available to use and are recommended. You can display photos / videos from your Amazon cloud account. You can cast streams from your phone to your TV (eg, Netflix, YouTube, etc). You can also use screen mirroring, available on most phones/tablets with it. Setup is a breeze. Would recommend!", "verified": true, "helpfulness": "0/0", "author": "Prodigious"}, {"rating": 4.0, "review": "This is fantastic!  The ONLY reason it isn't 5 stars in my opinion is because I can't run the sound through my external speakers.  I have to depend on the sound from my TV, not my surround sound system........bummer.  But, the unit itself is great!", "verified": true, "helpfulness": "0/0", "author": "P. Gangi \"Photo Guy\""}]