[{"rating": 5.0, "review": "Love the stick. Easy to use and a decent number of apps make this my preferred device even though my smart tv has some of the same apps built in. The app interface is way better than those I have seen on smart tvs.", "verified": true, "helpfulness": "0/0", "author": "onlinepurchaser"}, {"rating": 3.0, "review": "PROS:The apps and presentation of movies and synopsis is \"high tech\" in  appearance.It was easy to install and navigate.It arrived on time and is $10 cheaper then all the other TV streaming media players.CONS:The video or movie will CONSTANTLY  need to \"rebuff\" or. \"Reload\". (Has nothing to do w the Internet connection)I highly recommend purchasing a ROKU. I hav a ROKU for each television in my house and never had problems. The only reason I purchased this Fire stick was because it was $10 cheaper and I was interested in trying something new.", "verified": true, "helpfulness": "0/0", "author": "GIA"}, {"rating": 3.0, "review": "Truly upset that a lot of the apps required a cable provider. I got this so I could have a selection that fit my family and not have to pay a huge cable bill. I don't understand why a lot of them don't charge a monthly or yearly rate lime Netflix or amazon do..", "verified": true, "helpfulness": "0/0", "author": "Jennifer Metcalf"}, {"rating": 2.0, "review": "Got two when they were on sale for $20.  If you want to watch Prime videos it works great, to use any other provider takes effort.  Tech like this needs to be effortless(so my mother doesn't call me everyday with questions)or provide options unavailable else where that make it with the effort, unfortunately this does neither.  In addition the app line up is lacking.  No Yahoo screen for \"Community\". No HBO Go, but rather lots of old seasons on prime with the ability to buy newer episodes from Amazon.  I stayed away from fire tablets because of issues like this, and my experienced with the fire stick makes me think I made a good choice.", "verified": true, "helpfulness": "0/0", "author": "Gregory L. Mcfall"}, {"rating": 5.0, "review": "Need to get an adapter so I can enjoy it some more with my Dish.", "verified": true, "helpfulness": "0/1", "author": "Doris E McReynolds"}, {"rating": 3.0, "review": "I got this about four months ago. I have loved it, until now. I have been having trouble with it for the last week. At first it would not allow me to watch certain shows on Netflix. I thought this was a netflix issue, so I spent the better part of the day talking to Netflix. As it turned out it was my fire stick that was the problem because the shows I wanted to watch would play on all my other devices. Now I am having an issue with my wifi connection. Again I am connected on all other devices just fine. I have tried to reset my modem, I have restarted my fire stick, and I have reset the fire stick back to factory settings all with no avail. I think this is a great item when it works, but right now it is really frustrating me.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Can not keep up with streaming from portable devices.  For example, streaming from a mobile device to fire stick.  It always disconnects.", "verified": true, "helpfulness": "0/1", "author": "sho12ty78"}, {"rating": 5.0, "review": "lives up to expectations", "verified": true, "helpfulness": "0/1", "author": "Jerry"}, {"rating": 5.0, "review": "If you are debating between a roku or a chromecast and this and you want the opinion of someone who has all three then I can give it to you! Fire tv stick hands down! I have noticed lag on mine playing some games so if you want to play games you might want to look at the fire tv instead. That isnt all games though. Most i have played run great. If video as all you want then this thing can give you what you want! I can find all the apps on my roku that i use on here plus more and its half of the price (I got it for 19 bucks on the initial prime members only sale so i payed one fourth of the price of my roku.) so that's how it beats my roku. As far as chromecast goes, Yes it is really cool to control your chromecast from your phone...at first... then you realize how much it needs a remote! This thing has a remote! Plus chromecast, as far as I know doesn't run amazon prime yet ( and maybe never will...). Any way, I have been recommending this to everybody and I would recommend it to anybody. Plus once you install xbmc (kodi) this thing becomes priceless because you can't install that on chromecast or roku.", "verified": true, "helpfulness": "0/0", "author": "Joselujano84"}, {"rating": 1.0, "review": "I love Amazon and Amazon gadgets but fire stick is not worth at all. I bought them when they were first released. Every time my daughters want to watch Netflix or Amazon videos the sticks have to be restarted. Unplug them and plug them back in. They advised me on changing the settings on my router which I did and it didn't fix the problem. They also said the sticks needed to be within 10 feet of the router, seriously? Finally I got a replacement and it was the same thing. Don't buy them.", "verified": true, "helpfulness": "3/4", "author": "J. Leiva"}]