[{"rating": 5.0, "review": "very satisfied. works great.", "verified": true, "helpfulness": "0/1", "author": "Gig"}, {"rating": 5.0, "review": "Enjoy the Fire Stick greatly, so much that this is the second one I ordered.", "verified": true, "helpfulness": "0/1", "author": "James F. Sharp"}, {"rating": 3.0, "review": "This thing often seems to have connectivity problems.  I am frequently having to forget the network and re enter my wifi info. Meanwhile my chromecast never has issues. Also, FireStick + HBO Go thru Charter is not available,  so again I go back to my chromecast. Disappointing as i love the remote and would prefer to do everything with the fire stick.", "verified": true, "helpfulness": "0/1", "author": "litMargin"}, {"rating": 5.0, "review": "Love the firestorm!!easy to use and set up.", "verified": true, "helpfulness": "0/1", "author": "Laurie Guarneri"}, {"rating": 5.0, "review": "I love the fire stick. Worth every penny paid. It lets me access my prime content as well as other streaming services (netflix) and has apps and games to boot. But my favorite feature of this device is its portability. I can throw it in my luggage and take it with me on my travels. As long as I have internet access I can keep binge-watching my favorite shows from the hotel. Plus, it is much faster to boot up than the netflix app on my tivo and also a little easier to navigate.", "verified": true, "helpfulness": "0/1", "author": "T Rob"}, {"rating": 5.0, "review": "I bought this for my husband along with the Sling TV deal. He loves it!! Now he can watch some off his favorite cable shows without having to pay for the dreaded cable!! Our internet is not the greatest but this forms a good connection. It was super easy to set up and learn to navigate!!", "verified": true, "helpfulness": "0/1", "author": "Anita967"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "laarni"}, {"rating": 5.0, "review": "Great product. Easy to install and use. Instantly makes my TV smart", "verified": true, "helpfulness": "0/1", "author": "John L Keisling"}, {"rating": 2.0, "review": "Can't watch anything. Keeps saying lost internet connection. Then says connected with problems.", "verified": true, "helpfulness": "0/1", "author": "Tracy L Sowell"}, {"rating": 5.0, "review": "I love this thing!  I am about to ditch my cable box so I can save some money.", "verified": true, "helpfulness": "0/1", "author": "brannycakes"}]