[{"rating": 5.0, "review": "I haven't watched anything not on my fire stick, since I've had it. I love how easy it is to use and how much is available to me. I would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Jackie Graham"}, {"rating": 5.0, "review": "Awesome.  I love it.  I think that I have convinced 5-10 others to buy it.  Works great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Norman P Fitzgerald"}, {"rating": 1.0, "review": "Bought this specifically for mirroring my fire phone to my tv, but it wouldn't do it. Tech support has been unable to figure out the problem", "verified": true, "helpfulness": "0/0", "author": "Wesley G. Ginder"}, {"rating": 5.0, "review": "it is really cool.... I use my iPhone as the remote.  love it!", "verified": true, "helpfulness": "0/0", "author": "julie a waters"}, {"rating": 1.0, "review": "We have had it for approximately 1 month and have been having problems with it since we installed it. We have had to call tech support 2-3 times already and just today called and was told that we may need to unplug it in and re plug it in daily. This is difficult since the tv is wall mounted--- what a pain", "verified": true, "helpfulness": "0/0", "author": "dawn mcfadden"}, {"rating": 5.0, "review": "so far it is working", "verified": true, "helpfulness": "0/0", "author": "john cullinan"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "leah woodard"}, {"rating": 4.0, "review": "We purchased a Roku 3 for another room at the same time we purchased the fire stick. The Roku seems to get a better signal from our wifi (and its farther away from our router) than the fire stick. We have experienced more periods of buffering and a couple complete losses of connection with the fire stick where we have not with the Roku. We have the fastest internet available with our service provider and like I said, the Roku seems to get a better signal so there does not seem to be an issue with the wifi service itself. Relatively speaking however when loading apps and shows it is pretty fast. I would however recommend it for the price and will probably just move it to a bedroom that does not get as much viewing time and replace with another Roku (or try out the fire TV) in the room it is in.", "verified": true, "helpfulness": "1/1", "author": "Andrea Matthews"}, {"rating": 3.0, "review": "When it works it's wonderful. That being said it loses its wifi connection multiple times a day for no known reason. We, like most families, have multiple devices running on wireless at any one time and the Fire Stick is the only one with this issue.", "verified": true, "helpfulness": "0/0", "author": "Meg B"}, {"rating": 5.0, "review": "Fast delivery and I love the item . This what I need it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]