[{"rating": 5.0, "review": "This was an amazing addition to our tv watching.", "verified": true, "helpfulness": "0/0", "author": "Marie Pilato"}, {"rating": 5.0, "review": "Easy to set up and use.  We all love it especially my 6 and 9 year old.", "verified": true, "helpfulness": "0/0", "author": "DK"}, {"rating": 1.0, "review": "Horrible. Threw them away the first day of use. They were only 20 dollars so much was not expected of this product.", "verified": true, "helpfulness": "0/0", "author": "Les"}, {"rating": 5.0, "review": "Love my Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "karen kellerman"}, {"rating": 5.0, "review": "The Fire TV Stick is fantastic!! It was so easy to install, it took me 5 minutes! Easy setup and it works great. I easily downloaded Netflix and my Amazon Prime Video library was right there when I installed it! Can't be the price!", "verified": true, "helpfulness": "0/0", "author": "Joanne C. \"Joanne Cerreto\""}, {"rating": 5.0, "review": "The best way to stream media.", "verified": false, "helpfulness": "0/0", "author": "Rachel Diaz"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Calvin Massey"}, {"rating": 5.0, "review": "I should have bought one of these a long time ago! It works great. We have \"cut the cable\".", "verified": true, "helpfulness": "0/0", "author": "Rft \"Withit Library Lady\""}, {"rating": 3.0, "review": "I really like the idea, but it seems like it has problems connecting to wifi a lot. I dont think its my wifi either because I can connect my laptop, phone, and xbox no problem to it but the Fire Stick looses connection all the time. Besides that it is pretty quick and I enjoy it. I wish I could mimic my laptop screen to it!", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "The Fire TV Stick works great. All you do is plug in, sign in to your accounts, and go. No setup needed. I also love the app for iPhone. It allows you to type using your phone rather than arrows and clicking each individual letter. The app also allows you to use the voice recognition. It's great!", "verified": true, "helpfulness": "0/0", "author": "Philip Paradis"}]