[{"rating": 5.0, "review": "I've been using the Fire TV Stick for a while now and I can honestly say it kicks Google's Chromecast where the sun doesn't shine, it's fast and responsive and the UI works great. Kudos to Amazon for making an entry level product that does feel cheap and works better than similar products from the competition.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "testing out to see if lets me cut the cord to cable/satellite...so far so good, still lots to learn on it", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "It makes my dump TV smart!!!!", "verified": true, "helpfulness": "0/0", "author": "Manish Chokshi"}, {"rating": 5.0, "review": "What's not to love about the Fire Stick? I can't believe I waited so long to buy this. After using the Google Chromecast for 2+ years it's so refreshing to use something that offers a ton more storage, apps and has Netflix and Amazon Instant Video on the same device. Chromecast does not have Amazon and it has no remote. A huge perk to the Fire Stick is the remote it comes with. It was incredibly easy to install and took me less than 5 minutes. It also came with the batteries included!", "verified": true, "helpfulness": "0/0", "author": "BreesyInNola9"}, {"rating": 5.0, "review": "The fire TV stick was easy to start using as soon as I received it. I can get more movies and old TV show  I miss seeing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My boyfriend, who has a smart TV, said, \"why did I even buy a smart TV, when I can spend 40$ on this!?\" So, I feel pretty good about my purchase. It works very well, it's user friendly, it's highly responsive and it's way faster than smart TV's. The setup is easy, there's a video that shows you everything.I am incredibly pleased.", "verified": true, "helpfulness": "0/0", "author": "Eparkison"}, {"rating": 2.0, "review": "well, it is easy setup, and it does work well to find all options for watching what you want to see...BUT-  this thing is not fast, nor does it stream well.  I have it less than 10' from my router, nothing between them, and it jumps and freezes and puts up warnings that my internet is too slow to work well.IN THE MEANTIME - my AppleTV is downstairs from this, with a number of items between it and the router, including the floor/ceiling, and nothing seems to slow it down.Tell me again how good this is....would you?  I'd not buy it again.  I'm pretty disappointed in the product.", "verified": true, "helpfulness": "0/0", "author": "Jack B. Frost \"JB\""}, {"rating": 5.0, "review": "Worked like a charm. Easy to set up and use. More options than Apple TV. Cheaper too. Much smaller device also.", "verified": true, "helpfulness": "0/0", "author": "Rae"}, {"rating": 5.0, "review": "Excellent device. Just wish it had better photo and file showing capabilities like web browsing and drop box. I'm a photographer and was hoping to use this for portfolio showing aside from Netflix. But amazing product over all if movies and music Is your only use out of it.", "verified": true, "helpfulness": "0/0", "author": "Eddy Esmail"}, {"rating": 5.0, "review": "Love it. No issues.", "verified": true, "helpfulness": "0/0", "author": "JackyAGLUV"}]