[{"rating": 4.0, "review": "Using it is pretty intuitive, especially if you have even basic knowledge of media streaming.  There was a simple instruction video on set-up, but the brief, in-depth instructional videos were the most helpful.  Unfortunately, the system was not ready-to-use out of the box for me, due to the configuration of my TV/cable system.  I called Customer Service, and can't say enough about how incredibly helpful, patient, and easy-to-understand they were.", "verified": true, "helpfulness": "0/0", "author": "Caryn Adler"}, {"rating": 2.0, "review": "Did not work.  Neighbors worked on my TV / Internet.  Faulty product.  New in the ill be shipped in February.", "verified": false, "helpfulness": "0/0", "author": "Jerry Oldenkamp"}, {"rating": 5.0, "review": "Easy to use. Much faster than Roku. Nice.", "verified": true, "helpfulness": "0/0", "author": "Bruce Herbert \"Bruceh2204\""}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Michael P Murphy"}, {"rating": 5.0, "review": "Loving it so far!", "verified": true, "helpfulness": "0/0", "author": "Michael Shelton"}, {"rating": 5.0, "review": "It's a really good product as described. The only problem i have is the my kids took over the TV!", "verified": true, "helpfulness": "0/0", "author": "nikki \"nikki\""}, {"rating": 5.0, "review": "more content than similar devices and services", "verified": true, "helpfulness": "0/0", "author": "allen smith"}, {"rating": 5.0, "review": "The Bomb!!!", "verified": true, "helpfulness": "0/0", "author": "Kenneth J. Ryan"}, {"rating": 5.0, "review": "I have to say I was a bit concerned not knowing much about this item but with all honesty, was a breeze to install and worked within minutes!  This is most definitely making me rethink how I watch the tube.  I'd say having Prime and this stick, things are gonna change around here!", "verified": true, "helpfulness": "0/0", "author": "Jewel Ruby"}, {"rating": 5.0, "review": "Easy installation, easy to operate. Gonna luv it!!!:)", "verified": true, "helpfulness": "0/0", "author": "Rebecca Landgraf"}]