[{"rating": 5.0, "review": "Not just plug and play.besides that, it meets my expectations.I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "reggie"}, {"rating": 5.0, "review": "I LOVE MINE!!!!  Since I got it, I have stopped watching regular TV!  I am hooked!  Fire TV Stick is a chauffeur's best friend!", "verified": true, "helpfulness": "0/0", "author": "Curtis"}, {"rating": 2.0, "review": "Limited selection", "verified": true, "helpfulness": "0/1", "author": "Jamal"}, {"rating": 5.0, "review": "The beat thing since invention of the light bulb!!", "verified": true, "helpfulness": "0/0", "author": "Sally A. Starin \"sallystarin\""}, {"rating": 5.0, "review": "Works Great", "verified": true, "helpfulness": "0/0", "author": "jeff jackson"}, {"rating": 5.0, "review": "I got the remote that you can talk into.  It's great. I love the product in general.", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "I have a smart tv and a smart blueray player, but now with my Fire Stick I never use those features.  My family and I really enjoy this interface and use it extensively.  Hard to believe that something so inexpensive could provide so much quality and value. Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "WineGuy"}, {"rating": 5.0, "review": "Love the fire stick! Great idea Amazon.", "verified": true, "helpfulness": "0/0", "author": "antaylor"}, {"rating": 5.0, "review": "The ease of setup and already being registered was wonderful.  Still getting used to the controls but so far so good!", "verified": true, "helpfulness": "0/0", "author": "David L Hall Jr"}, {"rating": 5.0, "review": "Everything you need and would expect from a streaming device. Feels snappier than the Roku and Roku 2: I haven't tried the roku stick so I can't compare the 2. I do like the interface, fairly simple straightforward and for prime members lots of content readily available.I was happy to see that the remote operates over 2.4ghz instead of IR like some roku devices. I have this set up in the bedroom and seing as its behind the TV, line of sight would be very inconvenient.All in all I would highly recommend it to anyone looking for a streaming device. The remote and unit are solid and streamlined in Matte black and look good in any room", "verified": true, "helpfulness": "0/0", "author": "Kyler Christian"}]