[{"rating": 5.0, "review": "I have a Roku Stick. I have a number of smart Blu-ray players. And, I have used a SmartTV. This beats them all.I bought this because the Sony smart Blu-ray player in my bedroom was having trouble keeping a connection to the internet over WiFi at times (due to distance from the router), and because the GUI was kinda lame and slow to respond. I had previously bought my son a Roku Stick (it is powered by USB only currently), and it was very slow to respond to the remote control and to load Apps (though it works well when the apps finally load). I decided to follow Amazon's recommendations with the Fire Stick and plug this directly into an AC receptacle/outlet. This definitely makes performance very snappy. The GUI on this is much better than the blu-ray player, and I prefer it over the Roku Stick's GUI as well (though the Fire Stick is certainly Amazon-centric). The FIre Stick is very quick to respond to the remote control, which is a pleasure to use. I have had absolutely no problem staying connected to WiFi, and this thing loads apps and movies so much faster than my BluRay player I would be surprised if I ever use the BuRay player for anything other than BluRay disks again.Another great feature is that the Fire Stick is connected to Amazon Prime Music, and will also display cloud-stored personal photos as a screen saver if you desire.If there is any con to the Fire Stick, it is that it is Amazon-centric. Netflix and other apps work outstandingly well, but they are not the focus. The Twich app is great, except that I do not believe the Fire Stick is capable of using chat.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "easy to use", "verified": true, "helpfulness": "0/0", "author": "E."}, {"rating": 3.0, "review": "I mentioned before that navigating YouTube with Fire TV Stick is very difficult.I am afraid this applies to all of these TV devices.  Without a keyboard getting fromplace to place is tiresome and often just too much trouble.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Patrick Lowenthal"}, {"rating": 1.0, "review": "Get's hot and doesn't work more than it works. Cuts out or freezes while watching non stop. Buy something else this product does not work.", "verified": true, "helpfulness": "0/0", "author": "T. Sargent"}, {"rating": 5.0, "review": "I love amazon fire stick!!! Enough said!", "verified": true, "helpfulness": "0/0", "author": "Jillian Turek"}, {"rating": 4.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Fiesty Rican \"Boricua Morena\""}, {"rating": 5.0, "review": "Fast and easy to setup and use", "verified": true, "helpfulness": "0/0", "author": "Kelly M"}, {"rating": 5.0, "review": "Works great. No problems whatsoever!!!", "verified": false, "helpfulness": "0/0", "author": "Ravi Kanth Mulam"}]