[{"rating": 5.0, "review": "Great product.  After opening the box we were up and running in 1/2 hour.  Very easy to use and is fast.  Downloaded the phone app, this also works very well.", "verified": true, "helpfulness": "0/0", "author": "A. C. Karlo"}, {"rating": 4.0, "review": "It was easy  to hook up and start I still have to play with it to see what ot does  ut I get netflix on a tv tthats not even hooked up to cable just  by Putting in my codes.  I am a bit disappointed that I will have to pay extra for certain programs.", "verified": true, "helpfulness": "0/0", "author": "dorothy koprowski"}, {"rating": 4.0, "review": "Plex streaming at 1080 is almost impossible. Skips. Would prefer the wired version by far. Or a forge TV", "verified": true, "helpfulness": "0/0", "author": "BGaulin"}, {"rating": 4.0, "review": "Very impressed with the easy set up and syncing with Fire HDX tablet. Love it!", "verified": true, "helpfulness": "0/0", "author": "Susan C"}, {"rating": 5.0, "review": "So easy to set up and great selection of shows!  Bought for a secondary TV.", "verified": true, "helpfulness": "0/0", "author": "Gina in Phx"}, {"rating": 5.0, "review": "Works great! Love it!", "verified": true, "helpfulness": "0/0", "author": "Mabel S."}, {"rating": 5.0, "review": "It's great.  Better than expected.  Fast response, beautiful HD Picture.  Easy to use", "verified": true, "helpfulness": "0/0", "author": "Michael Hébert"}, {"rating": 5.0, "review": "My whole family loves the new Firestick!", "verified": true, "helpfulness": "0/0", "author": "Velma oliver"}, {"rating": 3.0, "review": "I wish there was better instructions.  I'm still having difficulty.", "verified": true, "helpfulness": "0/0", "author": "Connie Cole"}, {"rating": 5.0, "review": "I am not very smart with anything to do with technology, but I have put together this Fire TV Stick and right away was able to start watching PRIME Movies - way to go AMAZON - Satisfied customer  :)", "verified": true, "helpfulness": "0/0", "author": "Alba m Parra"}]