[{"rating": 5.0, "review": "Fire stick is awesome. Thank you", "verified": true, "helpfulness": "0/0", "author": "Rashunn Lewis"}, {"rating": 5.0, "review": "LOVE IT, LOVE IT, LOVE IT.  50X better than the ROKU I had/have. No buffering, no delay. Ez to use, etc.", "verified": true, "helpfulness": "0/0", "author": "Michael Goodman"}, {"rating": 5.0, "review": "I bought the Fire TV stick for use in hotels (as I travel for work) and I wanted to be able to watch my prime and Netflix shows on a bigger screen.  Well, it didn't work because the hotel WiFi changes passwords. So if you want to use it in a hotel, don't bother.  I also had an issue with the way a few of my TVs were set up with the HDMI ports...the angle wouldn't allow the Fire TV stick to go in.  BUT...we found that it will work (and works great) on our 19\" TV in the kitchen.  Once I set it up (which was very easy), we were able to use it right away.  My mom, who is technologically retarded, has mastered how to use it...so that is saying something about its ease of use.  She has been able to get caught up on her Downton Abbey program.I highly recommend the product.  The set up is the same as the Fire TV box and is quick and easy.  The only real difference between the two is the remote doesn't have the voice recognition piece, but I rarely use it...and you can type in what you are looking for.  So if you are a Amazon Prime and Netflix (or Hulu Plus) user, I would definitely recommend this product.  Just be sure to check that your HDMI ports have straight on access.  My TVs were curved, so it prevented the stick from going in for the bigger TVs, but no problem with the Fire TV box.  Also, forget about using it on hotel TVs.", "verified": true, "helpfulness": "0/0", "author": "scompto"}, {"rating": 5.0, "review": "Great media device, works well. Turns off automatically when not in use. Bought an extra one for different spots in the house,", "verified": true, "helpfulness": "0/0", "author": "Eric G"}, {"rating": 5.0, "review": "I was skeptical on the Fire TV for my needs due to the price.  The Fire TV stick sure does deliver at a more than fair price tag.  My only gripe on the newer devices is the lack of Infrared Support.  I believe in this case it's my fault for not staying with the times.The Fire TV Stick is fast and speedy.  You can also restart the device with out unplugging it like other set top boxes that are in this category.  Simply hold the center button and the play button for a few seconds.  An instant restart for optimal performance!", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 4.0, "review": "great product, does what is expected, two problems I have with it:  buttons to close together , and lettering (font size) to small,", "verified": true, "helpfulness": "1/1", "author": "bsgabriele"}, {"rating": 5.0, "review": "Well thought out product. Extension came in handy to connect to my TV. No need to buy smart tv.", "verified": true, "helpfulness": "1/1", "author": "4man"}, {"rating": 5.0, "review": "The product works very well.  I was just a little disappointed in how many programs I still have to pay for despite being a Prime member.", "verified": true, "helpfulness": "1/1", "author": "ajafk"}, {"rating": 5.0, "review": "I have 3 rokus and a micro pc that I have been using for quite some time, I purchased this unit because of the unbeatable price and better specs. The stick performs well and has bonus features like device screen mirroring which can only be found in the newer 3 times the price Rokus. My only complaint would be is the remote is so small I have already lost it several times.", "verified": true, "helpfulness": "1/1", "author": "Nolan Rice"}, {"rating": 5.0, "review": "It cuts off frequently. I have done everything advised and the router is right beside of the tv.  Update:  After contacting Amazon,  the technician was able to solve my issues and I am now 100% happy with the fire stick!", "verified": true, "helpfulness": "1/1", "author": "nicki"}]