[{"rating": 5.0, "review": "We had no idea what to expect and we LOVE it! We have had Amazon Prime for years and when they added the movies & TV shows we used our Wii to watch. This is so much easier and the Pandora app we are loving!", "verified": true, "helpfulness": "0/0", "author": "Susan Sharples"}, {"rating": 5.0, "review": "Love it. I actually have one attached to my bedroom TV and I have another one attached to my projector(has an HDMI MHL port) in the living room.", "verified": true, "helpfulness": "0/0", "author": "Joshua Teitelbaum"}, {"rating": 5.0, "review": "Fire stick is awesome i love it. I take it with me to work to help me get through those long overnight shifts.", "verified": true, "helpfulness": "0/0", "author": "Tee"}, {"rating": 5.0, "review": "This thing kicks ass", "verified": true, "helpfulness": "0/0", "author": "Brett Gallegos"}, {"rating": 4.0, "review": "I absolutely love it. It was so easy to install and I've been able to view my prime movies on  the tv  rather than on the pc. I probably will not use it for much else even thought the capabilities are there but just happy to watch movies on the larger screen. I have only one complaint and that is the remote. It was super difficult to get the back off to install the batteries. I finally took it to a local store for help and the clerk said she had the same problem with hers. She finally got it pried off and it is working fine and is very easy to use. I hope that when it needs batteries again,  It doesn't give me the same trouble. They should certainly look into this and remedy the problem.", "verified": true, "helpfulness": "0/0", "author": "Shirley A. Bush"}, {"rating": 4.0, "review": "I absolutely love my fire stick for the performance it gives. The only reason I personally give it a 4 is because of the setup of it. I am not a prime member and being that I love Amazon's products doesn't necessarily mean I will want the whole \"Prime\" package. I have kids who are fortunately tech savvy, more than me. But they managed to get a hold of the remote and found of all things a movie they saw being advertised as Prime and signed me up for prime. It happened innocently a few times,  since they just wanted to watch the show they saw, but since I don't have a way to block them from actually going ahead and signing me up for prime I was forced to hide the remote (sometimes from myself). I did setup parental pin which didn't stop the sign up for prime. :(  It's the one thing I do not like about the fire stick. Overall, the performance and quality of this product is exceptional. Just wished it was setup kid and non prime member friendly.", "verified": true, "helpfulness": "0/0", "author": "B-Zmom"}, {"rating": 3.0, "review": "Overall I like it, but the most we get out of it is Netflix and the Prime movies. The other apps are lack luster with many of them requiring a code to your cable company (which we do not have). Glad to have gotten it on special, otherwise we probably wouldn't have bought it.", "verified": true, "helpfulness": "0/0", "author": "Carrie Rojas"}, {"rating": 3.0, "review": "Ok.  Not quite met the Hype expectations.  Easy to set up and use.  Still need cable-dish provider to see many shows.", "verified": true, "helpfulness": "0/0", "author": "G L B"}, {"rating": 5.0, "review": "easy to install", "verified": true, "helpfulness": "0/0", "author": "betty"}, {"rating": 5.0, "review": "One of the BEST investments I have made for a while. Great for my mother, who is ninety and can't see as well now. She can watch all the movies and tv shows we have on the kindle fire and the cloud with no problem seeing. Thank you so much.", "verified": true, "helpfulness": "0/0", "author": "Jane West"}]