[{"rating": 5.0, "review": "This is great. I do not even use the built in amazon app on my tv because this has better connection.The controller that came with it seemed to have issues so I suggest ordering the upgraded controller with the speech capability.Otherwise very cool.", "verified": true, "helpfulness": "0/0", "author": "G. Wolff \"Shadow\""}, {"rating": 4.0, "review": "Easy to install & use.", "verified": true, "helpfulness": "1/1", "author": "Sharon Stearns"}, {"rating": 5.0, "review": "I got on the waiting list when word came out about this tool, and was pleased to see that it would be arriving at my home earlier than expected.  It gives me a chance for my \"non intelligent\" tv to receive movies etc.  It is compact and I can move it around the house with little effort if I am going to be in a different room for a while.  What and smart thing technology has become!", "verified": true, "helpfulness": "0/0", "author": "Creative 1 \"Claymud\""}, {"rating": 4.0, "review": "WE HAVE ONLY HAD LIMITED USE ( due to travel ) BUT THE EXPERIENCE SO FAR HAS BEEN VERY GOOD. THERE ARE MANY FEATURES THAT WE HAVE NOT BEEN ABLE TO TRY . THE STICK WILL ALLOW US GREAT ENTERTAINMENT WITHOUT A BIG CABLE BILL WHILE STAYING IN OUR WINTER GETAWAY", "verified": true, "helpfulness": "1/1", "author": "Danny Lloyd"}, {"rating": 1.0, "review": "The unit only offers expensive choices and if I knew before that was the way it works I would not have ordered it.William Weiss", "verified": true, "helpfulness": "1/1", "author": "bill 3"}, {"rating": 2.0, "review": "I Can't seem to fix the problem. It doesn't connect to my wifi anymore.", "verified": true, "helpfulness": "0/1", "author": "VwrudeboyGli"}, {"rating": 1.0, "review": "Bought this over it's competitors because it said it was Miracast(TM) Certified. It's not, and Amazon knows it's not. It is Miracast compatible, but does not support all devices and therefore is not certified.I was a victim of false advertising, Amazon's bait and switch, which is sad because I've been such a big Amazon proponent in my circle of friends & family up until this point.", "verified": true, "helpfulness": "1/1", "author": "Adam Cloud \"CloudyOne\""}, {"rating": 3.0, "review": "Don't see alot of content with this that you don't have to pay for.  Guess I was kind of hoping for that.  Also YouTube and Pandora are nowhere to be found on the menu. At least I didn't spend a pile of money on it.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "I love this thing! Simple and effective way to upgrade my TV's smart TV system. So much better. And the fact that I can move it from TV to TV, bring it with me, etc. I love it.", "verified": true, "helpfulness": "0/0", "author": "Jeremy L. Smelski \"Jeremy\""}, {"rating": 4.0, "review": "Great Product. I replaced a Chromecast with this because I can watch Amazon Prime videos with this. I cannot with the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Paul Tippin"}]