[{"rating": 4.0, "review": "I gave my Roku to my son, so I got this for me.  This is a little quirky compared to Roku (although I've been watching Roku for a couple years, and like most people do not embrace change all that well).  It works fine, and you can get to where you're going, and it's maybe even better for Amazon prime video (no surprise since it's an amazon fire tv stick), but slightly more difficult to get to Netflix (which is where I spend half my time when watching streaming tv). On the plus side, it goes into stand-by mode and flips thru an amazing set of photos (from amazon), really beautiful photos-sometimes we just sit and watch those for 5 minutes, and also good for my plasma tv which doesnt like to be kept on the same screen for too long or it will \"burn-in\".  Overall, quite good but a star off for a little more difficulty to get to Netflix and the other little quirks.", "verified": true, "helpfulness": "0/0", "author": "William J. Doehnert \"Bill\""}, {"rating": 5.0, "review": "Does exactly what we wanted, for just a little bit of money. Turned our \"dumb\" TV into a \"smart\" one! With Amazon Prime there are lots of movie choices.", "verified": true, "helpfulness": "0/0", "author": "Leanne"}, {"rating": 5.0, "review": "It is easy to use and stream movies, the only bade thing isit took to long to get to me.", "verified": true, "helpfulness": "0/0", "author": "emad"}, {"rating": 4.0, "review": "Was able to install and operate all by myself, hoorah!!! Loved being able to watch Bosch on my TV screen, rather that computer. Have read Mr. Connelly's work for years and Harry is one of my favorite detectives.  Thank you for this invention.", "verified": true, "helpfulness": "0/0", "author": "susiereader"}, {"rating": 4.0, "review": "This was a gift.  Easy to install.  So far so good.", "verified": true, "helpfulness": "0/0", "author": "Mermaid \"Retired\""}, {"rating": 5.0, "review": "I had the chrome it was great for what it is used for I just felt that this was the next step up and I love it.", "verified": true, "helpfulness": "0/0", "author": "T. Hughes \"TyHughes\""}, {"rating": 4.0, "review": "Like the fact there are no commercials but either internet sucks but it did buffering a few times.", "verified": true, "helpfulness": "0/0", "author": "M. A. Brown"}, {"rating": 4.0, "review": "Works fantastic, way above my expectations!!", "verified": true, "helpfulness": "0/0", "author": "Christine De Vallee \"bookbandit\""}, {"rating": 5.0, "review": "The Fire TV stick has transformed the way I watch TV.  60% of all television now comes through the Fire TV stick.  This is a huge upgrade over the Apple TV I had a few years back.  Super fast processor allows you to rapidly browse and jump around to different apps and features.", "verified": true, "helpfulness": "0/0", "author": "McSizzle"}, {"rating": 5.0, "review": "Love this item! When I got it I couldn't wait to hook it up. Makes viewing my Amazon Prime and Netflix so easy. Way less effort to control compared to the Smart TV features on my Samsung. I also love the portability. I'll be taking this when I travel and hooking up at my hotel.", "verified": true, "helpfulness": "0/0", "author": "PAMELA L. SMITH"}]