[{"rating": 3.0, "review": "I have been pleased with the ease of setting up the Firestick. The shows are very quick, very little buffering. My main reason for ordering it was to be able to watch Amazon Prime on TV instead of my iPad.The downside is the available apps. I went to Amazon and started to download apps after I had downloaded all I wanted on the Firestick. Every app I chose stated not applicable with Firestick. Why? If these are Amazon apps why would they not all be applicable? This is very disappointing. We are debating stopping Dish services and going to a receiver and maybe HD inside antenna for local channels. Due to the app problem, we will probably go with Apple or Roku and not Amazon Firestick. My daughter has Apple and they have numerous apps on their TV.  Also another aggravation on Firestick is the way they list the Apps. They are cluttered and on Netflix you have to keep scrolling to the side to find a program whereas on my Blu-Ray DVD there are categories and it is much easier to find a show.  Very disappointed in apps but not in the performance so far. Overall I would purchase just for Amazon Prime due to it's price but if they want it to be competitive Amazon needs to make many improvements.", "verified": true, "helpfulness": "0/0", "author": "infoplease"}, {"rating": 1.0, "review": "I bought this months ago and am just using it now because the remote to my Roku is missing. I have been screwing around with it for 2hrs having used 6 different wifi connections. It will not connect, it errors out and says it can't \"connect to Amazon\" every time. This is a cable internet connection, 4 different wifi hotspots from three different carriers and a fiber optic connection and nothing. I even went in and got the IP and gateway addresses and tried to do it manually, still wont connect.My Roku was up and working within 3 minutes. I wish I had not waited so long to use it so I could have returned it. Do not waste your money, not worth the frustration.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It's still a bit glitchy,  but it's awesome.  I have to unplug it just about daily. And it gets angry with Netflix.  But I love it, it helps me be a better couch potato.Edit 4/29/15: super horrible glichtyness.  It's just awful,  every few minutes it pauses whatever I'm watching on Prime,  it's a bit better on Netflix. So I'm not sure what the deal is. I'm not sure if fire tv would be better,  but I'm becoming super annoyed by this gadget.", "verified": true, "helpfulness": "0/0", "author": "Emily"}, {"rating": 5.0, "review": "works great and great deal with prime", "verified": true, "helpfulness": "0/0", "author": "Double D"}, {"rating": 5.0, "review": "thanks", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love It!  Works well and i love that it's small and doesn't take up any space.  We use it for Amazon Prime and netfix.", "verified": true, "helpfulness": "0/0", "author": "Linda O'Grady"}, {"rating": 3.0, "review": "I liked cutting the cord from Cable TV, but I'm disappointed that the Fire Stick is so hard to Browse the internet with. In fact I've yet to figure out how. Maybe that neat 3rd party book \"How to get the Most from your Fire TV Stick\" could help.  I just think it's crummy Amazon doesn't care beyond the sale to help make it easier to navigate this thing. Speaking of navigating, have you ever noticed how lame and patched-up the Amazon webpage is, all kinds of hidden hyper-texts for the services and groups you really want to go. Some might get a charge out of digging through the thing like a hacker, I don't, the simplier the better.", "verified": true, "helpfulness": "0/0", "author": "Tom McSpadden"}, {"rating": 4.0, "review": "Works great on a non-smart tv. I already am a prime member and this just makes it that much better.", "verified": true, "helpfulness": "0/0", "author": "Chris G"}, {"rating": 1.0, "review": "It doesn't work correctly. It keeps saying there is no internet connection and when I check settins my signal is strong. Constantly rebuffering", "verified": true, "helpfulness": "0/0", "author": "Jeanette A. Turnbeaugh \"jeannet\""}, {"rating": 5.0, "review": "Love this thing!Plays all the things I want to with Netflix, Hulu Plus, and Amazon Prime Video!And with the support of Plex natively what more can I ask for!No lags, no issues, no thing.", "verified": true, "helpfulness": "0/0", "author": "Jason"}]