[{"rating": 4.0, "review": "WiFi can cause pauses while buffering. Videofiles may want the wired model for glitch free viewing. It has more channels than AppleTV but fewer than Roku. Nice integration with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "nms \"smithpac\""}, {"rating": 5.0, "review": "love it can watch my prime on my tv now", "verified": true, "helpfulness": "0/0", "author": "gary ferrell"}, {"rating": 4.0, "review": "I was lucky enough to get one of these for 20 bucks.  It gave me an incentive to buy it and try it.  That being said, so far I have been happy.  It is easy to use and is pretty small.  Reason for the 4 stars is the fact it needs to be plugged into the wall.  I have enough plugs in my wall already that I dont need to add another.  I am going to try to add a portable power supply to the back and see if that works.  Regardless, this is a pretty solid, easy to use item.  I have had no issues other then the first day when I couldnt get hulu or netflix to work.  They work now.I would say even at 40 bucks this is a pretty solid buy, you get a lot of channels and it works great with prime.", "verified": true, "helpfulness": "0/0", "author": "Chris W. \"mikeystoyz\""}, {"rating": 1.0, "review": "Doesn't work with my TV. Turns out it is not compatible. Thanks Amazon for nothing. Make sure your TV is compatible. The list is hard to find.http://www.amazon.com/gp/video/ontv/devices?ref_=pe_584750_33951330", "verified": true, "helpfulness": "3/4", "author": "Brent Elmore"}, {"rating": 3.0, "review": "To run smoothly, needs to set no higher than 720P and provides a 10W or more USB Power Adapter.", "verified": true, "helpfulness": "0/0", "author": "HUEY T WONG"}, {"rating": 5.0, "review": "Love it.  Really allows me to maximize my prime acct.  Plays much better than Netflix!", "verified": true, "helpfulness": "0/0", "author": "PAMELA JEAN BETZ"}, {"rating": 5.0, "review": "Impressive. Kids love the fact that they can play games too. can hook up at hotel tv if you travel and watch your favorite prime tv shows/movies.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"JS\""}, {"rating": 5.0, "review": "Easy to set up and it works like magic! Ok, it shows movies like it is suppose to.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 2.0, "review": "Two stars merely for the design. I liked the idea of having a dedicated prime instant video device. Unfortunately, this product falls way short in terms of usability. Ten to fifteen minutes of playback is all I can manage before it loses connection and/or buffers indefinitely. At $19 it hardly seems worth sending it back, hopefully a future update corrects the issues.", "verified": true, "helpfulness": "0/2", "author": "Scott R Blume"}, {"rating": 1.0, "review": "Would love to rate it, but I ordered it on Dec 5th and it's not supposed to be in until Jan 21st at the earliest!! I guess you could say not enough supply!!", "verified": false, "helpfulness": "0/4", "author": "Stephen Sutton"}]