[{"rating": 5.0, "review": "I bought the chromecast a few months ago and was not impressed with the quality. I think it is sure to the streaming from my HTC M8 phone, but my tablet and laptop faired no better. When I got this,I was surprised at the quality and way of use. Has CEC over HDMI so when I press a button on the remote, my stereo and tv change to the correct input like my hopper does from Dish. Would recommend, great price with easy setup and use.", "verified": true, "helpfulness": "0/0", "author": "Justin Baer"}, {"rating": 5.0, "review": "I got this for my birthday,from my daughter,it has changed my life,in the way i watch TV.Firestick gives me so many options with Movies,old TV shows,&documentries;,etc.I love it.", "verified": true, "helpfulness": "0/0", "author": "john mather"}, {"rating": 3.0, "review": "I received a Fire TV Stick as a gift from my son and his wife. I have DISH, and my son noticed that, whenever I visit, I'm watching recorded shows on my Kindle Fire HD, using my DISH Anywhere app. He was thinking that, if I plugged the Fire TV Stick into his TV, I would be able to watch my recorded shows on his TV, through the Fire TV Stick. I haven't yet discovered if this is possible or how to do it. It's obviously not as simple as tapping something on my Kindle. I've also had a problem with the screen freezing on me, when I'm watching Prime or Netflix on the Stick. I've had to unplug it and plug it back in, to get it to unfreeze. I don't know if this is a glitch with the Stick or with my router, but I don't have any freeze problems when I'm watching Prime or Netflix on my Kindle Fire HD.", "verified": true, "helpfulness": "0/0", "author": "T. Sloan \"T\""}, {"rating": 5.0, "review": "Easy to setup.  Small, so it is easy to hold & use.", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 5.0, "review": "Great selection with Prime no problems so far must use splitter if you have older TV with only 1 HDMI if using cable.", "verified": true, "helpfulness": "1/1", "author": "Bill"}, {"rating": 5.0, "review": "Fabulous product.  Works right out of the box.  We've now purchased 4 and wish we'd known about this product earlier.  You won't regret this purchase.", "verified": true, "helpfulness": "0/0", "author": "Gayl Talbert \"gayl\""}, {"rating": 5.0, "review": "Should have more free movies", "verified": true, "helpfulness": "0/0", "author": "Michelle E. Davis \"Michelle Davis\""}, {"rating": 5.0, "review": "Nice device. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "D. Borland"}, {"rating": 5.0, "review": "My husband loves his Fire stick (Christmas gift)", "verified": true, "helpfulness": "0/0", "author": "Monique M"}, {"rating": 5.0, "review": "Love it!  Must faster to maneuver than Chromecast or Apple TV.  Very impressed.", "verified": true, "helpfulness": "0/0", "author": "Allison W."}]