[{"rating": 1.0, "review": "I normally don't write reviews but this Fire TV stick is such a bad product that I decided share my review on this. I own both Google Cromecast and FireTV stick and is really frustrated with Fire Stick while comparatively older Cromecast is working just fine. FireTV is one of the worst products I used in my whole life.Cons:Hangs a lot and regularly disconnects from network for no reason. Since it does not have a off switch that I know, I have to unplug and restart it almost 2-3 times every day.Very slow and remote is ver very bad and is not very responsive.Does not operate on USB port which comes with TV and needs to plug in to wall...one more wire hanging out of my TV panel.Netflix app sucks ( sucks more) on Fire Stick, while Amazon Prime videos work flawlessly.Paid $20 for this piece of crap. I wish I should have purchased another chromecast for $5 more.Pros: You can watch Amazaon prime videosConclusion: One more crap product from Amazon after Fire phone.", "verified": true, "helpfulness": "1/2", "author": "Megha"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Judy St. Germain"}, {"rating": 1.0, "review": "I bought this as a gift and my mother has had endless trouble because it fails to work and constantly prompts her to renter her password for her router which is a nuisance and it doesn't work even after she enters it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have an Apple TV but I love all things Amazon and I wanted to watch Prime Instant Video on my television. I flip flopped between the Fire TV Stick and the more expensive Fire TV. I eventually landed on the stick thinking it would be portable enough to move from room to room.It's not *as* portable as I'd hoped. I was expecting simply a stick plugged into the USB (like Chromecast). If I had just read the description prior to ordering, I'd have known that it also needs to be plugged into an outlet. Still, this is not an issue. I can still take it from room to room with only a little annoyance. (Seriously? These are the things I can find to complain about?)I have only had a connectivity issue once and it was easily resolved with a reboot. The interface is super easy to use and finding what I'm looking for can be done quickly. As an odd aside, I'll add that I like the little chubby remote much better than Apple's slick silver \"always lost\" remote.All in all, I think this is a must have ESPECIALLY for Prime subscribers.", "verified": true, "helpfulness": "0/0", "author": "Kimberley Littleton"}, {"rating": 3.0, "review": "Seems the fire stick freezes up frequently. I don't know if I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Mr. Michael S. Blaszak"}, {"rating": 5.0, "review": "5 Minute setup and worked great from the start! I can't wait to try more of the apps. I have used it with Netflix and Youtube. For the price, you can't beat it!", "verified": true, "helpfulness": "0/0", "author": "jessesgirl1212"}, {"rating": 5.0, "review": "So awesome you can easily travel with it and you just plug it right in and go. Very easy to understand!", "verified": true, "helpfulness": "0/0", "author": "luv2bcaitlin"}, {"rating": 2.0, "review": "I was really waiting for the fire stick so I could mirror from my kindle like I did w/ my Apple TV. What they fail to mention is that is will only mirror with the Kindle HDX and hire. I have a Kindle Fire HD 8.9 and cannot mirror from my device. There should at the VERY LEAST be an app available or a device update that will allow mirroring capabilities. HUGE MISS for Amazon. I'm EXTREMELY disappointed.", "verified": true, "helpfulness": "0/0", "author": "Kori Adams"}, {"rating": 4.0, "review": "WatchEspn doesn't stream well for me, so I use my Chromecast instead for watching games.  Other content seems to stream pretty well.", "verified": true, "helpfulness": "0/0", "author": "Matthew H. Walker"}, {"rating": 3.0, "review": "I just wanted to get a small, affordable \"smart TV\" box for the TV in my bedroom and didn't want to drop $100 on another Apple TV (the best TV box on the market). This is just okay. It's slow, and I find myself having to unplug it and replug it back in every single time I want to watch it because none of the apps function unless I do so (despite my network connection being \"very good\"). It also takes about a minute or so for the picture to come into full HD. For the price it's a pretty acceptable device, but if you can afford the Apple TV, I recommend getting that instead.", "verified": true, "helpfulness": "0/0", "author": "aud"}]