[{"rating": 4.0, "review": "So far, so good. Fire TV stick has its quorts however. In the beginning we noticed a lot of video delay, but that seems to have gotten a lot better and I wonder if Amazon through its updates has been fixing the delay problem?So, it's Fire TV Stick for us now, we've stopped paying for Microsoft Live streaming through the Xbox system", "verified": true, "helpfulness": "0/0", "author": "Edward F. Avila"}, {"rating": 5.0, "review": "It's cool", "verified": true, "helpfulness": "0/0", "author": "Nestor D. Pineda"}, {"rating": 2.0, "review": "So disappointed. The interface is great, if it just worked all the time. I have a friend who has the Fire TV and loves it. He bought two of these when I bought my one, and we are having similar issues. The HDTV that my Fire TV Stick is connected to is less than 10 feet from my wireless router, and it constantly loses connectivity, and/or tells me it is connected with errors. It doesn't matter if I am watching Amazon content, or content through an app such as Netflix. The remote consistently acts goofy, moving 25 items to one direction or another when I just press it once. I know that the Fire TV works, I have seen it, but I am very disappointed with the lack of quality control with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Jason W. Welty \"Jason\""}, {"rating": 4.0, "review": "Have this and the Chromecast connected. Fire Stick gets used more than the Cast. Menu is really easy to navigate. Need the game controller for most games. Easy to connect and watch right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Kevin Dale"}, {"rating": 2.0, "review": "This would be a great product except for the fact it continually drops the WiFi network.  My laptop, Ipad, HTC one, and wife's PC have no issues running on the network.  There are a lot of blog comments regarding this issue so it seems like a problem on all Fire Sticks not just mine.  Hopefully Amazon can fix what is wrong with the Fire Stick and connectivity issues.", "verified": true, "helpfulness": "2/2", "author": "Brandon M."}, {"rating": 5.0, "review": "I have been a advocate of ROKU for several years.  But as a Prime member, I decided to try the Fire Stick and I couldn't be happier!  The remote s super light and easy to use.  We needed to get used to the way the screen looked (after viewing the ROKU for so long) but we quickly adapted.  The best feature is the screen saver!! LOVE to watch the beautiful landscapes!", "verified": true, "helpfulness": "0/0", "author": "Debra L. Jensen"}, {"rating": 5.0, "review": "Easy to install and we were very happy with how easy it was to watch movies.", "verified": true, "helpfulness": "0/0", "author": "Maryann"}, {"rating": 1.0, "review": "Changing my review. Unless you are next to your router you get next to no service. Running 30 mbps through a Linksys 1200+ there is no reason I should have such poor service one room away. Worked decently when the router was next to the TV but decided to move some furniture around and the one room difference stopped my fire stick from being able to run anything. Have been able to connect with my phone, tablet, and PS4 from the same location as the fire stick but still absolutely nothing. Not worth the money.", "verified": true, "helpfulness": "0/0", "author": "Jason Chapple"}, {"rating": 4.0, "review": "Just got this little thing and I'm so amazed at the features and how fast it performs but the real gem is side loading feature. I use the apps2fire app on my tablet to sideload feature onto it instead of the PC companion because to me its easier and faster. Just being able to add my android apps such as chrome, kodi, youtube,etc makes this the ultimate media streaming device. I just ordered the set top box because I was so impressed with the fire stick, I CANT WAIT!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Alan Parrish"}, {"rating": 2.0, "review": "I purchased the Fire Stick to mirror my Kindle Fire HD to a television screen.  It is not able to do this.  It will mirror my Android smart phone but does not support this for Amazon's own Kindle Fire HD.", "verified": true, "helpfulness": "3/3", "author": "Terri Fletcher"}]