[{"rating": 5.0, "review": "Simply Amazing.", "verified": true, "helpfulness": "0/2", "author": "Michael Uryasz"}, {"rating": 5.0, "review": "Great product, fast delivery!", "verified": true, "helpfulness": "0/2", "author": "B. Jacobs"}, {"rating": 4.0, "review": "Overall great product. I've tried a couple of other streaming devices and this is by far my favorite. Really easy to use and appealing interface. I also love that I can control it from my phone which is really convenient  (especially when I misplace the remote). Voice search works great. Only issue I've noticed is that while searching in certain areas it doesn't allow you to use the keyboard on the phone app", "verified": true, "helpfulness": "0/2", "author": "Dylan"}, {"rating": 4.0, "review": "I absolutely love mine ! Easy set up !!!Only issue is that I cannot log into my Netflix account :-( would anyone know how to do that ? I was able to log into pandora and amazon prime.That's the only reason I did not give this a 5 rating , because other than Netflix issue it's amazing and well worth the money", "verified": false, "helpfulness": "0/1", "author": "Lisa Braden"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "bobromines"}, {"rating": 4.0, "review": "The Fire TV Stick works very well. The picture quality is wonderful and the ease of installation had the Fire TV Stick up and running in under 5 minutes. My only complaint is the inability to add certain channels. I have a subscription to a network, but although I can search for the network using the Fire TV Stick, there are only options to purchase, not sign in. I did enjoy the ability to listen to my Amazon music selection through the TV. I also have Chromecast and the separate remote is a definite plus. The Fire TV Stick immediately was available from my phone and the streaming quality of the device  is a pleasure to watch. I'm sure as the device goes through a few minor updates, I will be able to give it a full five star rating. Right now it has a nice blend of features from many devices already on the market and is worth purchasing.", "verified": true, "helpfulness": "0/1", "author": "S"}, {"rating": 5.0, "review": "Small and simple to operate with an intuitive menu design. Have not had any problems streaming HD video on it from Netflix or Amazon", "verified": false, "helpfulness": "0/1", "author": "Spike Spiegel"}, {"rating": 5.0, "review": "Wonderful. Easy to set up and lots of entertainment options.  Worth the price!", "verified": true, "helpfulness": "0/1", "author": "marie donlon"}, {"rating": 5.0, "review": "Love It!!!", "verified": true, "helpfulness": "0/1", "author": "Angela Watkins"}, {"rating": 3.0, "review": "If you have a tv that hangs on the wall please note their is a power supply cord that ruins the setup that the ad and commercial fails to mention that where it looks like a plugin to hdmi and it will work on its own not the case.", "verified": true, "helpfulness": "2/2", "author": "Jeremy M"}]