[{"rating": 4.0, "review": "Love having a remote & all the apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good qualities and a great seller.", "verified": true, "helpfulness": "0/0", "author": "Deon Davis"}, {"rating": 5.0, "review": "Love Love Love the Amazon Fire TV stick.  Not only can I watch Amazon Prime movies, videos, TV shows, etc.  I can listen to music and view my pictures (and create slide shows for friends to view).  I'm extremely happy with it!", "verified": true, "helpfulness": "0/0", "author": "Venus Alyea"}, {"rating": 4.0, "review": "Easy to setup and the menus are user friendly. The remote works good. It would be nice to have a few more free programs to choose from", "verified": true, "helpfulness": "0/0", "author": "Fjeld"}, {"rating": 3.0, "review": "It works fine when close to the wifi source, but doesn't work very far away.  I tried to use it in the bedroom, where my Kindle does fine, and it does not pick up the wifi signal.", "verified": true, "helpfulness": "0/0", "author": "David W."}, {"rating": 5.0, "review": "I love it!... Still getting acquainted but so far so good.", "verified": true, "helpfulness": "0/0", "author": "Camille Tong"}, {"rating": 4.0, "review": "Love it, But To whatch hulu plus you have to Pay even The primer, should offer the free hulu app, like Apple TV.", "verified": true, "helpfulness": "0/0", "author": "silvania pimentel"}, {"rating": 5.0, "review": "Easy, quick setup and navigation. Fast streaming ends interruptions of programs we watch which was a constant frustration with the old app we had been using on our bluray player to access Netflix and other content. The video quality of content is much better as well. It was a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Ronald Peterson \"Author\""}, {"rating": 3.0, "review": "I bought the fire stick, It worked for one month and suddenly stopped. I called up customer support and they was not able to help and had me on the phone for over 30 minutes, They eventually said that they don't know the problem and will have to do a follow-up call. Five days later there is no call so I return a call. I waited approximately 15 minutes and the person finally process a replacement and I have to return the old one. The fire stick is under warranty so they should have taken it back if they did not know the problem and I should not have to wait a whole week and make a second call.The product worked great when it was working. The only thing that sucks is the customer service", "verified": true, "helpfulness": "0/0", "author": "Aaron Maharaj"}, {"rating": 2.0, "review": "The remote only worked for a couple of days. Put in new batteries; still didn't work.", "verified": true, "helpfulness": "0/0", "author": "Martha Lowe"}]