[{"rating": 4.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Eric J Walker"}, {"rating": 5.0, "review": "Easy to set up. Love that I can screen mirror from my Note 4.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I have only had it less than a week but it good except on occasion it will freeze and shut off.", "verified": true, "helpfulness": "0/0", "author": "Molly P"}, {"rating": 5.0, "review": "It was easy to set up and I've been using it for a week and love it!", "verified": true, "helpfulness": "0/0", "author": "Jodi Hogue"}, {"rating": 4.0, "review": "The device came as stated. It works just fine. A couple gripes I have with it.The UI is very cluttered. It needs to be more simplified in my opinion. It's not that it makes it hard to use, it's just too much on the screen at once.I have an Amazon Echo and it would be nice if it was integrated with it or the Amazon voice remote.I'm not sure if this is possible but being able to use a Bluetooth speaker with it would be great as well.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "My daughter loves it, as well as I. I've ran into a few issues, but would recommend this to others. My mom has never had issues with hers. I can't seem to find a couple games my mom has that my daughter loves and we searched the whole app store for them.. Prime membership is pricey, but a huge plus bc of the tv shows and movies you get access to.", "verified": true, "helpfulness": "0/0", "author": "Casey"}, {"rating": 2.0, "review": "I wasn't aware that everything available on Amazon firestick had to be purchased, and there is no app for any sort of browser, difficult to use.", "verified": true, "helpfulness": "0/0", "author": "Amy Zukowski"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Emanuel Done"}, {"rating": 5.0, "review": "Purchased on Amazon Black Friday for a discount price and really enjoy the system. Perfect for my team that only has local channels without cable. Just know this needs to be plugged into the wall to work & I hate cables running behind a mounted flat screen so it look at little time to hide the cable.", "verified": true, "helpfulness": "0/0", "author": "kristen"}, {"rating": 3.0, "review": "Good for streaming, was able to give my daughter back her Xbox.", "verified": true, "helpfulness": "0/0", "author": "carla hees"}]