[{"rating": 5.0, "review": "These sticks are excellent..", "verified": true, "helpfulness": "0/0", "author": "Master Drue \"Drue\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Wevo"}, {"rating": 5.0, "review": "It meets all expections and for the price it is really good and my grandkids really enjoy it", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 3.0, "review": "This stick functions very similar to the box, which I love and will never be out again. The stick however fails to compare. The services are the same, however the stick its self often needs to be plugged and unplugged several times for reason before we can get it to work and its only a few weeks old.I'm not sure if this is a defective stick or an issue others have experienced. We use the box in the living room and thought the stick would be a good option for our bedroom but so far it has been frustrating to get to function.Once functioning its got everything I would expect from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Love ours! =)", "verified": true, "helpfulness": "0/0", "author": "Lisa Harrod"}, {"rating": 5.0, "review": "So good! I replaced my cable with all these lovely programming options- so far so good! So much easier to use than some of the things out there. Great remote, easy to set up, walks your through the process.", "verified": true, "helpfulness": "0/0", "author": "Jessica Leedy"}, {"rating": 5.0, "review": "Very satisfactory product. Works fast & just as we expected. Easy to install & operate", "verified": true, "helpfulness": "0/0", "author": "courtenay stringer"}, {"rating": 3.0, "review": "It is a great little gadget for the money but it gets warm and starts freezing up. You have to unplug it for a bit until it cools down. Very annoying but what do you expect for $40?", "verified": true, "helpfulness": "0/0", "author": "ddem"}, {"rating": 3.0, "review": "I subscribe to Comedy Central in my Verizon FIOS setup.  My Roku 3 gets FREE past episodes of Comedy Central, but my Amazon Fire Stick only gets pay-per-view Comedy Central past episodes. When I tuned to Comedy Central on the Roku, it went to a screen giving me a code number to put on the computer.  Then, it simply worked for free.  When I tuned to it on the Fire Stick, it just went to episodes for about $2.99 each, no code number.Does anyone have an answer?", "verified": true, "helpfulness": "0/0", "author": "Janie \"janie100\""}, {"rating": 3.0, "review": "At first I liked it but I noticed a possible bug. Video playback via a service like Netflix is sometimes just not right. The video feed will often freeze and then go into turbo speed mode. The issue is not with my FiOS bandwidth because I have their absolute fastest speed which surpasses many households. The issue is with the unit. I have tried troubleshooting the product and even reset the item to factory default. It helped a little but still experience problems. The item is a first generation and I think it is a known problem. Maybe the kinks will be worked out in generation 2.", "verified": true, "helpfulness": "0/0", "author": "straightforward"}]