[{"rating": 5.0, "review": "Awesome Christmas gift from familyLove the options but one issue. There were no connection instructions until got it connected. To late then", "verified": true, "helpfulness": "0/0", "author": "Pamela Thomas"}, {"rating": 5.0, "review": "Works as advertised. Fortunately my USB port is able to power the Firestick.  That makes a neat installation.", "verified": true, "helpfulness": "0/0", "author": "Glenn Rosbrook"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Zoe"}, {"rating": 5.0, "review": "I bought 2 of them for my children. They love it. Each have different tastes, so they are not arguing anymore about what movie to watch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Michael Hall"}, {"rating": 5.0, "review": "Great to directly watch prime video in tv. No need to open my computer.", "verified": true, "helpfulness": "0/0", "author": "Roy"}, {"rating": 2.0, "review": "As many have said, the connection to WIFI is weak. We have a powerful router and the Apple TV, which is next to the Fire, works perfectly.", "verified": true, "helpfulness": "0/1", "author": "DC \"DC\""}, {"rating": 4.0, "review": "It works well for netflix and amazon instant videos, although I bought it to watch HBO GO.HBO is currently NOT SUPPORTED if you use COMCAST XFINITY. Other providers are okay and get a pass. I blame this on comcast, not the fire stick..", "verified": true, "helpfulness": "0/0", "author": "Mats"}, {"rating": 1.0, "review": "Not really", "verified": true, "helpfulness": "0/2", "author": "torvette"}, {"rating": 3.0, "review": "The fire stick is extremely easy to install and set up so that is a HUGE POSITIVE. I love that I do not have a lot hardware or wires around my TV as the Fire Stick just plugs into your TV.My Fire Stick arrived early and in little package (less waste).The only reason I give it three stars is because my show or movie will occasionally freezes but sound keeps going than the image will \"catch up\" to the audio and the characters will move in a fast forward speed. I have the highest internet service offered so I don't know why it lags.My sister experienced the same problem. She couldn't take the freeze/lag anymore and passed her fire stick down to another sibling, who does not mind it.", "verified": true, "helpfulness": "0/0", "author": "Frances"}]