[{"rating": 4.0, "review": "I am pleased with my Amazon Fire TV Stick.  Have set it up for Amazon Prime, Netflix and music and it works great.  No more connecting audio and video cables to our TV so we can view movies on a larger screen.  Had a few problems with the setup, but I figured them out.  Perhaps the instructions should be clarified, but overall, it works great.", "verified": true, "helpfulness": "0/0", "author": "Suzie Stover"}, {"rating": 4.0, "review": "Great device except don't do the prime trial they charged us twice and we didn't even subscribe to that.", "verified": true, "helpfulness": "0/0", "author": "Raymanda Wachowski"}, {"rating": 4.0, "review": "I have had the fire stick for 1 week. I think it is absolutely great. The fire stick puts chromcast to shame.", "verified": true, "helpfulness": "0/0", "author": "Melissa S."}, {"rating": 1.0, "review": "Work the first couple times I used it.  Will not connect with Wifi.  I have unplug routers still will not work.  I have unplug firestick and still does not reset.  My router only  5 feet away.  My computers and tablets all work off this router.  Very disappointed in firestick.!", "verified": true, "helpfulness": "1/1", "author": "Rita Herrbert"}, {"rating": 3.0, "review": "Not a bad cheap intro to the world of streaming, but I find this stick has a hard time decoding as the quality of my picture is lacking (sometimes pixelated, struggling to keep up, etc).  I ditched cable years ago and have 3 Rokus (2 old Roku 2s and one Roku 3) and those boxes have rarely had an issue and have streamed Netflix, Plex, etc very well.  The Firestick image quality streaming Plex is noticeably worse than even my old Roku 2s (not to mention I had to pay $5 to get the Plex app, disappointing).  It's not the router or cable internet speed, as that has never been a problem with any of the other devices.  I've tried different configs but no change.  I got the Firestick just to see how it stacks up and since I'm a Prime customer I wanted a device more integrated with Prime, for that it's ok ... but it falls short of even my 4 year old Roku 2s...", "verified": true, "helpfulness": "0/0", "author": "jvestontheset"}, {"rating": 4.0, "review": "*** UPDATE : 05/08/2015 ***AMAZON,Please note below finding for your technical support and possible resolution with future updates on Fire TV Stick.My rating of this device has been upgraded to 4 stars from 3 stars. You can refer to my \"Initial Impression...\" for what I think of the device other than this update.The reason for my revision is because I've found the reason for the frame rate drop when playing YouTube and Vevo videos. When you first launch streaming service such as YouTube, you may encounter an option to adjust your screen output. This is due to overscan that typically happens with video output from HDMI. Which means you will have an option to shrink video size to fit the HDTV you have. If you do this, you will get video output that fills the screen without any cropping. This seems to come at a cost with Fire TV Stick because when scaling takes place, frame rate drops. Maybe this is due to overload on internal processor since it has to process HD video and scale it slightly for proper output. Whatever the case, as of today, I can confirm that my video output from YouTube and Vevo has been buttery smooth without any scaling most of the time and this in turn upgrades my rating from 3 stars to 4. HD video still stutter time to time and I would stay this is an issue with the device. I still do, however, have frame rate issue with scaling turned on but I can live with slight cropping of video output.- Initial Impression and ReviewOverall, the product works great and casual users of Neflix and Amazon Prime will appreciate snappy response of the device. Below are details that I've noticed while using the device.- The remote feels a bit cheap and light but functions very well. Maybe I appreciate Roku remotes more.- Sometimes one press of button registers as multiple inputs so when I push right once to browse, it will pass through several selections. It happens more often than I'd like and it can be annoying.- I get inconsistent frame rate on YouTube and Vevo apps. Audio is fine but video gets choppy and seems like it's dropping frame rate. It is confirmed on two different Amazon Fire TV Sticks. I do not experience this on PS4 nor old Rokus.- Amazon Prime centric home page is irritating. I am not a fan of Prime and I could careless of clutter that is Amazon Prime on my screen.- I have quite a few games on my cloud, Android games, but they do not show on my Games and Apps options. Perhaps Android version of the product isn't compatible.I hope future updates will address some of issues addressed here as the product has potential to be great.", "verified": true, "helpfulness": "1/1", "author": "YH Shon"}, {"rating": 5.0, "review": "Yes, it did!!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Super product, especially if you have Prime - which is really a no-brainer, especially if you've been sucked into their world.  Seriously, Amazon for many people is really a very good go to place.  I especially find the reviews useful (with cautions, of course), plus the prices are generally very good, the shipping is the best, and returns are dead simple.  (I wish I could say they're paying me to say this, but it's really all true).", "verified": true, "helpfulness": "0/0", "author": "evitisop weiver rekcats \"someone blessed\""}, {"rating": 5.0, "review": "I really like this Fire TV Stick - I don't use it very often, but it was easily set up and very user friendly.  A few of my new favorite shows are not available on Amazon, but overall I have enjoyed this product.", "verified": true, "helpfulness": "0/0", "author": "Cathy Haynes"}, {"rating": 5.0, "review": "love it!!!", "verified": true, "helpfulness": "0/0", "author": "shirley vanscoyk"}]