[{"rating": 4.0, "review": "I would recommend this to a friend", "verified": true, "helpfulness": "0/0", "author": "Jean M. \"Jean Miller\""}, {"rating": 2.0, "review": "I wanted to love the Fire Stick, but I am disappointed.  Out of the box, the remote was hard to open.  Once I plugged it into the TV the quality of video playback was not good. I checked the settings to ensure they were set to the highest quality, but it still looked like SD not HD. I tried it on two different TVs with the same result.  I did not use the fire stick for 3 days and then when I finally went to try to use it again, the remote lagged behind my button presses almost an entire minute. I was unable to play any videos because the remote was almost useless.  I may have just received a bad unit, but it is going back to Amazon.", "verified": true, "helpfulness": "1/2", "author": "Madame La"}, {"rating": 5.0, "review": "On par with my Apple TV, at a cheaper cost point. Wish it had the MLS Live app.  Hopefully more apps will be added.", "verified": true, "helpfulness": "0/1", "author": "Howard Daffin"}, {"rating": 5.0, "review": "So far, so good. The video and audio are excellent. My concern was the streaming. We have a mid-level DSL speed service and there has been absolutely no buffering at all. My wife says the \"heck\" with Redbox!", "verified": true, "helpfulness": "1/1", "author": "H"}, {"rating": 5.0, "review": "Love that it comes with a remote. I'm giving one to my mama and she doesn't have a smart phone so this is great for her!", "verified": true, "helpfulness": "0/0", "author": "sumrniam"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "RIKKI CHILDS"}, {"rating": 5.0, "review": "amazing product!", "verified": true, "helpfulness": "0/0", "author": "Daniel Hussey"}, {"rating": 5.0, "review": "This Fire TV Stick is awesome. My only regret is that I  didn't purchase  2. Good  product!!", "verified": true, "helpfulness": "0/0", "author": "Glenda Hunt-Wright"}, {"rating": 5.0, "review": "So far I love it!", "verified": true, "helpfulness": "0/0", "author": "Katie Lewandowski"}, {"rating": 4.0, "review": "Love this unit.  the only problem I've had is that it will drop my wifi occasionally requiring me to unplug the power to restart it.  Wish there was a software boot option (not just the reset option which removes all settings).", "verified": true, "helpfulness": "1/1", "author": "Keith Salisbury"}]