[{"rating": 3.0, "review": "Fire Stick is currently not compatible with my cable providor, Charter, which is kind of frustrating since they are a major provider, so I've really only been able to use it for Netflix. The home screen takes some getting used to, you seem to have to do a lot of button clicking to find your favorite apps. These should be more easily accessible, or at the top of your home screen. The free games are a nice touch. Since my cable provider is not listed, my 8 year old and I have spend a lot of time playing games. Overall, not a bad deal for the price.", "verified": true, "helpfulness": "0/1", "author": "Kiel Lewandowski"}, {"rating": 5.0, "review": "Awesome since we cut the cord", "verified": true, "helpfulness": "0/1", "author": "Kimberly"}, {"rating": 1.0, "review": "I have to admit I'm very disappointed with this product. When I watch Netflix on it, the picture freezes periodically but the sound keeps going. Also when I am watching Netflix it will sometimes stop and go back to the home screen without me pushing any buttons on the remote. Also when trying to navigate on the home screen, the screen also freezes or is really slow doing what it is supposed to do. I know it's not my internet connection because when I try to do the same stuff on my PS3 it never happens. The only reason I bought this is b cause my PS3 is old and makes a really loud humming sound. I wanted to be able to watch Netflix or Amazon prime without having to use the PS3. The Fire stick worked good the first day and now I cannot even watch Netflix because it keeps skipping back to the home page. Very very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Chris Acevedo"}, {"rating": 5.0, "review": "Super fast and very satisfied with the Fire TV stick. I will be purchasing another one as soon as they have another deal such as Prime day. :-)", "verified": true, "helpfulness": "0/1", "author": "Juan Gonzalez"}, {"rating": 5.0, "review": "I KLOVE MY NEW FIRE STICK, SO EASY TO INSTALL AND USE, WILL BE BUYING MORE FOR OTHER ROOMS IN MY HOUSE!!!!", "verified": true, "helpfulness": "0/1", "author": "Amy"}, {"rating": 4.0, "review": "I like it but at the beginning of everything it cuts out for about two seconds! Can be very inconvenient!", "verified": true, "helpfulness": "0/1", "author": "katherine Ehrisman"}, {"rating": 5.0, "review": "I LOVE MY FIRESTICK!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/1", "author": "Robert C Resendes"}, {"rating": 4.0, "review": "Overall a good device. Randomly will not connect to Internet even though it's right next to it. Overall well worth the money.", "verified": true, "helpfulness": "0/1", "author": "Guessohw"}, {"rating": 5.0, "review": "Great product. Easy to set up. Variety and options are great!", "verified": true, "helpfulness": "0/1", "author": "robert reyna"}]