[{"rating": 5.0, "review": "very good but i want the bundle when it comes back in stock", "verified": false, "helpfulness": "0/0", "author": "louay Jabbar"}, {"rating": 2.0, "review": "The device works well but the content available is too small and has little that i care to watch", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product - works just as advertised!", "verified": true, "helpfulness": "0/0", "author": "mphilb"}, {"rating": 4.0, "review": "Great purchase!  We love it!", "verified": true, "helpfulness": "0/0", "author": "artist739642"}, {"rating": 1.0, "review": "The video content did not meet my expectation. It stands not even close to what Netflix has. Amazon need to get more content online.", "verified": true, "helpfulness": "0/0", "author": "Puneet Agrawal"}, {"rating": 5.0, "review": "Simple, great product at the right price.  My only gripe is the motion picture library is not brilliant.  I'd be prepared to pay an annual premium on my Prime membership (Prime Plus?) to get access to more recent popular releases.", "verified": true, "helpfulness": "0/0", "author": "David P"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Bobby"}, {"rating": 5.0, "review": "Great product for mobile use.  I prefer the regular Fire TV for permanent installations such as home.  I prefer the Fire TV Stick when I'm traveling.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 1.0, "review": "It works well, but it pisses me off that amazon refuses to allow us to use our Prime Video on Chromecast.", "verified": true, "helpfulness": "0/0", "author": "C. Azzam"}, {"rating": 5.0, "review": "Fire TV Stick has done what Roku could not.  It has made me a streaming fool.  I have a Roku 3 and have never stayed glued to the tube like I have with Fire TV Stick.  I have been on Prime Video constantly since it arrived.  Great product.  Great interface.  Smooth streaming.  Love it.", "verified": true, "helpfulness": "1/1", "author": "Chad Gaines \"Blender\""}]