[{"rating": 5.0, "review": "It was super easy to set-up.. Maybe 5 minutes and I was ready to watch TV. Absolutely love this thing. Hulu Plus is an app on it and totally worth the $7.99 a month fee. I tell everyone about this thing.", "verified": true, "helpfulness": "0/0", "author": "Debby Phillips"}, {"rating": 5.0, "review": "This is a great addition to have. I love that I can listen to music, enjoy new show series, and show off pictures on my TV for family to enjoy. I love it!", "verified": true, "helpfulness": "0/0", "author": "Lexy"}, {"rating": 5.0, "review": "Great product...all I expected plus some!", "verified": true, "helpfulness": "0/0", "author": "Brad Darby"}, {"rating": 5.0, "review": "I love the fire stick and I have recommended it so many of my friends who are still paying extremely high prices for cable. Love it!!", "verified": true, "helpfulness": "0/0", "author": "Diane L. Robinson"}, {"rating": 5.0, "review": "Almost as valuable as the \"Mute\" button. Very nice product. Thanks!", "verified": false, "helpfulness": "0/0", "author": "Roger F. McGough"}, {"rating": 1.0, "review": "The device reports that it is receiving a strong signal but continually shows the circle of death while trying to watch a show or a movie on any of the apps. Not worth the money!", "verified": true, "helpfulness": "1/1", "author": "Sarah"}, {"rating": 4.0, "review": "I don't use my cable enough to keep paying the high prices, so I decided to get a fire stick and see if it would fit my needs. It does; a family member was concerned about local and national news availability, but there are even news channels on the fire stick. It's easy to transport, and I have ordered a second one. I already had a Netflix account, but getting another type of streaming program might be needed in the future, but for now I haven't run out of things to watch. Very diverse from Internet videos to PBS programming.", "verified": true, "helpfulness": "0/0", "author": "Sam_bio"}, {"rating": 4.0, "review": "After owning a Google Chromecast, as well as an AppleTv, and a Roku, I have to say I'm fairly impressed with the power this little stick packs.  For the cost of entry, it's a fantastic device, and interacts with the my Plex server flawlessly.  I was even able to get an app (for a very small fee) that allows me to AirPlay from my iPad, and there are some great games being developed for this platform.  Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "B. Willette \"Amazon Addict\""}, {"rating": 4.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Daddy X"}, {"rating": 5.0, "review": "A great price for a streaming device and so easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "Shirley Smith"}]