[{"rating": 2.0, "review": "FireTv stick, or how to ruin a good thing.first of all I am a Prime member and will continue to be even after experiencing the FT stick.The device is pretty welol designed , works fine with Amazon Prime video but that's where the positives end. I simply hate the way FT deals with apps. Can't find a way to place my favorites in an easy location,  maybe there is a way but it definitely not intuitive.I am mostly comparing this device with Roku 3 and to me it falls short in terms of U.I. and user friendliness. Another major minus is that FT stick has no app for iOS.  Like it or not Fire phone is not IPhone so I fail to understand why Amazon is dragging the release of the app for non Android phone users. I HATE having remotes on my table, I think a Harmony re one and the phone should be the only devices allowed, Roku understood this, they put an IR sensor and also made a superb app for their players available on BOTH android and iPhone.All in all the experience with FireTV in my case is subpar, Roku still delivers a better experience IMHO. Got the FireTv for only $20 but because it will stay in the drawer I can't say this was a deal. I hope someone from Amazon reads these reviews and get the idea that even if you have a good hardware if it's not backed up with apps you will fail. Also liste  to the unhappy users not the ones who maybe only use Prime video and or never had a better player.", "verified": true, "helpfulness": "0/0", "author": "Look30"}, {"rating": 4.0, "review": "I had a Roku (1st Gen) that needed updating even though it still worked. Got this when they had a sale for Prime members and just couldn't resist the low price. So far it's good, but I expected better.  I really liked the simplicity of the Roku home screen and this home screen just seems unnecessarily messy.  When I click on the Netflix icon I expect to have Netflix open and instead I have a second screen that opens up and asks if what I want is to open Netflix.  Maybe I just haven't figured out how it works.  Haven't tried it with Prime content yet although that content is on the home screen.  Can't really complain considering what I paid for it and that all of the apps (Netflix, Hulu, etc.) are the updated versions I didn't have on my old Roku.", "verified": true, "helpfulness": "0/0", "author": "shopaholicvc"}, {"rating": 1.0, "review": "I jumped on the $19 Amazon sale price, since I have Prime already and want to take advantage of the free Prime movie Streaming. While I awaited its arrival, I read the many 1 star reviews but hoped that I was going be among the many more 5 star reviews of people who have great luck with theirs. When it arrived finally, the setup was smooth and easy and the software interface fairly well done. For the first few uses, it seemed like we had avoided the problems.But then suddenly, videos would stop and the load icon would popup, get to 25% and stop. If I backed out of the video and restarted it sometimes it worked sometimes not. Then it started saying that it lost the server, lost connection, but if i went into the setup it always says that the WIFI connection if \"Very good\". Sometime, if i unplug and restart it, that works, sometimes not.The same thing happens with Netflix streaming. We also have an Apple TV and have immediately switched over to watching Netflix on it after the Stick stops playing and the Apple TV has played the exact same video perfectly.  We have 2 tablets, a laptop, and 2 iPhones that all connect to our WIFI network without any of the problems the Stick exhibits. I've contacted Amazon at least 4 times and they just keep saying that the problem has been referred to higher level support people.I am really hoping that Amazon fixes this soon, as the Stick has great potential at a fine price point. But, I would recommend waiting on purchasing one until Amazon fixes these bugs.Update: I still have heard nothing back from Amazon customer service since it was \"referred to higher level support\" But, I purchased an Apple Airport Extreme to provide more WIFI coverage in my home. As an experiment, I logged the Stick into the new WIFI network set up by the  Airport and like magic it is now working seamlessly - streaming well and not losing connections.  Apparently the trouble that some many people are having with the Stick is incompatibility with some WIFI network setups, makes or models. It explains why some people are having wonderful luck and others terrible experiences. Hopefully Amazon is going to release a software update that will fix this to common problem for too many buyers.", "verified": true, "helpfulness": "1/1", "author": "Eric T"}, {"rating": 5.0, "review": "Fire TV Stick is a really nice options for extra bedroom, travel, family get together, or compliment to the Amazon Fire TV. We used the Fire TV Stick for almost a month before gettting the Fire TV with great success. Either works great for main TV however, I would recommend Fire TV for main TV gaming. The Fire Stick is working great for the bedroom and when we travel. I would highly recommend the Fire Stick TV.", "verified": true, "helpfulness": "0/0", "author": "Cassandra Penn"}, {"rating": 5.0, "review": "I love this thing. It's an excellent source to rent movies on, play games, and use popular apps like netflix and amazon prime. We rent movies off Amazon all the time just because it's convenient.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 3.0, "review": "I tried to buy a movie using youtube on the Fire TV Stick because the movie was not available from Amazon Instant video. The youtube app would not allow me to purchase the movie.It works fine for Amazon Instant video. The Android app is non-intuitive and as others have said, there is no visual feedback on the android device. Seems to work fine when powered from my TV's usb port even though the on screen message says it has insufficient power and to use the AC adapter.", "verified": true, "helpfulness": "0/0", "author": "HYTRIN5"}, {"rating": 4.0, "review": "I think this thing is great. It allows me to stream all media in areas where I don't have a cable line. I was lucky they had a Slingbox app, but sorely miss the TWC TV app. If that app were available, my review would be five stars. The unit is quick and responsive. Set up was easy. Just one app short of perfection for me.  If support for the TWC app is made, I will buy additional units. If not, I will spend the extra $10 for Roku sticks for new TVs.", "verified": true, "helpfulness": "0/0", "author": "Finance Guy \"JAK\""}, {"rating": 5.0, "review": "just got it hooked up and working Great alternative to regular tv movies. comercial free", "verified": true, "helpfulness": "0/0", "author": "bev"}, {"rating": 5.0, "review": "Good price!!", "verified": true, "helpfulness": "0/0", "author": "wmileh"}, {"rating": 5.0, "review": "Great toy at a great price. Better than another major player's \"stick\" IMO.", "verified": true, "helpfulness": "0/0", "author": "D. M. Jean"}]