[{"rating": 2.0, "review": "\"dhcp unable to display the content\" error is hard to resolve. I reset  to factory settings and unable to make it go away.", "verified": true, "helpfulness": "0/0", "author": "CKumar"}, {"rating": 5.0, "review": "Awesome! Bought one for my parents who have issues with technology, and they love it! They can even use it in their own...without having to call me for help!", "verified": true, "helpfulness": "0/0", "author": "M. Schuetz \"Chelle\""}, {"rating": 4.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "Nicholas D Corradino"}, {"rating": 5.0, "review": "Works better than expected. Easy setup. Also priced right.", "verified": true, "helpfulness": "0/0", "author": "Paul R. Bibeault"}, {"rating": 5.0, "review": "It is best to watch movies online", "verified": true, "helpfulness": "0/0", "author": "juan sanchez"}, {"rating": 5.0, "review": "is what I anticipated", "verified": true, "helpfulness": "0/0", "author": "Murl Flenner"}, {"rating": 1.0, "review": "Unable to get it to connect to my network. Went back to using my Roku. Technical support  was unable to help, suggesting at the end that it was my internet provider. that may be but for the Roku it isn't a problem, and for no other devices in my house is it an issue. Sorry but I'm not going from Amazons help desk to Comcasts help desk each denying it to be their problem.", "verified": true, "helpfulness": "0/0", "author": "Jeff Doyle"}, {"rating": 5.0, "review": "Very easy to hook up.  Simple to operate.", "verified": true, "helpfulness": "0/0", "author": "Sidney J. Halpern"}, {"rating": 5.0, "review": "Love it so easy to use works great just wish our local internet provider could supply us with reasonable bandwidth.  We have a Chromecast that we were using some but now that we have the Fire stick we only use the chromecast when we need to cast something from the laptop .  And at less than $40 it is a deal", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Simple installation.  Amazon Prime Video and Netflix at my fingertips. Love it and recommend it!", "verified": true, "helpfulness": "0/0", "author": "Rose on Camellia"}]