[{"rating": 5.0, "review": "Great product... Have loads of apps... Just wish hbo go was available on the platform", "verified": true, "helpfulness": "0/0", "author": "GK"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Zeeshan"}, {"rating": 5.0, "review": "easy setup, a little slow at first but once all is loaded it goes. get the Pluto app. Totally good.", "verified": true, "helpfulness": "0/0", "author": "don from the islands"}, {"rating": 5.0, "review": "It works much better than my Roku II XS, (model 3100X). The Netflix and Amazon Prime video apps are much better than on my Roku. Pandora is about the same. However, there is no TED app for the Fire Stick, so I use the TED  app on Roku, which is most of the video I watch.", "verified": true, "helpfulness": "0/0", "author": "Steffan"}, {"rating": 5.0, "review": "Hook up was a breeze. Great picture and sound. Minimal loading times. Works great. Awesome product.", "verified": true, "helpfulness": "0/0", "author": "john strawder"}, {"rating": 5.0, "review": "I have used it for a week and it has met all my expectations.", "verified": true, "helpfulness": "0/0", "author": "Carl McHenry"}, {"rating": 4.0, "review": "Great value. It's amazingly fast. The phone app for remote control adds voice search but ONLY in Amazon Prime. But otherwise, streaming works very well.", "verified": true, "helpfulness": "0/0", "author": "kruseorama"}, {"rating": 4.0, "review": "Works as expected. Like remote app for phone.", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 4.0, "review": "I love this thing, but I am not going to give it five stars because there are some minor connectivity issues.", "verified": true, "helpfulness": "0/0", "author": "Qwerty Lover"}, {"rating": 2.0, "review": "the refresh on live streaming is slow , I was hoping for a VuDu app so I could watch movies that I already bought through them but there is no app.", "verified": true, "helpfulness": "0/0", "author": "Kevin Sommers"}]