[{"rating": 3.0, "review": "I ordered my Firestick based upon the recommendation of a friend who RAVED about it.  I already have a Roku in my house, as well as a PS3 and PS4 and can stream the basic Netflix and Amazon content in a variety of ways.  I find the layout of the menu's of the Firestick to be more confusing than any of my other products.  As it is an Amazon product, it is geared to steer you towards Amazon content. If you want to venture off to Netflix or other areas it requires an \"app.\"  While it is easy enough to navigate, it is not as easy as other products that have no vested interest in giving preference to one vendor over another.The games included (its one advantage over Roku) are not too interesting and it is difficult to play them with the remote.  My remote also makes a loud clicking noise when ever a button is pressed which makes the remote feel kind of cheap.Overall it is a good product, but I don't think it is \"better\" than other options.  If you don't have any other options, I wouldn't hesitate to order it.  But don't replace a Roku or some other already functioning device because this isn't really much of an upgrade.", "verified": true, "helpfulness": "0/0", "author": "Lundlover \"Moodydd\""}, {"rating": 5.0, "review": "It did more than add my expectations love it!", "verified": true, "helpfulness": "0/0", "author": "Erick"}, {"rating": 4.0, "review": "if there is a way to find categories of movie, I'd like to know.  I have not found an easy was to find movies, unless I know their name first.other than that, it seems to work very easily", "verified": true, "helpfulness": "0/0", "author": "robert reichek"}, {"rating": 5.0, "review": "Excellent and affordable product from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Ariel Jirau"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Gary F. Drews \"Gary F. Drews\""}, {"rating": 3.0, "review": "Meh........not a ton of prime free movies but otherwise ok. It's not great but not awful.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Jackman"}, {"rating": 5.0, "review": "Best streaming device I've owned yetAnd I have them all ATV, chrome cast, rokuBuy it and enjoy.", "verified": true, "helpfulness": "0/0", "author": "Khoshster"}, {"rating": 5.0, "review": "Love it so easy to use!", "verified": true, "helpfulness": "0/0", "author": "kim"}, {"rating": 5.0, "review": "Love love love it!!! Connects right to my Wi-Fi and streams everything we want !", "verified": true, "helpfulness": "0/0", "author": "christina"}, {"rating": 5.0, "review": "Great product. Extremely happy with this.", "verified": true, "helpfulness": "0/0", "author": "kevin"}]