[{"rating": 1.0, "review": "The device worked well for a while, two months later it cannot connect to netflix at all. It refuses to do it. My other devices: ipad and cell phones and laptop do it flawlessly. This is just the worst product I ever bought. I would like  a full refund.", "verified": true, "helpfulness": "1/1", "author": "Dr. Luis San Andres"}, {"rating": 5.0, "review": "Changed my life!", "verified": true, "helpfulness": "0/0", "author": "Amiel Z Herrera"}, {"rating": 4.0, "review": "I love the fire stick for Netflix.  It seems like all the videos on Amazon that I click on you have to pay to watch - even though I have a Prime membership.  Hard to find the free amazon videos.  That was disappointing.  Loved everything else about it.", "verified": true, "helpfulness": "0/0", "author": "TAMI HINNERSCHITZ"}, {"rating": 5.0, "review": "I can buy a amazon fire stick from walmart", "verified": false, "helpfulness": "0/0", "author": "Daphne"}, {"rating": 4.0, "review": "It is great! All th shows and movies a couple could ask for.Set was a breeze!", "verified": true, "helpfulness": "0/0", "author": "Patrick Salm"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "Chad W Johnson"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jennifer Hatfield"}, {"rating": 5.0, "review": "Awesome. User friendly", "verified": true, "helpfulness": "0/0", "author": "Helen Rapp"}, {"rating": 5.0, "review": "Cable and Satellite TV are dead and products like this are the future. If you can afford it I recommend the Fire Tv Box over the stick, but nothing can beat the price of this unit for the money.  You can watch all of your purchased HD content in full HD and get access to a variety of free and pay per play services.  I run Fire TV devices on two televisions.  I have a collection of kids movies and personal favorites, PBS/PBS kids, Netflicks, MLB.tv, Amazon Prime, and now HBO Now.  I get my local news content in full HD with a digital roof antenna.  My monthly bill is a fraction of what I was paying for Satellite with twice the content.I said if you can afford the fire TV you should buy that because there is so much hardware crammed in this little unit it can get hot.  The larger Fire TV box can also be hooked up to a direct line.  I don't see any difference in performance (picture quality/smoothness of video).I bought the stick for an entirely different purpose and it works better than expected.  I teach and carry with me a small portable projector to non formal teaching situations.  I did not want to cart around a lap top to run presentations off on on top of all my other gear.  Instead I link the Fire TV stick to my projector and mirror my Fire Phone to the Fire Stick.  If you run a power point presentation from your phone, the picture will be in full screen!  The Fire TV stick is much lighter than a laptop.  Soooo awesome! and I can run all of my content as well.  So, if I need to play a documentary I can do that as well.", "verified": true, "helpfulness": "1/1", "author": "Douglas MacDonald \"GameEnthusiast\""}, {"rating": 3.0, "review": "When it works, I would give it 5 stars. It took us 2 hours before we could get a stable connection. After reading some forums we wrapped the stick in a piece of foil and it worked. I has now been connected to wifi for an entire day. This is only the 2nd day of owning the fire stick so I'm not sure it's going to hold up. I sure hope it does, it's a great product when it works!", "verified": true, "helpfulness": "0/0", "author": "Emily"}]