[{"rating": 5.0, "review": "Works well for me. So much more convenient than plugging my laptop into the tv! I have yet to have any issues with it.", "verified": true, "helpfulness": "0/0", "author": "RSTRAT"}, {"rating": 5.0, "review": "Easy to set up, easy to use, and wonderful quality. I couldn't ask for anything better!!!", "verified": true, "helpfulness": "0/0", "author": "katlyn"}, {"rating": 5.0, "review": "Excellent! Why didn't I know about this sooner? I especially like the feature where I can mirror image with my phone and show photos on my phone on the big screen!  Who knew?  I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "DR"}, {"rating": 5.0, "review": "Love this.  Already purchased another as a gift and plan a second for my home.", "verified": true, "helpfulness": "0/0", "author": "K. C. Danella"}, {"rating": 5.0, "review": "In love with this purchase. May just be the best thing Amazon has offered", "verified": true, "helpfulness": "0/0", "author": "Shaunna Pratt"}, {"rating": 5.0, "review": "This thing is great! Super easy to use! Gives me all of my Amazon and stuff on my big screen!  Well worth the price which is pretty cheap!", "verified": true, "helpfulness": "0/0", "author": "Eric C. Byron \"wildmedic\""}, {"rating": 5.0, "review": "I live in and RV park with free WIFI. The router is approximately 50-60 yards away. My TV is in an enclosed cabinet so the TV stick is in the enclosed area. Regardless of these obstacles, this works great and the remote is awesome. I've watched a couple movies and their is no interruption.  I wish there were more recent movies available for free thru prime.", "verified": true, "helpfulness": "0/0", "author": "THOMAS BASSETTI"}, {"rating": 1.0, "review": "it gets hot and its very laggy", "verified": true, "helpfulness": "0/0", "author": "moises molinuevo"}, {"rating": 4.0, "review": "Very easy to set up.  Took about 10 minutes.  Only issue is some of the newer movies cost more than expected.  No other problems since installed.", "verified": true, "helpfulness": "0/0", "author": "KCat"}, {"rating": 5.0, "review": "I love the FireTV Stick.", "verified": true, "helpfulness": "0/0", "author": "Chris Mattox"}]