[{"rating": 5.0, "review": "Totally great. Easy to install, instructions were simple and accurate. Makes streaming movies from Prime, Netflix, Plex so much easier.", "verified": true, "helpfulness": "0/0", "author": "Rcbfranklin"}, {"rating": 5.0, "review": "Such a great purchase! It's so much fun to use when having a party and you're not sure what to do with your guests. The games available for purchase on it are so much fun!", "verified": true, "helpfulness": "0/0", "author": "Kelly Zdanowicz"}, {"rating": 5.0, "review": "We are still adding apps but are very pleased with our purchase. We formerly accessed Amazon Prime video and Netflix through a Nintendo Wii. We didn't access them very often because this required a very awkward maneuver with the Nintendo remote. Not so with the Fire stick, which I installed myself without difficulty. We have also added Pandora and ITune Radio aops. We have previously accessed these services on other devices. With the new accessibility, we will likely cancel our premium movie channels on Direct TV and may ultimately \"cut the cord\" entirely.", "verified": true, "helpfulness": "0/0", "author": "john \"seeker\""}, {"rating": 5.0, "review": "Great entertainment. I had a few hiccups with set up, but after I upgraded the strength of my wifi signal, I am delighted.", "verified": true, "helpfulness": "0/0", "author": "The Funny Bunny"}, {"rating": 5.0, "review": "It is small, doesn't need any connections ( or hardly any) works great!!!", "verified": true, "helpfulness": "0/0", "author": "Elena Berkery"}, {"rating": 5.0, "review": "Does everything amazingly well for the price. Super fast, everything streams with great quality. I like it better than my friend's roku", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 5.0, "review": "Just finally got our fire  stick. Son wanted to watch a movie we had on our prime account. From box open, to movie playing took less than 5 minutes. Flawless setup and integration. Worth the purchase just for that", "verified": true, "helpfulness": "0/0", "author": "Greg Stonesifer"}, {"rating": 5.0, "review": "So handy to use. I bring it with me to hotels when i travel. Family can watch netflix and i can catch up on sports with espn app!", "verified": true, "helpfulness": "0/0", "author": "JOHN RECKART"}, {"rating": 5.0, "review": "I just love the Amazon fire stick, it allows more viewing options than cable TV.", "verified": true, "helpfulness": "0/0", "author": "Robert E. Brown Sr. \"Avid Reader\""}, {"rating": 5.0, "review": "Super good", "verified": true, "helpfulness": "0/0", "author": "Stephanie Schmidt"}]