[{"rating": 5.0, "review": "Works very well and is fun to use.  Has an endless amount of things to watch.  I'm going to buy another one.", "verified": true, "helpfulness": "0/0", "author": "Edward"}, {"rating": 3.0, "review": "Laggy at times and no root possible yet. Allow root, and fix lags and this would be 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Lynn"}, {"rating": 5.0, "review": "The Fire Stick is awesome, very fast UI, fast to load content and very tolerant of slow internet connections. It does suffer the same issue as the AppleTV though - it doesn't work well with hotel wifi systems that have a sign-in page.", "verified": true, "helpfulness": "0/0", "author": "Piers Denney \"mobritinusa\""}, {"rating": 4.0, "review": "I like it but wish there were more free movies.", "verified": true, "helpfulness": "0/0", "author": "Debra A Morgan"}, {"rating": 5.0, "review": "love this", "verified": true, "helpfulness": "0/0", "author": "Stephanie H."}, {"rating": 1.0, "review": "There is no statement about how many gigs it uses on the data plan 2 gigs per movie. Im throwing it away.", "verified": true, "helpfulness": "0/1", "author": "may"}, {"rating": 1.0, "review": "Don't buy! This will be my 3rd dealing, with Amazon Customer Service, in the 1 week of having this. I've had to explain to 2 reps, the connectivity issues, on a 50mbps, wifi network. Even the computer that has a USB, as it's internet reciever, works better. This issue is WIDE SPREAD, and everyone does the trouble shooting Amazon reps ask you to do. Most of us have done these step many of times before even contacting support.Worst part was dealing with my second customer service rep., who asked all kinds of suspicious questions. First asking for my address (it should be right there in front of him) but I gave it anyways, then to enter my card information because it's incorrect (Whoa, what? How's that possible?, I checked, and EVERY bit was correct!), How would I have purchased this then? He told me he was going to schedule a call back, told him I work at 6am to 7pm or later, but it would be ok for the call from 5am to 6am to best bet 8pm. after work. I asked if he had my number, for the call back, and surprise he had that in front of him, but nothing else.I'm on my break writing this review, after spending 45min. of my 30min break dealing with this guy. All this even after he said he'd replace it (I have the transcript and copied the chat). It's no wonder we have all these breaches in security, because someone probably gave the guy that information, that I refused to give to him.", "verified": true, "helpfulness": "0/0", "author": "Frank Ricci \":::Benjamin Cross:::\""}, {"rating": 3.0, "review": "Mixed feelings about this product. I received the Amazon Fire TV Stick yesterday. Set up was easy and it is very user friendly. I was so excited to start using it, but the stick would not connect to my wifi even though the connection was strong. I know it's the stick because every other streaming device I have works fine with no interruptions.I thought about sending it back right away or demanding that Amazon send me an extending cable, but I decided to fix the problem myself. I used the HDMI extender cable that comes in the box and managed to prop the stick up so that it is at a perfect 90 degree angle to the TV. This is the only was it works and, so far, no more lost connection or stalling. I like it now and will keep it!", "verified": true, "helpfulness": "0/0", "author": "Rachel Krueger"}, {"rating": 5.0, "review": "Our Samsung Smart TV stopped picking up the Internet.  Fire stick solved the problem.", "verified": true, "helpfulness": "0/0", "author": "Richard Nixon"}, {"rating": 2.0, "review": "Limited App availability makes it a little less useful than I thought. TWC TV is not available.The stick is not as small as it looks in pictures and it sticks out the side of my TV. The power cable that is not shown on any of the pictures sticks out like a sore thumb from the side of the stick.", "verified": true, "helpfulness": "0/0", "author": "BD"}]