[{"rating": 5.0, "review": "Absolutely love the Fire Stick TV. Very easy to set up and use. It exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Susann Braverman"}, {"rating": 3.0, "review": "Have not been able to use it much.  Tells me my internet connection is too slow.  Starts and stops while it buffers, like the variety and the interface.However I'm stuck using my Chromecast instead.  The remote and on screen interface are easy to use and not having to have a second device to play what you want to see is nice.", "verified": true, "helpfulness": "0/0", "author": "JuanCholo"}, {"rating": 5.0, "review": "Fire TV Stick Fantastic! Have it hooked up to a tv on my treadmill. Makes running inside easy.", "verified": true, "helpfulness": "0/0", "author": "Dell Foxen \"The Farmer in the\""}, {"rating": 5.0, "review": "I love my fire stick!! Our family uses this all the time. And a great price as well! I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Can watch shows from different apps. Can't search for other apps & install them.", "verified": true, "helpfulness": "0/0", "author": "Erwin"}, {"rating": 5.0, "review": "Easy to install. Good content.", "verified": true, "helpfulness": "0/0", "author": "John oakes"}, {"rating": 4.0, "review": "I bought 2 of these originally. So far both have screwed up. On the first one the stick stopped working. On the second one. The controller stopped working. Changed batteries before it no help there. I like the stick is the reason I marked it high as I did. Amazon's customer service is out standing and I know I will be taken care of. I do have some issues with some of the program where as I can watch shows on Hulu and netflix for free and have to pay on Amazon.", "verified": true, "helpfulness": "0/0", "author": "Clyde H. Roberts"}, {"rating": 4.0, "review": "Could be a little easier to use, and needs the cbs app. But other then that, great item.", "verified": true, "helpfulness": "0/0", "author": "Matthew stutsman"}, {"rating": 5.0, "review": "amazing! not sure how I lived without it!", "verified": true, "helpfulness": "0/0", "author": "Nora McMurrey"}, {"rating": 5.0, "review": "My family and I LOVE this! We have one in two rooms. Plus, we have Amazon Prime with lots of free shows and apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]