[{"rating": 5.0, "review": "OMG I love it! So easy to use and set up was a breeze.", "verified": true, "helpfulness": "0/0", "author": "jena hartley"}, {"rating": 3.0, "review": "I'm a little disappointed by the fire stick. It always loses connection to my wifi and I need to restart it and reconnect. Doesn't have as many movies and programs as I thought it would have. Aside from that its pretty cool and Netflix works great.", "verified": false, "helpfulness": "0/0", "author": "Forrest Taggart"}, {"rating": 4.0, "review": "Fire stick is great watching it on my tv instead of my phone is great!!", "verified": true, "helpfulness": "0/0", "author": "Putina Warren"}, {"rating": 5.0, "review": "like taking it on trips can watch good stuff for free", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Not as organized as Netflix, but its okay", "verified": true, "helpfulness": "0/0", "author": "Paul W."}, {"rating": 3.0, "review": "Really intuitive and the Prime content is nice. Problem is that it drops the wifi network all the time while our laptops, phones, and Chromecast have no problems. It seems like there are a lot of people complaining about this online. A power cycle usually helps but sometimes I even have to cycle the router to get it to work,", "verified": true, "helpfulness": "1/1", "author": "V. Neumann"}, {"rating": 4.0, "review": "It's ok!", "verified": true, "helpfulness": "0/0", "author": "Yvette Nicholson"}, {"rating": 2.0, "review": "It constantly drops internet, won't open applications, and needs reset (which is clearly difficult being plugged into the back of the television). Quite disappointed in this product.", "verified": true, "helpfulness": "0/0", "author": "Danny Kilburn"}, {"rating": 5.0, "review": "Love it. It serves its purpose, now I can watch shows and movies from anywhere.", "verified": true, "helpfulness": "0/0", "author": "Thomas J. Hilliard \"TJ\""}, {"rating": 3.0, "review": "works good but not enough contents to watch.", "verified": true, "helpfulness": "0/0", "author": "Eric"}]