[{"rating": 4.0, "review": "I have only had this for a week or so; I decided to buy because I became a PRIME member and the ONLY way to watch Prime video/tv outside of your computer is by buying this if you are an ANDROID person like me. I REFUSE to have to buy a kindle or other 'Amazon acceptable' device to have full use of my membership. I think Amazon should grow up and allow Android users a good platform to use their Prime membership, but I digress...Overall, compared to an older dvd/blu ray player that had 'net capability that I was using for netflix and other online services through a t.v., the Fire Stick FLIES as far as speed; but that may be due to the fact what I had been using was so slow. I will say ease of setup, intuitive use of remote, etc, is great. The sound quality is LEAPS AND BOUNDS better than the sound that was coming through my computer. I don't have an uber-expensive tv, but the sound quality through the firestick is impressive.I have not done enough 'exploring' on it to get more of a idea of overall 'value', it just felt like a necessary purchase in order to be able to expand how I was using my prime membership. I like the fact I can take it on the go and plug it in to other TV's if there is internet access and be able to use it, although I have yet to try that.I would have given it an initial score of 5 stars were it not for Amazon's inability to serve the needs of its ANDROID customer base. Grow up Amazon and give us 'Droids' some love!", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "great product love it. I had it for about a month and no problems as of yet. Side note the batteries are a little hard to replace, it took some time just to get the back open.", "verified": true, "helpfulness": "0/0", "author": "T Capers"}, {"rating": 5.0, "review": "Easy to set up, nice and portable ( I use it when I travel) and has all the shows and availability of programs like Netflix that I need.", "verified": true, "helpfulness": "0/0", "author": "T. A. Smith \"TASvisions\""}, {"rating": 5.0, "review": "It arrived on time.  It works great.", "verified": true, "helpfulness": "0/0", "author": "Joann Heisler"}, {"rating": 5.0, "review": "Very good stick.", "verified": true, "helpfulness": "0/0", "author": "Lubna"}, {"rating": 3.0, "review": "It doesn't have the voice search like the box and I thought the stick would eliminate the use of a power cord. Didn't know it had to be plugged in to an outlet to power it.", "verified": true, "helpfulness": "0/0", "author": "Chris S."}, {"rating": 5.0, "review": "LOVE IT! Super easy to set up.  The movie quality is great.  Also love that I can play my Prime Music on it as well. I'm so glad I purchased this Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Tracy Hopkins"}, {"rating": 5.0, "review": "use it all the time!", "verified": true, "helpfulness": "0/0", "author": "Michael and Elizabeth Bottino"}, {"rating": 2.0, "review": "I thought I was having a problem with my Roku stick. I have a Fire HD tablet that I really like so I have been wanting to try out Amazon's Fire TV.  So I ordered one of these Fire Sticks. Installation and setup was super easy and it had the channels I watch...BUT...I had a serious problem with it because it kept dropping my WiFi signal. It was very intermittent...sometimes a minute, sometimes 15 minutes, and sometimes 15 seconds. I never had that problem with my Roku stick. I should have given it a 1 but I know the problem had to be a hardware issue. So I rated it the way I would have if I hadn't had the problem. What I discovered was that I like the Roku better. The Fire stick was just too...Amazon. That's what makes the Fire HD so GOOD but it just didn't work for me with the Fire stick. I understand why it is because it IS Amazon! The Roku is so much more generic. I like the operator interface that Roku has much better. And it's just not in your face Roku. The Fire stick was in your face Amazon. If it had the same or similar user interface as the tablet I probably would have tried another one. I sent it back and ordered a Roku 3.I just posted a 3 star review a few minutes ago. Since then I read some of the other 3 star and lower reviews and I found that quite a few folks experienced the same issue with the WiFi that I did. There were a LOT of complaints about that. I guess it's like Russian Roulette...I'm changing my review to 2 stars.", "verified": true, "helpfulness": "0/0", "author": "George E. Stratton"}, {"rating": 5.0, "review": "Excellent purchase. Does exactly what it says it will do. Extremely easy set up.", "verified": true, "helpfulness": "0/0", "author": "SLY"}]