[{"rating": 3.0, "review": "The fire stick didn't meet my expectations. The first issue I've noticed is that the stick gets extremely hot after an hour use and starts to flicker. I used the power supply that was included. I'm concerned about it's safety. Another issue I noticed is that the color saturation is set too high. I'm comparing this against my PS3. Lastly, the video quality was subpar when using miracast. The videos I streamed from my other devices weren't sharp.", "verified": true, "helpfulness": "0/0", "author": "bk88"}, {"rating": 5.0, "review": "the most dependable of all the hardward for streaming.", "verified": true, "helpfulness": "0/0", "author": "Marty Krystall"}, {"rating": 4.0, "review": "It is good!", "verified": true, "helpfulness": "0/0", "author": "Snake"}, {"rating": 5.0, "review": "Works great. Loads very quickly. Easy to use. If you like Netflix, hulu, YouTube ect and free games. This device is for you.", "verified": true, "helpfulness": "0/0", "author": "Alex Hickman"}, {"rating": 5.0, "review": "Easy to install and start using!", "verified": true, "helpfulness": "0/0", "author": "Joanna Franks"}, {"rating": 5.0, "review": "Had a Chromecast and was starting to have issues with loading and buffering. Did some research and found that the fire stick surpassed it in every way. I love the remote that comes with it, it could be hard to control Netflix from your Chromecast once the phone hands it off to the stick. I am in no way disappointed with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Steven  Powell"}, {"rating": 5.0, "review": "We are enjoying the ease of watching movies and series on our TV.", "verified": true, "helpfulness": "0/0", "author": "S"}, {"rating": 4.0, "review": "Pros: Much easier than hooking up the laptop every time i want to watch Netflix in the kitchen. Remote works off of Bluetooth so no pointing around like an idiot to make it work.Cons: a bit slow and requires external power.", "verified": false, "helpfulness": "0/0", "author": "Travis Lowrey"}, {"rating": 5.0, "review": "Love how easy it was to set up and use. So much easier to play Netflix than using the PS3. Hoping that Amazon links it with the echo soon!", "verified": true, "helpfulness": "0/0", "author": "W. J. S."}, {"rating": 2.0, "review": "it didn't work at all with my TV", "verified": true, "helpfulness": "0/0", "author": "Sara S. House"}]