[{"rating": 5.0, "review": "Simple to operate.  Much better than rivals (similar) that we have tried.  Paired with Prime, Firestick provides better video entertainment compared to rival.", "verified": true, "helpfulness": "0/0", "author": "Gertie P."}, {"rating": 2.0, "review": "not very good I bought the fire tv while back and I just connected it to my tv I was in the hospital for quite awhile so that's why I didn't hook it up till now or I would of returned it to amazon but I wasn't able to return it now cause I waited so long but like I said that's because I was in and out of the hospital ever since nov 3rd 2013 and I been in and out of hopitals april 1st this year was my last surgery I been having cause of a bad accendent I had back in nov 3rd anyways Ithey said I was not able to return my fire tv now cause of all this crap anyways so I connected it to my tv and all that thing does is stop and go stop and go and lags soo bad you cant watch a movie or anything but maybe play a game or two and I do have great connection with my wifi and all that so I know its not my wifi router ect at all the fire tv stick is not a very good product at all I wouldn't wish this device on worst enemy", "verified": true, "helpfulness": "1/2", "author": "DLO"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Cara Londo"}, {"rating": 5.0, "review": "Very happy", "verified": true, "helpfulness": "0/0", "author": "Javier Villanueva"}, {"rating": 5.0, "review": "Love the Amazon Fire TV Stick. Easy set up and makes streaming Netflix etc easy.", "verified": true, "helpfulness": "0/0", "author": "Anita E"}, {"rating": 5.0, "review": "Works as advertised, lots of apps!", "verified": true, "helpfulness": "0/0", "author": "William Klein"}, {"rating": 5.0, "review": "Easy to install and works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Beverly Swain"}, {"rating": 5.0, "review": "Love the movies", "verified": true, "helpfulness": "0/0", "author": "Cassandra Jones"}, {"rating": 1.0, "review": "Why did I pay for something just to allow me to pay for more?  Terrible purchase.", "verified": true, "helpfulness": "0/0", "author": "Larraine Presley"}, {"rating": 5.0, "review": "so much better then google chromcast", "verified": true, "helpfulness": "0/0", "author": "jfish"}]