[{"rating": 4.0, "review": "We love the fire stick should have got one a long time ago. Don't like we have to pay for some movies though.", "verified": true, "helpfulness": "0/0", "author": "Bonnie6"}, {"rating": 5.0, "review": "Hardest part was plugging in the hdmi cord with TV on wall.works like a charm. I would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "James Andrew Webb"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Becky G."}, {"rating": 5.0, "review": "I received the additional \"speaker\" remote about a week before I got the actual Fire TV Stick.  I hooked it up to my HDTV and found that it works great.  I am in the process of checking out membership in a some of the sites that are on the home page such as Netflix, Hulu, etc.  The Fire Stick is all it claims and so easy to use.  I would recommend it to anyone, especially if you have Amazon Prime.  If you don't have Prime, it is worth the annual fee.I am under a contract with my cable company for their \"Premier\" services, but once the initial contract wears out it is my intention to drop their services down to basic cable so that I can get the local stations and some of the basic cables sites.", "verified": true, "helpfulness": "0/0", "author": "Ski Gorski"}, {"rating": 5.0, "review": "Love it, and very easy to use!", "verified": true, "helpfulness": "0/0", "author": "dustin diteman"}, {"rating": 4.0, "review": "It great.  I like it", "verified": true, "helpfulness": "0/0", "author": "Steven Clevenger"}, {"rating": 4.0, "review": "👍", "verified": true, "helpfulness": "0/1", "author": "Sean Curran"}, {"rating": 5.0, "review": "A great device. Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Ed Shandrew"}, {"rating": 4.0, "review": "So far so good. WWE Network,  Hulu and Netflix work just fine, as does the remote control app for my phone. delivery was earlier than promised.", "verified": true, "helpfulness": "0/1", "author": "Jason Geary"}, {"rating": 5.0, "review": "We're very happy with this purchase.  Set-up was easy, and it worked right away.  We would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Joyce"}]