[{"rating": 5.0, "review": "Great way to stream Amazon Prime. I'm sure this device is great for streaming other apps like Netflix but I only use it for Amazon as I am primarily an Amazon user. The ability to stream albums I have purchased via the Amazon market is a nice bonus. Nice and compact size makes it easily portable when I need to switch tvs.", "verified": true, "helpfulness": "0/0", "author": "BassJas"}, {"rating": 5.0, "review": "Excellent", "verified": false, "helpfulness": "0/0", "author": "David Quenah"}, {"rating": 1.0, "review": "I have purchased a ton of things from Amazon. That said I have usually been pleased with what I have ordered. The Fire Stick is a piece of crap, real crap. I ordered it a few months back, it was set for a late January release. Of course they had to get it out before Christmas. Two things wrong right off the bat, the remote skips spaces sometimes it won't stop skipping. Second it has problems connecting to the wifi. Tried new battery's in the remote and hooked it up to two different TVs in two different houses. Just don't waste your money..", "verified": true, "helpfulness": "1/2", "author": "Carl V. Koontz"}, {"rating": 3.0, "review": "Does not work as well as my Roku 2XP", "verified": true, "helpfulness": "0/0", "author": "Hugh A. Stephens"}, {"rating": 5.0, "review": "Really like our new fire stick so much to watch and do thanks amazon", "verified": true, "helpfulness": "0/0", "author": "lorrie"}, {"rating": 1.0, "review": "I bought this for my Non Apps TV thinking I could plug in the stick only and have the apps on my HDMI TV. However that is not the case. Ad is misleading. You must attach a USB cable for power which makes it look like a mess hanging down from my TV on the wall.. In order for me to get this to work I would have to buy an extension USB cable so it could run down the wall to an AC Outlet.  Very disappointed that I could not just plug only the \"stick\" in the HDMI and expected it to work. Be warned you will have to attach usb cable for power to the stick which IMO makes this useless. Should have gone with the chrome stick.  All the pics show just the stick and the remote , no where do I see a USB cable attached to the stick. Always liked Amazon but now have to rethink buying there products.", "verified": true, "helpfulness": "1/4", "author": "David C. Phillips"}, {"rating": 5.0, "review": "cool stuff", "verified": true, "helpfulness": "0/0", "author": "Siwei Chen"}, {"rating": 3.0, "review": "Works OK but not as well as I expected.  My Blu Ray player has wi fi and has no trouble getting the signal from my router.  This device at the same location has trouble connecting to my wi fi.", "verified": true, "helpfulness": "0/0", "author": "J. L. Carr"}, {"rating": 5.0, "review": "it is good for the price, I pre ordered but it was easier to go to best buy and get it , one amazon was backing the order for so long.", "verified": true, "helpfulness": "0/0", "author": "latino"}, {"rating": 5.0, "review": "I love this! So much better than a Chromecast. You can see apps, Amazon videos, and games on it very easily.", "verified": true, "helpfulness": "0/0", "author": "Chelsea"}]