[{"rating": 5.0, "review": "Great gift!!", "verified": true, "helpfulness": "0/0", "author": "Louii III"}, {"rating": 1.0, "review": "Sorry I bought it. Constantly loses internet connection, so much that I cannot even search for a title. When I go to Network Settings it shows the connection is \"very strong\". No other devices in our house do this.", "verified": true, "helpfulness": "1/1", "author": "Stephanie"}, {"rating": 5.0, "review": "this stick is very capable ! its not as good as the fire tv box ! but i'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "tomster"}, {"rating": 5.0, "review": "Amazing device for the price, especially once you install Kodi/xmbc. The remote is rather difficult to use and takes some time to get used to. I have one in every room in the house rather than a cable box. Do yourself a favor and pick one up, then install Kodi. Kodi can not be installed on any of the other devices from Amazon's competitors.The only real downside is it's need of 1A, 5V, which forces you to run a cable to wall outlet rather than be able to run with the power off the hdmi. But that doesn't take away any stars in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Oryana Villegas"}, {"rating": 5.0, "review": "Meets all expectations", "verified": true, "helpfulness": "0/0", "author": "Kenneth Boudreau"}, {"rating": 4.0, "review": "works great,wireless speed is great", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 5.0, "review": "Set up was so easy anyone could do it. Came to me the very next day after ordering. No complaints here", "verified": true, "helpfulness": "0/0", "author": "Tom Garrison"}, {"rating": 3.0, "review": "I like having it on my TV.  It shows me what is available without hesitation or confusion.  It is impossible for me to listen to music.  The pieces start and then are interrupted while the feature re-loads.  I find that while I am watching a Netflix program, the picture stops and the voices continue, then the picture races to catch up to the audio.", "verified": true, "helpfulness": "0/0", "author": "Richard A. Dimentstein"}, {"rating": 5.0, "review": "This is a good way of watching movies and getting access to Netflix. Easy to install and I haven't had any problems so far. Streaming is fast too.", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 5.0, "review": "Cutting off the satellite....", "verified": true, "helpfulness": "0/0", "author": "Van Patterson"}]