[{"rating": 5.0, "review": "Purchased this for Christmas and it works as advertised. We use this for Netflix, Amazon Prime and YouTube in the bedroom area. Installed easily with no hassle, and came up instantly. We also have an Apple TV, so this is a good alternative in another room.", "verified": true, "helpfulness": "0/0", "author": "Circle B Ranch"}, {"rating": 5.0, "review": "Great product, wish it didn't have to be on the charger all the time but I love the quality. It is exactly what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Fran"}, {"rating": 5.0, "review": "Convenient, portable and simple. Very much enjoy using.", "verified": true, "helpfulness": "0/0", "author": "Chris M."}, {"rating": 5.0, "review": "best media player by far", "verified": true, "helpfulness": "0/0", "author": "joshua faucett"}, {"rating": 4.0, "review": "Works well. Advertising should have noted the requirement for AC power. My installation made this difficult.", "verified": true, "helpfulness": "0/0", "author": "Thomas W."}, {"rating": 4.0, "review": "I set this thing up, which was very easy, and tried to watch.  I could only get 3-5 seconds of watching before it buffered again.  It said my internet was to slow, although it is actually very fast.  I called Brighthouse, and they changed channels on my modem, whatever that means.  After trying several, the system worked perfectly.  Just giving Brighthouse users a heads up.I don't like the remote, and the menuing isn't the greatest.  I would like to see lists of items, not the stupid icons.  But obviously few people agree with that!  Now, to sit down and binge on Harry Bosch!!", "verified": true, "helpfulness": "0/0", "author": "Noone"}, {"rating": 4.0, "review": "Very cool if you're looking to access Media in the bedroom cause you don't have a Smart TV or a computer to hook up.  The remote is easy to use but you will need the TV/Cable remote to adjust volume etc....They recommend using the included power adapter but the USB to Micro USB cable that is supplied my be too short for some applications such a mine. TV is 55 inches from floor for comfortable bed viewing and would need about another foot of cord to plug into power strip on ground.  Luckily I have a powered USB on the side of the TV that seems to be doing the job just fine.  Haven't noticed any ill effects despite a notification that it is under-powered.", "verified": true, "helpfulness": "0/0", "author": "Chad E."}, {"rating": 4.0, "review": "main issue is that i have to unplug and reboot so often. seems to lose track of my wifi network and tell me my network is down when none of the other devices operating on my wifi are having problems. recently downloaded the remote app and am much happier with that technology. i think its a great device for the price, but the wifi connection is definitely not consistent. my only previous experience with this type of technology is apple TV and i never had any issues when using that device. obviously the price on this is much better. wouldn't expect it to function as well, but there are definitely a few kinks to work out.", "verified": true, "helpfulness": "0/0", "author": "Amber D. Arbo"}, {"rating": 5.0, "review": "absolutely everything it said it would be", "verified": true, "helpfulness": "0/0", "author": "E. Frazier"}, {"rating": 5.0, "review": "So easy to use and great choices!!!", "verified": true, "helpfulness": "0/0", "author": "Bonnie Rendl"}]