[{"rating": 2.0, "review": "Honestly. The thing is mostly fantastic. Apps and games are good, customer support is frankly incredible. But I own many WiFi devices, and all of them work all over my 1200 square foot home on the existing WiFi. None buffer or have problems of any sort. The fire stick, well, it works in the room the wireless router exists in, and no where else.It works there brilliantly, mind you. It looks great and functions better than I could have hoped... but I have no need of wireless anything in the one room of my house with wires.", "verified": true, "helpfulness": "0/1", "author": "Ryan Clancy"}, {"rating": 5.0, "review": "We have really enjoyed using our Fire Stick.", "verified": true, "helpfulness": "0/1", "author": "bellerina"}, {"rating": 5.0, "review": "Accolades.  This is a fast, amazing upgrade to using a WiFi-DVD player.  Only day 1, but this little beast is all it's touted to be.", "verified": true, "helpfulness": "0/1", "author": "Tobin"}, {"rating": 5.0, "review": "eary to operate...........works great", "verified": true, "helpfulness": "0/1", "author": "Anne from Cincinnati"}, {"rating": 4.0, "review": "Works better than I thought.  I bought it for screen casting from my cell phone and that works as well as I imagined.  I was surprised to find the quality of the Amazon instant videos better using the firestick than from my smart TV's amazon app.", "verified": true, "helpfulness": "0/1", "author": "John"}, {"rating": 5.0, "review": "Super fast and responsive.", "verified": true, "helpfulness": "0/1", "author": "Ricardo Santos"}, {"rating": 5.0, "review": "I have 3 of these and LOVE them. No issues at all.", "verified": true, "helpfulness": "0/1", "author": "R.Woods"}, {"rating": 4.0, "review": "Love it!!! Who needs cable? I have cut the cord and it was one of the best decisions I have ever made. I was paying $180 a month for channels I didn't even watch. I subscribed to Sling TV for $20 a month and have every channel I need. The Amazon Fire TV Stick was a great buy!", "verified": true, "helpfulness": "1/2", "author": "Janine C."}, {"rating": 5.0, "review": "A perfect way to basically upgrade a non-Smart TV. I love that it integrates my Prime music and videos into my primary TV without additional networking concerns.Very easy to use -- physically and in terms of the UI.", "verified": true, "helpfulness": "0/1", "author": "Donavan Neil"}, {"rating": 5.0, "review": "Even better than expected!", "verified": true, "helpfulness": "0/1", "author": "ahairstylist"}]