[{"rating": 1.0, "review": "It does not work with my hotspot", "verified": true, "helpfulness": "0/0", "author": "jalapeno ranch dressing"}, {"rating": 5.0, "review": "Love it!  This little device is fantastic.  Access to Prime content, video rentals, Prime music, without having to boot up a gaming console or other device.  Perfect for our family and for Prime Members in general.", "verified": true, "helpfulness": "1/1", "author": "Christopher"}, {"rating": 3.0, "review": "Great for watching video available through prime.  BIG ISSUE - Have to reconnect to wifi each time I turn it on.  Unless power to fire stick is on all the time it loses connectivity.  Have not figured out how to mirror my phone or tablet.  Not very intuitive.", "verified": true, "helpfulness": "0/0", "author": "Stephen Chinnery \"stephen chinnery\""}, {"rating": 5.0, "review": "Can't say enough how much I love this! Never had streaming TV before and this was so simple to hook up and use right from the box. I would get this before any other.  If you have PRIME with amazon this is the only one you need. So much great content is free to view!", "verified": true, "helpfulness": "1/1", "author": "Julie Beveridge"}, {"rating": 2.0, "review": "Loses internet connection regularly and then shows no networks in range when trying to reconnect. Cannot watch a show without having to get up and unplug power to reset. I am glad I got this when it was only $20 because I would be upset if I had wasted any more money than that. Great concept, bad execution,", "verified": true, "helpfulness": "1/1", "author": "Sara M. Johnson \"Cheshire Cat\""}, {"rating": 2.0, "review": "I should have researched more before I bought this. I was really hoping I could mirror my laptop to my TV, but the mirroring options are currently limited to a very small number of other Fire products.", "verified": true, "helpfulness": "0/0", "author": "Brett Geissbuhler"}, {"rating": 4.0, "review": "I bought this during the pre-order promotion period when it was $19.  It arrived in time to use during the holiday get-togethers.  It's a great portal to Netflix and Amazon Prime Kids content which were heavily utilized by the kids (2 and 4 year olds).  For the grown-ups, I was disappointed that it wasn't simply to rent \"The Interview\" (available via Google Play and YouTube).  Overall, this has been a simpler and more consumer friendly release than the Google Chromecast we had been using prior.", "verified": true, "helpfulness": "0/0", "author": "DANIEL CHANG"}, {"rating": 5.0, "review": "I love this thing. It has been so much fun learning all that it can do. If you don't have one, you should order one NOW. Seriously, it is amazing. I can watch anything that I want with this and so much more.", "verified": true, "helpfulness": "1/1", "author": "Shar"}, {"rating": 5.0, "review": "Super easy to setup and works great.", "verified": true, "helpfulness": "0/0", "author": "Prime Customer"}, {"rating": 5.0, "review": "Although I paid the introductory price; Amazon Fire TV Stick is worth the full price. I am planning on getting a second one for another TV. Amazon Fire TV Stick is simply amazing! Amazon Prime Instant Video is now just that: instant! I can't say enough about how impressed I am!", "verified": true, "helpfulness": "0/0", "author": "Debra D. Trout \"faithful mom\""}]