[{"rating": 5.0, "review": "Very easy to use!  We like the portability, too.", "verified": true, "helpfulness": "0/0", "author": "Barb"}, {"rating": 5.0, "review": "Works great it is fast and has a lot of cool apps. I really like.", "verified": true, "helpfulness": "0/0", "author": "Windell Withers"}, {"rating": 5.0, "review": "Bought it on the early program for about half of normal price.  For that price its great.  At normal price, I'd be weighing each of the features with other media players.  If you have Amazon Instant Video from Prime, good addition to easily play movies/shows over most other android devices I have.", "verified": true, "helpfulness": "0/0", "author": "JK"}, {"rating": 3.0, "review": "The fire tv does what it advertises for the most part. One of the features that I wish they would improve on though is mirroring/miracast. The chromecast trumps the fire tv stick in this functionality. I tried all night to play a movie on my fire tv stick from my phone and tablet but to no avail, and the only option is to buy an app which I see as unacceptable considering chromecast does this out of the box.", "verified": true, "helpfulness": "0/0", "author": "Jose Zarate"}, {"rating": 5.0, "review": "Almost sent it back because it was slow and difficult to use at first. Amazon Prime works great. Not sure in Netflix works as good. But using it with older projection TV and got to let my laptop sleep.", "verified": true, "helpfulness": "0/0", "author": "george s williams"}, {"rating": 5.0, "review": "It basically made my TV into a smart TV. So many shows, movies, and options!", "verified": true, "helpfulness": "0/0", "author": "samiam \"Sammie Deatherage\""}, {"rating": 5.0, "review": "Terriffic application. works great. Im sending them for gifts.", "verified": true, "helpfulness": "0/0", "author": "Brian Scully"}, {"rating": 5.0, "review": "This is exactly what I was looking for to replace paying for cable!", "verified": true, "helpfulness": "0/0", "author": "G Brodecky"}, {"rating": 4.0, "review": "Love it works better than my smart tv.", "verified": true, "helpfulness": "0/0", "author": "Terry Howard"}, {"rating": 5.0, "review": "Love it! AWESOME! Works perfectly! Easy, SUPER EASY setup! Price is awesome! Apps are limited to YOUR choices & taste! On a personal note, I use it in my room when I get \"kicked out\" of the living room. I get to watch my favorite movies, tv shows & my personal favorite, WWE Network! So by all means, get it if you're not \"ready\" or price range is still out of your reach for the smart tv's, or your smart tv has less than stellar performance in the streaming department! Awesome, easy, user friendly tech!", "verified": true, "helpfulness": "0/0", "author": "Victor Bourdon"}]