[{"rating": 5.0, "review": "I LOVE MY FIRE STICK! How on earth did i live without it? Through all the different apps and games i couldnt ask for anything more,", "verified": true, "helpfulness": "0/0", "author": "Krysten Wilson"}, {"rating": 5.0, "review": "Easy to use and a definite upgrade from the Chromecast.  This does it all without the need of another device (tablet/phone) the only issue is the remote is tiny and black so it's really easy to lose around the couch then again that can happen with any remote.  :)", "verified": true, "helpfulness": "0/0", "author": "The Tone"}, {"rating": 4.0, "review": "Like the Chromecast better..", "verified": true, "helpfulness": "0/0", "author": "Sharon \"granny geek\""}, {"rating": 5.0, "review": "Love our Firestick! As Prime members, we tend to take advantage of TV and movies that Amazon offers by using our smart tv. But, not every TV in our home has that capacity. Now, they do! Small, portable, and very easy to use, we can even take our movies with us when we travel. We are also able to access the other Prime options we enjoy, like photos and music, right on the stick. We recently visited with friends after our daughter's  wedding. We just popped the Firestick into the USB port on their TV, and we were able to view the photos on their 50 inch flatscreen. Much easier than passing an album around the room. I have recommended this to many friends, and most of them listened, and purchased one for themselves. It would also be great for kids to take to college. Anything loaded on to Prime at home can be viewed by them via the Firestick. Brilliant.", "verified": true, "helpfulness": "0/0", "author": "HoneyBee"}, {"rating": 5.0, "review": "Lots of fun, wish I could keep track of the remote.", "verified": true, "helpfulness": "0/0", "author": "R. A. Massey"}, {"rating": 4.0, "review": "This is a review for the Amazon Fire TV Stick.I purchased this item at full price, after missing out on the Prime Day lightning deal.  I was not provided a free item for writing a review.  I am writing an unbiased opinion, after choosing to pay the full price for this item, and I am glad I did.I was not happy on missing out on the Prime Day lower cost.  But the product review area is not the place to let loose on Amazon criticisms.  Nobody here cares what my thoughts are about how much I paid.  If you are reading this, you want to know how the product works, and what I think of the Fire TV stick.I love it.I am a fan of Chromecast, of which I own one.  But I also wanted to get the Amazon Fire TV Stick, because Chromecast does not support Prime Instant Video.  I hate that I need both items, but I love the way my Chromecast can be used to fling my screen to the TV.  I understand that the Fire TV stick also can do this, but only with Fire TV (which I don't have).I set up my Fire Stick quickly, using the friendly on-screen help.  I began to add my apps and games.  Yes, you can add some of your Amazon games from the appstore onto your TV!!  You also can use your existing Amazon coins to make purchases.You also can have your photos display on the screen as a background...they come right out of your Cloud.  Handy dandy!I haven't tried this yet, but apparently, this Stick also works well on hotel and school dormitory systems.  I've used my Chromecast before, but had my own router plugged in.  I can't wait to try the Fire Stick all by itself.The remote is a nice addition, and you can use it as a game controller for most of the games, as well.If you have Amazon Prime and you don't yet have a Fire TV Stick, then you aren't getting the full use out of your Prime.  Go ahead, spend the $39 (as of today) to get one.  It very much is worth it, especially with the added remote, and the capability to integrate with the other Amazon features (Photo Cloud, apps, games, Instant Video, etc).  And you still can use it to access your Netflix, Hulu Plus, and other subscription services.I hope I've been helpful...I'm a REAL purchaser, and not someone getting freebies or spouting off on sour grapes without ever buying the product.Hope you enjoy your Fire TV Stick as much as I do!", "verified": true, "helpfulness": "0/0", "author": "KMC61"}, {"rating": 5.0, "review": "Convenient substitute other streaming solutions.", "verified": true, "helpfulness": "0/0", "author": "SCMEx"}, {"rating": 5.0, "review": "Very Satisfied.", "verified": true, "helpfulness": "0/0", "author": "Arati D."}, {"rating": 5.0, "review": "I get better sound and picture with my Fire TV Stick than I get with my Verizon set top box.  Much more cost effective, also.", "verified": true, "helpfulness": "0/0", "author": "William B Fegley"}, {"rating": 5.0, "review": "I love this! It is beyond great.", "verified": true, "helpfulness": "0/0", "author": "Vickie"}]