[{"rating": 2.0, "review": "Got it for 19 bucks and so far it is worth that but nothing more, loses network in mid show, very ify imho . Nice picture when u can keep it running. Not overly joyed with it , will go back to my Apple TV.", "verified": true, "helpfulness": "2/2", "author": "Beeman"}, {"rating": 5.0, "review": "works as designed - easy plug & play - great viewing & listening selections", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "Simple to assemble and easy to use right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Kali the Cat"}, {"rating": 1.0, "review": "The installation was a breeze. However the connection is not consistent & when it is up it pauses every 20 sec. I've not been able to view anything without disruption.", "verified": true, "helpfulness": "1/1", "author": "Beancounter"}, {"rating": 5.0, "review": "Just what I expected. Fire stick gets an A+ rating", "verified": true, "helpfulness": "0/0", "author": "CherylAnn \"What a great way to read ebooks\""}, {"rating": 4.0, "review": "Device seems to be OK but trouble with home signal makes it unusable at times.", "verified": true, "helpfulness": "0/0", "author": "van"}, {"rating": 5.0, "review": "Really haven't had it that long. But what I've seen I like. Surprised at the great number of movies and the diversity of subjects. I'm looking forward to getting into all the categories and options.", "verified": true, "helpfulness": "0/0", "author": "conni"}, {"rating": 1.0, "review": "Nothing is more frustrating than being told, just plug it in, login and you're set and then having your whole night held captive by uncooperative technology. I Bought this at Best Buy and the thing is a mess. Had to call customer service just to get it to log into our account. Then it just stayed frustrating. Took forever for Netflix to download, then it kept kicking out my password even though the login and password combo worked on all out other devices.  I've been looking at a load screen for PBS kids now for about 10 minutes. Pandora won't load, it loses connection to my network about every 5 minutes and the remote is very glitchy. All-in-all, I hate it!", "verified": false, "helpfulness": "1/1", "author": "Leslie Crutcher \"holmes\""}, {"rating": 3.0, "review": "It works great and is easy to use, but most TV shows have to be purchased and HULU constantly locks up on the picture.", "verified": true, "helpfulness": "0/0", "author": "Marcus Sorgatz"}, {"rating": 5.0, "review": "This device is amazing. Had I known about it in advance I would not have purchased a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Kirk Hyman"}]