[{"rating": 4.0, "review": "Okay for me.  Do not use much as I am too busy.  Think I am going to give it away.", "verified": true, "helpfulness": "0/1", "author": "HB \"Black Beauty\""}, {"rating": 5.0, "review": "I love the fire stick. I have just ditched my two hulu boxes. Will be buying one more in the future.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This should be owned by all members, one day of viewing will have paid the nominal price .", "verified": true, "helpfulness": "0/0", "author": "Muhammad Khan"}, {"rating": 5.0, "review": "I love my Fire TV Stick.  I used to have a 25 foot HDMI cable from my laptop to the tv and the Fire TV Stick allowed me to remove that.  It arrived ready to go.  All I had to do was give it my wireless network info and it was up and running.  In hindsight I only regret not upgrading to voice capabilities.", "verified": true, "helpfulness": "0/0", "author": "Jonathan L"}, {"rating": 5.0, "review": "I'm pleased with this product.  I ordered it on special and received it just before Christmas.  Since then we've been watching a lot of Prime films (I purchased prime after receiving this...it really doesn't work all that well without Prime).  So far I haven't purchased any new releases, but it's fun to go through all the old releases and there are plenty available on prime.  Until this point, my kids have probably gotten the most use out of this while watching the various kids shows that are available.  All in all, I think this item is reasonably priced and well made.  It's cheaper than most Cable TV subscriptions, and you can download Youtube which contains hours of viewing all on its own.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Walter Rhein\""}, {"rating": 5.0, "review": "This thing is great. I have a Roku, Apple TV and a Smart TV and this thing blows everything out of the water.", "verified": true, "helpfulness": "0/0", "author": "Bryan J."}, {"rating": 5.0, "review": "Love my Fire TV Stick. It's worked flawlessly since I got mine back when it first came out. No complaints about it other than wondering when they will implement the travel feature they promise. Would love to use this when traveling too. It's been long enough, let's get on that Amazon. Other than that 1 small gripe, I love this device.", "verified": true, "helpfulness": "0/0", "author": "B. Wolfe \"BMW102974\""}, {"rating": 5.0, "review": "What would I do without it!", "verified": true, "helpfulness": "0/0", "author": "Karen Appleby \"lilk13\""}, {"rating": 5.0, "review": "Fast, easy to set up/use and works great for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Easy to install. Remote is very intuitive and simple. Android app also lets you use your phone as remote.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]