[{"rating": 3.0, "review": "I loved this device, especially considering the price, until I tried to use Plex.  I've tried everything and it stutters so much that it is unusable.  Do NOT buy this for the sole purpose of running Plex.  You will be disappointed like I am.Update:  I have used the Fire TV Stick for a couple more weeks and Flex has become more reliable.  I do have to occasionally unplug the power to reset it because it says it cannot connect to my wifi.  This is bs since all of my other devices have zero issue connecting when it says this.  I purchased the stick for $20, Plex was only $2, and the Slingbox app that just came out was free.  Amazon is off to a great start with this product and this is why I'm raising my review to 3 stars.  Once I do not need to unplug this every other time I use it, I will raise to 4 or 5 stars.", "verified": true, "helpfulness": "0/1", "author": "MJP"}, {"rating": 5.0, "review": "I have ROKU 3, Apple TV, a smart TV, and now the stick.  It's the quickest way to access Amazon movies and Amazon streaming music.  I especially like the streaming music setup.  Worth getting.", "verified": true, "helpfulness": "0/0", "author": "P. Stein \"Bengals Fan\""}, {"rating": 5.0, "review": "Works just like advertised!", "verified": false, "helpfulness": "0/0", "author": "BWB"}, {"rating": 3.0, "review": "Love the easy access to Amazon Prime free content as well as Netflix. Would rate 5 stars BUT...Had to reboot (power cycle) after a few days because of wifi problems. Several other wifi devices on my network were fine but the Fire Stick said \"connected to network with problems\".  No option to reconnect either. Also,  screen casting from my Nexus 5 (lollipop) is iffy at best. Lots of pops and clicks and eventually the connection is dropped. Still,  since I only paid twenty bucks it's not bad.", "verified": true, "helpfulness": "0/0", "author": "Capt'n George \"AKA Spike\""}, {"rating": 3.0, "review": "Took a long time to load and start but it appears to be fast.  We could plug headphones into the Roku we had and this does not have this feature.  I also dislike to controller.  It is too small and cheap.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"jwimebb\""}, {"rating": 3.0, "review": "Good, but so far the connection to my wifi has been spotty at best. Awesome when it connects and works though. FYI I have xbox one, roku, phones, printer, speakers, etc. Many things connected to wifi in rooms much further away from the router than the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon4Life"}, {"rating": 4.0, "review": "I have both this and the Google Chromecast. I have to say I like them for different reasons. For playing amazon prime content this works great! Other programs, such as Netflix, work just fine! The youtube app was the same as on the Roku which is sluggish and not worth using the space with.For the movies they start more instantaneously than any other platform I've seen. Granted I do not own an Amazon Fire which is probably faster. The reason I gave this 4 stars is only because the youtube app is so bad that if I want youtube I use my phone, computer, or move the chromecast back into the room.Other than that it's a great device and I love the remote! It works like a charm.Lastly thank you Amazon for using a QWERTY keyboard in the software. it is so much faster than those that only use an alphabetical list.!", "verified": true, "helpfulness": "0/0", "author": "cortescurtis"}, {"rating": 5.0, "review": "I've only been using it for a few days but it seems so much more responsive than my Roku.  It's fast, intuitive, and responsive.  I couldn't ask for anything more.  Love it!  It's working great so far.  Great deal for $19.99.", "verified": true, "helpfulness": "0/0", "author": "Corey Schoonover"}, {"rating": 2.0, "review": "Took forever to install. Also had to go online to figure out how to put in the batteries in the remote. There is no clear indication on how to unlatch the back cover and most users are afraid that they would break the remote with too much pulling/pushing.When you turn the tv off while watching anything from amazon, and then restart, and change the tv input source to normal cable, the fire would automatically switch to its own input source after maybe a minute. Annoying as heck.The smallish remote has keys that appear too stiff, and the onsceen search functionality takes some getting used to.Screen would routinley go black and the stick will routinely restart/reboot in the middle of playback- not very frequently but often enough to be annoying.Once a video is launched, then it plays smoothly.Can't recommend at $40 but at half the price, during thanksgiving etc, it might be just a barely ok accessory.Just has too many pieces in motion, unlike say the chromecast.", "verified": true, "helpfulness": "0/1", "author": "Bikramjit Ganguly \"Icandy\""}, {"rating": 3.0, "review": "The remote is iffy... Keeps having issues with the remote skipping.", "verified": true, "helpfulness": "0/0", "author": "Shea Cordova \"Shea C.\""}]