[{"rating": 3.0, "review": "Its not the greatest selection but to take advantage of my prime membership, it is pretty good. With no outputs other than HDMI, I grab the audio from my TV's outputs to send to my soundbar. Since I only have optical out and no more free optical ports on my soundbar, I picked up an optical to analog converter for a few dollars- Portta PETDTAP Digital Coax and Optical Toslink to Analog Audio Converter", "verified": true, "helpfulness": "0/0", "author": "Ripple"}, {"rating": 2.0, "review": "Was greatly looking forward to this product.  Now I am seriously disappointed that I made the purchase.  I have yet to get through an entire hour long episode or an entire movie without having some sort of buffering interruption.  My Wi-Fi works great on all other products so that isn't the issue...", "verified": true, "helpfulness": "0/0", "author": "Megan Erk"}, {"rating": 5.0, "review": "Bought for my college age daughter - she went nuts, i think she downloaded 90% of what Amazon offers.  Very impressive - I prefer this to my Apple TV any day and its portable!", "verified": true, "helpfulness": "0/0", "author": "WV Mountaineer"}, {"rating": 5.0, "review": "I love it!, It took all of 5 minutes to set up and I immediately started watching the \"Bosch\" series.  What a bargain!", "verified": true, "helpfulness": "0/0", "author": "Doreen \"Doreen in Port Orange\""}, {"rating": 5.0, "review": "I love this product. It was easy to install. The remote came with batteries. I primarily use to watch Amazon Instant Video and Netflix. I personally don't use it for gaming so I can't attest to how well the games work. The price is definitely right and the quality is great.", "verified": true, "helpfulness": "0/0", "author": "val"}, {"rating": 2.0, "review": "I have the regular FireTV for my main televisions and purchased the FireTV stick on the $19 early buy deal.I am very disappointed that there are programs that run on the FireTV that do not run, or simply are not available, on the FireTV Stick.  This was not mentioned anywhere in the advertising for the FireTV stick.  I assume it has to do with storage limits, it would have been nice to know this up front as all the advertising makes it look like these are identical as far as operation goes.If you want basic streaming and simple games on the cheap this may be an option for you, but I don't recommend it if you are expecting full FireTV functionality.", "verified": true, "helpfulness": "0/0", "author": "T. Dennis"}, {"rating": 4.0, "review": "Very well built device. Used in my bedroom to replace a WII for streaming video. Does well and is very responsive.", "verified": true, "helpfulness": "0/0", "author": "Mishakal"}, {"rating": 4.0, "review": "Easy to set up. Picture is stunning. Fast and no delay when you turn on your TV. Was able to pair with Fire Phone and use it as remote control but took some time to make it work. Miracast works which is great. Nice set of apps but there are some missing that are must have: HBOgo, network television (ABC, CBS, NBC, Fox), Xfinity online. I use those half of the time I turn my TV on and that comes from my laptop.For any apps that is missing, I just stream it using Miracast from my Fire Phone. Prime Music and cloud music was what sold this stick to me and it did not disappoint. I can't believe they'd sell this only for $39. Now if only I can watch new release movies in HD for $2 I would be happy so I don't have to drive out there to get it from Redbox. If they add those channels I listed, this would be a slam dunk 5 star. There is a bug where it would disconnect from Fire Phone for no reason. Also, the remote app does not even connect no matter what you do most of the time so this is still very buggy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install, for sure.  So far, I have no complaints. I'm able to view my Netflix and free movies with my Amazon Prime membership. I haven't used any other features, yet.  Good value.", "verified": true, "helpfulness": "0/0", "author": "Foodiewife \"Wife, mom, full-time employee, food blogger... reading is my addiction. I love audible books during my commutes and doing chores!\""}, {"rating": 5.0, "review": "Love it and the setup was very easy.", "verified": true, "helpfulness": "0/0", "author": "T. Kim"}]