[{"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Sabrina"}, {"rating": 5.0, "review": "Got here quick ! Love it", "verified": true, "helpfulness": "0/0", "author": "kell wood"}, {"rating": 5.0, "review": "Absolutely love the Fire TV Stick!! So easy to install and so much available. Great product.", "verified": true, "helpfulness": "0/0", "author": "J Brown"}, {"rating": 5.0, "review": "Love it.  Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Jetpack"}, {"rating": 5.0, "review": "We're loving our Amazon Fire TV Stick.  We're a couple in our 60's, and don't have some of the apps that other (younger) people have...Netflix, Roku, etc.  But we enjoy the Prime Movies for free and have found some really good ones that weren't in theaters.  Honestly, we don't watch a lot of movies, so this does the job for us and we're extremely pleased with it.  Set up was easy (even for a 63 year old woman).", "verified": true, "helpfulness": "0/0", "author": "Scorpio3813"}, {"rating": 4.0, "review": "I like it!", "verified": true, "helpfulness": "0/0", "author": "Troy council"}, {"rating": 5.0, "review": "Love it! So easy to use and movable for traveling!", "verified": true, "helpfulness": "0/0", "author": "jacbrooke"}, {"rating": 5.0, "review": "Yes! Hello Fire TV Stick, Bye-bye Chromecast.  Slingplayer never worked well on the chromecast.  Works great on Fire Tv Stick.", "verified": true, "helpfulness": "0/0", "author": "Todd May"}, {"rating": 4.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Rajender R Katkam"}, {"rating": 3.0, "review": "Whoopee Doo!  First... Amazon is starting to charge for movies that were previously free.  This I experienced on my own as well as what a good friend has mentioned.  One weekend he started playing a movie and decided to finish it later.  A few days later he went to resume the movie and Amazon changed it from free to pay to watch.  For streaming video, Netflix is the SIMPLEST and CHEAPEST way to go.  The Firestick is great if you want to get literally bombarded with all kinds of choices and then when you find a movie you'd like to watch, all too often you HAVE TO PAY for it!  And I'm talking about a ten or fifteen year old movie.  Sometimes as much as fifteen dollars!  Amazon should break up the endless genre's and menus into more definable choices based on the owner's age group and preferences then gives us the option to block out the types of movies we have no desire to watch.  Blocking out all the kids' movies (Curious George) for example would be one step in simplifying our menus .  Yeah, maybe I'm a little old school, so all I can say is bring back Block Buster or Hollywood video rentals!Firestick is totally T-M-I.", "verified": true, "helpfulness": "0/0", "author": "Victor L. Frazee"}]