[{"rating": 5.0, "review": "i love it - after being an A tv fanatic adding this basic stick to my life has redefined my layers of on demand tv - my only regret is not getting the FIRE TV stick sooner!  Waste no more time, get it NOW", "verified": true, "helpfulness": "0/0", "author": "William F."}, {"rating": 5.0, "review": "This is a handy little gadget! I wish my prime account had access for more shows and movies but this piece of equipment works really well!", "verified": true, "helpfulness": "0/0", "author": "Bekie March"}, {"rating": 5.0, "review": "This is exactly what we needed to watch our Netflix and On Demand shows on our flat screen. Super easy to set up and move to different TV's in the house.", "verified": true, "helpfulness": "0/0", "author": "Cait M"}, {"rating": 5.0, "review": "Very happy with my purchase. Online videos gave me all the info needed to connect and start viewing.", "verified": true, "helpfulness": "0/0", "author": "Pa from Cincy"}, {"rating": 1.0, "review": "This does not work!  I've called & been with reps who ask the same questions and I got no results.", "verified": true, "helpfulness": "1/2", "author": "Fern"}, {"rating": 3.0, "review": "Amazon Prime does not appear to offer any more movies or have a better selection of very current releases than Netflix or Redbox. What does the Prime membership bring to the table???", "verified": true, "helpfulness": "0/0", "author": "Greg Hermanson"}, {"rating": 3.0, "review": "I was disappointed with the fact that I still need to pay my monthly fee in order to watch Netflix, and Hulu, it's all there, but you still need to be a member to it and pay to watch it.  I was hoping with the fire stick I would have it all without the 2 other monthly fees.  and as far as subscribing to the Amazon Prime,  I do not have the best Internet service and it's limited so I can't watch all the movies and stuff, but other than that, I'll still keep it and hope some day I have better Internet service.", "verified": true, "helpfulness": "0/1", "author": "Terri"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Juan Gomez"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Inga"}, {"rating": 3.0, "review": "Disappointed in the selection of movies and TV shows available with prime.", "verified": true, "helpfulness": "0/0", "author": "Sarah Llewellyn"}]