[{"rating": 4.0, "review": "Seems to lag occasionally. Have to unplug and let reboot.", "verified": true, "helpfulness": "0/0", "author": "John F."}, {"rating": 4.0, "review": "Everything that was expected", "verified": true, "helpfulness": "0/0", "author": "David Simcox"}, {"rating": 5.0, "review": "it great easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "robert gerasia"}, {"rating": 5.0, "review": "Pre-ordered my Fire TV stick before its official release and I am SO glad I did!If you own a Roku or Smart TV with apps, its basically the same premise.I have this and 2 Roku's, and I use them equally, just in different rooms.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Bridget Fontenot"}, {"rating": 5.0, "review": "Very pleased with Fire Stick. I have begun to watch a lot of streaming moviies during the cold winter days. Thanks.", "verified": true, "helpfulness": "0/0", "author": "Kerry Metz"}, {"rating": 1.0, "review": "Haven't exhausted all possibilities yet, but so far, it just loads and loads and loads.  Hoping it's just a weak wifi signal, though a solution to that won't be easy given router and TV respective locations.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Followed directions and was up and running in about 15 minutes. Works extremely well. Remote control a little small for my big hands but okay once you get used to it.  Would recommend to anyone looking for a quick installation for movies and apps.", "verified": true, "helpfulness": "0/0", "author": "Harry D. Weeks"}, {"rating": 1.0, "review": "Disconnected from network all the time.", "verified": false, "helpfulness": "1/2", "author": "daniel"}, {"rating": 1.0, "review": "The bad thing about it is that it doesn't let you know that it is not wireless, you have to plug it in for it to even power on. People says the Google chrome stick is better and I'm starting to think they were right.", "verified": true, "helpfulness": "1/4", "author": "Alejandra"}, {"rating": 3.0, "review": "The idea of it was nice and I liked that it had YouTube and could connect onto all the other movie streaming apps I am subscribed too but the reason I'm returning is that though it had good apps and variety its connected to wifi and sadly my wifi is not fast enough so there is a lot of lagging which can really suck when you are watching a movie and there is lag and its worst when you have anyone oh their devices using wifi. Anyways thought it through and still think it's good for those with good wifi but not for me. Oh well. Also I will mention that the smallness of the stick and the slick design of the remote is pretty cool so aesthetically its on point!", "verified": true, "helpfulness": "0/0", "author": "joshua and mimi \"joshmimi\""}]