[{"rating": 3.0, "review": "No access to HBO Go or HBO Now or HBO Whatever is a huge disappointment. Access to HBO would change my rating to 4 stars.The YouTube app is not as fluid as the Web application; if there is a Search function, it is not easy to find. My workaround involves using another computer to make YouTube content available via one of my playlists.The photo of the Fire TV Stick does not include the adapter, which is misleading; it makes the Stick look like it is powered by the TV. This is not the case.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 4.0, "review": "This works great but the remote is really sensitive and a little spendy for my taste.", "verified": true, "helpfulness": "0/0", "author": "Shawn Espeland"}, {"rating": 5.0, "review": "This thing is awesome. My gf loves to watch tv while I play on the computer. Sometimes the interface is a little confusing but that has nothing to do with the physical product!", "verified": true, "helpfulness": "0/0", "author": "Luke Shaffer"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Jesus Patino Ruiz \"j\""}, {"rating": 5.0, "review": "Love being able to watch Netflix and see my photos on the large tv.", "verified": true, "helpfulness": "0/0", "author": "JB Missouri"}, {"rating": 5.0, "review": "Love this product. Way better then chromecast. I bought the amazon fire stick tv and love them both. I have a plex media server and I stream all of my movies to my fire stick. There is no lag at all. Love this product. Would recommend it to anyone looking for a streaming service.", "verified": true, "helpfulness": "0/0", "author": "Michael Ganesan"}, {"rating": 5.0, "review": "gave my not so smart TV SMART...", "verified": true, "helpfulness": "0/0", "author": "Gladys Mitchell"}, {"rating": 4.0, "review": "Liked it once I figured out how to use it!", "verified": true, "helpfulness": "0/0", "author": "Phyllis A. Stewart"}, {"rating": 4.0, "review": "Love this. I had a first edition Samsung Smart DVD player, and it was doing a little worse for wear lately. Slow, and had serious performance issues with apps. Upgraded to this and I like it so far. Only issues is that it has problems connecting to my Wi-Fi router one room away. It has to buffer a lot. Im sure it will be fine once I move the router into the same room. Other than that, very quick to navigate.", "verified": true, "helpfulness": "0/0", "author": "Samantha Rose"}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Beulah tackett"}]