[{"rating": 5.0, "review": "So happy to be rid of my cable bill.", "verified": true, "helpfulness": "0/0", "author": "Carol Purvis"}, {"rating": 2.0, "review": "Bought it for my son.  He was very disappointed in it.  Nothing is free, you have to sign up for Hulu Plus and Netflix Plus.  He doesn't have cable and thought this would be faster but it was slower than watching things on his laptop.  Very disappointed.  One good thing, Amazon is amazing for returning things.  Makes it so easy and money is returned on time.  That's why we buy so many things with Amazon.", "verified": true, "helpfulness": "1/2", "author": "Betsy Keating"}, {"rating": 5.0, "review": "It works great", "verified": true, "helpfulness": "0/0", "author": "Jenna"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "joaquin gonsalves"}, {"rating": 1.0, "review": "Bought this device when it was first released back in November. It is now June (less than a year of use) and it has completely failed and will not connect to my wifi network even though it is literally right next to it. After researching this issue, it seems this a wide spread error and no one has found a solution yet and Amazon has not produced a patch to fix this. This is unacceptable and I will never purchase another Amazon streaming device again. You have been warned.", "verified": true, "helpfulness": "0/0", "author": "Xavier"}, {"rating": 5.0, "review": "Very happy that I have a smart tv. Just wish prime had more things to watch that I wanted to watch.", "verified": true, "helpfulness": "0/0", "author": "Ellielasherw"}, {"rating": 5.0, "review": "The Amazon Fire Stick far exceeded my expectations. The video quality is phenomenal as well as the sound. There are so many apps for this it is ridiculous. If you look it up there are tons of ways to get much more out of this unit than meets the eye. All in all this unit pays for itself in a single day, go for it you'll be glad you did.", "verified": true, "helpfulness": "0/0", "author": "Darius Phiffer"}, {"rating": 5.0, "review": "Delivers as expected", "verified": true, "helpfulness": "0/0", "author": "Katez Marshall"}, {"rating": 5.0, "review": "Very happy.", "verified": true, "helpfulness": "0/0", "author": "HAPPY CUSTOMER."}, {"rating": 5.0, "review": "Great product. Buying the SLING subscription gave me over $120 a month vs cable. I would highly recommend to anyone who wants quality TV without the price of cable or satellite", "verified": true, "helpfulness": "0/0", "author": "lcbpapa"}]