[{"rating": 4.0, "review": "no kodi", "verified": true, "helpfulness": "0/0", "author": "william canfield"}, {"rating": 5.0, "review": "This device is a great buy.  It has many more apps than I thought when I bought it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Could not get device to connect to network.  Called ISP and they said they have a lot of complaints about the Firestick.  Technician configured a new network which allowed the device to connect but would not maintain connection.  Tried watching Netflix.  Constant buffering then lost connection.  HDMI extender did not help.  Chromecast works fine.  Returning Firestick.", "verified": true, "helpfulness": "0/0", "author": "Gary K."}, {"rating": 5.0, "review": "I purchase this to give it as a gift. I do not regret it. This device has been great and has worked perfectly since I bought it. It is a great gift that is being use on a daily basis. Would recommend it to anyone who is looking to have their first streaming device.", "verified": true, "helpfulness": "0/0", "author": "Alberto Acosta"}, {"rating": 5.0, "review": "great product. recommended 100 per cent", "verified": true, "helpfulness": "0/0", "author": "Bert"}, {"rating": 5.0, "review": "Just what we were looking for for our RV-works great and not complicated or bulky!", "verified": true, "helpfulness": "0/0", "author": "lildeb19"}, {"rating": 5.0, "review": "So far I am enjoying it. Very easy to set up. Still on the 30 day free trial. Have not activated any premium stuff like Netflix. Enough for me to watch for now.", "verified": true, "helpfulness": "0/0", "author": "Toyman"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "demetriusl"}, {"rating": 5.0, "review": "Just awesome...", "verified": true, "helpfulness": "0/0", "author": "Anthony Joseph"}, {"rating": 5.0, "review": "I got this as a gift for someone and from they tell me is that they love it. The experience they have with it is awesome. No lag. No issues. Simple to use. I would recommend this to anyone as a birthday present or whatever. It's awesome. 10/10", "verified": true, "helpfulness": "0/0", "author": "Jacob"}]