[{"rating": 3.0, "review": "Only thing that bothers me is not having a browser like IE or Chrome or something like that as a service in this TV Stick, rest good. I know atleast 15 friends who did not by Amazon TV Stick just coz it does not have browser.", "verified": true, "helpfulness": "0/0", "author": "Saurabh Pahuja"}, {"rating": 1.0, "review": "Has great promise if you're in the Amazon ecosystem and, for the price, this could be a good purchase if and when Amazon deals with the wi-fi connection issues. It's a widespread problem that is acknowledged by Amazon, but so far they don't have a fix for it. Until they can make this product work reliably, it gets one star. If you're contemplating a purchase, hold off until it's confirmed that they have resolved this.", "verified": true, "helpfulness": "0/1", "author": "Bruce Mc \"Bruce Mc\""}, {"rating": 2.0, "review": "I have two major streaming devices and all the current gen, last gen, last last gen and a few other game systems.  I saw that I could get the Fire stick for $19.99.  I got it for the games.  It arrived today.  I was surprised I had to plus it into the wall.  Not sure why, but I thought it was powered by the USB.I had already gotten a bunch of free games to play.  I turn it on and almost none of the games work.  I thought that all the fire TV games would work on the thing.  I was wrong.  So, that kind of bothered me.  I am sure it says on their site.  But I have 8% of my vision, so I often miss things.  On top of the let down of the limited games that would work, for the few that did, only one of them worked.  It kept telling me I did not have the right controller.  So, they sell you a device that requires you to purchase another device to use it at it's full potential.  That was the second let down.I started the game.  I was shocked.  The thing is so slow.  Of all the devices I have, it is by far the slowest.  On top of that, when it was not slowing way down, the thing would just freeze.  I would just be starting at a frozen screen.  That was it.  I had thought of getting the Fire TV with the controller to play games, but realized that would be rather pointless.  If I have the Fire TV, there is no need for the stick.  Thus, I am returning my Fire TV Stick, whenever UPS picks it up.  This thing was a huge letdown.  If you want this for games, I would highly suggest you get the full Fire TV.I forgot to mention what I did like.  I really liked the setup of the thing.  Everything was easy to see and navigate.  If you are a Prime member, you should check out the Fire TV.  I just can't recommend the stick.", "verified": true, "helpfulness": "0/1", "author": "Joshua Glowzinski \"Gman\""}, {"rating": 4.0, "review": "The firestick is very responsive. Much more so than the Roku stick. The physical remote is a nice touch, too.The sub extender is great.The parts don't feel cheap to me.The user interface could use some work. It's just a wall of tiles, with a very odd hierarchy.When's iOS app coming?", "verified": true, "helpfulness": "0/0", "author": "ChrisandAmy Baunach"}, {"rating": 5.0, "review": "Wow, I just setup my Fire TV Stick this evening, and I am very impressed with this little device.It's well, designed, well packaged, easy to connect and I love the interface on this! I was up and listening to my music with in a minute. The Fire TV Stick combined with your Prime account makes accessing video, games and music a no-brainer.I have a Sony Google TV box that I bought last year, and the Amazon Fire TV stick blows it away in every category-- access/ interface design, speed, and content.If you are looking for a great gift for Christmas, it's totally affordable. If you've got WiFi at your place, it's a great way to save money and say goodbye to cable!", "verified": true, "helpfulness": "0/0", "author": "Will \"Will\""}, {"rating": 5.0, "review": "I enjoy using this. I havhave 2 Chromecast aND bought this day one when it was on sale. It took forever to come in but that was expected considering.Usability is easy, easy setup and content so far is good. I use all cast with showbox and the fire stick has access to it. So I was able to stream those movies too. All around a great product. Hope it has a bright future.", "verified": true, "helpfulness": "0/0", "author": "Justin \"j-ster\""}, {"rating": 2.0, "review": "When it works I really like it.  Plays Netflix,  Prime and Plex just fine.  I like the user interface as well.  Fantastic value for the money but the problem I am having is it keeps dropping off WiFi every now and again.  The only fix is to unplug it and let it reboot.  The software has no system reset option which would make life much easier.  I have two different wireless routers and it does this with both.  If feels like a software bug rather than a defective unit and I have read many complaints about this online.  I may try and get Amazon to replace it... I am sure they would but I have been hoping for a software update to fix the issue.", "verified": true, "helpfulness": "1/2", "author": "Cognizant"}, {"rating": 5.0, "review": "I own a Roku 3 and a Fire TV stick. Dollar for dollar, the FTV is the best deal out there. Dont be swayed by Rokus thousands of channels, most are terrible. The main ones are all available to both services. The real advantage of a Roku 3 is the search options (which searches all content providers) and speed. It takes 2-3 seconds longer to boot a show with the stick than the 3. To be fair, the R3 is the top of line so it should be fast. I have seen the top of line Fire TV and it is even faster than the R3. For the price, buy it and enjoy.", "verified": true, "helpfulness": "0/0", "author": "from50613"}, {"rating": 5.0, "review": "For the price, this was an impressive buy. It works as advertised. I wish more of Amazon's content was free with my Prime membership. That detracts from the value of this little gadget. But for viewing Netflix and youtube videos, I couldn't be happier.Amazon should be showing all advertising photos with the required power adapter plugged in. I know it looks less sleek, but not showing the adapter seems kind of like false advertising.", "verified": true, "helpfulness": "0/0", "author": "David hach"}, {"rating": 4.0, "review": "Can't figure out how to search for a movie", "verified": true, "helpfulness": "0/0", "author": "linda abitz"}]