[{"rating": 4.0, "review": "It would be better if the processor was faster, a little slow to load things.", "verified": true, "helpfulness": "0/0", "author": "Robert C."}, {"rating": 3.0, "review": "Good cord cutter option. Content wise it offers almost everything. Very easy to use. Menu options are a little confusing to some in my family. I setup pin requirements after a few programs were accidentally purchased. Speed is the biggest issue. Menus can be slow to respond. Streaming speed is slow at times. I do prefer very much to the Roku stick and Roku 2. Picture quality is very good.Still my three year old + Apple TV blows the Fire TV stick away in menu organization and overall speed and performance. I really only use the Fire Stick for Sling streaming. Once Apple brings their streaming service in this fall I doubt I will continue using the Fire TV stick. I did try the Fire TV full size and it was much more responsive. I just did not want to pay that much (I have three TV's , each with a Fire TV stick and Apple TV). I'm saving $127 a month after dropping cable. I hear the Roku 3 has good performance. Still I think the Apple TV is a better streaming device with one exception, content. That will change once they go live with their streaming service I think.", "verified": true, "helpfulness": "0/0", "author": "George F."}, {"rating": 4.0, "review": "Love it. The only drawback is that you have to purchase a lot of the good movies.", "verified": true, "helpfulness": "0/0", "author": "Dannielle Schwab"}, {"rating": 5.0, "review": "This device is great. I preordered it when they had it for 50% off ($20) which was even better, but now that it has HBO GO there is really nothing you want that it cant do. It runs smoothly and integrates with your TV well. Also assuming you have a USB port on your TV you don't need to plug it into a wall at all.Very happy with the 2 I bought", "verified": true, "helpfulness": "0/0", "author": "Gregory A Brown"}, {"rating": 3.0, "review": "One of the reasons I was thinking of buying this was to cast my Kindle Fire HD to my TV. After numerous attempts, I was able to pair it with my friend's Fire TV Stick so I bought my own. Since setting up my Fire TV Stock, I have not been able to cast my Fire or my phone to it. This really seems temperamental. I did use this to watch the PBS channel and it works great for that and I want to try some of the games, but considering the casting was one of the primary reasons I bought this, I'm pretty disappointed.", "verified": true, "helpfulness": "0/0", "author": "hoosudaddy \"MS IT GUY\""}, {"rating": 4.0, "review": "Great value, It replaced Chrome Cast for me. One thing I wish they could improve is the speed, works perfectly most of the time but sometimes is starts to slow down but overall it's great.", "verified": true, "helpfulness": "0/0", "author": "Feras"}, {"rating": 5.0, "review": "Love the fire stick. It does exactly what I wanted. I'm enjoying all new movie options. Very easy to install and work.", "verified": true, "helpfulness": "0/0", "author": "jmordvar"}, {"rating": 5.0, "review": "Love it use it daily on 47 inch flat screen in bedroom awesome picture", "verified": true, "helpfulness": "0/0", "author": "Al Grytebust"}, {"rating": 5.0, "review": "Easy to install. So far we love it.", "verified": true, "helpfulness": "0/0", "author": "web  shopper"}, {"rating": 3.0, "review": "I thought that I would be able to get more free stuff and internet on TV.  I was not prepared to pay more as I already pay Directv.  Others say I should have gotten another brand instead of Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Mona W. Banton"}]