[{"rating": 5.0, "review": "We love it.", "verified": true, "helpfulness": "0/0", "author": "Cora Brush"}, {"rating": 4.0, "review": "Excellent product. Fast responsive. The remote is a plus. Please have more apps for iOS devices.", "verified": true, "helpfulness": "0/0", "author": "Sopheak Real"}, {"rating": 5.0, "review": "Use it everyday !", "verified": true, "helpfulness": "0/0", "author": "cryoforever"}, {"rating": 5.0, "review": "So far so good.  Haven't had a lot of time to play with all the features but set-up was easy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Bandaid55\""}, {"rating": 5.0, "review": "Absolutely Awesome! I wish it wasn't back ordered - I'd buy a bunch for Christmas! I have Chromecast but find it a bit cumbersome to use. It also does not have access to Amazon...which was key. Easy to set up - easy to use!", "verified": true, "helpfulness": "0/0", "author": "Johannah Curtis"}, {"rating": 5.0, "review": "We love our Fire TV Stick. Quick & Responsive. Streaming is a breeze. 1GB memory and extra storage is a plus. Paid the discounted pre-order price. $39 is a bit much but is definitely a more cost effective solution to upgrade to a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Debra N. Lowery"}, {"rating": 2.0, "review": "Audio while using the Fire TV stick will intermittently have a short buzz sound.  It is very distracting and takes away from the experience.Occasionally, it will shift the displaying of the video in a way that cuts off about a third of the right side of the picture.  This affects the home screen and the apps.  If I reset the stick it will work for awhile.Others have mentioned the difficulty in opening the battery compartment on the remote.  The design was not intuitive, but I was able to figure it out.  And the stick had to reset a couple of times during an update.But these issues were not near as much of a problem as the screwy audio and chopped off video.  I'm disappointed and feel that the promotional $19 was too high for the product I'm experiencing.", "verified": true, "helpfulness": "0/0", "author": "L. Newton"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "I love my Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Terrence"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was more than I expected.  It has the capabilities of my Roku with the portability and ability to cast from my phone or tablet like Google's Chromecast.  Best of both worlds.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]