[{"rating": 5.0, "review": "Meets and exceeds. I have the two Fire TV Sticks, before I tried it out I had a bought a Roku. Hands-down I will always prefer the Fire TV Stick.I'm a gadget junkie and this is right at the top of my list.", "verified": true, "helpfulness": "0/0", "author": "W. Jones \"TheWizard\""}, {"rating": 1.0, "review": "I was very disappointed with the Fire Stick. I purchased a chromecast the se week as the Fire stick. I believed the Fire stick was better quality but I was most certainly wrong about that! The Fire stick would barely work! It would rarely connect to the wifi and if by some miracle it connected it would not stay connected. All of my other tablets and devices were connected to the wifi including the chromecast that worked each and every time I used it! the Fire Stick is just not a good product. It just simply does not work.", "verified": true, "helpfulness": "0/0", "author": "Georgja Carter"}, {"rating": 4.0, "review": "It does everything it's says its supposed to do. Wish it had the voice activation like the firebox.", "verified": true, "helpfulness": "0/0", "author": "Who summit lover"}, {"rating": 2.0, "review": "spotty wifi connection. Have not tested it on a tv closer to my router to see if that improves connection.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love it! It's easy and works awesome!", "verified": true, "helpfulness": "0/0", "author": "veronica flores"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is phenomenal! I own 2 Roku 3's, and Amazon Fire TV Box and got this Stick free with a 3 month subscription of SlingTV. This is my GO TO device when I'm on the go. Hotels, in-laws, etc. I no longer take my laptop or ipad when traveling for work. I just grab my AFTS and know that I'll have access to my Plex Media Server, Sling, Netflix, Amazon Prime, and so much more. If you have anything other than a Roku 3 or AFTB and are looking to upgrade for a minimal cost, the AFTS is clearly the best choice. It out performs the Chromecast, older rokus, and most smart TVs. Take it from a computer/electronic junkie and pick this thing up!-WillThis product loses quality in the microwave. :)", "verified": true, "helpfulness": "0/0", "author": "William Hayward \"BoNkErS\""}, {"rating": 1.0, "review": "Was not compatible with our Samsung TV.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Love it. It's simple to use and very cost efficient.", "verified": true, "helpfulness": "0/0", "author": "Maddie J"}, {"rating": 5.0, "review": "Great Device, Everything worked as advertised. Couldn't ask for anything more.", "verified": true, "helpfulness": "0/0", "author": "Assad"}]