[{"rating": 3.0, "review": "I'm pretty disappointed in the Fire Stick, and relieved I bought it on sale and not full-price.It's complicated to navigate, because it tries very hard to keep you in the Amazon Prime world; it's tough to locate other apps, and the search isn't global which just SUCKS. I hate having to go to specific apps to search and find whatever show I was looking for. The remote app on Android phone is a great idea, but it's clunky to use in reality. Overall, I really am just disappointed cause I was so excited for this thing, and now I wished I'd gotten a Roku or even Chromecast.The biggest disappointment is that you can only \"fling\" (cast) content from a Fire device (Amazon phone or tablet) and only Amazon content, though apparently other apps will soon be able to be shared as well? Anyway, this is my first night using it, and it was such a disappointment compared to how it was marketed that I've already turned it off and actually just ordered a Chromecast. Perhaps, as they make improvements, this thing will live up to Amazon's hype, but for now, it's a much lesser version of other streaming options, UNLESS you exclusively watch Amazon Prime video and primarily use Amazon devices, then it's pretty cool.", "verified": true, "helpfulness": "1/1", "author": "Tawn"}, {"rating": 1.0, "review": "i was hoping i would liike this since there are amazon shows i would like to watch. i was so DISSAPOINTED because i couldn't make it work in any of my hd tv's. it also did not work in my apple computer HDMI port . i did not want to force the device and ruin my equipment or the fire stick. so i am sending it back. i should not have to buy some other kind of hdmi thing to make it work. i am sticking with my completely great apple tv. it fits into all the hdmi ports and does not have to be forced. and it is a pleasure to use.too bad this is flawed.", "verified": true, "helpfulness": "3/7", "author": "sc oakland"}, {"rating": 1.0, "review": "Garbage. Really poor wifi reception, can't maintain a connection and can't play a single video without stuttering. Also, no way to power off, so if your HDMI ports are auto switching, this is not the product for you.", "verified": true, "helpfulness": "2/3", "author": "K. Barrett"}, {"rating": 1.0, "review": "Still haven't been able to watch anything on it. After 2 hours of trying, I was finally able to get it to accept my router password. It played the intro video, and I can see the main menu, but it won't let me download or access Netflix or anything else. When I click on a Prime movie or show it tells me that I can watch for free with a Prime membership (which I have) and it takes me to the trial membership screen. The device is pre installed with my Prime info, and it acknowledges me. I've done everything, and cannot keep an internet connection. I even moved my furniture so my tv would have a better signal to the router. Good signal, bad connection. Very disappointed, and I hope Amazon makes good of their poor product. My daughter has a generic streaming box that works much better. I waited a month and a half for this to arrive, and missed Black Friday deals on other streaming devices because I thought I was getting something of Amazon worthy quality. According to other reviews, it seems to be luck of the draw with these devices. I got a bad draw.", "verified": true, "helpfulness": "2/3", "author": "Loren Price"}, {"rating": 5.0, "review": "I have had a good experience so far.  I bought the stick as soon as it was offered.  I thought I would use it on a bedroom TV and take it with me when I travel.  It installed flawlessly and I am able to plug it in to a surge protector right behind the screen so that it is completely hidden from the front.  It comes registered to your Amazon Video account and I immediately installed Netflix and Hulu.  It doesn't have as many channels as the Roku 3 on my main TV, but frankly I didn't care because I have the most important ones.  I like the design and think it is perfect for the purpose.", "verified": true, "helpfulness": "0/0", "author": "La Jolla Library User"}, {"rating": 5.0, "review": "Just installed it tonight & it works great. A little disappointed that Showtime Anytime can't be accessed as my cable provider (Charter Communications) isn't listed yet. I can access Showtime Anytime via my computer & Android tablet app. Think it is because it is a newer device. Charter supports Roku & other mobile devices. Hopefully the cable provider list grows over time because that is one of the reasons I bought the device was the selection of supported apps.", "verified": true, "helpfulness": "0/0", "author": "D. Loenneke"}, {"rating": 2.0, "review": "setting up the Fire TV Stick was easy, staying connected is impossible. After multiple attempts (unplugging and replugging) of trying to establish a stable network connection, the connection would last no longer than 4 minutes (probably not even 4minutes). I'm disappointed, and will not recommend this product to anyone, should've went with roku.", "verified": true, "helpfulness": "0/0", "author": "timcampy"}, {"rating": 4.0, "review": "I really love it. Only issue is the length of the power cord but we managed to solve that.", "verified": true, "helpfulness": "0/0", "author": "Nicole Kolb"}, {"rating": 5.0, "review": "was a simple plug and  play  I really like it", "verified": true, "helpfulness": "0/0", "author": "Linda A"}, {"rating": 5.0, "review": "From what I can tell it works really well and was not too difficult to complete installation on your TV.", "verified": true, "helpfulness": "0/0", "author": "Brigid"}]