[{"rating": 5.0, "review": "This is our second stick. Great item to have!", "verified": true, "helpfulness": "0/0", "author": "Karen M. Daley \"musclemadness\""}, {"rating": 5.0, "review": "This thing is terrific,coupled with Amazon Prime I don't see what more one would need to view good TV.Set up was very simple...now after all of the praise,let's see what the longevity is for this fairly priced item.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Ravenwolf\""}, {"rating": 5.0, "review": "Love this! Travel with it, use it at home. This is my second purchase.", "verified": true, "helpfulness": "0/0", "author": "eking"}, {"rating": 3.0, "review": "Limited apps. Thought this would work as well as my son's smart tv. It didn't. I have great internet signal but it buffers a lot on my 47 inch tv.", "verified": true, "helpfulness": "0/0", "author": "JUDY L"}, {"rating": 5.0, "review": "It's better and more than I expected.. I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "james loot"}, {"rating": 5.0, "review": "It was really easy to install has been working great!", "verified": true, "helpfulness": "0/0", "author": "Andrea"}, {"rating": 5.0, "review": "The liked it so much, I got a second one and dropped my cable", "verified": true, "helpfulness": "0/0", "author": "Craig Roberts III"}, {"rating": 2.0, "review": "Poor wifi reception. If you have a home larger than 1000sq ft it will not work.", "verified": true, "helpfulness": "0/0", "author": "Laurie Kay Dib"}, {"rating": 1.0, "review": "I was not please with the Fire TV stick. It was constantly freezing and saying there was no network connection. I exchanged it for Roku 2. Love my Roku!!", "verified": false, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 3.0, "review": "Constantly loses connection with my wifi. This thing is useless. Very frustrating. Glad I didn't get rid of satellite like I had planned.*UPDATE*After reading some of the answers to the issue of the dropped wifi connection I got the hdmi extender cable out of the box and taped my fire stick vertically to my tv. It hasn't lost the connection since. I hope this helps someone else going through the same problem.", "verified": true, "helpfulness": "0/0", "author": "Hobson6 \"Hobson girl\""}]