[{"rating": 1.0, "review": "Not happy with performance . Stick keeps shutting down saying there is a internet issue . Signal is strong when I check the modem . Would not recommend this product at this time", "verified": true, "helpfulness": "0/0", "author": "MARK ROSTKOWSKI"}, {"rating": 5.0, "review": "I love it; so far I have just used it to watch Netflix. It is very easy to use", "verified": true, "helpfulness": "0/0", "author": "tf \"Teresa Fiskum\""}, {"rating": 5.0, "review": "Great product that was easy to set up. Set up less than 10 minutes. l don't  have to watch movies from Kindle tablet or plug tablet to TV with HDMI cable. Best thing on market for Prime members. Plan to buy another for husband's mancave.", "verified": true, "helpfulness": "0/0", "author": "rjrobertso"}, {"rating": 5.0, "review": "Easy to set up. Good remote features. Streams without any interruptions. I watched Netflix and Amazon Prime movies on the first day. Smart and easy to go between movies and apps. Can't think of anything negative. Very impressed.", "verified": true, "helpfulness": "0/0", "author": "Hacher"}, {"rating": 4.0, "review": "Great entry level device. Does what it says.. allows you to access great content from Amazon, Netflix etc... Pretty quick navigation, nothing world beating here... Still tough to find as of now, but if you want to access great streaming content, I'd recommend this!", "verified": true, "helpfulness": "0/0", "author": "DJ Dan"}, {"rating": 5.0, "review": "Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "joan"}, {"rating": 4.0, "review": "This works well. I've looked through so many movies on Amazon and wish they had more mainstream flicks for free.", "verified": true, "helpfulness": "0/0", "author": "Natalie D"}, {"rating": 2.0, "review": "Works great except when using it, there is no volume control..\\", "verified": true, "helpfulness": "0/0", "author": "Ern"}, {"rating": 5.0, "review": "Makes TV worth watching!  Easy to use.  A must for every household", "verified": true, "helpfulness": "0/0", "author": "Mary Pino"}, {"rating": 1.0, "review": "Warning do not waste your money.  This thing was dead and not working when I opened the box.The only thing it did was over heat to the point of burning down my house.Worst item I have ever bought on Amozon!", "verified": true, "helpfulness": "1/2", "author": "Ryan Sethman"}]