[{"rating": 1.0, "review": "I am not able to use it in my country due to geographical bla bla bla, you should put that in the description of the product, neither using a prime account", "verified": true, "helpfulness": "3/5", "author": "Jose costales"}, {"rating": 3.0, "review": "I was super thrilled to buy the FireTV Stick because it's advertised to be Mircast certified and I would not only be able to watch Netflix, etc. through the stick on my tv, but also cast whatever I'm looking at on my laptop or smart phone as well. Not the case at all. It wasn't until I Google searched help to figure out how to troubleshoot casting that I saw a multitude of other customers who were duped as well, including those who work in associated tech fields. No Bueno, Amazon. In addition to that disappointment, the power cord is REALLY short and is about 6\" too short to reach my surge protector. Although the manual urges you to use the included power cord and adapter, the stic thankfully runs just fine off the power it gets from the USB port on my tv. The likes: a simple low profile remote, ability to use the FireTV app (in case remote is lost or batteries dead), fast surfing and response time of commands, no buffering issues.", "verified": true, "helpfulness": "1/2", "author": "Amanda"}, {"rating": 5.0, "review": "I love it. It is all that Amazon said it would be. It was shipped very quickly and arrived without hassle. To set it up you just plug it into any HDMI port and answer questions via the remote. It couldn't be easier. You do need wi-fi though and an Amazon account. There is TONS of programming on Amazon Prime and you can receive Net Flix or many other content. The games are basic but that is OK. The remote is basic too but there are replacements that are more comprehensive.Good solid product", "verified": true, "helpfulness": "1/2", "author": "Casch \"Chris\""}, {"rating": 5.0, "review": "Just what I needed", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought this for a friend and so far, she absolutely loves it. Great buy on prime day!", "verified": true, "helpfulness": "0/1", "author": "Tammy Monette"}, {"rating": 4.0, "review": "Es good but have a lot of trouble.", "verified": true, "helpfulness": "0/1", "author": "maria escobar"}, {"rating": 3.0, "review": "I own both this, and a Roku.  One thing that disappoints me about the Fire Stick is that the wireless reception doesn't seem as good as the Roku.  The Roku is placed further away to my router in my home yet it doesn't seem to have nearly as many streaming interruptions as the Fire Stick.  I also tend to find the user interface more intuitive with the Roku than the Fire Stick.", "verified": true, "helpfulness": "2/3", "author": "seattlelite"}, {"rating": 5.0, "review": "This is great, replaced my Apple TV!", "verified": true, "helpfulness": "1/2", "author": "Todd Gold"}, {"rating": 5.0, "review": "Works just as stated and we love it.", "verified": true, "helpfulness": "0/1", "author": "susier"}, {"rating": 5.0, "review": "This is so great, even I was able to install this with no trouble!", "verified": true, "helpfulness": "1/1", "author": "Debra L."}]