[{"rating": 5.0, "review": "Superb device. I use the Fire Stick for Netflix, AmazonPRIME and YouTube. For all it works quickly and flawlessly. At the price, it's remarkable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am pleasantly surprised.  I own Apple Tv and Chromecast and use my Xbox to stream with Plex.This device is instant on and streams better than anything.  I am going to pick up another.The only con is that you have to be aware that the USB has to go to power no the USB on the back of the TV", "verified": true, "helpfulness": "0/0", "author": "S. Shea"}, {"rating": 3.0, "review": "Works OK has problem with wireless connection and buffers quite a bit compared to Roku.", "verified": true, "helpfulness": "0/0", "author": "John M Harris"}, {"rating": 5.0, "review": "Surprisingly small, and very high quality", "verified": true, "helpfulness": "0/0", "author": "Thrust"}, {"rating": 2.0, "review": "I have 2 firesticks and they both don't work in my newer Samsung 65\" TV (bought from Amazon)  The screen shakes and is blurry.  I have tried both HDMI ports and both do the same thing.  They seem to work fine in my smaller TVs 40 and 50.  I would like to keep the sticks but need help making it work.Do these sticks not work with 65+ TVs? I need technical support.  Please help.", "verified": true, "helpfulness": "0/0", "author": "Chris P"}, {"rating": 5.0, "review": "I love this thing.  I primarily got it as a supplement device for my Apple TV, as I cannot do Amazon on Apple TV.  I have a smart TV which has the Amazon App, but it is pure garbage.  Don't rely on your Smart TV for the Apps, just spend next to nothing and by one of these.I plugged this in to the back of my receiver (home theater) and after the somewhat long software update I was up and running.  Really like how fast it is.PRO/CON - Bluetooth remote: it is handy that it is Bluetooth and does not have to be pointed directly at the Stick, but I also cannot use my Logitech Harmony One remote.  Oh well having two remotes is not the end of the world.", "verified": true, "helpfulness": "0/0", "author": "Taylor \"Shaboom's\""}, {"rating": 5.0, "review": "This is absolutely awesome! I got it for my daughters room so that she could watch netflix and its great and has tons of extras and is priced so much better than a roku or streaming media box and is more compact .", "verified": true, "helpfulness": "1/1", "author": "Lilprincess"}, {"rating": 4.0, "review": "Love the device had to learn on my own more instructions would be helpful.  Additionally the device must be removed to turn off and not over heat.", "verified": true, "helpfulness": "0/0", "author": "Tanya Braatton"}, {"rating": 4.0, "review": "So with 7,000+ reviews I’m sure that you get the gist of what this product does. I will go into the product summary but before I do I wanted to share an experience that I had that might help you down the road. The issue is if you are traveling and forgot  your remote or if you lost it and are stuck at the connection screen this  strategy may  work:Situation: Fire Stick remote lost, fire stick remote forgotten.Issue: If  you don’t have the remote  and you aren’t connected to WiFi then you can’t use the FireTV(stick) app. This app operates off of Wifi, therefore if your stick isn’t connected to Wifi you can’t control it.I called Amazon and they said that I was flat out of luck. Home for the holidays with no way to spread the joy of family movies with my family. Sad sad sad.Resolution – If your phone is equippred with an IR blaster, you can use your phones IR to control the fire stick. It’s basic but it’s enough to get you signed into a WiFi connection, once you do that you can use the FireTV(stick) app again!I have the Note4 and I used the Smart Remote app.1) Select the TV type that you have make sure that the remote can power on and off the TV.2) Put “I  don’t have a cable box”.3) The second icon on the top right has a little remote, click that.4) On the middle right there is a little arrow. Slide that out5) You should have a little D-Pad. Up, Down, left, right and okay. These buttons will control the fire stick.6) (Optional) Hit up, up, down, down, left, right, left, right to both celebrate your victory and bring back fond memories of the beginning of Mortal Kombats blood code.As for the fire stick review:I like it a lot for $20. There are more apps coming out that allow you to cast material like the Chromecast. That was my main gripe with it. The interface is insanely easy and I wouldn’t recommend using the stock remote at all. The Phone app (Fire specific app, not the Smart remote App) works wonders. Voice recognition is superb (another MK reference, it’s just one of those days) and the execution of the entire interface is a flawless victory (too many?).I may have yet to figure it out fully but my main issue with the device is lack of selectivity  with the voice recognition. For example, I said “holiday movies” and all possible holiday movies showed up. They only showed up for Amazon (not Netflix) and furthermore they  didn’t immediately distinguish which were free, paid, or simply ones that you needed to order. Secondly I quick handed the buttons and wound up purchasing something by mistake. I emailed amazon and they credited me but not before saying that they usually don’t credit these things. I’d like to see a 5 minute refund window in which erroneous purchases could be cancelled after purchasing for 5 minutes.All in all it’s a cool device to play with. I bought it for $20 so it wasn’t a significant financial investment. I would recommend it to anyone that enjoys prime movies and wants an easy quick way to watch Netflix.Please feel free to ask questions below. I will update this review in a few months if I feel that something has changed enough to warrant. I take pride in my reviews and hope that you found this helpful.Happy Shopping!", "verified": true, "helpfulness": "0/0", "author": "J Carra"}, {"rating": 2.0, "review": "Bought this item to replace my old first generation Roku. Suffice to say this device had a hard time staying connected to my network. The help documentation recommends to move one's router closer to the device, but I find that to be unacceptable given that my previous solution was working just fine. I will keep using my 6 year old Roku.", "verified": true, "helpfulness": "0/0", "author": "Moe"}]