[{"rating": 1.0, "review": "Furious is the first word I feel. I could give it some stars because it does project movies and shows on my screen, but no stars for total misrepresentation of product.  This advertisement quote \"Amazon Prime customers get unlimited access to popular movies and TV shows with Prime Instant Video, including The HBO Collection\" is what sold me. What it doesn't say is that I must already be an HBO customer! That's the same for HULU and Netflix. IF I WERE A CUSTOMER OF THESE 3, I WOULDN'T NEED THE STICK. This is the first time I've ever been unhappy with anything Amazon. My Amazon core has been shaken, and that makes me sad. Amazon, don't fall into the trap of all other business we have no faith in anymore. Stick to the truth or make the truth more obvious and easier to read.", "verified": true, "helpfulness": "0/0", "author": "Annie \"ESL instructor\""}, {"rating": 5.0, "review": "Works good and it fast can't beat $40 for a media stick", "verified": true, "helpfulness": "0/0", "author": "derek"}, {"rating": 5.0, "review": "GIFT", "verified": true, "helpfulness": "0/0", "author": "G. Barnett"}, {"rating": 5.0, "review": "happy", "verified": true, "helpfulness": "0/0", "author": "Sam Giardullo"}, {"rating": 5.0, "review": "Excellent...saved lots of money on dish tv", "verified": true, "helpfulness": "0/0", "author": "Praveen Tyagi"}, {"rating": 5.0, "review": "It worked the way I wanted it to", "verified": true, "helpfulness": "0/0", "author": "Sue Widener"}, {"rating": 5.0, "review": "We love it!!! Awesome, works great!!! So much nicer to watch netflix on the tv than the tablet!", "verified": true, "helpfulness": "0/0", "author": "Tracy W."}, {"rating": 5.0, "review": "Best thing ever!", "verified": true, "helpfulness": "0/0", "author": "Melissa Howell"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Yadira Lopez"}, {"rating": 5.0, "review": "Not sure what more I can add for a product that already has almost 50,000 reviews. It works good, I like it better than my Chromecast. I would buy it again, I think it's the best streaming device in it's price range.", "verified": true, "helpfulness": "0/0", "author": "Garrett"}]