[{"rating": 1.0, "review": "Very poor device - slow loading and won't hold a 30 mbps Wi-Fi connection worth squat. If you have Prime, it takes even longer to load - hours and hours.  The unit seriously overheats with the AC power adapter and is supplied with a very short hdmi m/f extension that doesn't help trying to get a better Wi-Fi signal position.  The remote control is a joke, and a ridiculous design for installing batteries.  All in all, this is just pure junk and a complete waste of money and both hardware and firmware are junk.  I'm only giving it a star because I have to.  Don't waste your time and money.  Once again, Mr. Bezos has ripped me off.", "verified": true, "helpfulness": "0/2", "author": "Tony V"}, {"rating": 5.0, "review": "I use an Apple TV at home for my Netflix and HBO Now needs, and typically with an iPad to stream Amazon Prime videos.  I now often use this at home for Amazon Prime Instant Video.  I had bought it primarily for travel, but find these days at most hotels that wifi is not free or fast enough to get the job done.  Still great for visiting friends/family and having on the go access for the slow or rainy days.", "verified": true, "helpfulness": "0/0", "author": "Tucker"}, {"rating": 3.0, "review": "Using the fire stick is easy, the remote control is kinda hard for searching for movies and TV shows. . Singed up for prime and not everything is included,  I would spend lots of money to watch TV and movies..", "verified": false, "helpfulness": "0/0", "author": "brian mahas"}, {"rating": 2.0, "review": "I bought this as a replacemente for my chromecast, hoping among other things to have a much better performance in terms of network reception and responsiveness. The former was particularly critical as I have it on my secondary TV, far from my router and connectivity from Chromecast is spotty (5GHz band won't reach it). I was much disappointed to find it was much worse from the Fire Stick. Netflix took forever to load a movie, and much longer to reach HD quality, being unable to sustain it for long. By comparison, Chromecast loads much faster and tends to sustain HD quality most of the time. Connectivity even dropped several times while navigating the menu, making every feature unusable when it happened.Add to this, the official Android app does not work on any of my devices (I have an Android 4.4.2 tablet and an 5.0 cellphone as well as an older 4.2), so for the moment I am stuck with the remote for typing password and search terms.I haven't even been able to download YouTube as of now, or tried casting apps, so I might be updating this if I manage to, but my first impressions are dismal. I would return it if it wasn't expensive for me (don't live in the US)", "verified": true, "helpfulness": "0/0", "author": "Sebastian"}, {"rating": 5.0, "review": "Liking it", "verified": true, "helpfulness": "0/0", "author": "Susan Elgar"}, {"rating": 5.0, "review": "Work really great and love the cost", "verified": true, "helpfulness": "0/0", "author": "jason florence"}, {"rating": 5.0, "review": "Love the Amazon Fire Stick.  Love the Prime Movies that are free with membership.", "verified": true, "helpfulness": "0/0", "author": "Jane E. Mays"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Millie"}, {"rating": 1.0, "review": "Great concept.  Easy to use.  Constant delay in the screen. No other internet items in the house have any issues.  Such poor delays we've stopped using it. If it processed faster it would be great.", "verified": true, "helpfulness": "1/1", "author": "Andrew"}, {"rating": 4.0, "review": "Does what it is suppose to do ok.", "verified": true, "helpfulness": "0/0", "author": "Ronnie Taylor \"WebDesigner\""}]