[{"rating": 1.0, "review": "I Have purchased one and it is on back order till Jan,why does best buy have them for 25$...why do we have to wait so long.", "verified": true, "helpfulness": "1/7", "author": "Anita E. Rembert"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "JaimeJavil"}, {"rating": 4.0, "review": "I've been an Amazon Prime member since its inception, but I don't use it for anything other than the free 2 day shipping.  Despite my iPads, windows tablets, Windows PC's, media center PC's, or any phones I've had, I've not done any streaming.I thought I'd try this since I had a half price deal on it pre-launch.  I figured I'd use it in my son's bedroom on his TV that is in there for his Xbox.  He could use it for the cartoons and such available on the Prime subscription.It arrived, and setup was freakishly easy.  It ran a semi long update right out of the box, so despite being brand new and just delivered after release, they clearly are trying to fix issues and push updates as needed.  That's always a good sign, as long as the fixes don't break something else.My big requirement for this was that I could lock purchases.  I didn't want my 11 year old inadvertently trying to watch something that wasn't free with Prime and suddenly seeing a bill at the end of the month.  But the initial setup didn't offer any options other than parental controls on / off.  I turned them on, and it annoyingly forced us to enter my pin every time he changed to a different show.  I finally found in the settings the option for not requiring it for prime videos, but still requiring it for purchases.I've had a Kindle Fire HD that I gave away the day after I purchased it because I just couldn't stand the carousel they use.  It's such a pain to get at anything after the ease of Windows devices and Apple devices.  And while this does a great job streaming music that is in my Amazon account, it's that annoying carousel thing again, which makes it a pain even for my modest 300 or so songs I've purchased through Amazon.  I hate having to scroll through EVERYTHING to get at something.  So it's this same kind of interface here that made me take a star off.The navigation otherwise isn't too bad for the normal things. Different types on the left such as TV shows, movies, music, photos, and as you pick one, the options on the right side expand within that subject.  My son had no problem finding some of the nickelodeon shows he likes to watch.Streaming was stutter free, no sync problems for audio/video.  Pictures were crisp and clear, although he was watching his cartoons and such, I haven't tried it on any higher quality movies and such yet.  But so far, for the price, it's been impressive.Remote works without any line of sight to the stick behind the TV so it's a wireless remote of some sort, not IR.  That's a benefit considering the placement.The USB charger wall wart is very small, and even fit between two other things on the power strip I've got it plugged into, so that's a nice design compared to most wall warts.It came pre-attached to my account, although it did offer to let me use a different account during setup.  I'm just glad I remembered the pin code I set ages ago, since that's what it needs, not any password.All told, for the half off price I paid, this was a total no brainer purchase.  It works well, other than the carousel annoyance of Amazon's interface, and the fact that you can just unplug it and take it somewhere else is a very good feature.For someone who has gone all this time without streaming (despite so many of my devices supporting it, like the Xboxes and Playstations and such) I'm beginning to see the value in it, when you're getting it for free as a side benefit to something you already bought.  If you have prime, and you have kids, it's worth far more than the pennies it ends up costing to purchase.", "verified": true, "helpfulness": "0/0", "author": "JDThird \"John\""}, {"rating": 5.0, "review": "This thing is great.  I'm replacing a Chromecast with the Fire TV Stick and could not be happier with my upgrade.  The way this device interacts with my TV, Phone, and streaming services is really great.", "verified": true, "helpfulness": "0/0", "author": "Ohio Shopper"}, {"rating": 5.0, "review": "I've only used it for a day, but so far I don't see any reason to remove any stars. I do think the main navigation and selection button on the remote needs to be marked as such, but even that's not a deal-breaker for five stars. I posted a blog entry with pictures and videos about my unboxing, setting up and undertaking some initial operations of the unit here: http://wp.me/pmlRJ-Mm.", "verified": true, "helpfulness": "0/0", "author": "Ari B. Adler \"@aribadler\""}, {"rating": 2.0, "review": "Speedy stick for the most part, but falls short with several shortcommings.First off, you cannot use a universal remote with this device. I understand the 'back of the tv' method means only bluetooth works for it, but so far haven't seen any remotes that say they can control this device. The included remote sucks, its insanely uncomfortable to use. All of this wouldn't be such an issue if I could control it with my Kindle Fire...oh what's that you say, Amazon certainly should make an app for their own device first? Not if you have an older Kindle, apparently Amazon wants you to just throw those old things away instead of make them useful (because come on, a friggin remote control app shouldn't be that computationally intense that a tablet like the Kindle Fire cannot run). I can run Roku's app on my Kindle Fire, but not Amazon's own Kindle Fire remote, hmmm....I've also had to enter my Wifi password a few times already, and have had shows in Netflix that I try to start in the middle of the episode (where I left off) and the screen just displays '99%' on the buffering, it plays the sound from the episode, but never loads the actual video for the show.For $20, sure, its not bad. But at $40, I'd recommend the Roku LT before I recommend the Fire TV Stick (and truthfully, you can get Roku 3's now as low as $60 if you look around, which I would recommend even moreso).I will end this review by stating that my friggin thumb is sore from using the included remote, that thing is so uncomfortable to use, easily the worst remote I think I've ever used, and being a technology geek I've probably used close to 100+ remotes in my life.I will update this review as time goes on, but first impressions aren't very impressive. I will keep this as I got it for $20, but would not recommend it full price.", "verified": true, "helpfulness": "14/16", "author": "P. Killion"}, {"rating": 4.0, "review": "Just received my Fire TV Stick and hooked it up to the tv. I also own a Chromecast and will probably be using both at the same time for a while until the Fire TV Stick updates to be able to mirror my computer screen and finally gets the iOS app out there.1. Setting upIt plugs into an HDMI and they recommend you plug it into a wall outlet using a USB charger (all included, as well as a small extension wire for the HDMI to TV connection. I guess this is for TVs close to a wall so that you don't have the Fire stick jutting out of the back.Once connected to my wifi, it took a few minutes to download and install updates. Then a little animated guy showed up on the tv to give me an intro of what it can do.My Amazon Prime music library and playlists were in there when I signed in with my Amazon account. My watchlist for Prime video was there too. There are a lot of game apps also playable on the tv which my children seemed excited about. (The Amazon Fire game controller also works with it.)2. Compared with ChromecastI am still waiting for the iOS App and hopefully something to \"fling\" my computer screen to the tv like Chromecast's still-in-beta \"cast entire screen\". I believe I'll be able to change it to 5 stars once those two things get worked out.I still enjoy Chromecast for mirroring my computer screen, and sending chrome tabs to the tv. It's also very convenient now that many apps such as Netflix and Hulu include chromecast integration.Where Fire TV Stick is a step up is that I don't need my computer, tablet, or phone to \"cast\" something to it so kids can just watch Netflix, Disney Channel App, or Hulu from the stick itself and there's no need for another device. (You can also set some Parental Controls).I'm happy with the Fire TV Stick and using it alongside Chromecast because there are still things that one can do that the other can't. It's now the one we use for watching Amazon Prime, Netflix, and listening to music through the tv. Chromecast is still the one I use for casting my computer screen.3. InterfaceI love that it has a remote control and the remote control is small, and that I don't need to fiddle with another device in order to work it (although there are ways to work it from a cell phone). The remote is 4.5 in. x 1.5 in.One more thing in which I hope and expect to see improvements is the way users access apps such as Netflix or Hulu. I want to have a customizable homescreen with easy access to the apps and features I use the most. Right now it feels a little less intuitive than it could be.It's also a great way to access music on the tv for people like me that don't have a better sound system than the one that came with the tv. With Pandora, iHeartRadio, Amazon Music, and other apps, it's a great way to throw some music on in the background.4. The Remote ControlAs I mentioned above, it's a good size (4.5\"x1.5\"). The battery compartment was a little hard to open.It may be too much to ask but if the remote here had a button to control the volume on the tv it would be convenient for when switching between videos or apps that have different sound outputs.Lastly, and it needs to be said, I love the fact that it's a tiny stick in the back of my tv that gives me access to a lot of content without needing another device to interface with it. I'm looking forward to gradual improvements, updates, and customizability.", "verified": true, "helpfulness": "0/0", "author": "J. Ts"}, {"rating": 5.0, "review": "So far it has let me replace 90% of the functionality of my Chromecast. Now, just to get the last few apps on it that I need!", "verified": true, "helpfulness": "0/0", "author": "CRAIG D DEDRICK"}, {"rating": 2.0, "review": "I'm not sure if I have defective remote as my fire stick types the characters as I try to navigate the on screen keyboard.  It took 30 minuted to type my wifi password and when I do a search, I can only click on the edge of circle controller to navigate or it just type the characters it passes over.  The center button is very sensitive and it only requires a touch to press OK not click.  Can other users share their experience with remote before I return to Amazon", "verified": true, "helpfulness": "3/5", "author": "NetSTART"}, {"rating": 5.0, "review": "Great Deal for the money, a must buy if you have Prime", "verified": true, "helpfulness": "0/0", "author": "J. Lookofsky"}]