[{"rating": 4.0, "review": "The Fire TV Stick is the best small-footprint streaming media solution for anyone who does not have a smartphone.  It is extremely quick and easy to set up and you are ready to go in minutes.  Now let's look at some facts here...Pros:- Quick and easy setup- Easy navigation- Fire TV Remote Control App provides excellent- Excellent suite of streaming apps (Netflix, HBO Go, Showtime Anytime, Plex)- Sideloading for the adventurousCons:- Apps are slow to install/load the first time (after that they are plenty fast)- Fire TV Remote Control App functionality only extends to the main menu and Amazon-specific sub-menus. Netflix, for example, cannot be voice searched.- Remote is very small and easy to lose- Battery compartment is tough to get open (you feel like you're about to break it)- Initial setup puts games in your face but they require separate controller.", "verified": true, "helpfulness": "0/0", "author": "Mass Daddy"}, {"rating": 5.0, "review": "Very easy set up and it runs very well. Only knock I would say is that there is no way to power the device off.", "verified": true, "helpfulness": "0/0", "author": "Karl Kincheon"}, {"rating": 5.0, "review": "I'm loving it!", "verified": true, "helpfulness": "0/1", "author": "kad"}, {"rating": 5.0, "review": "I pretty much loved this thing right from the get go! Super easy to install, just plug it in.  Connected to our WiFi almost immediately.  And considering we had been streaming Netflix on our Wii, this is soooo much easier!!! Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Net"}, {"rating": 5.0, "review": "Love it, love it, love it, love it, love it! A giant leap in the evolution of television!", "verified": true, "helpfulness": "0/0", "author": "James K."}, {"rating": 5.0, "review": "Love this it is best option", "verified": true, "helpfulness": "0/0", "author": "Kelly A. Meegan OFarrell \"Kelly A. Meegan OFarrell\""}, {"rating": 5.0, "review": "what i needed for smart. tv to work. Received timely and as described", "verified": true, "helpfulness": "0/0", "author": "Susy"}, {"rating": 5.0, "review": "Easy set-up & operation.  Haven't used it much to date, but plan to do so soon.", "verified": true, "helpfulness": "0/0", "author": "Mike Selders"}, {"rating": 5.0, "review": "Works the best for out of everything I use netflix on... however if my roommates would stop playing crossy road on it the up button wouldn't be becoming less responsive... but that is because that is what they do most of the day when they are home trying to beat each others records... love how simple the controller is for it. Nothing to be disappointed about at all!!!", "verified": true, "helpfulness": "0/0", "author": "Charity Spencer"}, {"rating": 5.0, "review": "the thing works as advertised", "verified": true, "helpfulness": "0/0", "author": "Jim Baumann"}]