[{"rating": 5.0, "review": "Wow,  what will they come up with next", "verified": true, "helpfulness": "0/0", "author": "B. Dykhuizen"}, {"rating": 3.0, "review": "It worked effortlessly but I cannot find anything \"free\" let along \"free\" and worth watching. I've also noticed that if I make a selection mistake, such as choosing HD movie over non- HD,  it's not correctable - I get charged for both movies.  I've found this to be problematic with all Amazon video- if I buy several episodes of some TV show, then decide to buy the season (after watching 2 episodes)  to save money htey will charge me for the season and the two already watched episodes.  The picture on the TV is excellent but there is basically nothing to watch after 2013 which is free. So be prepared to spend money. I'm wondering if it would  be less expensive to go back to some satallite or cable at the lowest $ level. Currently, I've been using a TV antenna which picks up lots of stations but goes in and out if I chew gum or move my head.", "verified": true, "helpfulness": "0/1", "author": "BostonHolly"}, {"rating": 5.0, "review": "Best thing ever runs XBMC/ kodi smooth", "verified": false, "helpfulness": "0/0", "author": "raul martinez"}, {"rating": 4.0, "review": "Not as much free content as I had hoped. But overall it has been a good experience.", "verified": true, "helpfulness": "0/0", "author": "Richard Zeni"}, {"rating": 4.0, "review": "I really like the Fire Stick. We have noticed a slight delay in processing but it isn't long enough to cause concern. Overall it is a great product and I now have space on my TV stand that was originally used by the old play station.", "verified": true, "helpfulness": "0/0", "author": "Marie Murphree"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Rhett"}, {"rating": 5.0, "review": "Performs great, doesn't lag and has all the apps I need.", "verified": true, "helpfulness": "0/0", "author": "John Fitzgerald"}, {"rating": 5.0, "review": "Its excellent. I wish Amazon and google could just be friends so I could use Google apps too. But all in all it works great. Bear in mind the voice search seems to only work when searching Amazon, not Hulu or Netflix. The remote app for your phone is really nice too.", "verified": true, "helpfulness": "0/0", "author": "Justin Powell"}, {"rating": 5.0, "review": "great, no need to use a tablet or phone, simple install.", "verified": true, "helpfulness": "0/0", "author": "wbr"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Angayarkanni"}]