[{"rating": 5.0, "review": "Works great and was easy to setup. If you have an Netfiix account,  you will be watching in minutes.", "verified": true, "helpfulness": "0/0", "author": "Brian Sample"}, {"rating": 5.0, "review": "Great device.  I have the Chromecast and I really like this much, much better.  So much easier to use, especially with the included remote and with the Android app.  Snappy performance with very little lag.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Maximo"}, {"rating": 5.0, "review": "Bought a Roku 2 before this came out and couldn't even connect to my wifi with my roku, sent it back... Ordered this the day it came out and just got it and honestly I LOVE it!!! Works amazing and is quick to load and it's just all around awesome!!!", "verified": true, "helpfulness": "0/0", "author": "britbrat"}, {"rating": 1.0, "review": "This is the worst streaming player I have ever used.After hooking up as described in the very limited user manual I tried to get this to connect to my wireless access point.  This was VERY frustrating, as the only way to enter the password is an on-screen keyboard.  Unfortunately the Fire stick refused to connect to the 5Ghz channel on the access point.  And every time it failed to connect, I had to re-enter the password again on the stupid on-screen keyboard.  This might be fine if your wireless password is 12345, but if your have a decent length password, this get very old very fast.The entire time I was entering this information, the screen kept going blank after every few key presses, forcing me to wait until it came back to continue.  I never did get the Fire Stick to connect the 5GHz radio and had to switch to a 2.5Ghz channel.I was able to watch the intro video and navigate the menus, but when I tried to play a movie (Prime Eligible) I got a blue screen with the words \"HDCP Unauthorized\", but audio was playing.  Later when I tried to play the came content, I got a different error, \"Error Code LICENSE_ERROR\" and then \"Unknown Error\" This screen suggested I contact Amazon Customer Service.  I tried to do this on Amazon's web page, but could not find any link to do so.  I also tried to use the VERY LIMITED Help features on on the Fire Stick.  The eventually led me to a screen asking for a Phone number.  I entered my phone number, but then just got a Unable to Connect Error message.I tried a few other titles and got a new and exciting error, one that said my internet connection was too slow for streaming.  Apparently the Fire TV has so little memory that it can't buffer a single tv episode.UPDATE, After getting an email from Amazon that a software update was available, I tried the Fire TV stick again.  IT WORKS!  Or, well it did, for like 30 minutes.  Then the sound quit, then it was back to the same old HDCP Error.  Oh well.  It was worth a try.", "verified": true, "helpfulness": "6/8", "author": "Auton"}, {"rating": 3.0, "review": "Slow response and a weak remote radio make this difficult to use.  The remote really only works from about a foot away - any further and keypresses take 5-15 seconds to occur and often repeat multiple (read: 20 or more it seems) times.  I'm assuming something around my living room is interfering pretty badly with the remote, but my Roku Stick on the same TV using the Bluetooth remote is just fine.  Using the Android remote app works fine, at least.As a Prime member, I was able to purchase this at the $20 price point.  At full price, I would be returning this for a Roku stick.", "verified": true, "helpfulness": "0/0", "author": "DuckPuppy"}, {"rating": 4.0, "review": "Love the speed of the navigation and the remote.  Have the remote make it very convenient.  Also you can side load other apps like XMBC.", "verified": true, "helpfulness": "0/0", "author": "gotkimchi"}, {"rating": 4.0, "review": "The Fire TV Stick was easy to set up, easy to use, and performs real well on my 15mbs cable internet connection. The gui is more responsive than my Roku 2 XS box - though I have been TOLD the Fire TV BOX is even faster.The Roku wins easily as far as having more channels/apps BUT perhaps the Fire TV devices will eventually catch up. For now the Roku stays for those channels I can not get on the Fire TV Stick.  Otherwise, I use the Fire TV Stick because its an overall faster and more pleasant experience.  However, I hope Amazon will continue to work on the Fire TV gui and add more customization settings - such as being able to set the order of the main screen rows.  And which are even displayed.  Not everyone uses it for music, for instance. So let me hide the parts I don't use.Overall, I am really pleased.  A good value and a sold product.", "verified": true, "helpfulness": "1/1", "author": "glrobin"}, {"rating": 5.0, "review": "Easy to use, fast Great!", "verified": true, "helpfulness": "0/1", "author": "Sandy"}, {"rating": 2.0, "review": "I have had to factory reset it 4 times and redo everything. It will not stay connected to my network. I even moved it to 3 feet from my router and it still won’t connect... So frustrating when trying to stream Netflix or espn.", "verified": true, "helpfulness": "1/1", "author": "Brandon80"}, {"rating": 4.0, "review": "This thing is is unreal.  It is almost perfect.....the only reason I gave it 4/5 is because it requires you to plug it into the wall electrical outlet when it is attached to your TV for proper operation.  I am not sure if I missed that when I ordered it, or if it may be a bit deceiving on the fact that it needs power, but that was a slight pain in the butt when I realized it.  Otherwise, it is so nice and I will be getting this for family & friends as gifts in the future. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "JB"}]