[{"rating": 3.0, "review": "The only reason I got this was because Sling was not supported on my PS4 and this came for free when you signed up for Sling.With that said, it's good for what it is. I use it for Netflix and Amazon prime and it works just fine.  The only reason I give it 3 stars is because there's not to many apps you can download for it.  The main one I wanted was the Comcast app so I could watch the walking dead. I tried getting around this by mirroring my IPad(which has the Comcast app) to the Firestick (You need to buy an app on the Firestick for $6.99, which I did) and it won't let me, I get some copyright BS when I try to do it. Amazon was nice enough to refund me for the now worthless app.Overall if you are interested in Sling (where you get to watch about 10-15 TV channels for $20 a month) and they still have the offer where you get this device for free, it's worth it.If you are just buying this as a standalone device inorder to upgrade your TV to a smart TV, I would go with the google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Devon"}, {"rating": 1.0, "review": "Bosch series was excellent, but recent movies cost money to view...not good.", "verified": true, "helpfulness": "0/0", "author": "Bill Burton"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Ruth Ventrello \"tech nut\""}, {"rating": 1.0, "review": "Does not work with my Sharp HD TV", "verified": true, "helpfulness": "0/0", "author": "HARRY A. GIBBS"}, {"rating": 5.0, "review": "Packaging is very classy.  Very easy to install.  User friendly to operate. Best of all it works seamlessly with WiFi - no stuttering or buffering.  Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Teich"}, {"rating": 5.0, "review": "Very happy with it.  The remote is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "J. Corby \"Firefighter\""}, {"rating": 5.0, "review": "Love it! It does just about everything a tablet can except on my big flat screen t.v. My daughter loves the games.", "verified": true, "helpfulness": "0/0", "author": "THONE"}, {"rating": 5.0, "review": "AMAZING! Love that I can control from the fantastic remote or my kindle fire. Being a Prime member, my husband and I are catching up on tons of shows and series. Watching and purchasing movies could not be easier. The format and design of the screens is very user friendly. Telling everyone I know to purchase one", "verified": true, "helpfulness": "0/0", "author": "Kim Szalkai"}, {"rating": 5.0, "review": "Works great! Doesn't take up space. I wish vudu and disney movies anywhere were available for fire devices.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I can’t fully rate the Firestick yet because by 2009 Samsung TV – despite documentation to be HDCP compliant and a history of working with an older Roku unit and BlueRay DVD player – does not appear to be HDCP compatible (or at least the flavor employed by the Firestick) which means that I can't view any Hulu, Amazon, or Netflix content. I get the infamous blue screen message on any of these sources with audio but no picture. This problem is not unique to me based on other reviews so I have taken a leap of faith in that adding an HDMI splitter to the equation will effectively strip out the HDCP mismatch and get me working. I did try all other simple recommendations (Firestick firmware / software update, swap HDMI port, full power resets, etc. to no avail).  The HDMI splitter will add $23 to the cost of this solution which depresses the value somewhat. Note that Sling TV, YouTube, and Pandora work fine.I will update this review and potentially star rating after I get the splitter in place and ascertain whether it works or if I will be returning it. Given the frequency of this issue I think Amazon could do a better job is either establishing / publishing device compatibility requirements or ensuring their device was less narrow on what it deemed HDCP compliant. So far this seems to be a much rockier start then I would expected for a media 'appliance'.", "verified": true, "helpfulness": "0/0", "author": "The Gooch"}]