[{"rating": 5.0, "review": "I love this product so much that I purchased another for my parents. My parents are both in their seventies and spend a lot of time watching TV. We tried the Chromecast for them but it was too difficult for them to operate from their laptops or iPhones. They had a little difficult setting up the fire stick and adding their new Netflix accounts but I was able to talk them through it over the phone (300 miles away). They are much happier with this system due to the easy to use remote control. I would recommend it to anyone who wants to update their television to a \"smart\" TV without purchasing a new one!", "verified": true, "helpfulness": "0/0", "author": "Kelly Wroten"}, {"rating": 5.0, "review": "So far,so good", "verified": true, "helpfulness": "0/0", "author": "TJ"}, {"rating": 5.0, "review": "Literally plug and play. Put it in the HDMI port, hooked the power supply in the USB port and it fired right up. Downloaded the Fire TV app for iPhone and have used it (the app supports voice search so no need to buy the optional remote) almost exclusively. Great for Netflix and Amazon Video. Also use the Watch ESPN app and watch YouTube.My only setback has been having to re-sign into Netflix on a few occasions. Not sure why the login info isn't always saved.", "verified": true, "helpfulness": "0/0", "author": "Bryan L. Brown"}, {"rating": 3.0, "review": "No complaints in terms of the hardware, form factor, etc.  I like the fact that the power port on the stick is on the side, depending on how your tv/monitor ports are arranged it may be easier to use that way.  Price is great, I got mine for the original $19.99 sale and had that covered by a gift certificate balance.However, 2 cons:1. The app selection is just too sparse right now.  The fact that the firetv box gets apps like HBO Go first doesn't help matters either.  I end up having to sideload a bunch of apps and then either use a hardware device or an android mouse app to control them since they are not compatible with the remote interface.2.  The UI is horrific.  I compare it to my Roku streaming stick which I received as a gift.  Some selections are arranged in a single row.  For example, when browsing categories of apps in the app store, if you have to scroll through 100 apps and get to the 50th one, you have to hit the button 49 times and sometimes it will pause to load images and such, slowing it down even more.  On Roku it uses a grid for everything so you can scroll by row or column.  Also things that seem as though they'd make sense just don't work.  For example, I'd expect that when I scroll all the way to the end of the row, one more button press would wrap-around to the beginning - but it doesn't!  Feels like they didn't put a lot of thought/testing into this UI.", "verified": true, "helpfulness": "1/1", "author": "smj123"}, {"rating": 4.0, "review": "Great value! I've had mine for about a month and I love it. I've never had any problems with the wireless connection, and Amazon streaming is great.4 stars instead of 5 because I feel that the photos and commercials are misleading as to the convenience of the product. I envisioned a small usb stick that you just plug in and cad easily move between TVs. While the stick is compact, it needs to be connected to a power source. Not a huge deal, but this involved going behind the tv and rearranging (plus, no one likes an extra cord). Just not quite as small or convenient as expected.", "verified": true, "helpfulness": "0/0", "author": "AnnieO"}, {"rating": 5.0, "review": "Works perfect. Great for additional televisions after you make the decision to cut cable. Will buy additional in the future.", "verified": true, "helpfulness": "0/0", "author": "Hascaln"}, {"rating": 5.0, "review": "easy to set up. able to watch movies and catch up on TV series at any time.", "verified": true, "helpfulness": "0/0", "author": "PATRICIA D WIMBERLY"}, {"rating": 5.0, "review": "Totally awesome.  It gives the Roku a good run for the money.  And, I got it for $20!", "verified": true, "helpfulness": "0/0", "author": "Kirk F. Randall"}, {"rating": 5.0, "review": "The Fire TV Stick has met all our expectations. It allows us to watch what we wantwhen we want. It also lets us catch up with programs that run when we cannot watch.It's simplicity to install and use is very much appreciated.", "verified": false, "helpfulness": "0/0", "author": "Emily M Butler"}, {"rating": 3.0, "review": "Would not work with my older model 20\" Toshiba DVD Combo TV. The Amazon name would come up then a blank screen. I tried to set the Video to various setting with no success. There is a compatibility issue with this TV only.  It work great on all three of my other TV's but not on the one I bought it for in the first place. You must have the power adaptor plugged in to the stick for it to work reliably.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]