[{"rating": 5.0, "review": "Excellent price, easy to setup and user friendly.", "verified": true, "helpfulness": "0/0", "author": "Scott Duplissis"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"kindle fanitic\""}, {"rating": 4.0, "review": "Fire Stick versus Apple TVI just picked up this Fire Stick on deep discount - it was priced so low I decided that I would pick it up and see what I can do with it.The short is that it is a great device, but the Apple TV provides more function.Ease of Use:Both are easy to use.  Apple TV has a more direct UI panel, while Fire Stick has a hierarchical menu system.Both are easy to plug in.  Apple TV has Ethernet and optical audio capability too.Form factor:The Fire Stick is a stick, but it also requires an AC power adapter.The Apple TV is a little box with a power cord.The Apple TV is a nicer-built device, with a more simple & fancier aluminum remote.Streaming:The Apple TV is a pro at dealing with streaming video and audio from my local devices.The Fire Stick can only do a small set of this stuff, and only with 3rd party apps.In all, I like them both.  The Apple TV provides a bit more capability and simplicity, but is $50 more.", "verified": true, "helpfulness": "0/0", "author": "Larns"}, {"rating": 5.0, "review": "You need newer and better movies", "verified": true, "helpfulness": "0/0", "author": "Luis De Alba"}, {"rating": 5.0, "review": "This is a great, easy to use product.  Of course, it is more appealing to me since I have Amazon Prime. This was relatively easy to set up which was really helpful in just finding out whether it works well or not.  I am very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Nancy Padilla"}, {"rating": 5.0, "review": "Faster than my Sony KDL55HX850 SmartTv internal processor...Wow...it Just needs Vudu and I'm set. 10 to 12 minute setup. One issue I had is that it was a little longer than the space my hdmi slots allotted, however the hdmi extended solved that.", "verified": true, "helpfulness": "0/0", "author": "Nonchalant"}, {"rating": 5.0, "review": "Awesome! It is so easy to use. I am ordering another one for my other t.v as well.", "verified": true, "helpfulness": "0/0", "author": "Melissa W"}, {"rating": 2.0, "review": "I really wanted to give this a good review however I feel one of the key features are seriously lacking in functionality. I finally discovered yesterday that the software in both the Fire TV Stick and set-top box do not support quotes, forward and back slash characters in the wireless security key, so you end up trying endlessly to type the passkey in only to have the device to fail to connect with no suggestive error message about what the problem is. I was able to work around the issue for the set-top box by plugging directly into the route via a network cable, but the only solution for using the Fire Stick is to change your wireless key to remove any non-supported characters from your passkey. I was surprised this is even an issue given that every other wireless device I use (there are 12 other wireless devices connected in my network including Tivo's, Printers, Smartphones, Kindles, Nook's and multiple computers) and have used didn't have this limitation, hopefully Amazon Developers will go back and fix this bug and include the fix in future builds for the Stick, however I'm not waiting for a fix and will be returning this device.", "verified": true, "helpfulness": "2/3", "author": "E. Smith"}, {"rating": 3.0, "review": "my biggest problem is no access to web... so we can login to things like comcast open internet...and it just blows through data if you use mobil data.... a simple tv show can use 1 gb a movie you say? 1.5 gb min.well it is nice other then that.", "verified": true, "helpfulness": "0/0", "author": "J W"}, {"rating": 4.0, "review": "Works better than my Chomecast - however no app for ipad/iphone yet.", "verified": true, "helpfulness": "0/0", "author": "CincyTom"}]