[{"rating": 4.0, "review": "So far so good.  Much better than chromecast.", "verified": true, "helpfulness": "0/0", "author": "Daniel Alperovich"}, {"rating": 5.0, "review": "Excellent product I must say that is even better than apple tv", "verified": true, "helpfulness": "0/0", "author": "George Pavesio"}, {"rating": 4.0, "review": "Easy as all get out to install and set up. Now I can get prime movies and Netflix and a bunch of other things.  I love it", "verified": true, "helpfulness": "0/0", "author": "Maureen M. Markunas \"Blizz. Mom\""}, {"rating": 5.0, "review": "Love it! Easy to use, simple, light, better than roku!", "verified": true, "helpfulness": "0/0", "author": "Eunice Murphy"}, {"rating": 5.0, "review": "Well designed and easy to use", "verified": true, "helpfulness": "0/0", "author": "RabidAvid"}, {"rating": 4.0, "review": "this is easy to use", "verified": true, "helpfulness": "0/0", "author": "christ gagliastre"}, {"rating": 5.0, "review": "Has why not to offer than I expected. Very glad I brought it and telling everyone I know about this.", "verified": true, "helpfulness": "0/0", "author": "ALBERT DEWAYNE CARTER"}, {"rating": 3.0, "review": "Would like the Fire stick better if had a vudu app. Flixster doesn't have as good of a menu interface to find movies. I am looking forward to travelling with the Fire stick and not needing my laptop to stream movies in the motel rooms.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good as new. Couldn't tell the difference between and saved $4", "verified": true, "helpfulness": "0/0", "author": "Mr. Perry \"Perry\""}, {"rating": 2.0, "review": "I live over 6 hours from Minute Maid Park. Yet according to MLB, I'm still one mile inside the blackout area for Houston Astros broadcasts. I was led to believe that this stick would alleviate that problem, or at least give me the Root Sports Network to watch the games. Alas, it does neither. It really only gives me a handful of channels and networks over my satellite package. Lucky for you the information for the product was able to disguise all of that so that I'd blow my money!", "verified": true, "helpfulness": "0/0", "author": "Ben Wyles"}]