[{"rating": 5.0, "review": "Once again Amazon comes out with a winner. This device works great plus its compatable with my Amazon Tablet and Android smart phone. And the best part is I took advantage of the introductory offer and got it for $19.00.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 4.0, "review": "I bought this when amazon was offering it for $20. It's definitely worth it! It's very fast and easy to use and I love that it has a remote. I wish that screen mirroring was possible all devices, not just amazon ones. But it definitely works a lot better than chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jessica A Witt"}, {"rating": 4.0, "review": "Not quite plug and play as there were some day one updates to install.  Fortunately, these corrected the issues I was seeing.  So far, this is a nice streamer.  Provides easy access to all of my Amazon content.", "verified": true, "helpfulness": "0/0", "author": "Nick R"}, {"rating": 1.0, "review": "not what I expected", "verified": true, "helpfulness": "1/2", "author": "frederick c jackson"}, {"rating": 5.0, "review": "Exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 3.0, "review": "I own: Boxee, AppleTV, Roku, Chromecast, and I have a powerful XBMC media center, and an XBMC Raspberry pi; along with a samsung and a philips smart TV, which doesnt count, but just for a complete list :)The Fire TV Stick is very good; 3 stars is a lot for me to give a product in this genre, as its really difficult to please me.My main issue with the Fire Stick is the customizability.  I dont want much, but I do want the ability to have a main dashboard, and the ability to hide everything.  I dont want to cycle through the 70 things I dont subscribe to to get to the 3 I do.I see a good future for this product, at least the capability of a good future, anyway.Apple TV > XBMC > FireTV > Chromecast > Everything Else", "verified": true, "helpfulness": "0/0", "author": "Roquen \"Respiratory Therapist\""}, {"rating": 5.0, "review": "Love this little puppy...works great on 5.0 ghz...if yours didn't work right...must be your connection...had it 4 days works flawlessly...oh yeah and the Prime Music is great coming thru my home theater using the stick", "verified": true, "helpfulness": "0/0", "author": "Jody L."}, {"rating": 4.0, "review": "This is an awesome, affordable and easy to use product that is as simple as it sounds. The only thing I would like to see is a cross-app search function. Searching for a TV show/movie shows whether or not it is available on the Amazon platform. Having a Netflix, Amazon and Hulu account, it would be great if one search would show whether or not content was available across multiple accounts instead of \"other ways to watch, HD, SD...\"", "verified": true, "helpfulness": "1/1", "author": "Phil"}, {"rating": 4.0, "review": "I was a little disappointed to learn the stick has to be plugged in for power. Other than that, I think its a great product.", "verified": false, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 1.0, "review": "Returned the problematic piece of s***...", "verified": true, "helpfulness": "1/1", "author": "jorge marcos monges"}]