[{"rating": 5.0, "review": "So much better than the older wifi blue ray system I was using.  Fast loading (instant almost)  and easy to set up. Need to get another.", "verified": true, "helpfulness": "0/0", "author": "85300zxt"}, {"rating": 5.0, "review": "It works! I have a chrome cast, but amazon does not work with Amazon Prime videos.  Find myself using the fire stick more only because of the remote and the ease of use. My 5 year loves it, but still uses the chromecast to watch his youtube", "verified": true, "helpfulness": "0/0", "author": "Danny Chong \"Danny\""}, {"rating": 5.0, "review": "This is a must for anyone with a HDMI Ready TV that is not a SMART TV or is old enough to be limited as my bedroom 40in is. This is so simple, allows downloads such as Aquariums and Fireplaces. Netflix, Amazon Prime movies, Youtube, Pandora and so on. Its well worth it and I already got a second for my dad and it was appreciated too.", "verified": true, "helpfulness": "0/0", "author": "stang65"}, {"rating": 5.0, "review": "Before buying the Fire TV Stick, I was using my Chromecast quite a bit and really liked what it had to offer. I decided to give Amazon's streaming HDMI stick a shot and I'm glad I did!Even though I have a PS4/Xbox One connected to the TV that the Fire TV Stick is connected to, I end up using the Fire instead (for streaming). It's very snappy for the most part. In comparison to the consoles it'll bring up pretty much anything faster. What it won't do faster is bring up a youtube video than a chromecast...but other than that, this thing is awesome.Side note, not really a big fan of the android app that you can control the fire tv stick with...but maybe that's just praise to the remote it comes with.", "verified": true, "helpfulness": "0/0", "author": "Joe Peterson"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "NVR"}, {"rating": 5.0, "review": "Everything that I expected and more. Thank you.", "verified": true, "helpfulness": "0/0", "author": "kbaybayan"}, {"rating": 3.0, "review": "Fire tv box and fire tv stick are incompatible with Mitsubishi TVs. Don't even bother! On the bright side, it works with my Samsung TV. After talking to customer Service THREE TIMES, they finally own up to the incompatibility.", "verified": true, "helpfulness": "1/1", "author": "MathCoachJulie"}, {"rating": 3.0, "review": "It works, and gives me access to all the major service providers, Hulu, Netflix, Amazon Videos. My issue is that the advertisements (TV) make it seem as if you just plug it in - and it works, which is TOTALLY FALSE - LIE LIE LIES! The first thing I noticed when unpacking the fire stick is that there is a mini usb port. You must connect this to an available usb port, or use the included usb power adapter. If you don't, the stick WONT WORK! I would have loved to have a stick that doesn't need to be powered externally, but maybe that was just a dream.Otherwise, the included remote works easily, and the app that you can download is easy to work. The first time you start everything you'll get a short video, and instructions on how to start. Once I logged in, everything was seamless and easy.", "verified": true, "helpfulness": "1/1", "author": "David"}, {"rating": 4.0, "review": "AMAZON FIRE STICK WORKS GREAT.  Only complaint is the USB power wire needs to be plugged in to a wall outlet. The USB power from the TV does not supply enough power to run direct from the TV. So if you have a TV on the Wall like I do with no wires showing . You have to run a power wire down the wall to an outlet. Other than that the product works great..", "verified": true, "helpfulness": "1/1", "author": "William H. Oconnor \"Bill\""}, {"rating": 5.0, "review": "initial setup was a bit of a pain, kept restarting and failing, worked fine after the 5th or 6th try.", "verified": true, "helpfulness": "0/0", "author": "rob chacon"}]