[{"rating": 5.0, "review": "I love my fire TV stick I have no problem with it and will be getting another one soon the service is good.", "verified": false, "helpfulness": "0/0", "author": "linda anthony"}, {"rating": 5.0, "review": "Very satisfied. This is the third one I ordered. My kids really love it.", "verified": true, "helpfulness": "0/0", "author": "christina purnell"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Susan Fields"}, {"rating": 2.0, "review": "Will not work with verizon fios router..  Verizon told me to wait for a fix or get a different isp...  Are you kidding me?!", "verified": true, "helpfulness": "0/0", "author": "GRAV"}, {"rating": 4.0, "review": "I couldn't believe how easy it was to install. Really pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Toni Glenn"}, {"rating": 4.0, "review": "the fire stick initally could not be set up. I had bought this as a Christmas gift for my parents. they had slow internet speed. with that, the inital setup could not be comepleted. I brought it over my house and set it up on my net connection. works great.", "verified": true, "helpfulness": "0/0", "author": "Justinian \"Justinian\""}, {"rating": 5.0, "review": "Quick and easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Melissa Ellingham"}, {"rating": 4.0, "review": "It's OK. Interface is face. Very easy to use, but where are all these movies they speak of? Could be I don't know how to use it yet, but I see a few hundred movies not these thousands they claim", "verified": true, "helpfulness": "0/0", "author": "descom hoagland"}, {"rating": 5.0, "review": "I actually prefer this over my C*Cast.It is lacking as far as screen casting but the remote is such a huge bonus.It really comes down to having a remote over having to use phone and computer apps.Smart move Amazon.", "verified": true, "helpfulness": "0/0", "author": "Portland79"}, {"rating": 5.0, "review": "So much to see. I love Amazon prime.  Lots of free movies games and books!", "verified": true, "helpfulness": "0/0", "author": "elliott"}]