[{"rating": 5.0, "review": "Love it! Very easy to install and navigate. Loving it so far.", "verified": true, "helpfulness": "0/0", "author": "raom"}, {"rating": 4.0, "review": "A solid item. Only thing that is unclear is that the stick mesa power connection,something that is not shown on the ad copy on the left. I'm sure if it was conversion rates would drop.this amazon figures that most in happy purchasers will keep tue item.anyway.for what is worth it's a sold alt to roku", "verified": true, "helpfulness": "0/1", "author": "Practical and funcional"}, {"rating": 5.0, "review": "I am new to this technology but I have been checking it out for a few months before making a purchase. I have 5 tvs and only one is a smart tv. This Fire Stick is exactly what I have been waiting for. If you do the comparison, you'll agree. I turned in one of my cable boxes and plugged in the stick and WOW. I love it!!! So quick and easy to hook up. I would have liked the sound control on the remote but maybe next time. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Irene W. Inman"}, {"rating": 4.0, "review": "I haven't had a chance to use it much but, from what I saw it worked pretty good. I'm sure I will get used to it and use alot as I use it more.", "verified": false, "helpfulness": "0/0", "author": "Kasey Mytinger"}, {"rating": 5.0, "review": "It was so easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Parr"}, {"rating": 4.0, "review": "The fire stick user interface is fast. Other services are added as apps which are not fully integrated into the user interface as are prime services. The stick was easy to setup. No problems accessing my wifi. My router is located near my tv so I cannot comment on wifi access from a distance.I would like to see vudu, Google movies and TV, Google Music. Maybe abc, cbs syfy network apps. Some apps aimed at Internet service providers like xfinity TV go. I think other people would want HBO go.I am very satisfied with the stick. I just would like to see more video and music apps in the future.", "verified": true, "helpfulness": "0/0", "author": "Peter Labrie"}, {"rating": 3.0, "review": "I bought this from best buy since amazon does not have them in stock. A couple things 1) the antenna on this is crap. If you are not using it on a TV that is pretty much ontop of your router don't bother or spend an hour trying to set it up. I now am going to spend more money to buy a range extender so maybe I can get a better experience with it. Maybe the $99 box is better? I don't know but all I do know is if I am forced to watch this ridiclous set up video one more time I'm gonna lose it!**Update 12/10/14 **OK, I am updating this review because I have had this for awhile now. One thing at this point is clear to me. The range on the receiver for this item is not great. after buying a range extender and setting it up I still had connectivity issues with the device. I did a hard reset (hold enter and Pause / Play) as described in the book and once I did that I was able to download Netflix as an app. There seemed to be hang in between validating pin and I hit the back button, then hit it again entered my pin and it actually downloaded. since the initial set-up I dared to download crackle as an app. I did so and no issue what so ever. I gave this 3 stars (originally 1) because it works, Its not ground breaking technology and set up was something that made me want to take a hammer to the device. You get what you pay for and this is cheaper than many devices out there so the fact that the receiver isn't top of the line is understandable but it does not make it less aggravating. Great for you if you have it going into a TV with close proximity to your router, if not I suggest you invest in a range extender or skip the fire T.V. stick. The hanging of software when contacting Amazon might be a firmware issue. I have not had any issue with this recently but then again I don't use it often other than playing Netflix. So in closing buy it if you want a cheap alternative to streaming devices offered by competitors but be forewarned you may have to troubleshoot the device on setup.", "verified": false, "helpfulness": "19/25", "author": "John Puopolo"}, {"rating": 3.0, "review": "I bought this device to watch Prime videos.  It works better than my Panasonic Blu Ray player for streaming Prime Video, because it has a better search function.  Other than using this for streaming Prime video, I don't have any real use for the device.  It would be nice if Amazon could make it compatible with my iPhone.", "verified": true, "helpfulness": "2/2", "author": "rugbygame"}, {"rating": 3.0, "review": "Its an ok streaming device, I will still prefer the chromecast outside of not being able to stream Prime.The setup is absolutely terrible, they force you into watch a close to 5 minute video that tells you nothing a technologically average person couldnt figure out first try.  The android app is also terrible, I expected to be able to navigate through the menu with it, but outside of voice search it is unusable.  The massive touch pad within the app is too sensitive for how laggy it is.  It will miss register clicks and is frustrating.  I cant find a reason netflix should not be included in the voice search by now.", "verified": true, "helpfulness": "2/2", "author": "Patrick Ferris"}, {"rating": 5.0, "review": "bought 2. both work great. Can't figure out why they (Amazon et al) can offer an optional game remote to play games and hook up to my router but not include a browser with an optional keyboard for web surfing. Would be nice to see an NBC app or other network app where we can see real time broadcasts. I understand the regular networks have to keep affiliates happy but why not a CNN app, or download an app for my favorite home news network. I often like to watch foreign news from foreign sources to seek new insights. Can CCTV, Al Jezerra or other network create an app for users to see their real time news? The app library seems limited.", "verified": true, "helpfulness": "1/2", "author": "Phil R \"philr\""}]