[{"rating": 5.0, "review": "Soooooo Easy. Installs in minutes. Works exactly as advertised. Great product.", "verified": true, "helpfulness": "1/1", "author": "Kenneth Simpson"}, {"rating": 5.0, "review": "Great product.  Quick delivery", "verified": true, "helpfulness": "1/1", "author": "Anonymous"}, {"rating": 1.0, "review": "It works when it wants to. Have had to call tech support half a dozen times-literally!!! And even tech support is useless. It works for an episode of whatever tv show I'm watching then freezes and I have to restart the whole thing. Such a horrible purchase.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "This is the best stick out there! It's super easy to set up and use. I use it all the time for watching Netflix. I highly recommend buying this stick if you're looking for one!", "verified": true, "helpfulness": "1/1", "author": "melissa grayce trussel"}, {"rating": 4.0, "review": "I'm brand new to this--just got it today!  I decided to do away with cable TV since I was paying big bucks for very little to watch.  I had the least expensive cable offering (from Time-Warner) previously called broadcast but now called starter cable.  When I got a good Winegard antenna from Amazon, I discovered that TWC wasn't even providing me with many stations that I could get over the air--including some in other markets not too far away and several of the extra signals where they carried the main one but not the extras (TWC provided only 14.1 as a part of their starter pkg while the channel also has 14.2-14.5).  I had attempted, after ordering the Fire TV Stick and signing up for Amazon Prime, to watch a short cartoon on my computer under the Prime selections.  My computer apparently didn't like Silverlight, so I gave up on it (yesterday).  When I got the Fire TV Stick today and hooked it up on my TV, it worked like a charm: crystal clear HD.  So far, I've only watched a couple of cartoons just to check it out, but my initial impression is that I have made a very good purchase.", "verified": true, "helpfulness": "1/1", "author": "Wayne"}, {"rating": 5.0, "review": "Love it and the price is great! Haven't had any problems and it was an easy setup.", "verified": true, "helpfulness": "0/0", "author": "Richard Widen"}, {"rating": 5.0, "review": "Best product for the the price and quality on Amazon. I've been an Amazon Prime member for years for the two day shipping. The ability to watch movies and especially tv shows on my schedule without commercials is great. Free with amazon prime. Love this.", "verified": true, "helpfulness": "0/0", "author": "D. Proviano"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Patricia G Anderson"}, {"rating": 2.0, "review": "Plugging the stick directly into my TV worked fine, but when I plugged it into my receiver (Denon 2312CI) no signal came through.  This seems to be a common problem with Denon and other receivers:http://www.amazon.com/gp/help/customer/forums/ref=cs_hc_g_tv?ie=UTF8&forumID;=Fx1SKFFP8U1B6N5&cdThread;=TxBBWXFR2ZMETA", "verified": true, "helpfulness": "0/0", "author": "Jason Merrill"}, {"rating": 5.0, "review": "we thought roku was nice but fire stick blows it away, thanks amazon", "verified": true, "helpfulness": "0/0", "author": "AnnaV"}]