[{"rating": 1.0, "review": "I was very happy to recieve my Fire TV stick before Christmas. However, that faded after I hooked it up to my TV and it did not work. I plugged it into my TV the using the AC plug that they do not show in the image they advertise... I wish they had of, I still would have purchased it, but getting the unit and discovering there was a wire that needed to run from the unit to a plug was disappointing.  It is not shown in that way on either the Amazon Product page you are looking at... or the box the product came in.  I probably would have lived with that, but the darn thing just didn't work! I see a very brief scrambled tv image ... then it loses signal. Tried repeatedly on 3 different TVs, but it just doesn't work.  I was stoked to see a cheap alternative to my AppleTV, but I'm worried in this case you get what you pay for..**UPDATE - Dec 26th, 2014**  Stick working, remote not.Amazon sent me a replacement stick (only the stick), which came in 2 days. That was great. The replacement FireTV works as opposed to original which was DOA, it boots up and goes to the start screen that says: \"FireTVstick  Press >|| to start\". Pressing that button on the remote does not do anything.  Pressing any button on the remote doesn't do anything. I've tried new batteries in the remote.  I've tried unplugging and replugging in the Stick from the TV.  I'm using the AC adapter.  I'm hoping they will send me out a new remote and that might fix this issue.", "verified": true, "helpfulness": "2/4", "author": "Rob Foote"}, {"rating": 1.0, "review": "Most channels that are attractive to kids on Netflix would be charged here... I mean... I am already a prime member...and also I pay for Netflix... why do I have to keep both? I returned this after I figured out the peppa pig and the pingu were not free to prime.", "verified": true, "helpfulness": "0/2", "author": "Ringr"}, {"rating": 2.0, "review": "I bought this and was quite excited about using it. Unfortunately I kept getting an error message telling me that it couldn't connect with the Amazon servers. Back it went!", "verified": true, "helpfulness": "0/0", "author": "KS DEED"}, {"rating": 5.0, "review": "Just got my Fire TV stick and I love it!  This is replacing my Crome dongle and is an early gift to myself. It has an easy intuitive interface  and if you download the app to your smartphone you can do voice search and all controlling from your phone however I really think the addition of the included remote controller is brilliant and am happy using it.", "verified": true, "helpfulness": "0/0", "author": "Digiart"}, {"rating": 4.0, "review": "Only give it 4/5 as there is no off button. I have had to unplug it each time it's not in use, but other than that it's a great way to wirelessly watch Amazon Prime shows on your TV.", "verified": true, "helpfulness": "0/0", "author": "Jonathan McCafferty"}, {"rating": 3.0, "review": "You can tell they REALLY want you to buy more stuff with this device.  I'd stay away and just get a Chromecast.", "verified": true, "helpfulness": "1/1", "author": "mek2600"}, {"rating": 1.0, "review": "I mainly bought this to mirror my Kindle HDX. But it rarely works and it does not work with mirror ring on my Samsung telephone.", "verified": false, "helpfulness": "2/2", "author": "Just wondering"}, {"rating": 5.0, "review": "Simple and easy to use. No issues!! I like using this better than our smart TV.", "verified": true, "helpfulness": "0/1", "author": "OnlineShoppingMOM"}, {"rating": 5.0, "review": "This blows apple tv out of the water!I bought this when it went on sale for prime members for $19.99, I thought- what do I have to lose, right? Waited a while, almost forgot about it. Then it came... I plugged it in, connected to my wifi, and boom! Super easy!!! I can watch movies, listen to free music, watch a slideshow of all my pics, netflix, vevo, read a storybook to my son, OMG, what doesn't it do??!? With the apple tv, it took me over 2 hours to mess around to get it to work, and even then it sucked. For a fraction of a price, the fire stick is way wayyyyy better. I would have paid full price for this little gadget.", "verified": true, "helpfulness": "0/1", "author": "cherrie"}, {"rating": 5.0, "review": "For the price it's really worth it, I had been looking for an android stick for a while, but most of them were overpriced until amazon came along !, and so glad they did. i bought a total of 4 fire tv sticks and i couldn't be happier !, it's ability to sideload apps such as \" xbmc/kodi\" was what made this android stick a winner in my book !", "verified": true, "helpfulness": "0/0", "author": "JOSE N."}]