[{"rating": 5.0, "review": "Very user friendly!!!!!!!!  So many apps. and for the most part, they work!  At least the ones I've selected!  I'm lovin this!!!!", "verified": true, "helpfulness": "0/0", "author": "Ian"}, {"rating": 5.0, "review": "Fast streaming without interruptions and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Nice item!", "verified": true, "helpfulness": "0/0", "author": "Kenneth"}, {"rating": 1.0, "review": "mine is stuck at this screen all the time,it was a waste of money,i probably had a manufacturer defect,wish i can get money back but too late.", "verified": true, "helpfulness": "0/0", "author": "Daniel Schenk"}, {"rating": 1.0, "review": "Junk. If you've owned an Apple TV it will become abundantly clear what a piece of junk this is. From audio quality to streaming, this device is far inferior. I've got 30 meg down in the exact proximity of this device and it can't keep up. It freezes, crashes and does it's best to make up for lost time - all at the viewers expense. My Apple TV which failed, in the exact same location, never had this issue. Nor does my AppleTV on the other side of the wall in the living room. To confirm, the device's software assures me there is no issue with my Wi-Fi. The complete interface is far inferior than Apple TV. To me, the voice remote is worthless as it can only search for titles on Amazon. Had I not we waited to install this, it would have been sent back.", "verified": true, "helpfulness": "0/0", "author": "JoJoCamel \"Camel\""}, {"rating": 5.0, "review": "I love this product. It really made a difference in our lives. We had been using a Sony BlueRay player to access Amazon and Netflix, and found out how much of an antique that is when we started in with the Fire Stick. Really fast, high quality build and packaging. Very impressive for the $30. I wouldn't pay list price, however, and Amazon should put it on sale more often.", "verified": true, "helpfulness": "0/0", "author": "Bill F."}, {"rating": 5.0, "review": "Easy to install and use. Great!", "verified": true, "helpfulness": "0/0", "author": "Charles M."}, {"rating": 5.0, "review": "awesome easy user friendly thank you", "verified": true, "helpfulness": "0/0", "author": "kathy Van Buskirk"}, {"rating": 5.0, "review": "This fire stick is awesome!  Instead of watching Netflix and other movies on my Kindle, I can now plug it it to my TV and watch it full screen!  I really am happy with it!!!  WTG Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "JoAnn Pedersen"}, {"rating": 5.0, "review": "Absolutely love this. It's great to move to different TV's. Downfall is Amazon Prime movies are not all free. So you either rent or buy. Not much of a cost savings, but if you buy the movies you have to watch any time! I subscribe to Netflix and stream from the Amazon Fire Stick works great for the kids. It would be nice if Amazon provided same service as Netflix, being that there a more free movies.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}]