[{"rating": 5.0, "review": "It is so easy to use. The apps and games are simple to download.", "verified": true, "helpfulness": "0/0", "author": "la41589"}, {"rating": 5.0, "review": "The Fire TV Stick works great!  Easy to install, does what it claims to do, and should give us all a leg up with \"cutting the cord\" to cable or satellite services.  I was disappointed to see that Sling TV, one of the really nice APPS available on the Fire Stick, will now be costing $20.00 per month, but that's the world in which we live.  Bottom line....I like it...a lot!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "didnt have hbo when got it", "verified": true, "helpfulness": "0/0", "author": "sagar zanwar"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "susan tatham"}, {"rating": 1.0, "review": "Sorry it didn't work very well for me... I may return it... Even though the device is showing a decent signal I keep on loosing connection... Maybe it's something not compatible with my Uverse box... It's odd because I am able to watch movies on my Ipad from that spot but my the Fire Stick is acting up.", "verified": true, "helpfulness": "0/1", "author": "Miamale \"Miami Man\""}, {"rating": 5.0, "review": "Third one I've bought for myself, family and friend.  AWESOME!!", "verified": true, "helpfulness": "0/0", "author": "Susie Gordon"}, {"rating": 4.0, "review": "Works really well and I found it easy to navigate.I still prefer my Roku, so I'll stick with it for now.", "verified": true, "helpfulness": "0/0", "author": "Matt Person"}, {"rating": 4.0, "review": "Need to get rid of my cable provider!", "verified": true, "helpfulness": "0/0", "author": "Renee Saucedo"}, {"rating": 4.0, "review": "This is a very cool device. My only disappointment is it needs to be connected to an AC plug at all times, which was not shown in any pictures or called out in any descriptions.", "verified": true, "helpfulness": "0/0", "author": "Byars Cole"}, {"rating": 5.0, "review": "I love it and such a great price too", "verified": true, "helpfulness": "0/0", "author": "talina"}]