[{"rating": 5.0, "review": "Works great, easy to use and install, remote control is much easier to use than Chromecast's smartphone interface.", "verified": true, "helpfulness": "0/0", "author": "KellyK"}, {"rating": 3.0, "review": "The Amazon Fire stick is decent, but I still use it less than the Chromecast.The pros... finally, Amazon prime natively on a an HDMI stick device. The remote's also decent, but I find the default menus and features somewhat restrictive, so you'll still want to use your phone or add things to the watchlist first.The cons... feature wise, still not as good as the Chromecast. It also features a smaller app portfolio than the Chromecast. The Amazon Fire stick also has a higher power requirement, meaning, a lot of TV USB ports will be considered insufficient.Overall... unless you love Amazon prime videos, consider other options.", "verified": true, "helpfulness": "1/2", "author": "Justin L"}, {"rating": 5.0, "review": "I love it. Easy to set up and use. Glad it came with a remote.", "verified": true, "helpfulness": "0/0", "author": "Calinda Jones"}, {"rating": 1.0, "review": "I have a Blu Ray that let's me access programs like Netflix, so I bought this for three reasons: being able to make my little screen a big-screen (meaning putting something from my Mac or iPad on my tv); accessing Showtime Anytime; and WatchESPN.It turns out that even though the Fire TV Stick advertises that you can bring you small screen to big screen, this cannot be done with a Mac or iPad.  In addition, if you are one of the 37 million+ DirectTV subscribers, Showtime Anytime is not available on Fire TV for Direct TV subscribers (but it is offered, say if you want to watch on your computer or iPad, so this is just false advertising by Amazon).  I have not even tried the WatchESPN app.  What a waste.", "verified": true, "helpfulness": "0/1", "author": "M. Matt \"MWM\""}, {"rating": 5.0, "review": "Fire TV Stick works great.....having problems with the internet conection", "verified": true, "helpfulness": "0/0", "author": "Darryl Locke"}, {"rating": 1.0, "review": "Very disappointed. It freezes often, hate the interface, not as many channels as Roku. It isn't just a stick that goes into your HDMI slot. It needs to be plugged in to an electrical outlet and in 2/3 or our tv's.... Needs the HDMI extender. The whole thing from the stick to the interface is just awkward. Do yourself a favor an buy the Roku.... A box not a stick. I love Amazon, I love Amazon Prime but they should have limited their electronics business to the Kindle.", "verified": true, "helpfulness": "0/0", "author": "Tracy Morgan"}, {"rating": 5.0, "review": "love it, works great with xbmc. get it, now. now, not later", "verified": true, "helpfulness": "0/0", "author": "F. Parro"}, {"rating": 5.0, "review": "I really enjoyed the fire tv stick. I really enjoy being able to send it from my kindle fire to my tv with just one click.  It is wonderful to watch movies from my kindle on my tv.love it.", "verified": true, "helpfulness": "0/0", "author": "Rose    Mckenzie- Harrelson"}, {"rating": 5.0, "review": "I love this!  Easy set up and I'm not tech savvy. So nice to be able to enjoy all the benefits of a prime member!  Great buy!", "verified": true, "helpfulness": "0/0", "author": "MJP"}, {"rating": 5.0, "review": "Let me start by saying I have an Apple tv and a Roku but just had to try this when they were offered at such a good price when released!  I expected a really good product from Amazon and so far it has met my expectation.  This was extremely easy to set up.  It is very responsive, the remote is simple and it has everything to offer that I would use and then some.  It is obviously geared toward Amazon video but you add the apps you want to use and as promised you have the option of Netflix, Hulu, etc. along with game apps.  I honestly thought why would anyone want the games but decided to download a couple to try and was surprised to find it is kind of a nice option. My only disappointment was that many games require the purchase of the Amazon game controller which costs as much as this device.  I am waiting for the release of the Iphone app to use as a remote as they said it would be coming.  All in all I think it is as good as the other two I have and if you have Amazon prime it is the way to go!", "verified": true, "helpfulness": "0/1", "author": "Beth"}]