[{"rating": 5.0, "review": "Awesome addition to any TV.  I found this easy to setup and would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Stan Pollard"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "alan kennedy"}, {"rating": 5.0, "review": "good", "verified": false, "helpfulness": "0/0", "author": "Robert Pritchard"}, {"rating": 3.0, "review": "Nice enough, plays amazon play stuff, which I end up using once or twice a month. Nicer interface than the Roku Stick, still a pain in the ass compared to Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Christopher"}, {"rating": 1.0, "review": "Do you need WiFi for it to work?", "verified": false, "helpfulness": "0/3", "author": "drice"}, {"rating": 5.0, "review": "Absolutely fantastic! I'm so glad I got one for both my daughter's and for me!", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 4.0, "review": "I love this! Very easy to use. Sometimes has diffi ukty staying connected to my WiFi though", "verified": true, "helpfulness": "0/0", "author": "Britany"}, {"rating": 3.0, "review": "Misleading advertisement - none of the pictures nor the TV commercial show the power cord that needs to be plugged intothe stick at all times", "verified": true, "helpfulness": "0/0", "author": "Erik Richardson"}, {"rating": 5.0, "review": "I have had fire stick for about 2 months.firestick seems to load well and fast haven't had any problems playing movies are navigating through menus.would recommend firestick for anyone who has a flat screen TV button not a smart flat screen TV.", "verified": true, "helpfulness": "0/0", "author": "Jride"}, {"rating": 4.0, "review": "Miracast doesn't work well. I have tried with several devices and never connects. I have an Actiontec, Roku, and even the Microsoft display adapter and all workUpdate: they have certainly updated the device to support maracas and other new features, like it works in a hotel room. Some issues with that and clunky, and requires restart sometimes.Overall a grate device.", "verified": true, "helpfulness": "0/0", "author": "S. Cicoria \"...\""}]