[{"rating": 1.0, "review": "Cant get it to work", "verified": true, "helpfulness": "0/0", "author": "susan sosko"}, {"rating": 4.0, "review": "Works as promised and is easy to learn.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "LOVE the firestick.  The app on my Iphone making it a remote is the best.  Highly recommend this to anyone that likes watching movies, tv series, etc.", "verified": true, "helpfulness": "0/0", "author": "libmc1967"}, {"rating": 5.0, "review": "Wow ... this is awesome.  Bought it to use with Sling TV and it works perfectly.  Very fast, no lag.Thumbs up.", "verified": true, "helpfulness": "0/0", "author": "Patrick W. Fletcher"}, {"rating": 5.0, "review": "easy to set up, works perfect", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The first one I purchased had a faulty HDMI extender. It would only work when directly plugged into the TV's USB port. We finally got the replacement and no issues with this one at all. I pre-ordered mine so I'm not sure if there was some QC issues in earlier batches but if you have a problem, don't give up on this thing because it will work! My stepdad is technologically illiterate and was able to install his on their old VIZIO tv and they have been using it non-stop since they got theirs in mid-January.I like that this does the same thing as my Roku but is much smaller!", "verified": true, "helpfulness": "1/1", "author": "Colleen Nelson"}, {"rating": 5.0, "review": "This thing is great! worked right out of the box as expected and I can even use the usb adapter on my particular TV. It does run faster with the plugged in adapter though. Less buffering with the adapter so it must provide more power.", "verified": true, "helpfulness": "0/0", "author": "rlbrobst"}, {"rating": 5.0, "review": "Love it easy to use, many options available, plain and simple, you need to buy one if you like TV, Movies, Odds and Ends and no commercials!!!", "verified": true, "helpfulness": "0/0", "author": "MARY"}, {"rating": 5.0, "review": "works well plus easy set up", "verified": true, "helpfulness": "0/0", "author": "Peter gray"}, {"rating": 5.0, "review": "I have to say I'm very impressed with this little Fire TV Stick.  I like the interface and its up and working on my wireless network in a matter of minutes.  I got a good deal when I pre-ordered this.  If you have Amazon Prime this is a no brainer and very easy to add to your LCD TV on one of the open HDMI inputs.  I would recommend this product!", "verified": true, "helpfulness": "0/1", "author": "klm"}]