[{"rating": 3.0, "review": "While I like all it has to offer, it is buggy. It reboots in the middle of games and takes a long time to \"wake up\" when not used for a while. I especially don't like that I cannot acces some the games without having the more expensive box. This is just another competitor in the crowded market of entertainment.", "verified": true, "helpfulness": "0/0", "author": "malenightingale31"}, {"rating": 5.0, "review": "Much faster and clearer picture than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Heath"}, {"rating": 3.0, "review": "Not compatible with a TV older than 3 years, so annoying!", "verified": true, "helpfulness": "1/1", "author": "Amanda Bill"}, {"rating": 5.0, "review": "We have a Roku in one room, and now we have this in the other. The Fire Stick works very well, and it is nice to not have a box that we have to stick somewhere. It also seems to be a lot less laggy than the Roku. I do wish it had voice, and we could buy the additional remote, but I think for the price, it is a pretty good deal!", "verified": true, "helpfulness": "0/0", "author": "Taipans"}, {"rating": 5.0, "review": "Love this device.  I was able to power it using the USB outlet on my television, works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Troy"}, {"rating": 2.0, "review": "The fire TV stick is almost really, really good. As a Roku-like replacement for streaming NetFlix, Amazon-content etc it has a slick interface and works well. There is also a reasonable selection of apps and games that can be played.Personally, I found two significant glitches (I wanted a USB-powered compact device that could do WiFi mirroring) that folk should be aware of:Like the Chromecast stick, the fire TV stick is powered by USB. However, the USB ports on smart TVs (I have a fairly new LG smart TV) may not provide enough power, causing the fire stick to issue a warning to plug in the supplied power dongle, so extra extension cords.Amazon also advertises the fire stick as having WiFi mirroring (miracast) from other smart devices, which was the main reason I purchased the device. Unfortunately currently (December 2014) this mirroring is restricted to other Fire devices, and a specific version of Android. Note that Windows and IOS do not appear to be supported; Windows 8.1 detects the fire TV stick but the connection doesn't complete. Very disappointing, perhaps a later release will fix the miracast Windows issues.For now, back to Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Treb Orf"}, {"rating": 4.0, "review": "3 1/2 stars.TL:DR; Its a tv stick like all others, with some key benefits+It is one of the better tv sticks out there as its speedier then the roku 2 and roku stick and a lot more coherent for on-screen menu and information.+PLUS it also rides on the 5ghz spectrum for wifi which allows for streaming to be HD at a much better rate then my old rokus did [2.4ghz]It does fall short in certain departments:-My S5 refuses to screen mirror, this is a reported issue with many phones [search xda].  The hand shake to establish mirror always fails.  It seems to work by downloading additional software at an additional cost [allcast].-I receive an error booting up the stick saying I need to use the original power adapter to supply power to the unit, certain reviewers online [google it] have come up with the same error.  I can't determine if there are features lacking due to that error.-Screen adjustment/calibration needs tweaking.  As you can only contract/expand the 4 triangles to hit the 'edge' of the screen but in doing so I get black bars on either side, the system needs to allow the image to move so its centered.-You get advertised to buy games that the firestick can play, except that the unit by default doesn't come with the controller, the system should 'flag' the fire stick from buying something it cant use IMO", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "Great device for TV. I was fortunate to get during the 2-day sale for $19. Very easy to install and use. Remote is easy to use and the remote android app on my tablet gives me access to voice command. The apps on the Fire Stick run much faster than on my WiFi Bluray player. Very much worth the $20 spent.", "verified": true, "helpfulness": "0/0", "author": "Julio Cisneros"}, {"rating": 5.0, "review": "I bought the Fire TV Stick after already owning two Google Chromecasts, and I wish Amazon had come out with this sooner.  The interface is a little confusing at first, but overall, it is a device.  The fact that it has a remote control is a major upgrade from the Chromecast, and I like that it is compatible with Amazon Prime Instant Video.It would be nice if I could download the remote control app on my Kindle Fire HDX, and not just on my Android phone, but maybe that will be included in a future update.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wonderful.  Now, if I could just get mu husband to........", "verified": true, "helpfulness": "0/0", "author": "Beverly Sims \"granimal\""}]