[{"rating": 1.0, "review": "The first one didn't work properly....kept pausing in middle of movies or scenes....talked to 3 Amazon service reps, all the way to Jamaica and South Africa....tried repeatedly to fix, , , even had to call and involve my internet provider who trouble shot my system and confirmed my system is very fast and definitely not  the problem....service reps would not send a replacement, finally had to ask for supervisor and requested another one from her....the 2nd one came and NOTHING....completely black screen!!....NOTHING..had to call again and go through the entire phone tree and a 3rd one was sent....had to call for assistance on the 3rd one too, but it is now seemingly working fine. I like the finished product now but would NOT go through everything again.....if this one fails it's going in the trash.", "verified": true, "helpfulness": "0/0", "author": "Dave Meier"}, {"rating": 5.0, "review": "I have a smart TV but scrolling and viewing across the smart TV's menu was just too painfully slow, the amazon stick scrolls amazingly fast thru the menu and viewable titles, the remote is intuitive and easy to use, setup took me around 2 minutes, plus you get a free month of amazon prime !  This product is a must have if you do not have a smart TV !  Best $40 ever spent.", "verified": true, "helpfulness": "0/0", "author": "Tim Feltenberger"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Tommy"}, {"rating": 4.0, "review": "It is a really good device. For the price and what you get I am happy. It was hard to connect and stay connected. I know it's not my router because everything else works fine. With that, I'm looking to get another one.", "verified": true, "helpfulness": "0/0", "author": "The Tyut \"Tyut2\""}, {"rating": 3.0, "review": "This device is in serious need of software updates.  It lags pretty severely in navigating the interface, issuing commands - basic daily use.  Price is good, and I think the potential is here, but the device UI / OS is S L O W.  Hoping for improvements soon.", "verified": true, "helpfulness": "0/0", "author": "T. Shaw"}, {"rating": 5.0, "review": "Easy to setup and works great!", "verified": true, "helpfulness": "0/0", "author": "Blake Scrivner"}, {"rating": 5.0, "review": "I love my Fire TV Stick!  I can watch movies, listen to my music, watch tv series and so much more at just one click!  I LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Susan McQuillen"}, {"rating": 2.0, "review": "It could be a decent product if it would actually pick up the home Wi-Fi. I have to connect to a phone hotspot and waste cell data. All website troubleshooting suggestions didn't work. Help please!", "verified": true, "helpfulness": "0/0", "author": "Falicia Taffi"}, {"rating": 4.0, "review": "The only reason I didn't give it 5 stars is because it doesn't have HBO go.", "verified": true, "helpfulness": "0/0", "author": "Renata Murdock"}, {"rating": 5.0, "review": "We are very happy with this product.  It is faster than the other Amazon Apps you will find in other devices (blu-ray players, etc.).  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Juan O."}]