[{"rating": 4.0, "review": "very easy to set up.  excellent picture quality. do sometimes have issues with interneet connection, even when I have strong wifi signal.", "verified": true, "helpfulness": "0/0", "author": "Kerry L. Caldwell"}, {"rating": 5.0, "review": "I am hooked with amazon prime and this little usb is awesome! I can view prime movies and even netflix n hulu. You need an Hdtv and Inrernet access. I have a smart tv so its all there the usb powers itself through an additional powered usb. You can also use an adapter provided to plug to wall. I have had zero problems with it. I love it", "verified": true, "helpfulness": "0/0", "author": "Meaty Pops"}, {"rating": 1.0, "review": "this s*** sucks", "verified": true, "helpfulness": "1/5", "author": "Allie"}, {"rating": 5.0, "review": "Amazingly versatile.  Better than Chromecast, because it directly runs android apps!", "verified": true, "helpfulness": "0/1", "author": "Thaiphong Thanh Vo"}, {"rating": 5.0, "review": "I bought it when it was on super sale during pre-ordering.  I didn't need it because I already have a DVD player that gives me all of these same functions, but it seemed like a cool thing to try and to be able to move around because it's so portable.  It's so easy, and the app for my tablet is so fun to use that I go to this instead of the DVD player to get to my Netflix and Prime viewing.  For as often as I actually watch dvds on my 2nd tv, I'd probably go with the stick if I had neither.The only thing is that this does need power if you don't have a USB connection available on your tv for it to draw power from.  I'm not sure if powered USB ports are standard on tvs or not, so I thought I'd point that out.  I'd set it up first using my HDMI 2 port because I had an antenna set up through HDMI 1.  I couldn't put the power cord into it in that position, so I used the adapter to connect to the port, and the stick dangled off of it but didn't seem to be stressed in any way where I thought it'd shake loose over time.  Then I plugged the adapter into a power strip that was already behind the tv and powering the tv anyway, so no biggie.  My husband saw this and said I could use the USB port if it was powered.  He switched it for me, and we still select HDMI 2 but still reads the USB port.  I don't know how that works itself out, but it does.  So I put my power adapter away and now have just the stick attached.There isn't an off button on the menu, so I'm not sure if it goes into sleep mode or shuts off when HDMI 2 is not selected.  It seems to boot up just fine when I need it, and I do need to press the circle button to activate it when I switch over after watching some tv.When I first tried to connect the app on my tablet to the stick, it didn't read it.  I'm not sure why, but I came back to it after moving my tv to a different wall, and everything synced up just fine.  Maybe it was an internet thing where one or the other wasn't connecting very stable to the wifi.  The app also has a voice feature, so I can just tell it what to look for, and it does the work.  No typing!  I can also use the \"regular\" keyboard feature on it so there's no awkward onscreen keypad to work through with arrows.", "verified": true, "helpfulness": "0/0", "author": "keep it simple \"aeshopper\""}, {"rating": 4.0, "review": "Historically I have been a Roku girl so I was a bit skeptical but decided to give this a try. Couldn't hurt, the price was right and you get pretty much all the same stuff. Plus, my HDMI cable didn't seem to be working so the Roku I have in my room is on SD right now. (First world problems right?)When I got the stick it was easy to set up (though it would have been nice to know from the get go - AKA before I purchased it - that it runs best plugged into an outlet) and worked straight away with out any issues. I got logged into my Netflix, Amazon account, Pandora, and set up some of my favorite apps. Watched a few shows and went to bed.The second time I tried to use it, there was an issue with the Fire Stick saying it couldn't connect to the wireless. I had my computer in the same room, and my phone, both connected to the wireless network so I was confused. It said it was scanning for available networks but never gave me a list. For about two days this went on  (I switched back to watching stuff on the Roku during this time - which was still connected to the wireless without any problems) and it finally gave me a list of networks to try to log into. I found my home network and tried repeatedly to log in without success. At a loss, I unplugged the Fire TV Stick from all of its connections (wall plug, micro USB, HDMI extender, etc.) gave it a few seconds and then plugged it back in. It seemed to have reset and logged back into the wireless without any problems.I have been using it since then without issues and have had no other connectivity problems. I love the HDMI quality and the ease of navigation. I've had some problems with the remote but it's mostly user error and me trying to learn a new system.I can't say which I prefer (Roku vs Fire). Obviously this version of the Fire TV is cheaper, which is a huge perk, but I've been using Roku for years so I think I'm still a littler partial. Also, I really like the fact that there are less wires with the Fire TV. For now, when it comes to choosing between the two, the verdict is still out, but overall I'd certainly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Emtastic"}, {"rating": 1.0, "review": "Worked fine for about a week and now it always has conncention problems. We've done all the recommended troubleshooting, everything else picks up the wifi just fine in our house.", "verified": true, "helpfulness": "1/2", "author": "Amanda W."}, {"rating": 5.0, "review": "This is a great little device!  I opened the box and was browsing my Amazon Prime content in minutes.  Very cool and have used it almost everyday.  It's now my go to device to listen to Pandora, Amazon Prime music (I'm exploring this as it is new to me!  Didn't know anything about it until i received my Fire Stick), Netflix etc.My only thing I don't like is how the PIN # is so visible when entering it via the tiny remote.  If my kids see it happening on my big screen TV they would have little trouble remembering it. :(It would be great to be able to browse the Prime Music via Fire Stick otherwise you have to do it from another device or computer building playlists.  From the Fire Stick you can pick the playlists that you've created.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome tool for tv, it's very small and it works great, I just wished I would have bought more because it was on sale! Price is not bad at regular price. It's also good to give as a gift.", "verified": true, "helpfulness": "0/0", "author": "Mosita"}, {"rating": 1.0, "review": "The TV Stick works fine. It's Amazon Prime Whats a ripoff. Received Prime as a gift. Amazon would not refund the cost buyer of the gift or to me. I could ndodt Use my streaming player I had so I had to buy a Fire Stick. Amazon Prime is a mess and when you find something you want t watch you find it's not free and You have to Pay for It. I have Amazon gift cards but I will trade them for Walmart gift cards.", "verified": true, "helpfulness": "0/0", "author": "James Conrad"}]