[{"rating": 5.0, "review": "I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "nicole fleming"}, {"rating": 5.0, "review": "works great. I highly enjoy it", "verified": true, "helpfulness": "0/0", "author": "Jason Rowe"}, {"rating": 4.0, "review": "If only it would do VUDU and allow purchased videos in Youtube then I could replace all my other streaming devices in my family room.  To be fair it wasn't advertised to do this and it does well at what it is supposed to do.  Faster than most other devices that do streaming apps (like DVD players and TVs in particular).  People ask how it compares to Chromecast - they are really not exactly the same device.  This is a bit easier to use in some ways and if you are an Amazon + Netflix person that doesn't have a burning desire to send things from your multiple different types of devices you will be very happy with this.  You can supposedly send stuff from Android devices like casting in Chromecast but I can't verify that.The remote is simple and functional.  It seemed to be taking commands from my multifunction remote as well which I will need to explore further in my efforts to reduce the remote clutter in my house.", "verified": true, "helpfulness": "0/0", "author": "Clostridium"}, {"rating": 5.0, "review": "I am extremely happy with my purchase and recommend this for anyone contemplating using less cable or no cable. You still need WiFi, but don't need the hassle of engaging the cable company, bi-annually, for a decent monthly bill, for the pleasure of cable TV access.In my opinion the Fire TV Stick is an ideal weapon (alternative) against the corporate greed of cable TV who are pricing themselves out of existence. We are a captive audience with very little say in cable company business.Since you can't get \"a la carte\" cable, the Fire Stick is the best and most cost effective alternative.", "verified": true, "helpfulness": "0/0", "author": "Bobby"}, {"rating": 4.0, "review": "Great access to lots of movies with Prime Membership, at a great price.", "verified": true, "helpfulness": "0/0", "author": "Wolfspecter"}, {"rating": 5.0, "review": "Works exacly as advertised. Definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "STEVEN PINOSSI"}, {"rating": 5.0, "review": "Works very well...a lot faster wifi than the chrome cast...over all excellent product", "verified": false, "helpfulness": "0/0", "author": "Dan"}, {"rating": 4.0, "review": "Easy to set up works great. Just need to add more Apps, especially HBO", "verified": true, "helpfulness": "0/0", "author": "WSCOTT GREENVILLE \"boaterboys\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Candace L. Hartley"}, {"rating": 1.0, "review": "Terrible connectivity, impossible to return after 30 days despite recurring connectivity issues (known by amazon and by many customers)...Customer service is awful, stay away from that product.", "verified": true, "helpfulness": "0/0", "author": "Stanislas"}]