[{"rating": 5.0, "review": "so far so good", "verified": true, "helpfulness": "0/0", "author": "dean hoffman"}, {"rating": 5.0, "review": "Can finally watch prime TV, and with our TV, did not need any additional equipment to use right away.", "verified": true, "helpfulness": "0/0", "author": "Kelly M. Payne"}, {"rating": 1.0, "review": "Item didn't work. Tried and tried but it never would connect to the Internet and acted like it was stuck in \"connect to network\". Nothing would fix it. And I threw away the box since I had such confidence that it would work so I can't return it.", "verified": true, "helpfulness": "1/2", "author": "A.M.W."}, {"rating": 5.0, "review": "Now that this has HBO it is my go to device for streaming. Remote makes it easier to use than a chromecast for streaming things like HBO and Showtime, I find the chromecast a lot easier for playing things directly from my phone but I don't need to do that often and going through the fire allows me to not have my phone with me or running the appUPDATE: now that I have an amazon echo I am left wondering why didn't this thing come with the awesome little magnetic remote holder!! WHY! I like that holder a lot.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "so far I'm loving it.  I didn't realize you need to have an outlet nearby, but other than that, I'm pleased with it.  Within 10 minutes I was watching a movie on it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"katman2\""}, {"rating": 4.0, "review": "Good little device (especially at $20 Prime price). Would like to see the app collection expand, and iOS remote support. Otherwise a very solid entry in the “streaming stick” war.", "verified": true, "helpfulness": "0/0", "author": "MBonn6687"}, {"rating": 5.0, "review": "Purchased Fire TV Stick to watch the Harry Bosch series which starts tomorrow. I have not used it as yet.", "verified": true, "helpfulness": "0/0", "author": "Cliff"}, {"rating": 5.0, "review": "Easy to install, easy to use and well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Wendy R. Smith"}, {"rating": 1.0, "review": "Won't play.  It keeps stopping to load it's buffer>  They should tell you up front as to what type of broadband is required to make it play continuouslyThey should also tell you the amount od data/gigs that are downloaded for the average movies.  I had it just over a month and now it is too late to return it...", "verified": true, "helpfulness": "0/1", "author": "Bill Cortright \"CCC\""}, {"rating": 1.0, "review": "in order to use it you have to have accounts in the different sites within which I do not except amazon", "verified": true, "helpfulness": "0/1", "author": "Elaine R Lloyd"}]