[{"rating": 5.0, "review": "This has so far worked very well for me. The set up was really slow downloading the software update and took me three resets to get it going, but I figure it's because EVERYBODY else was doing the same thing at the same time yesterday since it was the first day for the device to arrive. I imagine if you order it later on you'll have no issues. I kind of blindly ordered this very early on the 27th when I saw the ad because I wanted to be able to actually watch the Prime movies on my tv and thought for $19 I'd give it a shot. So after set up I watched a movie last night and was quite pleased, worked smoothly and easily for me, quality a little less than with my dish but nothing to complain about. I have an issue in the winter that I lose my reception on my dish under mounds of snow I can't clean off, I am happy to have an alternative now.", "verified": true, "helpfulness": "1/2", "author": "BoulderCo"}, {"rating": 5.0, "review": "Extremely satisfied with the product. Easy to plug in and gives much of the same capability as the Fire TV. If you're a prime member (like myself), you have to have this product. If you're thinking about becoming prime and want to get into a video streaming service, this is also a product for you. I love the Photo sharing and Amazon Music feature too.", "verified": true, "helpfulness": "1/2", "author": "gte888v"}, {"rating": 4.0, "review": "I really like this stick. I have a Chromecast as well, but I'm a Prime member, do the Fire stick is a better fit for me, in some ways.Setup was reasonable. My only gripe there was that the Fire doesn't tell you outright that USB can't power the stick. I had to find out by having Wifi continuously fail until I plugged in to an outlet.Playback was smooth with only a few pixelation issues. I was impressed overall with the content and the speed of the interface.The reason I can't give 5 stars is the remote. Neither remote, hardware or Android app, has volume control. You have to use your TV remote for that, as far as I can tell. Frankly, it's a baffling and embarrassing decision on Amazon's part. The remote should at least control the volume.I can recommend the stick because it's a great source of content for Prime users at a great price, but, really, Amazon needs to work on the remote before this can be a five star product.", "verified": true, "helpfulness": "0/1", "author": "Brian Hartman"}, {"rating": 5.0, "review": "Love it ...soooooooooo easy to get working. I always have a hard time getting things to work but this is easy as pie. Lots and lots of FREE movies, ganes,,,you name it. Well worth getting.", "verified": true, "helpfulness": "1/2", "author": "S. Stevens"}, {"rating": 4.0, "review": "I bought this when Amazon had it on sale for $19. However, when I first hooked it up it took forever to do the updates, then when I finally got it working, everything I tried to play would start ok, then continually buffer. I had an older Denon receiver that I though I could just plug the stick into on of my unused HDMI ports, but I had issues with no sound, or intermittent sound. I even added an digital audio optical cable, but still had issues. After many hours of trial and error with different connections, I got the audio to work, but could never resolve the buffering issue. So finally I just gave up, and was going to return the item, but Amazon just told me to keep it, and refunded my money. I was getting ready to throw it in the trash when I read somewhere that someone had switched usb adapters and that eliminated the buffering issue. So I figured I'll give it one more shot, so I actually used a usb adapter from one of my old cell phones, and low and behold, it works fine now. I have not experienced any buffering issues since. The unit I got was one of the first ones shipped out, so maybe Amazon has addressed this issue with the newer ones.", "verified": true, "helpfulness": "0/1", "author": "Vampire Dog"}, {"rating": 3.0, "review": "As is usually the case with Amazon these days, I have received a text message saying my package has been delivered even though the package has not yet been delivered.", "verified": true, "helpfulness": "0/28", "author": "Dennis D. Mcdonald"}, {"rating": 4.0, "review": "Pros:* FAST menus - faster than my Tivo Series 3, Roku 2, Wii, Wii U, XBox 360.* FAST remote - very responsive - no lag* FAST to playback - videos start quickly (faster than Tivo, roku 2, XBox 360 and PS3)* Apps load quickly* Very good quality movie playback - images are sharp and motion and pans are smooth* Spotify integration works well* Netflix app works well* Amazon prime movies works well* New Amazon Photos also loads quickly and is very sharpCons:* Frustrating installation process  - had to enter my wifi password 3 times (FireStick kept forgetting)  - long introductory cartoon that can't be skipped  - Software updates took over 15 minutes - and restarted the Stick multiple times  (my house measures almost 100Mbps down with speedtest.net)* Odd Graphics glitches on certain games - there is noticeable flicker on solid color backgrounds  (I do NOT see the same flicker with any other device...PS3, XBox 360, Tivo, GameCube, Wii or Wii U)  The flicker is only noticeables in games, not movies* Parental controls seem to only protect all playback - can't seem to limit by MPAA ratings* If controls enabled, you must re-enter the code with EVERY menu in Settings again and again and again* Photo access is either all or nothing - so it shows a dump of all photos from my iphone backups  (future enhancement to control which photos would be nice)* Could not get Fire Stick to pair with my Harmony Logitech Ultimate* FireStick seemed to slow down after being plugged in 48 hours.  Unplugged/replugged it, and it was fast againUpdate (after 3 weeks of usage):* FireStick now runs reliably 24/7 without \"rebooting\", however I found the source of the laggy performance - FireStick cannot hold a reliable connection over long periods of time using a 5Ghz wifi connection to my Cisco/Comcast wifi router.  This is Comcast's latest 100+Mbps router which supports 2.4Ghz and 5Ghz wifi simultaneously.  The FireStick is bulletproof with 2.4Ghz, but unreliable for 5Ghz.  None of my other wifi devices (which support 5Ghz) have trouble holding the 5Ghz signal.  The solution was to delete the 5Ghz entry in FireStick to prevent it from trying to connect and rely exclusively on the slower 2.4Ghz connection.Update (after month+ of usage):I own two fireSticks. One has a frustrating wifi network problem (randomly losing wifi which requires a \"reboot\" to get it working again). The other is problem-free at 2.4Ghz. Both connecting to the same dual-band WiFi router. Both about the same distance from the router. No other wifi devices in my household have this issue (iPhones, iPads, Kindles, mac/pc laptops, Tivo, Roku, Game consoles) - I like the Fire Stick enough to request a replacement rather than a refund.  I'm leaving my FireStick rating at 4-stars...because when its working, its a great device.", "verified": true, "helpfulness": "13/15", "author": "FW"}, {"rating": 4.0, "review": "I've been using a Chromecast and I have a smart Sony TV with support for Amazon, Netflix, YouTube, etc.  The Chromecast has been frustrating, where it stops being detected by my tablet, iPad, or Android phone, and can't be contacted without a power cycle.  And despite everything I've read, and the latest version of Chrome for Android, I've been unable to ever cast a web video. So I hopped on the early deal for the Fire TV Stick (FTVS), hoping for a better experience (I am also in the queue for a Matchstick via Kickstarter, so I'll keep you posted).Initially I ignored the packaging, and tried to power the FTVS using the the USB output of my cable box, which has no trouble powering the Chromecast.  This caused the FTVS to continuously reboot.  I unplugged that, and switched to the supplied micro-brick power supply.  This worked, but strangely, the FTVS then gave me a warning about the power, and my only option was to say I wanted to continue *not* using the included supply.  The power supply detection apparently got a little stuck from all those failed starts.The FTVS was a bit more straightforward to initially set up than the Chromecast.  It found my WPA-protected network immediately, and entering the key was straightforward using the included remote.  The clicking sound from the remote's buttons was driving my spouse a little nuts, but it was very crisp in operation, no repeats/ key bounce.After it connected to my network, it started to download the software updates.  I'm not sure what the problem was, but this took over 25 minutes on my 30 Mbps FiOS connection (overloaded servers at AMZN?).  After the install and restart, the FTVS strangely asked me for my wifi credentials again, but before I was halfway finished entering the key, it started up with the intro cartoon/video.I browsed the menus a bit, then watched some Amazon Prime content.  Selection using the remote was very snappy.  Loading was much faster than my smart TV, and seemed faster than the Chromecast.  Playback was flawless, no buffering or detectable drop-outs.I then went to use my Android tablet with the Fire TV remote app.  Full disclosure: my tablet is a first-gen Kindle Fire that I rooted and installed Cyanogenmod on.  Unlike the Chromecast app, the FTV app had no difficulty detecting the FTVS.  Usablility of the app is a different story.  It basically converts the tablet into a big touchpad, and in my case, an incredibly twitchy one.  A normal swipe would fling the Kindle-like 'carousel' dozens of selections.  I found I had to just barely flick in the desired direction to move a single selection.  The tablet-hosted keyboard was faster than using the pick-n-click method of the remote, but I found (when trying to enter my credentials for Netflix) that the delete/backspace was not always picked up.  Until I got the hang of the touchpad, I found I had to revert to the remote to move the selection to the correct on-screen buttons (prev/next/continue, etc.).My spouse hates the idea of yet another remote, but I think the app is just a little too frustrating at this time.  I'd rather see the the TV interface reproduced on the tablet for easier navigation.I also have a Kindle Fire HD, and will try the app on that next, to see if the response is better, but for now, I keep the (tiny) remote handy.  I understand that the stick itself is black to blend in with most TVs, but I hope that someone will offer a skin/cover for the remote in something easier to see, like highway orange instead of matte black.Performance with Netflix was just as good as Prime, and again seemed snappier than the Chromecast.  I installed the YouTube app this morning, it worked, but I haven't tried it with some HD content yet.I'll try to update this as I get more hours in.UPDATE 22-Nov-2014:  Just discovered that the Fire TV Stick responds to my Sony TV's remote.  This was an unexpected but welcome capability.", "verified": true, "helpfulness": "7/10", "author": "--Gene"}, {"rating": 5.0, "review": "Honestly i bought this because they had a special sale for prime members on it for 19.99. I was tossing between the Rouko, Fire TV and Chrome Cast. Because of the special sale i bought this instead with out really comparing the other devices like it. BUT never the less its a great device.  Easy set up easy to navigate.  Does what i expected it to do. Stream high quality digital media to my 2nd tv with having to run cables of use a old game console.  Its good sold construction and once you hook it up you cant see it. I am going to buy the gamer package Fire TV for my main tv.", "verified": true, "helpfulness": "5/6", "author": "Bert"}, {"rating": 1.0, "review": "The Amazon Fire TV Stick.When I say this item for pre-order for prime members I was so excited. I wanted to get rid of my slow ROKU and the dobly support was a plus as well.The item came and was physically easy to setup. Emphasis on physically. When it came to the software setup, this item was a nightmare.The item was supposed to be a set it and forget it item. Amazon boasted that ti would be registered to my account automatically. It was not. In fact I had to spend about an hour with support to even get logged in with my account.At one point the tech suggested I change my password and try again. I told him that i could log in online and if I really needed to change my password to get this to work that I wanted word form the developer. He quickly changed his tone. The issue, in the end, seemed to be that they registered the wrong device to my account and could not register this one to my account. Someone, by magic, was able to get it registered.Okay, just a hiccup I thought. So I download Netflix. Start up a show. It buffers. It shows the first frame. It doesn't play. I tried EVERYTHING. Rebooting the device. Uninstalling and re-installing Netflix. Chanign it form the TV USB port to using the power adapter. OH, while I am on that, If you don;t use their wall plug this thing bugs you every chance it gets and tells you to plug it into the wall. Anyway, back to Netflix, it didn't work. So, alas, I plugged the ROKU back in.Horrible experience with this product. I am also on the list for the Echo, I hope that goes better...Not what I expect form such a great company", "verified": true, "helpfulness": "3/16", "author": "Gregory Jackamonis"}]