[{"rating": 5.0, "review": "Very pleased. Quite simple to install; if you are having a problem look at the instructions again.Much more than I expected. I finally get to watch first 5 seasons of Downton Abby.Download the phone app as it lets you do voice searchs.Great device.", "verified": true, "helpfulness": "0/0", "author": "DLR \"Fire lover\""}, {"rating": 2.0, "review": "Let me first start off by saying I have never given a bad review for any product,  but Amazon did such a bad job that this is the first. Also let me state that we have four Roku boxes in the house.  And I am an Amazon prime member, so I figured I should give it a go. First insulation was very easy!  I also work on computers and networks for a living so, getting it connected to the network was also easy. Here's where the issue started,  after about a day or two I noticed a slight pause every 30 seconds to every minute or so.  Making it slightly annoying to watch!  And trust me Internet speed is not an issue! I  try troubleshooting it,  reset up the network, try to different router,  all of which I knew were not the issue but I figured I'd try anyways .  Then I reset the device,  losing all my apps and started from scratch again. Finally I called Amazon saying I want to return it,  because they force you to call a number in order to return the fire stick!  Have to say I was pretty upset .  Then I talked to the lady on the  support line.  She said I had to reset it and try that.  She promised that would fix the issue even though I told her and already done It! I reset the fire stick and it got a little bit better for about two days again,  and it went right back to the same thing (  pausing and skipping constantly ) At that point rather than call Hotline again I just threw it aside went back to my roku,  and I have a watching problem for you ever sense.", "verified": true, "helpfulness": "0/0", "author": "Eric \"Book Addict\""}, {"rating": 5.0, "review": "Easy to set up and works just as well as my more expensive Roku.", "verified": true, "helpfulness": "0/0", "author": "Ken Taubenfeld"}, {"rating": 1.0, "review": "Not satisfied.", "verified": true, "helpfulness": "0/3", "author": "mig"}, {"rating": 5.0, "review": "This was replacement for one the Amazon Tech said needed to be exchanged.  But turned out it did the same thing as the other, would not connect even though settings menu said I had good signal, and also that all my other wifi systems were working well.  .  It was my router that was the problem, was not powerful enough for the Amazon stick.  Now works great with upgraded router.  Difficult for me to keep up with technology, stuff becomes obsolete in year or two, my previous router was only two years old.", "verified": true, "helpfulness": "1/1", "author": "N B."}, {"rating": 5.0, "review": "Easy, straightforward set up and results.", "verified": true, "helpfulness": "0/0", "author": "freckles gardener"}, {"rating": 5.0, "review": "This was the simplest install I have ever done!  It is easy to use and there is lots to choose from in programming.", "verified": true, "helpfulness": "0/0", "author": "cm"}, {"rating": 5.0, "review": "Excellent device and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "tomas r."}, {"rating": 4.0, "review": "I love my Amazon Fire Stick! It's great! However, I am a bit upset because movies I want to watch, even older movies are only available for rent! There are not really very many movies I want to watch on Prime that are free. Most have to be rented. Therefore, Prime isn't all that great as far as free movies are concerned. It's a good thing I get free shipping on most of my orders as long as it is Prime!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Paul D. Hoch"}]