[{"rating": 5.0, "review": "Works like a champ.", "verified": true, "helpfulness": "0/0", "author": "Larry D. Weeks"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Ellen Samuels"}, {"rating": 5.0, "review": "I love this.  Works great with Prime account.  I can watch almost anything.  I recommend this all the way!!", "verified": true, "helpfulness": "0/0", "author": "Lenny"}, {"rating": 5.0, "review": "It's going be a great device to have", "verified": true, "helpfulness": "0/0", "author": "Kirk dobson"}, {"rating": 1.0, "review": "Worse than Visio smart tv and PS4. Video stops and starts. Maybe a software update would help, but who can say? Amazon, what do you say? I can't use it as it is.", "verified": true, "helpfulness": "0/0", "author": "Zardoz \"focuspuller\""}, {"rating": 5.0, "review": "I received the fire sticker 3 days ago and used it everyday and tried to use different features and also with variaty of devices such as iPhone, kindle and iPad. It way blow my expectations for a $39 product. YouTube device paring and kindle video fling feature are my favorites. The remote control coming with the striker have a big room to improve, however, as soon as I pairing my smart phone with the sticker, I virtually no longer need the remote.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Fast.", "verified": true, "helpfulness": "0/0", "author": "Fred N Ridner Jr"}, {"rating": 4.0, "review": "We like the fire stick. Not perfect, but considering the price it's a good buy.", "verified": true, "helpfulness": "0/0", "author": "Koop"}, {"rating": 5.0, "review": "This was so simple to install and performs exactly as discribed.", "verified": true, "helpfulness": "0/0", "author": "Margaret Alford"}, {"rating": 5.0, "review": "Absolutely love this thing, we use our Amazon prime a lot more now. Couldn't live without it now. Really like that you can watch YouTube on your TV with this stick.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}]