[{"rating": 4.0, "review": "plex, netflix, and instant video. awesome. still wont connect to my lg g3 with amazon remote app.", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 4.0, "review": "Size of a memory stick but with built-in wifi.  I enjoy watching movies on prime but so far have not purchased any movies on prime. Decent selection of programs but not extensive.  Aggravating when wifi signal slows and I realize that is not amazon's problem. Would be nice to have a larger buffer in case of a dip in signal.  Wifi is not perfect and it shows its limitations with the fire stick", "verified": true, "helpfulness": "0/0", "author": "Robert21"}, {"rating": 5.0, "review": "Works like a charm, even on my \"pretty slow\" internet connection.", "verified": true, "helpfulness": "0/0", "author": "Robert Nelson"}, {"rating": 5.0, "review": "I need to say, I was more than pleasantly surprised with this product. This has exceeded all my expectations thus far. I did not like the miracast fuction, as the picture was freezing from time to time. You can get some apps, though to bypass this issue.", "verified": true, "helpfulness": "0/0", "author": "Raj"}, {"rating": 5.0, "review": "simple to use. Love it.", "verified": true, "helpfulness": "0/0", "author": "Margarete Eder"}, {"rating": 5.0, "review": "Had some early problems with HDCP errors. Used the HDMI extension cable and errors disappeared. Works well with Amazon video and Netflix. HDMI version on older TVs may be a problem.", "verified": true, "helpfulness": "0/0", "author": "Patrick Chappell"}, {"rating": 4.0, "review": "Pretty cool though it has crashed a few times, including day one.  Lots of cool features, great storage space, etc, but it could run a little better. Overall, pretty good for first version.", "verified": true, "helpfulness": "0/0", "author": "Stomatta \"Stomatta\""}, {"rating": 5.0, "review": "This has changed our way of watching TV.  Love it, Love it!", "verified": true, "helpfulness": "0/0", "author": "elaine w andreasen"}, {"rating": 2.0, "review": "I have two of these and im not impressed. I bought them because i love my fire tv box so i figured for my other TV's i would go with the stick, wrong. One TV it seems to work ok but has a problem streaming content. According to the network setting i have a strong WIFI connection. On my other TV with the other stick i have network issues with the stick loosing connection and the only fix is to unplug and re plug. I think the stick is also picky on the hdmi port you plug it in to as well. Ive had better luck with it plugged into my TV than receiver, which i do not like because everything else goes thru the receiver. Overall im not satisfied with the stick at the moment. I also think the remote is lesser quality than the remote for the box (yes i know it doesn't have voice search). The remote for the stick seems to creek and squeak when using it, especially the circular navigation. Im hoping that they have some fixes coming soon. Ill probably end up replacement them with the box as im a firm believer of having streaming devices hard wired, plus i already have a network drop at each tv.", "verified": true, "helpfulness": "0/0", "author": "Kameron Bridgeman"}, {"rating": 4.0, "review": "excellent; i want to be an engeneer", "verified": true, "helpfulness": "0/0", "author": "Nicolas"}]