[{"rating": 3.0, "review": "Having the enter button in the middle of the left, right, up, down buttons leaves a lot to be desired. There is not enough distance/height  between the buttons and I end up hitting two at once.", "verified": true, "helpfulness": "0/0", "author": "Bob Reed"}, {"rating": 5.0, "review": "Nice addition to our family room.  Now if I can get my son to share the TV.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 2.0, "review": "Works pretty well but is limited by slow internet speeds and does not offer a custom buffering setting, which would be nice. I could stand pre-loading 20 minutes of a movie and letting that absorb the load lag. This is where a larger device is a good idea.Also the product description is too vague with regards to Miracast - while it does support my Moto-X, it does not support Surface Pro tablets or Galaxy tablets. I fully expected the Surface tablets to be be functional on this device since Miracast is their deal. A verified compatibility chart should be provided by Amazon in the product description to make this clear. At least the comparison chart has now been updated to read \"Windows 8 support coming soon\", but that's a bit of a cop-out. Heck, we'll all be on Windows 10 by the time they get their act together!", "verified": true, "helpfulness": "0/0", "author": "G. Lavigne"}, {"rating": 5.0, "review": "love viewing amazon prime", "verified": true, "helpfulness": "0/0", "author": "Pamela S."}, {"rating": 4.0, "review": "The product is exactly what I wanted and works great. It loses a star because of the design of the remote - EXTREMELY difficult to open the back cover to change batteries. It actually has a 3 prong design, which means you have to press VERY hard on the top and sides of the cover while pushing back. I don't have that many thumbs, do you?", "verified": true, "helpfulness": "0/0", "author": "charkerr \"Charlene Kerr\""}, {"rating": 5.0, "review": "I have had this device for 3 months and it is great. For the price, you really can't beat this. I bought the full Fire TV as I wanted to push the boundaries of what it can do, but I use this device in my bedroom for streaming video as well as Amazon's music service.", "verified": true, "helpfulness": "0/0", "author": "Blrg891"}, {"rating": 5.0, "review": "Bought as a gift for my daughter. She loves it. Nice to include a remote, unlike competing products.", "verified": true, "helpfulness": "0/0", "author": "Barry Eriksen"}, {"rating": 5.0, "review": "excellent value!", "verified": true, "helpfulness": "0/0", "author": "Ed Burns"}, {"rating": 5.0, "review": "I love the Fire TV Stick.  I also have a roku player and I find the Amazon Fire TV stick works as well, if not better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "very easy to use love it", "verified": true, "helpfulness": "0/0", "author": "Angela weasa"}]