[{"rating": 5.0, "review": "Excellent product... Did everything it was supposed to do. very good price and speedy delivery.", "verified": true, "helpfulness": "0/0", "author": "A.B."}, {"rating": 3.0, "review": "It works pretty well.  Loads quickly, good picture quality.  The remote is almost absurdly small however and the whole Free Prime thing is kind of misleading.  It seems like every other thing I select to watch is not free, in fact it's all pretty steep.  A new movie, can't remember which one, was $4.99 to rent!  Seriously?  Redbox had them for $1.49.", "verified": true, "helpfulness": "0/0", "author": "Sandra"}, {"rating": 2.0, "review": "The video feed kept freezing for a second or two a couple times per show - or more on a bad day - then it stopped working after three months.", "verified": true, "helpfulness": "1/1", "author": "Dale Cuva"}, {"rating": 5.0, "review": "Bought this after I found out I could install Kodi (previously known as XBMC) on it. Works great!", "verified": true, "helpfulness": "0/0", "author": "Jimmy H."}, {"rating": 5.0, "review": "I've been a huge Apple fan forever and love my Apple TV. But after using the Fire Stick I'd have to say it's easy to use and as good, maybe even faster than the latest generation Apple TV.I still use my Apple TV but the Fire Stick is a great addition to the streaming arsenal.", "verified": true, "helpfulness": "0/0", "author": "philip ferdinand"}, {"rating": 5.0, "review": "Love the fire stick.  Works great.", "verified": true, "helpfulness": "0/0", "author": "S. C. Pearsall"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "My family loves it.  Great product for the price.", "verified": true, "helpfulness": "0/0", "author": "Martha Helms"}, {"rating": 4.0, "review": "Works well but a little more detail in startup guide would be welcome.Wished TNT and AMC had fire TV apps.", "verified": true, "helpfulness": "0/0", "author": "Richard Bond"}, {"rating": 5.0, "review": "Thank you for the quick turn around. One of them does have issues connecting to the Internet.", "verified": true, "helpfulness": "0/0", "author": "Ruben Diaz"}]