[{"rating": 3.0, "review": "Programming is spotty. i have to keep proving via setup/passwords that it is really mine. One of them in my mother's room is not worth bothering with.", "verified": true, "helpfulness": "0/0", "author": "terry dennis"}, {"rating": 5.0, "review": "Works great. Love it!!", "verified": true, "helpfulness": "0/0", "author": "Kim mclellan"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Chanel Gish"}, {"rating": 1.0, "review": "i have 2 comments to make. this fire stick tv is a piece of junk, it has not worked right one single day that i have had it. i bought it for my wife. i plugged it into hdmi2 it didn't work i got a black screen. then i called amazon they said to plug it into hdmi 1 i did and it worked. i then tried to use the controller and the fire stick would not hook up to the controller.  i called amazon and did everything they said but the firestick would n ot hook up to the controller. the guy put me on hold for like 20 minutes so i hung up. a few days later amazon called me back and offered to r3e0place it that was this morning. so i said fine. i tried to use the firestick tonight using just the firestick remote. the firestick was not working i just got a black screen. i called amazon m i did everything they said and just got a black screen,  i said i needed a new firestick but they said even though i bought the item i need my wifes info because she registerd it then the woman told me i was rude for telling her i bought the item and i should be able to get the item replaced if its not working. if u buy this thing u deserve what you get.", "verified": false, "helpfulness": "1/1", "author": "david"}, {"rating": 5.0, "review": "I love it!! Got the fire TV Stick with a slingtv promotion and I have been using it in the living room. It lags a bit but once the program starts it doesn't really affect the shows. It has all the major programs you want, sling, netflix, youtube and amazon videos so I absolutely love. I wish the fire tv box was a bit cheaper and I would have gladly purchased that instead.", "verified": true, "helpfulness": "0/0", "author": "Kathleen H"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Gina Gandall"}, {"rating": 5.0, "review": "Love it! Way better than my Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Todd boyd"}, {"rating": 2.0, "review": "I have had a lot of issues with poor performance.  It frequently pauses while playing videos in YouTube and Nerflix some days. I am unable to use HBOGO because my cable service provider isn't recognized. It's been more frustrating than useful.  I recommend spending a little more money and getting a better media device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Easy as pie to set up, but not so great at maintaining signal. I find it buffering quite a bit - and it's the closest item to my wireless router, only about 16-18 ft away. Occasionally loses signal altogether, forcing me to unplug the dongle and reboot - which is very inconvenient. I put up with it since I got it on sale and don't use it that often, but wireless connectivity issues are often a problem, especially compared to my other 2 smart TVs and my Roku unit, which are trouble-free.", "verified": true, "helpfulness": "0/0", "author": "Mark Schweitzer"}, {"rating": 5.0, "review": "I can't really add anything to all of the positive reviews I have already read, so just wanted to add my 5 stars and say, I LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "MAH"}]