[{"rating": 5.0, "review": "I bought this item to use in my second home and in the hustle of preparing to leave forgot to pack the fire stick. Review to follow in the future", "verified": true, "helpfulness": "0/0", "author": "Edgard J Rivera"}, {"rating": 5.0, "review": "The Fire TV Stick is so great and easy to use. I have been using a Sony Blue Ray player and the stick far surpasses the speed in loading movies and programming. It is plug and play immediately. So glad I made this purchase.", "verified": true, "helpfulness": "0/0", "author": "Dianne"}, {"rating": 5.0, "review": "It's awesome, stopped using my Chromecast. Also have Apple TV, but cut the cord eight years ago and this is a wonderful option, especially if you already use prime for shipping!", "verified": true, "helpfulness": "0/0", "author": "cleon black"}, {"rating": 5.0, "review": "Loving the fire stick. Just wish it had you tube like chromcast. But other than that, I think it's way better. Love the remote control.", "verified": true, "helpfulness": "0/0", "author": "Jennifer C"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Audley"}, {"rating": 4.0, "review": "Good overall product but definitely needs to update the app to support files from the computer (like Chromecast). Aside from that, you are getting a great bang for your buck.", "verified": true, "helpfulness": "0/0", "author": "Jason Wong"}, {"rating": 4.0, "review": "Amazon continues to amaze me.", "verified": true, "helpfulness": "0/0", "author": "Jennifer W Cox"}, {"rating": 3.0, "review": "It works ok. The Netflix app buffers alot making watching a movie not as pleasurable.", "verified": true, "helpfulness": "0/0", "author": "keitra crooks"}, {"rating": 5.0, "review": "Great product, easy to use.I have & use Chromecast, Wii and other items... Fire Stick is easy and now loaded with even more cool access to multiple products.", "verified": true, "helpfulness": "0/0", "author": "Ellis Blevins"}, {"rating": 5.0, "review": "I love my fire stick. It's super fast on my flat screen and I have not had any issues with it. I am super thrilled by the portability of the device. I have taken it on my travels and used it in many different devices.", "verified": true, "helpfulness": "0/0", "author": "Noel A. Cruz \"Noel Ash\""}]