[{"rating": 5.0, "review": "It's so handy and awesome!", "verified": true, "helpfulness": "0/0", "author": "sunggu kim"}, {"rating": 4.0, "review": "the only think I don't like is that to get those channel you have to be subscribed", "verified": true, "helpfulness": "0/0", "author": "raffaella morris"}, {"rating": 4.0, "review": "Much easier to use than Google Stick.", "verified": true, "helpfulness": "0/0", "author": "Ronald Mackenzie"}, {"rating": 4.0, "review": "This would be an easy five stars if 1). you didn't have to side load a settings app to use a bluetooth mouse, 2). didn't have to root or sideload to get Google Play and other apps (Showbox HD, Popcorn, etc.).If you plan to just use it as stock, the stick is a basic WiFi viewer that brings some degree of Smart TV function to older sets. The UI asserts itself so you can't use alternate launchers without aforementioned sideloading and tweaking.For the price, it's quite a deal, especially if you don't mind getting your hands dirty with it. If you want storage and more flexibility though, you'll need to spring for a regular Fire TV model so you can use USB peripherals like flash drives/readers and wired keyboards.", "verified": true, "helpfulness": "0/0", "author": "Billzilla \"bz\""}, {"rating": 5.0, "review": "Awesome quality for only $40. It's nice to watch Netflix in HD. I was unable to do this through the Wii. There are lots of features that I haven't yet explored.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "could not have been easier to install and set up....very glad we went ahead and did this because we have netflicks on smart tv downstairs.", "verified": true, "helpfulness": "0/0", "author": "richard a plummer"}, {"rating": 2.0, "review": "I Brought A Fire Stick & Fire Tv But The Stick Is Constantly Goinh Out..", "verified": true, "helpfulness": "0/0", "author": "Alyssa Williams"}, {"rating": 5.0, "review": "AMAZING!!! FIRST I BOUGHT THE CHROMECAST AND HAD TO RETURN IT B/C I COULDN'T GET IT TO WORK W/ MY INTERNET. I WAS SKEPTICAL TO GET THE FIRE STICK FOR THE SAME REASON, BUT THIS THING IS GREAT! IT BASICALLY SET UP ITSELF! YOU DON'T NEED TO BE A TECHIE TO GET THIS TO WORK...IT WAS SOOO EASY. I'M PRETTY SURE A CHILD COULD DO IT! CAN'T STRESS ENOUGH HOW MUCH I LOVE THIS PRODUCT. BLOWS THE CHROMECAST OUT OF THE WATER!", "verified": true, "helpfulness": "0/0", "author": "MEGHAN"}, {"rating": 4.0, "review": "Gets hot and needs additional power cable. Other than that, the app offerings are nice. The interface is fairly simple. I like the fact that it keeps itself updated.", "verified": true, "helpfulness": "0/0", "author": "Aaron Chorpenning"}, {"rating": 5.0, "review": "Great product, easy to install and easy to use. Kids love it.", "verified": true, "helpfulness": "0/0", "author": "Donald Liptak"}]