[{"rating": 5.0, "review": "Took me awhile to figure out how it worked.  I am not computer smart.  I love it now that it is working great.  Use almost everyday .", "verified": true, "helpfulness": "1/1", "author": "Dorothy J. Pletzer"}, {"rating": 5.0, "review": "We have bought 3 of these!  We have one in the house, one in the shop, and made my daughter buy one when we were visiting, and couldn't get the 'Smart' TV to stream without interruption.We dropped several services from DirectTV, and  I use the Firestick and watch series like Grimm, StarGate, Warehouse 13 and so on while I work.Fast downloads, none of that slow internet connections errors we get while watching regular TV.Bought one for each TV that has an USB port.  (We still have one OLD TV that we can't use it on).", "verified": true, "helpfulness": "1/1", "author": "Betty"}, {"rating": 5.0, "review": "I use this on the tv at my school dorm and was worried by some other revues that it'd have problems with the wifi because my dorm's wifi is terrible and often won't even connect to phones and tablets. But this has worked great! I've had it a bit over a week and haven't had a single problem. Also had no trouble opening the remote, idk why people were struggling with that...", "verified": true, "helpfulness": "0/0", "author": "Micky"}, {"rating": 2.0, "review": "I ordered 2 of these and when my package came it only had 1 inside it. Not sure how to go about this...", "verified": true, "helpfulness": "0/2", "author": "Richard Beckett"}, {"rating": 5.0, "review": "I've had Roku and a Sony Blu Ray player with wi-fi but the Fire Stick has by far the best user interface.  I currently have 3 fire sticks for each of my TVs.", "verified": true, "helpfulness": "0/0", "author": "Nick D"}, {"rating": 5.0, "review": "Love it! We used to use Chromecast but were tired of not being able to stream Amazon. I bought this at a lightning sale and am pleased with the purchase. I know that now 'n' days we all use our phone and tablets to control our TV's. This has the beauty of having both! You have a control or you can download the app for when your husband looses the remote! I think the only thing I miss about Chromecast is the beautiful scenic pictures they had. They were amazing. But my husband is happy with his control and my kids can watch Dora/Diego. So you have one happy momma!", "verified": true, "helpfulness": "1/1", "author": "Happy Family = Happy Mom"}, {"rating": 5.0, "review": "LOVE THIS THING! EASY TO INSTALL... EASY TO USE... SO INEXPENSIVE! :):):):):):)", "verified": true, "helpfulness": "0/0", "author": "linda martino"}, {"rating": 5.0, "review": "I love this, not sure why I didnt buy this years ago.  replaced a chromecast on my main tv.  Side loaded kodi, works great.", "verified": true, "helpfulness": "0/0", "author": "Milton S. Soditch"}, {"rating": 5.0, "review": "Great device!What no one seems to mention is that the stick works like an antenna and needs to be visible. If you have it plugged in behind your tv, you will have streaming problems. Buy an HDMI extension cable so you can route it to sit above, below, or on the side of your tv. Wi-Fi signal has a hard time connecting if it has to penetrate through your tv.", "verified": true, "helpfulness": "1/1", "author": "S. VAU"}, {"rating": 5.0, "review": "I was fortunate enough to receive this using reward points from my job.  This is one of the best choices I could have made.  I watch just about everything on it and if you are going to buy one do yourself a favor and become a prime member.When I first bought it I thought that all I had to do was charge it and stick it into my tv but I watched a youtube video about it and realized that it needed to remain plugged in.  Once I had that part figured out the set up was easy.  The Fire TV stick basically walks you through everything you need to do.  Prior to this I was using my Wii to watch Netflix and Amazon Prime and it seemed to always freeze on me.  With this I do not have any freezing and the picture quality is also good.  I highly recommend buying one!", "verified": true, "helpfulness": "0/0", "author": "Crystal Kessling"}]