[{"rating": 5.0, "review": "The Fire TV Stick is a great asset for users of Amazon services.  Set up was quick and easy.  The only thing you have to do is enter the security code for your wireless network. Every thing else is automatic.  The remote is small, but unless you have huge hands that shouldn't be an issue.Streaming video:  Previously I have used a computer and Blu-Ray player.  The Stick is superior to both on speed, and easier to use than the Blu-Ray. The feature to start on the Fire tablet and switch to TV works quite well, though for me it's not likely to get much use.Music:  You can play your Amazon music on your TV.Apps:  I've only checked out a few of them but so far I'm impressed.  Crackle is one of the TV/movie channels that I love and viewing it with the Fire Stick is a snap. I've only scanned through the list, but there are other free channels that I'll be checking out.There are other features that will probably be of use to many.Update: 12/30/14After using the Fire TV Stick for a couple of weeks I've discovered that it isn't quite as great as at first glance. When using Amazon services it works fine.  But the apps aren't quite as good as I first thought.>  If I've listened to Music, then switch to Crackle the play/pause buttons control the music, not Crackle.  So the first time I attempt to pause the video, the video stops and music starts.  The video can not be restarted!  Which means I have to exit and restart it.  The only way to avoid this is to go to settings and do a \"Force Stop\" on the music app.>  Streaming on Crackle is iffy.  Sometimes it works fairly well, but most of the time there is excessive buffering. Sometimes 2 or 3 times per minute.  And at times it simple stops playing.  A couple of times when it got really bad I switched to my BluRay player or Kindle Fire HDX.  Both streamed without an issue.I haven't used the other apps much, so I can't say how wide spread this is.  But it appears the Fire Stick is optimized for Amazon and the other apps are just addons.I didn't lower my rating because it's still a good product.  But that was a close call.", "verified": true, "helpfulness": "0/0", "author": "Walt"}, {"rating": 5.0, "review": "works great love it it made my not so smart TV smart bought it on a preview sale got it fo a great price only with I could have 3 or 4  for Christmas gifts at the promo price", "verified": true, "helpfulness": "0/0", "author": "Trish"}, {"rating": 5.0, "review": "Okay, so if something unforeseen happens, I will update this review, as I have only been using the Fire TV Stick for about 20 minutes -- but that's how blown away by it I am, I had to stop what I was doing to check -- did I *really* only pay $20 for this??? Wow, I feel so lucky, because yes, I did. It took me less than 5 minutes to plug it in and set it up and the first movie I wanted to watch downloaded in less than 5 seconds -- and that's with my extremely crappy Internet connection (and a connection I fight with my dozens of neighbors for -- I thought that I might not be able to watch any streaming movies unless I was watching during WAY off-peak hours).So, for now anyway, I am deliriously happy. This is my first step towards breaking away from paying very high monthly fees for television that, while I admittedly love (especially the DVR function), I don't need -- especially once I can rent seasons via Amazon and Netflix. Thank you so much, Amazon!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Sarah \"Saire (reader, writer, editor, artist, geek, and MORE!)\""}, {"rating": 5.0, "review": "It's great. Everything I was hoping it would be. Cant wait for HBO GO.", "verified": true, "helpfulness": "0/0", "author": "Stephen McCann"}, {"rating": 5.0, "review": "Love it. I moved my ps3 to another room. This is a great replacement. The interface is great.  It is fast and picture quality is great. I will likely get another one for my daughter's room. I should have bought 2 when they were on sale.", "verified": true, "helpfulness": "0/0", "author": "sam"}, {"rating": 4.0, "review": "Works great with very good image quality.  Perfect for those sets that are not SMART.  Is worth it.", "verified": true, "helpfulness": "0/0", "author": "Michael O. Jagla"}, {"rating": 5.0, "review": "Wow, Fire stick is great. I just hooked it to myTV and it didn't take long at all. The choices and picture were great. Of course I was disappointed that you can't mirror with  my iPhone or iPad but this was really more than compensated by the new Sling app. I have a Slingbox 350 and can now watch my AT&T; Uverse anywhere in the world with my Fire stick.", "verified": true, "helpfulness": "0/0", "author": "canes580"}, {"rating": 4.0, "review": "I am having trouble with my bandwidth, but the product seems to work as described.", "verified": true, "helpfulness": "0/0", "author": "Paul D. Buffington \"Montanalovesongs\""}, {"rating": 4.0, "review": "It's great. It was super easy to hook up and the picture/reception is very clear. I've had no problems.", "verified": true, "helpfulness": "0/0", "author": "Jane Ehrhard"}, {"rating": 5.0, "review": "Easy setup and works great.  Love how it is set up.", "verified": true, "helpfulness": "0/0", "author": "utavsfan"}]