[{"rating": 4.0, "review": "Works so well!!! Wish it would let me mirror straight from my phone, though.", "verified": true, "helpfulness": "0/0", "author": "Hil F"}, {"rating": 5.0, "review": "I love the Fire Stick.  I had considered Apple TV because so many people were using it and when I found this product for such a good price I thought I would try it.  It meets all the needs I was looking for and it is so easy to go from TV toTV in different rooms.  However, because of the price I am going to purchase another one so I can have it on both televisions. The extra advantage is since I am a Prime member I have the options to watch the Amazon movies also!", "verified": true, "helpfulness": "0/0", "author": "Erin Hutchinson"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Alice Washington"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Khue Vang"}, {"rating": 3.0, "review": "If I purchase this device I will probably adjust my star rating on how my experience is with the Fire TV stick.I'm writing this review in hopes that Amazon will read it and consider my input.I would buy two of these in heartbeat if there were apps for the AMC and USA networks.  My two favorite shows are WWE Monday Night RAW and The Walking Dead.  It would be awesome to have access to current content for these networks.Thanks :)", "verified": false, "helpfulness": "0/0", "author": "Just Joe"}, {"rating": 5.0, "review": "A wonderful product again from Amazon. The Fire TV Stick is my (almost) Chromecast killer. I thought I'd love using my phone as a remote for the Chromecast, but it turns out having a dedicated remote like this is a better solution. If it allowed me to stream browser windows, I'd get rid of my Chromecast altogether!", "verified": true, "helpfulness": "0/0", "author": "Jefftimus Prime"}, {"rating": 4.0, "review": "I prefer this over my smart TV.  The only reason I give it 4 starts is I've had a couple instances where it seems to get too hot and start to skip frames regardless of what app I'm using.", "verified": true, "helpfulness": "0/0", "author": "Eddie"}, {"rating": 4.0, "review": "The only thing I don't like is There is no app for Vudu or Disney. I would purchase 2 more for my kids TV's once the apps are available until then we will stick with the Roku.", "verified": true, "helpfulness": "0/0", "author": "J. Macha \"Mom of 4\""}, {"rating": 5.0, "review": "I purchased an Amazon Fire TV Stick to compare against the Google Chrome Cast device.  Being an Amazon Prime user, I have to say that hands down, the Fire TV Stick is far superior.  Apps are easy to install and use (We use Netflix, Pandora, Sling TV, HBO Go, and PLEX primarily.)  The kids also play Crossy-Roads with no problem whatsoever.  Utilizing the smartphone App as a remote control is helpful as well.Pros:  Easy to install and set up.  Good remote control.  App installation and use.  Powerful processor.  Able to connect to 5g home network with ease.  Speedy and responsive.Cons:  Cannot customize home screen.  Would like to be able to set up a dashboard of Apps rather than simply the most recently used.Overall a good purchase.  So much so that I now have 4 separate devices, outfitted on all of our televisions in the house.", "verified": true, "helpfulness": "0/0", "author": "Destby"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Mark Hairston"}]