[{"rating": 4.0, "review": "So far, I m liking the ease of the device, moving in and out of apps swiftly is cool. My only real issue that has occur was the loading factor the spinning circle takes a bit of time .. sometime my device drop out. ...overall its easy to move from one TV to another", "verified": true, "helpfulness": "0/0", "author": "WAYNE"}, {"rating": 4.0, "review": "I bought it strictly to access youtube for music videos and concerts.  I downloaded the app for free and have been very pleased with the product, but I don't use any of the other apps.  Don't have time for movies or games.  It did not work on my HDMI3 port on the TV but worked fine on the HDMI2 port. Don't know why.  Setup was painless and all worked fine.", "verified": true, "helpfulness": "0/0", "author": "Evert Boer"}, {"rating": 4.0, "review": "if you're in the amazon eco system such as using kindles, kindle fire etc.  this is a low cost solution.  Does appear that Amazon is intentionally providing a higher quality prime video experience as other apps not amazon related tend to buffer when I know I have absolutely no other lag on my network and computers streaming not buffering at same time.  I then switch to an amazon prime video & buffering completely stops  I'm suspicious  however over a very good product for the price", "verified": true, "helpfulness": "0/0", "author": "RonPaulrocks"}, {"rating": 5.0, "review": "Love being able to watch my Netflix shows on the TV instead of my ipad", "verified": true, "helpfulness": "1/1", "author": "Susan Campbell"}, {"rating": 4.0, "review": "The FIRE TV Stick is a nice compliment to our TV.", "verified": true, "helpfulness": "0/0", "author": "TD LINDSEY"}, {"rating": 5.0, "review": "Very sleek. Great performance. I'm not a big TV guy but man I use this a lot.", "verified": true, "helpfulness": "0/0", "author": "Mootube"}, {"rating": 5.0, "review": "so far so good. love the music.", "verified": true, "helpfulness": "0/0", "author": "michael"}, {"rating": 2.0, "review": "its convient in size and easily portable, but even within 25 feet of wireless router, it freezes/buffers a lot.  Would have been nice if it didn't have to be ac power, and could have been powered through cdmi...", "verified": true, "helpfulness": "0/1", "author": "Frederick 3."}, {"rating": 4.0, "review": "easy setup, fast connection.  layout of apps could be better.", "verified": true, "helpfulness": "0/0", "author": "jad"}, {"rating": 5.0, "review": "My Daughter Bought me a Fire Stick for Christmas. I have a surround sound system so I purchased a 6'-Male/Female HDMI cable to plug the fire-stick into, The Picture is Great...All the Features are Great and,......... It's Plugged into my system instead of the TV so the Sound is Great also.  Being a Amazon Prime Member has a whole new meaning now, Thank you Amazon This is awesome.And just a little tidbit to close-A Netflix account is a great add-on for the Stick.", "verified": true, "helpfulness": "0/0", "author": "J. Coleman"}]