[{"rating": 4.0, "review": "For home use this works great, simple to use and set up.  Do not buy this for college use or anywhere there is a two step authentication process - i.e., you have to log onto the internet.  The Fire Stick only allows for a password entry - not user name and password as Dorms and most hotels do.", "verified": true, "helpfulness": "0/0", "author": "VBS"}, {"rating": 4.0, "review": "The stick works fine but the selection sucks even with prime. Still gotta pay for most of the content", "verified": true, "helpfulness": "0/0", "author": "p1kA"}, {"rating": 5.0, "review": "It was better than I had imagined. Ordered another right away for another room. I have smart tv's and DVD players, this blows it away.", "verified": true, "helpfulness": "0/0", "author": "Ron Linn"}, {"rating": 5.0, "review": "It's Great.", "verified": true, "helpfulness": "0/0", "author": "Gary M"}, {"rating": 1.0, "review": "advertising didn't say that you have to pay to see any videos or moviesvery disappointed", "verified": true, "helpfulness": "0/0", "author": "victor acevedo"}, {"rating": 3.0, "review": "I am a Amazon Prime member and It works good and is responsive but the remote is small and smooth and slips right our of my fingers.Also the text and graphics in the  menus should be bigger and bolder.In general a larger problem with amazon is the pin system ... you should never have to enter a pin on a free purchase\\it is highly annoying and stupid ... period.  True StoryI don't want to submit a photo of the text and graphics smallness on the fire stick but compared to the roku I have you would notice a big diference", "verified": true, "helpfulness": "0/0", "author": "luckyscmuk"}, {"rating": 1.0, "review": "The first two weeks this prodect worked great, now it keeps pausing to buffer and tells me my 60mbs network is too slow. No physical reset button, so now I'm stuck with a useless piece of s***. At least my old Vudu box would download the shows for later viewing. Streaming through a disabled device SUCKS!", "verified": true, "helpfulness": "0/0", "author": "michael h buchanan"}, {"rating": 5.0, "review": "Excellent and I'm getting my family to drop cable", "verified": false, "helpfulness": "0/0", "author": "Ahmad Watkins"}, {"rating": 5.0, "review": "I'll never buy a DVD again! Streaming Amazon Prime is the best!", "verified": true, "helpfulness": "0/0", "author": "D. Tepe"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "KD"}]