[{"rating": 2.0, "review": "just got mine in the mail,im super excited to try it out! Kinda sad i wasnt able to get it at the price that some of u got it at($19) but never the less i think im going to LOVE it:)wll rate again later after i use.......", "verified": false, "helpfulness": "0/1", "author": "Deadra"}, {"rating": 1.0, "review": "I had high hopes during setup, but it couldn't access more than 5 seconds of a program.  It blamed the speed of my computer, which doesn't seem to be a problem when I run Netflix through my blu-ray player.  So maybe order the box and see if it will be able to do a better job finding my computer signal.  But I will probably just skip it and wait to buy a TV that has Amazon capability.", "verified": true, "helpfulness": "0/0", "author": "James D. Taylor"}, {"rating": 4.0, "review": "Watch Out Apple TV! :)", "verified": true, "helpfulness": "0/0", "author": "Rudy Young"}, {"rating": 5.0, "review": "Absolutely the best thing ever", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "it works good with a goodinternet connection", "verified": true, "helpfulness": "0/0", "author": "william mcdowell"}, {"rating": 4.0, "review": "it should be easier to navigate", "verified": true, "helpfulness": "0/0", "author": "Tina Kephart"}, {"rating": 5.0, "review": "Super easy set up.  Easy to use and navigate.  Loving it!", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 4.0, "review": "it actually works really well. Enjoy it a lot", "verified": true, "helpfulness": "0/0", "author": "SC"}, {"rating": 5.0, "review": "IT WORKS GREAT ON MY TV IN MY ROOM . I ALSO HAVE FIRE TV IN MY LIVING ROOM . IAM VERY HAPPY WITH BOTH.", "verified": true, "helpfulness": "0/0", "author": "carolyn williams"}, {"rating": 4.0, "review": "I really like the fire stick. It's responsiveness is amazing. I have a smart TV but the software on in is not up to par. To have a smart TV and still choose the fire stick tells you a lot about the work that's been put in to making this item. It's even easy for my 4 year old to maneuver and you don't have this gigantic control with a thousand buttons that he wouldn't be able to use.", "verified": true, "helpfulness": "0/0", "author": "Rafael Barba"}]