[{"rating": 5.0, "review": "I love this!! Especially during the summer when there is nothing on TV, I can always find something on Amazon prime, Netflix, etc.", "verified": true, "helpfulness": "0/0", "author": "jenperers \"Jennifer Perers\""}, {"rating": 5.0, "review": "It is wonderful, works great and enjoying very much. thanks Paul.", "verified": true, "helpfulness": "0/0", "author": "paul lohmann"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was easy to install, extremely portable, and  has performed wonderfully.  I not only recommend it, I will be buying another to place upstairs.", "verified": true, "helpfulness": "0/0", "author": "B. Ulbricht"}, {"rating": 5.0, "review": "I bought this as a gift (I own the Fire box and I love it).  My older parents love it. My 87-year-old mom can't figure out how to use it, but she can't remember how to use a cell phone, either.  Despite that, the stick (and the box) are exceptionally easy to use.  Plug the Fire stick (or cable in the case of the box) into the HDMI slot on your TV or computer.  Hit the home icon on the slim, lightweight remote and you're off to the races.  As a Prime member (if you are not a Prime member, the shows and movies are not free), you can stream soooo many shows and movies for free, including stuff from the premium cable stations like HBO, Showtime and the like. The remote also has a voice-activated feature, which makes it even easier to navigate.  Exceptional value for the price for Prime members.  (Prime membership is also an exceptional value, but that's a different review.)", "verified": true, "helpfulness": "0/0", "author": "anniekatz \"booksRus\""}, {"rating": 2.0, "review": "Have had a lot of difficulty with loading of programs and games.", "verified": true, "helpfulness": "0/0", "author": "Michael Snow"}, {"rating": 5.0, "review": "GOOD DEAL", "verified": true, "helpfulness": "0/0", "author": "Mike S."}, {"rating": 5.0, "review": "Very easy to use and set up, well worth it if you are a prime member", "verified": true, "helpfulness": "0/0", "author": "WILLIAM H WHITSETT"}, {"rating": 3.0, "review": "Quality of product is good.  The picture quality is good over the WiFi.I don't care for the list of free movies that are available", "verified": true, "helpfulness": "0/0", "author": "Robert Miller"}, {"rating": 5.0, "review": "Easy to set up, works incredibly well and fast with no delays in commands from the remote. The remote is small and simple to use but with great functionality. The on screen menus and interface are clean and intuitive with nice categorization. I have a PLEX server in my home and this interface is near identical to the one on the PC, easy to use and very responsive. I was  former Chromecast user and this product is miles better and well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Albert Gunnarson"}, {"rating": 3.0, "review": "I have not yet been able to use this to the extent I had anticipated. I kept getting error messages that I had \"low bandwidth.\" I finally called my provider and learned that I need to upgrade my router to a dual bandwidth model. Of course they wanted to sell me their model. I'll be shopping for one on Amazon, but I wish I had known I needed to do this before ordering the Fire TV Stick. Obviously I'm not up to date on technology the way some of your reviewers are; if I were, I probably would have paid more attention to requirements. I do appreciate the reviews from others who know a lot more than I do about these things!", "verified": true, "helpfulness": "1/1", "author": "Marty G."}]