[{"rating": 2.0, "review": "I have not been able to get it to work", "verified": true, "helpfulness": "1/1", "author": "Carolyn Hines"}, {"rating": 5.0, "review": "I really love the Fire Stick especially since I am the prime membership.  It has allowed me to see some great movies and to catch up on some tv shows I have been wanting to watch.", "verified": true, "helpfulness": "0/1", "author": "Lisa Buie"}, {"rating": 4.0, "review": "This is great! We watch a lot of Amazon Prime TV and Netflix. Sometimes the Netflix app acts up, but I'm not sure if it's from the actual firetv stick, Netflix itself, or our connection. I will leave more feedback as we get better acquainted with it", "verified": true, "helpfulness": "0/0", "author": "Megan Howard"}, {"rating": 4.0, "review": "Easy to use, works great", "verified": true, "helpfulness": "0/0", "author": "Jimmy Marquez \"ThresherJim\""}, {"rating": 5.0, "review": "Love this!!!", "verified": true, "helpfulness": "0/1", "author": "KW00D5"}, {"rating": 3.0, "review": "Pros: good app offering, fast software response (menus and the like feel snappy), it's cheap.Cons: Drops the network, stutters (even with streaming content across your local network (plex)), some problems require a restart (this process involves getting behind your tv and unplugging the power connection to your fire tv stick, there is no \"restart\" menu option).I've spent a lot of time trying to troubleshoot my network, which performs very well with everything else, including devices much farther away, and behind many more obstructions. I'm now going to attempt a troubleshooting step that i found online, which is to put it in the hdmi extension provided (around 2 inch extension). If this does solve my problem, i'll provide an update, but this is not something that a device like this should have as a requirement to work.", "verified": true, "helpfulness": "1/1", "author": "M. Moats \"IT Professional, Musician.\""}, {"rating": 5.0, "review": "I love it! Saved me from having to buy a smart tv.", "verified": true, "helpfulness": "0/1", "author": "Julie hawkins"}, {"rating": 5.0, "review": "It's great!!! Did everything I expected and more", "verified": true, "helpfulness": "0/1", "author": "James Parker"}, {"rating": 5.0, "review": "I received this on Christmas. Best present ever. Easy to use and easy to hook up", "verified": true, "helpfulness": "0/1", "author": "Amanda"}, {"rating": 5.0, "review": "Easy setup, easy to use. Totally awesome.", "verified": true, "helpfulness": "0/1", "author": "Michael OGrady"}]