[{"rating": 5.0, "review": "I bought this for a friend and so far, she absolutely loves it. Great buy on prime day!", "verified": true, "helpfulness": "0/1", "author": "Tammy Monette"}, {"rating": 4.0, "review": "Es good but have a lot of trouble.", "verified": true, "helpfulness": "0/1", "author": "maria escobar"}, {"rating": 3.0, "review": "I own both this, and a Roku.  One thing that disappoints me about the Fire Stick is that the wireless reception doesn't seem as good as the Roku.  The Roku is placed further away to my router in my home yet it doesn't seem to have nearly as many streaming interruptions as the Fire Stick.  I also tend to find the user interface more intuitive with the Roku than the Fire Stick.", "verified": true, "helpfulness": "2/3", "author": "seattlelite"}, {"rating": 5.0, "review": "This is great, replaced my Apple TV!", "verified": true, "helpfulness": "1/2", "author": "Todd Gold"}, {"rating": 5.0, "review": "Works just as stated and we love it.", "verified": true, "helpfulness": "0/1", "author": "susier"}, {"rating": 5.0, "review": "This is so great, even I was able to install this with no trouble!", "verified": true, "helpfulness": "1/1", "author": "Debra L."}, {"rating": 3.0, "review": "I have two of these sticks. I like them, I like the interface etc. But, they both stutter a lot. I have 150mpbs download & 10mpbs upload internet and both sticks are within 20 feet of the router. Youtube & wwe network struggle to stream programs, both audio and video. I don't get it. My Roku stick has 0 problems streaming anything. Anyone else have this problem?", "verified": true, "helpfulness": "1/2", "author": "Brett Black"}, {"rating": 5.0, "review": "Bought this for my Son and Grandchildren. They love it. It is such a great value with all the free shows they can choose from, as well as good movies.", "verified": true, "helpfulness": "1/2", "author": "Sweetie"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Jeremy"}, {"rating": 5.0, "review": "Works well and the graphics are better then I expected.", "verified": true, "helpfulness": "1/1", "author": "Charles H Egbert"}]