[{"rating": 4.0, "review": "Product operates like it says.  I'm unhappy with Hulu plus.  Don't have CBS.", "verified": true, "helpfulness": "0/0", "author": "Robert Dragisic"}, {"rating": 5.0, "review": "Exceeded expectations! I tried two Roku sticks which just didn't work in the location for the TV. Chrome cast did not work reliably either. Amazon's stick worked great...probably because of its speed, storage and ability to find my WiFi signal much quicker. In any case, I would vote for Amazon's stick over any other. When it comes time to replace the Roku box, I will buy an Amazon Fire unit. Typical fast delivery and support from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Craig S. Olson"}, {"rating": 5.0, "review": "So cool, so easy, so right!", "verified": true, "helpfulness": "0/0", "author": "charlie seraphin"}, {"rating": 5.0, "review": "The important thing is this loads movies fast. Great item", "verified": true, "helpfulness": "0/0", "author": "Mike Scalgione"}, {"rating": 5.0, "review": "This was everything I expected it to be! And even with our pathetic little router, it still rarely has an issue with streaming. The only thing I would say was a surprise (as they do not show it in the commercials or advertisements) is that you still have to plug it into a power source. Thankfully it is small though, so it doesn't add too much mess around the TV. Definitely worth it, especially if you are a Prime member.", "verified": true, "helpfulness": "0/0", "author": "KaeleighBee"}, {"rating": 5.0, "review": "It's great! Been accessing via Xbox one but the fire stick interface is much simpler to use.", "verified": true, "helpfulness": "0/0", "author": "david tibbals"}, {"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "crk"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Holly"}, {"rating": 3.0, "review": "it worked fine for 30 days now i can't get on internet", "verified": true, "helpfulness": "0/0", "author": "Timothy Harkness"}, {"rating": 5.0, "review": "GREAT", "verified": true, "helpfulness": "0/0", "author": "bobby godfrey"}]