[{"rating": 5.0, "review": "I previously had Chromecast but was unable to get Amazon on it, so I purchased this and it works great! I live the voice search feature, makes it very easy to find what you are looking for! Very happy so far!", "verified": true, "helpfulness": "0/0", "author": "Chrisanne Morris"}, {"rating": 1.0, "review": "Haven't found the stick to increase my TV viewing experience at all.  It appears to be a sales enhancement gimmick for Amazon Plus & other products.", "verified": true, "helpfulness": "1/1", "author": "betty koby"}, {"rating": 5.0, "review": "Love it! Very easy to set up. Have enjoyed all sort of tv shows and movies since I purchased it!", "verified": true, "helpfulness": "0/0", "author": "Donna Scarberry"}, {"rating": 5.0, "review": "Great device! Use it all the time!", "verified": true, "helpfulness": "0/0", "author": "Tyler Pollard"}, {"rating": 5.0, "review": "This was replacement sent ASAP since Amazon sold out, of one of the two Fire sticks that I purchased, they are all running fine and much faster than dealing with the Smart TV apps or the Blu-ray apps.Since then I also purchased the FIre TV for the living room, very happy with the whole setup, none of the grown kids at home have played with games but they are enjoying the system.Oh, I purchased a 7\" Fire HDX and work it with the fie TV as well.", "verified": true, "helpfulness": "0/0", "author": "Lisandro E. Roque"}, {"rating": 4.0, "review": "Just set it up three days ago and so far I had to reboot it once, it stopped down loading and had to rebootand it started back up. So far my wife and I like it.", "verified": true, "helpfulness": "0/0", "author": "Daniel Oriero"}, {"rating": 2.0, "review": "I bought this thing thinking it was completely wireless and when I got it the stick needs to be plugged in the concept is cool but the function is stupid.", "verified": true, "helpfulness": "0/1", "author": "folarin odumbo"}, {"rating": 4.0, "review": "Works well, movies stream in HD with no problem on WIFI. Easy setup.Would be nice if Youtube was included.", "verified": true, "helpfulness": "0/0", "author": "PETER LASCARIDES"}, {"rating": 4.0, "review": "Not bad. It's easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "G K Baker"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Myumi Whiteside"}]