[{"rating": 5.0, "review": "I am not very good with audio visual stuff but the Fire Stick was easy to set up.  It connects much faster than my Blu-ray in another room.  It replaced another blu-ray that just wouldn't connect well in my bedroom.  It connects to wi-fi quickly, loads Netflix and Prime quickly which are the two I use, and is a lot less visable than the blu-ray box I had.The remote is easy to use.  It doesn't have a lot of confusing buttons for me.  I have some arthritis in my hands and it is easy to navigate with it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Mary\""}, {"rating": 5.0, "review": "I love it!!! So versatile. If you don't get one your crazy.", "verified": true, "helpfulness": "0/0", "author": "Efrain Garzaro Jr"}, {"rating": 5.0, "review": "i LOVE my fire stick! beware though...if you work at home like i do...you will watch FAR too much tv and not do as much work. not for the undisciplined folks such as myself...lol. but i really do love this", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"fezgirl\""}, {"rating": 5.0, "review": "my son loves it", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 4.0, "review": "Works ok", "verified": true, "helpfulness": "0/0", "author": "Michael Spruill"}, {"rating": 5.0, "review": "Great experience overall. Sometimes it cuts out or freezes but that is on the slingtv app so I'm not entirely convinced it's the firestick.", "verified": true, "helpfulness": "0/0", "author": "Damon Goodson"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "A. Roberts"}, {"rating": 5.0, "review": "Easy to install, easy to use.  What an investment!  Buy one!!", "verified": true, "helpfulness": "0/0", "author": "Kevin Hitchcock"}, {"rating": 5.0, "review": "The fire TV Stick works great not only with Amazon Prime but also with Netflix. I also have my personal photos for a screensaver. The remote control that comes with the Fire Stick makes browsing for movies and shows a breeze. I would highly recommend this device.", "verified": true, "helpfulness": "0/0", "author": "Karen Wilbur"}, {"rating": 1.0, "review": "If you use charter and wanted this for HBO, don't bother.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}]