[{"rating": 5.0, "review": "I can't speak for people who would have this far from their WiFi source, but we have a slower internet speed offering from our provider and the Fire Stick still always provides top quality HD and fast performance when firing up (pun intended) videos. If you don't want to be ingratiated in the Amazon world I might have to recommend the additional channels and less favoritism to apps that the Roku stick offers (I bought Roku for my parents since Fire Stick was on back order) and the Fire stick does seem faster, but always opening in Amazon videos can be annoying sometimes. I had to give up prime due to my budget and Netflix was the new alternative so the extra steps to access other apps is the only discouraging thing about this product.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 2.0, "review": "When it is not constantly dropping the network connection, it seems like a nice device, but it can't even get through a half hour show without losing the connection several times. We have a new, good quality router, and none of our other devices have this problem, including our roku that is several years old. Returning and getting a new Roku.", "verified": true, "helpfulness": "2/2", "author": "M. Jorgensen"}, {"rating": 5.0, "review": "Perfect !", "verified": true, "helpfulness": "0/0", "author": "Funair"}, {"rating": 5.0, "review": "I love the Fire TV Stick. I would say that it has advantages compared to the Google ChromeCast. I own both of them and they provided different advantages. In terms of the Fire TV Stick, it has a simple interface with access to the apps I use often, Netflix, Prime Video/Music, Pandora, TuneIn Radio and others. I love the fact that there is an iOS App to control the interface because it unlocks the Voice search.The Fire TV Stick streams without delays or problems.", "verified": true, "helpfulness": "0/0", "author": "Sergio Caballero"}, {"rating": 5.0, "review": "Since we decided to ditch expensive cable tv, we did need additional viewing choices, so, I purchased two of these for my husband an me, and I love them!!!  My husband isn't computer literate but he is doing great with them.  It truly is the answer to our quest to lower cable costs while having a viewing choice.  One suggestion, make sure you use the extension included in the box..I called tech support because the stick wasn't recognizing my internet connection,and they said you need to use the extension-type cord in order to move the firestick further away from the HDMI port because it gets too hot if direct connected and won't pick up a wifi signal.  And, you do need to plug into the wall or power strip NOT into your TV port...as some people are showing on YouTube.  You will really like this set up!  I'm going to order the voice activated remote here shortly, just to make the navigation even easier.  Happy viewing!!", "verified": true, "helpfulness": "0/0", "author": "Glenna J. Judd \"GJJ\""}, {"rating": 4.0, "review": "it seems like the roku has more movie options, but this still has plenty to choose from and has a lot of games...def worth the price.", "verified": true, "helpfulness": "0/0", "author": "Mstar"}, {"rating": 5.0, "review": "So much faster than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Mr. A \"Just a regular consumer\""}, {"rating": 5.0, "review": "I love the fire stick I can watch what I want when I want even movies in theater's", "verified": true, "helpfulness": "0/0", "author": "queacha watkins"}, {"rating": 4.0, "review": "So far I love this as much as my apple TV and my chromecast", "verified": true, "helpfulness": "0/0", "author": "Elton Tabon"}, {"rating": 5.0, "review": "I love this. I ordered it when it was cheaper for Prime members (for like two days), and for $19 it is a true bargain. It's a bargain for the regular price of $39!!!!! We are considering breaking the cable bond and going without, and this helps our cause. We watch a lot of things streaming, with little time for a regular t.v. schedule. This is perfect.We do also have the Fire TV, and this is pretty much the same thing. No voice search (I don't know if the remote is compatible), but you can still play games with it (we are not a gamer family, with two girls, but the games available on both are fun and fine for us). With the Fire Stick, we are set. We will probably be getting another one her soon.", "verified": true, "helpfulness": "0/0", "author": "Constantly Reading Momma"}]