[{"rating": 5.0, "review": "A little slow to load sometimes but we really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Mary Baxter"}, {"rating": 3.0, "review": "Really limited in the number of available resources...HULU plus, netflix,  amazon prime and videos..heart radio and some children's programming.  I try to control the stick with my fire and it won't recognize the fire much of the time.  I have to exit a program and re-enter.  The remote is simple..too simple....using the keyboard with the remote is a nightmare of mistakes and repitition.  It isn't ROKU for sure and doesn't begin to compete with my smart tv....but the price is right and the stick has some limited use on my bedtime tv.  I'm unsure at this point if I would have ordered it had I known it's deficits.  It definitely isn't up to the standard of  Amazon's other fire devices.", "verified": true, "helpfulness": "0/0", "author": "montanamarge"}, {"rating": 4.0, "review": "This is a great device.  You do need an electric plug in close by.  Some interesting features.", "verified": false, "helpfulness": "0/0", "author": "orsay \"d'orsay\""}, {"rating": 5.0, "review": "Great addition to my Amazon family of products!", "verified": true, "helpfulness": "0/0", "author": "DENNIS M CHRISTINA"}, {"rating": 5.0, "review": "It works well. Wanted to use it to play fibbage when people come over and it is fast and responsive. Haven't figured everything out but for the price you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "John Coe"}, {"rating": 5.0, "review": "My brother gave me this for Christmas, and we are really enjoying it. My husband, an electronics engineer plugged it in and had it installed in a few minutes. So far we haven't bought any monthly memberships from other companies yet because Amazon Prime gives us most of the selection of movies that we want. We already had Amazon Prime but couldn't watch movies or TV series because we needed a better receiver than my laptop. It has enabled me to go back and watch other series that we couldn't get because we don't subscribe to prime channels like HBO and Showtime. After we've exhausted these, then we may consider some subscriptions like Hulu.", "verified": true, "helpfulness": "0/0", "author": "Miz Bejabbers"}, {"rating": 3.0, "review": "+Interface is nice and slick, moves a lot faster than my aging Roku 2 HD.+Pulls up all my shows and purchases without having to dig through menus+Sits nice and pretty behind my TV, I don't even see the cable for it.-Drops WIFI signal CONSTANTLY. Signal isn't an issue, as my house is a modest size and the router is no more than 20ft away with very thin walls.~Has locked up and had some general crashes/glitches in between marathoning shows, could be issues independent of the device itself though", "verified": true, "helpfulness": "0/0", "author": "Thetolsonator"}, {"rating": 5.0, "review": "I love the firestick, I have a smart TV but it was such a pain to  use, the firestick allows me to watch Netflix and Prime instant videos with little effort. It's extremely easy to use and set up. I just ordered another and had it shipped to my parents.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this product.", "verified": true, "helpfulness": "0/0", "author": "Marcio Costa"}, {"rating": 5.0, "review": "Love my fire tv stick  very easy set up picture quality goodPrice was right", "verified": true, "helpfulness": "0/0", "author": "Rose Marie Kauffman"}]