[{"rating": 1.0, "review": "Had horrible connection issues. My router was 10 feet away. Also, if you want the stick to work at all you need to use the additional power adapter, which is misleading because all the commercials make it look like you can just plug it into your HDMI port. That's not the case. If you need to use the additional power adapter you might as well buy the Amazon Fire TV.", "verified": false, "helpfulness": "1/2", "author": "Hrag Kalebjian"}, {"rating": 5.0, "review": "Put away your google chrome and it's poor reception.  The intuitive remote, the signal strength and all of it making watching Netflix or prime so much better.  I have to say that this truly is a game changer and I love the small remote.", "verified": true, "helpfulness": "0/0", "author": "Atomeatball"}, {"rating": 4.0, "review": "I know lots of folks who have this and love it.  Not sure what is up with mine but it has a buzzing noise on pause and doesn't stream as fast as my old Roku.  But it does allow for closed captioning which my old Roku did not.", "verified": true, "helpfulness": "0/0", "author": "Jan Freeman"}, {"rating": 4.0, "review": "Seems to work fine.", "verified": true, "helpfulness": "0/0", "author": "Philip Truong"}, {"rating": 3.0, "review": "Works great, but not happy you need to plug it in to an outlet", "verified": true, "helpfulness": "0/0", "author": "david k brandman"}, {"rating": 5.0, "review": "Amazing product for the price!", "verified": true, "helpfulness": "0/0", "author": "D. Balog"}, {"rating": 5.0, "review": "So far in enjoying every bit of it.", "verified": true, "helpfulness": "0/0", "author": "Tuan"}, {"rating": 5.0, "review": "Amazing little device. Easy to install. Plug and play by sticking the device into an available HDMI port. Great picture and sound. Setup is a breeze.Requires external power though. The device will pester you to use the included  USB power adapter (so it can download your shows preemptively) but I prefer drawing the external power from the USB port on my TV, to save on valuable power outlets around my TV center. So I run the micro USB cord from the device into the neighboring USB port.The remote feels somewhat cheap and the click wheel is noisy. This may fade as the remote is \"broke in\".Overall, 5/5.", "verified": false, "helpfulness": "0/0", "author": "A. Deskins \"WVBullrider\""}, {"rating": 5.0, "review": "Works great. Lots of fun apps. Even better with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Jess_Rooney"}, {"rating": 5.0, "review": "Great little device I like it better than my chromecast. I'm Just waiting for the app to be available for my iPhone", "verified": true, "helpfulness": "0/0", "author": "Johnny Yau"}]