[{"rating": 5.0, "review": "I LOVE it!!!!", "verified": true, "helpfulness": "0/0", "author": "Michael Kramer"}, {"rating": 5.0, "review": "Excellent. Easy. Cheap. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Frederic Bruno"}, {"rating": 4.0, "review": "The only reason I reduced this is because of the setup instructions; otherwise, I'm very pleased with it and it is now meeting and exceeding all expectations. Specifically, the setup instruction glosses over the \"connect to the internet\" step merely saying to do it, without any other guidance. It actually is ultimately straight forward when you otherwise know what you're doing, but in my case I had to go back and review computer and router procedures. Then, initially it didn't connect until I disconnected and reconnected the stick from the TV, and removed the extender cord. The setup then commenced and successfully completed. At that point I reconnected the extender and it worked fine. One other small setup point is with the remote. I initially laughed at a reviewer's question as to how you get into the remote to insert the batteries, until I tried it myself! The latch is so stiff that I was afraid to force it, thinking that I was doing it wrong and might break it. I finally pulled up an instructional video which showed two alternative finger placements for maximum pressure to unlatch the cover.Once, I lost the connection during a movie, saying I had low bandwidth. It had kept interrupting and buffering until it finally disconnected from Amazon. That may have resulted from high cable demand usage from others on our feed. My download speed was still high, but my router signal only showed \"good\". Normally, it shows \"very good\" at best because of  TV vs. router locations. It ultimately corrected itself when I later continued the movie and has since not been a problem. That was two days ago.I'm still becoming familiar with this device, but am just amazed at its power and capability, especially given its size!", "verified": true, "helpfulness": "0/0", "author": "NWreturn"}, {"rating": 4.0, "review": "First stick is great!", "verified": true, "helpfulness": "0/0", "author": "Kathy Carroll"}, {"rating": 3.0, "review": "I really love my Amazon Fire Stick, but I wish there were more apps that were included with the system. I own a Roku system, actually 3 Roku systems, and I can say that Roku definitely has the Amazon Fire Stick beat, with its number of applications, interface set up, and overall appearance. But that's not to say that the Fire stick is a complete dud. The price is a bit cheaper than Roku, so there is the silver lining...", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 5.0, "review": "Exceeded expectations! Easy to install and able to start using immediately. It's great!!!!", "verified": true, "helpfulness": "0/0", "author": "bullet"}, {"rating": 5.0, "review": "completely replaced our satellite tv.  saving money and it's all we need.  love it!!", "verified": true, "helpfulness": "0/0", "author": "Nancy Remling"}, {"rating": 5.0, "review": "Love the Fire Stick has Netflix, and now Sling TV. Easy to use remote", "verified": true, "helpfulness": "0/0", "author": "Chris B."}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Boo"}, {"rating": 5.0, "review": "Love it...as I am technology challenged am still learning all the possibilities but have pretty well mastered Amazon Prime offerings which are just up my alley.", "verified": true, "helpfulness": "0/0", "author": "robbins"}]