[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Jammie Tate"}, {"rating": 5.0, "review": "this is a great little device will turn your dumb TV into a smart TV. Has more apps than any other device of its kind, it's small and easy to use. The setup took less than 3 minutes. I would recommend this to friends and family", "verified": true, "helpfulness": "0/0", "author": "Charleneperez"}, {"rating": 4.0, "review": "This thing is pretty cool.  I have it plugged into an Onkyo receiver, which is connected to a projector. I'm happy that worked well. It was so easy to get it going. I think it took almost 5 minutes to set up & I'm sure that was because my internet is slow. At any rate, I can finally play my music in the living room. I do wish it would play ALL of my music, as opposed to the same 15 albums.The Amazon mobile app to use as a remote is...unimpressive. But I'm finding that using my phone with other apps is pretty cool. Not sure they should tout the games. Most of them cost money and none of those are actually worth playing with the remote.This thing has made my Blu-Ray player obsolete. I only use that for the apps and this has all the same apps that I use. My Xbox is only going to be play games again.", "verified": true, "helpfulness": "0/0", "author": "Anika Malone \"Anika Malone\""}, {"rating": 4.0, "review": "Fast. There is possibility to sideload apps. It will be nice to have ability to connect BT devices: keyboard, mouse.", "verified": false, "helpfulness": "0/1", "author": "Andy Lyakhovetskiy"}, {"rating": 5.0, "review": "😆", "verified": true, "helpfulness": "0/0", "author": "Paul freytes"}, {"rating": 1.0, "review": "I didnt like it the only thing I like was the remote control .", "verified": true, "helpfulness": "0/2", "author": "crystal digna soto"}, {"rating": 5.0, "review": "So easy to install and use.  Love portability for travel.  Simple to access materials.", "verified": true, "helpfulness": "0/0", "author": "PhantomDrill"}, {"rating": 3.0, "review": "It works ok", "verified": true, "helpfulness": "0/0", "author": "Jijun Lin"}, {"rating": 1.0, "review": "TERRIBLE. Makes a terrible buzzing noise and skips. I apparently got a defective one and they are sending me a new one but lets see how that works out..... Everything else with amazon has been a pain so we shall see.", "verified": true, "helpfulness": "0/0", "author": "vcarp129"}, {"rating": 5.0, "review": "Love the Fire Stick.  Super easy to use, quick and easy.", "verified": true, "helpfulness": "0/0", "author": "Rochelle Aguiar \"Rochelle\""}]