[{"rating": 5.0, "review": "I like everything about this device but what puts it over the top is the ability to log into those bizarre hotel web portals (where you have to go to a web page and agree to terms of service or enter your room number).  No other similar devices can use this type of wi-fi but Amazon cracked the code.  I tried it at two different motels this weekend and it worked perfectly at both - a web page-type screen pops up on the tv and you can enter the information using the remote.  This device is going with me every time I travel.", "verified": true, "helpfulness": "0/0", "author": "dssonic"}, {"rating": 3.0, "review": "Can't get apps to work like Acorn TV. Seems to take more WiFi capacity on some apps like MLB tv. Tried to get the TV to play from tablet or phone and it doesn't seem to work consistently.", "verified": true, "helpfulness": "0/0", "author": "dan sherwood"}, {"rating": 5.0, "review": "Totally worth the money . Especially if you have Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Rachel Beeman"}, {"rating": 4.0, "review": "My internet connection is sometimes slow but other than that the stick works great!", "verified": true, "helpfulness": "0/0", "author": "Gryjeep"}, {"rating": 3.0, "review": "I was constantly having wifi lag issues and buffering with this.  When I would switch it out with my Fire TV, the lag & buffering would stop.", "verified": true, "helpfulness": "0/0", "author": "Milton Blanchard"}, {"rating": 5.0, "review": "Very good, just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Fred G. Putvain"}, {"rating": 5.0, "review": "Perfect and great product. Impossible to make it better. Please add the app for the iPhone AppStore.", "verified": true, "helpfulness": "0/0", "author": "Javier Mattera \"Javier Mattera\""}, {"rating": 5.0, "review": "Took a little getting used to, but we enjoy it. Haven't used it on my laptop yet.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Bauerle"}, {"rating": 4.0, "review": "Solid offering to get streaming services in the spare room. It occasionally will stutter but that depends on how long it's been up since a restart and also the service I'm streaming. Extremely responsive to commands using the remote, quicker to navigate than anything I've used before. The content options are great if you have a Prime membership but that's not required which is pretty cool. If you could adjust volume from the remote this would be just about perfect.", "verified": true, "helpfulness": "0/0", "author": "B. Higgins \"bhiggins\""}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Federico"}]