[{"rating": 5.0, "review": "It depends on your needs, but the stick should satisfy most users. I also bought the Fire TV box and I returned that one mainly because of software issues. I gave that one 2 stars. I will be able to compare the 2 though.I was impressed to see that for the stick they fixed the interface for Amazon Video and that now they have a separate section for Amazon Prime movies. This might be the case for the box also, as it might just be a new software update.The interface does feel a tad slower as compared to the box and the gaming would be more limited. If you don't care about gaming I think you would be golden with the stick, especially given the price difference.You don't need a separate HDMI cable with the stick. It's cheap to get an AmazonBasics one, but better not to have to.The remote while not quite as nice as the one for the box it is small and the Fire TV stick responds quite nice to it.Now if only Spotify would work as standalone, without the need of a phone or a tablet to play from, this would be the perfect streaming device for me. For the price paid it's a 5 stars keeper though", "verified": true, "helpfulness": "0/0", "author": "the savvy shopper"}, {"rating": 4.0, "review": "Works great fast and quick. Plus you can side load many Android apps. More reliable than chromcast. I have A roku and a chromcast and the chrome cast would lose wifi connection and stopped working after a year. The roku and fire tv are both reliable but the amazon fire tv stick and Firetv are the better choice since you can side load Android apps. If you want the best and most reliable streamer I would buy a Fire TV and connect it via an ethernet cable.", "verified": true, "helpfulness": "0/0", "author": "Pishkari5"}, {"rating": 3.0, "review": "I had a chromecast before this and mostly use google services, however I was disappointed with the reliability of streaming WatchESPN with chromecast. Fire TV stick advertised as more reliable wifi and better processor so I bit during the prime promo. Watching ESPN on the Fire Tv stick is much better, almost no hiccups, than using the chromecast, so it works well for that. However, I think I prefer the chromecast as a platform in general. It works more seamlessly with my android devices and even my laptop. The content available for Fire TV is also less than Chromecast (aside from amazon prime video). Prime music on fire tv is basically non existent, you have to manually add albums and playlists, and I never otherwise use it. Google Play music on chromecast works as expected. Lots of tv apps (watch abc, nbc, cbs, etc) aren't available on Fire TV and either have chromecast support and can be screen casted from my Nexus 7. I have two tvs so will use both as needed but would likely recommend chromecast based on content alone, unless you wanna to use it mostly for ESPN or don't have another way to watch prime videos.", "verified": true, "helpfulness": "0/0", "author": "Eheaps"}, {"rating": 4.0, "review": "I have a Roku on another tv and wanted something for a new tv I just purchased.  I mainly watch Netflix, and this includes that and was a good deal on Black Friday, so I decided to try it.  I don't see the higher speed I had read about - about the same as the Roku for me.  I miss the dedicated buttons on the remote for Netflix and a few other sites.  Not a big deal though.", "verified": false, "helpfulness": "0/0", "author": "Sharon W."}, {"rating": 5.0, "review": "I love my new fire stick!  You have so so much to choose from. The Amazon prime is amazing. If you can't find. Something go to search nine times out of ten you will find it. :-)", "verified": true, "helpfulness": "0/0", "author": "Sweet pea"}, {"rating": 5.0, "review": "Thanks", "verified": false, "helpfulness": "0/1", "author": "Houssam"}, {"rating": 4.0, "review": "Works as expected, but think it could use with a bit better way of organizing as well as access to more online video, like vudu, flixster, etc.", "verified": true, "helpfulness": "0/0", "author": "Joseph Muselevichus"}, {"rating": 3.0, "review": "I was looking at Fire TV as a potential way to disconnect my PC from my TV. So far it's inferior in every way. For $20 it's not a loss at all but it's turning me off to the idea of using a Fire TV (box or stick), Roku, Chromecast, etc...Setup 5/5The Fire TV Stick came with my Prime account setup already. The only other step I needed to do was simply inputting my wifi information. After that it just works.Aesthetics 4/5Not too much to say here. the stick will never be seen aside from the power cable you should use. I'm not sure if it can be used without it. But having a cable coming from behind your TV is standard. Can't dock anything for that. The Stick itself feels solid and high quality. The remote control feels pretty good for such a minimal setup. It has a ring control reminiscent of an iPod, as well as 6 other buttons for home, back, menu, and media controls.Subtle black styling and feels good to hold and easy to use. Nothing here really adds much or takes away from the experience. But nothing to \"wow\" you either. Standard and functional.Software Ease of Use / MenusThe menus are easy enough to use but not really amazing. This is my first media device of its kind. Generally I just use my PC connected via hdmi. I'm accustomed to mouse/keyboard controls so this is a big of a departure for me. Navigation is fairly simple but still doesn't feel too amazing. I had a few weird bugs with trying to install some apps (Plex and Twitch) where they'd start downloading and stop and start and stop, etc... I couldn't really tell what was going on though. A little more feedback aside from a small progress bar that wasn't apparent at first would have been nice.Getting around channels and apps is not bad but the design isn't breaking any ground here. You scroll up/down and left/right. I feel things could be organized better and more intuitively.Performance ~3/5This is where it loses most of its missing 2 stars. The two biggest reasons I got this (aside from the $20 pre-order sale) was to use my Prime video more and to stream from my Plex media server. Prime video works great actually. I've never had any issues streaming from Prime. Plex has been almost unusable and I can't tell if it's the server itself or something with the Fire Stick. Video randomly just stops playing. Repeatedly. Consistently.  This could be a Plex thing but I haven't experienced this on my phone, tablets, or their web player.The other thing I tried was watching Twitch streams. What a horrible disaster. Basically unusable. Way too often I would try to open a stream, watch a 30 second ad, and then get a message saying the stream couldn't open or didn't exist - the stream I could open on my PC no problem. Other problems include trying to open a game channel (ie: League of Legends, Starcraft, etc..) and being told there were no streams for those games. Obviously this is wrong. So far my Twitch experience has been completely unusable.Maybe the worst aspect of my performance problems are that things either work or crash. When they work it's great. Video streams over my 802.11n network without a stutter. Videos start up fast (if they do at all). But then things just stop. Or they don't start at all. I'd take some stuttering over complete failure.Menu performance is actually fairly solid. No delays or anything when navigating around. A few bugs but in downloading apps.Options 2/5There's no option to stream from networked libraries (NAS storage, just a hard drive on your Pc, etc..) so you have to use something like Plex (which barely works for me on the Fire Stick). Your options are fairly limited. This may be the case for most media players of this type but I have no basis for comparison. I have to find a Plex alternative to see if other media servers work better.So if you're mostly interested in Prime video, this thing works great. Other functionality is fairly sketchy for me right now. For $20 I'm not upset at all. But what I was hoping in the back of my mind would be a $20 miracle of media streaming is not going to be a reality.SpotifyThis one's really annoying. I was excited when I saw Spotify was an option. But it's just \"Spotify connect\". So you can play spotify off a tablet/phone to your Fire Tv. You can't just open a spotify app in the Fire TV menu. Spotify Connect is pretty nice. But if you're coming from having a PC hooked up to your TV it's no change at best.", "verified": true, "helpfulness": "0/0", "author": "Jared Dicioccio \"JMD\""}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "ray-w"}, {"rating": 4.0, "review": "Does the job.  It takes a little getting used to but once done things are just ducky.  Don't compare it to the ROKU devices.  You are not limited to Amazon Prime services as some seem to think.  I use Netflix, and Hulu apps and they work just fine.  Also, many more to select from.", "verified": true, "helpfulness": "0/0", "author": "H. Goeller"}]