[{"rating": 4.0, "review": "I love my fire stick now I can see all the move", "verified": true, "helpfulness": "0/0", "author": "Bernard k Anderson Jr"}, {"rating": 5.0, "review": "I love the Fire Stick.  My wife and I can now watch so many programs/series we missed out on.  Plus so many movies to choose from keeps us from watching regular TV as much as we used to.", "verified": true, "helpfulness": "0/0", "author": "D. F. Robinson \"Dan\""}, {"rating": 5.0, "review": "Only recommendation would be of we could search for a title on the main screen and it search all apps (Netflix, Hulu, amazon, etc) and tell me which one I could watch it on. Wishful thinking. Love love love the Amazon Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Cain"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "felicia"}, {"rating": 5.0, "review": "Loving it so far. Super easy set up and its fast. I loved that it came pre registered. We dropped cable and now my girls can watch their nick Jr shows again.", "verified": true, "helpfulness": "0/0", "author": "ryan m spegal"}, {"rating": 2.0, "review": "since i dont have smart tv, its one  of cheapest device i can find to steam hulu, nettflix and amazon.it also let me access prime photo whicchh is one big plus.here the problem..device keep dropping network connection. while all my other device works fine.. (2 table, 4 phone, 1 iptv, ps3, 1 laptop) the stick will just suddenly drop connection and it wouldnt connect to any wifi until it completely reboot.no access to DLNA server.. i have a hd connect to my router so it can share music. why amazon only allow play music from prime is beyond me.. as i dont want to upload my music (too many) amazon cloud..if amazon ever fix that wifi problem i would give it 5 star.. but i dont think it will ever got fix as people complain in amazon fire tv forum for 4 page already.", "verified": true, "helpfulness": "1/1", "author": "David Cheung"}, {"rating": 5.0, "review": "Excellent product,", "verified": true, "helpfulness": "0/0", "author": "Mario Contreras"}, {"rating": 4.0, "review": "I am really enjoying this product. I had an Apple TV, but it wouldn't run Amazon Prime, whereas this unit runs Prime, Netflix and many other apps. With Apple TV I had to point the remote directly at the unit to make it work. Fire Stick works anywhere in the living room. I would say the picture quality is the same as Apple TV. I am hoping the software will improve for Netflix, as it is not as easy to navigate as it was with Apple, but overall I am very satisfies with it.", "verified": true, "helpfulness": "0/0", "author": "Westcoastgirl"}, {"rating": 1.0, "review": "Fire TV Stick keeps on losing network connection.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 3.0, "review": "The Fire TV Stick is easy to install and use.  The user interface is clean and intuitive. The problem that I am having is with the ESPN streaming app. It continually stalls out and it gives you a dialogue box that claims there is a problem with the network connectivity. I tried deleting the ESPN app I had and downloading another but the same problem presented itself. I use the Netflix app on the Fire Stick and it works perfectly. My assumption is the ESPN app for the Fire Stick is buggy.", "verified": true, "helpfulness": "0/0", "author": "Gary Warren Ferguson"}]