[{"rating": 5.0, "review": "Yes! Love it. Only con is have to reset too often. Othrrwise, friggin awesome!", "verified": true, "helpfulness": "0/0", "author": "Todd Fradkin"}, {"rating": 5.0, "review": "Love it.  Saving over $100 per month on our Comcast bill, but very disappointed Comcast has not made their services accessible.", "verified": true, "helpfulness": "0/0", "author": "Brandy Ploe"}, {"rating": 5.0, "review": "fast, easy, lots of features", "verified": true, "helpfulness": "0/0", "author": "Slightly grey"}, {"rating": 4.0, "review": "new to me but I love being able to talk to it ^& getting a quick response, its nice", "verified": true, "helpfulness": "0/0", "author": "Bonnie Mossow"}, {"rating": 1.0, "review": "Wifi was not working intermittently. Returned it. Reordered but its out of stock. Will see.", "verified": true, "helpfulness": "0/0", "author": "Sachin"}, {"rating": 4.0, "review": "So far it works great! We haven't had any problems with it.", "verified": true, "helpfulness": "0/0", "author": "skysnan"}, {"rating": 5.0, "review": "This devise up-dates your tv capabilities.  Love it.", "verified": true, "helpfulness": "0/0", "author": "D L Gorman"}, {"rating": 4.0, "review": "Like it a lot! Could sync with iTunes for another star!", "verified": true, "helpfulness": "0/0", "author": "StephanieGP"}, {"rating": 2.0, "review": "When it works it's great. Streams well and no problem connecting to router. Easy set up. The big problem is this product gets very hot while plugged into the back of the TV. I had to unplug the Fire TV Stick from back of the TV and adapter to get it to cool. Heats up very fast again. The remote also sticks and doesn't respond well at all. There is a huge delay between pressing a button and initiating the action. Not sure if this is a side effect of it getting so hot but it doesn't happen until it has been plugged into for awhile. Need to work on some glitches with the responsiveness in the remote.", "verified": true, "helpfulness": "0/0", "author": "M. West \"What, where, why and when?\""}, {"rating": 5.0, "review": "Love it!  Far better quality than subscribing to Netflix, etc.", "verified": true, "helpfulness": "0/0", "author": "Virginia Westhafer"}]