[{"rating": 5.0, "review": "love it, i have a Roku and this so far qaulity wise is far better. doesnt have as many apps, but the ones it has are very user friendly. the remote also much better than the Roku's remote", "verified": true, "helpfulness": "0/0", "author": "Ronnie Smith"}, {"rating": 5.0, "review": "More things than I could possibly watch!", "verified": true, "helpfulness": "0/0", "author": "Douglas S Bett"}, {"rating": 3.0, "review": "Nifty little device, but a bit glitchy.  My biggest complaint is that it's very slow.", "verified": true, "helpfulness": "0/0", "author": "Jordan Hitch"}, {"rating": 5.0, "review": "We really like this little device.  It is a pain you have to have it plugged in but I see now it must be so.  I am sure the format will improve over time but for us right now it is great.  We can 'throw' the youtube on the screen from the laptop.  We can easily find movies, youtube channels and more.  I got a smokin' deal with prime before they made them available and I am so glad I did.  No need for dish or cable now.  It does everything we need it to.", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 5.0, "review": "I really love the fire TV stick for streaming.  We don't watch a lot of tv, but this is a very convenient way for us to stream the movies we own.  I also use the Prime yoga videos quite a lot, and the kids have really enjoyed watching some of the Prime kids' shows.  A couple of times there's been a little skipping, very infrequently, but I assume that is a connection issue and not due to the processing power in the stick.  I keep losing the remote (by \"I\" I mean, everyone else in my family), but I set up the app on my phone and that works fine too.  I'm very happy with everything I've done with the tv stick.  I particularly like that it doesn't take any time to boot up or whatnot ... I used to not want to stream on our tv because it takes so long for the Wii or whatever else we were using to stream to start up, etc.", "verified": true, "helpfulness": "0/0", "author": "Sarah Carpenter"}, {"rating": 5.0, "review": "It is great", "verified": true, "helpfulness": "0/0", "author": "Trudye A. Johnson"}, {"rating": 5.0, "review": "Fire Stick was a great purchase got me, just plug and play.  I basically turned my TV into smart TV in just a few simple steps. Lots of content and great access to Net Flix, Hulu etched. Ilol recommend this great Amazon product to All my friends and relatives.", "verified": true, "helpfulness": "0/0", "author": "john richard baze"}, {"rating": 3.0, "review": "Eh everything is extra money", "verified": true, "helpfulness": "0/0", "author": "brian coffey"}, {"rating": 5.0, "review": "I luv it... wks gud and I enjoy all da movies.", "verified": true, "helpfulness": "0/0", "author": "vanessa"}, {"rating": 5.0, "review": "I have not had as much time to use it as I'd hoped to date, but it's so easy. I have a number of movies and programs saved and ready to watch. I'm seriously considering getting one for my new bedroom tv. I'm looking forward to cutting out cable soon.", "verified": true, "helpfulness": "0/0", "author": "Arrow Sailor"}]