[{"rating": 5.0, "review": "Works great unless there's bad weather, just like my Dish Network. Also, have to figure out how to increase my bandwidth to stream easier. I didn't realize there would be so many movies with a cost attached, but it's still cheaper than pay per view. Nice product to have. Easy set up.", "verified": true, "helpfulness": "0/0", "author": "Susan M."}, {"rating": 5.0, "review": "I have the Fire Phone and they both work very well together.  I love having direct access to my apps, my photos, videos and I love having the app on my fire phone where I can send it directly to the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "dreamersland"}, {"rating": 4.0, "review": "I really like the service albeit I'd like to be able to stream/mirror through it from my devices (iPAD, Android phone, Win8 Laptop)", "verified": true, "helpfulness": "0/0", "author": "Jirka V. Danek"}, {"rating": 3.0, "review": "need more info... for instance to play the games, what game controller do you buy and how do you hook it up? need better separation between prime shows and pay shows", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "What else can you ask for? This will make any older tv, or a newer and less costly one, into a smart TV.Great for Netflix, Amazon Video, or even watching your own family movies. You don't even need to read the instructions, it's very easy to set up, and very intuitive.", "verified": true, "helpfulness": "0/0", "author": "P.R."}, {"rating": 4.0, "review": "Love it... The only con is that it needs power from a wall outlet since the USB on the TV is not supplying enough Amp's", "verified": true, "helpfulness": "0/0", "author": "Jorgen Asteberg"}, {"rating": 4.0, "review": "Great product, and this was already registered in my name as promised to Amazon Prime members when receiving and setting it up.  No problems connecting to my WiFi signal at home.Ease of use and remainder of set up was easy! Great choices of apps for viewing free content or paid services. Overall I'm very happy with this purchase and love it! HOWEVER..only use the Fire Stick if you have free or unlimited wi-fi available!  learned an expensive lesson by using my external \"JetPack\" that provides mobile WiFi signal through my cell phone provider. I use this jetpack 3-4 times a week for 30 minutes at a time for mobile laptop use mainly for work purposes when there's no source of  WiFi available.This jetpack gives me 5 gigs of media per month which suits my mobile usage needs just fine. Recently when at a friends house with no WiFi, I used my jetpack for WiFi signal in order to use the Fire Stick. After an hour or so I received a text on my cell phone  indicating all 5 gigs had been used up. Which puzzled me as the new month of cell service had just started the night before at midnight. After I made a call  to my cell service provider, I learned that in fact YES, after only an hour, I had used up all 5 gigs and actually went over the limit of media that I have in my monthly cell plan. My provider automatically adds an extra 5 gigs when going over and in turn added an additional $30 on to next months cell phone bill. I DID NOT KNOW STREAMING TAKES ALOT OF GIGS!!! Be sure to use FREE or an UNLIMITED SOURCE IF WiFi with this product!", "verified": true, "helpfulness": "1/2", "author": "Krystal McBride"}, {"rating": 3.0, "review": "The Fire TV Stick works well but understand it's limitations - I didn't.  I purchased the Fire Stick to use in my home as well as to take on vacation.  It does not have the ability to sign into networks in hotels and resorts because it does not have a built in browser - Big Disappointment - it does not travel!  Also there are limited channels that are available.  Before you buy check that Amazon offers the channels that you want.", "verified": true, "helpfulness": "0/1", "author": "HJH3 \"HJH3\""}, {"rating": 5.0, "review": "As a Google/Chromcast lover, I had doubts. I admit that I really wanted it to not be as good as the Chromecast, but using this has made me realize just how fickle the Chromecast was.This thing is friggin sweet. It doesn't disconnect when the microwave is on, it never slows down or buffers mid-movie. Full disclosure, I have 100meg cable internet. However, my Chromecast would spend at least half its life either struggling to connect to my wifi or buffering. I just got used to it and never saw it as a failure of design until I purchased the Fire TV stick.If you're like me and only used the Chromecast for Netflix, screw it. Get this instead. Or give your Chromecast away.", "verified": true, "helpfulness": "0/0", "author": "MegZOOOOOORZ"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Patricia \"book junkie\""}]