[{"rating": 1.0, "review": "I can barely use this the Fire Stick since it has a known network connectivity bug. Every time I turn on the TV, the device cannot connect to the network. Amazon Support states to power cycle the wireless router, cable modem, and Fire Stick...... Well that does work to get it up and running but it won't be long until it happens again. For that reason it's a 1 star. It's just way too annoying regardless of whatever features exist.", "verified": true, "helpfulness": "1/1", "author": ":)"}, {"rating": 5.0, "review": "Netflix, Hulu + & Kodi. Such a powerful little device.", "verified": true, "helpfulness": "1/1", "author": "maratonomak"}, {"rating": 5.0, "review": "Installation and use of this item was very simple.  I have very much enjoyed using the TV Stick, but I must say that the selection of \"free\" program choices is quite limited in terms of what my preferences are for more recent options.", "verified": true, "helpfulness": "0/0", "author": "J. Alder"}, {"rating": 1.0, "review": "My new Fire TV Stick arrived a few days earlier than expected. Yeah!1. My first problem was getting the battery compartment open on the remote. VERY difficult. Although the plastic is sturdy, I certainly didn't want to break it. There is no helpful indentation or grooved surface to help you get a grip and slide that open. So that was a small frustration.2. Next, the instructions seem to 'imply' that the Stick will work 'if' close enough to a router. Well, my router is 3-feet from my TV HDMI ports and the stick would not work. So I plugged in the power source. To the credit of the designers, the entire device with power brick and cable is incredibly compact.3. Getting through the setup process took just ten minutes. The only problem I had was I entered the password wrong for my WiFi and had to repeat that step. The ten minutes includes me watching the 4-minute orientation video.4. To fully test operation, I attempted to launch a Prime movie and I got the Blue Screen of Death (BDOD) - \"HDCP Unauthorised. Content Disabled.\" (Yes, British spelling!) After 20-minutes of trying remedies from the Internet, I used the help feature to call Amazon. My call went through without delay and a representative was able to help me solve the problem is under ten minutes.It turns out, the Stick does not like other HDMI items plugged in. I use all three HDMI ports on my TV. Temporarily unplugging my other devices solved the BSOD. Apparently Amazon thinks people will somehow steal digital content. Once the BSOD was cleared, I have everything plugged back in and fully operational and the error has not manifested again.5. Operation is very straight forward and simple. The variety of content is well worth the purchase price and I like that I can easily transport it to a friend's house, etc.The net cost for my Fire TV Stick is actually a savings because I have eliminated other paid services. My monthly entertainment costs are now LESS.UPDATE: JAN 1, 2015Downgraded from 5-stars to 1-starReason for downgrade... the BSOD - Blue Screen Of Death is back. The reason for the BSOD given by Amazon customer support is 'the device is detecting other devices plugged into other HDMI ports and it thinks you are trying to copy content.'INSANE and I'm calling it a lie.It is completely unreasonable in today's technology to think that the Fire Stick will be the only device plugged in. There are multiple HDMI ports for a reason! People have DVD, Blu-Ray, Game Consoles, Sound Systems, etc. plugged in. Does Amazon think we should unplug those items anytime we want to watch something through the Stick? Does anyone at product development understand how difficult this can be. Think of the possibilities: a disabled person whose existence is regulated to a wheelchair. How easy do you think it is for someone in that condition to manipulate even a 'small' 36\" television without assistance.INSANEIn my humble opinion, anyone who is going to steal content is not going to be stopped by this insane programming restriction. Therefore, why inconvenience, frustrate, and destroy customer relations with thousands of other consumers by presenting the BSOD just because they happen to use multiple HDMI devices.Amazon, if you are listening, a device update needs to address this immediately -- if you value your customers. Do you?", "verified": true, "helpfulness": "9/9", "author": "Don Uhrig"}, {"rating": 1.0, "review": "Had the Fire Stick for less than 24 hours and had the same authentication problem. Every other device I have will keep their connection to the router but not the Fire Stick. I rebooted the router and the modem several times. In looking at my WiFi analyzer the signal strength is very good. Issue is with the Fire Stick. On top of that Amazon was very happy to accept my money on the release date but delay delivering the Fire Stick while at the same time they released it at Best Buy. Tried several times to explain to Amazon staff and their best response was \"Well you never know whether a 3rd party site might be selling used items\" - what a farce of customer service and of product design. Expected more from Amazon!", "verified": true, "helpfulness": "2/2", "author": "Rick Childs"}, {"rating": 4.0, "review": "I ordered this as a prime exclusive for $20 pre-order and have used it for a day. Overall the product is worth the $20 I spent or $40 retail. However, I use a Google Chromecast as well and still believe that the Google Chromecast is more convenient than this device. Using any Android device and the Google Chromecast, I could send any MP4 video I am watching directly to the TV with no issue. This device only supports it you are using an Amazon Fire device. Also, the Google Chromecast supports mirroring directly from laptop browsing, phone mirroring, and tablet mirroring. These options are very important, but as Google runs Android it is expected that Amazon could not replace the abilities of the Chromecast. Overall, I would have still bought the Google Chromecast but this device is still pretty amazing.Pros:StylishRemoteSame price as ChromecastMore Power than ChromecastGamesCons:You need a power outlet to use the FireStick properlyYouTube is not natively supportedIf you're not a Prime member, this device's streaming abilities are near nothing.", "verified": true, "helpfulness": "1/1", "author": "Kevin J Nguyen"}, {"rating": 3.0, "review": "worked right out of the box post setup for one day, BUT now it says I have an \"authorization\" problem. Several attempts to re enter modem/router password not effective  - still says  \"authorization\" problem  *Do now notice that when I attempt to access amazon video directly from my 2nd gen. KINDLE FiRE HD, it won't open as usual and customary  **So I now believe the problem is on your end somehow.  Help.", "verified": true, "helpfulness": "1/1", "author": "JO KINDL"}, {"rating": 5.0, "review": "This device could not be easier to install, setup and navigate. Simple wins.", "verified": true, "helpfulness": "0/0", "author": "callen \"partschick\""}, {"rating": 5.0, "review": "Works better than anticipated. Voice recognition from the phone app works great too. I love it!", "verified": true, "helpfulness": "0/0", "author": "Linda R"}, {"rating": 2.0, "review": "I really wanted to like the fire stick. So much I bought two. I had occasional problems with the RoKu, but this thing is so much worse. It will not stay connected to the router. I have to restart shows repeatedly. I would have bought another Chromecast, but this had a remote and I liked the idea of the kids setting their own shows since I won't let them use the ipad. I'm glad I bought it on sale or I would be returning the open one. The unopened one is definitely going back. I'm thinking we will put back the Roku. It's slow, but nothing as frustrating as this.", "verified": true, "helpfulness": "1/1", "author": "Kriss"}]