[{"rating": 5.0, "review": "Wow what an amazing device.  My Fire TV Stick arrives this afternoon. Setup was so easy, I can see why some folks were up set about the time it took to check for updates a minute is a really long time. I was up and running in about 3 minutes.  While you do have to watch the video I found it informative. Video and sound quality is fantastic and they load very fast. Viewing photos is great anything you have on the Amazon cloud drive will be on your Fire TV stick. Any music you have on Amazon will be there as well with great sound quality. The Fire TV App for android works great.  One more thing the remote battery compartment is very easy to open.  Amazon really hit the mark on each and every point with the Fire TV Stick. I highly recommend the Fire TV StickUpdate: I couldn't be happier with my Fire TV Stick. There is one feature I found while I had an Amazon video on pause. The screen saver...it's not like any TV screen saver I've seen Amazon outdid  themselves with the beautiful pictures they used. Well done Amazon, well done.", "verified": true, "helpfulness": "0/0", "author": "D. Maloney \"Pepaw\""}, {"rating": 5.0, "review": "I love this Fire TV Stick. It works out of the box without problem. One minor inconvenience is the thin and small size of the  remote. It is easily misplaced. Would it not be good if it has a keychain on its bottom side?Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Tomahawk One"}, {"rating": 5.0, "review": "Had to buy the Fire TV Stick.We live in the country and our only internet is via satellite so we are limited in how much we can watch.Still went for the Fire Stick and presently in the playing and testing mode.Picked out some movies and videos to give a go later - saved them in my wish list.. What I've seen so far is quality and I do mean that.It loads quickly when connected t the TV. Just follow the easy and quick instructions and your up and running.It does open a whole world of material and I'm having a great time just looking to see what all is available. There is a lot.The remote works just fine with easy options, not loaded with all sorts of needless choices but what is needed.Good job Amazon.", "verified": true, "helpfulness": "0/0", "author": "Kryptonite"}, {"rating": 4.0, "review": "Q; Could you surf the web with the fire stick? because I want to be able watch movies on a certain site and I was planning to get Google chromcast but I heard that if you get a email or incoming call it disturbs your videos I want to know if The Fire Stick will let me surf the web", "verified": false, "helpfulness": "0/0", "author": "Bianca Sarmiento"}, {"rating": 5.0, "review": "PRO - Faster than Roku Stick and better user friendly than Google ChromecastPRO - Similar user interface as Roku but with more featuresPRO - Easy to navigate with tons of featurePRO - Very shard HD picturePRO - Able to connect through WIFI ACCON - The remote should be more responsive (not as good as Apple TV remote); when pressing once sometimes resulting double click or delay", "verified": true, "helpfulness": "0/0", "author": "Duty Free"}, {"rating": 5.0, "review": "So Far so good. Does exactly what it should do. We use the Fire Stick on 2 TV's. It's easy to move, and works perfect. Thanks Again Amazon, Big Smiles!!!!", "verified": true, "helpfulness": "0/0", "author": "J. Overmire"}, {"rating": 4.0, "review": "I was so disappointed in the chromecast I bought awhile back that I just decided to chance the Fire TV stick when it was on sale. It's a bit zippier than older Rokus and the UI is solid. I use this on my second TV in the bedroom while my xbox does the media work in the living room.I'd give this 5 stars if it could cast content from my laptop, ipad, or iphone. I'm also looking forward to the iphone voice search app.", "verified": true, "helpfulness": "0/0", "author": "Drew NYC \"Drew NYC\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "patti joyce"}, {"rating": 5.0, "review": "I have both Fire TV stick and Fire TV box for each TV. I don't know the difference between these two. But they are both great.", "verified": true, "helpfulness": "0/0", "author": "365 Days of Happiness"}, {"rating": 5.0, "review": "This thing is incredible!  It blows the chromecast out of the water.  It is a stand alone device so no need for a tablet or phone. The interface is smooth ad easy to use.  There is also an app you can download on your phone to control it and is voice activated as well.", "verified": true, "helpfulness": "0/0", "author": "Michael Venza"}]