[{"rating": 4.0, "review": "I love the Fire Stick.  I would have given 5 stars but for the design of the power input.  It's placed about mid way in the Fire Stick and as such makes you use the extension thus making the Fire Stick protrude out.  If they had the input closer to the end you would not need the extension.  A minor thing, but you have to use the Fire Stick before you can get to the place for the video explaining how to use it.  I would suggest in the future the first thing upon installing is the video.  I figured it out but would have been easier with the video first.", "verified": true, "helpfulness": "0/0", "author": "Duane E. Webb"}, {"rating": 5.0, "review": "The Fire TV Stick is awesome.", "verified": true, "helpfulness": "0/0", "author": "Kenneth S Payne"}, {"rating": 5.0, "review": "Just my quick opinion.  I own a LG smart Bluray player, 2 x box 360's, a cromecast, a ruko, and my newest THE FIRE TV STICK.  Fire TV is my favorite.  Its the fastest and the video quality is the best by far.  It's main purpose is neflix and prime video. The kids play games on it as well.  It's a great product and i would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Shana S"}, {"rating": 5.0, "review": "Great product, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Connie Blum"}, {"rating": 5.0, "review": "I love using it more than I thought I would.  i am not very techy, and I guess I didn't realize all that I would get from this.  I think that this little stick, is well worth the purchase !!  or you can buy a fancy TV for thousands of dollars... up to you ;)", "verified": true, "helpfulness": "0/0", "author": "joann seckus"}, {"rating": 4.0, "review": "I really like this little device. I love that it is so portable. I can take it with me to a friend's house and stream content available to me through my Amazon Prime account and this has probably sold a few of these simply because people are impressed with what they can do with the Fire TV Stick.  The only reason I did not give this five stars is because, unlike my Kindle, Comcast Xfinity is not a listed cable provider to access Showtime Anytime.  It does appear that HBOGO, just made available through Fire TV Stick, allows users to login through their Comcast Xfinity account, but not Showtime.  I'm not sure how this can be resolved, but I'm sure I'm not the only Comcast subscriber who is perturbed by the fact that I can stream HBOGO through my Kindle and Fire TV stick, and I can stream Showtime though my Kindle--but not on my television?", "verified": true, "helpfulness": "1/1", "author": "Kathryn E. Claxton"}, {"rating": 4.0, "review": "The Fire TV Stick works as expected.  I would like to have found more recent movies/TV shows available at no charge from Amazon Prime.  Most of what I did find I can already get from Netflix.", "verified": true, "helpfulness": "0/0", "author": "jsc"}, {"rating": 5.0, "review": "Great additional to my TV watching experience.", "verified": true, "helpfulness": "0/0", "author": "Geraldine T MacLellan"}, {"rating": 5.0, "review": "Fire TV Stick is great. And very easy to set up. I love this.", "verified": true, "helpfulness": "0/0", "author": "connie"}, {"rating": 5.0, "review": "This was a great investment for the price. Even at full price.  It's easy to use and move around the house.I watch use my fire tv stick mostly for Netflix, YouTube, Amazon prime and pandora. My entire family (5) shares mine, but I'm thinking about buying more because it's just so cheap.", "verified": true, "helpfulness": "0/0", "author": "dawnajo"}]