[{"rating": 5.0, "review": "A lot better than I expected, got this as a gift for my dad and he's seeming to really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 1.0, "review": "The Fire TV Stick was a disappointment. It ran fine for a few weeks when after I first received it and then started experiencing frequent disconnects despite my Wifi on other devices being solid. I requested a replacement and it too, was fine for a bit longer than the first. I've now returned the replacement because we couldn't even get through one Pandora song before it would disconnect, need a reboot and a retry.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this little stick I had one of the little rca streaming boxes but the picture quality is so much better with the fire tv stick it's unbelievable!!!", "verified": true, "helpfulness": "0/0", "author": "Mitchell dale Atherton"}, {"rating": 5.0, "review": "Extremely easy to install and we can move it easily from one TV to another.  We were using a Wii.  I hoped it could replace my cable subscription, but I don't think channel/show coverage is good enough for my teens.", "verified": true, "helpfulness": "0/0", "author": "DIANE PHILYAW"}, {"rating": 4.0, "review": "So overall, this fire stick is amazing. It's great for doing exactly what it says it does. I've only used it for Netflix and Pandora so I can't speak on anything else like the gaming portion. My problem with the stick is that it really relies on a strong Wifi signal which I don't always have so my stick is always connecting. Like my laptop and phone run well on my wifi now but when I try it with the stick there is never a real steady signal for it to operate off of. So yes, this product is fantastic but make sure you have a strong and steady WiFi signal before purchasing or it'll be hard for you to like it much. Based off my experience anyhow.", "verified": true, "helpfulness": "0/0", "author": "Nina Perez"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "David Valdes"}, {"rating": 5.0, "review": "We have 2 televisions that are not smart TV and this thing woks great. We move it back and forth quit often. Thinking about buying another so we don't have to move it back and forth. Only issue we had is our router needed to be upgraded do to our family of 5 streamin with many items at the sametime.  With adding the Fire Stick to our already Smart TV, Laptop, and smart phones it was to much for the old router.", "verified": true, "helpfulness": "0/0", "author": "M. Johnson"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Tammy C."}, {"rating": 5.0, "review": "Awesome !!!! Ideal for prime members who want a bigger picture to watch movies on", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I really like it.  My only problem is that it takes up most of my signal and other internet users in the house have trouble doing what they need to do.  Maybe that's my internet, but they came and put a booster on it and still have issues.", "verified": true, "helpfulness": "0/0", "author": "Mamawalsh"}]