[{"rating": 5.0, "review": "Awesome!!! Love it more than what I expected. Better than the chromecast. The remote control is great.", "verified": true, "helpfulness": "0/0", "author": "James Hoover"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Leanne Williams"}, {"rating": 5.0, "review": "I love my firestick, however, I am not impressed with Amazon Prime because of the viewing limitations placed on the most movies I wanted to see, so I cancelled my Prime membership,", "verified": true, "helpfulness": "0/0", "author": "deborah l turner"}, {"rating": 5.0, "review": "Worked great, I had tried Roku, it was horrible. I returned it and am very happy I tried fires tick!!", "verified": true, "helpfulness": "2/2", "author": "Charles Ahlbrecht"}, {"rating": 5.0, "review": "Yes its awesome Love it", "verified": true, "helpfulness": "1/1", "author": "chris daley"}, {"rating": 5.0, "review": "I have ordered two for gifts and no complaints. Easy to set up and use for Amazon video, and Netflix. Doesn't work like Apple TV but if your using your XBox or Playstation to stream movies this is better.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Best purchase ever from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Ralph"}, {"rating": 3.0, "review": "I made a mistake when I first reviewed the Fire Stick.  I said the content was too expensive.  But since I haven't been to a new movie for over twenty years, I was wrong.  Anything over a year old only costs $3 or $4 dollars to rent so I think it's going  to be a very good deal.  I plan to buy an Amazon Fire TV over the next week and give it a go.  I think the Fire TV Box has more oomph and I plan to have my small router close by to minimize internet skips and jumps.  I hope I didn't put anyone off with my first negative review.  I apologize to Jeff Bezos and all of the good people at Amazon.  I'll write another review, in a month or so, that gives  the box a fair trial.  Also the amazon return and customer service was great as always.  Gary", "verified": true, "helpfulness": "0/2", "author": "Gary Long"}, {"rating": 4.0, "review": "It's good, but not as good as the Fire TV. I prefer Ethernet over Wi-Fi, and just today, it starting reporting that it couldn't find the Home page yet showed not only connected to the network, but very good signal. I had to disconnect and reconnect a couple of times before it found its Home page. I hope this doesn't become an every day problem. Plus, unlike the Fire TV, this won't let you play YouTube over it from your computer. I was disappointed to discover that. I guess if you use some app and Android device, you can, but the Fire TV works directly with a PC.", "verified": true, "helpfulness": "0/0", "author": "Michael O'Malley"}, {"rating": 1.0, "review": "The Fire TV Stick was so terrible. I had a Roku before, and I will be going back to using the Roku brand. So disappointing,", "verified": true, "helpfulness": "1/1", "author": "Ryan"}]