[{"rating": 2.0, "review": "Content is good.  It fits me well as I have a prime account.  It however sporadically fail to work on my TV.  Sometimes once a week, once a day, or once every other show it displays 'HDCP unauthorized. Content Disabled' with a blue screen.  I have to unplug the device and power down and unplug my TV to get it to work again.  On many of the forums Amazon blames the TVs as being to old and incompatible.  I see two problems with this justification - 1. If I had a newer TV it would likely have smart features that would mitigate the need for Amazon TV and 2. I run or have ran an apple tv, a roku 3, WD tv, PS3, various DVD/Blu-ray players, and DVRs for long periods with no problems.Here is my Current Television http://www.amazon.com/Sony-BRAVIA-W-Series-KDL-52W4100-52-Inch/dp/B0017Q8B70/ref=cm_cr_pr_product_top?ie=UTF8", "verified": true, "helpfulness": "0/0", "author": "Cory Garrett"}, {"rating": 5.0, "review": "Fantastic.  Works great combined with Sling TV", "verified": true, "helpfulness": "0/0", "author": "Judith Lindsay"}, {"rating": 5.0, "review": "Great device ... very impressed.", "verified": true, "helpfulness": "0/0", "author": "M. Hansen"}, {"rating": 3.0, "review": "Ok, but I expected a simpler selection process for channels. It may be that I need to use it more frequently.", "verified": true, "helpfulness": "0/0", "author": "Greg W"}, {"rating": 1.0, "review": "I do not like this everything you want to watch you have to pay for or or sign in with your cable password. I though this was supposed to replace cable. With the history channel you can't use Comcast password.  The only good thing is Plex app and I still pay for that.", "verified": true, "helpfulness": "0/0", "author": "Raviance A. Cotton \"Cotton Bunny\""}, {"rating": 4.0, "review": "I have had a few streaming devices in the past, the apple TV being by far my favorite. But I really wanted something I could watch all of my amazon content with. I got this and was actually surprised by how many features it had and the overall easy use of the program and tools. The remote has a clean, streamlined design that makes it very intuitive to use. I'm only giving it 4 stars because I was a little disappointed in the quality of the streaming, compared to other similar devices. Initially when it loads a movie or a tv show it seems to have a hard time. Everything is a bit pixelated and fuzzy for the first two or three minutes, but eventually it synchs up and looks nice and crisp. All in all, it's pretty good. I'm really happy to be able to just plug this thing in and be able to watch my Prime videos!", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "Love the ease of installation and use.  It has met or exceeded all my expectations.  Love watching Netflix, HBOGO and of course Amazon original programs.  Would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"gymmomnj\""}, {"rating": 5.0, "review": "Where we really like the Fire TV Stick, we're still learning how to use it.  We find that some apps are available on Amazon, we still need to figure out how to use them, or set up accounts.  The biggest problem we're having right now is the pausing on PBS Nova videos.  It would be nice if videos would stream in without pausing to continue loading.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 3.0, "review": "Like it because it allows me to view my Amazon Prime Videos and Amazon music.  Also have the Apple TV which has most of the other programming.", "verified": true, "helpfulness": "0/0", "author": "Dr. Alan S. Pine"}, {"rating": 2.0, "review": "Constant re buffering ! Color is poor! Buyer Beware!", "verified": true, "helpfulness": "0/0", "author": "Smallbear Rich \"SmallBear\""}]