[{"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Gary Rodriguez"}, {"rating": 5.0, "review": "easy to install and works great. What a deal", "verified": true, "helpfulness": "0/0", "author": "jerry mickel"}, {"rating": 5.0, "review": "I love it. Easy set up. Tons of choices. Even better because of Prime.", "verified": true, "helpfulness": "1/1", "author": "Kelda S Sutterfield"}, {"rating": 5.0, "review": "Fire stick was easy to install I am 80 years old and installed it my self and it has been very satisfactory", "verified": true, "helpfulness": "1/1", "author": "V Sweney Customer"}, {"rating": 5.0, "review": "This was a birthday present from my son. He had it all set up before I came home from work so I cannot help you with the installation. But it is very easy to use & we have no problem with the wifi being 2 rooms away. No we have access to his Netflix account & am finally getting to see all the shows I've been missing. Currently binge watching Orange is the New Black. 😊", "verified": true, "helpfulness": "0/0", "author": "DC"}, {"rating": 5.0, "review": "It is very easy to set up and use and the options for viewing content are extensive", "verified": true, "helpfulness": "0/0", "author": "Lisa A. \"lmdawson\""}, {"rating": 5.0, "review": "Amazing little device.", "verified": true, "helpfulness": "0/0", "author": "Girhame"}, {"rating": 4.0, "review": "Working fine.. We haven't observed any issue till now", "verified": true, "helpfulness": "0/0", "author": "Girikumar Saravanan"}, {"rating": 5.0, "review": "Very happy with fire tv stick.I also have  a rocu 2 ,rocu 3 and chrome cast for sreaming on my 3 flat screen tvs,in essence making them smart tvs.The chrome cast is unique in that it lets you stream lots of online video that is not on any channels associated with the rocku but you need a pc to find the content you are going to stream.But that aside the fire stick is comparable to the rocus for less money and it is very responsive.Love it.P.s. there might be differences in channels and other feature but for the important stuff Netflix,amazon prime and YouTube does the trick.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is a great deal with Prime. I wish the layout was a little more user friendly and the setup is a little confusing. In all I'm pretty happy.", "verified": true, "helpfulness": "0/0", "author": "Shane Hansen"}]