[{"rating": 1.0, "review": "Horrible product! I have gone through two of these Sticks. The wifi connection has been the main issue where I lose connection to the Stick frequently. If you google this, Amazon's forum has a 20+ page discussion of others having the same issue. Buy a chromecast or roku instead.", "verified": true, "helpfulness": "0/0", "author": "arrowv"}, {"rating": 3.0, "review": "It's a good deal, only one problem, it's super sensitive, I have to be careful when using it.", "verified": true, "helpfulness": "0/0", "author": "ann"}, {"rating": 4.0, "review": "Works great. I am thoroughly enjoy having it.  Easy to attach and load up on my TV", "verified": true, "helpfulness": "0/0", "author": "spunkygrams"}, {"rating": 5.0, "review": "This is great", "verified": true, "helpfulness": "0/0", "author": "Richard E. Wadyko \"rwadyko\""}, {"rating": 5.0, "review": "The Fire TV Stick was super easy to set up.  It takes up little room and I would be able to move it to another room easily.  I have both Netflix and Amazon Prime, and I am excited to be able to watch those shows on my big screen TV just like I can any other show.I know that there are other apps, I have really been focused on catching up with some favorite shows, so I haven't explored other capabilities.", "verified": true, "helpfulness": "0/0", "author": "E. Feliciano"}, {"rating": 5.0, "review": "I was quite pleased with the stick and was glade I got it.", "verified": true, "helpfulness": "0/0", "author": "deborah robinson"}, {"rating": 3.0, "review": "About once a day on average, my TV screen is blue and I have to unplug it for 1/2 a minute to get it running again.  I also expected the search function to consolidate my Apps/streaming services (Netflix, etc..) so that I don't have to conduct multiple searches, so that was a disappointment.  Made a mistake in the beginning and ended up paying for a show through Amazon that was already included with Netflix.  Finally, missed the controller in my son's pants pocket before washing, and so, it's only working some of the time.  I have to use the phone controller app sometimes.  So, overall not a great experience, but still functional.", "verified": true, "helpfulness": "0/0", "author": "Elaine Palmquist"}, {"rating": 5.0, "review": "My husband loves it. We both enjoy Bosvh. Best money I've ever spent. Thanks Amaxon", "verified": true, "helpfulness": "0/0", "author": "Sharon Krause"}, {"rating": 5.0, "review": "Love it.No cables.", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 4.0, "review": "My brother got me the fire stick for christmas and I like it.. The only bad thing is when using netflix it freezes a lot!!! And then you can see the lips move of the ppl on tv before you hear them speak..", "verified": true, "helpfulness": "0/0", "author": "Taylor"}]