[{"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "nuno aguiar"}, {"rating": 1.0, "review": "It's not really good", "verified": true, "helpfulness": "0/0", "author": "Vinny"}, {"rating": 5.0, "review": "very easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "sandra  wilson"}, {"rating": 5.0, "review": "Am enjoying it", "verified": true, "helpfulness": "0/0", "author": "CARMEN HYLTON"}, {"rating": 3.0, "review": "Decent companion to the chromecast booth have there worth.", "verified": true, "helpfulness": "0/0", "author": "Miket77"}, {"rating": 5.0, "review": "It works Great!! I have the Fire Tv and wanted this so I can take it with me when I go and it fits the bill to a T...", "verified": true, "helpfulness": "1/1", "author": "D. Goosman \"Darlene Goosman\""}, {"rating": 2.0, "review": "My first Fire Stick  worked for a few months and would not reconnect,  so I ordered another one. It did not connect at all.  Tried Two other TV' s. Still did not work.  Then brought  a new Router, top of the line for 2015.  The Fire Sticks still will not work.  Went to Roku2.  Works just great.", "verified": true, "helpfulness": "0/0", "author": "Sandra Chambers-Rohling"}, {"rating": 2.0, "review": "Virtually no instructions with it.  Still haven't been able to figure out how to connect to my Netflix account through which I have video streaming.  There is a huge delay when using the remote.  Sometimes it take 15-20 seconds before a change on the screen occurs.  Wish I would have gone with a Roku.", "verified": true, "helpfulness": "0/0", "author": "Howard O Ward"}, {"rating": 2.0, "review": "Mine freezes all the time and sometimes even cuts off I also feel like the remote is unresponsive a lot of the time kinda horrible if you ask me", "verified": true, "helpfulness": "0/0", "author": "zach"}, {"rating": 5.0, "review": "Set up was very intuitive. The wifi setup worked immediately. Browsing and selecting movies is also easy. I have not tried it in a hotel yet.", "verified": true, "helpfulness": "0/0", "author": "Josef"}]