[{"rating": 5.0, "review": "Love the Fire TV  Stick. Grandkids can watch disney all day long ..... lots of movie access", "verified": true, "helpfulness": "0/0", "author": "Paula Frazier"}, {"rating": 5.0, "review": "It works well, easy to plug in and set up and offer a higher variety of shows, channels and apps, as well as games.  If you enjoy playing chess on a big screen TV, this is for you.  In my opinion, this is better than Hoku or Crome. It works with your Netflix, HBO, and much more!  And you will save money with movies and shows. The best of all: you can download apps, games and shows directly from your Amazon account or Amazon Prime @ your computer to your Smart TV. You might consider a broadband or high-speed wi-fi for this, because the faster and stronger is your signal the better it works.", "verified": true, "helpfulness": "0/0", "author": "Flavio Van Boekel \"Flavio Van Boekel\""}, {"rating": 5.0, "review": "The Fire Stick offers so many viewing choices, its difficult to chose what to see. Its an amazing array of entertainment that really cannot be matched by any type of cable or satellite service.", "verified": true, "helpfulness": "0/0", "author": "akeagle \"jjjkb\""}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "leidy"}, {"rating": 1.0, "review": "Can't get it to work. No phone# to call & talk to someone about it.  Lot. Bs.", "verified": true, "helpfulness": "0/1", "author": "Timh"}, {"rating": 5.0, "review": "Easy to install! Love this product.", "verified": true, "helpfulness": "0/0", "author": "Ashley Laney"}, {"rating": 4.0, "review": "Love it.  Catching up on some of the series' that I missed the first season.  Also some of the movies and old TV series that I like.  Access to so much.  Downside is having to pay for everything.  However  cost is similar to buying DVDs and once you buy and put in Library, it's yours to view all the time.", "verified": true, "helpfulness": "0/0", "author": "Debbie J. Blake"}, {"rating": 1.0, "review": "I'd leave zero stars if I could. This has been the biggest waste of money. It can't stream anything for more than a few seconds without loosing service. I've tried the suggestion of making sure the device is vertical with no luck. DONT BUY!", "verified": true, "helpfulness": "0/2", "author": "Mehaynes"}, {"rating": 5.0, "review": "This is an amazing TV viewing tool. I downloaded the fire stick app for my iPhone, and the voice control works great. It is easy to use, and so far we are very impressed.  We replaced a Sony Play Station that was driving me crazy with its updates. The only criticism is that when you choose a show, there is a button for \"other ways to watch\" but it only includes Amazon options. I wish it would say \"this show is available to watch on Netflix\", for example. Other than that, it's great!", "verified": true, "helpfulness": "0/0", "author": "Scott Woodland"}, {"rating": 5.0, "review": "This thing is AWESOME, especially combined with all the free movies and tv series that come with Amazon Prime. I LOVE it!", "verified": true, "helpfulness": "0/0", "author": "Matt Baker"}]