[{"rating": 5.0, "review": "This product is amazing, it transforms an older tv into a smart tv. Definitely enjoy having this in the home office. The chromecast I had before was nice, but you can't beat the apps that the fire offers.", "verified": true, "helpfulness": "0/0", "author": "Chad Holloway"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "DeWayne Offer"}, {"rating": 3.0, "review": "I find it a little slower than my ROKU, and I hate that things like Hulu do not refresh for the new days shows, I physically seem to be made to log out of Hulu, and actually need to log into anything else like Neflix, then go back into Hulu to have it refresh. ROKU seemed to refresh everyday regardless", "verified": true, "helpfulness": "0/0", "author": "C. Doyon \"bikergirl\""}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Miss L"}, {"rating": 4.0, "review": "Very good. A lot of choices.", "verified": true, "helpfulness": "0/0", "author": "Richard Urff"}, {"rating": 5.0, "review": "Great selections", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Moyer McKinsey"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Rickena Benning \"Book-a-holic\""}, {"rating": 5.0, "review": "This is the best 30 bucks I ever spent!! Heck I couldn't even go to the movies with my husband for that amount yet with the fire stick I can watch pretty much any show or movie anywhere at home or on the go...and this is the best part....totally free!!! Its not just hulu and netflix either. Instead of having to do individual searches on hulu or netflix or any other movie/tv site, I can simply click and search all sites at the same time for whatever movie I had in mind and the fire stick device takes me right to whichever app has it. Lets not forget the free video games for the kids...again at home or on the go....and then we also have the cloud built right in!!! This is like a memory stick all jacked out with the best of everything.  Once we got this lil piece of heaven we didnt even need our cable anymore. We have everything we could ever want to watch...when we want it and where we want it...all built into this amazing lil stick. You rock amazon!!!!!", "verified": true, "helpfulness": "0/0", "author": "Dr. Andrew byrne"}, {"rating": 4.0, "review": "Great price.  Easy install.  Slippery n small remote.", "verified": true, "helpfulness": "0/0", "author": "Goggie Guru"}, {"rating": 4.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "yvonne"}]