[{"rating": 4.0, "review": "After about one month of viewing on the Fire TV Stick, by enlarge I am very pleased.  My wife and I have used it to watch Sling TV and the quality rivals cable.  I was particularly interested in getting the viewing desired at a low cost.  Praising of cable TV has become outrageous.There are a few glitches I will list. Once and awhile the Fire Stick will lose communication with the internet. I will then need to restart the Fire Stick or unplug and replug it in for a reconnect. Tiresome but doable.  Once and awhile a particular program Wil buffer but other stations are still broadcasting fine. After a few minutes I will return and all is well once again.  I am not sure what causes this but as technology progresses these drawbacks, I am sure, will be resolved.", "verified": true, "helpfulness": "0/0", "author": "Dennis Stott"}, {"rating": 4.0, "review": "Like it so far . . . it has frozen a few times so dropped a star for that.  Will try to update after using it awhile . . .", "verified": true, "helpfulness": "1/1", "author": "RB \"BIG READER\""}, {"rating": 5.0, "review": "for the money it is a great deal. It will help cripple the big cable company's over charging us .", "verified": true, "helpfulness": "0/0", "author": "Moondog Vinyl"}, {"rating": 5.0, "review": "Very happy. It was a gift for my daughter.", "verified": true, "helpfulness": "0/0", "author": "maryellen e mccormack"}, {"rating": 2.0, "review": "As far as the video quality goes, it's great. Performance is also good. I'm ranking the Fire TV Stick only two stars because it constantly forgets/looses the Netflix and Hulu Plus password. At first I thought this might be due to software upgrades, but it happens constantly. The Fire TV stick does remember my Amazon Prime credentials just fine. Having to resign in to services such as Netflix and Hulu Plus constantly is unacceptable. Most reviewers here seem to ignore this issue but it is a serious time waster and although Amazon is not responsible for maintaining the Netflix and Hulu apps for their device, ultimately these apps are going to be very important to many buyers. I also have a FireTV (box) and it does not have this problem. I would avoid the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Deats"}, {"rating": 4.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "Janice"}, {"rating": 5.0, "review": "is better than the standard apps on my smart tv ....love it!!", "verified": true, "helpfulness": "0/0", "author": "edward"}, {"rating": 5.0, "review": "Excellent features at a reasonable price point. Small and easily portable when traveling, allowing you to access many of your streaming services away from home and while staying at hotels. I am glad that they fixed the Wi-Fi splash page problem.", "verified": true, "helpfulness": "0/0", "author": "Simon K."}, {"rating": 3.0, "review": "Bought it for Amazon prim videos  and to send movies from my iPad. The iPad transfer does not seem to work with movies.", "verified": true, "helpfulness": "1/1", "author": "Timothy M."}, {"rating": 5.0, "review": "Does exactly as advertised, great control with the remote", "verified": true, "helpfulness": "0/0", "author": "M. Thornton \"skezzcrom\""}]