[{"rating": 5.0, "review": "So far, I love the Fire TV Stick! It installed extremely easily in about 3 minutes tops on my HDTV, which is not a Smart TV, and it coordinated with my wifi seamlessly. I've already watched several Amazon Prime movies, some old TV shows, and also have Netflix.  In the month I've had it, I've only had one buffering issue, and that was for just about a second and then it corrected itself.  The remote is really easy to use too.  I'm just sorry I didn't buy this a long time ago, because although my cable services \"boasts\" about 200 channels, frankly, these extra channels are mostly local or regional channels for high school or college sporting events, or programs of that nature. The Fire Stick gives us some more options, and best of all, no commercials.", "verified": true, "helpfulness": "0/0", "author": "Hawaii 5-0"}, {"rating": 4.0, "review": "The cons: can't use a keyboard on the Amazon Fire 🔥 Stick. Otherwise, it works flawlessly. But having to key in on the search bar can be aggravating. I'm sending it back for the actual Amazon Fire 🔥 device. Also, depending on where you're using it, you may need a wifi extender so that the stick or the device can receive the signal. As for the programming, it's way more movies and TV shows. To get NFL Now Plus, doesn't work right now. I ended up buying the Nexus Player device and an HDMI expander because I only have 2 HDMI to be able to connect everything I want to include my home theater system. I have a sound bar to include a home theater system. And it definitely makes it dramatically better. Especially when watching a sporting event.", "verified": true, "helpfulness": "0/0", "author": "Wayne A Caddell Jr"}, {"rating": 4.0, "review": "I love my fire stick.  It converted my tv into a smart tv.  Super easy to install. Works wonderfully.  And yay, I have Amazon instant video and Netflix!!", "verified": true, "helpfulness": "0/0", "author": "Monica Yerena"}, {"rating": 1.0, "review": "VERY POOR QUALITY, broken right out of the box. I gave this is a gift my cousin. I claimed how great they were. When I contacted Amazon they said they can return it based on the fact that it was defective. They charged me an additional $7.80 for a restocking fee.......  I can't imagine why I got a broken one.", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Got this for my dad and he likes it. I think it works great. Would've received five stars if inner circle could act as an actual mouse to navigate more efficiently.", "verified": true, "helpfulness": "0/0", "author": "superxlinaah"}, {"rating": 5.0, "review": "Easy to setup and easier to use.", "verified": true, "helpfulness": "0/0", "author": "hmason"}, {"rating": 5.0, "review": "with phone app, easy to use. hubby loves it!", "verified": true, "helpfulness": "0/0", "author": "J. Campbell"}, {"rating": 5.0, "review": "Love how easy it is to use and it gives me access to my favorites, Netflix, YouTube, etc", "verified": true, "helpfulness": "0/0", "author": "dance lover"}, {"rating": 1.0, "review": "What a Rip-Off... if you already have a NetFlix account you don't need this... you have to pay Amazon to use NetFlix, and since it was a gift I didn't know the person receiving the gift couldn't make it work.  OK probably not Amazon's fault but they won't allow me to return it.  It's just another case where if you don't read the tiny tiny print they got you.", "verified": true, "helpfulness": "0/0", "author": "Richard Oregon"}]