[{"rating": 4.0, "review": "This is pretty awesome!!! I love the fact that you can use it with a computer monitor with HDMI. I went back and forth a lot between buying this or google Chrom Cast. Decided on this since Amazon Prime Play isn't compatible with chrome and chrome doesn't come with a remote! Also it comes with extra cord extender between the stick and the tv/monitor, where with chrome you have to purchase if you HDMI isn't a side port but one that stick straight into the wall. Totally love this!! My only complaint is that you have to be careful with purchases, unless you change your setting in Fire TV its as easy as one click, it doesn't ask for verification. My first day I accidentally bought an upgrade to Amazon Prime since I was using a different account. Thankfully I was able to call and have amazon refund me without a problem.", "verified": true, "helpfulness": "0/0", "author": "HeatherLue \"Heather Rogers\""}, {"rating": 5.0, "review": "Mothers day gift for my mom, and she loves it. She said it was easy to set up and she loves all the features.", "verified": true, "helpfulness": "0/0", "author": "Larren Mazyck"}, {"rating": 5.0, "review": "EVERY ONE NEEDS ONE OF THESE! these are great! I put one on every tv!, ther are fast on the remote! no lag time and the app is perfect to operate!, you can even use your smart phone to run the app (with voice commands too)!.", "verified": true, "helpfulness": "0/0", "author": "Randall Lambert"}, {"rating": 3.0, "review": "Pretty good once u download the good apps. Even better if u get it preloaded. All the movies from way back to the latest on DVD even some movies that are still in theaters. Also the latest poverty are usually available all for free. Only problem is sometimes it cuts off mid movie & starts all over. I wouldn't ditch cable for it because you're relying on streaming video, but I would downgrade to a basic package & watch the other TV shows & movies on here...", "verified": true, "helpfulness": "0/0", "author": "Raymond Honor"}, {"rating": 5.0, "review": "This, by far is a great investment. I no longer have to get locked into a contract for cable that costs more money and nearly not the selection!! Only negative is a lot of shows require u to purchase the episode or to just watch it.", "verified": true, "helpfulness": "0/0", "author": "holly"}, {"rating": 5.0, "review": "Love it turned old tv into a great smart tv", "verified": true, "helpfulness": "0/0", "author": "JeneralJoe"}, {"rating": 5.0, "review": "What can I say? I love it. We have Playstations but the new ones have no software for music except the option to use Spotify which I don't want. I want to access my Amazon music library, and this does the trick. It also is great for traveling so I love it.", "verified": true, "helpfulness": "0/0", "author": "HeatherL"}, {"rating": 5.0, "review": "Very nice product. Good video quality. Easy setup", "verified": true, "helpfulness": "0/0", "author": "Sandeep Meesarapu"}, {"rating": 5.0, "review": "I know it would counterproductive for amazon, but it would be sweet if it had support for Google play movies so I can watch previously bought movies on my FS.", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 5.0, "review": "Absolutely love my new Kindle Fire Stick. It is so simple to set up and works beautifully.", "verified": true, "helpfulness": "0/0", "author": "Monika Piper"}]