[{"rating": 2.0, "review": "Just completed the installation of the Fire TV Stick from Amazon.  Love the ease and the video steaming capabilities.  Unfortunately the parental controls is lacking.  Turing on parental controls requires the user to enter the five digit pin number to use even the basic items that are free.  It would be nice to have a function that only requires a pin when something is going to be purchased a movie, app, or in-app purchase.  Makes it impossible to allow children to use the device even to watch free G rated movies unless the parents are there to enter the pin.BTW, when entering the pin the numbers are present, so the kids see exactly what you entered.  Have to give it two stars for the programmers not thinking of those users that may want to protect from children freely charging the credit card on file.", "verified": true, "helpfulness": "0/1", "author": "James H Quackenbush"}, {"rating": 4.0, "review": "Everything works great except that even though the wireless connection says it's \"very good\" I have trouble getting the streaming to work correctly even though the connection with my laptop being in the same room shows 14mbps which should be plenty for 1) fast buffering and 2) HD streaming but the Fire Stick seems to want to have a much faster connection to stream correctly", "verified": true, "helpfulness": "0/0", "author": "Edgar Angulo-diaz"}, {"rating": 5.0, "review": "We just started using it but have already watched five movies that we enjoyed a lot.  This device is easy to use.  I have Amazon Prime which costs $99/year.  This device makes it very worth the money.", "verified": true, "helpfulness": "0/0", "author": "Gene W. Devaux \"The Bear\""}, {"rating": 5.0, "review": "Love it so far fast to get installed and lots of movies with my prime membership", "verified": true, "helpfulness": "0/0", "author": "Orley Setterington"}, {"rating": 1.0, "review": "Bought it prerelase two months ago for one purpose, to use it at hotels.  When buying the unit, that feature, called captive portal access said coming soon.  It is more than two months later and the feature still says coming soon.  The stick has been laying in the box while I wait.  Read the more than 100 reviews of customers upset about this.  Giving it another two months before I attempt to return this useless crap.  Amazon, fix this already.", "verified": true, "helpfulness": "2/4", "author": "Reviewer"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "MrSkipper"}, {"rating": 5.0, "review": "Excellent! Easy to use, works with all my online movie services and no streaming delays.", "verified": true, "helpfulness": "0/0", "author": "LindaFae"}, {"rating": 5.0, "review": "It's super!!!!!!!  What a great gadgets $39.00", "verified": true, "helpfulness": "0/0", "author": "Carolyn S. Thomas"}, {"rating": 5.0, "review": "Works great.  Easy to set up.  I downloaded the app for my Droid phone also .. and it works great as well as the remote that came with the stick.I've already recommended buying one to 3 close friends", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Charles LABADIE"}]