[{"rating": 4.0, "review": "The function is great. In particular I like the ability to screen show  my photos which are stored on Amazon Cloud and play music simultaneously from Pandora.I wish the HDMI standard allowed the device to be powered from the HDMI port rather than USB.The remote could have more function and be bigger. Fat fingers easily make mistakes.Set up was easy but .... I had difficulty connecting to the wireless router when the device was within 8 inches of the router. Not sure if this is an anomaly or a design issue.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to intall (except for the remotes batteries).  Works beautifully and we are now enjoying all the Prime movies that come with our membership.Additional note> to remove the almost impossible slide cover on the remote in order to insert the batteries, the rear cover does slide to the lower rear.  You'll find using a kitchen rubber grip for removing jar lids works best. You'll still have to be a well fit male between the ages of 18 & 25 with arms built like a gorilla's, but if you use the rubber grip and push down with all your might until you think it's going to break the remote in half, you'll be sucessful and you'll be watching movies in no time.", "verified": true, "helpfulness": "1/1", "author": "Mike"}, {"rating": 5.0, "review": "Great product but if you do not use it for a while the screen goes black and you have to restart it by unplugging it. Hope the amazon people improve that in a/n update. I bought mine at bestbuy.", "verified": false, "helpfulness": "1/1", "author": "ToTheArk408"}, {"rating": 5.0, "review": "This has been a great addition to our family entertainment!  Easy to connect with our TV or computer.  Would like more apps to be compatible that we already own, hopefully that will come in time.", "verified": true, "helpfulness": "0/0", "author": "Janet Hilscher"}, {"rating": 5.0, "review": "Fire TV stick works very well.  Upon purchase I didn't realize I had to plug it into the electrical outlet put the supplied cord made it an easy installation.  The interface is fluid and is refreshing compared to the Apple TV interface.  I recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Jason N"}, {"rating": 2.0, "review": "internet connection problems. constantly must be unplugged and restarted to work properly... chrome cast much more reliable!!!!! ( if internet problems could be fixed this could be a great product.)", "verified": true, "helpfulness": "0/0", "author": "chase hudson"}, {"rating": 4.0, "review": "The Fire TV Stick seems to work just fine.  I can access our Netflix and Hulu accounts easily.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Lynn Arbo\""}, {"rating": 5.0, "review": "It's great! so glad we bought it.", "verified": true, "helpfulness": "0/0", "author": "Pat Morris"}, {"rating": 5.0, "review": "Very good experience. Love the product. Watch something new every night.", "verified": true, "helpfulness": "0/0", "author": "Customer"}, {"rating": 5.0, "review": "I have been a cord cutter for a while now. I had a Roth but found the interface was a bit laggy. I ordered the Fire Stick as a pre-order and have been pleased since. I am heavily integrated into the amazon ecosystem so this is a perfect fit.", "verified": true, "helpfulness": "0/0", "author": "Christopher W Goodell"}]