[{"rating": 4.0, "review": "It's ok", "verified": true, "helpfulness": "0/1", "author": "Javier"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Lesley Glenz Launikitis"}, {"rating": 5.0, "review": "I love this thing! Not everything is free, but there's plenty free to watch. I save a bundle because I don't pay for cable anymore except for local channels and internet. Why did I wait so long?", "verified": true, "helpfulness": "0/0", "author": "Betsy \"Betsy Dijke\""}, {"rating": 5.0, "review": "been so helpful and great use.  Nice to see the new amazon shows on the bigger screen", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Much better than Chromecast in my opinion and definitely will buy again once it goes on sale again", "verified": true, "helpfulness": "0/0", "author": "Carlos Alexis Turcios"}, {"rating": 5.0, "review": "I purchased both the Amazon fire stick and the AppleTV figuring I would put one in one room and the other one in another room.  I was not happy with the Apple TV  and returned it to get a second Amazon Fire Stick ( and I am an Apple person… iPhone, iPad, iPod ) but I felt the Amazon fire stick worked better (and was half the price!) The AppleTV could not pick up the signal in the bedroom, which is weaker than in the rest the house, but the Amazon Fire Stick had no problem. I also found so many things on the Apple TV cost extra money and there were so many free apps, movies, TV shows, etc on the Amazon Fire Stick. I started watching one of Amazons own TV shows, and when I couldn't find it on the Apple TV in the bedroom, I realized it was an Amazon show and not a Netflix show. That sealed the deal! I brought back the AppleTV and got a second Amazon Fire Stick. It's very easy to set up and I'm thrilled with it!", "verified": true, "helpfulness": "0/0", "author": "Ro7068"}, {"rating": 5.0, "review": "Is exactly as advertised.  Looking forward to additional content. No complaints for a one-time purchase with continuing use.  Helps me make the most of my Prime membership.", "verified": true, "helpfulness": "0/0", "author": "M K Chan"}, {"rating": 5.0, "review": "I am so excited about this.  It is just as described.  It was incredibly easy to install.  It walks you through step by step if you feel intimidated by technology.  I had no problems connecting to my wireless router.  The remote is small and very easy to use.  It uses symbols and no letters/numbers.  I high recommend this for a less expensive option to watch Amazon programming.", "verified": true, "helpfulness": "0/0", "author": "ANNE C HANSON"}, {"rating": 1.0, "review": "Horrible. Netflix and Hulu have some kind of software issue that makes it so the video will pause but the audio continues to play. Makes it impossible to watch anything but prime movies. (I only have Netflix, Hulu, and prime, no other services so I can't speak to any other apps).  I called amazon about this, had the unit replaced under warranty and still no go. I'm buying apple TV.", "verified": true, "helpfulness": "2/2", "author": "blaze-lola"}, {"rating": 5.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Darrel L. Mcpherson \"de Darrel\""}]