[{"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "marie leon-smith"}, {"rating": 5.0, "review": "The stick was easy to install and is easy to use. We use prime and Netflix. We have found lots to watch. We are really pleased with it.", "verified": true, "helpfulness": "0/0", "author": "bonita gordon"}, {"rating": 5.0, "review": "Love my fire stick, use it significantly more than the ChromeCast.Would be great if Amazon adds the HBOGo App", "verified": true, "helpfulness": "0/0", "author": "Kailyn Roy"}, {"rating": 4.0, "review": "The wireless isn't great even at 6 feet away. But it works great with an ethernet attached.", "verified": false, "helpfulness": "1/1", "author": "Corby"}, {"rating": 5.0, "review": "This is an awesome way to access my prime, used to be on my tablet or my son's playstation.  I am so happy I bought this, I am not a huge fan of watching stuff on my tablet and dealing with the playstation was a pain (for me anyway)!  I can take this from room to room easily, and we took it when we went to visit family a month or so ago.", "verified": true, "helpfulness": "0/0", "author": "SUSAN SPARKS"}, {"rating": 2.0, "review": "The stick itself works well, but I've struggled to have it get a connection when it's more than 5 ft away from my wireless router.  I had it hooked up in the living room (right next to our wireless router) and it worked well.  However, when I moved it to the bedroom (20-25ft away), it has a hard time staying connected, and then my streaming shows stall, or stutter.  It's not my router, as I switched it with a Roku and the Roku works with no trouble.  Pretty disappointing considering the functionality of the stick is much better than the Roku.", "verified": true, "helpfulness": "0/0", "author": "Sven Anderson"}, {"rating": 2.0, "review": "did not provide information for use", "verified": true, "helpfulness": "0/0", "author": "Charles H. Matters"}, {"rating": 2.0, "review": "Works OK.  Interface is horrible.Battery cover on remote is terrible.", "verified": true, "helpfulness": "0/0", "author": "J. Ball"}, {"rating": 4.0, "review": "I suggest, should be in several languages Thanks", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 5.0, "review": "Seems to be stable - it doesn't lose contact with router.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]