[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Andrea Farina"}, {"rating": 5.0, "review": "Set up was too easy - Works great", "verified": true, "helpfulness": "0/0", "author": "DB \"Tool Guy\""}, {"rating": 5.0, "review": "It's really fast and easy access to photos to see in my tv.", "verified": true, "helpfulness": "0/0", "author": "Santhosh"}, {"rating": 2.0, "review": "I was very disappointed with the product.", "verified": true, "helpfulness": "0/0", "author": "Anthony Anderson"}, {"rating": 1.0, "review": "It barely worked for me.  I bought one for my son and it constantly buffered or stopped working all together.  We have a lot of devices in our house that work on wifi and every one of them worked just fine.  Only the stick constantly did not work.  I finally replace it with a roku and he has had no more problems and is able to watch tv just fine.", "verified": true, "helpfulness": "1/1", "author": "SeasideUMC"}, {"rating": 5.0, "review": "Great product. I need another one !", "verified": true, "helpfulness": "0/0", "author": "marianne n massey"}, {"rating": 5.0, "review": "I really like the fire stick. It was so easy to install. I'm learning something new each day about all I can watch or listen to with it. Best purchase for me in awhile.", "verified": true, "helpfulness": "0/0", "author": "Patty Cordell"}, {"rating": 5.0, "review": "Love it! Easily navigated, easy to find new apps, and zero issues. Great replacement for not having cable tv.", "verified": true, "helpfulness": "0/0", "author": "C.J."}, {"rating": 4.0, "review": "The Amazon Fire TV Stick was easier to install than I expected and streaming was smoother and sharper than it has been through my wi-fi compatible Sony blue ray player.  My internet service is not the best and that has limited my use of the Fire TV Stick.  Other than that, my only real concern is that I could use a key board rather than the number pad.  The lack of a key board made both setup and content searches more difficult than I would have liked.", "verified": true, "helpfulness": "0/0", "author": "Andrew Wright"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Kaylor E. Shemberger"}]