[{"rating": 3.0, "review": "Setup was easy minus the upgrade. Not sure if it was because everyone and their mother were downloading the update, but it was slow! I received 2 of these in the mail. I installed on both TV's that I have. Here are the pro's and con'sPros:* I have all my favorite apps, like Netflix, iHeartRadio, and so on.* Great WiFi range. I was able to connect in both rooms no problem. the Chromecast had issues.* You can play games! woohoo* Love Amazon Music.* Super quick when not running an appCons:* Sometimes it runs slow, however, it could be the apps I am running.* Slow downloading updates* Amazon music doesn't have their stations on fire tv yet :(* Can not install the fire tv app on my Fire HD 7!!! WTH* Can't Mirror your device(See below EDIT2)All in all I really like it. I feel like it is better than Chromecast. However, I still have not tried out a few things, like the mirror screen. I would also like to mirror my computer screen. I do not think this does it, as i didn't see an option for that.For $40, it is worth it if you stream your movies/TV/music and play games.######EDIT:Just some updates. Not sure if an issue with everyone but it is recommended to plug the power cord into the wall, instead of the USB on the side of the TV. I do believe it just needs more power to run the processor. The length of the power cord looks to be only 6 feet long, which is kind of short to me. On my one TV it was fine, the other one, I had to do some stretching!I will update when I do some mirroring from device to TV######EDIT2:I have yet to get the mirroring to work on ANY of my devices. I have the Nexus 7(2013), Samsumg Galaxy S5, and the Fire HD 7. All did not connect. They acted like they were going to, but didn't. I am dropping the rating down another star because of this. it is advertised to work and it doesn't. I tried restarting device and router to make sure everything was running at optimal performance. Also, i noticed that my WiFi on one of my devices gets weak. they are both connected to the outlet, so they should have enough power. I may have to go back to google chromecast for my mirroring. plus i can mirror chrome on desktop with chromecast. I'm just a bit disappointed that this feature doesn't work :(######EDIT3:So I gave my other fire stick to my parents. They love it, as they just use it for streaming on netflix. They were using the Wii before, so this was sooooo much better to use. better UI. So if you need a streaming stick, this is it 5 stars. However, if you are a super user like me, it lacks in a few area's to make it a chromecast killer.Do note, that this is the first version, and only a week into using it. So, software and hardware updates may change this little device, and make it even better for super users! Until then, 3 stars.", "verified": true, "helpfulness": "1/1", "author": "Joshua Pack"}, {"rating": 5.0, "review": "Makes it easy to get Amazon's content on my TV. Exactly what I expected.", "verified": true, "helpfulness": "0/0", "author": "bcl"}, {"rating": 4.0, "review": "First, it should be made more clear that this does not just plug into the TV, it also needs  to be plugged into a wall for power. The chord is short like a phone charger, and so is a pain to wire up neatly if you don't want a cord visible. I don't see why this seems better than a box with an HDMI cable connecting to TV... at least that can reach power more easily and be better hidden without having to make use of extension cords (sold separately, of course).... so yeah, that was disappointing.Otherwise the interface looks nice, and it seems to stream pretty nicely compared to my Roku/smart TV.", "verified": true, "helpfulness": "3/4", "author": "Breoghan Ferri"}, {"rating": 5.0, "review": "Superior to google chrome. Won't replace your Apple TV but a solid 'guest room' device. Great execution.", "verified": true, "helpfulness": "0/0", "author": "joe voss \"joevoss\""}, {"rating": 5.0, "review": "Great value", "verified": true, "helpfulness": "0/1", "author": "Chris Senanayake"}, {"rating": 5.0, "review": "Received my fire stick a few days ago. Was extremely easy to set up, just plug it in and download the latest update. I actually had to unplug mine and plug back in to get the latest update, but I believe it may have been due to a slow Wi-Fi on my end. Otherwise has worked perfectly with no issues. Very convenient especially if you have an older TV that doesn't come with internet capabilities and apps.  Remote is small, simple and easy to use. I would recommend it to a friend...", "verified": true, "helpfulness": "1/1", "author": "Sampsen007"}, {"rating": 5.0, "review": "Ultra fast loading and i like the remote. The interface is so smooth. I like how amazons prime services are categorized into tv shows and movies. Super easy to use and not expensive. A must buy for movie and tv enthusiasts. Buy it you wont regret it. Thanks amazon i love the fire stick.", "verified": true, "helpfulness": "1/1", "author": "E.Marrero \"nfamisnme\""}, {"rating": 5.0, "review": "Sweet", "verified": true, "helpfulness": "0/1", "author": "Eric"}, {"rating": 5.0, "review": "love it, it's way better than google chromecast & roku stick, highly recomend!", "verified": true, "helpfulness": "0/0", "author": "Giovanny Viznay"}, {"rating": 4.0, "review": "I didn't give it Five stars because it keeps reminding me to use provided power supply when it is already connected. Otherwise setup was straight forward and using it is a pleasure. The remote that comes with it is intuitive and responsive. I haven't tried the Android app for controlling it, but I have downloaded it and am looking forward to taking it for a spin. Finally a seamless path to my amazon prime video store! Selecting, playing pausing and rewinding easily accomplished from the remote. amazon knocked it out of the park with this!", "verified": true, "helpfulness": "3/4", "author": "Edward Zaffino \"TechGuy\""}]