[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Arguez"}, {"rating": 4.0, "review": "I don't know how to connect surround sound while using firestick tv--no instructions anywhere that I can find--would like to know how to use my sound other than the tv speakers", "verified": true, "helpfulness": "0/0", "author": "Kenneth N. Jordan"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "dan reinhardt"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Anabel Leal"}, {"rating": 2.0, "review": "It would be much better to someone like us if this has a casting capability from web browser like google chrome.", "verified": true, "helpfulness": "0/0", "author": "Nakul"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Kevin Prina"}, {"rating": 3.0, "review": "Two stars off for the design defect in the remote. It took me a half hour to open the battery door and I am clearly not alone (http://www.amazon.com/gp/help/customer/forums/ref=cs_hc_g_tv?ie=UTF8&forumID;=Fx1SKFFP8U1B6N5&cdThread;=Tx2K38CYR2NOH58). How do you mess up something so simple? My fingers hurt.", "verified": true, "helpfulness": "0/1", "author": "EEK \"eek\""}, {"rating": 5.0, "review": "Absolutely awesome! If you love Amazon content, you need this.", "verified": true, "helpfulness": "0/0", "author": "Joshua C Green"}, {"rating": 5.0, "review": "I absolutely love this! It was easy to set up and worked right out of the box. Having the remote is pretty awesome. I'm sure it's easy to download the app to your phone, but it's nice not to have to rely on your phone to work it. I've been a Netflix watching fiend ever since! I'm a Prime member and I hadn't really explored streaming on Prime, but this makes it so easy. Would definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "lovememybargains"}, {"rating": 5.0, "review": "So easy and very cool.  Before getting the Fire TV stick, I used my bluray to stream Amazon and then Roku's, including the Roku stick.  The fire stick so far is the best.  All my Amazon content is there, it's easy to navigate, and the remote features are sleek and fit nicely in my hand.  This was so simple to set up, I took it out of the box, plugged it in, and everything was there.  Very satisfied!", "verified": true, "helpfulness": "0/0", "author": "Genie"}]