[{"rating": 5.0, "review": "Smartest choice I've ever made for tv and film entertainment.", "verified": true, "helpfulness": "0/0", "author": "Katy Rose"}, {"rating": 5.0, "review": "It's Great", "verified": true, "helpfulness": "1/1", "author": "Sherri Hill"}, {"rating": 5.0, "review": "Even better than I expected, A++.Decent remote, Fast speed for navigation. Plays Netflix flawlessly.No voice search on remote though you can install the firetv app on your android phone if you want that feature.", "verified": true, "helpfulness": "0/0", "author": "Dominic Nanni"}, {"rating": 3.0, "review": "Same as Roku  Less Apps.", "verified": true, "helpfulness": "0/0", "author": "DAVID BOYER"}, {"rating": 5.0, "review": "We are really enjoying it!", "verified": true, "helpfulness": "0/0", "author": "sarah allen"}, {"rating": 5.0, "review": "Love it!  But wished I ordered the box.Except for the live sporting events, I now watch FireHD 100% of the time.", "verified": true, "helpfulness": "0/0", "author": "nathan aweau"}, {"rating": 5.0, "review": "Awesome!  Glad that it also has captions", "verified": false, "helpfulness": "0/0", "author": "Marcus"}, {"rating": 2.0, "review": "I own both the google chromecast and fire stick.... The chromecast just works well.  The firestick hiccups during movie playback.", "verified": true, "helpfulness": "1/1", "author": "Dennis"}, {"rating": 4.0, "review": "I have this and a ChromeCast. Chromecast is better for viewing media not approved by our Amazon overlords, but the remote control on the Fire stick makes it the go-to for regular watching.Prime video selection pretty much sucks, so I wouldn't factor that into a buy decision, especially if you already have a Netflix subscription.WatchESPN just seems to work better off my Android phone and thrown at the ChromeCast. In general, I want to think I notice more choppiness in video streaming overall.The remote is nice, but the UI is borderline crappy. I wish there was a way to just show my \"apps\" and hide all that other hoo-ha that nobody cares about. The Android versions of many of the apps just seem to be better realized than the ones on the Fire.All in all, a pretty good gadget. I'm interested in seeing how the new Dish Slinger works when it comes out.", "verified": true, "helpfulness": "0/0", "author": "A. Kenneth Webster \"Ken Webster\""}, {"rating": 5.0, "review": "I love it. I have the Fire TV box in the living room and the Fire TV stick in the bedroom. No big difference between their functionality. I love how well it works for Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Sylvia Haven"}]