[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "GILLIE"}, {"rating": 4.0, "review": "Thanks to the Phone support group, I was able to get my Netflix account to work with your device !", "verified": true, "helpfulness": "0/0", "author": "Marsha Jacklitsch"}, {"rating": 1.0, "review": "Constant buffering makes it difficult to use. I have 2 and both buffer excessively.", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 5.0, "review": "I bought 4 Fire TV Sticks to cut the cable and save over  $100 per month.  The Fire TV Sticks  couldn't have been easier to install and use.  I signed up for Netflix and Sling TV, and we haven't missed any of the junk programming you pay for on cable, but never watch.  With a Fire stick on each TV,  I can go from room to room and pick up where I left off on a program.  I am very pleased with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If you have 5ghz then this will get a better signal than a chromecast, otherwise they are both very similar and it is a toss up on which is actually easier.  If you use Prime and/or want the remote, then this is probably better.  I find chromecast to be easier to use for non-prime apps as the apps are on your phone and tablet.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 4.0, "review": "Love it. Couldn't have been easier to set up. Don't like I wasn't aware that it needs to be plugged in at all times but I think that was almost foolishness on my part. Duh how does it get power? Strongly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Ryan luedtke"}, {"rating": 4.0, "review": "I love it. My son loves the games and finds all the shows he likes to watch. We \"cut the cable\" to save $100 a month and only use the fire stick. However, its a little deceiving that you need to have cable to subscribe to some of the channels. We have only been using for just over a week, so we are still learning but love the features.", "verified": true, "helpfulness": "0/0", "author": "Jori"}, {"rating": 5.0, "review": "Easy to setup.  Love Prime choice of movies available for free.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Cool", "verified": true, "helpfulness": "0/0", "author": "Todd Schrimsher"}, {"rating": 4.0, "review": "Very easy to install. Netflix seems to stream a bit slow and keeps buffering, I am using a wireless connection so maybe that's why. The modem is in the other room and I wanted to use the Fire Stick as wireless. Will keep an eye on this and update more as time passes.", "verified": true, "helpfulness": "0/0", "author": "Marta I. Call"}]