[{"rating": 5.0, "review": "Got my fire  TV stick yesterday and it was so easy to set up after I got the dang back off to put the batteries in the remote.  It came set up with my amazon account and was super easy to operate.  Downloaded my Netflix account too!  Watched prime movies all yesterday and loved it!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"funinthesun\""}, {"rating": 5.0, "review": "works as supposed to!", "verified": true, "helpfulness": "0/0", "author": "Lubna Malik"}, {"rating": 4.0, "review": "The Fire TV Stick is a great Non-Smart TV upgrade or an excellent device to provide you access to Amazon Prime media and much of your favorite media apps (Netflix, hulu plus, etc.)Other such devices as the Roku TV stick and to some degree the chromecast really are slower. I have a chromecast and ive used a Roku TV stick and while they are both great, and the Roku TV stick actually has better support for apps and channels (namely Vudu), the Fire TV Stick is easily the fastest.The biggest issues i had with the chromecast were buffering issues and connection issues. With a 802.11 N dual band wifi module built in, buffering and connections arent an issue. Additionally, changing menu's and scrolling through apps is smooth and seamless.Set up was a snap. If you have Prime, the stick will be set up with your account information out of the box unless you checked the box not to when you purchased the device. After a somewhat unnecessary but none the less helpful video after turning on the device and logging in you have full access to the menu.There are a few downsides to the Fire TV stick. One of which is that since it is an Amazon released product they want you to work within the Amazon eco system. As such, the wonderful voice search only works with Amazon media services. If you want to search something else, for example netflix, you would need to type it in manually...a bit annoying considering there is no keyboard. You can just use a tablet or phone with the Fire TV app, but that still takes away from the ease of use to a small degree. Games support isnt as strong as with the Fire TV, mostly because this is a lower power, lower performance device (fewer CPU cores, fewer GPU cores, Less memory). Not entirely a downside unless you really look forward to playing the games. Personally, i prefer to use a real console or PC as the games are not AAA titles but thats really an opinion. Finally, the lack of support for some Apps (Vudu, real youtube app, etc) are not only a bit frustrating but take away from what the device should be able to provide. There is of course the potential that they could be added in the future but remember, Google and Amazon arent friends...so a good youtube app may never happen. Vudu support is on Vudu, etc.Over all, i would give the Fire TV stick 4 stars. Its a great device, certainly an upgrade from the Chromecast and if you can get it for under $30 its absolutely worth it as a streaming device alone. If youre looking at devices i would automatically discount the chromecast (yes the fire TV can \"tab cast\" just like the chrome cast) simply because of connection issues and lackluster support on that device. The Roku stick would be the closest competitor but if load times and speed are really your thing (as well as decent game support) the fire TV Stick is your best choice.", "verified": true, "helpfulness": "0/0", "author": "Jeff Thomas"}, {"rating": 5.0, "review": "Amazon did a great job with this device. For the price I was amazed at all the hard work they placed into it. By far this is a better choice than Chromecast or Rasberry Pi with XBMC. Games, apps, amazon prime, HDMI, HDMI without power...What more can you ask for at this price!", "verified": true, "helpfulness": "0/0", "author": "Robert Torres"}, {"rating": 4.0, "review": "After 10 minutes trying to get the remote open, I'm aggravated already.  I had to find a YouTube video on how to open the remote.I had to download the initial software update 6 times, and each time it made me re type my wifi key.  The process finally worked after an hour, at least half of which I spent on tech support.  Dear tech support, most people cannot relocate their wifi router to move it closer to the tv.  Using the HDMI extender to move the Stick away from the TV may have been the deciding factor.  The device was registered to me, which made things easy once it finally loaded everything.I was able to watch 2 hours of Hulu without any problem, fingers crossed the rest of the process is as good.  I don't recall any issues like this with my former Chromecast.*** Update 5 days later ... it is working well and integrates with Amazon music so I am able to stream music in my MBR now which is a bonus.  I am happier now that it's all working!", "verified": true, "helpfulness": "0/0", "author": "eyeshop2much"}, {"rating": 4.0, "review": "Was excited to plug in my new Fire TV .  Followed all the instructions.  I agree with another reviewer that the remote was difficult to open for battery insertion.  I hit the play button as directed on screen.  The screen now just says Connect to your network and there is nothing else.  No networks to choose or anything. My network us working fine.  Wasted $20 and too annoyed to mess with it further this evening.Revised my 1 star to 4 stars.  Apparently my big screen TV (which is an off-brand) can't recognize it.  Installed it on my small Samsung and installation went fine.  Guess I'll keep using Roku on the big screen.  I do enjoy the free app for my smartphone allowing voice commands as the remote instead of having to purchase a voice-compatible remote.  The convenience of plugging the stick into the TV works well for a wall-mounted TV.", "verified": true, "helpfulness": "0/2", "author": "Tanya L. Reynolds \"tanyacda\""}, {"rating": 5.0, "review": "Does exactly what it says and for the price you can't beat it.", "verified": true, "helpfulness": "0/0", "author": "Jeff Leonard"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "ziggy"}, {"rating": 4.0, "review": "I purchased 2 firesticks for my HDTVs and I really have enjoyed the speed, festures and ease of use with these.  I have Rokus on my other TVs but can say I like the Firesticks a bit more as it allows you to search by voice using your mobile or tablet devices. I purchased these at Best Buy for $24 each during Black Friday which wasna great deal. I like the use of the remote but I wish volume could be controlled with it as well.", "verified": true, "helpfulness": "0/0", "author": "Carolyn N."}, {"rating": 4.0, "review": "Since it does not work with my TV..I have to give it a 1 star. I have a 42\" TV about 5 years old with 5 HDMI inputs and this doesn't work on any of them. Kind of hard to justify buying a new $1000.00 TV to get a 20 dollar piece of tech to work with it...EDIT: I got it working. I took it to my work, hooked it up to another TV and changed the output resolution from \"Auto\" to \"720P60\". Then took it home, hooked it up and was able to change it back to 1080P60. Now it appears to work perfectly. My Vizio 42\" did not like the \"Auto\" setting.", "verified": true, "helpfulness": "0/4", "author": "Jerry"}]