[{"rating": 5.0, "review": "The Amazon Fire Stick was just the right size and packs a big bang with all the content that it's loaded with. I also liked the fact that it has the capacity to hold a few GB of data that you may want to load on it in the future. I am currently considering buy another one for the bedroom, that way I don't have to unhook the one I have in the Family Room.", "verified": false, "helpfulness": "0/0", "author": "B. Bellamy \"New Mac User\""}, {"rating": 5.0, "review": "works great with kodi, allows me to watch all movies I want online, for free using various apps.  Watched the Rhonda Roussey fight for free, all 34 seconds of it, so it paid for itself right there.  It did stutter during that 4 hours plus of watching UFC 190 that night.  Hasn't happened again so I dont know if it was the streak or what. If you use the amazon system, this thing is a must have.  If you have good wireless router in your home, this thing is a SHOULD have.  With proper apps, you can cut the cable cord for good.  This firestick is so cheap and so amazing that everyone should try it.  Make sure you load kodi or some other streaming media player system, since that is the true greatness of this device.", "verified": true, "helpfulness": "0/0", "author": "fanny hamsteak \"Fanny Hamsteak\""}, {"rating": 5.0, "review": "Love the ease of setup and use.  Great product.  Plenty of options and really effective if you are already an Amazon Prime member.Also greatly appreciate the android app that allows me to link to the TV stick and type my searches.  Invaluable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've had many other devices in the past and this one works the bestlove it", "verified": true, "helpfulness": "0/0", "author": "gordon"}, {"rating": 5.0, "review": "This item is kick ass! It has everything you need for entertainment.", "verified": true, "helpfulness": "0/0", "author": "Dylan P"}, {"rating": 1.0, "review": "It's almost impossible to watch tv without it freezing and hashing", "verified": true, "helpfulness": "0/0", "author": "George Edwards III"}, {"rating": 5.0, "review": "Works just like the regular Fire TV but has no RJ45 (wired ethernet) connection. Runs great on 5G wireless. No issues so far...", "verified": true, "helpfulness": "0/0", "author": "Patrick L."}, {"rating": 5.0, "review": "Are you kidding me?? Best money I could have spent! Love it, love Netflix", "verified": true, "helpfulness": "0/0", "author": "Freckles"}, {"rating": 5.0, "review": "I was amazed at all the features, and content available", "verified": true, "helpfulness": "0/0", "author": "Bobby Davia"}, {"rating": 4.0, "review": "Netflix, Hulu, Youtube, Prime video - all work fabulously. It's a great little device, perfect for travel to hotel rooms (as long as they don't lock down the HDMI ports). It competes quite well with the Roku2 box I bought my Grandma.My only issue is that MLB.TV is pretty spotty with it. Live games are constantly stuttering and buffering. At first I thought it was my internet connection, but my computer could stream just fine. Then I thought it might be the wireless bandwidth, but my laptop was able to stream without a hitch. I borrowed a buddy's blu-ray player and used the app on that over a wireless connection - it also streamed flawlessly.It's kind of sad, since I pre-ordered this specifically to use the MLB.TV app.", "verified": true, "helpfulness": "0/0", "author": "Awelowynt"}]