[{"rating": 4.0, "review": "There is much to love about the Fire Stick - it's small, and brings Amazon streaming to any TV for a very low price. And Amazons selection for streaming are amazing - I love that I can watch a lot of things for free with Amazon Prime, and get Amazon's own shows too, and also that if its not available on Prime I can rent it easily from the same device and service - no jumping back and forth between different apps just to find something. The remote on this device is basic but straightforward and easy to use, though it would be nice if the buttons had better markings or colors, just to make it easier to use. My issues with the stick come down to two; first, the wifi receiver isn't as strong as it could be, and in my case that lead to some connectivity issues. Nothing that couldn't be fixed with some rearranging of the router, but if your wifi isn't strong where you have your TV this could be a problem. Second, the fact that this requires the use of a wall plug is a little frustrating - it would be nice to have it plugged in to one of my TVs USB ports to draw power, but apparently that's not possible. At least that's what the instructions say. Ymmv. Overall it's an excellent product for people looking to \"smarten up\" their TV at a low price. And for Existing Prime members who have only been able to access video on the computer until now. It's a no-brainer. People who have wifi issues should opt for the speedier and more capable Fire TV unit, which not only has better wifi reception, but also supports more gaming options.", "verified": true, "helpfulness": "0/0", "author": "waetherman"}, {"rating": 5.0, "review": "I have used it a few times to watch Prime Videos. The interface is very user friendly. The videos played without a single hiccup. I initially used it powered by the power adaptor as recommended. I then tried it with the USB cord plugged into my TV and that work equally well. The only minor quibble I have with my setup, is that when first switching to the designated HDMI input on my AV system, there is a black screen for about one minute, before the Fire Stick home page shows up. It makes one question whether it's working at all. This happened with every attempt to start it. I do not have that issue with Chromecast when connected to the same input. Other than that delayed, black screen startup, it works really well. The remote works nicely, even though the Stick is buried behind my receiver which is inside a cabinet.", "verified": true, "helpfulness": "0/0", "author": "F. Orlando"}, {"rating": 5.0, "review": "An excellent device. I prefer the Fire TV Stick over my Roku streaming stick. Amazon did a great job by including a training video at start-up. Dongle extender and batteries were included with the Fire Stick device. As one of the first purchasers of the Roku stick I did not get a dongle extender and had to wait weeks before I could use my item while I waited for Roku to ship the part. Kudos to Amazon for making sure buyers have everything they need wihen they open the box!", "verified": true, "helpfulness": "0/0", "author": "Brenda"}, {"rating": 2.0, "review": "The price was good, I got it on sale. Everything else is meh. Alot of the apps need a cable tv/satellite provider to watch content. Ex: watch espn, disney jr, showtime, etc. Maybe it was me who didn't do enough research but i don't see the point of this. Regarding hulu, netflix, pandora, I have those on my phone and gaming console. I bought this thinking more content would be free without subscription to a cable provider or at least be able to view said content with just a cable ISP, but that was not the case. Also it can't be turned off, just put to sleep, must be unplugged to be off. So again i say meh to this product.", "verified": true, "helpfulness": "0/3", "author": "Aldo Galindo"}, {"rating": 5.0, "review": "I am (was) a loyal Roku fan have at least one of each of the models they have released.  I had no intention of purchasing a Fire TV until Amazon recently offered a special introductory price on the Fire TV Stick.  I am amazed at what a great piece of technology this is, in some ways better than the Roku 3.  For example, on Roku, my YouTube channel is laggy, but on Fire TV it moves through channels as fast as I can press the button.  Roku needs to release a new model if they are to keep up.  The Fire TV stick has far fewer apps than Roku but I'm sure that this will resolve in time.  The Fire TV appears to be a little pickier about the quality of the apps they offer.  I think this is wise as Roku features too many apps that are of peripheral interest and not much use to mainstream viewers (it's one thing to offer peripheral apps but another to clutter up the 'New' and 'Featured' sections with these offerings).  Amazon take note.", "verified": true, "helpfulness": "0/0", "author": "D. Barnes"}, {"rating": 5.0, "review": "Works well & right out of the box. Used the USB on my TV to power it. I used a smaller USB cable. TV still fits nicely against the wall with the Fire Stick attached. Got mine for $20, but full price is still a great deal !!", "verified": true, "helpfulness": "74/78", "author": "Mr. J"}, {"rating": 5.0, "review": "Slick little tool, hardware and software is all good. Works best for amazon prime members that have access to all the streaming movie/tv/music service amazon offers now", "verified": true, "helpfulness": "0/0", "author": "William Edword"}, {"rating": 5.0, "review": "Great streamer.  I would love to find a way to stream from my macbook.", "verified": true, "helpfulness": "0/0", "author": "B. Burk"}, {"rating": 2.0, "review": "The main issue with this fire stick is that it's still not convenient to cast from non-Amazon device. It does not support Youtube casting which Roku does well. It does not mirror the device screen. Everything is just of the Amazon system which is good but not good for customers.The search function for what to watch is not good.  You have to manually move the pointer around which is quite inconvenient.I decided to return and stay with my Roku device.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Hien Nguyen\""}, {"rating": 4.0, "review": "Love it. If they get Acorn TV it will probably replace my Roku and get all 5 stars. It matches or exceeds Roku in most other ways, and I am an Amazon Prime member so they have me.  But we love our British shows on Acorn and Roku has Acorn, so until then...", "verified": true, "helpfulness": "0/0", "author": "Dave Johnson"}]