[{"rating": 5.0, "review": "Very affordable - easy to install and use - great to be able to watch Netflix, etc. on our regular TV", "verified": true, "helpfulness": "1/1", "author": "bbayme"}, {"rating": 3.0, "review": "I received this 12/10/14, after ordering it on sale for $19.99. Figured why not? I've been using one of the first Roku's so thought it was time to update. Loved it at first, and didn't see any of the problems others have posted about with dropped connection, etc. The picture quality was outstanding, and I really liked the format of the home screens. The beginning of 1/15 I started to see the same problems. It kept cutting out saying \"no network connection\", and I would have to go through the log-in process all over. My wireless router is only about 15 feet away in the same room so no excuse for not finding the signal. Tried with and without the extender, and tried both HDMI's. The other weird thing I noticed was that normal cable TV started having trouble. It kept having little \"blips\", in that it sort of cut out. Not sure how else to explain it. I didn't think there was a connection but just a coincidence. The Fire Stick has just deteriorated the past couple of weeks to the point of at least once a day it can't find the connection, and even while watching picture quality goes in and out from totally fuzzy back to crystal clear. Sometimes the progress indicator just sits there spinning and won't make it past 25%. I've finally given up and returned to the old Roku until I pick up a newer model. And the cable TV has stopped its \"blips\" so take that for whatever its worth. Haven't talked with CS yet, but I'll drop them a line. I wanted to like this thing but it just didn't work!", "verified": true, "helpfulness": "1/1", "author": "P. G. Marshall"}, {"rating": 4.0, "review": "Love the benefits of the Fire TV Stick and remote. However the remotes needs a number key pad for the children s pass code feature to be effective. Fortunately my son is 2 not 5 years old or it would be a total miss. Also not sure why the Amazon Fire TV has a 5 digit pass code and the Amazon HD kids Edition has a 4 digit password. In short I would love to see both with either a 4 or 5 digit pass code so I don't have to remember 2 pass codes.", "verified": true, "helpfulness": "0/1", "author": "Phillip T. Mathews"}, {"rating": 5.0, "review": "I LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Diane F Pechacek"}, {"rating": 5.0, "review": "I have a smart tv in my living room but have 2 other tv's that are not smart tv's. The fire tv stick is the next best thing. I purchased 2 fire tv sticks. We can watch Amazon movies, NETFLIX, play games, listen to music and more. I have a Google Chromecast HDMI Streaming Media Player which works fine but being a prime member the Chromecast doesn't support Amazon and I had really hoped Amazon would design a product like Chromecast and here is the fire tv stick. Another thing that is great about the fire tv stick is it has a remote control so you don't have to use your phone or tablet to watch movies, music, etc. I highly recommend the fire tv stick but you need to be sure your tv has at least one HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Excellent product. Beyond expectations", "verified": true, "helpfulness": "0/0", "author": "Victor Doebereiner"}, {"rating": 1.0, "review": "If it would stream Netflix without buffering every 5 minutes, I would rate a lot higher, if it streamed Netflix better. I put it next to router same problems. I have had no problems with Apple TV in same locations.", "verified": true, "helpfulness": "1/1", "author": "justin \"justin\""}, {"rating": 4.0, "review": "It's prettying awesome have this FireTV stick plus it has some great stuff, I'm enjoy it so far!", "verified": true, "helpfulness": "0/0", "author": "Mike Tifiano"}, {"rating": 4.0, "review": "Great to use. Easy set up. Could use a little better way to get through the many screens.", "verified": true, "helpfulness": "0/0", "author": "Steven Mooney"}, {"rating": 5.0, "review": "Only had it a week and I'm loving it...can play music while I'm cleaning and catching up on all the shows I've wanted to watch on a big screen instead of just my kindle fire...and the hubby can watch too!", "verified": true, "helpfulness": "0/0", "author": "stask"}]