[{"rating": 1.0, "review": "Not very good. Works with Amazon Prime but not with anything else! Roku works much better!!!!", "verified": true, "helpfulness": "0/0", "author": "Norseman"}, {"rating": 5.0, "review": "Better than Chromecast", "verified": true, "helpfulness": "0/0", "author": "Terry E Adams"}, {"rating": 5.0, "review": "I like it so far.  works perfect and quality is great.  picture quality is awesome.  My only criticism is that I thought it would do more.  Obviously it is my fault for not fully researching this item.  I was going to give it four stars for this reason, however I can only blame myself.  It is priced very well and it does what it states that it does.  This is a five star product.  I must say thank you amazon!", "verified": true, "helpfulness": "0/0", "author": "cngodfather"}, {"rating": 5.0, "review": "Quite impressed with the features of the little Fire TV stick. No lags, no delays, performs as expected and best of all, I have access to all Prime content on my TV!", "verified": true, "helpfulness": "0/0", "author": "NadimC"}, {"rating": 5.0, "review": "I was amazed at what was availible to watch and the clear digital picture.", "verified": true, "helpfulness": "0/0", "author": "WAYNE R. AUPPERLE"}, {"rating": 5.0, "review": "The installation was simple. Installed You Tube in minutes. Couldn't be easier to use.", "verified": true, "helpfulness": "0/0", "author": "Ed from Bay Ridge"}, {"rating": 5.0, "review": "Awesome addition to my digital collection.  Easy to setup and prefer over Apple TV which does allow me access to my Prime membership.  We worth the low cost.", "verified": true, "helpfulness": "0/0", "author": "Timothy Kilpatrick"}, {"rating": 5.0, "review": "So easy! Plug it in, go through the setup and enjoy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Deb Silliman"}, {"rating": 4.0, "review": "Needs Vudu and CBS All Access, but I am otherwise satisfied.  Zippy for a media stick.  Replaced my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Bradley Olinger"}]