[{"rating": 5.0, "review": "Beats most other boxes, hands down.", "verified": true, "helpfulness": "0/0", "author": "Windfall"}, {"rating": 5.0, "review": "Works great and was very simple to install. I will be canceling my over priced cable as soon as I get an antenna to pick up the regular channels with.", "verified": true, "helpfulness": "0/0", "author": "Sarah in AZ"}, {"rating": 4.0, "review": "Nice gadget for my wife to watch Netflix on her tv. Easy to install and play. We are very satisfied with the purchase but took a long time getting here.", "verified": true, "helpfulness": "0/0", "author": "Jack M."}, {"rating": 3.0, "review": "It gets the job done, but I did experience a few things that were less than satisfactory. The first, most annoying issue that I have with it, is the lack of an on/off button on the remote. It's annoying to leave it in idle mode all of the time, especially when your TV had Regza mode and automatically switches to HDMI input if it detects a device that is on.The second issue I had, is that sometimes there is a lag when the pause button is pressed, and on one occasion, it continually paused and played itself without me pressing any buttons at all. I had to unplug it to get it back in track.Third, Amazon advertises the ability to mirror or cast your tablet/phone, but that isn't actually possible without third party applications. I have learned now that Amazon devices can cast without third party applications.All around, I'm dissapointed. But, it does what I need it for. The menu could use some work, and the parental features aren't the greatest.The most annoying thing is that all if the advertisements show the device without a power cord, buy it does require external power. That was really deceptive on Amazon's part, to show it in televisions without the power cord.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Amazing. Great but!!!", "verified": true, "helpfulness": "0/0", "author": "ryan alcantara"}, {"rating": 5.0, "review": "The Fire TV Stick links to my Netflix account much faster than the LAN in my blu ray player.  The menu is simple the set up is easy.  I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "M. Schriver"}, {"rating": 3.0, "review": "Not sure why it buffers so much even with it getting a 50Mbps+", "verified": true, "helpfulness": "0/0", "author": "Aaron G."}, {"rating": 4.0, "review": "I find I have to reset it by unplugging power supply every once in a while.  other than that works great.", "verified": true, "helpfulness": "0/0", "author": "Donald Madsen"}, {"rating": 5.0, "review": "We love our Amazon Fire TV Stick, it was easy to install and it's easy to use. We are considering buying another one to use at our guesthouse.", "verified": true, "helpfulness": "0/0", "author": "LP"}, {"rating": 1.0, "review": "Great product. No free time for my kids which is why I bought it... Terrible idea Amazon to leave this feature out, which set you apart, from this device. Now I have a device that I cannot use. I will most likely be sending it back. Mighty greedy of you to expect people who care about their kids to shell out $99 when you could have added it to you $39 option. Now I will be canceling the free time plan as well.", "verified": true, "helpfulness": "1/2", "author": "Robert"}]