[{"rating": 5.0, "review": "Works very well.", "verified": true, "helpfulness": "0/0", "author": "Thomas Phillips"}, {"rating": 5.0, "review": "I used this fire stick on my 60\" LG tv. Its very clear. You can watch, steam, and download from different apps. My kids love it. I have the Samsung smartTV's in every room but the living room because my LG was bigger. No more cable bill for us. Hulu Plus, Netflix, A&E;, Oxgen, MTV, VH1, Nickelodeon, and Bravo apps. Are enough for us. All you need is high speed Internet and your good to go. The best switch we made. When we have family night me and kids play games, watch movies.  And each day since my kids are of school they even do school work on the fire stick with learning apps appropriate for the next grade level and their age.", "verified": true, "helpfulness": "0/0", "author": "Ladybug Red212"}, {"rating": 2.0, "review": "I'm disappointed because everything I can watch has been recorded and isn't in real-time. Perhaps my expectations were wrong from what I heard but this is like watching a DVR and the old days a VCR.For example, one of my favorite stations is ESPN, and I can't see some of their regular daily programs, forget the actual sporting events.I can go on but why, it is what it is as they say....", "verified": true, "helpfulness": "0/1", "author": "peter redford"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Buzz Cupp"}, {"rating": 5.0, "review": "Fantastic content, incredible easy user interface. Fast set up. Great picture, downloaded app on my phone to use voice activation search. Great buy, highly recommend.", "verified": true, "helpfulness": "0/0", "author": "kapdoubleE"}, {"rating": 5.0, "review": "Very satisfied with it", "verified": true, "helpfulness": "0/0", "author": "tracey raines"}, {"rating": 5.0, "review": "Nice five stars, fire stick is awesome gray picture quality on 720p 1080 p", "verified": true, "helpfulness": "0/0", "author": "Carlos E."}, {"rating": 5.0, "review": "I enjoy it alot", "verified": true, "helpfulness": "0/0", "author": "Anna Zurita"}, {"rating": 4.0, "review": "We love the Fire Stick. We were able to cancel all of the extras on our cable package and get everything we need with this. I was skeptical at first bc aside from the free prime movies we still needed to have a subscription to Netflix. Well, that's not needed to use the fire stick but it gives you more options. And it makes Netflix better by streaming through the tv. Only gave a 4 star review bc the set up was confusing. There was no where to put in your password through the remote with the tv in order to connect to our prime account. Even though it was already supposed to be linked. I had to call customer service to get it figured out.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 4.0, "review": "Great purchase if you are a prime member", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]