[{"rating": 5.0, "review": "Just received it and so far so good. I am Prime so registration was a snap. I used it to look at 2200 pictures on the cloud. Worked great!", "verified": true, "helpfulness": "1/1", "author": "Bruce Thielmann"}, {"rating": 5.0, "review": "Awesome product, fast and easy setup and so much content at your fingertips. I have the fire stick and Chromecast--the fire stick definitely wins between the two given the connection issues that I have with Chromecast (granted that is probably Comcast's fault). The interface is akin to Apple TV and is easy for anyone to use. My only complaint is that the Fire Stick Android app is a little awkward and every now-and-then there is an odd sound when playing music or watching movies.", "verified": true, "helpfulness": "0/0", "author": "ndmertens"}, {"rating": 5.0, "review": "Easy,Fast.", "verified": true, "helpfulness": "0/0", "author": "Dean Smith"}, {"rating": 5.0, "review": "It's not really fair to compare this to the competitors; I'll simply say I have them and may never use them again. Everything I want from a streamer is here. A few reviewers lament the fact you'll need a separate remote for the voice functions, but as I have no intention on allowing my TV to listen in on my activities....The ONLY con I find: Parental controls are either on or off, no options available. I like my searches to be unrestricted, just in case, so I will leave pc off. Yet, now anyone with my remote is able to make purchases...", "verified": true, "helpfulness": "0/0", "author": "Erik Madison"}, {"rating": 5.0, "review": "Dose what is say it will do.  Would buy agaian and plan too.", "verified": true, "helpfulness": "0/0", "author": "wirenut"}, {"rating": 5.0, "review": "A fantastic  little device. I have about 7 brands including smart tv and roku and Apple TV. This one just seems to work best. In fact I got 3 more for gifts.", "verified": true, "helpfulness": "0/0", "author": "poptarts123"}, {"rating": 5.0, "review": "Just love it  so much easer that the chrome. It took all of 5 minutes to load .Agreat deal for the money so glad that I got it.", "verified": true, "helpfulness": "0/0", "author": "linda carey \"linda\""}, {"rating": 3.0, "review": "Works well, but disappointed that an IOS app was placed in the back burner.", "verified": true, "helpfulness": "1/2", "author": "Oscar"}, {"rating": 5.0, "review": "Kids took this over as soon as I put in the Netflix account info. Fast video processing for Amazon Prime and Netflix. It took awhile for some of the game apps to download and it looks like most of them require the game controller for it. It was pretty intuitive to setup and run. My other devices just have Netflix on them so it was good as a Amazon Prime member for us to have a way to watch the Amazon Prime videos.", "verified": true, "helpfulness": "0/0", "author": "Michael John Keady III"}, {"rating": 4.0, "review": "I have been using this for a few days now.  I really like its simplicity.  The UI is great.  Only downside is for best results you have to plug it in.  Unfortunately, I ran out of spots on my surge protector that my whole main system is on and so this has been relegated to the bedroom tv.  I love the Prime membership and the selection of content is really getting robust.  More to follow in a few.  -Cheers", "verified": true, "helpfulness": "0/0", "author": "Adam J. Main \"DJ A-Live\""}]