[{"rating": 4.0, "review": "I love the fire tv stick! It's great getting to watch netflix and youtube on my t.v.", "verified": true, "helpfulness": "0/0", "author": "Gregory R."}, {"rating": 5.0, "review": "We are enjoying the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I got this in the initial sale for $19.99 and it wasn't even worth that.I bought this to use instead of my Chromecast since amazon prime video isn't supported, but I just avoid Amazon Prime Instant Video most of the time so I don't have to deal with the terrible interface included with the Fire TV Stick. The most expensive, overpriced content is pushed to the top and put in your face and it's not easy to find shows you actually want to watch on Amazon Prime, much less across different services", "verified": true, "helpfulness": "0/0", "author": "J.E."}, {"rating": 5.0, "review": "I'm telling every one to switch  to the Fire stick. No more over paying Dish.", "verified": true, "helpfulness": "0/0", "author": "Carol A. Carpenter"}, {"rating": 5.0, "review": "It's really good device!", "verified": false, "helpfulness": "0/0", "author": "bagain \"Slav\""}, {"rating": 5.0, "review": "Absolutely as advertised AND MORE! For the price - an incredible value. The HD extender for hard-to-reach places for connection can cost nearly as much as the entire package. So what does Amazon do? Include it with the kit! Easy set up even for this 74 year old \"not a geek.\"", "verified": true, "helpfulness": "0/0", "author": "Anthony J. Arangio"}, {"rating": 5.0, "review": "Easy to set up, plenty of Apps, good buy.", "verified": true, "helpfulness": "0/0", "author": "Dan Lageman"}, {"rating": 4.0, "review": "I like this product very much.  The only reason I didn't give it a 5 is it's only good for one TV.  So If I want it on multiple TV's it get's expensive", "verified": true, "helpfulness": "0/0", "author": "William Kieper"}, {"rating": 5.0, "review": "Works great for me!.no issues that I have found.", "verified": true, "helpfulness": "0/0", "author": "Kevin G Menzel"}, {"rating": 4.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Govinda Srinivas"}]