[{"rating": 3.0, "review": "Every time I try to enter in my pin number ( I set it up this way so I won't accidently purchase something I don't want) the 3rd 4th and 5th number magically puts in a number by itself!  Super Annoying!  Because I can never watch anything! But amazon is working with me to attempt to fix the problem. So thats why it gets a 3 star. Plus Hulu only gets 1 star because 3 ADS INTERUPTING every 7 to 10 mins of watching shows, slowing down, stopping, because of abrupt ADS!!!! its amazing how the ADS don't slow down, stop, or kick me off! Wack experience! Purchased from prime fire stick. My shows on prime work just FINE! even Netflix off of prime works FINE!.", "verified": true, "helpfulness": "0/0", "author": "Alicia"}, {"rating": 3.0, "review": "I would need to have YouTube to give it higher than 3 stars. Everything else is great.", "verified": true, "helpfulness": "0/0", "author": "S. Crisalli \"Masters Golf\""}, {"rating": 5.0, "review": "made my fiancé's tv watchable.her name is janet. her tv sucks.now when I visit,I bring FIRE.", "verified": true, "helpfulness": "0/0", "author": "russell heuer"}, {"rating": 2.0, "review": "First off, I've cut the cable 4 years ago and have used many other devices. Mostly Roku. The fire stick is OK. I like the layout. But it has issues with keeping connected to my wireless network. It sits about 5 feet from the router and for some reason it just slows down to a crawl and everything starts to buffer. So I have to restart the device then it starts to work OK again for a while. The Roku LT that it replaced never had any issue like that. Maybe I just got a bad one, IDK. But if it keep up I will probably just go out and get another Roku.", "verified": true, "helpfulness": "0/0", "author": "Kristin D."}, {"rating": 4.0, "review": "Pretty dope little guy. Wish I didn't have to purchase almost everything off it though.", "verified": true, "helpfulness": "0/0", "author": "Damariz Medina"}, {"rating": 5.0, "review": "love love love", "verified": true, "helpfulness": "0/0", "author": "Jeannie"}, {"rating": 5.0, "review": "Just got this yesterday.  This thing is awesome. I can watch all my Amazon Prime and listen to Prime Music without being tied to laptop.  Great.  Should have bought this when it first came out.", "verified": true, "helpfulness": "0/0", "author": "Sharon Barger \"driver\""}, {"rating": 3.0, "review": "I was led to believe it would work with my Sony Bravia, so I purchased it. After about 20 minutes of speaking with a tech rep, it was determined that the Fire TV Stick only works on the television in my basement. There is a chance Sony may have software updates available that I could download to make the 2 devices compatible, but I haven't taken the time to research this. So, the reason for the 3 stars (vs 5), isn't due to the product; it's due to the product not being compatible with my equipment, and I was led to believe that it would be compatible.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It's ok", "verified": true, "helpfulness": "0/0", "author": "Djep"}, {"rating": 5.0, "review": "The fire stick was great.Much better than the Google Chrome stick.Would recommend the fire stick to all.", "verified": true, "helpfulness": "0/0", "author": "ANNIE"}]