[{"rating": 5.0, "review": "BEAUTIFUL!", "verified": true, "helpfulness": "0/0", "author": "James Jay Calvin"}, {"rating": 5.0, "review": "Great device! Love it! Getting rid of cable! I had been wanting to try a device like this for quite awhile and I am glad I did. The difference between the picture of the Fire Stick and what cable wants you to have is unbelievable.  I had always thought I had something set incorrectly on my television! Get the Amazon Fire TV Stick, you'll be glad you did.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Jackson"}, {"rating": 5.0, "review": "Awesome possum!", "verified": true, "helpfulness": "0/0", "author": "Ian Bunn"}, {"rating": 4.0, "review": "So far so good. HBO GO is a little choppy but not that bad. Everything else runs well", "verified": true, "helpfulness": "0/0", "author": "Charles D Dietz II"}, {"rating": 4.0, "review": "cool device", "verified": true, "helpfulness": "0/0", "author": "woodchiper"}, {"rating": 3.0, "review": "We've had the Fire TV Stick for about 3 months now and use it 2-3 times a week.The setup was very simple and took only minutes. The interface is simple to use and offers much more than we really need.Our main uses for the Stick are Sling TV and Netflix. While we do have a subscription to Prime, there hasn't been much content that has drawn us there recently.Unfortunately, Sling doesn't seem to work very well on the Stick. It constantly freezes in the middle of streaming, if it ever starts at all. There have been numerous occasions where the app will crash and close in the middle of a show. Because of how Sling works, we then have to re-watch the entire show, since FFoward is not an option. We use Sling on our lap top as well and we have not had any of the same trouble that we have on Stick.The Netflix app has also has some trouble with freezing, crashing, or not loading on startup. Luckily, there has been less trouble with Netflix, and the app allows FForward so that when problems do arise it is less hassle.I cannot be sure if this is really the fault of the the Stick or the app on it. As best as I can tell, the idea of Fire TV Stick is great, but the execution of the build and working with partners has left lots of room for desire.", "verified": false, "helpfulness": "1/1", "author": "IndyGo"}, {"rating": 5.0, "review": "The developer options are cool, since they allow you to install a lot of apps.", "verified": true, "helpfulness": "0/0", "author": "Camilo L."}, {"rating": 4.0, "review": "So far this has been great. Its really great for use with older TV's that don't have built in WiFi. I have Direct TV which technically has YouTube, but for some reason it always loses connection. With this gizmo, its been pretty painless and quick. Also, it helps when you have Amazon Prime Video, as you can watch movies online as well. It can be a bit more streamlined with some of their apps. Wish it had more apps too. But overall pretty good.", "verified": true, "helpfulness": "0/0", "author": "PSaxs"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Samantha Phillips"}, {"rating": 5.0, "review": "I really love this Fire tv stick", "verified": true, "helpfulness": "0/0", "author": "Luciano"}]