[{"rating": 2.0, "review": "I have the Fire Stick and I have AppleTV.  The main problems with the Fire Stick as I see them are (1) it's buggy - my stick randomly sticks (not on the remote itself, but on the television) and the cursor flies up and down wildly.  I have given serious consideration to returning it. It is a better value than AppleTV, and when it works, it works okay, but this has been very frustrating for me.  Also, there is no quick way to put it to sleep.  On the AppleTV you hold two buttons on the remote and it turns off.  The stick requires you to go out of whatever you're doing, into the main menu, and then to settings, and then to another menu, merely to put it to sleep.  There should be a faster way to just turn it off.", "verified": true, "helpfulness": "0/0", "author": "DukeofCs \"DukeofCs\""}, {"rating": 5.0, "review": "Bought this for a gift. The recipients love it!", "verified": true, "helpfulness": "0/0", "author": "Arlene"}, {"rating": 4.0, "review": "I just sat the fire stick up .i\"ll let you know when i go through the setup.  Thank you", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was just as easy as turning on the lights.  I loving every bit of the fire stick, best thing close to sliced bread....lol", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 5.0, "review": "Works awesome", "verified": true, "helpfulness": "0/0", "author": "eileen wunder"}, {"rating": 5.0, "review": "Love. Lots of good freebies. Works well. Starts up promptly. Even has games for the kids. Only thing I miss at times is local channels.", "verified": true, "helpfulness": "0/0", "author": "mcoffey88"}, {"rating": 1.0, "review": "The idea is great but this item doesn't work in our house.  It is constantly loading only playing the movie for very short spurts of time.  Not happy.", "verified": true, "helpfulness": "1/1", "author": "VLM66"}, {"rating": 3.0, "review": "Had a problem hooking up to WiFi on main Tv it was purchased for.All controls are only on the remote,If lost you are Done!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Problems with out internet.  Make sure you have enough bandwidth.", "verified": true, "helpfulness": "0/0", "author": "Judy Lee"}, {"rating": 2.0, "review": "At this point I am not sure...", "verified": true, "helpfulness": "0/0", "author": "Sue Ducato Sarno"}]