[{"rating": 3.0, "review": "Even 3 stars is pushing it. Worse problem is that all the programs are very dark when using the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Lots of good stuff. Very easy to set up. I have Amazon Prime so the Fire TV stick is great. Still, other devices have a greater variety.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"retired geek\""}, {"rating": 5.0, "review": "Absolutely love it!  Can't believe how easy it was to install and the sound and movies/videos/TV shows are just amazing.  Picture on TV is amazing!!", "verified": true, "helpfulness": "0/0", "author": "Cathy Waltrip"}, {"rating": 4.0, "review": "Simple and fast to use. I have fairly slow internet and this device still works fantastically. I would recommend this product over anything else in the market for sure.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "Love fire Stick TV!!", "verified": true, "helpfulness": "0/0", "author": "KrystianSz."}, {"rating": 4.0, "review": "Great device with great price. Lots of apps and media to choose from. However 5 GHZ band support is weak. It can only see my router's 5 GHZ SSID if the channel frequency is fixed (Not auto). Search Google and you will see other people have this problem too. Otherwise the Fire Stick will only see 2.4 GHZ SSIDs. Not sure if it is hardware or software issue, but hopefully Amazon can fix it in software updates (which is automatic).", "verified": true, "helpfulness": "0/0", "author": "Y. Mai"}, {"rating": 1.0, "review": "I bought this product but I can't even use it. It worked for one day. Now it can't connect to my WiFi network. It say connection good but with problems.I have read all about this product and everyone having the same problem. Amazon needs to get the firmware correct. Very disappointed in a company like Amazon to put out a product that has this many problems. I am running the latest firmware and I have tried all the solutions reccomended by Amazon.", "verified": true, "helpfulness": "1/2", "author": "Harry Jones"}, {"rating": 5.0, "review": "I really enjoy it!", "verified": true, "helpfulness": "0/0", "author": "Brenda A Raymond"}, {"rating": 5.0, "review": "GREAT BEAUTIFUL PICTURE HIGH DEF AND SUPER EASY TO USE.", "verified": true, "helpfulness": "0/0", "author": "Kanine01"}, {"rating": 5.0, "review": "great i love it only if i could add apps to it would be outstanding", "verified": true, "helpfulness": "0/0", "author": "Kibbles1st"}]