[{"rating": 5.0, "review": "Absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Andrew Rucker"}, {"rating": 5.0, "review": "Absolutely easiest tech device to install and use.  Does what I want for very little cost.  Like it alot.", "verified": true, "helpfulness": "0/0", "author": "Patrick M. Phillips"}, {"rating": 5.0, "review": "Loved the fire stick. Got it during black Friday and plan on getting more in the future to give as presents.", "verified": true, "helpfulness": "0/0", "author": "Jose M."}, {"rating": 5.0, "review": "5Ghz speed.", "verified": true, "helpfulness": "0/0", "author": "J. Martin"}, {"rating": 2.0, "review": "I was lucky enough to snag a stick for $19, and I'm glad I did.  We have three chromecasts and an Apple TV and they all work perfectly. I had high hopes for the stick, and for the most part it sort of delivers.  Here are the main pros:The interface is slickIt's easy to setupIt works seamlessly with all prime contentHere are the cons:The boot times are super slow - it takes a good two to three minutes to get booted up.  The chromecast takes maybe 30 seconds.  this is especially problematic because the wifi is the last thing to connect, and the stick is useless without it (obviously), so get used to turning on your TV and waiting a few minutes and hoping it connects (see next comment)The stick does not connect reliably to wifi. My router is two feet away, and I've moved both it and the stick multiple times, but still, it rarely connects the first time.  I usually need to go into settings and forces connection.The stick is slow.  It's touted as being fast and powerful, but when the menus and apps take a long time to load, and clicking and selecting feels sluggish, I'm not sure what they use the horsepower for.Finally, the stick is especially unreliable for Plex.  I have to refresh the media servers constantly.  This is not amazons or the sticks fault, the app is buggy.  But the beauty of chromecast and Apple TV is that you control it from your phone.So, all in all, solid effort, needs a firmware update, and apps need to be customized for it, but right now I wouldn't recommend it.", "verified": true, "helpfulness": "0/1", "author": "R. Kumar"}, {"rating": 5.0, "review": "So far this little stick has been great.  You can also turn on developer mode and back load .apks like xbmc to stream from a internal media server.  very cool.", "verified": true, "helpfulness": "0/0", "author": "Aaron Leacock"}, {"rating": 4.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Sandra  Maldonado"}, {"rating": 3.0, "review": "Not very many free movies to watch but i like the amazon music app", "verified": true, "helpfulness": "0/0", "author": "lisa marie"}, {"rating": 5.0, "review": "Our family loves it!", "verified": true, "helpfulness": "0/0", "author": "brittney m. cooper"}, {"rating": 1.0, "review": "Incredibly Disappointed in Amazon & the Fire TV Stick & the Remote & the TV App & the Smartphone AppShipping1) The shipping was a nightmare.Amazon sent the package via FedEx, which has a contract with the US Post Office (as does UPS).Instead of FedEx (and UPS) driving to every delivery address, they use the Post Office \"SmartPost\" service to deliver small, light items that will fit in a regular mail box.http://www.fedex.com/us/smart-post/outbound.htmlThat saves time, money, fuel, etc for FedEx (and UPS) since the Post Office is already going to every address.FedEx drops a trailer of packages off at the Post Office for them to deliver to your mail box.>>> The problem is FedEx will not deliver the trailer to the Post Office until it is full (or some percentage of full, maybe 75% full?).  They do not want to move a large trailer that only has a handful of packages.  So, your package will sit for an unknown amount of time at some FedEx warehouse (called \"hubs\") until it is full enough. I do not think you are not allowed to go to the warehouse to get the package.2) My package sat nearby undelivered for 8 days (Dec 10th to Dec 18th.)In addition, there was six days of repeated scans saying \"In transit to pickup location\" but the package never actually moved from the FedEx Houston warehouse. They were simply re-scanning it.3) While I am not happy about the FedEx - Post Office delivery debacle, I am most mad at Amazon.  I did everything right. I clicked all the provided links to see how the free shipping worked, but they never told me out this \"SmartPost\" service.a) Amazon should provide a link to the FedEx SmartPost web page so I could be a better informed consumer about what the service is.  That way I could decide if I wanted to use it or pay for another delivery option.b) I could have search online (search for \"Post Office SmartPost\") to see what others had said about SmartPost.c) I would have seen the scathing reviews of how terrible the service is and gone a different route.4) They also gave me two different delivery dates, both of which they missed - Dec 11th and again Dec 19th.I feel lied to.  I HATE being lied to.  Do not state a date if you can't actually make the delivery date (baring any natural disasters, of course).  After all, on-time delivery is the business FedEx is in.5) Amazon offered \"FREE No-Rush Shipping (5 business days)  Get a $1 credit for eBooks, digital music and videos. Details\" which I selected.6) I clicked on the Detail link, which says what you get for using the the No-Rush Shipping, but does not say how the shipping service works, i.e. what carriers are used, how long it might take, potential issues you as a consumer may want to be aware of, etc.Detail link:  https://www.amazon.com/gp/help/customer/display.html?ie=UTF8&nodeId;=201635990&pop-up;=1&ref;=ox_shipoption_promodetailsOn the Detail page there is a link to \"Terms and Conditions,\" which I clicked and read.  I gives more information, but still does not say how the shipping service works.Terms and Conditions link: https://www.amazon.com/gp/help/customer/display.html?nodeId=201537730December 20, 2014, 1:56 pm, (redacted) TX USDeliveredDecember 20, 2014, 1:42 am, (redacted) TX USPackage has been transferred to the USPS and will be delivered by your local postal officeDecember 18, 2014, 4:45 am, (redacted) TX USIn transit to pickup locationDecember 18, 2014, 3:51 am, Fedex Smartpost Houston TX USPackage has left the carrier facilityDecember 18, 2014, 3:51 am, Fedex Smartpost Houston TX USIn transit to pickup locationDecember 17, 2014, 4:52 pm, Fedex Smartpost Houston TX USPackage arrived at a carrier facilityDecember 12, 2014, 7:16 am, Houston TX USIn transit to pickup locationDecember 11, 2014, 7:15 pm, Houston TX USIn transit to pickup locationDecember 11, 2014, 7:14 am, Houston TX USIn transit to pickup locationDecember 10, 2014, 7:13 pm, Houston TX USIn transit to pickup locationDecember 10, 2014, 7:12 am, Houston TX USIn transit to pickup locationDecember 9, 2014, 6:59 pm, Houston TX USIn transit to pickup locationDecember 9, 2014, 2:28 am, Nacogdoches TX USIn transit to pickup locationDecember 8, 2014, 2:19 pm, Jonesboro AR USIn transit to pickup locationDecember 8, 2014, 1:54 am, Bloomington IL USIn transit to pickup locationDecember 7, 2014, 7:34 pm, Joliet IL USIn transit to pickup locationDecember 7, 2014, 7:33 am, Joliet IL USIn transit to pickup locationDecember 7, 2014, 7:33 am, Joliet IL USPackage arrived at a carrier facilityDecember 6, 2014, 12:16 am, Fedex Smartpost Indianapolis IN USPackage has left the carrier facilityDecember 6, 2014, 12:16 am, Fedex Smartpost Indianapolis IN USIn transit to pickup locationDecember 5, 2014, 8:24 pm, Fedex Smartpost Indianapolis IN USPackage arrived at a carrier facilityDecember 5, 2014, 5:04 am, USPackage has left seller facility and is in transit to carrierFire TV StickThe Fire TV Stick (the part that plugs into the back of your TV) and the remote (that you hold in your hand) are both clearly a beta version!  It seems like no one tested its functionality.7) The Fire TV Stick often takes 5-10 seconds to react to a button push on the remote.8) The Fire TV Stick is slow to download. You will see the \"waiting icon\" (a circle going around and around).  I recently upgraded from 50 Mbps to 75 Mbps.  My laptop and cell phone connect wirelessly through the same high speed router and high speed cable modem and they both get 75 Mbps or better.  The highest speed so far is 81 Mbps download and 7.5 Mbps upload.9) The Fire Stick remote is a poor design.a) It is too thin in my hand.  It needs more volume/thickness (but not weight) to feel more secure.b) The center \"select\" button is >really< sensitive.  It is to easy to brush it and accidentally select something you do not want.c) The outer ring is used to navigate around the screen (up, down, left, right).  The outer navigation ring is really thin and is so shallow that I am constantly accidentally selecting something (by brushing the center \"select\" button) while trying to move around the screen. It is is incredibly frustrating. I have to constantly go back to get out of what was accidentally selected.10) The Fire TV Stick app on the TV screen is clumsy and awkward.  Since this device was new to me I added a bunch of apps to be able to check them out.  I went into Apps section and added about 10 screen saver apps, 10 games and about 40 channels (Netflix, HuluPlus, Newsy, etc.).11) I do not see any way to re-arrange the order of the apps.  So I have to scroll past the screen savers and the games to get to Netflix and Hulu.  The apps are in order of most recently added to oldest.  Since I added Netflix and Hulu first (making them the oldest by a few minutes) I have to click through about 60 icons to get to the beginning of the list to the Netflix icon.12) You cannot scroll in the reverse direction to wrap around to the first app (Netflix).  The reverse direction simply backs you out of the Apps category to the main Fire TV Stick list (Home, Apps, Settings, etc.).- On my Roku device I can scroll around and it wraps around from the last channel icon back to the beginning one.- On my Roku device the channel icons are displayed as three icons across (so I can move left or right) and stacked in multiple rows of three (so I can move up and down a row of three at a time) with seven rows of three displayed at a time (the row I am on in the middle and three more rows above and three more rows below).  This is vastly more efficient and much more visually appealing than the Fire TV Stick of one long row.13) The Fire TV remote app only lets you search, but not browse through movies and TV shows.", "verified": true, "helpfulness": "0/2", "author": "Beta Tester"}]