[{"rating": 5.0, "review": "Excellent product for the price. Beats the Chromecast. I barely have to use my phone, the little remote is a great step-up in this product line of TV dongles. I would recommend to anyone for home or travel use.", "verified": true, "helpfulness": "0/0", "author": "Pavel Vasilev"}, {"rating": 5.0, "review": "I bought the Fire TV Stick for the promotional price of $20 last month. I have only one regret, that I didn't buy two!The unit works well, no problems so far. What was neat was, using the supplied remote to get the unit on, is that somehow this little device \"sensed\" my TV remote and I was able to use it to navigate the menu's on the Fire TV Stick.I have no issues to report on this review for Amazon's Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Sourdo \"Russ\""}, {"rating": 4.0, "review": "This was pretty awesome and simple to set up...super fast response in use, fairly simple to use interface and remote. My one complaint is more with Prime, but there needs to be more options with Parental control. we bought this primarily for our kids playroom because we are getting rid of Satellite. If I want to to activate Parental controls for Prime our 5 digit code has to be entered every time they want to watch a new show, even with Childrens programs. There doesn't seem to be a way to set it to where you only have to enter the code if the show is above PG. Even better it'd be great if you could also have the option to block certain shows even inside their allowed parameter. If that were possible this would get 5 for sure.Out of the box to play was less than 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "Laura Frederick \"Zaxmom\""}, {"rating": 5.0, "review": "This product is awesome. My tv is already smart. It has WEBOS operating system in it. But It made my TV way smarter than before.", "verified": true, "helpfulness": "0/0", "author": "Recep Erdogan"}, {"rating": 5.0, "review": "Excellent...sent Roku back - the fire Stick has done everything that thead says it will do...very impress", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"greatescape\""}, {"rating": 1.0, "review": "Works sporadically.  Always says check network connection???  Nothing wrong with network connection.", "verified": true, "helpfulness": "1/2", "author": "Valerie J Keogh"}, {"rating": 4.0, "review": "I like it! Still getting use to it! So far so good.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 5.0, "review": "Although I have not fully used the stick to its fullest. I am very satisfied", "verified": true, "helpfulness": "0/0", "author": "Emmanuel St Jean"}, {"rating": 5.0, "review": "Purchased a launch day version and couldn't be happier. It is quick to respond and boot videos.", "verified": true, "helpfulness": "0/0", "author": "Mandy Zaransky"}, {"rating": 1.0, "review": "TOTAL WASTE OF MONEY! I purchased this item to view my small screen on a large screen - laptop PC to TV screen.  This only works if you have an Amazon type electronic devise for your small screen, like a Kindle.  This is a total waste of money as it does not work from a laptop PC.  I will probably never use this item.", "verified": true, "helpfulness": "2/4", "author": "john bryant"}]