[{"rating": 2.0, "review": "I have to frequently restart the fire tv stick or my video play back from hulu, netflix, and amazon prime instant video will lag and skip and randomly just stop playing all together. It isnt an issue with the wireless as it is in the same room as the wireless access point and every other device works fine on wireless", "verified": true, "helpfulness": "0/0", "author": "skyler"}, {"rating": 4.0, "review": "seems to be working pretty well even though I am far from learning all that it can do. use it with my tv that is not a smart tv in my camper. some camp grounds that I stay at offer wifi but not cable. this one has no tv signal or cable but the fire stick has worked well enough to have some entertainment", "verified": true, "helpfulness": "0/0", "author": "mac"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Donna Carr"}, {"rating": 5.0, "review": "Good Stuff just wish it had Crunchyroll", "verified": true, "helpfulness": "0/0", "author": "DustinChurch"}, {"rating": 5.0, "review": "The Amazon Fire Stick has met and exceeded my expectations thus far!", "verified": true, "helpfulness": "0/0", "author": "Nich"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Nessy"}, {"rating": 5.0, "review": "Bought it used it one time now I can't get the kids off it, easy to use lots of options and everyone loves the remote", "verified": true, "helpfulness": "0/0", "author": "Karen G"}, {"rating": 5.0, "review": "We love  it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Travel with work a lot and this is great;  simple to store, setup and use.  plenty of TV and movie apps for those who want more than the standard ones (Hulu, Netflix, Amazon, etc.) I use to stream my Slingbox 500 from home to wherever I am.", "verified": true, "helpfulness": "0/0", "author": "Brian Phillips"}, {"rating": 5.0, "review": "It works great no issues and delivered on time.", "verified": true, "helpfulness": "0/0", "author": "James Schimmels"}]