[{"rating": 1.0, "review": "I love the fire stick tv..however the remote quit working after a month. I bought a new one to replace it and that will not arrive for a week! So much for 2 day shipping.", "verified": true, "helpfulness": "0/0", "author": "michelle"}, {"rating": 3.0, "review": "This thing is great, but has one incredibly annoying flaw, it loses my wifi, sort of locks up, and needs to be restarted.  I've had it since day 1, and have to reboot it about every 3rd time I use it.  Other than that issue, when it's working, it's great.", "verified": true, "helpfulness": "0/0", "author": "bcstyle"}, {"rating": 5.0, "review": "This is the best $40 bucks I've spent in a long time.  It took a while for it to be in stock, and my dumb self kept waiting for it to be in stock to buy it.  I wised up to that and just pre-ordered it.  So glad that I finally did!It did take a while for all the apps to actually load. And once it loaded I had some issues with netflix not loading.  It was an easy fix once I googled the issue.  Apparently it's pretty common.  You simply have to clear the data in the apps manager.  Unplug it for a few seconds and WHAM! fixed.I've been recommending this to everybody.  I may even go for the fireTV now that I know I like this little gadget!", "verified": true, "helpfulness": "0/0", "author": "Ashley Anne"}, {"rating": 1.0, "review": "For spamming my notification bar with an ad for this.", "verified": false, "helpfulness": "0/0", "author": "Cordite"}, {"rating": 5.0, "review": "This allows us to leave cable behind.  Super", "verified": true, "helpfulness": "0/0", "author": "David P. Scherer"}, {"rating": 5.0, "review": "This thing is awesome if you do not have a smart TV. I canceled my cable because I started just watching this with my amazon Prime. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "User"}, {"rating": 2.0, "review": "not enough free programsjesse stone is an example", "verified": true, "helpfulness": "0/0", "author": "Ronald Niper \"nip\""}, {"rating": 3.0, "review": "The device itself is awesome! Got mine for $20 as a Prime member when they launched and it does so much! Now, for the not so awesome part... My biggest gripe with the Fire TV Stick is getting it a solid internet connection. The WiFi strength of the Fire TV Stick isn't comparable to the WiFi strength of my phone. In my media room, my Galaxy S5 has a solid internet connection and can stream movies off Amazon, Netflix, etc. However, the Fire TV Stick won't even see I have WiFi in the media room. When I move it to the living room (really close to the WiFi router!), it gets an internet connection, but it doesn't seem blazing fast and movies will stop to buffer at times while other devices can watch a movie in the living room with no problem. With the small form factor, I understand an ethernet jack is out of the question, but you could at least engineer a device with WiFi as good as a typical smartphone! I continue to use my Fire TV Stick because it really is convenient and it does a great job when it has signal.", "verified": true, "helpfulness": "0/0", "author": "steven pink"}, {"rating": 1.0, "review": "This thing stops all the time and often gives blurry images because it is not fast enough ... or not enough memory maybe.", "verified": true, "helpfulness": "0/0", "author": "T"}, {"rating": 5.0, "review": "love this new gadget.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]