[{"rating": 5.0, "review": "Love, love, love!!! Would definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Angela \"Angela M Brandon\""}, {"rating": 1.0, "review": "Wasn't able to get any of the channels I thought I was going to get.  I needed to already have some kind of cable tv or satellite, just having my internet didn't get me anything.  I was hoping that was the whole point of this thing.  Returning it.", "verified": true, "helpfulness": "2/3", "author": "Jean Landry"}, {"rating": 5.0, "review": "I'll be honest, I had no idea what the Fire Stick was before I bought it. I was simply looking for something that let me stream my new Kindle to the TV like my first generation Kindle could- with a mini USB to HDMI. I had no idea the Stick would replace that, (I am in my 20's and not tech savvy at all). The FireStick is amazing! I use it almost daily to listen to Pandora or watch Netflix and HBOGo and it still gives me full use of my Kindle at the same time. I would have paid double for the ease and convenience, it is another great Amazon product.", "verified": true, "helpfulness": "1/1", "author": "Sarah Gorman"}, {"rating": 5.0, "review": "Does everything I want it to do. Easy to setup and use. It's nice that it connects to your wifi. The only complaint I have is that it has a power cord you have to plug in, other than that it is a very convenient way to watch Netflix, hulu, amazon prime, and so on.", "verified": true, "helpfulness": "0/0", "author": "D.J. Lewis"}, {"rating": 5.0, "review": "Works good for me", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "Anybody playing Clash of Clans? This is really amazing! Visit [...] It really works! (Gcb4v)Fire tv stick is great! Love it.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The sound is CRAPPY for music, but I'll figure out my next move for that.  Otherwise I LOVE IT I LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Julie Lorenzo"}, {"rating": 2.0, "review": "Ties in very well to Amazon Video and app store.  However, no Vudu App and no Time Warner TV app limit it's appeal.Replaced this with Roku Stick, which has both and moved the Fire Stick to a not used very often TV.", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 3.0, "review": "I WISH IT WOULD FIT MY AMAZON FIRE TABLET.", "verified": true, "helpfulness": "0/0", "author": "Fred Piraro"}, {"rating": 1.0, "review": "I recently got a free Fire Stick with my subscription with Sling TV. I figured it would be a good way to stream entertainment in my bedroom, I have a PS3 in the living room, but I'm sorely disappointed. The Fire Stick is slow, logs off my internet randomly, and refuses to play my MLB.TV app (it pauses every two seconds then quits). MLB.TV works perfectly on my PS3 in my living room which is literally 15 feet away, so I know it's not a problem with my internet speed. So far I'm not a fan of this product. I'm just glad it was free, I just wish I opted for the free Roku Stick instead. My father has two Rokus and has never had a problem with either of them.", "verified": true, "helpfulness": "1/1", "author": "gmax86"}]