[{"rating": 3.0, "review": "bought this a while ago but we have to turn off all wifi on other devices in order for this one to work a little better... we really enjoy it when it works and hate it when it doesn't.", "verified": true, "helpfulness": "0/0", "author": "Brenda Cooper"}, {"rating": 5.0, "review": "Simply great!  Easy to install and connect. My four year old tv is now a smart tv. Love it!", "verified": true, "helpfulness": "0/0", "author": "donnani4os"}, {"rating": 5.0, "review": "I got this on Prime Day and haven't looked back since! I love Netflix on the TV and Hulu is always good too! Haven't explored much beyond that but works great", "verified": true, "helpfulness": "0/0", "author": "Andrew Bourg"}, {"rating": 5.0, "review": "Everything I absolutely love about the Fire Stick.  Only thing I wish it had was the SciFi channel!", "verified": true, "helpfulness": "0/0", "author": "Nikic"}, {"rating": 2.0, "review": "Not too happy with this. It's fine for about 30 minutes on Netflix, then it's the circle of doom at 25% loading and will not load any further. It's not the Wi-Fi router. When using the RGB cord and running off of the laptop, Netflix is absolutely fine. Sooooooo, not too sure about this little tool.", "verified": true, "helpfulness": "0/0", "author": "Madalyn Andeson"}, {"rating": 4.0, "review": "so far so good, waiting for the service to grow. For a newer streaming service it's off to a great start.", "verified": true, "helpfulness": "0/0", "author": "WDC \"SciFi Fan\""}, {"rating": 5.0, "review": "Brought this to Hawaii and it was ready to go and already registered to me when I plugged it into the TV.  Made late night binge watching oh-so-easy!  Great for the kids too.  We have a subscription to Netflix already, so just needed to log in and it was ready.", "verified": true, "helpfulness": "0/0", "author": "Erin Volz"}, {"rating": 5.0, "review": "I am an Amazon Prime member, so this has been a great addition for me.  I have access to so many wonderful programs with my Prime membership.  Can't imagine why it took me so long to make this purchase.", "verified": true, "helpfulness": "0/0", "author": "Kelly M."}, {"rating": 5.0, "review": "Great! No complaints.", "verified": true, "helpfulness": "0/0", "author": "etwh9 \"etwh9\""}, {"rating": 5.0, "review": "Our family has enjoyed this very much. Good bye overpriced DISH network!", "verified": true, "helpfulness": "0/0", "author": "Margaret Smyth"}]