[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Frank J. Pensabene"}, {"rating": 4.0, "review": "Waitting for HBO, and also more applications", "verified": true, "helpfulness": "0/0", "author": "vano200571"}, {"rating": 4.0, "review": "Haven't used it much yet but looking forward to exploring the many options presented.  Hoping to be able to ditch high cost cable.", "verified": true, "helpfulness": "0/0", "author": "Kathie Sybrant"}, {"rating": 5.0, "review": "It's a cool gadget. You have to pay for everything though but.. That's the way most devices like this are.", "verified": true, "helpfulness": "0/0", "author": "Abelardo Rodriguez"}, {"rating": 5.0, "review": "Does exactly what I need.", "verified": true, "helpfulness": "0/0", "author": "Russ V."}, {"rating": 3.0, "review": "Work well for what it is.", "verified": true, "helpfulness": "0/1", "author": "Fred Lewis"}, {"rating": 2.0, "review": "Our family has owned the Roku LT streaming media player for a couple of years now. That unit, although slow now, with the occasional needing of a reboot (I blame that on it's age, at this point) once or twice a year, is leagues ahead of the poor experience that I've had with this thing. Let's break down the issues:1. Buffering/stuttering: The amazon fire tv stick buffers a lot, even on content that the Roku has no problem with. This is even though the Fire TV stick is twice as fast with it's processor. I'm not sure what the deal is, but my friend has the Fire TV (not the stick) and he says the same about the buffering. It's terrible.2. Dropping my internet connection:  I NEVER have had problems with our connection dropping on the Roku. The Fire TV stick has dropped our connection several times. I've checked everything else out, as we have several other devices connected wirelessly, but the TV Stick seems to be the culprit here.3. Had to pay for an app that was free on the Roku. Seriously? Our family loves to use the Plex app for watching our home videos from our computer. This app is totally free on the Roku and works great. Amazon Fire TV stick? It's not only 4.99 for the app, but it also crashes constantly. Totally a waste of money.The conclusion for me is that this device is not yet ready. Don't get me wrong, I LOVE Amazon. We have prime and have been users of it for a few years. I probably drop most of my money into Amazon all year long, but this device is just a big letdown to me. Our family is strongly considering purchasing a newer Roku player that is a bit faster than our out-dated LT model. If you are looking at the Fire TV Stick, I'd have to say that waiting a bit might be a good option. Sure, it's pretty cheap, but for 20 more dollars, you could have a great ROKU device that just works so much better.", "verified": true, "helpfulness": "1/1", "author": "Albert Jurina III"}, {"rating": 5.0, "review": "Relatively easy to use.", "verified": true, "helpfulness": "0/0", "author": "James Craft"}, {"rating": 1.0, "review": "I bought the fire TV stick mostly so I could use the watch ESPN app. But it turns out that I can't use the app at all. When the app asks you to sign in with your provider, Charter is not an option. I can't use the Watch ESPN app so the stick is 100% useless to me", "verified": false, "helpfulness": "1/1", "author": "leah lukens"}, {"rating": 5.0, "review": "Easy to set up, easy to use, so far really enjoy using it.  Been using this much more than cable TV shows.  100% happy with purchase.", "verified": true, "helpfulness": "0/0", "author": "Stephen R. Shelley"}]