[{"rating": 4.0, "review": "I really like the Fire TV stick.My Amazon Prime movies & shows load up faster than the Amazon app I have on my smart tv.It's easy to navigate with the remote that comes with it.The only thing I don't like is the games apps.There isn't any great games to choose from.I have a few nice ones on my Kindle Fire but they were not compatible with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "~ Judi ~"}, {"rating": 5.0, "review": "Amazed by ease of use", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Product is good. The only drawback is loose batteries​ inside.", "verified": true, "helpfulness": "0/0", "author": "Yeqifan"}, {"rating": 3.0, "review": "For what it was designed to do, it works well, I bought it under the assumption that it worked like the Chromecast device, it doesn't, I thought I could pair it up with my Androide tablet and have it transmitted to the TV, Didn't work, but other then that it works mush like the roku device, I have that as well as the chromecast really didnt need the fire tv stick. would i have bought it if i new it didnt work, No, the Chromecast  is really what i wanted it to do.", "verified": true, "helpfulness": "0/0", "author": "keystarm"}, {"rating": 2.0, "review": "Don't waste your time on this one. Get the Fire Box just for the quad processor and less heat.  The TV Stick gets too hot", "verified": true, "helpfulness": "2/2", "author": "JoeFern"}, {"rating": 5.0, "review": "Works great, a must have if you are an Amazon prime member. Very simple and easy to set up. The remote works really well.", "verified": true, "helpfulness": "0/0", "author": "carey tanaka"}, {"rating": 5.0, "review": "This is such a great device, never have to get cable or satellite t.v. again!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Tracy L. Redwine"}, {"rating": 1.0, "review": "I have used a Google Chrome stick for about 2 years I decided to give the fire stick a try so that I could get amazon streaming video as well.  The device is unreliable and constantly freezes I've gone back to my Google Chrome stick.", "verified": false, "helpfulness": "0/0", "author": "TaTAylor"}, {"rating": 5.0, "review": "As advertised, no more chromecast, the remote works great.", "verified": true, "helpfulness": "0/0", "author": "Arnold B"}, {"rating": 5.0, "review": "Works great with it's own remote, also with my Galaxy 5 phone remote and also 7inch fire HD remote", "verified": true, "helpfulness": "0/0", "author": "Francis C Klauder"}]