[{"rating": 3.0, "review": "it was very easy to install, however, i have to return it because my internet is not the greatest and all it would do is buffer when i tried to watch a movie. so im really disappointed in that!", "verified": true, "helpfulness": "0/0", "author": "julie l. fogle"}, {"rating": 5.0, "review": "Met all my expectations considering I already have a couple of regular Firetv, they still have a lot of catching up to do with content to beat Roku.", "verified": true, "helpfulness": "0/0", "author": "dcbag"}, {"rating": 4.0, "review": "I like it. It's not bad, but I prefer Apple TV.  I prefer how Apple TV integrates with all the other computers and iOS devices in my house. The bluetooth remote on this is superior, though.The interface is okay. Prime Movies work well. Netflix looks good.It's not just a stick though. It's a stick with an outlet that attaches to a cable cord. It's hard to hide on the side of a TV. We have ours plugged in directly to our Onkyo Receiver input which works well.", "verified": true, "helpfulness": "0/1", "author": "Noah Fleming \"Noah Fleming\""}, {"rating": 4.0, "review": "I cant't use in dominican republic", "verified": true, "helpfulness": "0/1", "author": "Miguel Morales Guzman"}, {"rating": 3.0, "review": "Unable to maintain reliable wifi connection to be able to stream. Used the HDMI extender as suggested in the manual but still not strong enough signal. Will update the review/rating if I get it resolved. Other wifi devices work fine in the same location", "verified": true, "helpfulness": "0/0", "author": "John Larson"}, {"rating": 4.0, "review": "What a bargain this little late-comer is AND I can now watch all the Amazon Prime!", "verified": true, "helpfulness": "0/1", "author": "D L Martin"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Frank rocha"}, {"rating": 5.0, "review": "Amazon did a great job on this,quick easy set up and streams movies really fast with a great picture! Thanks!", "verified": true, "helpfulness": "0/0", "author": "Duane Lockard"}, {"rating": 2.0, "review": "ok so I can watch my amazon prime on this fire tv stick but otherwise I really like my apple tv. I leant my fire stick to my niece. She came to the same conclusion.", "verified": true, "helpfulness": "0/1", "author": "Jonathan Young"}, {"rating": 5.0, "review": "Easy to use and love the vast selection choices available!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]