[{"rating": 1.0, "review": "Locked up multiple times.  Disconnected from my WiFi network multiple times.  Took 1 hour to upload new software then needed to be reset and power cycled to work again.  Next power cycle, my TV was completely dark, no buttons worked... pulled out the \"stick\" and everything was fine.  I finally got it to work and got the menu up, then another power cycle and nothing.I have 2 TVs, blu-ray player, and Tivo all running flawlessly on the same WiFi network with no issues.  The signal strength in the tools menu is \"Very good\".UPDATE: Spoke to Lily in Amazon tech, there is a known issue with the dropping network connections.  They will get back to me within a week, let's see how that goes!", "verified": true, "helpfulness": "3/5", "author": "Daver"}, {"rating": 5.0, "review": "Sweet deal for $19.  It works great, although it took a bit to get on my Wi-Fi.  It also took a long time to update.  However, it was worth it.  It works very well and the content is decent from Amazon Prime.  You can also link your other subscriptions to it.", "verified": true, "helpfulness": "0/0", "author": "Bunson Honeydew"}, {"rating": 1.0, "review": "I wanted this to work. Finally a mix between chromecast and the Roku. It has great app availability but it just simply doesn't work. It needs to be sitting right next to the router and even then the connectivity is barely there. There are plenty more reviews on here that are well worded and detailed, thats the basic gist of it.", "verified": true, "helpfulness": "3/5", "author": "Desiree"}, {"rating": 3.0, "review": "I've been playing with the new Fire TV Stick for several days now, comparing it mostly to the Roku Player, Roku Stick, and Chromecast.  The interface is nice, it seems well built, but overall I'm less than impressed.  My biggest complaints:The good:-Nice UI, easy to navigate-Cool little remote, which is easy to use-Featured Amazon Prime content is really nice-Good selection of apps available from the startThe bad:-Wifi tends to drop on occasion (using the TV for power or directly plugged in as recommended)-Someone decided it would be a good idea to put the USB port that powers the device on the side of the stick instead of at the end like every other device I've used.  This takes up alot of space when you have several things plugged into the TV-Netflix and Hulu Plus app tend to stutter on occasion - I thought initially it was a networking problem but no other devices (Smart TV app, Wireless Computers, Roku Stick, and two Chromecasts) have this problem-Plex app is not free as it is on Roku, I believe it costs about $3 to purchaseThe ugly:-Plex playback is horrible.  It stutters, for me at anything over 1mbps, and at 4mbps it's unwatchable.  Every other device streams Plex at at least 4mbps (most are usually set higher than that) and work flawlessly.  Tonight I actually unplugged the thing and went back to using a Chromecast in it's place (with no problems what so ever).  Looking online at the Plex forums, it looks like several others are having the same problem.In the end, for the $19 I gave for it I'll bring it to work to use for Netflix, Hulu Plus, and Amazon Prime.  Before paying full price for it, I'd strongly recommend looking at the Roku Stick or Chromecast.", "verified": true, "helpfulness": "5/5", "author": "nuggib"}, {"rating": 5.0, "review": "Very easy to set up and I am really liking it!", "verified": true, "helpfulness": "0/0", "author": "jonald"}, {"rating": 2.0, "review": "I was very disappointed that it doesn't work with the iPhone yet. That was the main reason I bought it. It was faster than the chromecast and cheaper. Plus, it was supposed to mirror the iPhone. So I am not happy with it at this point.", "verified": true, "helpfulness": "0/2", "author": "Frank"}, {"rating": 5.0, "review": "I bought the Chromecast not too long ago as an inexpensive means to get some streaming options on an older TV in our bedroom.  This fire TV stick was announced just before time was up for me to return the Chromecast.  I'm glad I switched.  This thing is much more powerful than the Chromecast.  The interface is very fast and responsive, but you can't even really compare that because the Chromecast doesn't even have an interface.  If your phone or tablet isn't handy, the Chromecast is absolutely useless and it's only marginally cheaper.", "verified": true, "helpfulness": "0/0", "author": "Jason M. Williams"}, {"rating": 4.0, "review": "Really loving the product. But missing HBOGO??? Hoping this will be added to the services soon!", "verified": true, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 1.0, "review": "Difficult to understand interface. Kids purchase movies with out consent. No request to enter password before purchase.", "verified": true, "helpfulness": "0/2", "author": "Shashi"}, {"rating": 4.0, "review": "Very disappointed. This thing was easy to install, update, and run. Then I tried to get Netflix and it's totally locked up, as in non functional. Obviously, this product was rushed to market and not very well thought out. I'm a big Amazon fan, but this is a terrible way to bring a new product to market.EDIT TO ADD:I finally wanted to spend 5 minutes with this STICK to see what the issue was. I did it just now. EXCUSE THE CAPS, BUT YOU WILL WANT TO KNOW THIS STUFF. VERY IMPORTANT!!!!!!!!OKAY, SO WITH YOUR STICK POWERED ON, REMOVE THE BATTERIES FROM THE REMOTE, AND REPLACE THEM. THAT LITTLE TRICK RESETS THE ENTIRE SYSTEM. ALSO WELL WORTH NOTING, AND I NOTICED THIS WHEN PUTTING IN PASSWORDS. THE REMOTE TENDS TO DOUBLE CERTAIN CHARACTERS AS YOU INPUT YOUR INFORMATION. SO, PAY VERY CLOSE ATTENTION TO WHAT'S GOING IN AS YOU INPUT THE USER NAME AND PASSWORD. MINE WORKS PERFECTLY NOW.i AM DEDUCTING ONE STAR FOR LACK OF CLEAR INSTRUCTIONS. THAT SAID, JEFF BEZOS IS ONCE AGAIN MY IDOL. I KNEW HE WOULDN'T LET ME DOWN. SO TRY THIS, AND GOOD LUCK.TO THE REVIEWERS THAT ARE COMPLAINING BECAUSE YOU DIDN'T KNOW YOU'D NEED A CABLE PROVIDER, REALLY????? COME ON. NOTHING IN LIFE IS FREE.ALL HAIL AMAZON AND JEFF BEZOS", "verified": true, "helpfulness": "0/1", "author": "Haywood \"Haywood\""}]