[{"rating": 5.0, "review": "Awesome Product!! Very easy to use and setup. My 5 year old twins can use it and are so excited they are big kids and can use the remote and watch whatever the want. Don't worry it has great parental controls as well.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "The Fire TV Stick is an excellent product.  However, the buffering takes a little more time than expected. But that is due to the dual core processor it is equipped with.  This product is great for individuals that don't want to spend the extra money in upgrading to a smart TV or constantly having to use other devices to access apps like Netflix and Hulu.", "verified": true, "helpfulness": "0/0", "author": "Jakeenan Williams"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Janaina Ramos"}, {"rating": 5.0, "review": "its awesome if you sign up for amazon prime", "verified": true, "helpfulness": "0/0", "author": "Dawn Moore"}, {"rating": 5.0, "review": "Works great, although at first I could not get Netflix at a proper speed to watch -- it took about a day for the device to adjust so that Netflix could run at full speed.  I'm delighted with the interface and ease of use, also that the price was very reasonable.", "verified": true, "helpfulness": "0/0", "author": "nom de plume \"nom de plume\""}, {"rating": 5.0, "review": "Love it.  Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kris"}, {"rating": 5.0, "review": "great device, as expected from Amazon. Great human interface", "verified": true, "helpfulness": "0/0", "author": "Edward J Powers"}, {"rating": 5.0, "review": "the remote was the only problem, extremely difficult to open to load batteries.", "verified": true, "helpfulness": "0/0", "author": "Mary Romanyshyn"}, {"rating": 5.0, "review": "totally awesome", "verified": true, "helpfulness": "0/0", "author": "B. Carlo Peratoner"}, {"rating": 1.0, "review": "Cannot use the device. It connects to the Internet less than 50% of the time, and then drops right away. Have tried multiple locations and multiple wifi hubs, so it is a device issue, not an operator error.", "verified": true, "helpfulness": "1/1", "author": "Stacey Hormann"}]