[{"rating": 5.0, "review": "I love my Fire TV Stick! It's small and conveniently hidden behind the TV but still very powerful. Videos start very quickly and play smoothly. Setup was a breeze. I definitely recommend these over other streaming players on the market.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works well, my first foray into the Android ecosystem.  Was concerned about wifi bandwidth since my TV is upstairs and router is downstairs, but have not had any issues.  Enjoy the access to Hulu, Netflix, Amazon Prime Video, and ability to sideload XBMC to stream content from my NAS.", "verified": true, "helpfulness": "0/0", "author": "Wallace Printz"}, {"rating": 4.0, "review": "I am LOVE The Fire Stick, you really need to take the time to go through all of the apps and such, but it is such a great tool and is saving me a TON ov money!It's cool", "verified": true, "helpfulness": "0/1", "author": "Darlene A. Schnidt"}, {"rating": 5.0, "review": "This works really well.", "verified": true, "helpfulness": "0/0", "author": "on the go teacher"}, {"rating": 2.0, "review": "While every other one of my devices works effortlessly using the wifi in my home, the fire stick regularly loses connection.  When the fire stick displayed an error message (wouldn't stream image but the sound continued playing), I went to the internet and found that many people experienced the same problem.  I am not a fan of the skip ahead/fast forward feature.  With a Roku on every other TV in the house, I would be more likely to go for that option again in the future.  I do like the tiny format, easy plug-in, and the fact that everything needed to operate the fire stick was included.", "verified": true, "helpfulness": "0/0", "author": "Christopher Simich"}, {"rating": 4.0, "review": "I have so far only used it with Pandora,  but I love it,  it's quick and easy.  I one gripe is that in order to put it to sleep you have to scroll through the entire menu to turn it off.  And then to turn it on you can push any button.  Not a fan of that.  I wish instead you would need to hold a button to turn it on or off.Other than that this is a huge saving grace,  the fire tv was just too expensive,  this is awesome.", "verified": true, "helpfulness": "0/0", "author": "Jade Stewart"}, {"rating": 5.0, "review": "We've been using the Fire TV stick for a couple of weeks now and we really like it. It is easy to use, easy to install and the Netflix streaming has worked great, even though we have rather slow internet. We use this product on a Vizio tv in our bedroom for Netflix and Amazon Instant Video.My only complaint with this is that you have to do a software upgrade right away when you get it. With our slow internet, this process took 2 to 3 hours. It initially told us that it couldn't connect and it took restarting it multiple times to get it to download. Once that process was complete, everything else was a breeze.Great product, especially given the prime promo price.", "verified": true, "helpfulness": "1/1", "author": "lilyputt"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "David M. Brown \"Matt Brown\""}, {"rating": 3.0, "review": "not a whole lot of free movies ,", "verified": true, "helpfulness": "0/0", "author": "terry l stollings"}, {"rating": 1.0, "review": "Always getting disconnected..", "verified": false, "helpfulness": "2/2", "author": "Abdul Tawab"}]