[{"rating": 3.0, "review": "Not bad. I run android, and a chromecast ended up being much better overall, so I end up using the fire stick only for amazon prime video or when I want to rent a video that's only available from amazon. Seems uninspired on the whole, but functional. If you had a roku I'd say it's probably not worth bothering with fireTv.", "verified": true, "helpfulness": "0/0", "author": "Chris Peterson"}, {"rating": 5.0, "review": "Very easy to work with. I will def recommend this product to my friends and family!", "verified": true, "helpfulness": "0/0", "author": "Anoulack Sitthisack"}, {"rating": 4.0, "review": "Great product!  Its very fast and it works so much better than the Chromecast.  The only thing I wish it had was a way to stream media directly from a DLNA server.  Perhaps someone will come out with a program to do that soon.", "verified": true, "helpfulness": "0/0", "author": "J & R \"jesras\""}, {"rating": 5.0, "review": "LOVE IT!!💙💙💙", "verified": true, "helpfulness": "0/0", "author": "Carmen Martinez"}, {"rating": 5.0, "review": "I was lucky enough to pick this up for $19 when it was first released. What a great buy!! I've been wanting a streaming device for my bedroom because I don't have cable in there. It was easy to set up and it works like a charm! No issues with buffering and my prime account was already linked to the device. My mother has a chrome cast which is also a good streaming stick. But I would recommend the fire stick over the chrome cast for a couple of reasons 1) it comes with a remote so you don't have to use your phone or tablet 2) access to amazon prime (this includes video and MUSIC!!) 3) the hardware is just better. $19 was a steal, but I would have gladly paid $39.", "verified": true, "helpfulness": "1/1", "author": "D'A ngelo Ramos"}, {"rating": 4.0, "review": "My family is enjoying the fire stick", "verified": true, "helpfulness": "0/0", "author": "Helen Brooks/Odom"}, {"rating": 5.0, "review": "Plays Amazon video well. I can't play Sev Zero on it which is the only advantage of the Fire TV box in my case. And the remote was a bit nicer but I only paid 20 bucks for this and am very happy with it.", "verified": true, "helpfulness": "0/0", "author": "radioman2014"}, {"rating": 5.0, "review": "On demand entertainment with a simple remote. The streaming is clear and consistent. The app selection is just okay but the key players are there Instant Prime, Netflix, Hulu, Pandora, PBS, and ESPN. As long as app selection keeps growing this smart tool is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I was very much excited to receive this. I have had to use a PS3 for all my streaming services and have been looking for an affordable alternative. Unfortunately the Fire Tv Stick has only worked correctly about half the time. It has become so unreliable and annoying that I have discontinued use and will consider something tried and true like Apple TV.", "verified": true, "helpfulness": "2/3", "author": "Charles R Waychoff IV"}, {"rating": 3.0, "review": "I compared this product to the Roku stick and the Google Chrome stick.  The Roku won (didn't charge for additional apps like Plex and has way more free channels).  The Fire Stick came in a close second and the Chrome stick went back to the store day 1.  I based my decision on portability (I travel for work and hotel tv is horrible), channel and viewing options, charges for additional apps, ease of use, clarity of pictures (HD streaming options) and other requirements like, wifi connections, computer or tablet.  I used them all on my MiFi device on the hotel room 42\" LG tv and the Roku stick had the clearest picture, more channel options, and the most consistent stream with minimal download interruptions. The Fire Stick also had a great picture but it took longer to download the same movie from Prime????? and it kept getting interruptions.  I thought it may have been just a bad MiFi/WiFi connection so I plugged in the Roku stick.  It worked much better.  Sorry Amazon!  I'm thankful for the return policy.", "verified": true, "helpfulness": "1/1", "author": "LPG \"LPG\""}]