[{"rating": 5.0, "review": "Amazon Fire TV Stick is the best buy on the market.  Amazon Prime is part of my Amazon life, and in addition to the bargains from Prime, I was able to order this for $19 as part of a two day deal. The Fire Stick arrived ten days before the actual promised date, which was a plus for me.The Fire TV Stick arrived well packaged with the Fire Stick, USB cable, Power adapter, HDMI extender cable, Two AAA batteries, and an Amazon Fire TV remote. Instructions included were specific and easy to use. I connected the USB cable into the Fire TV stick, and the other end into the power adapter. Plugged it into the outlet, and then connected to the HDMI port on my TV. I clicked on the remote and followed the on-screen instructions to complete the set up. This was the easiest set up I have experienced.With my Amazon Prime, I view the films offered, and there is usually a pause while buffering. Streaming with the Fire Stick completely eliminates the buffering, there is no pause, the film starts immediately. The picture is crisp and the sound enhanced. I have Netflix and that was an easy set up. I am so pleased with this new way of streaming films. I had considered a ROKU, but this small Amazon Fire TV Stick is the best purchase of the year.Highly Recommended. prisrob 12-04-14", "verified": true, "helpfulness": "1/1", "author": "prisrob \"pris,\""}, {"rating": 5.0, "review": "Bought one, loved it - bought another - from Best Buy for $25, since Amazon isn't shipping the one I bought for $19 until January.One will go to my Parents for Xmas.XBMC / TVMC has MUCH better performance than my Apple TV2.  I mean MUCH better.", "verified": true, "helpfulness": "0/0", "author": "Tim D'Aquino"}, {"rating": 3.0, "review": "After hooking up this product to the TV and getting a USB extension to get enough length to the power cord in order to power the darn thing, It took 5 tries to finally download the \"software update\" that it needed to even run despite having full wifi signal strength at that location. Not sure if that was because Amazon servers were loaded down or what, but was very frustrating. After the download the stick worked as expected.I am only giving three stars because of the design of these sticks. I know that all of them have the same flaw in that you have to power them because HDMI ports don't supply power, however, not everyone has power directly behind their TV either, this means that power cord is now coming out from behind the TV, running down the wall and 5 feet over to a power outlet (my TV is mounted above my fireplace mantel in a rental home, so cant run cables through the wall). Since the power cord is only about 2 feet in length and a USB cable to boot, I had to go purchase a USB extension cable, which was not as easy to find as you may think. My suggestion is to also make these run off of AAA batteries or coin batteries if possible. I would much rather have to replace the occasional battery than have to have some ugly cable running all over the place. But that is my opinion.", "verified": true, "helpfulness": "0/0", "author": "k5kzv"}, {"rating": 3.0, "review": "I was a little disappointed in this stick once I actually got it up and running.My main issues is that they are advertising this the same way as the full blown Fire TV, including all the Game features, which was one of the reasons I picked them up during the initial half price sale they had for them.While it DOES do everything it advertises in terms of streaming movies and videos, it misses the marks when it comes to games.  A LOT of the games I tried to download from the Amazon app store just do NOT work on the stick.  Plus out of the ones I did manage to get downloaded, MOST required a game controller, and don't work with the remote.  Disappointing...So I did some research and found that a lot of people use the PS4 controller with their Fire TV units.  Turns out that the Fire TV Stick can see it, but it will not pair with it.  So the Fire TV 'will' pair with a lot of blue tooth controllers, but the Fire TV 'stick' will not. Shelling out $40 for an Amazon only controller, when I have a perfectly good controller already, just doesn't make sense.  Again, disappointing.They marketed this as BOTH a streaming device and game play device.  While it meets the hype for streaming, it fails when it comes to games.  So for now I have to give it 3 stars.", "verified": true, "helpfulness": "2/2", "author": "Customer 2000"}, {"rating": 4.0, "review": "I picked up a Fire Stick while Amazon had a pre-order sale for $19. I currently use a Roku XS and two Samsung smart tvs, so my comparison will be to those. I do not have an AppleTV, so I cannot compare to that.Setup:Initial setup was fairly painless. It walks you through the steps and gives you a quick tutorial. I chose not to use the included a/c adapter and instead opted for USB power (even though it kept telling me not to use USB). The included HDMI adapter makes it easy to install in virtually any TV.Features:Most apps that I tried (Netflix, Hulu+, Pandora, A&E;) worked fine. Speed seemed about on par with my Roku XS.I am using Amazon Cloud for my music and pictures and it immediately synced my photos, so they were there for viewing or a slideshow.The iOS app is not currently available, so I could not test mirroring, etc...Remote works great. Feels good in your hand and the buttons are not hard to find.Wifi connection is good. Connected to my 5GHz network and streaming Hulu+ with no stuttering.Good Amazon Prime integration if you've purchased digital content from Amazon or have a Watchlist going with Prime.I don't play games on my tv, so I did not test any games or the optional game controller.Cons:A little buggy the first couple of days. Sometimes apps would disappear or show unavailable. Seems to be resolved now.I was a little disappointed that I had to pay for the Plex app. This was free on the Roku.Conclusion:At $19 (I've seen it as low as $24 during Black Friday/Cyber Monday) this is a pretty good deal. If you have existing digital content with Amazon or multiple Amazon devices (Fire, Fire HD, etc...), then this is a good addition. If you don't, then there are other devices that give you the same benefit depending on how much you want to spend. Nothing blew me away about the Fire TV Stick, but then again I was not disappointed as I generally expect better quality from Amazon.If anything changes in the coming weeks, I'll post updates, but for now so far, so good.", "verified": true, "helpfulness": "0/0", "author": "T. McElveen"}, {"rating": 5.0, "review": "Absolutely love this device.  I just received mine a week ago and me and my girls were up all night playing with it.  Now that I see all the cool things it can do I'm in love.  We never used to watch regular tv anyway, we always watched movies on prime or netflix, this stick makes it so much easier to stream our movies in different rooms.  We used to have to drag the Kindle or Xbox around to whatever tv we wanted to watch it on but with the stick we can move around and stream our movies where ever we want.  I'm buying one for my boyfriend because he loves to stream movies from his phone, now he can just carry on the fire TV stick.  I'm sure he'll love this as much as I do.I'm definitely getting the game controller in the near future.  Super excited to see what else this device has to offer.", "verified": true, "helpfulness": "0/0", "author": "gemini25"}, {"rating": 4.0, "review": "Overall, a really nice product, especially if you have Prime.  However, I purchased it during the promotion period for $20.  At the regular price point, I might consider spending a bit more for the Fire TV Box.I own both products.  They both take you to the same interface and provide the same selections and user experience.  For the casual user, the primary difference is the Remote Control.  The Stick remote is a nice feature, but it's not as nice as the remote that comes with the Fire TV Box.  It lacks the voice recognition/mic and just doesn't feel as solid. It's worth noting, however, that the Box remote does work with the Stick and can be purchased separately... but at that point, you may as well purchase the Box.", "verified": true, "helpfulness": "0/0", "author": "sdbank"}, {"rating": 2.0, "review": "I think the idea of it, a stick that is autonomous that you do not have to use another device with.  But in execution it seems that the hardware or software is not up to snuff.  It works most of the time but there are frequent freezes and hiccups in the video playback. That is usually a sign of low hardware resources but that is just my take on it", "verified": true, "helpfulness": "0/0", "author": "Donald Francis"}, {"rating": 5.0, "review": "Perfect Amazon Prime companion. I can bring it along with me from home to hotel to a friend's house. Very convenient especially for a person who frequently travels. It is very portable, just the size of an old USB drive plus the remote. I can access all my Prime content with the device, either I watch movies or TV shows, or just listen to music or browse my photos. I got it during the promotional period so you get a phenomenal product at a price to beat!", "verified": true, "helpfulness": "0/0", "author": "alvin ray \"Alvin Ray\""}, {"rating": 4.0, "review": "It works well, however the only critique lies in the apps. I'm waiting for Crunchyroll and VuDu mainly, and if I don't see it soon I might have to switch to Chromecast. Other than that, the voice search is awesome.", "verified": true, "helpfulness": "0/0", "author": "Toni"}]