[{"rating": 4.0, "review": "The Fire TV Stick is great, although since it is WiFi based, it does drop signal every now and again or buffers for too long. But for the most part it is great. I do have the fastest internet available in my area 45Mbps and the stick is within 30' of the Router.", "verified": true, "helpfulness": "0/0", "author": "Mike Jaramillo"}, {"rating": 5.0, "review": "Very good product!", "verified": true, "helpfulness": "0/0", "author": "edward arzu"}, {"rating": 5.0, "review": "Nice little product. I had pre-ordered this during the launch and loving this. I have multiple streaming devices including - Logitech revue Google TV box (sucks, highly unreliable, crashes all the time), Google Chromecast (good product, but needs a phone / tablet as a remote), Roku stick (no complaints), Apple TV (no complaints) and the Fire TV. What I love about the Fire TV is that it comes with the remote and I don't need to push content using my phone or tablet. The streaming quality is great. Between this and Roku, the Roku definitely has more channels. But given that this is a new product, I am expecting the Fire TV stick to catch up.", "verified": true, "helpfulness": "0/0", "author": "kvam"}, {"rating": 4.0, "review": "Very nice and easy to use.  Works fine though it won't work w/out internet connection, so if you're internet provider is spotty or your signal from your wireless router isn't strong you could have issues (delays in your show/movie).  User interface is easy to use and remote is small and easy to use as well.  The only reason I gave it 4 stars and not 5 is that the search features on the remote (rewind/fast forward) are a little different than any traditional remote I've used.  You have the 1-touch forward and back jump buttons (maybe 3 seconds for each), but if you want to hold the rewind or fast forward for a search, the show keeps playing until you select \"play\" - it does not move with the rewind/fast forward search which would enable you to scan where in the show you are.  Not a big problem but that added functionality would be a good addition to future generations of the product.", "verified": true, "helpfulness": "0/0", "author": "LUTZ"}, {"rating": 5.0, "review": "worked excellent , movies queued up lightening fast.", "verified": true, "helpfulness": "0/0", "author": "Denise Gugumuck \"Always lost in a book\""}, {"rating": 5.0, "review": "I love the Fire stick. I was looking for a better dongle than the one I have in order to run netflix and other apps from my Panasonics' crappy app menu, but I found the fire stick with it's own apps (which work much better). The youtube app still sucks though. almost impossible to use easily.", "verified": true, "helpfulness": "0/0", "author": "Sean Caswell"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Michael D"}, {"rating": 5.0, "review": "Very good. Convenient to watch movies on TV. This is excellent", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 4.0, "review": "I like this Amazon Stick version for my internet TV viewing. For many years I've been using my droid tablet or smart phone HDMI connections to stream internet media but last year with Amazon Prime I lost that capability due to Motorola and Samsung devices loosing the licensed option with Amazon. The stick is a very good low cost alternative and it allows you to access most all your internet streaming desires. Its very fast and pretty easy to use. My only con would be it has to be plugged into a electrical outlet somewhere near the tv and does not have a battery power alternative... otherwise I and my wife like and use it often.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "Amazing little gadget and I am totally impressed esp for the price.  Would like a few more apps added (i.e. Vudu) but I'm sure it will be in the future.  Thanks Amazon!", "verified": true, "helpfulness": "1/1", "author": "N. Evans \"Nevans\""}]