[{"rating": 5.0, "review": "great selections and easy to use", "verified": true, "helpfulness": "0/1", "author": "Chris"}, {"rating": 3.0, "review": "Several of the apps that I wanted to use (HBO GO and Hulu Plus) all have audio sync issues. They do not on my fireTV box and it's not my internet. The Apps just don't run optimized on the FireStick. The amazon video stuff works well though.", "verified": true, "helpfulness": "0/1", "author": "Derek Summitt"}, {"rating": 5.0, "review": "I love this product; easy and convenient!", "verified": true, "helpfulness": "0/1", "author": "Elier Lopez"}, {"rating": 5.0, "review": "Works perfectly and mirrors the functionality of the Fire TV which I also have.  I love the fact that it has its own remote and not have to use your iPhone/iPad which was cumbersome and unreliable.", "verified": true, "helpfulness": "0/1", "author": "J. J. DiGiovanni"}, {"rating": 5.0, "review": "I am so in love with my firestick! It was east to set up and even my 4 year old knows how to use it without my help! *** Im coming back to add this on my review, because I got a non-helpful review...When I received I knew what I was getting, because I did a lot of research on these. I really didn't have to refer to the instructions its pretty self-explanatory and once plugged in it will walk you though the setup process. I haven't had any issues with losing wifi connections yet, but can be slow when playing a movie, but i think that is just my internet connection itself. Bottom line its worth the money! Im glad I snagged this on the Prime Day specials!", "verified": true, "helpfulness": "1/2", "author": "Natalie"}, {"rating": 5.0, "review": "I like that I do not have to use my phone or tablet to run the fire stick, I love that everything that I have on my kindle that I bought through Amazon I can watch on my t.v. My Comcast is going to be collecting a lot of dust.", "verified": true, "helpfulness": "0/1", "author": "crazy"}, {"rating": 5.0, "review": "We have an pre smart TV at our lake house, we didn't want to invest in a new TV for something we only use occasionally. This was the perfect answer for us. We get the same thing as we get with our smart TV at home at a fraction of the cost to upgrade. The only negative is sometimes our WiFi is slow out in the middle of nowhere but that has nothing to do with the Fire Stick it just something to be aware of.", "verified": true, "helpfulness": "1/2", "author": "Heather Pennington"}, {"rating": 5.0, "review": "So easy to use.", "verified": true, "helpfulness": "0/1", "author": "Tamera Weaver"}, {"rating": 3.0, "review": "The Amazon Fire TV stick is a good product but it's not a great product.  I purchased this during the Prime Day event a couple of weeks ago for about $24.  I have a Roku box at home.  I find the performance of the Amazon Fire TV stick is average at best which is why I gave this three stars.  The on screen menus have a sluggish response especially when viewing HBO GO.  I find the Roku Box slightly better in that regard.  The actual steaming has been choppy in a few occasions and in one instance I've had to reboot the entire device to get better performance.  I've never had to reboot the Roku.I like that the product can be hidden behind the TV.  With my Roku box it's visible and so are the wires connecting it.  The personalized introduction was a nice touch when you first turn it on.  It instructs you on how to use the product.One thing I really like is the screen saver feature.  If you have a movie paused for any length of time really nice images from a variety of places appear.  It's a nice touch.  I also like that I can sync my mobile device to the Fire Stick and type on my device what I am searching for instead of hunting for letters with a remote.", "verified": true, "helpfulness": "0/1", "author": "D-Rome"}, {"rating": 5.0, "review": "It was a little hard to set up, I think because I need a new router, but when I got it set up and figured all the apps out that needed downloaded, it worked great. I am very happy with it.", "verified": true, "helpfulness": "0/1", "author": "Linda P. Harris"}]