[{"rating": 5.0, "review": "Best dollar for dollar piece of tech I have ever purchased. There is no competition. 3 google chromes I own gathering dust.", "verified": true, "helpfulness": "0/0", "author": "lit"}, {"rating": 5.0, "review": "It's great to view original Amazon shows like Bosch ! It's also neat to be able to play your music through the tv screen!", "verified": true, "helpfulness": "0/0", "author": "Brenda J. Michanczyk"}, {"rating": 4.0, "review": "I have enjoyed the Fire Stick very much.It is amazing if one has Prime also! Lots of great movies. I am just waiting until local stations begin streaming also!!", "verified": true, "helpfulness": "0/0", "author": "Michorium"}, {"rating": 4.0, "review": "They company needs to figure out the sound transfer. You have to turn the tv volume way up when using the stick.Other than that it really is amazing", "verified": true, "helpfulness": "0/0", "author": "Dkham"}, {"rating": 5.0, "review": "The product is awesome.  Lots of app choices, the kids love it!!", "verified": true, "helpfulness": "0/0", "author": "Catherine R."}, {"rating": 2.0, "review": "My internet wont stream it cant afford better internet", "verified": true, "helpfulness": "0/0", "author": "Paul Rheinheimer"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "lovemyweimers"}, {"rating": 5.0, "review": "This is great. I like this better than the Roku I had been using.", "verified": true, "helpfulness": "0/0", "author": "Hop Maniac"}, {"rating": 2.0, "review": "I liked what it offered but I felt limited to what I could watch  and at times my remote would stick and flip through the screen uncontrollably. The same movie would be free to watch on Roku but have a fee to watch on Amazon fire stick.", "verified": true, "helpfulness": "0/0", "author": "DIANA BROWN"}, {"rating": 5.0, "review": "Love my fire stick!  Super simple to install,  works great..and cheap!", "verified": true, "helpfulness": "0/0", "author": "April Rainwater"}]