[{"rating": 4.0, "review": "Yes it met my expectations.  It's easy to download and to operate.  It has a lot of information that is not even mentioned when you read what it does.  I really like it so far.", "verified": true, "helpfulness": "0/0", "author": "Helen P. Woodard"}, {"rating": 2.0, "review": "It's a headache in a box. It has too many issues to be worth consideration. Video lag and latency issues riddle the apps.  Amazon makes it incredibly difficult to return. I have never had a bad experience with Amazon before but this has been ridiculous. Their Fire TV support people don't listen and assume something is wrong on your end instead of even considering that the stick could be faulty. Save your time and go with a Roku.", "verified": true, "helpfulness": "1/1", "author": "S.W."}, {"rating": 5.0, "review": "Delivery was on time install took no time at all so far so good", "verified": true, "helpfulness": "0/0", "author": "Peter D."}, {"rating": 1.0, "review": "All the movies I wanted to watch, even old movies, had to be rented or bought.", "verified": true, "helpfulness": "0/1", "author": "Pamela Waldron"}, {"rating": 3.0, "review": "Having problems, maybe we need a better modem though. Love all the shows we can get, sooo many. Trial and error though. I turned off my cell and internet access on my ipad, seemed to work better. Not so many devices trying to use the same thing. Changed my cable setting with the cable company, my streaming is faster now. Seems to be evening times when the streaming slows. But the people who stream some of the shows don't stream the whole show. Or maybe it's just our misunderstanding of the stick. Hoping we can get rid of cable completely soon. Depends on this stick working well enough. Time will tell.", "verified": true, "helpfulness": "0/0", "author": "Dona Freels"}, {"rating": 5.0, "review": "Very easy setup and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Patrick Ryan"}, {"rating": 5.0, "review": "Awesome to have my Prime access directly in to my TV. Having a remote on my phone is really nice to. I haven't played any games, but since cancelling cable service this has been a life saver.", "verified": true, "helpfulness": "0/0", "author": "Matt O'Leary"}, {"rating": 5.0, "review": "great product.  fit my needs perfectly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I only bought the fire stick so I can screen share my kindle with the TV, but its like the Fire stick slows down the internet. I cant use my Netlfix in another room because the blueray cannot pick up wifi anymore. Plus my kindle is slower so the movie I want to watch wont load, or takes to long to load so the connection the stick turns off.", "verified": true, "helpfulness": "0/0", "author": "chun"}, {"rating": 5.0, "review": "I love my Fire TV Stick! We have dropped cable tv and use this with our Amazon Prime account, along with Netflix an Hulu plus. Definitely worth the small investment. You will need a fast internet connection.", "verified": true, "helpfulness": "0/0", "author": "Matthew Shea \"peacefultimesbooks\""}]