[{"rating": 5.0, "review": "I have 3 roku media streamers for my TV's and thought I would take a chance on this since I got it on sale as a Prime Member.  It was worth the $20 I spent on it for sure.  Navigation is easy, and since I have a Kindle Fire HD I can use the kindle as a remote or navigation tool with the Fire TV Stick.  I liked it so much that I moved it from a bedroom TV to the main TV.", "verified": true, "helpfulness": "0/0", "author": "M Fischer"}, {"rating": 1.0, "review": "This thing drops the connection every 15 seconds despite being 15 feet from a high end router.  My roku 3 works great downstairs 30 feet away.  Do not purchase this.  I am using the HDMI extender and it does nothing.  This device has so far been the worst thing I have ever purchased from amazon.", "verified": true, "helpfulness": "0/1", "author": "John"}, {"rating": 4.0, "review": "easy to install, started up easily", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "I purchased a competitors model and it stopped working after an update.  I should have never doubted Fire TV Stick. My expectations have been exceeded by this item and my kiddo loves the games.", "verified": true, "helpfulness": "0/0", "author": "Michael Washington"}, {"rating": 5.0, "review": "Love the Amazon Fire Stick, except that our 4 year old  grandson is a little too handy with it and has ordered 4 movies.  The remote is now up on a very high shelf.  It is wonderful, but watch out for the users.", "verified": true, "helpfulness": "0/1", "author": "Gwen B."}, {"rating": 2.0, "review": "Annoyingly drops connection. Have to unplug and replug in the device.  ISP and router not the issue. Pending customer service review of issue. Updated to follow.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Gavazzo"}, {"rating": 4.0, "review": "Easy to install.", "verified": true, "helpfulness": "0/0", "author": "mary Pierce"}, {"rating": 5.0, "review": "What can I say - I stream Netflix and Amazon Prime anytime I wish on our Workshop HDTV! Remote is simple, yet I find easy to understand with the on-screen menus.", "verified": true, "helpfulness": "0/0", "author": "Bayou Reader"}, {"rating": 5.0, "review": "Very easy. User friendly. Would buy again.", "verified": false, "helpfulness": "0/0", "author": "Nicole Day \"Nicolemaarie\""}, {"rating": 2.0, "review": "Not really that impressed..i have fast internet but this thing is constantly freezing and alot of times you have to pause it so a show can load how you would on YouTube.  Im going back to my roku.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Baroni"}]