[{"rating": 5.0, "review": "Best product I've ever bought.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Not Happy at all. We bought it because the Xbox was always having trouble loading. But the fire stick is worse. I'm disappointed with the purchase.", "verified": true, "helpfulness": "1/1", "author": "Rebecca Johnson"}, {"rating": 5.0, "review": "Item was as advertised and received in excellent condition. I am very happy with it and would recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "Boomer"}, {"rating": 4.0, "review": "Nice setup But wish had local channels offered.  I still can't figure out how to do prime shows though So I stick to Netflix Easier to watch.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I've been a cable cutter for 3 years. Using mainly Roku. My Roku stick (6 months old) went out in the spare bedroom. So I figured rather than fighting returns and warranty. I'd just try the Fire Stick. Really easy to set up especially if you are already a prime member. It comes set up on your account. So Far So Good! Only 4 stars until it lasts more than 6 months.....", "verified": true, "helpfulness": "1/1", "author": "Edward A."}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "gioi nguyen"}, {"rating": 5.0, "review": "works great thanks for fast service", "verified": true, "helpfulness": "0/0", "author": "WILLIAM DAUGHERTY"}, {"rating": 5.0, "review": "I purchased this because my tv is no longer going to support Amazon prime.  It works great.", "verified": true, "helpfulness": "1/1", "author": "M. Morris \"mount\""}, {"rating": 2.0, "review": "Not bad....when it is working. I have very fast internet, yet this stick buffers and crashing half a dozen times in an hour.", "verified": true, "helpfulness": "1/1", "author": "Joshua L. Smart"}, {"rating": 4.0, "review": "This is our second Fire TV Stick, our first one came with the box that gives you a remote with voice activation.  This one is a fraction of the price as the voice activated one so for our second TV, we thought we'd save some money and get the cheaper one.  The set up is easy, it works the same, same quality etc., but I do miss the voice activation.  Unfortunately, if you install a second device on another tv in your home, you have to reinstall all the apps, relog into all of them (ie. Hulu, Netflix etc.).  It does recognize movies you've already watched or have on your watch list from your other device which is great.  You have to have the \"one click setting\" enabled on your Amazon account if you want to watch anything that is paid for on demand.  We've noticed the free programming content has increased considerably on Amazon Prime since we bought our first one about a year ago which made us want to get this second one for our other TV.  Its a great little device, very reliable, easy to use, the Amazon interface is very intuitive (cant say the same for the other Apps in it that you can download).  It looks like Hulu just changed its interface and programming so that was a huge bummer.  I really wanted to buy the Chrome TV because I don't really like Amazon as a company but I succumbed to buying this one because of the \"unknown\" in terms of what programming content we would get with the Chrome version or how we would set up a payment method, whether there would be the same amount of free programming etc.", "verified": true, "helpfulness": "1/1", "author": "BOOK REVIEW"}]