[{"rating": 3.0, "review": "a lot of problems freezing up. own another older media player and do not have that problem. Tried moving tv and modem and not any better result.", "verified": true, "helpfulness": "0/0", "author": "mario"}, {"rating": 5.0, "review": "This is an easy review to write.......AWESOME!!!!!! If you have Amazon prime you really need to get the Fire stick. I just got a new TV for the bedroom......plugged in my Fire stick and I am ready to watch EVERYTHING on Amazon prime......plus Netflix if you are a member. Way worth the price and so easy to use. Love, Love, Love the Fire stick!!", "verified": true, "helpfulness": "0/0", "author": "T. Blair \"twintoni\""}, {"rating": 5.0, "review": "this is so easy, and love IT!", "verified": true, "helpfulness": "0/0", "author": "Janet"}, {"rating": 5.0, "review": "Working great love it", "verified": true, "helpfulness": "0/0", "author": "Marie L Boudreaux"}, {"rating": 5.0, "review": "We gave up cable TV about three years ago, and the only real loss was live sports. We've had access to Netflix and Amazon Prime for everything else. We just recently found Sling and took advantage of the offer to get Fire TV Stick free with three months paid subscription to Sling. We're very happy to have ESPN and our favorite college sports again. Fire TV Stick allows us to watch Sling on the big screen, not just the laptop.", "verified": true, "helpfulness": "0/0", "author": "P. Swafford"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "angelo alberty"}, {"rating": 4.0, "review": "It's a very cool product and I love the android app that goes with it. Navigating it can be a bit tricky and it doesn't support showtime if your subscription is through Comcast/Xfinity (!) but it's great overall.", "verified": true, "helpfulness": "0/0", "author": "Dr. Sam Psych"}, {"rating": 4.0, "review": "I got it today and when I first connected it to my Samsung LN-T4665 I got a \"Not Supported Mode\" on the tv. I was so disappointed. I then tried it on my Sony tv and it worked. I set it up and installed the plex app, added the parental control pin, and tried a couple of home videos from my plex library. Everything seems to be working good. I then decided to try again in my Samsung LN-T4665 in another HDMI port and voila it worked! I am so glad since I bought this device for this tv in my office. I have a Chromecast in my 53\" Sony tv. Later on and this weekend I am going to put it through it paces. Unlike other users who complained about the remote, the remove response it's fine not too slow or too fast. The user interface is kind of intuitive. I was also able to use the MiraCast function from my phone to mirror my android galaxy s4 screen in the fire tv stick. Very nice. This device complement Plex very well since it emulates the Plex web interface really good. That is something that is lacking in the Chromecast Plex android app. What I sometimes do is use my laptop and open the Plex web interface with the chrome browser and cast it to the Chromecast so that I can see my media info. This is kind of inconvenient but do also like the Chromecast.So far in terms of functionality, the manufacture claims (Amazon) and my expectations, in my opinion, this device does what is claims and it does it well. So why do I give it 3 stars? Any device that force me to keep bloatware and/or registration with credit card info for in-app purchase automatically is a 2 stars item from my point of view. I searched and there is no way to remove the featured apps list and other prime video advertising. If I am not a prime member then don't offer me or show prime membership stuff. That is why I love the Chromecast.Changed it to four stars considering that the hardware probably cost a lot more than the $39 I paid for it and they most likely make money by 'scamming' people into buying stuff and becoming prime members. I guess that is one of the reason they gave it so cheap to prime members because once you get used to it you are hooked and will be compelled into renewing your prime membership.", "verified": true, "helpfulness": "0/0", "author": "kiskeya"}, {"rating": 5.0, "review": "k", "verified": true, "helpfulness": "0/0", "author": "Mark Caklovic"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Jesus a cervantes"}]