[{"rating": 5.0, "review": "I purchased this stick to be able to enjoy Sling TV.  It works well with my Samsung TV, and is recognized by the TV's source input when you press the fire TV stick home button without having to go through the input menu..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "lovely TS stick!Recommended!", "verified": true, "helpfulness": "0/0", "author": "Douglas Urrea Ocampo"}, {"rating": 4.0, "review": "This stick is speedy so far going back and fourth through apps. Wireless antenna is good not alot of buffering. What's great you Can sideload apps not available on amazon. I got this free through sling tv deal.", "verified": true, "helpfulness": "0/0", "author": "vincent leung"}, {"rating": 5.0, "review": "The fire stick is Awesome my children love Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Durias"}, {"rating": 3.0, "review": "Earlier, I sent a message that I did not want the stick because the remote was very difficult to open, and I was sending it back.  My money was immediately refunded (thank you) and a return label was emailed to me.  However, I managed to pry open the remote control with a knife and now I won't be sending it back.  I'm using the system and love it.  Please take back your money from my account.  The remote could still use some tweaking.", "verified": true, "helpfulness": "0/0", "author": "Evelyn Marie Lizana"}, {"rating": 5.0, "review": "Honestly? I ordered it on a whim, not really expecting it to work. Didn't realize that it has to be plugged in to the wall outlet to work, but that was just me not reading the specs page. But I love that dang thing. It pulls wifi from the other end of my house, a feat my cell phone can't manage most days, and the included remote is quite nice and also throws a powerful signal to the stick. So powerful, that I discovered my preschooler had stuck it between the mattresses when I rolled over in bed :)Of course, it would of been better had I not just paid for Prime specifically for the ability to stream my favorite show, Doctor Who, into my bedroom, only to discover that Amazon has dropped almost all BBC shows in the name of some ridiculous quest to alienate customers and carry \"exclusive\" content that not many people want to watch. But that's okay, the quest for my shows led me to discover a significantly cheaper new alternative to cable", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Mom of 2\""}, {"rating": 5.0, "review": "Love it ! So glad to be able to get rid of cable. Only negative was I had to move the router to the same room - so much for comcast wi-fi - definatly recommend it", "verified": true, "helpfulness": "0/0", "author": "jodi johnston"}, {"rating": 5.0, "review": "Love that I can now watch Prime video on my tv.  I would have paid double this for this item.", "verified": true, "helpfulness": "0/0", "author": "susan ryan"}, {"rating": 5.0, "review": "Works as advertised. Seller offers good support if needed.", "verified": true, "helpfulness": "0/0", "author": "msalvio"}, {"rating": 5.0, "review": "Great product but you must know that if you have a cable company router YOU MUST PURCHASE YOUR OWN ROUTER and have your cable company disable there router or fire TV will not work correctly.", "verified": true, "helpfulness": "0/0", "author": "J. Lewis \"Spider\""}]