[{"rating": 5.0, "review": "Works as well as the box version but easier to carry on a trip", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "Robert Smith"}, {"rating": 5.0, "review": "Love this item. The reception is super clear. Netfix plays back much better without the lag I got when using the bluray to stream it. We will end up buying another one for the bedroom eventually.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We absolutely love this divise. Installation was a breeze. Setup was easy. Continues to work great.", "verified": true, "helpfulness": "0/1", "author": "ckdb"}, {"rating": 3.0, "review": "It's ok", "verified": true, "helpfulness": "0/2", "author": "Frankie Nichols"}, {"rating": 2.0, "review": "I bought the fire stick for the sole purpose of watching Sling TV, so I have not used it for any other purpose. The device is very slow, very laggy. If you're trying to change \"channels,\" you're current video stream becomes very jittery, and the sound begins to cut out. The Sling App on my iPad and iPhone both work with no hesitation, so I'm inclined to say the Stick just isn't up to the job of streaming Sling.", "verified": true, "helpfulness": "1/2", "author": "Joshua Kiewit"}, {"rating": 5.0, "review": "Really enjoying my prime movies and youtube on my Magnavox smart tv. :)", "verified": true, "helpfulness": "0/1", "author": "A. Daniels"}, {"rating": 5.0, "review": "It works great and was easy to install.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "When this thing works, it's great...problem is it never wants to work. Nothing but issue after issue. It continuously looses its connection. I reset, I unplug, I do everything under the sun and occasionally something works but more times then not it just crashes again. Then most times when I reset it, it doesn't want to accept my Amazon password. Then when it finally does, it just leads to another issue. Right now it states \"no network connection\". My laptop, my Kindle, my phone, all connected-but not the stick. I give up.", "verified": true, "helpfulness": "1/2", "author": "Roscoe S Cromwell"}, {"rating": 4.0, "review": "Great Product", "verified": true, "helpfulness": "0/1", "author": "Ninersfan"}]