[{"rating": 5.0, "review": "I bought this for my five kids as a gift for Valentine's Day and they love it.  There are not many things that suit everyone from my oldest to my youngest.  Ages 16, 15, 13, 10 & 8.  They love the easy access to movies and play crossy roads game all the time!!!", "verified": true, "helpfulness": "1/1", "author": "Geraldine Flynn"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "David Valleri"}, {"rating": 5.0, "review": "If you're looking at this and the Chromecast hopefully this review can help you out!I own both, and I like the Fire TV Stick more. Chromecast is great for throwing stuff to your TV, while the Fire Stick reminds me more of an Apple TV style device. I love the remote, but if you lose it (or don't like it) you can download an app to use your phone/tablet as the remote.", "verified": true, "helpfulness": "1/1", "author": "Spencer Dean"}, {"rating": 3.0, "review": "Horribly unreliable.  It is very frustrating dealing with the network connections that do not affect any of the other countless rokus, wiis, phones, computers, and other devices throughout the house.  Other than that major flaw, it works well and the phone remote is a great addition when I get tired of looking for the miniature remote my kids have taken with them on some adventure.", "verified": true, "helpfulness": "0/0", "author": "Phil"}, {"rating": 5.0, "review": "Great.  Enjoy it every night.", "verified": true, "helpfulness": "0/0", "author": "Gerry \"old girl\""}, {"rating": 5.0, "review": "Excellelt, perfect condition, i like it. thanh you very much.", "verified": true, "helpfulness": "0/0", "author": "Danh Minh Tran"}, {"rating": 5.0, "review": "It works great. I love it as much as my Apple TV! Never seen that coming. Couple the Fire Stick with PRIME instant video, it rocks mountains!", "verified": true, "helpfulness": "1/1", "author": "Ron"}, {"rating": 5.0, "review": "Love it. Well end up with one on every tv in the house!", "verified": true, "helpfulness": "1/1", "author": "Dede Wood"}, {"rating": 5.0, "review": "it was easy and works well", "verified": true, "helpfulness": "0/0", "author": "sam gelberg"}, {"rating": 4.0, "review": "In general, we are enjoying Fire TV Stick very much.  The remote could be designed a bit better, and there could be a bit more free things to view, but overall, we are pleased", "verified": true, "helpfulness": "0/0", "author": "William L Andrews"}]