[{"rating": 5.0, "review": "Simple to set up and easy to use.  I have two flat TV's that are not \"smart\" TV's.  Being able to move the Stick from one TV to another is very convenient.  The remote is small, intuitive, and easy to use.  The only small issue I have is the placement of the power adapter plug halfway up the body of the stick.  The wire is pointing up awkwardly when plugged into the back of the TV.  I would suggest the next generation have the power plug on the end on the Stick to lessen the stress of the plug and wire.  Also, supplying a longer USB power wire would be a welcome plus.", "verified": true, "helpfulness": "0/0", "author": "Saltwatersal"}, {"rating": 5.0, "review": "Worked great right out of the box.", "verified": true, "helpfulness": "0/0", "author": "tim"}, {"rating": 5.0, "review": "Great and easy streaming. It surpassed my expectations. Fantastic purchase.", "verified": true, "helpfulness": "0/0", "author": "Rachel D. Raines"}, {"rating": 5.0, "review": "I love it.  I get to see all my favorite shows and have dinner and a movie in my room. With my gf.", "verified": true, "helpfulness": "0/0", "author": "Victor Espinoza"}, {"rating": 5.0, "review": "Awesome one of the best purchases. install kodi in that. u feel amazing", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We can watch all kind of movies without waste money.  My husband loves it since he found old shows that brought him back memories when he was a kid.", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 3.0, "review": "The only reason I tolerated the problems with this thing is because of how cheap it was.  I have to reset it often and it doesn't go to sleep on its own.  Like many people have said, it lags a ton. Also it seems like the netflix app never works as well as the Prime content.  I hope that Amazon would not do this intentionally, considering we are paying customers for both services...", "verified": true, "helpfulness": "0/0", "author": "MikeandLeah"}, {"rating": 5.0, "review": "Works great, easy to use!", "verified": true, "helpfulness": "0/0", "author": "Hippiekat"}, {"rating": 5.0, "review": "This is the best for any tv ...", "verified": true, "helpfulness": "0/0", "author": "Tomas A Santana"}]