[{"rating": 5.0, "review": "Love it! Will be ordering another soon!", "verified": true, "helpfulness": "0/0", "author": "Cheryl Howe"}, {"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "M. S. Andre \"stay at home mom\""}, {"rating": 5.0, "review": "Nifty little device.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Rodriguez"}, {"rating": 3.0, "review": "I bought the Fire TV Stick, because I thought it would provide me with an easy, and portable, way to stream NETFLIX and view photograph albums.  Even though the Fire TV Stick is less than two feet from the WiFi router, when streaming NETFLIX, there's a regularly occurring hesitation in the playback; this doesn't occur when I use my ROKU box or when I use any of my DVD players that are capable of streaming NETFLIX.  The problem with viewing photograph albums is caused by the Amazon cloud; there is no easy way to arrange the photos for display.  The only choices are to display in order of file creation date or in the order of the date the pictures were taken.", "verified": true, "helpfulness": "0/0", "author": "Reviewer 20150131"}, {"rating": 5.0, "review": "The only negative thing about it is that is required a lot of wifi.. So while on Netflix, it takes a while to load to sometimes.", "verified": true, "helpfulness": "0/0", "author": "Kelly Hardin"}, {"rating": 5.0, "review": "This exceeded my expectations!  You can do just about anything with the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Ricky Cicco"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Bernadette McGlynn"}, {"rating": 5.0, "review": "fire stick was way beyound my wildest expectations.  recomended to others.  wish i had more time to play with it.", "verified": true, "helpfulness": "0/0", "author": "george o andrews"}, {"rating": 5.0, "review": "Your firestorm is a lot of fun", "verified": true, "helpfulness": "0/0", "author": "Daniel Rodriguez"}, {"rating": 5.0, "review": "I barely watch live tv anymore", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Arce"}]