[{"rating": 3.0, "review": "The fire tv stick is definitely easy to use and setup. However, watching Netflix can be a pain at times since the screen gets blurry every few minutes and lasts for a few seconds each time. Along with the blurriness, there's also lagging and buffering during shows. Overall, it's great when working right but annoying when it lags and gets blurry.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it now I can watch my showd", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I was disappointed because I was under the impression I would be able to actually get ESPN and other channels I enjoy.", "verified": true, "helpfulness": "0/0", "author": "Betty Lunceford \"Knitter\""}, {"rating": 5.0, "review": "It was very easy to connect and we are enjoying having a plethora of movies available without having to search all the television channels for a movie. It is still \"new\" to us and having to go to work every day (M thru F) limits the viewing time. A very nice gift to ourselves!", "verified": true, "helpfulness": "0/0", "author": "M. G. Swift \"readsalot\""}, {"rating": 1.0, "review": "Drops wireless signal. First disappointment I have had with Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product with great features!!", "verified": true, "helpfulness": "0/0", "author": "Corey Bolock"}, {"rating": 5.0, "review": "My daughter loves it.", "verified": true, "helpfulness": "0/0", "author": "Roxxana Serna"}, {"rating": 5.0, "review": "This works amazingly well !", "verified": true, "helpfulness": "0/0", "author": "Louis Jacques"}, {"rating": 5.0, "review": "Great item to use on older TV sets that do not have the built in wifi system.  Even with the newer sets that have all the bells and whistles, I find the Fire TV Stick to have a quicker response and smother operating menu then what comes with my most current system wifi enabled flat screen.  Great tool to access my Netflix and Amazon Prime movies.  Bought two and thinking about pick up a third.", "verified": true, "helpfulness": "0/0", "author": "Paul Pope"}, {"rating": 5.0, "review": "Fast shipping product works as agreed thanks!!!", "verified": true, "helpfulness": "0/0", "author": "Lamont Lawrence"}]