[{"rating": 5.0, "review": "Simple plug and play. Perfect for me! I have the stick in one TV and the fire box in the other - no issues with either one. Although the fire box spoiled me on the voice search feature (but the stick is perfect for travel)!", "verified": true, "helpfulness": "0/0", "author": "pea"}, {"rating": 5.0, "review": "I am up to two of these now, one in the office and the other in the living room, and love them. I do not have cable service or even an antenna so all of my entertainment comes over the internet. With these I can use my TVs with no hassles and the way it integrates the service I subscribe to (Pandora, Prime, Netflix, etc) makes it even easier to use than my computer. While not near as powerful or feature rich as set top media centers or a full blown PC they are perfect for turning that old TV into a \"smart tv\" and are much cheaper.", "verified": true, "helpfulness": "1/1", "author": "T. ROBERTSON"}, {"rating": 5.0, "review": "SO far so good", "verified": true, "helpfulness": "0/0", "author": "elizabeth mitchell"}, {"rating": 2.0, "review": "I bouth two of them to watch netflix in brazil, but no one works. Everytime i tried i've got an error message!!!", "verified": true, "helpfulness": "0/0", "author": "marcus vinicius c. sampaio"}, {"rating": 5.0, "review": "LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "J. Gonzalez"}, {"rating": 5.0, "review": "Got this for my husband for Father's Day, and he loves it! It's super easy to use, and I love that you can use Netflix, HBO, etc with it!", "verified": true, "helpfulness": "0/0", "author": "BHC"}, {"rating": 5.0, "review": "Love the Fire stick. Perfect for taking places when we travel and using in the bedroom to save money on another cable box.", "verified": true, "helpfulness": "0/0", "author": "Deb"}, {"rating": 5.0, "review": "I love my new Fire TV stick, give me access to all the great amazon stuff, plus third party apps. So happy i made the purchase.", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 5.0, "review": "THIS IS WONDERFUL. EASY TO INSTALL AND WATCH AMAZON VIDEO INSTANTLY!", "verified": true, "helpfulness": "0/0", "author": "Ms. LC \"projector buyer\""}, {"rating": 5.0, "review": "My husband loves having access to his favorite shows on one device.", "verified": true, "helpfulness": "0/0", "author": "Mar"}]