[{"rating": 5.0, "review": "Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 5.0, "review": "This is an excellent purchase if your plans are to stream content.  You can not beat the price.  There is no need to be a smart TV or BlueRay player with Fire TV Stick.  I easily get Prime Video, HBOGo, Netflix, Hulu, etc.  Set up was very easy.  Also can view uploaded pictures to Amazon storage.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "It did not work with a satellite system", "verified": true, "helpfulness": "0/0", "author": "Jeff J Nohl"}, {"rating": 5.0, "review": "All I can say is wow. Very impressive piece of tech. I bought it on vacation at my parents house. My mother has prime but never used the instant video. I was able to teach them how to use prime instant video, netflix, hulu, and crackle. They were stunned and amazed. They quickly bought one for themselves.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I am not aware of this product until recently recommended by friend. Product is very amazing best plugin device for your TV. Only thing I didn't like was the power chord. All the wiring is done through the wall but this product wiring will standout on top of the wall as it needs power to work.", "verified": true, "helpfulness": "0/1", "author": "sekhar"}, {"rating": 4.0, "review": "I must say for the Amazon fire TV stick you do get your money's worth the only thing I wish that was able to be added on or that I would change is for it to have and external mini sd card slot.", "verified": true, "helpfulness": "0/0", "author": "Rafael"}, {"rating": 3.0, "review": "The fact that Vudu is missing and that the stick specs make it sound impressive but it still runs very slow keep me from giving it more stars.  The interface is kind of clunky too.", "verified": true, "helpfulness": "0/0", "author": "Leith Tussing \"I like tacos.\""}, {"rating": 5.0, "review": "Perfect!!! It's works for what I want too.", "verified": true, "helpfulness": "0/0", "author": "Mateus Chaves"}, {"rating": 5.0, "review": "My husband is very happy with the additional entertainment options it provides. It was easy to install.", "verified": true, "helpfulness": "0/0", "author": "Keiko R"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "audrey  stephens"}]