[{"rating": 5.0, "review": "I waited till I got to explore this device and customize it to my use.  I have what was the top end (at the time) Roku 2 xs for about three years.  Last year I purchased the Chromecast.  Both devices served me very well for what they were for.  I could run plex on roku but had to have a PC open and another server running to get much use from it.  The Chromecast was fine at flinging hulu, youtube, netflix and the like at the TV but lacked more  options. The Smarthub in the Samsung TV's was slow and feels a little dated.  The Fire TV Stick filled in a lot of gaps and now I am considering adding them to every TV in the house.I have sideloaded some extra apps to the device.  TVMC is my favorite launchpad and can actually replace my hulu subscription completely.  I installed the xfinity app from my tablet and now I have superior picture quality when compared to Dish Network.  It's a little difficult to navigate the xfinity app and requires my tablet to work as a mouse and the Fire remote to select anything.  A new game controller is waiting at a UPS depot here for delivery soon and that problem will be solved (I hope).Now I want to discuss some of what I found of complaints.  The popping and clicking sound some folks have been discussing.  This is caused by the speakers being plugged into the same outlet as the fire stick.  I can't be positive but I think Amazon has used some of the wiring inside the USB cord as antenna.  Don't quote this as fact but I feel strongly this is the case.  So any other device that is throwing off a strong RF might also cause the second complaint about poor connectivity.  I think both of these problems can be resolved by relocating the power supply.  I found this when I placed a USB powered speaker into a hub that the Fire Stick was plugged into.  While doing so did not effect my WiFi, it made terrible noise.  Since the speaker is battery operated I unplugged it and instantly the problem sound was gone.The difficulty with the remote.  I struggled to insert the battery until I happened up on this little trick.  Where the door slides closed.  If you can get your fingernail just barely in that small crack and press down slightly on the door while sliding it back it comes open with the greatest of ease.  This might be easier for us guys.You can add mouses and bluetooth keyboards to this little jewel by sideloading the settings.apk app and launching them from inside the application manager inside the native settings menu.  It really is easier than it sounds. The only thing I have not successfully sideloaded is apps that require play services - like google+ and the play store itself.  That is fine because with the FireADB I can easily send the apps I get through my phone to the Fire Stick in just a minute over the WiFi.I have attached a photo of mine sporting some holiday cheer.", "verified": true, "helpfulness": "46/48", "author": "Ben Walker"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Raymond H Thaxton"}, {"rating": 1.0, "review": "We tried, we all tried to no avail.  Kept dropping internet signal.  When it did keep signal we could not load anything.  I bought for husband so adult children could set up.  One son is an engineer and he said \" what a piece of junk\".Amazon- shame on you.  If it can't work for the average person with a new TV , cable and a few intelligent people (  Ph.D,  NP &)  RN)  how in the heck is it suppose to work for us at 55yrs?d", "verified": true, "helpfulness": "1/2", "author": "anurse"}, {"rating": 5.0, "review": "Got it for half off but worth the full price.  It compliments my Prime membership and I'm loving it.", "verified": true, "helpfulness": "0/0", "author": "B I."}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Israel gonzalez"}, {"rating": 2.0, "review": "Very portable, but the software is not on par to play movies in HD reasonably. Used with my Panasonic HDTV, plugged into the USB, and the setup was easy with a few clicks. When used with the Internet service of 15Mbps (SuddenLink), the movies in SD were simply unpleasant and viewers got discouraged - forget about HD. So upgraded the internet speed to 30Mbps, movies in SD played okay but still stuttered from time to time - HD was on and off based on the bandwidth, and then the message popped up complaining the Internet speed. My Panasonic HDTV has a built in Amazon Prime Video app, so I plugged the ethernet cable into the HDTV and connected it to the router. Logged in, and tried to play the same movie like Jack Reacher, and etc., very smooth or anything, it plays in HD.Please note, if you have higher Internet speed (like 50Mbps), the experience might be better. I might keep it for travel, hoping amazon will upgrade its software on this Fire TV Stick soon enough to fix those playback issues.", "verified": true, "helpfulness": "0/0", "author": "1.apple.sfo"}, {"rating": 5.0, "review": "Easy set up works wonderfully with my 7 year old flat screen TV. Was worried that the navigation would be awkward and slow, but it's anything but. I have had it for 5 days now and just love it. A easy inexpensive way to make a older TV a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "Started using it this morning. Worked great after the software update. Everything is lightning fast. I plugged it into my hdtv and followed the directions and it worked so well that we unplugged it and tried it in our \"smart\" tv to see if it would stream faster.  It does! I ordered a second one for our smart but not speedy \"smart\" tv.", "verified": true, "helpfulness": "0/0", "author": "BarbaraS"}, {"rating": 5.0, "review": "Pros: easy setup, great video quality on 42 inch tv. Casting from my android (galaxy s4) is easy.Cons: have to plug it in for performance reasons", "verified": true, "helpfulness": "0/0", "author": "Ian B"}, {"rating": 5.0, "review": "So cool! Hooked it up in a minute, was streaming a flick and listening to tunes right away!Has a super fast search engine and the remote works great.Turned my dumb tv into a smart tv for $39....thanks amazon!!", "verified": true, "helpfulness": "0/0", "author": "chipper"}]