[{"rating": 3.0, "review": "Dont know if its the service, the stick or my wifi but some programming does not work as well", "verified": true, "helpfulness": "0/0", "author": "E. Hernandez"}, {"rating": 5.0, "review": "Too bad all I could buy was one at that great price of $20", "verified": true, "helpfulness": "0/0", "author": "CS"}, {"rating": 5.0, "review": "Yea I can now watch everything and I love this! Thanks so much. I have a guest room and decided to give my guests all of the same programs I watch in my own room. Cost is so reasonable for what you get! I would definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Liz Hart"}, {"rating": 2.0, "review": "The Amazon TV Stick works smoothly but it has a fatal flaw. It uses huge amounts of data. I travel extensively and had hoped to use the Amazon TV Stick with my cellular data plan. It connects easily and produces nice quality video. However, watching a single episode of a tv show (about 50 mins) using the Amazon Stick uses 3gb of data. I have set it to 720p rather than 1080p and have made sure that the screensaver is not set to mosaic (which is Amazon's stance on why it chews through data). But, it consistently uses 3 gb of data. Watching the same series from Amazon through a computer uses between 750mb and 1gb. This is a fatal flaw for a device designed to be portable if you intend to use it on a metered internet connection. So, be aware that this is a pretty nice device if you have unlimited data but is a terrible device for use on a plan with a data cap.", "verified": true, "helpfulness": "2/3", "author": "wmbarryd"}, {"rating": 4.0, "review": "I bought two of these as Christmas gifts, and I have had the chance to use them as well.  Overall the product is good, its small, has fairly good wifi strength, and the interface is quick.  However I am very disappointed in the fact that you must plug the stick into the wall for power, it is not able to run off another usb plug for power or its own usb plug which would be the best.  So know that you still will be plugged into the wall, which means a cord.  I rated this four stars because the price/performance/convenience is so good.", "verified": true, "helpfulness": "1/1", "author": "Bar ten"}, {"rating": 5.0, "review": "I love the Fire TV Stick!!!! It's super easy to install, and very easy to use. I love that you have so many movies, tv shows and love the games too. I would definitely recommend this device for all.", "verified": true, "helpfulness": "0/0", "author": "Dawnky"}, {"rating": 2.0, "review": "Sadly, this Fire Stick does not work as well as I had hoped.  I generally love everything Amazon, but this was a disappointment.  It often stops working and I have to reboot by unplugging the USB from the stick.  I don't like that they don't advertise that there is indeed a wire connecting the stick to an outlet (I was hoping to minimize wires).  Most importantly, I do not like that there are VERY limited apps for Fire Stick.  If you ONLY use Amazon for streaming, this is a good device, but otherwise I would recommend the Roku Stick.", "verified": true, "helpfulness": "1/1", "author": "PPS"}, {"rating": 5.0, "review": "We LOVE IT! We had been using Chromecast,  which was okay. A bit of a hassle using the phone app.Now using the Fire Stick it is fantastic! We  watch a lot more of Amazon than we used too and just started listening to music. Wonderful, wonderful, wonderful!For those of you using a Denon... I used an optical cable from the television's digital audio output into the Denon. Now, my Denon is a much older model, an AVR-3805, so I plugged it into an optical input for a function I'm not using. The sound is fantastic! We have listened to classical and rock and roll and the sound is great!The only thing I would add is being able to search for programs and movies on my phone. I have tried looking on the Amazon app, but it doesn't have a button to look at Prime like the desktop. If a button could be added, or a separate app created, the Fire Stick would be perfect!", "verified": true, "helpfulness": "0/0", "author": "Sailcat"}, {"rating": 5.0, "review": "I received the Fire TV stick as a gift.  It was easy to set up and performed perfectly as advertised.  I have used it both at home and traveling where Wi-Fi is available.  Great results in all cases.", "verified": true, "helpfulness": "0/0", "author": "JPW"}, {"rating": 5.0, "review": "Before this amazing item , I purchased an Apple TV. Absolutely hated the Apple TV. It was cool at one point but now that other companies like Amazon , roku, Google, etc. Have caught up. Apple TV is way behind in the game.  Sure air play is cool but this stick offers that as well. It's just as great as the Amazon TV. So cheap for such a great gadget", "verified": false, "helpfulness": "0/0", "author": "Lisette montanez"}]