[{"rating": 5.0, "review": "We plan to stop our satellite service and utilize the fire tv  instead. Will save a lot of money.", "verified": true, "helpfulness": "0/0", "author": "jwolf45887AW"}, {"rating": 5.0, "review": "I bought this so I could watch \"Bosch\" on Amazon Prime on my television in the living room rather than my computer.  And for \"Longmire\" if it ever comes to Netflex like it is supposed to.  Easy to install.  Works great.  Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Siame \"the beautiful\""}, {"rating": 5.0, "review": "Fantastic works great!!!", "verified": true, "helpfulness": "0/0", "author": "Jason keys"}, {"rating": 4.0, "review": "I would have given this 5 stars, but we have one that we have to unplug and keep plugging back in for it to work properly.", "verified": true, "helpfulness": "0/0", "author": "Robby"}, {"rating": 3.0, "review": "I've had Fire TV (including the game controller) for almost a year now and it's now a 5-star performer.  The Fire Stick performs at about 3/5ths the level of the Fire TV.  So it's a decent value, but due to its location behind a flat-screen TV, the Wi-Fi performance is mediocre.  That's obviously not a problem of the unit, but even when it's operating maximally, it's slow compared to the bigger box.  But it's exactly what I needed and expected.", "verified": true, "helpfulness": "0/0", "author": "Boydster"}, {"rating": 4.0, "review": "Sometimes it is jumpy and not smooth, but it lets me watch Netflix, HBO Go and Showtime, which I like.  Unfortunately cannot watch Amazon Prime TV since I am not the primary Prime account holder.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 3.0, "review": "I received this mainly due to having signed up with Sling TV (had other options but chose the Fire TV Stick) so I expected it to work really well with that app.  Most of the time it does, but several times it will stop and buffer itself, sometimes almost immediately after having just buffered, literally seconds later.  This is not a good thing when you're watching live TV!  Sometimes it will have \"glitches\" as well.  And then there's the Hulu app.  It is really \"hit or miss\" with it.  Some days it plays perfectly, others not so much.  You have to back out completely and start the app back up multiple times to watch a show - the longer the show the worse it is.  It seems to be getting better, but...My biggest complaint is what sometimes seems to be an excessive amount of buffering, even with Netflix.  If they could fix that problem, this would rate even higher than the three stars I've given it.  (I do own two of them, however, one was free for signing up with Sling and the other one I bought).", "verified": true, "helpfulness": "0/0", "author": "Mike H"}, {"rating": 1.0, "review": "Continues to lose connectivity, have playback errors and the wifi connects with a \"very good\" signal strength but then occassionally bumps to \"connected with problems.\"", "verified": true, "helpfulness": "0/0", "author": "lockie"}, {"rating": 4.0, "review": "We have digital cable on our \"main\" television in the living room - with movie channels and sports. Our bedroom TV has basic cable. Sometimes, we wish we could watch movies in the bedroom, so I decided to see what our options were. Since I am a Prime member, we had an entire catalog of TV shows and movies at our fingertips - on the computer. I decided to give the Fire TV Stick a try to see if we could now use the bedroom TV for something besides reality TV show reruns. Easy to install, but the little cable thing that comes with it is pretty short - and our TV is wall-mounted, so right now, we have it rigged so it doesn't hang down (we still need to figure that one out - thank goodness for velcro bands).The assortment of movies, TV shows and songs is great! And no fee (other than our Prime yearly fee). I would have given this 5 stars EXCEPT that twice during a movie, the screen buffered and we had to close out and start the movie back up again - a pain. But I'm not entirely sure it was Amazon Fire TV Stick's fault or if it was my network.This is a great value and a nice assortment of free and low-cost movies are available. We may get the Amazon Fire TV Box for the living room and cancel all 4 of our movie channels. Good job overall, Amazon!", "verified": true, "helpfulness": "0/0", "author": "AnnieBanana"}, {"rating": 3.0, "review": "Works OK at home, not so well when traveling.  For instance, I can get Netflix on an Asus Google Nexus 7 in less than 2 seconds, while the Fire Stick repeatedly loses the same wireless connection. Still prefer the Roku Streaming Stick for now.", "verified": true, "helpfulness": "0/0", "author": "Gary Bruns"}]