[{"rating": 3.0, "review": "I have a Roku and this.  The Roku is far better.  Much easier to use than this is.  This is very slow to respond and tonight it has stopped working completely and it is seldom used so should not have gone out this soon.", "verified": true, "helpfulness": "0/0", "author": "zzz"}, {"rating": 5.0, "review": "With summer reruns everywhere it is so nice to sit down and watch a great movie. And no commercials!!", "verified": true, "helpfulness": "0/0", "author": "Brandi Benson"}, {"rating": 4.0, "review": "Had some issues connecting to my router in the same room as the router.  moved Fire TV Stick to another room away from the router and it works great.", "verified": true, "helpfulness": "0/0", "author": "jeremy gibson"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Nicole A Ransom"}, {"rating": 4.0, "review": "Good selection or apps. Interface is a little slow and crowded though. Overall a good product.", "verified": true, "helpfulness": "0/0", "author": "Prakash Kini"}, {"rating": 3.0, "review": "Product does what it is supposed to do, however it is causing some kind of radio interference with my over the air antena which means that I have to unplug my FireStick if I want to watch OTA TV.", "verified": true, "helpfulness": "0/0", "author": "Dan Houston"}, {"rating": 1.0, "review": "It works really slow and I can't install the Amazon Fire TV Remote App on any of my android devices (it's a country issue I guess).Netflix doesn't work.The only useful free app is youtube.Something good? I can pair it with my youtube app on my android cellphone.Edited: netflix works properly.", "verified": true, "helpfulness": "0/0", "author": "Nicolas"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "R. Franklin"}, {"rating": 5.0, "review": "It performed precisely as advertised.  Set up was easy.  If you need to turn a dumb tv with an HDMI port into a smart TV, look no further.", "verified": true, "helpfulness": "0/0", "author": "Daniel M."}, {"rating": 5.0, "review": "The best", "verified": true, "helpfulness": "0/0", "author": "Kaydyn"}]