[{"rating": 5.0, "review": "Super easy to install and use. You don't have to connect to your computer/phones as with other devices, just connect to your internet and log on to your accounts. We had it up and running in minutes.I only wish we'd purchased it sooner.", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 3.0, "review": "I prefer Roku!!", "verified": true, "helpfulness": "0/0", "author": "Jamie Jones"}, {"rating": 4.0, "review": "Received as a gift. Connected to a 32\" Sharp LED TV. The TV USB port supplies enough power for it work so the adapter isn't needed. Once I authenticated with my Amazon account I had access to all my Prime content.Added the Netflix app and connected to my account. Works great.", "verified": true, "helpfulness": "0/0", "author": "Al Strom \"al\""}, {"rating": 2.0, "review": "Will not work with Netflix - Get error message about Netflix internal errors, but my Roku Player works fine on the same TV. Am trying to find a solution. It appears Netflix and Amazon want to blame each other for what seems to be a common long standing problem.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Does what it's meant to do. Faster than my Roku stick. All around I would recommend it!", "verified": true, "helpfulness": "0/0", "author": "Jason S."}, {"rating": 4.0, "review": "man this stick is like going from 0 to 60mph in 5 second  . nice and easy", "verified": true, "helpfulness": "0/0", "author": "Denny B."}, {"rating": 4.0, "review": "Tremendous bargain for what it offers but it's not really a \"cord cutting\" devices as services like the excellent ESPN app require a subscription through your cable company. However, be aware that your cable provider (thanks for nothing, Charter!) may limit streaming of premium channels you already own.", "verified": true, "helpfulness": "0/0", "author": "Rob Oliver"}, {"rating": 4.0, "review": "I am a Amazon Prime member and expected more free \"network TV\" network options.  I just installed it, pretty easy to install and provides movies and apps.  However, you have to download the apps as you go.  Moreover, seems like a lot of upselling to pay for features.  I am giving it a try and we'll see as we go along as to the value it brings.", "verified": true, "helpfulness": "0/0", "author": "Jim G."}, {"rating": 5.0, "review": "I absolutely LOVE it!! I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "maria Kelly"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Rhonda"}]