[{"rating": 5.0, "review": "Better than anything else out there, purchased one for every family member.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This stick is great.  It beats out all the other ones.  Functions perfectly and used with the downloaded app for voice control its perfect.", "verified": true, "helpfulness": "0/0", "author": "Houstoer"}, {"rating": 4.0, "review": "Great addition to our TV viewing.", "verified": true, "helpfulness": "0/0", "author": "Nancy Fuleihan"}, {"rating": 5.0, "review": "Super easy to install and set-up. I also  have an Apple TV and I think the Fire Stick works just as well and possibly even better.  The price is very reasonable for what you get.", "verified": true, "helpfulness": "0/0", "author": "Lori C"}, {"rating": 2.0, "review": "OK, folks, let me save you some exasperation on this little device. You CANNOT adjust the specific RATINGS of the video content allowed on the Amazon Fire TV Stick. I just spent a good hour on the phone with three different Tech Reps from Amazon discussing this and was finally informed that it is an all-or-none selection. You either restrict ALL programs (even \"G\" rated) and the user has to enter a pin number to unlock ALL programs or you turn off the parental control entirely and ALL programs are watchable. Not a very logical choice as I would like to set the program ratings (like allow \"G\" but not \"PG\" or greater) but no deal, it's not possible. Good Grief Charlie Brown, who thought this up? The device is a perfect size for a remote kids room, except for the little bitty tiny issue noted above....! Don't buy it if you have the thought of using it in a room where you are not constantly present to monitor what is being watched.", "verified": true, "helpfulness": "0/1", "author": "G. Shaw"}, {"rating": 5.0, "review": "love it why do we need cable? I just canceled my cable service and will save tons of money!", "verified": false, "helpfulness": "0/0", "author": "Nicholas Galeota"}, {"rating": 5.0, "review": "Absolutely Love!", "verified": true, "helpfulness": "0/0", "author": "S. Champeau"}, {"rating": 5.0, "review": "The Fire Stick works great.", "verified": true, "helpfulness": "0/0", "author": "John W. Smith"}, {"rating": 4.0, "review": "If your like me, and half the population of the united states, you are sick and tired of high package prices from your satellite or cable provider. i recently had faster (cable internet) installed, and i figured i should start taking advantage of that speed. i researched various streaming devices, the chormecast, roku and others. i ultimately decided on the amazon fire tv stick. i was going to get the fire tv box, but where this is my first streaming device, i wanted to give it a try first, and at $39.00 for this, you can't go wrong.my current bill for Directv is 105.00 a month. yes, you read that right 105.00! that includes the package and DVR service, which alone cost 25.00 a month plus taxes.so, let's just say for sake of argument, you ditch your satellite or tv provider and use just the amazon fire tv stick for streaming your tv.amazon prime is $8.99 a month.netflix runs $7.99hulu plus is $7.99for a grand total of $24.97 a month. $105.00 minus $24.97 a month equals out to a $80.03 per month SAVINGS!!not a bad deal if you ask me. most people only really watch a few channels on their tv anyway,, so we are paying all that money just to watch a few shows.  i just got my fire tv stick yesterday (august 18, 2015) and i have ALREADY went to my directv account and moved my package to the cheapest one available, and when contract is up, i am canceling the service. :) if current trends continue, streaming will have more active accounts than satellite or cable. maybe this will cause the satellite and tv providers to make their outrageous rates a little more down to earth. but i'm holding my breathe on that one.The Device is small and sleek, comes with the HDMI stick, and power adapter. I've read that you CAN use the stick without the power cord attached, but then the fire tv nags your anyway to plug it in.. so i just plugged into wall from the beginning to avoid this annoyance.if you don't have a prime membership, i suggest you get one. plenty of shows to watch, movies, and music and shows. most are INCLUDED in the prime membership. however the new releases you do have to pay for, but that is anywhere really. pay per view on my directv cost 5.99 per HD movie. which, IMO is reasonable. and it sure does beat going to theater and paying 15.00 plus for ONE ticket. amazon prime is a good value for the $99.00 a year price tag, you get movies, music, and even some games. you can play games on the fire tv stick, and if you want to upgrade, you can get the game controller for an additional $40.00when purchased this stick is automatically linked to your amazon account, and any purchases, movies, music etc show up. the user interface is very intuitive and not hard to navigate. there are hours and hours of content available, and you won't get bored with this. the stick comes with 5.57 gb of internal storage space. that space is reserved for your apps. netflix, hulu, games etc. i have lots of apps, flixster, spotify, cbs news, crackle, pluto, weathernation, etc and i still have plenty of room. if i remember right if you get low on space you can store apps on the cloud, or uninstall apps that you don't really use to free up more space. from my research the only real difference in this and the fire tv box is that the box has more onboard RAM and is more suitable for gaming. i have 2 tv's in the house here, so in due time i will probably purchase a fire box for the other tv. which will set you back $99.00. there is a parental control option which requires a PIN number to be entered before any content can be purchased. this is very useful if you have kids, because they can rack up a bunch of unwanted charges and your not aware until you get that dreaded credit card bill at end of month :)i know your dreading this, but here are the cons:-remote is small and takes some time to get used to the buttons. it has a directional pad, and six buttons. they are pretty intuitivein theory, but certain apps respond differently to the buttons.-NO DVR functionality..-you may encounter BUFFERING/Stuttering issues-you wont be able to watch most of your favorite shows LIVE on the day they are broadcast.-no access to local programming (news, sports etc)-remote doesn't have voice search. you can purchase a remote with voice search built in but it costs extra. i'm not a fan of those voice search remotes, half the time they don't understand what your saying, the the flusteration outweighs the good in this case.all in all, this could very well be a game changer on how you get your entertainment. i just received this yesterday, so i haven't quite figured out the entire experience yet. But, so far, this is win win for me. I think it is also worth noting that you need a very fast internet connection to make this work well. if you are on dial up, or dsl, forget it. my current cable connection averages 5mpbs to 15.50 mbps. but,usually in primetime hours, my connection drops to around 2-3mpbs. which works fine for netflix and amazon prime video, but my cause issues in other applications, excessive buffering etc.for local access (news weather etc) you can purchase a HDTV and pick up the signal over the air for free. in this scenario, you have all the entertainment you need for far, far less than your forking out each month to your cable or satellite provider. this is a great investment, and will save you alot of time and money. pick one up today, i'm sure glad i did. and this is just my 2nd day using it.i will update this at a later date. I really think amazon was Spot on with this one :)", "verified": true, "helpfulness": "1/1", "author": "Rudy \"rainmanva\""}, {"rating": 5.0, "review": "Great to have when there is nothing on the million cable stations!", "verified": true, "helpfulness": "0/0", "author": "Sue Robinson"}]