[{"rating": 5.0, "review": "Where have you been all my life Amazon Fire TV Stick?  This is the next best thing since sliced bread and I am loving it!  Faster than my Sony Network Media Player.  Great applications!", "verified": true, "helpfulness": "0/0", "author": "Sonja Payne"}, {"rating": 5.0, "review": "Unexpectedly surprising. It's fast and efficient, suggesting content based on your interests. I own both an Apple TV and now the FireStick, and can say Amazon is closing the gap between itself and Apple. Great media enhancer.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "Vert good, except I had to cvall my granson in order to sign in.I live in Panama and the Stick wpiuld not recpognioze my stattion.Oncew cleared, is quite a Stick. Congratulations.Ricardo Maduro", "verified": true, "helpfulness": "0/0", "author": "Ricardo Maduro"}, {"rating": 4.0, "review": "Simple review - easy to install - lives up to all its promises - love it!  Only thing keeping it from 5 stars is a little broader selection of newer TV series seasons", "verified": true, "helpfulness": "0/0", "author": "Mizzourunner"}, {"rating": 4.0, "review": "I purchased Fire TV Stick in December of 2014, It worked great and we really enjoy all the shows that are available, however, the Fire TV stick stopped working recently and couldnt get it to work, replaced new batteries, reviewed the installation procedures, and try unsuccessfully to get it to operate again, so we have repurchased a new one in hopes we have better luck with our new purchase.  I wanted to call customer service but was unable to locate the number.  I hope our new purchase will work out better for us as we really enjoy the varieties of shows available on it.", "verified": true, "helpfulness": "0/0", "author": "James R Trehearne"}, {"rating": 5.0, "review": "ITA AMAZING HOW I LIVED THIS LONG WITHOUT IT !!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We got our first stick as a combo when purchasing Sling TV. I plugged it into our HDMI port and into the wall for power and got nothing. No welcome screen, nothing. Our TV found it fine, but still blank screen. I searched online about older Samsung TVs (which we have) and thought that might be the issue. Eventually, after trying everything I could, I called customer support.After getting through to the third layer of support, I talked to a woman who agreed to send me out a new one to make sure mine wasn't defective. I got it, plugged it in and it was fine. Never had any issues since. Turns out the first one I received must have had something wrong with it. So, in case this is the same for you and you've done all your troubleshooting, contact them and get a replacement.", "verified": true, "helpfulness": "2/2", "author": "shawn washburn"}, {"rating": 5.0, "review": "i really enjoy my fire stick! the pbs app is cool for kids and i've been having fun discovering. i want to game remote though!", "verified": true, "helpfulness": "0/0", "author": "Ms Mj"}, {"rating": 3.0, "review": "still needs a few more channel options, especially the History channel", "verified": true, "helpfulness": "0/0", "author": "thomas garner"}, {"rating": 4.0, "review": "Really like the easy to set this up.  Great promotion with Sling Tv and I got the Stick for FREE - can't beat that price.", "verified": true, "helpfulness": "0/0", "author": "Burne Hill"}]