[{"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "Kelsey  Stockwell"}, {"rating": 2.0, "review": "great idea and easy to work, but with in app purchases it was a let down, and limited content even worst...i can get all i need on an xbox or ps3 and that makes this item not that good, besides having to plug it in to a power supply (i would say if you have nothing its worth getting) but if you have stuff... don't...", "verified": true, "helpfulness": "0/0", "author": "Luxas"}, {"rating": 5.0, "review": "I have a Roku stick which I really liked, but the Fire Stick is even better and for less money.", "verified": true, "helpfulness": "0/0", "author": "Bob Graybosch"}, {"rating": 5.0, "review": "Did not want to spend the extra $15.00 (per TV for the cable boxes)a month for the TV on our teens  rooms.  The AMAZON stick is the best invention ever.  $39.00 and they can watch all their shows.", "verified": true, "helpfulness": "0/0", "author": "megan"}, {"rating": 5.0, "review": "Amazon did a great job on this product and kudos for the awesome IOS remote control app. After a few days of usage, I prefer the Fire TV stick over my Chromecast. It's very easy to use and has an intuitive interface. It has all the apps that I generally want to use (Prime, Netflix, lots of News options and Spotify). The remote is great as well. In contrast to Chromecast I like that I don't need to first load up an app on my iphone/ipad before \"casting\" to the TV; this cuts out alot of the bugginess you can get in that scenario (ie. netflix on ipad not registering that the chromecast is connected, yet it's playing a netflix stream... that sort of thing).", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 3.0, "review": "I was hoping to find something superior to Apple TV or Chromecast.  Probably not worse, but, certainly not better. I can't find a good \"mirroring\" app for ipad.  I thought that it might be better than Roku or Apple TV for working with Slingbox, but, mirroring would be the only solution, and I haven't found a mirroring app for this yet.  Roku is better at Slingbox.  Fire TV is better with Prime Movies and TV.  Its worth $39, but, its largely redundant without much to offer if you have one of the other streaming devices.  If tv's had unlimited HDMI ports, it would justify a permanent place, but, it looks like the Apple TV will be connected most of the time unless the only way to watch a program is on Prime.", "verified": true, "helpfulness": "0/0", "author": "Hoovermom \"Debbie Starner\""}, {"rating": 5.0, "review": "Traded in my Roku 2 for this, I LOVE the Fire stick. Much better user interface, low profile, very easy to use. I recommend this whole heartily over the Roku.It does slow down in bits, but I certainly can't fault it for that.", "verified": true, "helpfulness": "0/0", "author": "Reed Wilson"}, {"rating": 5.0, "review": "So excited to get the firestick...Amazon is producing shows we want to watch!!! It took a few minutes to hook up (well, a while, actually) but once it was, we've been on a jag...watching Bosch and about to watch Transparent...love it!", "verified": true, "helpfulness": "0/0", "author": "Louise De Teliga \"author of Fashion Slaves\""}, {"rating": 5.0, "review": "It is great", "verified": true, "helpfulness": "0/0", "author": "MPie"}, {"rating": 5.0, "review": "My daughter LOVES it and so do I!!  So easy to work!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]