[{"rating": 5.0, "review": "Can't bet it", "verified": true, "helpfulness": "0/0", "author": "Tonnya Storey"}, {"rating": 2.0, "review": "Need to inform what I get free and what u have to pay for  not bad for 39$", "verified": true, "helpfulness": "0/1", "author": "Jeffrey S Hall"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Bill Campbell"}, {"rating": 5.0, "review": "It was so easy to install and started working immediately. We really like the Fire TV stick", "verified": true, "helpfulness": "0/0", "author": "Freedom1868"}, {"rating": 5.0, "review": "It is awesome!", "verified": true, "helpfulness": "0/0", "author": "Nancy Westerhoff"}, {"rating": 3.0, "review": "Wanted to use the Stick in the living room but it was too far away from the router and operation was intermittent. Moved it to the master bedroom a lot closer to the router and the operation is good there. Installation was quick and easy.", "verified": true, "helpfulness": "1/1", "author": "Rhettcoz"}, {"rating": 5.0, "review": "Synced up easily, remote was simple to use..It is everything I hoped it was.", "verified": true, "helpfulness": "0/0", "author": "Gary Hutton"}, {"rating": 5.0, "review": "There are great features that this little device brings to the media market. I like that not only does it do the regular video applications but you can listen to music and view images from my Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "Nomore MS \"Bob\""}, {"rating": 3.0, "review": "its okay. i din't realize i wouldn't be able to pull up the competition, like Pandora or Ihart radio, or at least i hadn't figured out how. as a prime member thats ok because they a lots of free music any way. the draw back to that is that you have to sit in front of a computer and load it like iTunes. I haven't really used for anything but music at this time but that is what i bought it for.", "verified": true, "helpfulness": "0/0", "author": "Randy J. Bye \"Bike Camper\""}, {"rating": 5.0, "review": "I have a roku and chromecast and by far this is a better solution from ease of use and user experience.  I have smart televisions in the house and I have switched them over as well.  Overall, nice design and function.  I have not played with Apple TV as much yet, but it's right there thus far", "verified": true, "helpfulness": "0/0", "author": "dhakimi"}]