[{"rating": 3.0, "review": "Highly disappointed. But I suppose it's my fault for not researching this product more thoroughly. This device does not deliver 1080p. I had my laptop connected to my TV for the longest time because it allowed me to watch 1080p on a big screen. I thought the Fire Stick would be a good idea because I'd be using my laptop less for such applications--I also figured there would be less clutter on my desk with the Stick. The device is compact, easy to take with you anywhere, and has some other nice attributes. Still, I am disappointed with its output. Plus, one would think that if it plugs into the TV's HDMI input, it should be HD! Not only that, but I am constantly seeing the TV stick being used in advertisements without a power cord--you have to plug in this thing for it to work. I assumed the HDMI input would charge the TV Stick. Well, you know what they say happens when you \"ASSUME.\" I am not saying this item is completely terrible, because some will undoubtedly find it useful.", "verified": true, "helpfulness": "0/0", "author": "mark \"Mark Valdez\""}, {"rating": 1.0, "review": "Wasted money...my tv does Not have a port.. it's only about four years old..Geeze..anyone have a suggestion on how top Jeri rig it top make it work????  The port it does have dosen't work with the stick.. I had to call to get the tv back on line....geeze...sounds sho easy but not for me....", "verified": true, "helpfulness": "0/1", "author": "Sharon \"Sue\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Kristen T."}, {"rating": 4.0, "review": "Cancel your tv subscription.", "verified": true, "helpfulness": "0/0", "author": "jesusunit"}, {"rating": 1.0, "review": "Did not work with my equipment.", "verified": true, "helpfulness": "0/0", "author": "M. Wiggins"}, {"rating": 3.0, "review": "Having trouble using it on my Vizio TVs.  Both Vizios turn off automatically when fire stick is connected, one will not connect to the internet.  Works well with my Samsung.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Gallegos"}, {"rating": 5.0, "review": "Amazing Device!", "verified": true, "helpfulness": "0/0", "author": "wissam agsous"}, {"rating": 5.0, "review": "I simply recommend it. Easy to figure it out. Love it.!", "verified": true, "helpfulness": "0/0", "author": "Francisca S."}, {"rating": 1.0, "review": "I ordered this because my in-laws purchased one and they highly recommended it. However, when I received mine, I have been having trouble all day trying to connect to my WiFi. I have multiple devices and consoles that require WiFi connection and everything connects but this Fire TV Stick. I have even restored the stick to factory settings, tried different HDMI slots and another TV just to make sure it wasn't just mine. I kept receiving error messages such as \"check your password\" \"the signal is too low\" \"contact amazon or your internet provider\" \"signal is not in range\". I know it is not my WiFi because, like I stated before, every other device I have connects with ease (xbox one, ps4, laptops, iPad, iPhones, Windows Surface, smart TVs, etc.) I returned my item and do not plan on purchasing another one.", "verified": true, "helpfulness": "0/0", "author": "Miss_Dre"}, {"rating": 5.0, "review": "great for cord cutters", "verified": true, "helpfulness": "0/0", "author": "Daisy Lynn Bolling"}]