[{"rating": 5.0, "review": "Why did I wait so long to try this? I can download free apps and now I can watch the NASA channel,Diabetic Living and others that I don't get with cable.  I can also watch the Alpha House on TV instead of my Kindle....awesome! awesome AWESOME!!!!", "verified": true, "helpfulness": "0/0", "author": "Karen J McLaughlin"}, {"rating": 5.0, "review": "Cut the cord to DirecTV. Bought Fire TV Sticks for 2 of our teens bedrooms. Love them. Bought the regular Fire TV for the living room first. All 3 came pre-set to our account and were a simple plug in and begin using. We find that both types work equally as well for the way we use them (tv watching). We've had no issues with streaming multiple devices at once. Thoroughly worth the money, especially as Prime members with the oodles of movies & tv shows included.", "verified": true, "helpfulness": "0/0", "author": "Simply Chasity"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is great!  First, it essentially turns your non smart tv into a smart tv.  Secondly, the remote and stick are slick and so easy to set up and working.  Lastly, the remote is completely awesome and works like a charm.  The signal on it is great and you don't even need to point it at the TV.  It's all around awesome!", "verified": true, "helpfulness": "0/0", "author": "Joseph Giangreco"}, {"rating": 3.0, "review": "Encountering streaming problems when watching tv shows on Netflix.  Not so much with movies.  Also, not worth the extra hassle.  Easier to watch Netflix online.  Is okay but not worth $40 price tag.", "verified": true, "helpfulness": "0/0", "author": "Valerie Hedgepath"}, {"rating": 5.0, "review": "It super good", "verified": true, "helpfulness": "0/0", "author": "jorge"}, {"rating": 5.0, "review": "Worked as expected.  Lots of content with Amazon Prime - Also has plug-ins for other sources (Netflex, etc.)  Great value for the money.", "verified": true, "helpfulness": "0/0", "author": "searay74"}, {"rating": 5.0, "review": "Love, Love the Firestick.  I've been Amazon Prime for awhile now and love how easy this was to set up and use.  I plan to buy the remote next.", "verified": true, "helpfulness": "0/0", "author": "Lorraine Reichard"}, {"rating": 1.0, "review": "THE WORST! You can't stream anything unless you plan on watching it buffer 10 million times -- RETURNING!", "verified": true, "helpfulness": "1/1", "author": "Elizabeth Molnar"}, {"rating": 4.0, "review": "VERY SIMPLE TO INSTALL", "verified": true, "helpfulness": "0/0", "author": "heythere"}, {"rating": 5.0, "review": "AWESOME!  Enough said.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Seatchecker\""}]