[{"rating": 5.0, "review": "Awesome.  Much better than the Roku it replaced", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "Was using WDTV from Western Digital, which I thought was pretty good.  I got the Fire TV Stick to take advantage of Amazon Prime, but WHOA! so much easier to use than the WD!  It is an excellent streaming device, and the opening menu is so good.  For $39, you can't do any better.Only issue I have is with setup - ultimately, very easy to do, but it would be helpful to have the descriptive video come on before setup (if only there was a way).  The remote is extremely simple to use, once you figure out how to use it.  The video explains it, but by the time you get to the video, you've already figured it out (or you wouldn't be watching the video, now, would you?).", "verified": true, "helpfulness": "0/0", "author": "J.P.P. \"prfesser\""}, {"rating": 5.0, "review": "Tho is wonderfull for the price I loved", "verified": true, "helpfulness": "0/0", "author": "maria sierra"}, {"rating": 5.0, "review": "This is simple to use, effective and provides instant access to my Prime Account. It is easier to add content to my watchlist via the main Amazon site then via the Stick.", "verified": true, "helpfulness": "0/0", "author": "Dennis Reinhardt"}, {"rating": 5.0, "review": "Works great! Love not having a monthly bill for cable", "verified": true, "helpfulness": "0/0", "author": "Whitney Long"}, {"rating": 4.0, "review": "like being able to listen to my music too!", "verified": true, "helpfulness": "0/0", "author": "kathryn manizza"}, {"rating": 4.0, "review": "Works way better than my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Ryan Fisette"}, {"rating": 5.0, "review": "Its everything i expected. Easy to setup and easy to use.", "verified": true, "helpfulness": "0/0", "author": "backstreets77"}, {"rating": 5.0, "review": "Outstanding!", "verified": true, "helpfulness": "0/0", "author": "A"}, {"rating": 5.0, "review": "nice system user friendly", "verified": true, "helpfulness": "0/0", "author": "Thomas T."}]