[{"rating": 5.0, "review": "AWESOME!", "verified": true, "helpfulness": "0/0", "author": "JennMM"}, {"rating": 5.0, "review": "This product is awesome! In the words of my father, it makes a dumb TV a smart TV", "verified": true, "helpfulness": "1/1", "author": "Michael Wadsworth"}, {"rating": 4.0, "review": "The Fire Stick is a great product. Worked out fine when, I figured out to go to the HMDI 2 part on my Samsung 2009 section on my TV.\"source\" the go down to HMDI 2, and the Menu came up. It didn't come up automatically. And watching YouTube Videos of how to Install didn't help they kind of skip that part or it comes up automatically on newer TV's or not as Tech challenged as I am.Since I am a Amazon Prime member and have other Amazon Cloud etc. My Information was automatically there was no problem on setting up. Yes I have somewhat problems on getting on and some waiting but that could be mainly my Internet speed and less to do with the Fire Stick. The movies and shows work great what it gets going. I love what the stuff on the TV or trying to watch on my Kindle Fire.", "verified": true, "helpfulness": "1/1", "author": "Julie A. Requa \"grandmathora\""}, {"rating": 4.0, "review": "In the beginning I like it. Still working on it. I am one of those people who didn't have enough megabytes and didn't know it. So  I am in the process of upgrading. Of coruse so is the expense. I know it will be worth it once I complete all the changes.", "verified": true, "helpfulness": "0/0", "author": "Cathy Evans"}, {"rating": 4.0, "review": "Better than my smart Blu-Ray player for sure, especially for watching Amazon Prime stuff.  I wish the remote had a volume control though.  Also, you've got to plug this thing into the wall, and Amazon kind of hides that fact in there product advertisements.  Be real, you punks...", "verified": true, "helpfulness": "1/1", "author": "jacbethke"}, {"rating": 5.0, "review": "so far so good.  The tricky part for me is to remember which direction to push the button.  It is convenient and moves quickly thru the menu.  For that reason alone for certain movies I prefer it to my Roku.", "verified": true, "helpfulness": "0/0", "author": "J. A. Ford"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "I'd expected that as an Amazon device they had figured this would need to be as portable as my kindle and would work anywhere. it doesn't.I'm a UK amazon customer, living in the US, where I bought the stick, expecting it to work fine. despite resets and software updates it fails to be able to connect to the amazon content servers to stream anything BUT the music content (which works fine) the error messages are cryptic and whilst its promised that a future update will make it work with captive portal wifi (like in hotels) it doesn't yet.eventually i discovered that as its 'digital delivery' I need to change the location to the US on my account. there's nothing I've seen in any of the overly simplistic documentation that refers to this. I made the change, unfortunately its still a useless item.the stick has another few days before its going back.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This is cheap but neither is it very good.  Compared to a Roku there are very few channels.  But most importantly it freezes during streaming.  It definitely needs better software; I'll buy a Roku instead.", "verified": true, "helpfulness": "2/2", "author": "docj"}, {"rating": 4.0, "review": "Great deal.  A bit slower than the full \"puck\" unit but not bad considering the small form factor.  Remote is a bit flimsy.", "verified": true, "helpfulness": "0/0", "author": "Mochi's uncle"}]