[{"rating": 5.0, "review": "I've been using a Panasonic blu-ray with apps for quite some time. While it does work, it's definitely not the fastest thing out there- it usually takes a good 2-3 minutes to load up Netflix and sometimes cuts out due to connection slow-down.There are a lot of streaming boxes and sticks out there, but to date nothing has really gotten me to fork it over and pay for it. I finally sprang for Fire TV Stick for two reasons: the very low introductory price of $19 made it a 'shoot, why the heck not' impulse purchase, and the promise of integration with the Fire TV Remote app. I have a Logitech harmony remote that has worked out fine so far, but it's starting to get a bit on the clumsy side due to too many managed devices. Plus, the darn thing is always missing since the baby started walking around. I like the idea of being able to use an app to control things.Having used the real thing now, I can say that this is a really decent device even for the standard going price of $40.The Fire TV Stick comes with five components: a HDMI fob, a remote (batteries included), a power adapter, micro USB power cable, and HDMI flex cable. You need the secondary power hookup for it to work- HDMI does not draw enough power to keep the stick running on its own. The power cable is a good length, however, and the adapter is a nice collapsible low-profile unit. I've seen some complaints about this setup and yes- it would be nicer if you didn't need external power- but I for one don't plan on carrying this thing around with me everywhere I go so it's not a huge issue.Setup with the included remote is very straightforward. The stick requires WiFi to work of course, and if you have WiFi you really should be able to set this up with no hassle- it's not harder than connecting any other device. Once you have it running, you can download the Fire TV app (so far only Android) and connect it as long as your phone is using the same WiFi network. I do recommend users do this, as it's a lot easier to use the app than the remote- including voice search functionality, swipe navigation, and virtual keyboard. This also makes it largely unnecessary to buy the full Fire TV remote as it does the same thing. The app works very well in general- Amazon gets top marks for implementation, though iOS users are currently out of luck.Straight up, the speed and responsiveness of Fire TV stick is impressive. It's especially fast at loading and streaming Amazon content, so if you're already invested in Amazon TV and music it's basically an ideal device. Of course, if you are you probably already own a Fire TV box- unless you were a cheapo like myself. The voice searching works great, but only for Amazon content. You can access other stuff through apps, e.g. Netflix, Pandora, Hulu Plus- but have to resort to virtual keyboard to search those. The device clearly has a decent CPU and RAM, as it loads apps and app content very rapidly- as quickly as a high end tablet.One thing to bear in mind is that this system makes it VERY easy to buy Amazon content. I've already accidentally bought at least one title thinking it was free to stream- you can very quickly click through things and if you don't read carefully you end up hitting 'buy and watch' instead of 'watch' without even realizing it. Set a PIN if you're worried about accidental purchases.Overall, this is a very good streaming solution. Seeing how it performs, I'd not hesitate to buy it for $40. At the introductory promo price, it was an absolute steal. There probably will be future promotions as Amazon cannot help but profit from the use of these things (it does showcase their content) but it's a great device for the price any way you look at it.Pro:Very fast and responsiveVery easy setupInexpensiveApp works well and performs all functionsCon:App is Android only for nowHeavily focused on Amazon content (including voice search)Very easy to accidentally purchase Amazon content", "verified": true, "helpfulness": "0/0", "author": "Yu-Jin Chia \"Yu-Jin Chia\""}, {"rating": 2.0, "review": "You have to pay for alot more then what i thought you did, most movies are not free , even with prime!", "verified": true, "helpfulness": "1/3", "author": "aaron"}, {"rating": 5.0, "review": "Love this product! easy to setup and use. I own 2 Roku`s and Amazon Fire TV Stick blows them out of the water!!", "verified": true, "helpfulness": "0/0", "author": "Alicia Miller"}, {"rating": 5.0, "review": "Got it today. For some reason Comcast stopped working. Go figure. Easy setup. Remote awesome.  Love the interface. Was wondering how this could be better than Chromecast and it is due to the remote. Already used Netflix and watch Espn.", "verified": true, "helpfulness": "0/0", "author": "TallyShaitan"}, {"rating": 5.0, "review": "Feels as fast as my apple TV. I am an amazon prime subscriber so it was a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Barbara Gomez"}, {"rating": 5.0, "review": "Wow.  Simple to use, and makes our streaming content simple to access.  Even the 7-yr old navigates with ease.  Goodbye Charter!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Got my first one and nothing happened on screen. Input... check... usb power from outlet... check... HDMI extension (just in case)... check... Did everything possible to make this work but I got no image from the stick. I know eventually if this doesn't work I'll get my money back, but it was a huge disappointment. Let's see what happens when I get stick #2.UPDATE: Turns out the stick works but not with my TV. I was able to connect it to a TV at work (a 1 year old Samsung) and it works great there. My home HDTV (a 2011 Westinghouse) is not recognizing it. I am giving it an additional start just because I know it works and I think its a really cool gadget but it doesn't do me any good under my current setup. I will not change my TV for a 20 dollar stick.Amazon... you product is great but it sucks :)", "verified": true, "helpfulness": "0/1", "author": "louisvilleguy"}, {"rating": 5.0, "review": "What a great streaming device. I was skeptical about trying a \"stick\" for streaming but this thing is great. It is super easy to set up and is very responsive.  I wouldn't hesitate to get more for other TV's.", "verified": true, "helpfulness": "0/0", "author": "JS \"JS\""}, {"rating": 4.0, "review": "I got the Chromecast when it first came out and really like it. I consider myself a techie but trying to explain to someone like my wife how to use it just doesn't work. The fact that the Fire Stick comes with a remote and an actual interface is a huge thumbs up.", "verified": true, "helpfulness": "0/0", "author": "W. Millett"}, {"rating": 5.0, "review": "My main concern before using the product was its capability to stream from Netflix and other apps. After getting the Fire Stick installed and using it for the first time I am pleased with its speed and I love how it is already linked to my Amazon account. Probably the best $39.99 I have ever spent!", "verified": true, "helpfulness": "0/0", "author": "Rustin Becklehimer"}]