[{"rating": 2.0, "review": "I wanted it for Slingbox. Pathetic! Stick to the iPad and cord. Cuts out, odd messages ... and we have 50 mbps.", "verified": true, "helpfulness": "0/0", "author": "Gordon Bailey"}, {"rating": 5.0, "review": "I love this product so much. It is very easy to install and it is not bulky.Music: lots of free music. Pair it with a good sound system and you'll be having a great party. The pandora app is very good as well to pair with. The YouTube though needs development.Movies: a lot of free movies. There are also movies that can be purchased. It is more expensive than red box but comparable to comcast on demand. It is still cheaper than going to the movies so in the essence it is still cost effective compared to going to movie house.Overall, this is a great addition on the 2 day shipping of prime membership.", "verified": true, "helpfulness": "1/1", "author": "Harold"}, {"rating": 5.0, "review": "Awesome product! Great features and easy UI. It blows Chromecast out of the water IMO. Super glad i was able to get this at the special pre-order price!", "verified": true, "helpfulness": "0/0", "author": "Mike A in LA"}, {"rating": 5.0, "review": "GREAT", "verified": true, "helpfulness": "0/0", "author": "Gayle"}, {"rating": 2.0, "review": "Finally got a chance to plug in the Fire TV Stick and use it. I am not happy. It has a big audio problem that needs to be fixed. In Dolby Digital Plus mode, the audio skips. In regular stereo mode, there is a continual buzzing. I am a bit of an audiophile, so I did the necessary troubleshooting. The problem exists regardless of which media is being used, as I tried NetFlix, Amazon Prime, and digital copies of movies I owned from Amazon and other services. Just to make sure it was not the HDMI slot I was using, I tried other slots and had the same problem. I even tried a different TV. Both of the TVs I use also have Dolby Digital Plus capabilities, not to mention other formats. One TV even has a receiver that decodes all of the formats (DD, DD Pro Logic II, DD Plus, DD TrueHD, DTS, DTS-HD, DTS-MA, DTS Neo:6, etc). So, it was not a format decoding issue on my end or any hardware issue outside of the Fire TV Stick itself. Basically the thing is useless for me to watch anything.", "verified": true, "helpfulness": "0/0", "author": "Ranger12"}, {"rating": 5.0, "review": "Hard to beat for the price, especially if you are a prime subscriber.  The menu system moves fluidly which annoys me on other similar items I have in my house.", "verified": true, "helpfulness": "0/0", "author": "sadface"}, {"rating": 5.0, "review": "Even though i have a smart tv with amazon prime installed, i could not pass up this amazing and super inexpensive device.  Thanks, Amazon!", "verified": true, "helpfulness": "0/0", "author": "J. Green \"Just JG\""}, {"rating": 4.0, "review": "A great, quick alternative to Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Steven Qunell"}, {"rating": 3.0, "review": "Decent hardware and device, but you need to be ready to be captured into Amazon's world.  It has the ability to use other services, but they are so buried that you have to dig past pages of Amazon recommendations to get to the other services.Since we use a number of services, it's not going to be a principal device for us.", "verified": true, "helpfulness": "0/0", "author": "D.M. \"aragorn101\""}, {"rating": 1.0, "review": "I've only been able to use this twice. It continuously tells me there is an issue with my wifi but my wifi works for laptops, tablets and our phones. Very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Jenna Remillard"}]