[{"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "James patterson"}, {"rating": 5.0, "review": "Works great.  Still exploring.", "verified": true, "helpfulness": "0/0", "author": "dean"}, {"rating": 5.0, "review": "Stopped using Dishes and cable. I like this product. I've been very happy to be able see some favorite shows and movies. For my family it has become less expensive than the dish and cable networks.", "verified": true, "helpfulness": "0/0", "author": "Tanya"}, {"rating": 5.0, "review": "Got the Amazon Fire stick and it is a awesome. My kids can watch movies and play games.", "verified": true, "helpfulness": "0/0", "author": "JAMES STRONG"}, {"rating": 5.0, "review": "excellent, works great and turned my 2nd tv into a smart tv.  Amazing what $34 can bring to your home.", "verified": true, "helpfulness": "0/0", "author": "Kb64"}, {"rating": 5.0, "review": "We put this upstairs in the guest room. it sets up quickly and is easy to use . Thank you!", "verified": true, "helpfulness": "0/0", "author": "Turtle Kientz \"Buzzy\""}, {"rating": 5.0, "review": "If you have amazon prime, Netflix and HBOgo you'd be stupid not to buy this.  We cut out a cable box and have this on the less used TV and it's great.  No cable line,  sets up to WiFi in a few minutes. Excellent.", "verified": true, "helpfulness": "0/0", "author": "MIKE"}, {"rating": 3.0, "review": "its a little slow...and not many programs to offer unless you join prime......I would probably get the roku stick if I were to do it again...", "verified": true, "helpfulness": "0/0", "author": "matte"}, {"rating": 2.0, "review": "I ordered two Firesticks for my family. I love the fact that it is portable and easy to use. That being said, I mainly watch Netflix.  There is a known issue with the Firestick and Netflix compatibility. I began researching this issue after I had trouble connecting to Netflix. Apparently, the fix is to clear the cache and data multiple times, unplug the unit & then it works. I don't have time to jump through hoops to get this device to work.. I really wanted this to work. Hopefully, Amazon works out the Netflix kink soon.", "verified": true, "helpfulness": "0/0", "author": "Paula Springer"}, {"rating": 1.0, "review": "The Fire TV Stick keeps dropping the Wi-Fi signal.  We keep getting the error message \"not connected to the internet\" but when we check the system says connected.  Very disappointed with this device.", "verified": true, "helpfulness": "0/0", "author": "Serene"}]