[{"rating": 3.0, "review": "It works with my 2012 Samsung TV but does not work with my 2010 Vizio TV.  My Vizio TV just says \"not supported\" when you plug the stick in (although the Roku stick works with it just fine).", "verified": true, "helpfulness": "1/1", "author": "William McMullin"}, {"rating": 5.0, "review": "Awesome.  Especially for the price.", "verified": true, "helpfulness": "0/1", "author": "Shawn Garrett"}, {"rating": 5.0, "review": "Great little device.  Love having an device that plays amazon prime shows.  Netflix works great and other apps too.  Great price too!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Better than I expected. Love it", "verified": true, "helpfulness": "0/0", "author": "S. Jones"}, {"rating": 5.0, "review": "Love  it", "verified": true, "helpfulness": "0/0", "author": "Ann Forbes"}, {"rating": 5.0, "review": "I'm going with 4 stars for right now. It may jump to 5 over time. The interface is pretty solid and user friendly. I'm mainly using it for Netflix, Amazon and ESPN 3 access on a TV that doesn't have any of that hooked up to it from another device. All those apps work well and deliver great video quality. I am attempting to use Flixster, as well, even though I hold it and it's sister company in contempt. Flixster is the one app I have not liked thus far. Mainly, their video compression and delivery is not near the level of Amazon and Netflix... so why production companies keep using it is beyond me. That's not really a knock on the Fire Stick, though. Would like to see an IMDB app on it, too.", "verified": true, "helpfulness": "0/0", "author": "M. Ruch"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Patricia Pinto"}, {"rating": 4.0, "review": "I like it.  It's fast and for the most part easy to use.  The layout of the menu and app store are ok. I understand that Amazon wants to prioritize their offerings.  I wish that Vudu was an available app.", "verified": true, "helpfulness": "0/0", "author": "Deedubcee"}, {"rating": 4.0, "review": "So far so good wish it had Disney anytime movies.", "verified": true, "helpfulness": "0/0", "author": "Geoffrey King"}, {"rating": 5.0, "review": "It works much better than I expected. I am really pleased, but watch what you click on or you can soon have a large bill.", "verified": true, "helpfulness": "0/0", "author": "Pepe"}]