[{"rating": 1.0, "review": "When it doesn't glitch during playback the stick crashes. Very dissatisfied. Doesn't matter if I use the supplied power or not.", "verified": true, "helpfulness": "1/1", "author": "Brad Sommer"}, {"rating": 5.0, "review": "Love it, though wish I could stream a browser.", "verified": true, "helpfulness": "0/0", "author": "Matthew Johnston"}, {"rating": 5.0, "review": "Everything expected.  No brained set up", "verified": true, "helpfulness": "0/0", "author": "Jerry A. Mitchell"}, {"rating": 5.0, "review": "very impressed! snappy interface, great way to use my prime video!", "verified": true, "helpfulness": "0/0", "author": "Mike Thomas"}, {"rating": 5.0, "review": "Awesome - love it.", "verified": true, "helpfulness": "0/0", "author": "Paul McEnany"}, {"rating": 4.0, "review": "Excellent product for anyone who has amazon prime or netflix. Easy to setup and use.", "verified": true, "helpfulness": "0/1", "author": "dolerite"}, {"rating": 1.0, "review": "I am not happy with this product. We have several Rokus, Apple TVs, Chromecast, smart TVs, laptops, tablets, smart phones, game consoles and blue-ray players in our house. Amongst all the devices out there we can use to stream video content, the Fire TV Stick is the worse. The remote control does not work well. It's erratic. It's a pain to use. It's very frustrating. And the iPhone remote app doesn't exist so there is no way out. It's not just my Fire TV stick, it's most of them out there as this issue is common in lots of other reviews. I actually own two Fire TV sticks since they were on sale at Staples for $24 at Thanksgiving. I am a big Amazon Prime customer and we buy a lot of items from them. Trust me, it hurts me to leave a negative review because I like Amazon as a company. However, they dropped the ball on this device and didn't do the proper testing. I hope they will fix it soon, with a software upgrade or something else. I will play with the devices for a few more days but I am pretty certain I will return them and ask for a refund. It's sad because it's a neat gadget otherwise.", "verified": true, "helpfulness": "7/8", "author": "David \"David\""}, {"rating": 5.0, "review": "The stick is great - but Comcast sucks - supposedly it offers 6 meg service but many times it drops below 1 meg which is to slow for streaming.", "verified": true, "helpfulness": "0/0", "author": "John Sharp"}, {"rating": 1.0, "review": "So glad I paid half price when I did. It constantly freezes. It is not my internet connection seeing that my Chromecast works amazing. I would recommend Chromecast over Amazon Firestick. Very disappointed in the product. If it worked properly I'd be very satisfied. Very aggravating having to reset 100 times while watching tv.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Poor design, USB wire sticks out the side and interferes with other HDMI connector on TV", "verified": true, "helpfulness": "0/0", "author": "Vicki"}]