[{"rating": 5.0, "review": "Works awesome.  Very easy to use and navigate", "verified": true, "helpfulness": "0/0", "author": "Ang"}, {"rating": 5.0, "review": "It is very simple to use and works great. Glad I made the purchase.", "verified": true, "helpfulness": "0/0", "author": "Mike Moore"}, {"rating": 3.0, "review": "I want a better Twitch app. That is all. It does what its suppose to but the Twitch is at bare minimal. Instead I had to install Kodi on the FireTV Stick to see what channels I am following.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 1.0, "review": "Be careful! The Fire TV Stick will not work with many HDMI receivers. If your receiver is even slightly old (say 3, 4 or 5 years old) your HDMI receiver may not support HDCP protocol (i.e. content protection) and therefore you will see a blue screen saying \"HDCP unathorized. Content Disabled.\"The first day I used the Fire TV Stick it worked great! But the 2nd day I used it I got the blue screen \"HDCP unathorized. Content Disabled\". After a lot of debug I found that the Fire TV Stick would work when directly plugged into my TV HDMI port but not when plugged into my Receiver HDMI port.Amazon telephone support just told me \"the Fire TV Stick is not meant to be used through a receiver, please plug it directly into the HDMI TV.\" Then how do I get 5.1 surround sound? Why doesn't the Fire TV Stick purchase website warn the purchaser that this device won't work through many HDMI receivers?The Fire TV Stick also damaged my HDMI receiver's ports. How, even without the Fire TV Stick, my Samsung Blu-Ray HDMI Receiver doesn't work through HDMI to any TV. It was working perfectly on the 1st day I used the Amazon Fire TV Stick but on the 2nd day and every day after that I am no longer able to get HDMI video through my Samsung receiver to the HDMI TV. Even when using different HDMI cables and on different HDMI monitors.Amazon telephone support told me this was a Samsung issue not an Amazon issue. I contacted Samsung support and they said my HDMI receiver would require service because it appears the HDMI paths are no longer working.I will ask Amazon to repair my Samsung receiver (or replace it). The Fire TV Stick shouldn't be damaging HDMI ports. I hope they will help me. I will submit an update later as to what I find.UPDATE on 12-July-2015:Amazon credited me for my damaged Samsung HDMI/BT/DVD receiver. I am now instead using the Fire TV Stick via HDMI directly on my TV and not going through the receiver (hence no 5.1 surround sound!!!).But for the last several weeks I have been having WiFi disconnection problems. The Fire TV Stick frequently disconnects from WiFi, this results in streaming video playback to be very start-and-stop. My kids get so frustrated when they're watching a show and it says \"buffering....\" and then waits and waits then finally resumes. I have restarted my ATT Uverse Wifi router many times, restarted the Fire TV Stick many times and it still keeps doing this. It didn't do this a couple months ago.My Uverse WiFi router is in the SAME ROOM as the Fire TV Stick and the router statistics show that the Fire Stick (android-based device) has the highest signal strength of anything on my WiFi network, so it is not a signal strength problem. All of my other devices (Laptop, 2 iPhones, and 2 iPads) continue to stream beautifully even while the Fire TV Stick suffers intermittent connectivity. HELP AMAZON!", "verified": true, "helpfulness": "3/3", "author": "S. Morrison"}, {"rating": 5.0, "review": "Works great!  Second one I've bought, going to get one for every tv in my house.", "verified": true, "helpfulness": "1/1", "author": "Tia N. Kurtz"}, {"rating": 5.0, "review": "Great device. Easy to install, lots of choices.", "verified": true, "helpfulness": "0/0", "author": "Kevin Dolan"}, {"rating": 5.0, "review": "Very easy to use. Has a lot of capabilities.", "verified": true, "helpfulness": "0/0", "author": "Buyer"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Peter Hytmiah"}, {"rating": 4.0, "review": "Worked well... Easy to install and use.  Wish prime had more content.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 3.0, "review": "The interface is similar to Apple TV; it works well in proximity of the wireless router, but experiences problems when it is 25 feet away, while other wireless devices (iPad, Mac) do not.  Something needs to be resolved there.", "verified": true, "helpfulness": "0/0", "author": "vartan messier"}]