[{"rating": 5.0, "review": "Works as intended.", "verified": true, "helpfulness": "0/0", "author": "H. David Hill"}, {"rating": 5.0, "review": "love this thing!..download the app for your phone ..plug it into an hdmi port and enjoy an instant very quick and responsive smart tv!", "verified": true, "helpfulness": "0/0", "author": "adam"}, {"rating": 1.0, "review": "Not happy have had this for a week it shows network connected then when I go to access apps says I got no connection have restarted it doesn't fix it maybe got a defect one returning it", "verified": true, "helpfulness": "0/0", "author": "Sumer"}, {"rating": 5.0, "review": "Amazing. I have had Rokus in the past and still use them, but since we set up a den with no cable I didn't want to give up the plug in on my tv so I bought this. I ended up using it on the master bedroom television and it's my favorite. I typically watch more Prime so it just made sense to have the amazon stick in the bedroom. Really quick load up and super easy to use.", "verified": true, "helpfulness": "0/0", "author": "rae"}, {"rating": 1.0, "review": "It may be me, but I hate this thing. I have a Roku 3 at home and bought the Fire TV Stick for my vacation home. When I powered it up, I looked for \"Channels.\" I couldn't find an option for those. Finally, by moving around in all the options, I found PBS. I got it, and then there were a few others recommended. My cable carrier at the beach place doesn't work with most of them, so I tried to find other free ones. I found one at a time, all with great difficulty. This is definitely not as easy as my Roku.You don't turn Roku off. I found in the Fire Stick's settings a \"sleep\" option, but to use it, it appears that you have to go to settings every time and check \"sleep.\" Should it not be put to sleep? Okay, it's now 5 minutes later. I googled Fire TV stick and sleep and found that it puts itself to sleep after 30 minutes. I don't think I should have to look up every little question I have about this thing. My Roku's little instruction sheet included this vital piece of info, but amazon did not.I have pretty much washed my hands of this thing. I would really love to know what I am doing wrong or how to find out how to do things correctly. I would hate to have wasted money, even if it was only $19.", "verified": true, "helpfulness": "0/0", "author": "Nana Toye \"LibraryLady!\""}, {"rating": 4.0, "review": "Work better than the boxes I have bought in the past. Only negative item is it doesn't like to be moved between TV's", "verified": true, "helpfulness": "0/0", "author": "great apt even more intense if you practice meditating"}, {"rating": 1.0, "review": "Switched from older version of Roku.  Worked fair for a while now never works.  Constantly freezing.", "verified": true, "helpfulness": "0/0", "author": "argee401"}, {"rating": 5.0, "review": "Amazing!!  Made finding programs so easy.  No searching.", "verified": true, "helpfulness": "0/0", "author": "Jo Jolley"}, {"rating": 4.0, "review": "Worked as advertised, but it was difficult to install.  My printer has to be turned off and on to work.  Bit of a pain.Otherwise the devise is easy to use.Best wishes,Tom Parsons", "verified": true, "helpfulness": "0/0", "author": "Thomas R. Parsons"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Tailored Taylor"}]