[{"rating": 5.0, "review": "Way better than Chromecast.  Unlike Chromecast or VUDU no buffering problems with Netflix or with movies.", "verified": true, "helpfulness": "0/0", "author": "D. Niemeier \"DavePsy\""}, {"rating": 5.0, "review": "We love it . We got rid of cable and we  are savingmoney!", "verified": true, "helpfulness": "0/0", "author": "Becky Logan"}, {"rating": 4.0, "review": "The programs offered and picture quality are really great. The only improvement needed is the remote it is very poor quality.", "verified": true, "helpfulness": "0/0", "author": "Mickey"}, {"rating": 5.0, "review": "very satisfied with the Fire Stick, sideloaded Kodi and it works great", "verified": true, "helpfulness": "0/0", "author": "JK"}, {"rating": 1.0, "review": "I love Amazon. I love my Kindle Fire and my Fire Phone. I really wanted to love this too, but I hate the Fire stick. I purchased it during their 2 day sale for $19. That is easily the worst money I have spent. A year and a half ago my family gave up satellite television. To save money, we went to complete streaming with Netflix, Hulu Plus, and Amazon Prime. We started streaming through the Wii, but did not like the Wii controls for watching tv. We then purchased the original Roku. We loved it.  Remote functions were easier to use. It was dependable, and the menus were easy to use.After we mounted our flat screen on the wall, I purchased the Fire Stick. It was on sale so the price definitely a draw. Also I liked the idea of not having everything visible. (The Roku is small, but it is still visible.) Unfortunately, we have never liked it. It still has a power cord that is visible. The menu is a pain in the butt to operate. Everything you do on the Amazon Prime part has to have a pin, even if it is free through prime. This is a terrible feature if you have children. It freezes constantly when streaming. It will quit completely while the Roku in another room is working perfectly.Bottom line, save your money and get Roku instead.", "verified": true, "helpfulness": "1/1", "author": "Octy Road"}, {"rating": 5.0, "review": "Works Great! Has a great deal of apps which work perfectly.  Being portable is also a good thing.", "verified": true, "helpfulness": "0/0", "author": "cswartz"}, {"rating": 5.0, "review": "Works like a dream! Adds the \"smart\" to my boring television. Easy set up, easy and not a problem to be seen in the 2 months I have had it. I am thinking about purchasing one for our bedroom television. If you have Amazon Plus.......You must have a fire stick!", "verified": true, "helpfulness": "1/1", "author": "Barbara L. Blair"}, {"rating": 1.0, "review": "Won't keep a connection.  Should have never bought it.", "verified": true, "helpfulness": "1/1", "author": "emmy"}, {"rating": 5.0, "review": "ALL I EXPECTED & MORE!!!", "verified": true, "helpfulness": "0/0", "author": "Joshua McKinney"}, {"rating": 5.0, "review": "I love this item; two big thumbs up. I'm constantly using it for Netflix and pandora streaming. One thing good to know, if the item is back ordered (which it constantly is off of amazon) you can also buy at your local best buy. Setup took less than 5 minutes. Once the stick is working, I was happy to see a welcome video explaining all that the item does. Extremely easy to use. Well worth the $39!", "verified": true, "helpfulness": "0/1", "author": "Becky"}]