[{"rating": 5.0, "review": "Great unit. Works well, no problems", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Freezes often. It's not my signal my ps3 and 4 stream just fine.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It MUST have an electrical outlet nearby!  Pictures could be a bit misleading in that they only show the remote and stick, not the AC adapter that it must have for power.  Performance wise, it is pretty good!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Not any good adult movies", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little device is awesome.  It's rock solid and reliable operation makes it a joy to use.  I've been using two Apple TVs and a Roku HD in our home for about two years now, and there is absolutely no comparison.  Simple, elegant, fast and reliable are the descriptives that come to mind regarding the Fire Stick.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I like the whole concept behind this, but I don't know if it is the Firestick or Amazon prime, but I have streaming issues. We had been using Netflix with our Wii before this. Never had issues. I have the best internet I can get where I live. I did plug it into an outlet as suggested.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Had to ask my 15 year old son to help me hook it up, but it is AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Quick and easy to install.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Made my \"smart\" TV smarter.  The only thing it needs is browsing capability.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Very easy to set up.  I love the size.  Would be better if I could hook up a USB storage device so I could play files and photos through it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]