[{"rating": 5.0, "review": "Very easy to use; I love it!!", "verified": true, "helpfulness": "0/0", "author": "C. Santos"}, {"rating": 5.0, "review": "Love it, it was so easy to hook up and use plus everything needed was in the box, so cool", "verified": true, "helpfulness": "0/0", "author": "Edwin Burkhart"}, {"rating": 2.0, "review": "When I was considering buying the Fire TV Stick, my usage model was that I would be able to take it with me on the road and get streaming in hotels.  I did a chat session with an Amazon pre-sales rep and he assured me that it worked.  I asked about how the Stick connects to hotel WIFI since they almost all require you to accept terms on a website and enter some information.  He said the WIFI login screen would come up on the TV and you enter information using the remote.  That has never happened and I had not yet been able to connect to a hotel WIFI so I reached out this time and got through the second level tech support.It turns out that this is not true and the Stick doesn't work if you have to enter information on a webpage to connect to the network.  So, it really only works on your home network and just about no hotels.  Getting Amazon content at home is relatively easy and I have numerous devices that already provide me with that capability to this is a useless device for my needs.  Too bad - it would have been great if it worked as their support people described when I was considering buying.", "verified": true, "helpfulness": "4/4", "author": "Marc Dulude"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "tracey cox"}, {"rating": 5.0, "review": "The quality of pictures through Fire Stick is amazing .. much better than chromecast. The picture quality is also better than my Sony home theater, truly high definition.", "verified": true, "helpfulness": "1/1", "author": "MB"}, {"rating": 5.0, "review": "They're great...so easy!!!  Glad we got them!", "verified": true, "helpfulness": "0/0", "author": "Carmen"}, {"rating": 5.0, "review": "I absolutely love my Fire TV Stick! I use it at school all the time! The set up was quick, easy, and simple. Would recommend to a friend!", "verified": true, "helpfulness": "0/0", "author": "Lacee"}, {"rating": 1.0, "review": "Fire TV Stick constantly drops the Internet connection even though the Internet is still working.  Would not recommend", "verified": true, "helpfulness": "0/0", "author": "Mark Ferneding"}, {"rating": 5.0, "review": "I am a \"dinosaur\" but I set this up all by myself.....so it must be easy !!  My grandson loves it too.  Watch your amazon shows on TV !!!", "verified": true, "helpfulness": "0/0", "author": "Patricia Ann"}, {"rating": 5.0, "review": "I likey.", "verified": true, "helpfulness": "0/0", "author": "Towboattrash"}]