[{"rating": 4.0, "review": "One problem that I had with this thing is WIFI range, it is horrible. I had to move my router closer to the stick. Once router was close enough then I was able to download all the updates. Watched Netflix and Amazon prime. Video quality was great. I got it for 19.00 dollars so i can't complain.", "verified": true, "helpfulness": "1/1", "author": "ConklinNYC"}, {"rating": 1.0, "review": "Pre ordered this in October and yet to receive the product. Whereas Staples has started to sell this at $24. Best Buy has also launched it at a lower price.  Instead of filling order for its customers, especially the prime one, Amazon has stopped caring about their customers especially the prime ones.  I would be canceling my prime membership as I don't see any good reason to retain", "verified": false, "helpfulness": "11/17", "author": "Saqib \"sfuad\""}, {"rating": 1.0, "review": "Problem #1: Netflix movies are blurry. Netflix on Apple TV, plugged into the same TV set, are crystal clear HD.Problem #2: Amazon deliberately misleads you to think there is no power cord and brick needed. All their photos of the product, including of it plugged into the back of a TV, show no power cord. And the descriptions lie by omission. No power cord mentioned. They want you to think you just plug it into the TV and it works. That's false advertising by omission. This product required a power cord and USB brick.Problem #3: Amazon designed the product so you can NOT use it right away after you plug it in. They instead force you to watch a cartoon character spend 5 minutes explaining how you use the product and spend money on Amazon Prime. If you try to go skip past this obnoxious tutorial the product will not work and it punishes you by starting the tutorial from the beginning.I might have lived with problems #2 and #3 but #1 was fatal. I'm sending my $19 Firestick back.", "verified": true, "helpfulness": "2/9", "author": "JD_in_SB"}, {"rating": 5.0, "review": "I picked this up for $19 when they first announced it.  Now having owned several other android tv sticks in the past, this by far works faster and is easier to use them a majority of any of the tv sticks out there.  I'm assuming it won't be hard to pick this up for cheaper than the $39 since I know all this black friday week you can pick it up at staples for $24.", "verified": true, "helpfulness": "1/1", "author": "Marcus"}, {"rating": 1.0, "review": "I received my Fire Stick on the first day and was soooo excited.  That lasted about 5 minutes after plugging it in and finding it having connectivity issues.  Chalking it up to bogged servers (given it release day), gave it some time and, after a few hours, everything leveled out.Getting it functional is not why I bought the thing.  It was to replace/compete w/ my ChromeCast/Roku/XBMC.  And, it fails miserable.Example one, boot up PLEX to test streaming a movie.  Not only can it not handle it (choppy/freezing), the quality is much worse than my other devices with the same video/network!  Even Spotify Connect (b/c the full Spotify app isn't available on Amazon devices) wouldn't work correct.  It kept kicking the audio back to the controlling device.2nd, the interface is awful.  I side loaded an application (XBMC) and to open it, you have to go under 'settings', 'manage applications', 'XBMC', theeeen open.  There is no 'pin to home' or anything.  No customization whatsoever.Having 3 Roku's and a Chromecast, I would take those devices over this thing regardless of price.  Knock this thing down to $5 and it's what you should be paying.Going to return.  Huge disappointment :(", "verified": true, "helpfulness": "11/16", "author": "Chris"}, {"rating": 5.0, "review": "Absolutely love it!! So easy to install.  We may never go back to watching regular TV!!", "verified": true, "helpfulness": "1/1", "author": "Terri Whittlinger"}, {"rating": 5.0, "review": "After a rather slow setup, perhaps due to servers being overwhelmed, the Fire sick is awesome and has performed beyond expectations. My only regret is ordering just one of them at the $19 deal price. Apparently they are not available again until after New Years... rats!!!", "verified": true, "helpfulness": "1/1", "author": "M. Wilhelm \"SixStringedChaos\""}, {"rating": 4.0, "review": "So far; so good.", "verified": true, "helpfulness": "0/0", "author": "Kevin C."}, {"rating": 1.0, "review": "I was pretty excited about this thing as I have enjoyed all of Amazon's products. However, this thing can't hold a connection. It drops the connection while browsing the menu or it buffers every 10 seconds when watching video. In this state it is unusable. Im not sure if I should return it or wait to see if there is an update that fixes it.", "verified": true, "helpfulness": "5/8", "author": "N.K."}, {"rating": 3.0, "review": "I've been using it all weekend and I can't complain too much since I pre-orderd for half price, making this nice streamer a cool $20. It does what it's supposed to do, and does it pretty well. I do, however, have a major beef with how it is powered. The Micro USB port is on the SIDE of the device, meaning you just about have to use the included HDMI extender to plug it in, because the plug is in the way of everything. My 2nd beef is with the included power adapter. It's a rather unnecessary shape that blocks outlets. I have a Chromecast plugged into a TV that has USB ports to power it, so I had a spare Chromecast power adapter that I'm using for the Fire TV Stick. I'm docking a star for each of those issues. Considering the Chromecast is a few bucks cheaper than the normal price of this gadget and has neither issue, I think I'll be sticking with them for now.", "verified": true, "helpfulness": "1/1", "author": "Aaron Renner"}]