[{"rating": 5.0, "review": "I love this I get to watch shows that I want to watch & not pay for things I don't want", "verified": true, "helpfulness": "0/0", "author": "jc"}, {"rating": 5.0, "review": "Love it, took a little while to get used to how it worked. Lots of videos on YouTube to help you understand how to use it. Great device.", "verified": true, "helpfulness": "0/0", "author": "Claude hepworth"}, {"rating": 5.0, "review": "I previously used the Wii gaming system to connect to Netflix, Hulu, Amazon Prime, and YouTube. It was my gateway into cable-free living. I went cold turkey and at the time, it was just the system I needed to get me through my cable withdrawls. But, over time it became less and less reliable, it just wasn't connecting. Freedom was being replaced with frustration. I even considered cable again. (GASP!) Then I heard there were other fish in the sea, ones that would connect, be consistent, more reliable. That's when I found fire. I asked around for some opinions because sometimes when you're looking for something new, you overlook some drawbacks. The feedback was positive! I am happy to report that fire and I have been strongly connected since Mother's Day and it has successfully kept me away from ever considering cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very Easy to install and use , and I can access my prime account and view my movies and tv shows in my library. Very satisfied", "verified": true, "helpfulness": "0/0", "author": "Fred Salinas"}, {"rating": 3.0, "review": "Not what It said on the description not happy", "verified": true, "helpfulness": "0/0", "author": "Epigmenio Saenz"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "CHERYL L TIKANEN"}, {"rating": 5.0, "review": "Love this product bought 5 of them", "verified": true, "helpfulness": "0/0", "author": "Rosalinda R."}, {"rating": 1.0, "review": "Often loses connection despite a strong wifi signal. I generally end up getting frustrated after repeated unsuccessful attempts to reconnect and end up watching on my iPad (using the same wifi signal and have no issues)", "verified": true, "helpfulness": "0/0", "author": "Naomi B. Raider"}, {"rating": 3.0, "review": "Selection of movies is skinny (lots of kid movies); also should have read that Amazon and Comcast aren't partnering making HBO GO worthless at this point.  Good speed on downloads, easy to install, like that it's tied to my prime acct.  Hope to see more newer movies available via prime and a Comcast partnership.", "verified": true, "helpfulness": "0/0", "author": "Denni"}, {"rating": 5.0, "review": "I got this as a gift for Mother's Day. My mom and I love it. It's easy to set up and use; it took all of five minutes. My parents and I love it.", "verified": true, "helpfulness": "0/0", "author": "Monqiue S Gaines"}]