[{"rating": 5.0, "review": "Got my amazon stick in the mail last week. Within 15 minutes I had it up and running. After the tutorial video I started to enjoy Netflix and Amazon instant video. Now I can fully enjoy my prime membership. This is a must have device. Even if you do not have Netflix or Hulu, there are lots of other apps/channels to enjoy. Games are also available. I found it faster than the Roku stick that my sister has on her TV.  I would recommend this to a anyone.", "verified": true, "helpfulness": "0/0", "author": "Altair"}, {"rating": 4.0, "review": "It is delivered on Sunday. So its a good start. Installs easy. Works faster than the smart TV I have (Visio) so that's a plus. I did not like the fact I had to use a power adapter to power it.  Did not come with the popcorn pictured on Amazon. So there is that.", "verified": true, "helpfulness": "0/0", "author": "Funda Senyuz"}, {"rating": 5.0, "review": "Very impressed with how much power that little thing has and all the features it has to offer. Simple, understated, portable and everything works as it should. Pretty quick actually, considering the hardware, but sometime it would take a bit longer to load \"Home\" screen. I'm sure more apps and updates will be coming, but as of right now it has all the essentials for content streaming and entertainment. I only play actual games on PC so I cannot comment on how well it handles any games that are available.I hope to see an internet browser in the future such as Opera or at least Chrome. I hope will soon get the ability to customize the home screen and themes. Would also really like just more andoird apps to be released and supported.", "verified": true, "helpfulness": "0/0", "author": "Alex Dubrovsky"}, {"rating": 5.0, "review": "I love my Fire TV Stick. Personally I think it's better and more user friendly than Google's Chromecast. It's cheaper and just as good as late model Roku's. I'm sure the \"channel\" or app selection will increase over time.", "verified": true, "helpfulness": "0/0", "author": "Noah Brennan"}, {"rating": 5.0, "review": "This works great.  No complaints.", "verified": true, "helpfulness": "0/1", "author": "Patrick M."}, {"rating": 1.0, "review": "Basically useless. It was easy to install, comes preloaded with my Amazon account and found my WiFi network, then the troubles started. I started to watch an episode of of a TV show. After five minutes the Fire Stick lost my network and I had to reboot. After that happened a few times, I checked rebooted my router, Fire Stick and TV. Got the same result: within a few minutes the Fire Stick loses the network and I need to reboot. I had a Roku 3 installed before but wanted to try the Fire Stick. After all of the failures of the Fire Stick,  I reinstalled the Roku 3 box and it works great. The Amazon Fire Stick is going back to Amazon.", "verified": true, "helpfulness": "3/4", "author": "G. Anderson \"Cheap shopper\""}, {"rating": 5.0, "review": "An inexpensive entertainment device that provides HD-quality picture and sound, the Fire TV is one of the cheapest ways to add entertainment options to your TV, to enjoy your Prime subscription, and perhaps even to stop paying for cable.The Fire TV Stick is an android device, like most smartphones, which means that to get all the use out of it you can, you'll have to supplement its native abilities by downloading apps onto it.  You can do this by going to Amazon's site and finding them(google play is not available), or by getting them right from your Fire TV stick's interface.  You can buy them using the payment options you already have registered, or use Amazon \"coins\" to buy them, which you get 500 of for free with the stick.  They work out to a penny a coin for app purchases -- that is, if an app is offered for 99 cents, it's also offered for 99 coins.  You can always buy more coins,and they come at a discount from cash from Amazon.The stick doesn't have most of the channels you're used to watching with even a modest cable package, so for some it will be no substitute at all.  It does, however, provide so much entertainment and learning value of its own that for other people, it may be as good as or better than cable -- especially since using it is free!  And because you can get so many cable shows on it anyway -- sometimes only episodes, but sometimes a season at a time.  You don't need Prime to enjoy it, either..As examples, the Smithsonian, A&E; and the History channel provide documentaries and some of their usual series shows; PBS does the same with many of their excellent series (Frontline, Nature, etc.) and daily updates the PBS News Hour, the best news hour on the air; there's Showtime, Netflix,, Bloomberg TV, and music, movie, cooking, kids, and educational channels with varying levels of materials from first grade through college.  Then there are apps that provide dozens of channels covering everything from yoga and exercise to comedy,dog,cat, science, business, dance, MMA, kids, gamer, and fashion channels.  There's youtube, Twitch, and the ability to see and hear all your purchased movies and music content that you have stored in the cloud.  Amazon's cloud, anyway.  There is even an endless variety of free and cheap screensavers and relaxing background channels to have on when you just want a little relaxing scenery and music.  Plus, of course, there's Prime if you want it.Warning:  Some channels, and apps that let you play channels, come with commercials.  Most of the ones I've tried, though, do not.  Your mileage my vary.And there are games, but this is not much of a gaming device.  Even the games recommended for the Fire TV Stick turn almost always turn out to have the warning that they're not compatible.  The remote, for one thing, is just too simple for most games.  Only the very simplest games with the very simplest controls will either work or be any fun to play.  This stick won't replace an X-Box or PS3/4 or even a full Amazon Fire TV box.  But it is very strong at what it does do right.Moving the Stick from one TV to another is easy; all you need is an HDMI outlet.  That means the Stick won't work on some old TV's.  It is recommended that you let the unit draw power from its own separate regular power plug, included in the box.  And it can be stuck in any HDMI outlet because the remote doesn't need line-of-sight to activate.So then, the Fire TV Stick is for some a substitute and for some a supplement.  If you're a fan of shows like Dancing with the Stars that you can't get on the stick (at least not for now!), then this device will just be a supplement.  But what a great and inexpensive supplement it is!  For me, it's good enough to be a substitute for cable because it lets me see almost all the shows I like from providers I'm already familiar with.  Unless I decide to devote my entire life to watching TV, that's more than enough already.  And it's free.  Plus ... it's a lot easier way to see Prime on your TV than hooking up your laptop.It's easy enough to use to give to someone of any age, and after a few downloads to update the device on initial installation and register the stick, you'll have one heck of an easy to use, portable entertainment option that you won't have to spend a penny on again and that may make you consider dumping your cable bill entirely.", "verified": true, "helpfulness": "2/2", "author": "Dingfelder"}, {"rating": 4.0, "review": "Good but It seems to disconnect from the internet quite often... If I unplug the power to the device it seems to work.", "verified": true, "helpfulness": "0/0", "author": "Rickymare"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lavonda"}, {"rating": 4.0, "review": "Plugs in nicely to my TV, but I must of missed reading where it also has to be connected to a wall outlet.  I've never used a streaming device before so probably just something I didn't understand, but it works great, and does what its suppose to.", "verified": true, "helpfulness": "0/0", "author": "Becky"}]