[{"rating": 5.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Very pleased with this product!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I am so happy with my choice to buy an Amazon Fire TV stick.  I was disappointed that my 8 year old Sony Bravia HDTV set did not recognize the device.  Lucky for me, my 3 year old Denon video amplifier did.  This stick is amazing because it opens up a world of choices, including cable tv subscriptions like HBO and Showtime.  Music is stunning and sounds fantastic over my speakers system, since the Fire TV stick is plugged into the Denon unit, the sound is from the surround speaker array.  This Amazon Fire TV stick is a great choice for anybody that wants to say goodbye to the cable company.", "verified": true, "helpfulness": "0/0", "author": "Blake Griffin"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 5.0, "review": "It is great to have all my subscription services in one place and all the available apps are fantastic. It is so much faster and easier to use than the game console. Definitely a must have and I love the voice controlled app on my iPhone", "verified": true, "helpfulness": "0/0", "author": "Holly Johnson"}, {"rating": 5.0, "review": "Love it. So worth $$$$$&", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 1.0, "review": "Non functional junk. I get HDCP errors. There appears to be no real fix. I'm shocked Amazon let this buggy piece of crap on the market.", "verified": true, "helpfulness": "0/2", "author": "SeattleDweller \"SD\""}, {"rating": 5.0, "review": "great for my not smart tv", "verified": true, "helpfulness": "0/0", "author": "donald burton"}, {"rating": 3.0, "review": "Confusing to set up. could`nt get back off to put in batteries. Needa arrows and start on controls. learning how to use. Excuse me I`m an old fart.", "verified": true, "helpfulness": "0/0", "author": "Gary Wiese"}, {"rating": 5.0, "review": "This is extremely easy to set up and works flawlessly!", "verified": true, "helpfulness": "0/0", "author": "Thomas F. Totten \"Retired\""}]