[{"rating": 5.0, "review": "Addicting, started watching shows that I usually never watch. Finished several seasons of a couple of shows.", "verified": true, "helpfulness": "0/0", "author": "Keith Honaker"}, {"rating": 4.0, "review": "Great to use in lieu of a smart tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's a great item to have finally able to get out of all the cable b.s. and watch the movies and programs I want to watch when I want.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow, what a cool little device.  I've been paying for Prime for years, so adding this was like getting an entire movie service for free.  Highly recommended for Prime members.", "verified": true, "helpfulness": "0/0", "author": "Michael Michel"}, {"rating": 3.0, "review": "Purchased to specifically access WatchESPN's live streaming web broadcasts.  Can view archived broadcasts, etc., but live streaming of current games is not accessible unless you have already purchased either cable or satellite TV, defeating purpose of purchase.", "verified": false, "helpfulness": "0/0", "author": "Steve R. Wright"}, {"rating": 4.0, "review": "I like it a lot but I have trouble downloading apps", "verified": true, "helpfulness": "0/0", "author": "jamie joy huff"}, {"rating": 5.0, "review": "Best purchase!", "verified": true, "helpfulness": "0/0", "author": "Amanda J. Miller"}, {"rating": 5.0, "review": "Bought during pre-Xmas sale as a stocking filler. For the price it is an amazing addition to our entertainment options. Super easy operations and now have available a myriad of programmes and games both free and via Amazon. Totally opened a new world of available options for weekends when cable TV is devoid of originality. Cannot recommend it highly enough for price, ease of use, and the things available on it", "verified": true, "helpfulness": "0/0", "author": "Rosie S"}, {"rating": 5.0, "review": "Great to have. Works wonderfully. A nice break from cable TV!", "verified": true, "helpfulness": "0/0", "author": "John C."}, {"rating": 5.0, "review": "I love it. I have had it for about 2 weeks and it is so easy to hook up and operate.  I set it up and the tutorial was so simple to follow.  I recommend the fire TV stick to anyone that has a HD TV....I thought I would buy a \"smart\" TV but now for a fraction of the cost, I have the same capabilities.", "verified": true, "helpfulness": "0/0", "author": "Carrie Lee"}]