[{"rating": 1.0, "review": "Out of the box, the TV found it but \"no video signal after that.  Tried turning off things, holding the enter key on remote and everything I could think of but got No video signal on tv.Returning.", "verified": true, "helpfulness": "0/2", "author": "PeteB"}, {"rating": 1.0, "review": "I have purchased this fire stick for nothing, I shouldv been warn from Amazon stating that this product is use only with prime membership. I was threat unfairly about this fire stick. I rather keep my chromcast.", "verified": true, "helpfulness": "1/3", "author": "Rehina Quinones"}, {"rating": 5.0, "review": "I really have enjoyed using the Fire TV stick.  I am slightly disappointed with the apps that are available. Like the Lifetime app, it doesn't support my provider which is DirecTv, but the Lifetime website does.  Not sure where the confusion is but that wasn't enough to take away any stars.  Its very easy to set up and easy and doesn't require anymore equipment in my house! YAY!", "verified": true, "helpfulness": "0/0", "author": "C. Nickerson"}, {"rating": 5.0, "review": "I purchased two of these and really like how well it works.  I gave one away as a gift.  I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Richard Fennell"}, {"rating": 5.0, "review": "I've only had it a week but love it so far.", "verified": true, "helpfulness": "0/0", "author": "Ruthie"}, {"rating": 4.0, "review": "Better wifi reception than Chromecast. Nice menus.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Buggy. Frustrating. I love the thing so much, but it's laggy and unresponsive on start up the majority of the time. Currently, all menu's show but not picture when movies play only sound. I will be sending this back unfortunately.", "verified": true, "helpfulness": "0/0", "author": "Ryan Ritchey"}, {"rating": 4.0, "review": "Everything I expected!! Very easy to set up!", "verified": true, "helpfulness": "0/0", "author": "avalon pantin"}, {"rating": 4.0, "review": "have both fire tv and this the \"stick\". fire tv is definitely snappier but this does the job. install kodi and your set. 1 star deducted for lag", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great, easy to set up and gets good signal.", "verified": true, "helpfulness": "0/0", "author": "kip bauldry"}]