[{"rating": 3.0, "review": "This device works as it should but I have trouble physically attaching it to the back of my receiver.  While I can use the included dongle to plug it in, I am having issues with the RF reception of the remote because it is buried behind the gear.  I tried getting an HDMI extension cable to move if out from the back of my equipment, but then I could not get reliable HDMI signal.Amazon Prime movies are a big plus and easy to navigate.  If this piece had IR control in addition to RF, it would be much more useful to me.", "verified": true, "helpfulness": "0/0", "author": "Strat-O-Various"}, {"rating": 1.0, "review": "Would love to give this a great review but can't. First the good, the device is small and the remote is great. Setup was easy and the interface is easy to figure out.But then you have the problems. The first was the buzzing that many have talked about. I was able to solve this by plugging the device into my UPS and not the surge protector.The second problem is the one that takes all the stars away. It freezes when watching Netflix. It's easy to tell that the problem is the device and not my connection. We have the fastest connection Verizon offers. I can easy get 75Mbps in speed test with my Airport Extreme and the device is only 10 inches from the Airport. On top of that we can stream Netflix to our PS3, Apple TV or computers with no issues. I really wanted this device to work. If it had gone well I was going to put one on every TV. Much more affordable then adding Apple TV's to every TV.", "verified": true, "helpfulness": "2/2", "author": "Francis C. Bicking"}, {"rating": 2.0, "review": "I thought it would do more, but it doesn't so I returned it. Its a chromecast by Amazon", "verified": true, "helpfulness": "0/0", "author": "AndyL"}, {"rating": 5.0, "review": "Exceeded my expectations. About 2/3 of Netflix movies are free.", "verified": true, "helpfulness": "1/2", "author": "Bernard Littman"}, {"rating": 4.0, "review": "Great device,a must have for your non-smart TV.", "verified": true, "helpfulness": "0/0", "author": "Lee"}, {"rating": 3.0, "review": "works  could e  better", "verified": true, "helpfulness": "0/1", "author": "Cabelas \"stan the man\""}, {"rating": 4.0, "review": "Works well, have it plugged in my receiver and use it for Netflix and YouTube mainly.  The remote works even with a the cabinet closed.  At times I have noted the software to be a bit leggy and overlay the menu on the icons for the various apps. Just have to restart it otherwise you can not really see what you are doing.  One of the cheaper ways of making a non smart tv a smart tv.  For the price it is very good.  I own an Apple TV and although it can not compete with the Apple TV it has a better price to performance ratio.", "verified": true, "helpfulness": "0/0", "author": "KT"}, {"rating": 5.0, "review": "works great and is  the remote is very small fits nicely in my palm, great for amazing my grandkids", "verified": true, "helpfulness": "1/2", "author": "Me"}, {"rating": 4.0, "review": "It locks up and it has to be unplugged almost everyday-I do like they way it work just wish it was cheaper", "verified": true, "helpfulness": "1/2", "author": "David"}, {"rating": 4.0, "review": "PRetty awesome tool. For 40$ You really cant beat it. Wish it had a few more app choices but im overall happy with it. I may even get the Amazon Prime. Cant afford it but im really thrilled with the free trial so far. Again for 40$ you cant beat this streaming stick.", "verified": true, "helpfulness": "0/0", "author": "Rich"}]