[{"rating": 1.0, "review": "It is kind of a cool concept but unless you have Amazon Prime it kind of sucks.  There are thousands of free movies and shows available on the internet but you can not get to most of them.  I am going to keep looking for a way to watch shows I can watch on my computer but it is not the point to take a half hour to find a half hour long show.", "verified": true, "helpfulness": "0/0", "author": "Anthony Ward"}, {"rating": 5.0, "review": "We have bought two of them, they are very kid friendly. We put them on our 2 main TV's, my children use them all the time.", "verified": true, "helpfulness": "0/0", "author": "Margaret Medcalf"}, {"rating": 5.0, "review": "We love it.", "verified": true, "helpfulness": "0/0", "author": "Arline"}, {"rating": 5.0, "review": "Very easy to use, works great", "verified": true, "helpfulness": "0/0", "author": "bonnie"}, {"rating": 2.0, "review": "I ordered the Fire TV Stick in January 2015, the return window closed in March.  In May I started experiencing problems with the video and audio going out of sync.  This progressed until it was almost impossible to watch any show on Netflix.  Then in July, it started to bump me out of Netflix altogether.  It would seem this is a global issue with the Fire Stick and Netflix.  Sadly, It is no longer returnable.  After calling Customer Service I was instructed to do a factory reset and will end up losing all settings I've loaded on the device.  Very frustrating.", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 5.0, "review": "Exciting Technology for a couple of non-techno adults.  Can't believe how new things improve our lives!", "verified": true, "helpfulness": "0/0", "author": "J. McGuire"}, {"rating": 4.0, "review": "Integrated apps and wifi for your HDMI TV. If you have online accounts (netflix, hulu, HBOgo....etc) this is the perfect product for you", "verified": true, "helpfulness": "0/0", "author": "John Chandler Calkins"}, {"rating": 5.0, "review": "Simple fast, would like the power supply come from the tv instead of a cord", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Excelent way to enjoy my 65\" TV. It compact, easy to manage and a lot of options. The remote control its to sensitive and look cheaper but it is funtional.", "verified": true, "helpfulness": "0/0", "author": "Gerardo Gonzalez"}, {"rating": 2.0, "review": "Horrible streaming quality. Highly compressed and lots of dropped frames. Disappointing. I activated my Prime account on my TiVo (which is also connected wireless) and the quality was very good. Not sure why, the the Fire TV Stick just looks awful. The interface is nice and easy to navigate. If the streaming quality were as good, I'd be able to recommend this. As it is, I would stay away.", "verified": true, "helpfulness": "0/0", "author": "Derek Ledbetter"}]