[{"rating": 3.0, "review": "I've been using a Roku player for television viewing exclusively for more than 2 years. If you want to successfully \"cut the cord\" and lower the cost of viewing television, you will have a difficult time doing that using the Fire TV Stick. The channel offering is very limited compared to the Roku. The interface is nice looking, but the font used is very small and hard to read from across the room. Use this as a supplement to your current cable or satellite provider rather than a replacement and you can enjoy your Amazon and Netflix videos streamed to your TV and the PBS channel is great.  But if you want to go cold turkey and depend on a streaming service completely, stick with Roku until Amazon can expand their channel offering.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "As a prime member, we were offered the Firestick at the introductory price of $19 so for that, I couldn't say no since I've been thinking about getting something like this for quite a while now but price always kept me from doing so.  Let me preface this review by saying I've been a pc/tech user for many many years and I'm fairly knowledgeable about such things; however, I've NEVER owned an internet streaming device for the television such as roku, chromecast, etc.  This is my first experience with something like this but set up was extremely simple. I just plugged it into the tv's hdmi port and then connected that to the wall outlet that came with the stick.  It loaded up and downloaded the new software.  At first, since I hadn't seen such a remote control before, I wasn't sure where the up/down, enter buttons were located but that took only a couple of seconds of experimenting so that wasn't a big deal but for novices, it'd be good to include that information in the instructions that come with the stick- not just in the introductory video you watch after setting the stick up.  I just had to find my wifi network and put my password in which using a remote control to do was a little time consuming since I have a complex password, as everyone should who uses a router but that took only a minute or two at the most.  Then I thought I'd need my password for my cable company in order to view things like the watchespn app, since I'm an avid German soccer fan, I like to watch the Champions League and Pokal games that aren't aired on the tv thanks to stupid things like poker or car racing.  At any rate, that wasn't even necessary; the app already had that information and the video quality was fantastic.  I haven't used the prime membership to view movies on it yet so I can't comment there but I'll most likely update this review after a couple of weeks or so.  One thing I do not like though is even when you aren't using the stick to view anything but it's still plugged into your tv set, it'll still use the wifi signal.  Now, I can't tell you how much bandwidth that eats up when it's basically in \"idle\" - which is what I refer to it when not using the stick to watch a movie or anything, however if you have a bandwidth cap, which I don't think too many people don't anymore, I can't tell you how much bandwidth it uses up like that.  I contacted Amazon customer support and they gave me 2 ways to turn off the wi-fi signal when not using the stick.  You can go into settings and tell it to \"forget the network\"- this will require you to type in the password each time you turn the stick's wi-fi back on or you can unplug the power source to the stick. This is the simplest of the 2 options but I find it's a pain to have to plug the cable back into the stick anytime you wish to use it and don't want to have it using up whatever amount of bandwidth it uses while in \"idle\". Unlike with the Kindle tablet or an apple device, you can't just turn off the wi-fi and back on again.  I recommended to them to please include that feature in the next update if possible because it'd be the simplest way to go about it.  I work from  home so I'm paranoid about how much bandwidth gets used each month and I'd hate to think the stick eats up quite a bit when you're not even using it to watch a movie, show or whatever else but at the same time, the 2 options to turn the signal off each have their drawbacks as well.  As I stated earlier, this is my first internet streaming device so I can't tell you if the same holds true for the Firetv box, Roku boxes, sticks or any of the other devices out there for streaming tv.  At any rate, outside of that issue, I like the Firestick so far and will amend this review once I've used it for a longer time frame.  At $19 (the pre-order price) I'm finding it a cool feature and helps to have something to watch when the 300+ tv channels that we have are all airing garbage or when there's a game on you can't get on the tv's sports channels but is available on watchespn app.", "verified": true, "helpfulness": "1/1", "author": "Elisabeth Sexton"}, {"rating": 4.0, "review": "The stick is great I gave a 4 star because I don't like that you have to plug it into the wall.  I don't recall reading that in the system requirements. Otherwise I would have given 5 stars.", "verified": true, "helpfulness": "1/1", "author": "Wendy Kusamura"}, {"rating": 5.0, "review": "My new favorite streaming device.  Better value overall than the chromecast.  Nice interface for both the main menu and the apps.  I like the in app interface better than the ones on my roku 2 XD.  Sometimes you can notice some stuttering, it is not the fastest around, but not bad enough to be a bother.  You can play some games, which is nice considering I thought I would never use it for that.  The remote is tiny which is something I actually like, and doesn't need to be pointed at the device.  I have not used all of the amazon prime features on it, but prime videos are easy to browse.  The screen saver is nice, and you can customize it, use your own photos, change transitions, etc.  Overall, I'm very pleased with it.  It could be the perfect gift for anyone.", "verified": true, "helpfulness": "0/0", "author": "A. Rodriguez \"Abe Rod 17\""}, {"rating": 5.0, "review": "I bought the Fire TV Stick during the two day sale.  I got my order this week and got everything set up. The set up was difficult only because of my slow internet connection in rural America.  The stick kept updating the software and had a few failed attempts due to my less than 3MB connection.  In rural America that is the fastest connection we can get and it is usually around the 1.5 mark than ever near the 3 mark.  It finally got done doing several updates, and I was off and running.  I tapped into my Netflix account and have been watching it ever since.  The streaming hasn't froze or buffered once, as my Roku does occasionally with Netflix and frequently with Acorn TV.  I can't get Acorn TV (British TV) on my Fire Stick, so I will certainly still use my Roku.  I now also have a back up option for when one of them is slower than the other, which can be frequent in rural America.  Prior to this, the only TV options we have are satellite TV, so these options are far better for me, my budget, and my personal TV viewing style.  I am finally able to have options when it comes to viewing TV.  Prior to satellite, we had to use antenna, which meant 3 channels while growing up that finally expanded to 8 by the time I left for college, which was the first time I ever had cable TV.  Now if I can get a faster internet connection for my TV pleasure.Now for the technical part of the review.  I'm no expert, nor unable to follow directions and use a bit of my computer skills to trouble shoot the set up issues, all my DSL connection.  I plugged the Fire Stick into my TV and the stick into the power cube, which is nice and small but larger than an appliance (my Keurig plug or my large toaster/convection oven).  The size of the device is very small compared to the Roku box, which is much smaller than my old Direct TV box.  This device would be perfect for  children to watch their constant cartoons and educational channels, plus mom and dad to get most all of their choice videos.  I plugged the stick in and connected it to my network and it began attempting the downloads until it finally finished due to my slow connections.  It automatically connected to my Amazon account, that made it super easy, and then I downloaded the TV app for Netflix, which didn't take too long, and then I entered my Netflix account info and was up and running.  The device is an easy solution to many people's TV dilemma.  A down side is the limited apps for channels.  Other than that, the Fire Stick is a great device for those that like watching a bit of TV to unwind in the evenings and weekends.  If you are looking for serious technology, then you had better stick to your cable and satellite.  The cost is by all means below the cost of what you get for your small price tag.", "verified": true, "helpfulness": "0/0", "author": "D. Deen \"D. Deen\""}, {"rating": 5.0, "review": "Worked well out of the box. Got set up quickly except I did have to unplug it and plug it back in because it initially would update but it could just be a problem with my old router. Works well. Netflix,  Amazon prime and other extra services work as expected. Bought a full fire tv after having this in the bedroom due to how much I enjoyed it. Just wanted an ethernet port for Kodi media center to work well.", "verified": true, "helpfulness": "0/0", "author": "Alex Bogherie"}, {"rating": 3.0, "review": "I have a Chromecast dongle and saw the Fire TV Stick was on sale for $19 so I bought it just to check it out.  The Fire TV stick is easy to install if you have a strong wireless signal (Fire Stick wouldn't work on a Samsung Smart TV already wirelessly connected to the internet which was too far from my router for Fire Stick) and easy to use but does less for me than my Chromecast.  Fire Stick adds a physical remote, as well as phone and computer control apps like Chromecast, which is easier to use as the remote doesn't go into standby or require you to deal with lock screens when you want to make quick fast forward, rewind or pause.  Fire TV also adds Amazon Prime video which is of no value to me as all of the offerings of old movies or TV programs I saw years ago if I was interested and very few offerings are current and free.  I already have Comcast Xfinity On Demand, HBO GO and more for a better selection of free current or purchase offerings.  With Chromecast I can easily cast video or pictures with or without uploading to the cloud from either my android phone app or Chrome browser on my laptop.  Not so with Amazon.  I also have many digital movies so I tried uploading one to Amazon's cloud servers and was unable to do so because Amazon web servers don't allow you to upload files larger than 2GB.  When I found that I could upload larger video files to Amazon from a desktop app I did so but when I went to play a movie for friends and family I was notified that Fire Stick will not play videos longer than 20 minutes!  On Chromecast it is also very easy to use apps for premium channels I subscribe to on Comcast like HBOGO (not available on Fire Stick), Showtime Anytime and others just by signing in once to my Comcast Xfinity account on Chromecast without having to sign in for each channel.  Currently I am not using Netflix, Hulu, or the like which are available on both devices.  Bottom line, if Fire Stick supports the content you desire like old movies and TV or simple games which mostly require the purchase of an additional controller, the Fire Stick remote is an advantage over Chromecast but personally I haven't figured out what I would use Fire Stick for as it does less for me than my Chromecast.  Some reviewers say the Roku 3 may be a more complete offering than either the Chromecast of Fire Stick but I haven't tried it yet.", "verified": true, "helpfulness": "2/2", "author": "Jeff2468"}, {"rating": 5.0, "review": "Working as advertised.", "verified": true, "helpfulness": "0/0", "author": "Barbara J. Whitehill \"Bookish Barb\""}, {"rating": 5.0, "review": "Bought is solely to view my free prime videos, so far so good", "verified": true, "helpfulness": "0/0", "author": "Andrew Nagle"}, {"rating": 5.0, "review": "So much better than a Chromecast as far as portability, ease of use and the including remote. Love this thing. Only thing missing is HBO Go which I hear will be added soon.", "verified": true, "helpfulness": "0/0", "author": "Goods"}]