[{"rating": 5.0, "review": "I brought the Fire TV Stick to use on a non-smart HDTV. I didn't need the Fire TV box, mainly because we only needed it for Prime movies/TV shows. It was very easy to setup, and the streaming has been flawless with Prime, Netflix and Crackle.", "verified": true, "helpfulness": "0/1", "author": "William A. Houston \"blues guitarist\""}, {"rating": 3.0, "review": "Plus 5 stars for being faster/smaller/cheaper than the Roku 3. Requires an update out of the box.  You will have to go into settings and change the data collection settings as soon as you update it.  Do not delete your Apps that are listed on the Homescreen-this deletes them from your Amazon account and they must be again purchased.  *AMAZON NEEDS TO FIX THIS*.Now for the bad news:-minus 1 star because video stutters every few minutes-regardless of my internet connection speed (30Mbs) and after changing the default setting on the Firestick from \"auto\" to 3Mbs. You have to change this setting on the Roku as well to prevent buffering/stuttering when in \"auto\".-minus 1 star because it does not support AcornTv-No way to change the default screensavers to a blank screen to save your TV's screen or allow it to turn dark if you fall asleep while watching a program.  Not worth subtracting a point over but it would be a nice feature.Bottom line:  3 stars and is a good deal in you are invested in Prime.  I will be giving this device to my granddaughter since it limits my viewing choices that I currently pay for-namely AcornTV.Update on 08Dec2014:  Here is the response from a TSR at AcornTv:\"We have not yet developed an app for Amazon Fire TV, but we have commissioned an Android app for later this year that we expect will be compatible.\"", "verified": true, "helpfulness": "0/0", "author": "Jeff Murray"}, {"rating": 5.0, "review": "Great product. Turned my dumb tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Jose Cantarero"}, {"rating": 5.0, "review": "I have used a lot of these types of devices including the R box and this one was the simplest to set up. The Remote control is absolutely the best remote of this type I have ever used- Ergonomically its a sweetheart. Never a misstouched control and always a positive feel. The GUI is OK but I have some quibbles with a few of the techniques they used to navigate- but these are just personal preferences and it seemed to work well. The only bone I have to pick with the Fire stick overall was the lack of content sources and an adequate web user guide. I can only hope that with time it will grow to compete with the other devices on the market in content breadth. Overall I would recommend it to anyone who has Prime rights with Amazon- but maybe be a little less enthusiastic for someone without those.....", "verified": true, "helpfulness": "0/0", "author": "bitbob"}, {"rating": 5.0, "review": "So far good!", "verified": true, "helpfulness": "0/0", "author": "Derek Mitchell"}, {"rating": 3.0, "review": "Please help me understand how there can be customer reviews of a product that is not in stock until mid January 2015.", "verified": false, "helpfulness": "0/0", "author": "jameswhe \"James\""}, {"rating": 5.0, "review": "Love it when things do exactly what they are supposed to", "verified": true, "helpfulness": "0/0", "author": "Jason Tacoma"}, {"rating": 4.0, "review": "Easy setup and easy navigation.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Plugged it in, it worked right away, no messing around!", "verified": true, "helpfulness": "0/0", "author": "Charles F. Goehler"}, {"rating": 5.0, "review": "I love it. Sets up in minutes. Now I can watch my Netflix on my old bedroom TV. Well worth the money. I wish I had bought a second one while they were on sale.", "verified": true, "helpfulness": "0/0", "author": "Reader from the suburbs"}]