[{"rating": 4.0, "review": "The remote control is almost impossible to open to insert batteries.  A tool had to be used.But the fire stick is really a great way to watch Netflix series and films", "verified": true, "helpfulness": "0/0", "author": "elizabeth allen"}, {"rating": 1.0, "review": "Very laggy sometimes... freezes while watching Netflix or Hulu and takes me multiple tries of exiting and trying again before I can get it to work again", "verified": true, "helpfulness": "0/0", "author": "Sadie Cunningham"}, {"rating": 4.0, "review": "Would be five Stars but can't find playback settings to keep from autoplay other than that it's all I watch", "verified": true, "helpfulness": "0/0", "author": "Cory Wilcox"}, {"rating": 5.0, "review": "Awesome job on this", "verified": true, "helpfulness": "0/0", "author": "Toney Hill"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "I cancelled one of my satellite boxes since my kids only watch what is available on Amazon Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "DeLynn McAllister"}, {"rating": 5.0, "review": "I THOUGHT I liked my Chromecast. My Firestick does everything my Chromecast does AND get Prime. It even has a remote and an app for my iPhone. The kids are now the owners of a used Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Kari Howton"}, {"rating": 5.0, "review": "I was a loyal chromecast user until I met the fire tv. I received mine trough the sling tv promotion. I can certainly say that it beats chrome cast. It's so much easier to use and you don't have to be dealing with the chromecast symbol not appearing on your app. You do need an Amazon prime subscription to make the most of this product. I am now a loyal Amazon fan", "verified": true, "helpfulness": "0/0", "author": "jose"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Daniel Mendez"}, {"rating": 5.0, "review": "Everything I expected it to be!", "verified": true, "helpfulness": "0/0", "author": "Melissa Coulson"}]