[{"rating": 5.0, "review": "Great device.  I'll give a quick review in sequence of getting it installed.-Packaging.  Neat and elegant. Not important to use of the device., but shows quality. Batteries included. Remote takes a little fiddling to open the remote to install the batteries... I had to press down on the tab AND push the side in a little.-Connecting.  Simple, as described.  I can't see why needing the power adapter is an issue...many electronics do.  and if you need an open outlet a power cord extender or multiple plug where the tv is already plugged in is all you need.-Accessing wifi.  Took me two tries to access wifi after putting in password, but I've seen that issue with my router on other devices so I don't think it's a firestick problem.-Wifi range.  Works at long distance for me. The router is at the other end of house, 60 or more feet away and few a through walls.  I used the included hdmi extender, and installed the product on 12/19 which may have been after a more recent update that improved wifi range, according to other posts.-The intro video.  It is a little corny, but it's not long and does show you how to use the device. No problem with watching it.-The remote.  Neat little device. Simple and intuitive to use and makes selecting choices easy and quick. Seems to be an advantage compared to chromecast and roku, but I have no experience with those devices.-Program choice.  I'm a prime member so the prime offerings are incredible and extensive.  Youtube installed flawlessly. Haven't tried Netflix etc, and may not for a while given what is on prime or available for purchase from amazon..Overall, a great value, certainly for prime members.  Haven't had it long enough to see if there are durability issues, but. as above, in terms of setting it up and its initial use it has far exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Lake"}, {"rating": 5.0, "review": "Like everyone else, I'm sick of the high cost of cable.This device along with a Prime Membership,Netflix or Hulu Plus, and digital antennae for locals would allow you to cut the cord. When you add in the offerings on YouTube, there is so much content available you could easily cut the cord.Start by ordering this device.  Play around with it for a while and see if you agree with me.", "verified": true, "helpfulness": "1/1", "author": "FloydTheBarber"}, {"rating": 5.0, "review": "Great product I highly recommend it I bought it not too long ago and set up was easy and I love using the YouTube apps and picture quality is crystal clear.  I like the fact that it links up with your Amazon prime music account and you can listen to music that you downloaded or uploaded to your library I bought this one it was only $20 and it was the best $20 I spent this year . it works right when you turn on your TV and is more convenient than using a PS3 because the PS3 started up you have to turn it off and this works right away I don't use the remote because my Sony Bravio tv works with it.", "verified": true, "helpfulness": "0/0", "author": "nn86"}, {"rating": 5.0, "review": "Much faster than going through the bluray player or Xbox. I highly recommend downloading the app and putting it on your tablet or phone. The Voice Search is the best. This gives access to all of your paid services and of course all of your Amazon prime content. The best part is you don't have to wait for your Blu ray or Xbox to connect to your network. This device is always connected.", "verified": true, "helpfulness": "0/0", "author": "Michael Graber"}, {"rating": 5.0, "review": "This thing is amazing.  It is faster and easier to use than Roku and Apple Tv and gives you access to hundreds of thousands of  hours  of  streaming entertainment.  Enough said. Buy it!", "verified": true, "helpfulness": "0/0", "author": "B boy"}, {"rating": 3.0, "review": "Easy to install, nice on-screen instructions.  You MUST use the included USB power pod, and it's HDMI only.  Also there's no Ethernet jack.  My biggest issue is that I don't think the picture quality on Netflix is as good as my Roku, there are more digital artifacts.  Otherwise seems fine.BTW I got this when it was first introduced, paid a LOT less than what they're charging now, so I'm especially happy about that.", "verified": true, "helpfulness": "0/0", "author": "Neil in NC \"The real Neil\""}, {"rating": 4.0, "review": "Love the product. Have owned Apple TVs, Ruku box and stick, and Chromecast – this is clearly better. Installation was a breeze. Expect an update (which took about 5 minutes) before you can fully use the product. Was able to get Netflix and Hulu up and running without a problem. Amazon Prime was automatically connected. Should have purchased the upgraded voice control remote. The current remote is not bad – but when you are searching for titles, clicking the letters might take a while. Wish there was remote with a keyboard. Only gave it four..because I feel it could use a better remote.  A backlit version would be great.", "verified": true, "helpfulness": "0/0", "author": "Sebastian"}, {"rating": 5.0, "review": "hey, I got it for $20 so there's no way I'm complain but I am impressed at its speed and \"power\"! Everything I own is \"smart\" now so the only reason I bought this was the curiosity factor but who knows where this will lead...take it to a friend's house? maybe! For me and most people who have gaming devices or smart tv's this is not really a need to own device BUT for travel and for family members who DON'T have a ten smart advices, this is a great gift idea...its really only \"worth it\" if you have Amazon PRIME, which I do so its all good but PRIME isn't free and neither is a lot of the content...I'm still amazed at the elevated cost to own a digital download!", "verified": true, "helpfulness": "0/0", "author": "Duane Hatton \"Big Belter\""}, {"rating": 5.0, "review": "What Can I say? The Fire TV Stick has completely replaced my Chromecast devices in may house. The Fire TV Stick does pretty much everything Chromecast can do and tons more. I like the operation with a remote and/or your phone/tablet device. Also cool is the ability to play games and control them with the included remote or an optional joystick. Setup was way easier than Chromecast, and did NOT require a computer or anything.I recommend plugging the Fire TV Stick into a power outlet with the included adapter as this thing definitely needs the 5W of power to operate (Your TV MAY have a powered USB slot but it will likely Underpower the Fire TV Stick should you go that route)", "verified": true, "helpfulness": "0/0", "author": "Richard Bishop"}, {"rating": 1.0, "review": "Have been excited to try the Fire stick since it was announced; have an Apple TV and a Roku, but wanted something portable to use on the road, at work and at my cottage.So when it finally launched -- at the tidy price of $19 -- I just couldn't say no. Now, I wish I had, or at least paid full price as I am gathering the promotional rate was only for decorative, non-functioning models. I say this because, since it arrived at 11 a.m., it has not powered on, no matter what slot on what TV and what power source I use -- including three sets of batteries. I've also used two Vizios, a Samsung, a Sony, an Element and an RCA TV ... nothing; have plugged it into various power outlets and the USB ports on all TVs.... nothing.", "verified": true, "helpfulness": "0/2", "author": "ajw1978"}]