[{"rating": 5.0, "review": "This thing puts my Apple TV to shame.", "verified": true, "helpfulness": "0/0", "author": "Scooter \"Scooter\""}, {"rating": 5.0, "review": "Great alternative if you don't have a \"smart TV\".", "verified": true, "helpfulness": "0/0", "author": "Harry E. Palmer"}, {"rating": 5.0, "review": "This little thing is awesome! All I wanted it for was to have Hulu and Netflix and it works perfect as well as my amazon prime membership I have everything I want. I love the remote and i can't believe something so small can do all that!!!", "verified": true, "helpfulness": "0/0", "author": "Audrey"}, {"rating": 5.0, "review": "Worked great right out of the box. Easy setup, great for travel.", "verified": true, "helpfulness": "0/0", "author": "Justin P Lindsey"}, {"rating": 3.0, "review": "Not as many apps as on Roko", "verified": true, "helpfulness": "0/0", "author": "Andrew Thompson"}, {"rating": 5.0, "review": "I just bought my Fire TV stick and it's wonderful! It makes my TV a smart TV without installation hassle.I love that I can start streaming these good shows and movies anytime.", "verified": true, "helpfulness": "0/0", "author": "Tama Walker"}, {"rating": 3.0, "review": "Its okay. I want more access to content. Maybe add some more apps to say CW, Comedy Central, Discovery, and others. Its not Amazons fault but more access would bring in more Prime subscribers. The stick loads content fast and Amazon Prime content in HD is crystal clear. The remote could use a light button feature for night time TV watching.", "verified": true, "helpfulness": "0/0", "author": "hdgriller"}, {"rating": 4.0, "review": "Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Estefania Arias"}, {"rating": 4.0, "review": "Great picture and sound, some very good prime assortment show and movies. My only gripe is it would be nice especially with prime that you get a small discount on movies to rent or buy. Other than that I love this thing!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Fire TV Stick is a fantastic little entertainment addition to my Samsung TV! It streams Netflix with ease and I set it up to play all my media from my local NAS.  Easy to setup and just works!", "verified": true, "helpfulness": "0/0", "author": "sgp-shopper"}]