[{"rating": 4.0, "review": "I love the fire stick minus the few technical difficulties we've encountered. The remote that comes with the firestick broke 3days after we got it. The circle part got stuck. We downloaded the remote app and that works great when it's able to connect. The firestick needs to be unplugged to be reset every couple days. Other than that, it is awesome!!", "verified": true, "helpfulness": "0/0", "author": "Samantha Comer"}, {"rating": 5.0, "review": "Works great and increases the viewing choices tremendously.", "verified": true, "helpfulness": "0/0", "author": "Pamela M. Miller"}, {"rating": 5.0, "review": "Great streaming device.  I prefer the interface to the Roku 3 which I also have.  I like that it keeps your recently watched items on the home screen and you dont have to open the specific app to get to them.", "verified": true, "helpfulness": "0/0", "author": "guywhobuysalotfromamazon"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works well and almost on par with similar devices. It can't replace my Roku till it has NHL Gamecenter Live so I flip between them stillPros-Size-Value-Radio Remote (no line of sight issues)-IOS remote App-Has most common apps such as Netflix, Pandora, Tune in,Cons-Needs some more applications from other services. Selection is limited-Video can judder at random times for no apparent reason.-Comes with the basic remote without the Microphone (make this an option at time of purchase please)-Crashed and reset once during my 3 weeks of use.-Most TVs won't power this stick so you will have to plug it into the wall with the little power adapter or into a USB port on the TV.Almost my new favorite streaming device but it needs a little more.", "verified": true, "helpfulness": "0/0", "author": "iZealot"}, {"rating": 4.0, "review": "Have yet to try, but seems like a good item, reasonable.", "verified": true, "helpfulness": "0/1", "author": "Fred"}, {"rating": 5.0, "review": "This is the most amazing device I have ever seen. It worked perfectly right from the beginning with no problems. I got plenty of content. When I left a show on pause for too long, it went into a screen saver mode and started showing me beautiful pictures of scenery. Nice!Somehow I managed to lose my remote right the first day (still haven't found it), so I downloaded the app to my Fire phone, and it works a lot better than the remote did. I even tried the voice recognition feature, after resisting it in every other app. It worked great! I just said \"Buffy\" and up popped Buffy the Vampire Slayer.Why was I so resistant to using voice recognition software before? It's because one time on April first, somebody put a note on the copier at work suggesting it now ran on voice commands. I stood there saying \"Copy one!\" loudly over and over until everybody in the office was laughing at me, and I have been suspicious of voice recognition claims ever since.The voice recognition software on the phone app actually works and it makes your searching much easier. All the features I tried on the Fire stick worked perfectly the first time. The Fire stick is such an amazing technology, it almost seems like magic or science fiction. I can't believe how great it is.", "verified": true, "helpfulness": "0/0", "author": "Orion"}, {"rating": 2.0, "review": "Had great expectations for this.  Plugged it in, connected to my network about 20 feet from the router.  So far so good.  Tried to play a movie and repeatedly got the message no network detected.  That message would spontaneously go away and the selections would reappear.  I tried with a few movies and the same thing happened every time.  So I tried tv shows, same thing.  Finally one movie started and 4 seconds in I got a message saying I had low bandwidth, then a spinning circle, then nothing, then the no network message again.  I have been a prime member for years and this is the worst product I have ever received from Amazon.  Fortunately, they let me return it and gave me a complete refund or this would have been a one star review.", "verified": true, "helpfulness": "0/0", "author": "thorsrotts"}, {"rating": 5.0, "review": "The Fire TV STick is awesome.", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 2.0, "review": "OK, I think this FireStick was advertised with false & misleading information.  The multiple commercials which advertise this product do not show that it requires a 110v plug in to work.  The commercials show someone plugging it into their TV without the cord.  The commercial never shows the 110v plug required to operate this device.  This is simply misleading and implies that it's wireless, which is not the case.  This is just like Roku or other similar products available.On The Good Side:  it is small and easy to use/install.Felt ripped off when I opened the box and saw the plug.", "verified": true, "helpfulness": "0/0", "author": "Steven L Fischer"}]