[{"rating": 4.0, "review": "All in all I like the service it provides. However, not enough instructions on how to use it with other components through which I receive my television signal, i.e., Direct TV receiver, receiver for in home surround sound. Topical search on line to find help/information was like looking for the proverbial \"needle in a haystack.\" Also, it is so hard to remove the back to insert batteries. Once I finally got it open and put the batteries in, I left the back off!", "verified": true, "helpfulness": "0/0", "author": "Donna Triplett"}, {"rating": 3.0, "review": "The screen freezes every time I try to watch anything it's very annoying", "verified": true, "helpfulness": "0/0", "author": "sandra davis"}, {"rating": 5.0, "review": "It brings scree all my Amazon prime to the big screen, lots of fun Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Todd Kunzelmann"}, {"rating": 2.0, "review": "The internet connection on this device constantly drops out and you have to either reboot the Fire Stick or wait for it to reconnect. It's not my wireless or Internet connection, because all my other devices don't suffer the same issue (including my Fire tablet in the same room as the Fire TV Stick). I got this so that I could transfer Prime movies from my Fire tablet to my TV and back in real time - so I could keep watching even if I had to leave the room. This works maybe 60% of the time. The rest of the time I get connection errors between the Kindle and the Fire TV Stick and either have to wait for them to try to talk to each other or restart the video. Very annoying.If everything worked properly I would give this 5 stars. Unfortunately, it feels like the device just isn't quite ready for market. If future generations have an improved wireless device in them (or maybe it's a software upgrade that is needed) then this will be a nice enhancement to the Kindle Fire tablet experience.", "verified": true, "helpfulness": "0/0", "author": "S. Waletzko"}, {"rating": 5.0, "review": "Love this service! Installation is a breeze.", "verified": true, "helpfulness": "0/0", "author": "Rheta R. Russell"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was certainly priced right.It is very easy to install, just plug it into a USB connection on you HDTV and that's it.I am so glad that Amazon offers TV. I was able to cut my satellite TV bill tremendously by purchasing Amazon Fire TV for my home.", "verified": true, "helpfulness": "0/0", "author": "RP"}, {"rating": 4.0, "review": "I love it! It runs slow at times, but for the most part excellent well worth the money.", "verified": true, "helpfulness": "0/0", "author": "YARDDAWG72 \"YARD72\""}, {"rating": 5.0, "review": "Just and awesome device, size, power. By fart the best media device i've ever owned and the cheapest!", "verified": true, "helpfulness": "0/0", "author": "cristian navarrete"}, {"rating": 5.0, "review": "Great and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Shirley Fox"}, {"rating": 5.0, "review": "Completely satisfied! It was very easy to install and it's very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Laura \"Laurlands\""}]