[{"rating": 1.0, "review": "Can't even use it. Did not offer what I needed.", "verified": true, "helpfulness": "0/3", "author": "Helena Dandrea"}, {"rating": 5.0, "review": "It is awesomw!!!", "verified": true, "helpfulness": "0/0", "author": "Adela Mendez"}, {"rating": 5.0, "review": "Loved it so much, bought another one as a gift", "verified": true, "helpfulness": "0/0", "author": "janet d."}, {"rating": 2.0, "review": "They should have done more testing before releasing the product.  It would not pickup my Wifi just 25 feet away. I have no issues with any other devices anywhere even out side of my house.", "verified": true, "helpfulness": "0/0", "author": "Deplinger"}, {"rating": 4.0, "review": "Like it,but needs more content", "verified": true, "helpfulness": "0/0", "author": "R. Sankey \"Ron Zon\""}, {"rating": 4.0, "review": "Awesome product but some video is very choppy on Netflix and Amazon Prime video.", "verified": true, "helpfulness": "0/0", "author": "Dustin Besch"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "P. Smith"}, {"rating": 5.0, "review": "LOVE IT!  Better then my old Google Chromecast!!!  Love the remote.", "verified": true, "helpfulness": "0/0", "author": "Kathy Weibelt"}, {"rating": 1.0, "review": "The good. The interface is great if you like amazon video advertisements, including free prime videos. It is very fast. It seemed to work perfectly for the first month (while still under full warranty).The bad. It constantly loses connection with my wireless network (and it sits 3 feet from the router). If it loses connection it will never automatically regain connection. I have to either log out and log back into my network or restart the device. Both of those take time and then require me to go back to whatever I was watching through the menu system and often have to fast forward back to where I was, as the device doesn't keep track of where I was if I restart it. I called a rep and they said the device is past the 30 day warranty period so there is nothing they can do to help me fix it other than the standard advice of: did you restart all your electronic devices, try plugging them into different outlets, try on different TVs, or try it on another wireless network. None of those worked and even if they did aren't permanent solutions as I don't want to watch it on another TV or at another house through their network, I want to watch it on my main TV at my house on my network. This is the only device on my network that has this issue.Based on reading other reviews I am not the only person with this problem so it seems like something Amazon is not attempting to fix, even though it could probably be fixed through a software update. Buyer Beware, hopefully you never have network issues.", "verified": true, "helpfulness": "1/1", "author": "Jon Simon"}, {"rating": 1.0, "review": "It worked fine the first 2months. Then it's started to freeze every time HBO Go, Hulu, netflix,and YouTube is streaming videos and or movies.", "verified": true, "helpfulness": "1/1", "author": "Bibi Davila"}]