[{"rating": 5.0, "review": "Very nice item. Love that it is so easy and small that it can be hidden.", "verified": true, "helpfulness": "0/0", "author": "ariel raymond"}, {"rating": 3.0, "review": "I bought this item so I could use it in hotels. Unfortunately most hotels redirect you to a website to accept the terms of use. The Fire TV Stick will not take you to that website so it is impossible to use on a hotels network.", "verified": true, "helpfulness": "0/0", "author": "Kyle"}, {"rating": 5.0, "review": "Great for the price", "verified": true, "helpfulness": "0/0", "author": "Mike wagner"}, {"rating": 3.0, "review": "It's an OK Product.  It works pretty well.  Stream video clearly.However I'm not a big fan of how the menu navigates, and also I was surprised that it had to be plugged into an electrical outlet.  The specs probably mentioned that, but the advertisements never show it with a cord running from it.  It's always just plugged into the TV by itself.  Unfortunately, it wouldn't turn on without the external power.", "verified": true, "helpfulness": "0/0", "author": "Pez Collector"}, {"rating": 5.0, "review": "Got it and then could not figure why i bought it, just to see what it was. There are only two of us in the house. Then I put a small TV in my bedroom and hooked in the stick and POW I had amazon streaming to the set through my wireless router.", "verified": true, "helpfulness": "0/0", "author": "Bruce H. Bailey \"bhb56\""}, {"rating": 4.0, "review": "Works great, very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Ron B"}, {"rating": 4.0, "review": "Installation is easy!  Works great.  doesn't have the same features as my Roku but stays connected to my Wifi a LOT better than my Roku!  Love this little Stick!!", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 3.0, "review": "The stick itself is okay. However, you cannot do any mirroring with any other products like apple or Windows via the stick. Also he doesn't have HBO go. If you have more options than it will be great but it's kind of limited. It needs more apps.", "verified": true, "helpfulness": "0/0", "author": "montrellk"}, {"rating": 4.0, "review": "Wish it had a way to stream from computers. Other than that - awesome and super great UI.", "verified": true, "helpfulness": "0/0", "author": "ghouse"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Edward Barbour"}]