[{"rating": 5.0, "review": "Excellent. Love it", "verified": true, "helpfulness": "0/0", "author": "jesus perales"}, {"rating": 3.0, "review": "Works great until it freezes up and I have to unplug the power to re set it. I turned it on last night and it kept telling me I had no wi fi signal. I removed the power from it to re set and it worked great after that. One other time the movie froze up and after I re set it from the power it worked great.", "verified": true, "helpfulness": "0/0", "author": "Steve Cirtaus"}, {"rating": 5.0, "review": "Outstanding! So simple and so effective.... amazing amount of choices. Very Happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Anne W."}, {"rating": 3.0, "review": "Have Apple TV too...needed it for my Amazon prime subscription.  Lots of trashy shows and movies if that's what you like, ugh.", "verified": true, "helpfulness": "0/0", "author": "Judy Smith"}, {"rating": 1.0, "review": "Very disappointed! It freezes a lot and I have to take it out of the port and put it back for it to unfreeze.", "verified": true, "helpfulness": "0/0", "author": "Sorour"}, {"rating": 5.0, "review": "Love it!  This little thing is FAST!", "verified": true, "helpfulness": "0/0", "author": "Glenn Lacampuenga"}, {"rating": 5.0, "review": "It is absolutely awesome.  We had to order another one it was so good.", "verified": true, "helpfulness": "0/0", "author": "Angel Ruyle"}, {"rating": 5.0, "review": "Love it! I have had no issues connecting to the Internet. Ordering one for my mom today.", "verified": true, "helpfulness": "0/0", "author": "d.stor"}, {"rating": 3.0, "review": "The firesick is awesome.  It works better than roku .... However, I bought this extra one as a gift, and gave it to a friend.All my personal Amazon information had been loaded onto the packaged fire tv stick.  I was shocked to find this out from my friend that I gave it to.  BE CAREFUL", "verified": true, "helpfulness": "0/0", "author": "J. Sutherland \"giftbuyer\""}, {"rating": 3.0, "review": "My problem is not the fault of the Fire stick; it's the crappy modem/router from Comcast that I'm forced to use.  That makes it impossible to truly appreciate the product or write a comprehensive review.", "verified": true, "helpfulness": "0/0", "author": "margretmh"}]