[{"rating": 5.0, "review": "The speed and portability of the device are tremendous . I can fit all the necessary components in my pocket and go to any friends house and watch netflix and amazon instant video. This is a great product.", "verified": true, "helpfulness": "1/1", "author": "LD"}, {"rating": 4.0, "review": "It has most of the apps you would want on a media streaming stick, though you'll find some missing that you're used to finding in the android Play store. It's not the fastest media streamer, and sometimes chugs, but a restart fixes that quickly. The remote that comes with it is very comfortable to use, and there seems to be little to no input lag between the controller and the stick. If you tire of using the on-screen keyboard to type, you have one of two options. You can download the Fire TV app from the Google Play/Amazon Appstore and use voice search, or use your android devices keyboard...OR you can buy the premium Fire TV remote that has integrated search functionality. I opted for the former, rather than the latter, because I already have an android phone. I got this on sale for $25, but overall, I think if I had to pay full price for it, I would be more than happy.", "verified": true, "helpfulness": "0/0", "author": "Slamacow! \"Strum and Coke\""}, {"rating": 4.0, "review": "It's a great little device, however some of the apps you download for it still have some kinks that can be somewhat frustrating at times.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Love this Amazon stick. So glue to my tv. Watch slots of movies. Thanks.", "verified": true, "helpfulness": "0/0", "author": "dtn"}, {"rating": 1.0, "review": "Impossible to connect to the Internet. This is a piece of crap.", "verified": true, "helpfulness": "0/0", "author": "Santanna"}, {"rating": 3.0, "review": "it continually freezes up; sometimes for many minutes. I have a good connection.", "verified": true, "helpfulness": "0/0", "author": "Joann Arrington \"Mama Mary\""}, {"rating": 4.0, "review": "Works  great! Butt to hard to type  & navigate  Your! Search / app!! Takes to long & awkward system!!", "verified": true, "helpfulness": "0/0", "author": "Michael  A   Nicholson"}, {"rating": 3.0, "review": "I already have a Smart TV however the apps or limited, so I needed a streaming box. I picked the fire stick as I have a prime membership and can take advantage of the movie/music streaming very easily.The problem with this stick is the storage. I loaded two apps (DS Video and DS Audio for my Synology NAS) and now only have 300mb of space left. I can not delete any apps to free up space and can't see what is using up the 5GBs of storage I apparently have on the stick.I also found the connection a bit wonky at times. Wireless connection stops randomly for the fire stick when it is still running fine for other devices and even other networks through my TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works perfectly.  So much nicer to watch on the big screen versus my Kindle Fire.  Love my Fire and this item just makes it better.", "verified": true, "helpfulness": "0/0", "author": "Gwamma"}, {"rating": 5.0, "review": "Works great and fast and smooth. Remote is very responsive", "verified": true, "helpfulness": "0/0", "author": "paul dermenjian"}]