[{"rating": 3.0, "review": "My Sony DVD player does the same as well as DVDs using my universial remote.", "verified": true, "helpfulness": "0/1", "author": "Ralph"}, {"rating": 3.0, "review": "Much better than chromecast. No need to sync up your phone/ tablet. Just grab the remote and go. There is sometimes problems with the connection but it works fine after you restart it. Wish I could watch shows that are on the fire stick without paying any additional prices.", "verified": false, "helpfulness": "0/0", "author": "Hattie Stavros"}, {"rating": 3.0, "review": "Since I could not access my prime video account, I replaced a Chromecast with the Amazon Fire TV Stick. I find the Chromecast far easier to use and produces a better picture. The first Fire stick I received was defected. After easily installing the second stick I found the content keeps buffering. Annoying to say the least.", "verified": true, "helpfulness": "0/0", "author": "Diane S. Schuyler"}, {"rating": 5.0, "review": "love it!!", "verified": true, "helpfulness": "0/0", "author": "Christina moses"}, {"rating": 4.0, "review": "free things because many do not have. you have to pay", "verified": true, "helpfulness": "0/0", "author": "Alexander Mora Solís"}, {"rating": 5.0, "review": "So much better than my old Roku.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "We started with Apple TV. Then bought Roku. And now Amazon. Our Apple TV had ongoing tech issues and updates that would make it freeze, very annoying. Though I liked the iTunes rental movie choices, we ended up not renting as much because the cost went up so much these last few years. The Roku was decent, and we still use ours in the home office. The fire stick is nice because there's no clutter with wires. I really love these sticks. I also like that it's portable so if you're traveling, you can still watch your shows in the hotel and not be stuck with the lame 4 stations they usually have. I honestly don't see a big different in what it offers compared to Apple TV and Roku. You can access Netflix, Hulu, Pandora. You probably need to buy Prime to get the most options out of it, I'm not impressed with the rental movie options compared to iTunes. If you break down subscriptions:HULU - $95.88 yearly. Access to all the new TV series. Like having basic cable, but limited to what you can stream.Netflix - $119 yearly. Access to their own produced series, and variety of cable network TV and movies. New movies tend to be limited, and they don't provide updated titles as much as I'd like.Prime - $104 yearly. Prime has a lot of the same titles as Netflix. They also have their own \"exclusives.\" I like that they seem to offer HBO and Showtime shows that the others don't. Like Netflix, they don't add new titles often, but I think they may be more frequent at updating than Netflix, and seem to have newer titles. I'm not impressed with their rental movie choices, and they're the same price as iTunes. Prime also offers the perk of free shipping for everything else you buy on here.All of the above services total $318 yearly for TV entertainment with the fire stick, if you choose to use them all. Still cheaper than some people's cable bills. Prime and Netflix are pretty similar, and since Prime is a little more than 10% less than Netflix and offers free shipping on everything else, I will most likely be cancelling Netflix.Overall, the stick works the same as the little boxes, except they eliminate all the clutter and the remote is decent. I read a bunch of reviews before purchasing, and didn't see a big difference between this and the Roku stick, so it really comes down to the best deal you can get if that's what you're after.", "verified": true, "helpfulness": "0/0", "author": "MrsK"}, {"rating": 5.0, "review": "I love this fire stick. The games are okay, but the free movies are wonderful. There is a massive selection of old and new movies. This is the second one we have purchased. The Amazon description was very clear and accurate. The Amazon customer reviews were helpful. It was well packaged and arrived on schedule.", "verified": true, "helpfulness": "0/0", "author": "2563255553"}, {"rating": 5.0, "review": "I have the Fire TV and added the stick  because I like the portability. It works as expected.", "verified": true, "helpfulness": "0/0", "author": "*"}, {"rating": 3.0, "review": "A bit sluggish at times (esp when playing games). Otherwise a very good buy!", "verified": true, "helpfulness": "0/0", "author": "Mandeep Sandhu"}]