[{"rating": 5.0, "review": "This is a knock out product.  Nice menu easy to use and integrates music and pictures really well", "verified": true, "helpfulness": "0/0", "author": "Jesse Rivera"}, {"rating": 5.0, "review": "This was the best $40.00 that I ever spent. Everything that we used to watch on our laptops and phones, is now on our big screen. Plus we always use the pandora app for music. Fire stick gets used every day... Love it !!!", "verified": true, "helpfulness": "0/0", "author": "patti steben"}, {"rating": 4.0, "review": "It's a great device. I love that I can disconnect and reconnect to any of the TVs in my home. However, I found that when I connect my Firestick to my Samsung 40\" SmartTV it keeps shutting on and Off and resetting Itself. Amazon should be a bit more clear on what TVs are compatible without this issue. I can still watch it, but it's frustration when the movie gets Juicy and then It's a Black screen.", "verified": true, "helpfulness": "0/0", "author": "All4Selene \"Shirley E. Martinez\""}, {"rating": 2.0, "review": "It doesn't do youtube well, and jitters a lot in the UI", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Great addition to our television entertainment.  I like being able to watch Amazon Instant Videos on my main television whenever I want.  The setup was simple and the app for my android phone works flawlessly.  Great purchase.", "verified": true, "helpfulness": "0/0", "author": "LIM \"sirchomed\""}, {"rating": 4.0, "review": "This works well with netflix and amazon, though I was disappointed that it did not work with my surface pro 3 using miracast. For $19 it was worth the buy.", "verified": true, "helpfulness": "0/0", "author": "Ashok"}, {"rating": 4.0, "review": "I bought it for a gift and they live it!!!", "verified": true, "helpfulness": "0/0", "author": "Scott Kidd"}, {"rating": 5.0, "review": "Very user friendly. I also love that there are apps within so you can log onto Netflix, Hulu and others.", "verified": true, "helpfulness": "0/0", "author": "Sherri E Muelhoefer"}, {"rating": 4.0, "review": "It's a great device. I love that I can disconnect and reconnect to any of the TVs in my home. However, I found that when I connect my Firestick to my Samsung 40\" SmartTV it keeps shutting on and Off and resetting Itself. Amazon should be a bit more clear on what TVs are compatible without this issue. I can still watch it, but it's frustration when the movie gets Juicy and then It's a Black screen.", "verified": true, "helpfulness": "0/0", "author": "All4Selene \"Shirley E. Martinez\""}, {"rating": 3.0, "review": "Not happy, loses connection to the plex server during every playback.  Chromecast did not, when it loses connection, have to wait for it to time out, and then it reboots on it's own, pressing any button on the remote does nothing.  Can't change over to netflix, amazon prime or anything else once it does this.", "verified": true, "helpfulness": "0/0", "author": "Mathew Wyckoff \"Fyrebaugh\""}]