[{"rating": 5.0, "review": "Awesome product. Works seemlessly. Needed a media stick for our bedroom, problem solved. We have used it for over a week now. I have enjoyed having Amazon music in my bedroom.", "verified": true, "helpfulness": "0/0", "author": "undulyinterest"}, {"rating": 5.0, "review": "Very pleased with the fire stick. The video stream is incredibly fast. Everything loads up faster than the Chromecast. It's also a plus that everything is available directly from the stick. No need for another Wi-Fi device. Planning on purchasing an Amazon controller in the near future.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great little item", "verified": true, "helpfulness": "0/0", "author": "Diamondback \"outlaw\""}, {"rating": 4.0, "review": "I enjoy the HD quality of the picture.  The ability to pause a show and come back a day or two later and pick up where i left off is great.", "verified": true, "helpfulness": "0/0", "author": "Sid Jensen"}, {"rating": 5.0, "review": "I like this product better than the Roku Stick.  The UI is better and quicker than the Roku stick as well.  If you are a prime member then this device is worth the money.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 2.0, "review": "Difficult to connect on the intenet. I put my Ipad next to the stick and was able to connect with no problem, however the stick said no internet conection available", "verified": true, "helpfulness": "0/0", "author": "ajra80"}, {"rating": 5.0, "review": "I got this to replace a Chromecast unit and am very happy using The Fire TV Stick remote instead of an iPad or iPhone as a controller.  it was easy to install adn seems to be working very smoothly.", "verified": true, "helpfulness": "1/1", "author": "gb"}, {"rating": 3.0, "review": "Product arrived promptly.I tried to use it on our 55\" Samsung, but I guess my TV is not smart enough to connect!I then tried it on a newer 32\" and the TV recognized it, and entered the set-up procedure.The bad news is that I still am unable to use it because apparently my router is not powerful enough all the time for the stick to receive the signal.I just ordered a router signal booster, but cannot figure out how to make it work!All considered, this is not as straight forward to use as it sounds!", "verified": true, "helpfulness": "0/0", "author": "MG Keene NH"}, {"rating": 4.0, "review": "Very good product.  Easy setup.  Device is very fast and responsive to remote.  The one app I'm waiting for is the SlingPlayer.", "verified": true, "helpfulness": "0/0", "author": "Bob McNulty"}, {"rating": 5.0, "review": "wonderful, fast, easy to figure out - all as expected!", "verified": true, "helpfulness": "0/0", "author": "laura"}]