[{"rating": 3.0, "review": "First, if you don't have Amazon Prime, this probably isn't the streaming media device for you. Its focus is definitely toward Amazon Instant Video, which is evident when you fire it up; it's as if you're dropped straight into the Amazon Video app on any other device that supports Amazon video.The interface works well enough. On 720p TV sets, the interface is buttery smooth but thin fonts can get a little grainy; an option for heavier-weight fonts (Helvetica standard vs. Helvetica Ultralight) would be a good thing here. On 1080p TV sets, the interface can slow down from time to time but remains crystal clear.As for app selection, it's your typical fare from the Amazon app store - a decent selection, but you really have to dig to find what you're looking for from time to time, even to the point where I'll need to either use the iPad or my computer to open the web interface to its app store because the on-device search isn't really that great. The good news here is that Amazon does a good job of pushing apps from the app store web interface to the device itself.The remote is alright. While it feels nearly as solid as the Apple Remote that comes with the current Apple TV, the plastic does give it a cheap feel. The remote app for iOS devices is cluttered, but works for the most part; I'm not a fan of how scrolling works, and I prefer the Apple Remote app method over this app's method.The biggest thing my husband was disappointed with is that this device does not support MHL. Both of our TV sets and our home theater receiver support MHL, and this is a device where MHL makes a lot of sense; not necessarily for remote connectivity, but definitely for power. In the case of either TV, we had to use the included USB power adapter since neither TV could supply the necessary 1 amp output this device needs. Also, some TV sets will not have space to plug the stick directly into an HDMI port; at least this device came with the necessary HDMI extension cable (though it's very short).The big question is if this device is worth the price or not? For Amazon Prime customers without a Smart TV or other set-top box with Amazon Prime built-in, the answer would be \"most likely\". If you can catch it for $30 or less, that becomes a yes. However, if you already have a Roku device or you're investing in a Smart TV with Amazon Video as one of its included apps, then you can pass on this. For people without Amazon Prime, you're better off to spend your money on a Roku device or an Apple TV, as both devices are far better than this.", "verified": true, "helpfulness": "0/0", "author": "Judith Young"}, {"rating": 5.0, "review": "great product especially coupled with the voice activated remote.", "verified": true, "helpfulness": "0/0", "author": "josef cibulka"}, {"rating": 3.0, "review": "I don't like that there is no off button so its on for 24/7 that's kinda weird. And it freezes sometimes when I watch Hulu idk if its the stick or Hulu other then that I like it", "verified": true, "helpfulness": "0/0", "author": "Kova Jackson"}, {"rating": 5.0, "review": "So many choices for me and my signi. Other, anb the grandkids, LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "nora ward"}, {"rating": 5.0, "review": "Do I need  the Internet for it to work?", "verified": false, "helpfulness": "0/1", "author": "donovan christie"}, {"rating": 3.0, "review": "Little slow", "verified": true, "helpfulness": "0/0", "author": "JOSE CALBO"}, {"rating": 5.0, "review": "Very impressed with this.  Easy to set up, easy to use.  I have had mine for about 3 weeks now and used it about every other day.  I mostly watch movies right before going to sleep.  I have used it to listen to a lot of music as well.  I love that the words to each song is displayed.  I have not used it to play any games and doubt that I ever will.", "verified": true, "helpfulness": "0/0", "author": "ACS"}, {"rating": 5.0, "review": "My husband and I love it. It's easy to use. It's portable. It's small. I use it in one room and swap it to the next with no problem. I would definitely recommend getting the Kodi app for it (something that Roku cannot do).", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 5.0, "review": "had problems with a older  hdtv.amazon help walked me through it .it works great...jim", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 2.0, "review": "Was not fully satisfied,  some movies skip, don't load,  are delayed", "verified": true, "helpfulness": "0/0", "author": "Allen D Monroe"}]