[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "P. HEMBER \"P Hember\""}, {"rating": 5.0, "review": "You will spend more time watching things you never knew you were missing", "verified": true, "helpfulness": "0/0", "author": "e"}, {"rating": 3.0, "review": "Anyone else having remote and lag issues? Before you say it's my Internet, it's not. I've checked. The remote super lags, sometimes it doesn't even work. Everything I play (netflix, hulu, etc) has those buffeting type lags. It worked fine the first few days, smooth, no problem with the controller. But now not so much.", "verified": true, "helpfulness": "0/0", "author": "Jessica Saefong"}, {"rating": 4.0, "review": "Fire TV Stick is nice alternative to Roku and a great addition to my Samsung plasma. Great user interface. Much less clunky than a Roku or integrated SmartTV interface. Loads quickly and keeps good connection with WiFi. Hulu Plus app could use some updating to make it less buggy. Use with surround sound receiver is problematic at times as sound takes a second or two to initially play from stick, through speakers. Overall a great device though. I'm considering getting a second one. Will throw out my old Xbox 360 as soon as Amazon adds HBOGO app to TV Stick.", "verified": true, "helpfulness": "0/0", "author": "on the air"}, {"rating": 4.0, "review": "Keep up the good work", "verified": true, "helpfulness": "0/0", "author": "Raymond Menard"}, {"rating": 5.0, "review": "the movies, and the tv stuff is very good, and of course Amazon Prime, is really great, hullu, and Netflix is good, and all the other movie channels toohowever the games, are a little bit of a let down. I mean  the slots are fine but why would you buy credits for a non profit game ? Come on if I am going to pay for slots, then I am going to play on casinos !", "verified": true, "helpfulness": "0/0", "author": "dan"}, {"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "bonnie padgett"}, {"rating": 5.0, "review": "I am happy with this purchase.  It is much faster than the Nintendo Wii which I had been using to downstream videos.", "verified": true, "helpfulness": "0/0", "author": "Lewin \"Lewin\""}, {"rating": 5.0, "review": "Fire stick is great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "freindly user and excellent pictures and fast.", "verified": true, "helpfulness": "0/0", "author": "Bobby Surya"}]