[{"rating": 3.0, "review": "The fire tv stick is good but the remote is too sensitive. Also, the fire stick tv freeze. I had to unplug and plug it back.", "verified": true, "helpfulness": "0/0", "author": "Michel Li"}, {"rating": 1.0, "review": "Wow I have never been this disappointed in a product I expected good things from.  As other mentioned it worked for the first day or two and was very excited, doesnt have every feature chromecast has, but the interface was very nice.Then, I havent gotten to connect to the wireless since.  The router is maybe 5 feet away and all my other devices have no problem.  Wish I could use it, but right now its just a small brick stuck into the side of my TV.", "verified": true, "helpfulness": "1/1", "author": "mdz_ctliu"}, {"rating": 1.0, "review": "Very disappointed with its performance. It hardly ever connects to my wi-fi and when it does it constantly drops the connection. I have it plugged in and am using the dongle but it doesn't work the way it should. I have other wi-fi devices in the exact same place and they all work.", "verified": true, "helpfulness": "3/3", "author": "Harold"}, {"rating": 4.0, "review": "So far it's been great.  No complaints and works as promised.  Wish there were more apps.", "verified": true, "helpfulness": "0/0", "author": "Mark  S. Fiala"}, {"rating": 3.0, "review": "This review is for a \"Fire TV Stick Streaming media HDMI stick with Netflix, Amazon Prime Instant Video, music, games, and more \" paired with a 42 inch LCD TV. TV also bought from amazon, but not reviewed here.What is it: A small streaming media device based on the FireOS, Amazon’s android Port, Slightly longer than the Chromecast stick, but narrower. The box contains the stick with a charger, remote, a small HDMI extender and a microUSB cable. The device will typically update when you plug it in and connect to your Wifi. Eat a banana and wait. It comes registered to your account unless you order it as a guest. If you ordered it as your device, you are pretty much set to go. The remote has the six buttons and direction wheel/enter you will need most often. The user interface is mostly familiar to FireOS users, others will need patience. In the end, if you use amazon more than google then the stick wins.", "verified": true, "helpfulness": "0/0", "author": "Reviews by Banana \"Say something...\""}, {"rating": 1.0, "review": "I got this because our streaming bluray player was getting so finicky that the kids couldn't turn on netflix any more without help.  Turns out that the Fire TV stick is worse.  Nothing seems to turn it on (even after selecting Tv/vcr and picking out fire tv stick.  The only way to activate it is to unplug it from the back of the tv and plug it back in! This is not convenient!", "verified": true, "helpfulness": "1/1", "author": "Andrea"}, {"rating": 5.0, "review": "Slick. Just opened the box, plugged it in, and wow.  My Roku works great but it seems like the Fire TV stick has the edge in a better interface and smoother operation.  Comes out of the box already registered and ready to go.  Just connect to your wireless internet.To me, the Fire seems to be faster loading too and I've had no reloading issues so far.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it till now! Pretty awesome!", "verified": true, "helpfulness": "0/0", "author": "kanchanjunga prasai"}, {"rating": 1.0, "review": "TOTAL BS, Amazon.  There's no excuse for building Miracast into Fire TV and not supporting Windows.  I will be sending these back.  It's a shame too because the stick is pretty nice, but not so nice that I will keep it when I can just get a Microsoft Wireless Adapter that will work with anything that supports Miracast.  I am a LONG time Amazon Prime member and frequent purchaser of products.  I've never been this disappointed with you. Supporting some devices and not others is so old world thinking, I expect much more from Amazon.", "verified": true, "helpfulness": "2/4", "author": "Chandler B"}, {"rating": 4.0, "review": "Have to go with 3 stars - does the job but intrface is a bit chunky and the remote is horrible - also not many music apps compatrd to ruko - $19 can't really complain.Been using this for a few weeks now - My 9 year old loves it - goes for it every time over the Apple TV - not sure why. Probably the content on Prime - but I think he also prefers the remote/interface! Changed to 4 stars.", "verified": true, "helpfulness": "0/0", "author": "P. Rawlins"}]