[{"rating": 5.0, "review": "I have had this about a week.  I am an Amazon Prime member and I have only watched movies or TV on my iPad.  I love this fire stick.  I don't need all the bells and whistles of the whole fire tv $100 box.  This is perfect.  I can move it to my kitchen tv or living room tv and watch wherever I am.  Just plug it in and start watching.  I pick movies on my computer and save them to the watch list, then the watch list shows up no matter which TV it is plugged into.  I just pick a movie and start watching.  Also, the remote is very basic so it is easy.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Huston"}, {"rating": 4.0, "review": "This was easy to set up and start using.  No surprise to me but a lot of the Prime movies still have a fee to watch them, but since I mostly wanted to access Netflix and YouTube from my \"non-smart\" tv, it will work out great.Also, the phone app is awesome.", "verified": true, "helpfulness": "0/0", "author": "Trinity"}, {"rating": 2.0, "review": "I found these at Best Buy before Christmas for $25 (even though they were backordered on Amazon's own site for $40), so I bought 2.  Set up is easy and the hardware is as fast as promised.  The user interface is not as smooth as Roku's and is heavily slanted toward Amazon's content, but I was willing to live with that since I paid $15 less for these than the Roku stick.  The biggest disappointment is that the content is not nearly as robust as Roku.  When I tried to install any app that requires a link to my cable company (Showtime Anytime, ESPN, etc), they will not work because Fire TV is not supported by Charter Cable. HBO GO isn't even available on Fire TV (they promise that it will be eventually but I am skeptical because Amazon sells a lot of HBO content on Prime).  All of these apps work fine on my Roku.  I was very surprised and disappointed that Amazon would launch this device before having basic agreements in place with content providers.  But again, I think this product is intended primarily to sell Amazon content.", "verified": true, "helpfulness": "1/2", "author": "M. Taylor \"Melisa Bell taylor\""}, {"rating": 5.0, "review": "I purchased my Samsung Plasma 64 inch flat screen a couple of years ago, before smart TV's were readily available. I wasn't concerned because the Blu-ray player came with a Wi-Fi  connection which gave me Netflix but not Amazon.com. With this TV Stick, I get it all. It works great, but I'm worried about loosing the remote. It's so small. So I'm ordering another remote to back this one up. I don't think I need the voice control feature that comes with the more expensive remote. Easy to hook up and activate. Almost too easy. I love it when this happens.", "verified": true, "helpfulness": "0/0", "author": "Combustorbob"}, {"rating": 5.0, "review": "Replaced my Roku 2 XS. Dual band was a huge plus.", "verified": true, "helpfulness": "0/0", "author": "Scott S."}, {"rating": 5.0, "review": "Easy way to stream movies. Set up is super easy.", "verified": true, "helpfulness": "0/0", "author": "gamajeen"}, {"rating": 2.0, "review": "Initial Fire TV Stick buffered to beat the band and dropping link. Replacement resolved the issues.", "verified": true, "helpfulness": "0/0", "author": "R Daniel"}, {"rating": 5.0, "review": "Device works extremely well.  I use with netflix and Amazon Prime and no issues.  Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "miket3d"}, {"rating": 1.0, "review": "Extremely displeased with this.  When I purchased it as an early adopter, one of the main reasons for the purchase was the Miracast functionality, which should have let me fling my viewing screen from another device to the tv via the Fire stick....which, as it turns out, doesn't work at all with Windows.  So, the stick is \"Miracast\" enabled, but not for everything, which is a really sleazy tactic that they weren't terribly up front about.  I've searched the net, and it's littered with complaints and repeated issues with Amazon support techs about it.  That being said....as a media streaming product, it works fine, but isn't setting my world on fire (no pun intended).  I already had a streaming media player, and even though I'm a Prime member, the stick is now a completely redundant purchase for me at this point.  I love Amazon - but this thing is a huge letdown for me.", "verified": true, "helpfulness": "2/3", "author": "Doug"}, {"rating": 5.0, "review": "Flawless so far. Very quick and reponsive using my high speed internet at 15mbps. Dont usually give 5 stars, or RARELY leave a review but in this case i just had to!", "verified": true, "helpfulness": "0/0", "author": "Ed Norton"}]