[{"rating": 5.0, "review": "works great.. The most difficult part of getting up and going is figureing out how to get the battery access cover off of the remote.", "verified": true, "helpfulness": "0/0", "author": "Henry C. Johnson"}, {"rating": 1.0, "review": "Worked about 12 hours then I got different pop ups of why it wasn't working. 1) Network is not connected, even though when I went to the network setting it said \"VERY STRONG SIGNAL\"  2) Nexflix having problems. 3) Amazon not working 4) Network not strong enough. 5) Amazon having problems try later 6) Probably about 10 different pop ups but these were the most prevalent. Even set everything back to default and started over, but this was to no avail. This was a good tool when it worked and had everything that I needed on the TV it was installed on. When it did start to have problems it just became a complete frustration because of all the different reasons why it wasn't working. Even redid my WIFI as I thought that this could be my problem not the units problem. I spent HOURS with this problem.They should have one pop up and it just should say \"THROW AWAY OR RETURN\" this will save a lot of time and frustrations.", "verified": true, "helpfulness": "2/4", "author": "John M. Mcglynn"}, {"rating": 5.0, "review": "So easy to install.  Will save me money on satellite service and increase access to movies and shows I really want to see.", "verified": true, "helpfulness": "0/0", "author": "Pamela Coleman"}, {"rating": 5.0, "review": "works as advertised, a pleasant surprise.", "verified": true, "helpfulness": "0/0", "author": "Thomas"}, {"rating": 5.0, "review": "Beyond my expectations!!  I typically do not write reviews for any products, but so far the Amazon Fire TV Stick has been absolutely amazon.  It is extremely fast, responsive, and works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Edison Diaz"}, {"rating": 4.0, "review": "It has been awesome so far with the exception of it going out on me after using it for about 6-7 hrs straight but I unplugged it and plugged it back in and it came right back on. Not sure if the constant use was what caused it to happen or not but happy with it so far.", "verified": true, "helpfulness": "0/0", "author": "Sergio A. Abreu"}, {"rating": 5.0, "review": "Easy, fun, it will get lots of use.", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 3.0, "review": "I ordered this early and after a month got a Chromecast unit.  Since I already have an Apple TV, this appears to be significantly redundant whereas the Chromecast is more of an extension of my laptop computer.  I'll probably give this as a gift to someone who doesn't have an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Hall Of Record"}, {"rating": 1.0, "review": "Froze and after it froze was never able to connect to the Internet.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this stick!  So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]