[{"rating": 5.0, "review": "Absolutely outstanding, after one I went and got three more, the only question I have, will I have aproblem running 4 Sticks at the same time on the same network.... can someone answer that for me.THXLarry Paylor", "verified": true, "helpfulness": "0/0", "author": "Larry Paylor"}, {"rating": 5.0, "review": "Awesome device! I love it!  It does everything I need it to and then some.  Very easy to use and to be honest it is better than my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jason Harbison"}, {"rating": 5.0, "review": "It was easy to set up, works great on my TV. Viewing Amazon Prime with it and Netflix. May explore other stuff as I go.", "verified": true, "helpfulness": "0/0", "author": "susan M. Gourley"}, {"rating": 5.0, "review": "I love it.  Only concern, is who designed the plug?  A square plug is hard to add to the multiple plugs, I already have on my outlet surge protector.  The folding plug is ok, but I would rather have a plug that fits with all the other plugs on my surge protector.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"zzyglass\""}, {"rating": 5.0, "review": "I have an old 55\" dlp and the Fire TV Stick brought it back to the modern day. No more fighting with the Wii controller anymore.", "verified": true, "helpfulness": "0/0", "author": "David E. Pierri \"Dpierri\""}, {"rating": 2.0, "review": "Amazon has a lot of video's but not much that I want to see", "verified": true, "helpfulness": "0/0", "author": "David Anderson"}, {"rating": 5.0, "review": "Streams seamlessly, absolutely a worthy purchase!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "So simple and so powerful. Get full enjoyment of your Amazon Prime with the Fire TV stick. I live in an area where internet speeds are minimal and when using my laptop to view Prime movies and TV I experienced lots of buffering and low rez picture. With the Fire TV stick I get top quality viewing and no buffering. Can't wait til supply meets demand so I can purchase more for my other televisions.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 2.0, "review": "Constantly loses connection and complains 'internet connection is slow'. But, it also says the wifi signal is 'very good'. My blu-ray player sitting one foot away from the stick connects to Prime flawlessly, never stalls or drops a connection. I've tried both 2.5 Ghz and 5 Ghz wifi connections, same problem.  BTW, my internet connection via my 11N wireless measured from my notebook consistently clocks in at > 100 mb/sec. That's using the same wireless network as the stick. Hardly 'slow'. So far, totally useless. You get what you pay for.PS - I also have Google Chromecast. It actually works, and works well. Just doesn't have Prime.To be slightly less negative, if I reboot the stick, I can usually stay connected long enough to actually watch one movie. But, after a few hours, it will start losing connection regularly.UPDATE: I've been using this pretty regularly. Still loses connectivity. Still reports 'very good' wifi signal strength. Many people have the same issue, check the reviews or do a web search. Amazon's recommendations (reboot your router, etc) are absurd. It's not my router, it's the stick. No other device I have fails to stay connected. On the semi-plus side, if you reboot the stick using the hold-select-and-play-buttons method, after a restart the connection miraculously works. Hmm, didn't have to reboot my router, did I?The big question is, can this be fixed by a software update, or is it a hardware defect? At $20, I'll hold on to it. While this isn't an epic fail, it's certainly a fail. So, if you can get one cheap, might be worthwhile. If you can't, don't bother.", "verified": true, "helpfulness": "1/1", "author": "W. Ezell \"wezell\""}, {"rating": 4.0, "review": "I like the stock, but it is very limited in its use.  You can only access a few sites, and unless you know everything in Prime, you have to try and remember all the shows you want to watch.  It takes a long time to startup.  It's better than buying a new VCR with Internet.  I am disappointed in the quality by Amazon.  They should have set it up better before marketing it.", "verified": true, "helpfulness": "0/0", "author": "Donald B Slusher Jr"}]