[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Sarah \"sarah\""}, {"rating": 5.0, "review": "This is a great buy for friends / family who are not tech savvy: it's very easy to use via voice (if you have the phone app), and the interface is pretty streamlined as well.I had previously bought my parents an Apple TV, thinking it would be easy for them to navigate...but they ended up \"gifting\" it back to me (lol), as they just couldn't figure it out & use it without frustration. This surprised me, to be quite honest, as I figured the Apple interface would be very user-intuitive. I think the ultra-thin and 'minimalist' apple Remote design might have actually played a part in this.The Fire TV Stick's remote, however, is a bit beefier and feels more substantial...not to mention doesn't get lost as easy!Unfortunately this unit's remote doesn't have the voice-commands of its big-brother built into the remote (separate purchase), but you can't really expect that for the price you pay. It also doesn't have surround sound output like the regular Fire TV -- but again, for the price you pay, this unit really does deliver its worth.", "verified": true, "helpfulness": "0/0", "author": "The Active Geek"}, {"rating": 5.0, "review": "Best little media stick with so many options for so cheap!  I plugged it in and was watching Netflix 2 minutes later! Thank you Amazon! I dont even use my Chromecast anymore,  its in my drawer collecting dust! This little stick is incredible,  it has so many of the best apps built right in,  and the remote makes it just that much better.", "verified": true, "helpfulness": "0/0", "author": "Curtis \"Bear\""}, {"rating": 1.0, "review": "WARNING: The Fire TV's & Fire TV Stick's do not Display Mirror with the most popular phone out there, the Samsung Galaxy S-5! Amazon please tell us up front before we buy your product about that fact.", "verified": true, "helpfulness": "0/0", "author": "digihill"}, {"rating": 1.0, "review": "This didn't work for me at all.  It wouldn't load my music and kept freezing up.  I had to return this.", "verified": true, "helpfulness": "0/0", "author": "no name pls"}, {"rating": 5.0, "review": "Awwesome piece of tech that has replaced my cable bill.", "verified": true, "helpfulness": "0/0", "author": "Cesar"}, {"rating": 1.0, "review": "Wasn't happy with my gift for my grandma that was im the hospital.", "verified": true, "helpfulness": "0/1", "author": "arzak"}, {"rating": 3.0, "review": "I like it", "verified": false, "helpfulness": "0/1", "author": "makeba cumberbatch"}, {"rating": 5.0, "review": "Faster than any of my other methods of streaming, Playstation,  smart tv, computer,  etc.  Very easy.  Truly plug and play. My son is so happy he can watch Netflix in his room now", "verified": true, "helpfulness": "0/0", "author": "C. DeCesare"}, {"rating": 5.0, "review": "Thing is amazing. Small. Low power. Fast. I can stream all the crap I have downloaded to my PC through Plex (app). Smooth. Intuitive. Multitask capable.The hate I see on these reviews is like the hate for protein powders because of the taste...", "verified": true, "helpfulness": "0/0", "author": "R. Even"}]