[{"rating": 5.0, "review": "No more cable!!! The Fire TV Stick was exactly what I was looking for in providing entertainment on my new HDTV.  Love being able to either watch my local channels and then watch other entertainment available on the Fire Stick!!  Easy to install and learn to use.  Never going back to cable!!!", "verified": true, "helpfulness": "0/0", "author": "GD"}, {"rating": 5.0, "review": "I love this thing. I would have given it 5 stars if not for one issue. I seem to have to enter my Netflix account email and password every other time I use it. If I could fix this I would be recommending it to everyone I know. As it is, I am thoroughly irritated.UPDATE:  The Netflix issue seems to have resolved itself. Since then, I have bought another fire stick for my other tv. My husband who is extremely technologically inept was able to figure it out without me telling him anything. It took him many times to understand how to get to Netflix on the Blu-ray player and it was so slow, so I decided to get a second one. I have tried Chrome cast​ which is nice, and Roku which I think has a rather clunky interface compared to the fire stick. I have recommended it to everyone I know and I think I might even let my mom get one since it is so simple to use.", "verified": true, "helpfulness": "0/0", "author": "Sarah Jean \"Srahahui\""}, {"rating": 4.0, "review": "I like it but some of the Amazon prime movies come up unavailable. I paid for a service but can't use it fully. That needs to be fixed.", "verified": true, "helpfulness": "0/0", "author": "M. Roberson"}, {"rating": 4.0, "review": "The Amazon Fire TV Stick is fairly impressive for how small it is. I was really surprised on how quickly the device responds with navigation and loading streaming content. 1080P streams quickly and cleanly with no \"jerking,\" on the other hand Limited apps and no HBO Go is disappointing, however, I believe I read that is coming in Feb 2015.I had to take a star off for the annoying 5 minute \"How-To\" video/Amazon Prime advertisement when you first install the device because you CANNOT skip it. I know it's only 5 minutesish but still it's a pet-peave of mine. Just gave me bad reminders of the unskipable bluray/dvd menus and ads. Something I though I left far behind when moving to digital online media.", "verified": true, "helpfulness": "0/1", "author": "Adam \"jcpudd\""}, {"rating": 1.0, "review": "Do not buy this product!!  A complete waste of money.  It keeps giving me the message \"connected with problems\" and I'm not able to use it at all! I bought one for myself and gave one as a Christmas gift.  I'm embarrassed and need to apologize to my family member for giving them something useless.  I've been a Prime member for years and will consider canceling if Amazon does not get their act together.  One more time - DO NOT BUY this piece of junk.", "verified": true, "helpfulness": "0/2", "author": "Taylor"}, {"rating": 5.0, "review": "I received this Fire TV Stick last week and have been using it along with Netflix.  It is the easiest electronic device I have ever used.  There are also games you can get for free as well.  Considering I got this for $20 with Amazon Prime, awesome deal!", "verified": true, "helpfulness": "0/0", "author": "Jesse K."}, {"rating": 4.0, "review": "Jun 2015 update:After the latest firmware updates the issues with laggy and choppy video are almost all gone. I notice them perhaps once per 10-12 hours of playing content, so it seems to be getting better. Netflix still randomly signs out, and having to go to IMDB to put my own rating of some movies or a show is a little of a hassle, but it is definitely better than it was at release.Original review:Would have been 3 stars if not for the ugly power brick and the idiot guy in the setup video. No I don't want that bulshit, it's fine if you show me technical data. And 2 months to get it shipped while still being charged as two-day ( no credit to my prime) what another joke?..The remote is actually nice, better than roku's. Here is the main problem - playback is crappy - the video is often behind the audio and then catches up rapidly. And mind you, that is on standard definition Netflix. No it's not my connection, all other devices I have play the same piece without a problem. And shipping those already activated to an account ... Are you out of your mind!?'!?!? Packages DO get lost and stollen.", "verified": true, "helpfulness": "0/4", "author": "submarine"}, {"rating": 5.0, "review": "Great addition to to my entertainment, and Kindle fire.", "verified": true, "helpfulness": "0/0", "author": "Gene Griffin"}, {"rating": 5.0, "review": "Got this little gadget as a gift for my mom and she absolutely loves it. Easy to use and the quality of the gadget is good. Oh and you don't need another device/computer to stream to it. So if your TV isn't a \"smart\" TV this device will make it \"smart'", "verified": true, "helpfulness": "0/0", "author": "Ph0b1a"}, {"rating": 5.0, "review": "The Fire Stick is amazing. Just want I wanted; a easy way to stream Prime TV and Movies on my TV. Easy to install. Plug it in; enter the passcode for your WiFi and you are all set. Could not be easier.", "verified": true, "helpfulness": "0/0", "author": "Dianne J Powell"}]