[{"rating": 4.0, "review": "Really great product! Enjoy every minute of it, but it would be even better if they did a major update to the Twitch app. I'd like to be able to search for streamers and be able to login to my account.", "verified": true, "helpfulness": "0/0", "author": "Whitley Porter"}, {"rating": 3.0, "review": "Reception is weak.", "verified": true, "helpfulness": "0/0", "author": "Doc"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "Rich Carter"}, {"rating": 5.0, "review": "Great Product!", "verified": true, "helpfulness": "0/0", "author": "Gene Viney"}, {"rating": 1.0, "review": "We tried it on 3 tv's with no luck. Amazon sent us another one at that one worked on one TV for one day.", "verified": true, "helpfulness": "0/0", "author": "Cheri Core"}, {"rating": 5.0, "review": "I am delighted with the Fire TV Stick even though I have nothing to compare it with nor have fully exercised its capabilities and am in the process of still playing with it.  All I know that it is easily installed and appears to do the job that I require of it without being a rocket scientist.", "verified": true, "helpfulness": "0/0", "author": "MRB \"MRB\""}, {"rating": 5.0, "review": "So much easier than having to turn on the Xbox to watch video streaming! Makes any TV into a smart TV. One of the best features in my opinion is the music streaming, paired with the Amazon music cloud, I uploaded all of my music collection (20GB) and created many playlists which I then stream to the fire stick while about in the apartment or when people are over. Video streaming works flawlessly as well.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "robert perkins"}, {"rating": 5.0, "review": "Easy to set-up & get going. We are now considering cutting the cable cord off. We have more than enough channels/shows/movies to watch w/Amazon Prime, Netflix & Hulu. You can also subscribe to HBO/Showtime or even ESPN if you want more to watch. The user interface responds pretty quickly, but I think that's because we have a faster internet service. We are thinking of giving these out as Xmas gifts to our family. So, far we love it & have only had it for almost 2 weeks now. We love how small & compact it is, bc if we were to travel; it'd be easy to take it along w/us & still enjoy the services we paid for. The only con, I can think of is that if you lose your remote; you're kinda SOL.:/ Wish there was a button or something to locate the remote; that would be awesome.", "verified": true, "helpfulness": "0/0", "author": "Joanna Failano"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "karen"}]