[{"rating": 5.0, "review": "I've only used this for netflix so far, but so far, so good! Easy setup and easy to use. I would recommend.", "verified": true, "helpfulness": "0/0", "author": "Em78"}, {"rating": 5.0, "review": "Worked great. We had to update this out of the box but after that it worked recently when we stayed at a hotel. It allows you to accept the \"internet user agreement\" from the hotel and then it allows you to use this stick with the wireless internet.", "verified": true, "helpfulness": "0/0", "author": "fishnewton"}, {"rating": 4.0, "review": "Easy install, works good!", "verified": true, "helpfulness": "0/0", "author": "Neil A Kane"}, {"rating": 5.0, "review": "Very happy with picture quality and ease of use.  Had been using a desktop running to my HDTV for over 10 years now, and finally switched to fire stick since the only tv i watch is netflix, hulu, or amazon prime.  Very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Chesterfield Copperpot \"Chester Copperpot\""}, {"rating": 5.0, "review": "just plug it in and go.", "verified": true, "helpfulness": "0/0", "author": "S. Luse"}, {"rating": 4.0, "review": "Works great. Just wish the Twitch app was a little better. But I cant complain. I love this thing.", "verified": true, "helpfulness": "0/0", "author": "B. Riddick"}, {"rating": 5.0, "review": "I would recommend this to anyone who streams movies from Netflix, HBO go, Hulu etc. I normally pay $60 a year for Xbox live just to watch Netflix. I wanted to save money so I bought this fire stick and I love it. I'm saving money and the quality is fantastic. It was easy to set up and it plays an introduction video to help you get started. I don't have any connection problems what so ever but I also have Internet that runs 135mbps. For people having issues with Internet connection you might have to increase your speed, just like Xbox live you need decent Internet to get good quality picture and no lag.", "verified": true, "helpfulness": "0/0", "author": "Ana"}, {"rating": 3.0, "review": "Wish screencasting was a lot easier. Seems to have trouble picking up WiFi signal when other devices further away do not.", "verified": true, "helpfulness": "0/0", "author": "Andrew Martinez-Alegria"}, {"rating": 4.0, "review": "Good but not great.  I prefer Roku.  I got this because Chromecast and Apple TV don't support Amazon Prime.  I find this to be unnecessarily cluttered and I hate the touchpad iPhone remote app.  (The iPhone app gets very high ratings on the App Store, so I guess it's just not cutting it for me.It works well and doesn't crash, etc. however it's a personal preference thing for me.  I cut the cord a few months ago, so I live on Netflix, Amazon Prime along with some Youtube and Crackle, so I only watch online streaming video and it should be a smoother experience then it is.  None of the streaming devices (Chromecast, Fire TV, etc) do a great job in my opinion, but I like Roku the best.", "verified": true, "helpfulness": "0/1", "author": "M. Behnke \"markb42\""}, {"rating": 5.0, "review": "I bought it so I could stream my home media server (running Plex) to my living room tv. Worked better than expected, connected it to the TV, went through the setting configuration process, and took a few minutes mostly because I use a long Wi-Fi password.Once configured I downloaded the Plex app from the store, sign in and boom 15 minutes tops (from getting out of the box to running a movie from my server) I  got mi full movie catalog on my \"dumb\" tv. As a plus I got the catalogue as an Amazon Prime member and my netflix account.Compared to the Chromecast I used before, this is way better.The only con i found is the Plex app makes ad adjustment to your screen resolution and the frame goes out of proportion, so you have to set it up to the original setting", "verified": true, "helpfulness": "0/0", "author": "Daniel Gómez Ramírez"}]