[{"rating": 3.0, "review": "It works great and fast but cannot use it here in Dominican Republic.Any suggestions?????", "verified": true, "helpfulness": "0/0", "author": "Oscar"}, {"rating": 5.0, "review": "This is amazing, especially if you already love using Amazon Prime. The only complaint I have is the parental control settings force you to enter your pin each and every time you use the stick. I wish there was some way to be more specific, like block adult content or rated R and above, use allow prime or free content to be viewed/played without entering the pin each time.", "verified": true, "helpfulness": "1/1", "author": "stabs"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Lisa Bledsoe"}, {"rating": 4.0, "review": "Makes watching Netflix and Amazon easy!", "verified": true, "helpfulness": "0/0", "author": "Michelle \"book reviewer\""}, {"rating": 5.0, "review": "love it - easy to install, I have used Amazon Prime, Netflix and Hulu and all work great!", "verified": true, "helpfulness": "0/0", "author": "April Kinney"}, {"rating": 4.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "joe viola"}, {"rating": 5.0, "review": "My husband loves it and I do too.  Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Boog"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Tyrone Armstrong"}, {"rating": 4.0, "review": "Fantastic piece of hardware.  Picture quality is consistently good.  The menu is easy to navigate, having a remote, versus something like the Chromecast, is a plus.  There are even basic games that can be played on the stick, which is great.  I would have given it five stars except for the fact that although HBO Go is out for fire TV, it is delayed for the fire stick.  That to me is a big over-site of an important content provider.", "verified": true, "helpfulness": "0/0", "author": "Marc E"}, {"rating": 5.0, "review": "This is perfect and saves you on your cable bill! Everyone should get it!", "verified": true, "helpfulness": "0/0", "author": "Shari Johnson"}]