[{"rating": 5.0, "review": "Got the stick for a bedroom.  I have the Fire TV for the main living room.  The stick works great, maybe a little lag as comparef to Fire TV but you would not even notice it without a side by side comparison.  Everything just works well on the little stick.", "verified": true, "helpfulness": "0/0", "author": "NEYankee"}, {"rating": 5.0, "review": "Excellent. Easy to install easy to use. Better than expected.", "verified": true, "helpfulness": "0/0", "author": "Carmen Pacella"}, {"rating": 5.0, "review": "Own a roku and decided to try the fire stick, love it, works great and my kids can operate it too!", "verified": true, "helpfulness": "0/0", "author": "Mom of Twins"}, {"rating": 5.0, "review": "I placed an order and it was already on back order however AMAZON was able to deliver it before it's due date. I have now had the AMAZON Fire stick for 2 weeks and I am extremely happy with it. It is very responsive. The options are great. The stick is currently also very capable of having other no prime apps installed on it. You can google how to sideload apps to fire stick and you can find guides on YouTube and so on. I will be updating my review in the coming months.", "verified": true, "helpfulness": "0/0", "author": "Saman"}, {"rating": 5.0, "review": "Love it! Easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This little gem is great, when you get a signal.  My WIFI is not that far away and all my other components work great but I've had trouble with the Firestick.", "verified": true, "helpfulness": "0/0", "author": "Virginia McQuery"}, {"rating": 3.0, "review": "I don't like that you can't do some things on this.  It's not as good as Roku and Chromecast, but for the price that I got it for, it's great!", "verified": true, "helpfulness": "0/0", "author": "Ellie's Mom"}, {"rating": 5.0, "review": "Works great easy install", "verified": true, "helpfulness": "0/0", "author": "WindyOne"}, {"rating": 5.0, "review": "I am very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Maxine Bieber"}, {"rating": 4.0, "review": "Love the Fire TV Stick, easy to install, on screen directions were great.  A little disappointed with Prime, the selection of movies are not what I was hoping for, the selection is a little old and dated.", "verified": true, "helpfulness": "0/0", "author": "Skier8288"}]