[{"rating": 4.0, "review": "I've enjoyed using this over Chromecast. There was only one initial lag ever since I'ved used it (4 days now). I also like that it's independent from my other devices so that I don't have to worry about flicking it to the screen. The remote wheel was intuitive and it makes typing passwords or text in wayyy less painful! As for the buttons on the actual remote, it feels just the right amount.", "verified": true, "helpfulness": "0/0", "author": "Vi Pham"}, {"rating": 4.0, "review": "It's exactly what I expected for $25. The setup could have gone a little smoother.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I'd rather to have the HOME page shown up with My Apps automatically instead of having looked for them.  Other than that, everything else works OK.", "verified": true, "helpfulness": "1/1", "author": "Brian Hong"}, {"rating": 5.0, "review": "This works fantasic on our not so smart HDTV!! I love being able to watch Amazon prime, Netflix, and Hulu Plus!!", "verified": true, "helpfulness": "0/0", "author": "Kathleen McMichael"}, {"rating": 5.0, "review": "THE FIRE TV STICK WAS SUPER EASY TO INSTALL, A CAVEMAN COULD DO IT.  I HAVE A KINDLE FIRE HD WHICH I USE SOMETIMES TO WATCH A MOVIE ON USING MY TV.  NOW MY FIRE TV STICK DOES THE SAME THING AND IT IS ALWAYS THERE.GET ONE, HELL, GET ONE FOR EVERY TV YOU OWN.", "verified": true, "helpfulness": "0/0", "author": "GARY"}, {"rating": 5.0, "review": "We bought this when it was on sale for $20 because we've discussed getting rid of cable. It was delivered on a Sunday (Thank you Amazon).  We used it for the last 5 days and we really like it. This is the first device of this kind that we've ever used. We're already Prime members, but haven't really utilized it other than for free shipping.  We've also had Netflix for years. I'm so glad that we purchased this! We're buying 2 more for the kids' rooms and getting rid of cable. The only issue I see is that we currently have all the major movie channels, HBO, Starz, Showtime,  Cinemax, and a couple more. I wish Amazon could partner with HBO to stream HBOGO. I'll just have to hook my laptop up to the TV for that. As soon as all of these are available  Ala carte through my internet/cable provider, we'll add them. It'll still be so much cheaper than cable.", "verified": true, "helpfulness": "0/0", "author": "Tasha Martin"}, {"rating": 3.0, "review": "Great hardware and software, however compared to my Roku ( on my living room TV) this has way too few channels, like 1/25 the number. Other than Amazon Prime Video and Netflix, there is not too much else. The fact that this unit was bought for my occasional bedroom TV use is the only reason it is at all acceptable.", "verified": true, "helpfulness": "0/0", "author": "eye4bear"}, {"rating": 5.0, "review": "Works like apple tv", "verified": true, "helpfulness": "0/0", "author": "Raudel Tolentino"}, {"rating": 2.0, "review": "No Showtime (Xfinity) and HBO Go support.", "verified": true, "helpfulness": "0/0", "author": "Anno"}, {"rating": 5.0, "review": "Awesome, get one.", "verified": true, "helpfulness": "0/0", "author": "stcahillsr"}]