[{"rating": 5.0, "review": "1 week ago we cancelled cable.  I had a Chromecast but we also have Amazon Prime so we figured we needed another device to stream from.  We purchased this product for our living room and LOVE it!!! It's Even easier than the Chromecast because u don't even need your phone to stream to the TV thanks to the simple remote it comes with!! We have Hulu Plus, Netflix and Prime and with this product it makes it so simple to navigate between apps and the picture quality is clear.  Really happy yet again with another Amazon product!!!  Set up was extremely easy!!! I was plugged in, up and running with all accounts linked in under 10 minutes!!!  Who needs cable when you have a FireStick?  Not us!!", "verified": true, "helpfulness": "1/1", "author": "Bighen"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "sharon graham"}, {"rating": 2.0, "review": "I thought this would be an inexpensive answer to stream Netflix to my TV since my PS3 died. There is severe lagging when watching anything on Netflix, the audio works at regular speed but the picture freezes and then speeds up to try and catch up. It becomes impossible to view a program. Reading other reviews from the Netflix app directly on the Fire Stick, it looks like this is a common issue among other users.The others apps for this device work great, I have not encountered lagging with anything else. I would rate this five stars if Netflix worked like everything else. Prime video is nice but I want my Netflix! I purchased this item specifically for streaming Netflix.", "verified": true, "helpfulness": "2/2", "author": "Seahawk J"}, {"rating": 5.0, "review": "I purchase the kindle stick because I wanted a variety of shows and I must say I was very pleased. Its really great!!", "verified": true, "helpfulness": "0/0", "author": "Queen Of Books \"Viva La Diva\""}, {"rating": 3.0, "review": "With tiki I got some news channels. I can't find anything like that with the fire stick. Both products were easy to install", "verified": true, "helpfulness": "0/0", "author": "mike manna"}, {"rating": 5.0, "review": "This is a great addition to my Amazon Fire TV box, I love them both.", "verified": true, "helpfulness": "0/0", "author": "Eve Chute"}, {"rating": 5.0, "review": "It's awesome.", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 5.0, "review": "This is a great way to watch Prime movies on a TV! It's easy to use, easy to 'hook up' and worth the price if you watch a lot of Amazon Movies.", "verified": true, "helpfulness": "0/0", "author": "Marie"}, {"rating": 5.0, "review": "so easy to begin using, and all of the streaming applications are there. It is a great product.", "verified": true, "helpfulness": "0/0", "author": "A New Yorker"}, {"rating": 5.0, "review": "Amazing!! We aren't using our cable at all anymore.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Mosca"}]