[{"rating": 5.0, "review": "I kept debating  whether or not this would be a purchase worthy of buying but I must admit this is even better than my chromecast. Now I can FINALLY watch stuff on my Prime watch list on my tv. Only drawback: the way the stick is designed made it where I had to unplug my bluray player. That's why I was hesitant to buy it because of seeing previous reviews. But I'm satisfied. You just have to try it out for yourself.", "verified": true, "helpfulness": "0/0", "author": "tp78"}, {"rating": 5.0, "review": "Worked a lot easier that google chromecast to watch netflix.", "verified": true, "helpfulness": "0/0", "author": "CJ"}, {"rating": 5.0, "review": "love it, buy it", "verified": true, "helpfulness": "0/0", "author": "ken"}, {"rating": 1.0, "review": "Pros:1. At 20$ (40$ now) it was quite cheap2. That is about itCons:1. Bluetooth whitelist. You are not allowed to connect any bluetooth device to the Stick save the ones allowed by Amazon. Many of us have old bluetooth keyboards and mice laying around and I really don't appreciate having to go purchase another one just to render the device useable.2. Remote with or without voice is just terrible. The lack of a hovering mouse just slows everything down and while they could have added such functionality into the phone remote they refused to do so and made the purchase of a whitelisted bluetooth device almost necessary just to use.3. Does not support the regular Amazon Appstore at all and apps sideloaded from the Amazon Appstore will simply force close because the DRM is different.4. No browser but then, how would anyone ever use it without a functional input device anyway?Thoughts:The Fire Stick had a chance to be pretty darn good and the hardware inside of it would suggest that it should be pretty good. Unfortunately after several months of attempting to use it and just going back, after a fit of rage, to a jury rigged set up of an old phone+hdmi and a bluetooth keyboard (flawless pairing I might add) I have no choice but to say that this is hands down the worst thing I have ever purchased from Amazon and that includes some really stupid stuff. At the very least though all of that stuff either worked as advertised or was simply broken through little or no fault of the seller. The Fire Stick is neither as it does not truly compete with the Chromecast or any Chinese Android box/stick as those actually work and are bluetooth device agnostic. If I could rate the Fire Stick lower than a 1 star I would but unfortunately 1/5 is the worst it will allow me", "verified": true, "helpfulness": "1/1", "author": "John D. Park"}, {"rating": 4.0, "review": "It's nice", "verified": true, "helpfulness": "0/0", "author": "resa1004"}, {"rating": 4.0, "review": "Works better than Chrome cast but its not strong enough for Spotify.  I loose signal all the time on Spotify.", "verified": true, "helpfulness": "0/0", "author": "L.Arrington"}, {"rating": 4.0, "review": "I can't be happier with my purchase of the the fire stick. And my son loves it. We got it for his room so he is able to watch tv. So many apps and with netflix and prime video its perfect. My only disappointment was that it says if you are a prime member it comes registered to your account aleady to go. But I had to register which takes a few minutes since all you have is a remote and you have to go one letter at a time. Other than that it's awesome.", "verified": true, "helpfulness": "0/0", "author": "S. Cash"}, {"rating": 5.0, "review": "Really enjoy the flexibility of these. Purchased both a stick and fire tv and love them both", "verified": true, "helpfulness": "0/0", "author": "joe rovira"}, {"rating": 5.0, "review": "Works well and easy to set up...just as described. Haven't used it for services other than Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "George L. Buelow"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Leonardo Navas"}]