[{"rating": 1.0, "review": "Didn't expect such a horrible and unfinished product from Amazon.Youtube : Youtube casting does not work. Youtube rental videos get stuck forever. Not sure if Amazon issue or Youtube.But after using the product for a week I am very certain it is Amazons mistake.Sling TV : Main reason for me to get fire tv stick.What a disaster. Every five minutes video stops and goes back to home page or just gets stuck. Insane.... it happens every five minutes.Yupptv : Dont want to talk about it.It just makes me very angry and frustrating. Just like sling TV, channels get stuck , nav goes back to home page, automatically channel changes ..all making your watching experience horrible.So if you are a person who wants to just WATCH and relax a tv channel or youtube video rental or videos this is NOT the product for you.What a shame...Amazon...  free or not this product is NOT worth.", "verified": true, "helpfulness": "0/0", "author": "JSK"}, {"rating": 5.0, "review": "Wow, nice.I can plug and unplug and carry and travel with my amazon prime videos.  I just need a TV with HDMI and a wall socket for power.", "verified": true, "helpfulness": "0/0", "author": "gadgetgrom"}, {"rating": 5.0, "review": "If you don't have a smart tv, this is perfect! It has netflix, hulu, amazon, and a ton more. I love it. It is simple and fast to use.", "verified": true, "helpfulness": "0/0", "author": "erin pitts"}, {"rating": 5.0, "review": "Bought this for my 7 year old daughter. Best purchase ever. She loves it and controls it all on her own. Not like chrome cast where you need a device to cast from, this is similar to a roku, etc but no big box and less expensive.", "verified": true, "helpfulness": "0/0", "author": "Dustin Shropshire"}, {"rating": 5.0, "review": "EXCELLENT", "verified": true, "helpfulness": "0/0", "author": "Sergio Aguero"}, {"rating": 5.0, "review": "Love this.  So far it is a great buy!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The menu isn't user friendly like the Roku that I have on another tv. I accidentally bought an episode of a program when I pressed the title expecting to get a synopsis of the program and no opportunity to confirm or reject purchase.", "verified": true, "helpfulness": "0/0", "author": "Brenda S. Isaacs"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "poco1949"}, {"rating": 4.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "5134"}, {"rating": 4.0, "review": "We really like this firestick!  It has everything we wanted and more! The only downside is there isn't an off button, it just goes into sleep mode. Other then that it's fantastic!  Has a ton of apps and great quality video playing.", "verified": true, "helpfulness": "0/0", "author": "reviewlady123"}]