[{"rating": 1.0, "review": "I wanted to like this thing, I really did.  It's marketed as the most powerful streaming stick.  If this thing is the most powerful, and by powerful they mean the best streaming experience, then this thing fails miserably.  I've used it now for 6 months and I can't take it anymore.  I purchased this to watch Netflix, Hulu Plus, and Amazon Prime content.  The problem is I can't watch anything without this thing freezing up.  Netflix has to pause and buffer every 15 minutes.  Hulu Plus is the WORST.  Long buffering/loading time, and when it comes back from a commercial there's a black screen but the audio works.  I've tried exiting and getting back into Hulu, same problem.  I've tried uninstalling and reinstalling Hulu, no luck.  I've tried clear cache & clear data, didn't help one bit!  I've unplugged my modem and router, didn't help at all either.  I have now resorted back to accessing these streaming apps through my blu ray player and haven't had any of these issues.  The problem is not with my internet, the problem is the Fire Stick and I refuse to use it anymore.  Which is a shame as it was easy to navigate and I want to add sling TV, but since it has such problems with Netflix and Hulu, I'm not about to see what kind of headaches it brings to sling TV.  My advice, stay away from the Fire TV Stick.", "verified": true, "helpfulness": "1/3", "author": "Mom in Nebraska"}, {"rating": 5.0, "review": "Love it..", "verified": true, "helpfulness": "0/0", "author": "Lowell B."}, {"rating": 5.0, "review": "Great overall product...would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Matthew burwell"}, {"rating": 5.0, "review": "Love this item...I like I can mirror my amazon tablet to my TV", "verified": true, "helpfulness": "0/0", "author": "Saundra D Ward"}, {"rating": 2.0, "review": "not easy for an older person to use and WARNING!!!!!!!  YOU CAN EASILY RUN UP A BIG BILL WITHOUT REALIZING IT!!!!!!(The upside is if you cannot use it Amazon is very good about refunding)  Once we realized the problem their wonderful customer survice was very helpful.----- Unlike Sling tv customer service who said, too bad.I would not recommend SLING TV for older people either.  Both are difficult to navigate.", "verified": true, "helpfulness": "1/1", "author": "Roy Spell"}, {"rating": 5.0, "review": "It makes the Chrome TV look like a piece of junk for an excellent price! It does a large variety of things. It really is super entertaining!", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "This is a great alternative to cable! I ordered Sling tv and its  great! And my Amazon Prime is right there. Awesome if you don't have a smart tv.  The fire stick is great, sling will pause every now and then.", "verified": true, "helpfulness": "0/0", "author": "ami1231"}, {"rating": 1.0, "review": "I have had this item since December, and I have not had a good experience with this product at all.  It does not stay connected to the internet, and when I do try to connect, it says that it avoids it due to poor internet connection even though I have the fastest internet offered by Comcast, and my other home devices seem to not have any problems connecting.  This even says my signal is good (see picture).That's not the only problem.  When I finally do get it connected, it does not give me any sound through the TV.  When I called Amazon about a warranty, all they could do is issue a refund (which I was fine with of course).", "verified": true, "helpfulness": "3/3", "author": "Ryan"}, {"rating": 4.0, "review": "Received as described. Shipped fast. Bought as gift. So far so good.. Thanks", "verified": true, "helpfulness": "0/0", "author": "Joseph R."}, {"rating": 1.0, "review": "Cannot seem to get it up and running and cannot find information on how to.  cannot seem to get on-line despite my lap top getting on line with same password.", "verified": true, "helpfulness": "0/2", "author": "Norma J. Meakes \"shiny curly\""}]