[{"rating": 4.0, "review": "Way behind compared to chromcast while straming videos from dailymmotion and many other sites, though quailty is very good.", "verified": true, "helpfulness": "0/1", "author": "Prasad kulkarni"}, {"rating": 5.0, "review": "This is a sure \"fire\" winner.  Very user/feature friendly, easy setup.  Kicks the crap out of Google Chromecast for the money- particularly if you have an Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "michael"}, {"rating": 5.0, "review": "After 3 weeks we've only had one hang up to complain about and a cold start fixed it. Beats the HECK out of the Chromecast! I'm giving that dog away. Having much better consistency streaming from Amazon Prime over Netflix as well, but hey, you can do both on this device!", "verified": true, "helpfulness": "0/1", "author": "CyberPirate"}, {"rating": 3.0, "review": "Not the best media streaming device. It does what it needs to but it has a hard time picking up the signal in my house compared to the other devices that I have. I would pick the Roku stick over this.", "verified": true, "helpfulness": "0/1", "author": "Mary Lynn Lutenski"}, {"rating": 4.0, "review": "Love this little stick being a Prime member. I'm always watching movies off of it or listening to music. Setup was easy. Haven't had the best of luck with the YouTube app download on this for some reason. The app downloads just fine but when I purchased a movie off of Google Play it never had any playback. Just the spinning wheel of boredom. I believe it had hung up on a few extra screens where you had to confirm age and so forth which I ended up finding by logging on through the internet otherwise I would've never known. I did try to view a couple other quick videos to see if it was just that movie but didn't have much luck with those either. I can always watch YouTube on other devices though so it's not that big a deal just kind of annoying. Other than that I really like this product especially since it quite nicely eliminates the cord from the Kindle to the TV HDMI port! If you're not a Prime member you'd probably be better off with a Chromecast or alternate competitors device. The selling point on this is really the free stuff that comes with the membership.", "verified": true, "helpfulness": "0/0", "author": "whitefire"}, {"rating": 2.0, "review": "This has been a disappointment.  The user interface is VERY slow.  Sometimes it freezes.  Sometimes it causes weird audio artifacts when playing TV shows from Hulu Plus -- it will just buzz for a second or two.  The YouTube app is so slow sometimes it will be several seconds before the remote responds. This product is just not very good.  I'm switching to Apple TV.", "verified": true, "helpfulness": "1/1", "author": "jeremy646 \"Jeremy\""}, {"rating": 5.0, "review": "Simply awesome - I love the UI!", "verified": true, "helpfulness": "0/0", "author": "Benjamin Netanyahu"}, {"rating": 4.0, "review": "love the remote. makes it o much easier than using the chromecast. BUT that said, its hard to mirror the cell phone. Chromecast is easier on that.the market still needs a product which does not serve the purpose of a particular company... amazon or google or another one. we need one product that is above the single focus and helps customer with all their tablets be they fire or apple or android based. Like this comment if you all agree!!", "verified": true, "helpfulness": "0/0", "author": "Foofi"}, {"rating": 5.0, "review": "Love, love love!", "verified": true, "helpfulness": "0/0", "author": "dmcallister"}, {"rating": 5.0, "review": "Got a month sooner than projected... easy to use. Haven't put a dent in my exploration but love it already.", "verified": true, "helpfulness": "0/0", "author": "Crowned \"Crowned\""}]