[{"rating": 1.0, "review": "Fire stick is leeching data. Shows keep running, it does not have auto shutoff to customize. Most of the streaming devices shutoff after a certain period of no activity, but fire tv keeps running the show even if the tv is switched off. This caused me to go beyond my data cap for straight 2 months. Not using this device until Amazon fixes it.", "verified": true, "helpfulness": "0/0", "author": "MADELLA JAIKISHORE"}, {"rating": 4.0, "review": "It is high quality works well for videos however there are some software bugs when playing music", "verified": true, "helpfulness": "0/0", "author": "dustin ordahl"}, {"rating": 4.0, "review": "The only thing I was disappointed in was that my cable provider doesn't support the Fire TV so I am not able to view my HBO account on the stick.  Otherwise, enjoying the device very much.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "So I have been using this for the past 3 months and I am impressed. It's fast powerful and capable of so much, but I have also begun to see its short comings.First and foremost this needs a UI that is less Amazon centric and more Rokuish in layout. It is very hard to navigate and find things as well as what is Prime and what is purchase.I recently signed up for Sling TV and had the choice of Roku or Fire and chose the Roku simply because it is easier to use and has more apps. I know Amazon is working hard, but again a software update is neededI would still recommend a fire stick, but after a Roku at this point", "verified": true, "helpfulness": "0/0", "author": "Ryan Kirkpatrick"}, {"rating": 3.0, "review": "You will sell more units when you allow Latin America to use Amazon Prime streaming benefits, It's a shame you don't, I'm glad we have Netflix", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"Luis Soto\""}, {"rating": 4.0, "review": "your items works exelent", "verified": true, "helpfulness": "0/0", "author": "saisnarine ramdas"}, {"rating": 1.0, "review": "Always hanging and restarting. Mirroring is very slow.", "verified": true, "helpfulness": "0/0", "author": "Jay Sese"}, {"rating": 1.0, "review": "NBA Game Time won't work if outside U.S. I recommend you buy an Apple TV it has the same app and won't stop you from watching anywhere in the world.", "verified": true, "helpfulness": "0/0", "author": "Franklin A. Ceballos M."}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "SRINIVASA BV"}, {"rating": 1.0, "review": "I ourchased it with the understanding that it would enable me to use my tv as a computer monitor, wirelessly. There is no way i could discover to do this.", "verified": true, "helpfulness": "0/0", "author": "walter leo short"}]