[{"rating": 5.0, "review": "So simple even I could use it! Great product to use with Amazon Prime. Highly recommend it for anyone who likes to watch TV a lot!", "verified": true, "helpfulness": "0/0", "author": "Wetzy"}, {"rating": 5.0, "review": "I cannot believe this thing is $39.  So easy to set up, use, and watch things on my TV instead of my laptop.  And, by the way, Transparent is just about the greatest show ever made. Not for the easily offended or uber conservative, but the writing and acting is just incredible.OK, I have also heard people say that the streaming stops and is jittery.  I've watched for at least 7 hours and have not had that happen once.I love love love the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Soph"}, {"rating": 1.0, "review": "No hbogo...put it on and you'll get 5stars.", "verified": true, "helpfulness": "1/1", "author": "kyle4anderson"}, {"rating": 2.0, "review": "The Amazon fire TV stick is neat... when it works. I have a small home and my Wifi router is located realitivly close to the fire stick but for some reason it completly drops wifi signal. I can't get through 1 half hour show without frequent stops and 2 or 3 reconnections to the network. I also own a Chromecast and one of the first Roku players. Both of these devices vastly out perform the Fire TV Stick. I highly recomend either of these devices over the TV Stick. maybe the much more expensive Fire TV is better?", "verified": true, "helpfulness": "0/0", "author": "knight53089"}, {"rating": 5.0, "review": "Received this as a Christmas present, and I love it!", "verified": true, "helpfulness": "0/0", "author": "Billie"}, {"rating": 1.0, "review": "it worked incredibly well for just under three days.", "verified": true, "helpfulness": "1/1", "author": "marc chouteau"}, {"rating": 5.0, "review": "Love my fire stick. Now I can watch netflix in the bedroom even if my husband is watching it on the  TV  in the living rm or my son's  watching on his PS3  in his rm. Best $40.00 present  . Merry Christmas to me!", "verified": true, "helpfulness": "0/0", "author": "Patrice De Arman"}, {"rating": 4.0, "review": "Easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Gene Williams"}, {"rating": 4.0, "review": "Excellent product, nice and fast plus easy to use.  The plex app also makes this excellent.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Diane Strowbridge"}]