[{"rating": 5.0, "review": "Great little device that works with most of the popular streaming services out there.  I use PLEX mostly since I have my own media library, but I like the suggested apps and extra content that is available.  I LOVE the remote as it makes the whole experience much better.", "verified": true, "helpfulness": "0/1", "author": "asendic"}, {"rating": 5.0, "review": "Works great, built solid, and fast. No issues as the product works as advertised and includes the major video distributors (Netflix, Hulu, etc.). The only gripe with this product is the extended set-up, but for folks who aren't tech savvy its helpful.", "verified": true, "helpfulness": "0/1", "author": "Hi-C"}, {"rating": 5.0, "review": "We bought these when they first came out and they were extremely easy to set up.  They have wonderful parental controls (protected with your Amazon pin) and I can put this in my son's room knowing that inappropriately-rated movies, TV shows, and purchases are restricted from him.  PLUS it plays games!  How cool!!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Much faster than Chromecast.  Didn't think I'd like dedicated remote, but turns out it's much easier to navigate with remote esp. given speed of Fire TV.", "verified": true, "helpfulness": "0/1", "author": "Frederick L. Johanns III \"Fred\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Lisa Joles"}, {"rating": 5.0, "review": "Love it.  BUT...my cat chewed through the cord and I cannot see where I can order a new one.", "verified": true, "helpfulness": "0/1", "author": "Nancie C."}, {"rating": 4.0, "review": "I own an Apple TV, a Google Chromecast, and just got the Fire TV stick.The Fire TV stick is a great deal for the money.  I'll start off by saying that I mainly have apple products, so in general the Apple TV fits best into my household.  It also compares more closely to the Fire TV, so I may reference it briefly, but in general I'm not going to use it too much for comparison.Pros:  The Fire TV stick is fast!  Theres negligible UI lag, and everything feels very well put together.  There are not only the apps that come with the stick, but you have all the apps that are available on the Amazon App store.  The picture quality is good, as is the sound.  The build quality seems very good as well.  I've had no issues with netflix or the amazon video store -- my two primary uses.  I have yet to run too many apps on it, but I will.Big Pro:  Because its an Android device, you can sideload other android apps on it pretty easily (read: Kodi)  This is really the killer feature for me, as I can watch all the media that this makes available.Cons:  The device is power hungry.  The chromecast I can plug into my TVs USB port for power, which is very convenient.  The Fire TV needs more power, and actually doesn't work off the USB port.  Same with my sister's TV.  We both had to use the included power supply.  Its not big, or poorly made -- Its just a shame to have to use an extra power outlet when I have so few to spare.  Also the device mirroring doesn't work with iOS right now.  On the apple TV i have AirPlay, which is the best experience.  On the Chromecast, I can mirror many apps.  I can do none of that on the Fire Stick.  If you dont care, great -- but I wouldn't use this as my only device purely for the reason that I use mirroring for so much off my laptop or phone.", "verified": true, "helpfulness": "0/1", "author": "maswell"}, {"rating": 5.0, "review": "Very good device. All in one pkg at a cheap price. It's fast no lag at all and has all features you want in it.", "verified": true, "helpfulness": "0/1", "author": "Tesla \"Tesla\""}, {"rating": 1.0, "review": "Good but lags", "verified": true, "helpfulness": "3/4", "author": "Nicholas A. Kyriakides"}, {"rating": 5.0, "review": "Really love it!", "verified": true, "helpfulness": "0/1", "author": "Kymberly H."}]