[{"rating": 5.0, "review": "Easy to install; less complicated than Chrome cast", "verified": true, "helpfulness": "0/0", "author": "jackc"}, {"rating": 3.0, "review": "UX needs a little work", "verified": true, "helpfulness": "0/0", "author": "Eric A. James"}, {"rating": 5.0, "review": "Easy to install.  Great addition to our Dish programming.", "verified": true, "helpfulness": "0/0", "author": "Patricia R Ickes"}, {"rating": 5.0, "review": "Works, great, and so easy.", "verified": true, "helpfulness": "0/0", "author": "Sharon Lukemire"}, {"rating": 5.0, "review": "Item has worked as accepted, and or better. We have enjoyed the fire stick very well.Thanks", "verified": true, "helpfulness": "0/0", "author": "Geg"}, {"rating": 4.0, "review": "I purchased the Firestick when they had the special on it before it's release. It came in sooner than expected which was great! Set up was really easy, except you would think the easiest part would be putting batteries in the remote, there is no Mark on the back on the remote, there was no instructions on how to get the back off...we had to practically pry the back off to get the batteries in.  The interface is great...very easy too use and I love how when your watching a series the next show automatically plays as one episode ends. Searching for programs are super easy..and I discovered that while looking at programs on Amazon Prime, I was looking at one season and it said it was available too watch on hulu plus...I think that is very convenient that it will tell you what app the episode you are looking for is available on. Now for the problems and the reason I'm giving it a 4 star. I've not even had this a month, but so far it has frozen on me 3 times...don't know how many times it's done it to my husband. I have to unplug it in order to reset it. Another thing it has been dropping internet..I'll be in the middle of a show and it will start buffering then say the program cannot be played please find something else...but I unplug it and plug it back in and it will play again..I've never had this problem with my roku. I'm thinking I'm going to have too send in a ticket...  Overall, it's a great product..very easy to set up and use. Hopefully the kinks will work out", "verified": true, "helpfulness": "0/0", "author": "Momma2autism"}, {"rating": 5.0, "review": "Great device! Easy to set up and worked as advertised.", "verified": true, "helpfulness": "0/0", "author": "Dale Cooey"}, {"rating": 5.0, "review": "So easy to use and love that I can operate it with an app on my droid or my ipad.", "verified": true, "helpfulness": "0/0", "author": "MacDaddy"}, {"rating": 4.0, "review": "Packaged arrived in great condition and at time promised.  It was very easy to set up and was already registered with my Amazon account.  Very easy to operate and so much better being able to watch my Amazon Prime movies on TV rather than my computer.  Only wish there was a way to stream straight from other Internet sites that do not have an App.  But, I suppose once I eventually upgrade to a smartphone or to an HD Kindle Fire, I will be able to fling it to my Fire TV Stick and resolve that drawback.", "verified": true, "helpfulness": "0/0", "author": "royalheir"}, {"rating": 5.0, "review": "Excellent product!! Why is now in 39 dls?? I want to buy 2 moré for my others tvs", "verified": true, "helpfulness": "0/0", "author": "yolanda serrano"}]