[{"rating": 5.0, "review": "The Amazon Fire TV Stick,  Works great and has so many things available to do.  It is well worth the money.  Have had it just a few days and; well pleased with the performance.", "verified": true, "helpfulness": "0/0", "author": "Claude Kinard Sr"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Margaret A. Bracco \"Saddparade\""}, {"rating": 5.0, "review": "Fantastic change. I had a Roku 3 and it was the slowest piece of garbage I have ever owned. The fire stick is everything it says on the box and more. Love it!", "verified": true, "helpfulness": "0/0", "author": "matthew aten"}, {"rating": 5.0, "review": "Best thing ever made", "verified": true, "helpfulness": "0/0", "author": "Janet"}, {"rating": 5.0, "review": "I love it so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Anthony D."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "kimberly carhart"}, {"rating": 5.0, "review": "Supports Netflix Profiles! Got ours today and highly recommend. Roku let us down when an older TV couldn't support the Roku 3 and their lower boxes didn't support Profiles. This inexpensive, little device gives us everything we need. Setup extremely easy! Get it!!", "verified": true, "helpfulness": "0/0", "author": "Donna S. Tabatabai \"Donna Sue\""}, {"rating": 5.0, "review": "Love it! Easy and Convenient.", "verified": true, "helpfulness": "0/0", "author": "KatM"}, {"rating": 5.0, "review": "I had a Chromcast set up previously and this one is much better and has a lot more functions. Not to mention it hooks up with amazon prime TV which I love. Between this and Netflix we have completely eliminate cable I also like Hulu six months out of the year. Catch up on all those TV shows LOL", "verified": true, "helpfulness": "0/0", "author": "Christie \"Love good motivational books and books about business.  I sell real estate and have since 2001.  Love being a mother of a little boy and love my 2 dogs!\""}, {"rating": 1.0, "review": "I had no idea that it was refurbished .smh...", "verified": true, "helpfulness": "0/1", "author": "dennis walker"}]