[{"rating": 3.0, "review": "This fire stick is great my wife loves it I might have to buy another one so I can watch it on my tv.", "verified": true, "helpfulness": "0/1", "author": "thomas"}, {"rating": 5.0, "review": "Awesome! Just what I thought it would be and more. This is all I have I don't even pay for cable. You don't need it with this!", "verified": true, "helpfulness": "0/1", "author": "Heather McDowell"}, {"rating": 2.0, "review": "not as many titles as nf...does not support dolby digital (NO SURROUND SOUND)...unable to give it a thorough test though because my prime 2 day order back ordered my fire by 3 weeks.", "verified": true, "helpfulness": "0/3", "author": "sarah clausen"}, {"rating": 3.0, "review": "Need more free prime", "verified": true, "helpfulness": "1/2", "author": "Watch collector"}, {"rating": 5.0, "review": "The fire stick is great!  I first plugged it into my TV but  The only sound was through the TV. When I plugged it into my receiver with HDMI  plug it finally had all my surroundsound yeah!  I simply love it ! great value for the money and no wires", "verified": true, "helpfulness": "0/1", "author": "Debbie In CT"}, {"rating": 5.0, "review": "Thank you I love my new stick no more bleeping out at my videos that I watching", "verified": true, "helpfulness": "0/1", "author": "debbinwa"}, {"rating": 5.0, "review": "Love that I can take it with me anywhere in my house!", "verified": true, "helpfulness": "0/1", "author": "Kristina R Arbic"}, {"rating": 5.0, "review": "So easy to use, and great to take when you travel. Saves me from having to use my game console.", "verified": true, "helpfulness": "0/1", "author": "Jennifer Villanueva"}, {"rating": 5.0, "review": "This is a great interface. It has a ton of apps to choose from and it has all my amazon streaming needs met. I wish it had Youtube on it as well. I can't wait for HBO Now to be added too. I like this so much that i plan on having one added to my bedroom so i can be entertained as well!", "verified": true, "helpfulness": "0/1", "author": "Megan"}, {"rating": 5.0, "review": "Works exactly as I expected", "verified": true, "helpfulness": "0/1", "author": "Julie Brown"}]