[{"rating": 5.0, "review": "I have a Chromecast, apple tv, xbox one that I use for streaming purposes. I would rank the Fire TV Stick right up toward the 1st or 2nd. I prefer streaming from the Xbox One but this stick is great. Its nice and fast. Menus are nice.  Remote is nice and responsive. I have no complaints. I would be interested in trying the Fire TV if I happen to catch a deal on one. If the stick is this good the none stick would be amazing with the bump in specs!", "verified": true, "helpfulness": "0/0", "author": "Irod87"}, {"rating": 4.0, "review": "Very convient! But the disney jr app does not work", "verified": true, "helpfulness": "0/0", "author": "Laken Vargas"}, {"rating": 5.0, "review": "Love the ease of watching Prime!", "verified": true, "helpfulness": "0/0", "author": "harriet sadler"}, {"rating": 5.0, "review": "Love this product!", "verified": true, "helpfulness": "0/0", "author": "K S"}, {"rating": 5.0, "review": "I am completely satisfied with this creative invention, having the ability to serf the many different options from TV, sports, music and movies, etc.  I found it very easy to use as a plug and play also love the remote control which allows me to pause, search and switch easily from one program to another.  With Amazon Prime the list is unending!", "verified": true, "helpfulness": "0/0", "author": "jax"}, {"rating": 5.0, "review": "Very easy to use.I'm very happy...!!!", "verified": true, "helpfulness": "0/0", "author": "Katherine santiago"}, {"rating": 5.0, "review": "The Amazon Fire Stick found Me!  Always get the emails and advertisments that are catered to my buying, and this one got me.  Had never heard of the product.  Was somewhat dismayed  with Amazon prime because it was not compatible with Apple TV and was told I needed to purchase a ROKU player thru amazon in order to stream any movies thru my television.  I said \"Heck with that\".  Low and behold I wait a year and a half and Amazon comes out with The \"Fire Stick\".  Lucky enough for me I had a Best Buy gift card that I had to use up, but when I got to best buy and asked the tech what he thought about the Fire Stick.....He raved about it........I figured I had nothing to lose...I bought it.  To say that it was a snap to set it up is an understatement.  This thing Rocks!  Rocks I say!  Easy set up and start watching movies with full surround sound.  If you don't have one...Get it now!", "verified": true, "helpfulness": "0/0", "author": "joy"}, {"rating": 1.0, "review": "I'm sure it would be great if I had Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Christie"}, {"rating": 5.0, "review": "Works great.  Finally able to watch movies in s room that has poor wireless connection due to a brick exterior wall in our game room.  Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Ljport"}, {"rating": 5.0, "review": "Love it! So easy to set up😄", "verified": true, "helpfulness": "0/0", "author": "Patticake"}]