[{"rating": 5.0, "review": "I've been cable depended for quite a while but the Fire TV Stick has opened up a new world to me. I've used it for over a week now and I have no complaints. I'm finally ready to get rid of cable.", "verified": true, "helpfulness": "0/0", "author": "H. Gibbs"}, {"rating": 5.0, "review": "Cannot say enough good things about it. I am thinking of ordering a second one for another TV", "verified": true, "helpfulness": "0/0", "author": "Marlene Brannen \"Koontz\""}, {"rating": 5.0, "review": "More than met my expectations.  It is a terrific addition to my TV enjoyment.", "verified": true, "helpfulness": "0/0", "author": "Ralph J. Miele"}, {"rating": 4.0, "review": "As we learn more of the things it can do, I am sure we will up our rating.", "verified": true, "helpfulness": "0/0", "author": "Jim Shofner"}, {"rating": 5.0, "review": "I bought this as a present and my mother is very happy with the product.", "verified": true, "helpfulness": "0/0", "author": "Sylvia A Gualpa"}, {"rating": 4.0, "review": "It's a good product, However;  Installation difficult because it locked up when it did not have enough power from UBS.  I would install the power to the Firestick with a regular wall socket next time.", "verified": true, "helpfulness": "0/0", "author": "Scott Paterson"}, {"rating": 4.0, "review": "Forget about cable and save some money!", "verified": true, "helpfulness": "0/0", "author": "Froylan Dominguez"}, {"rating": 5.0, "review": "I have had two Roku devices up to now and just got the FireTV dongle. I would say the device is more convenient for me because it doesn't need a line-of-site from the remote to the device (better than my older Roku devices and I personally like the interface better. I'm buying another one!", "verified": true, "helpfulness": "0/0", "author": "JL"}, {"rating": 4.0, "review": "Good but works very slow with the iPhone", "verified": true, "helpfulness": "0/0", "author": "Trevor"}, {"rating": 5.0, "review": "Love it. Excellent addition to my living room.", "verified": true, "helpfulness": "0/0", "author": "Brandi"}]