[{"rating": 5.0, "review": "works great no problems getting it started", "verified": true, "helpfulness": "0/0", "author": "George Fisher"}, {"rating": 4.0, "review": "Works well, and the remote is a big improvement over the Chromecast, as is the length of the power cord.  Streaming Netflix is high quality, although I don't like the menu as much as Roku.  Only real complaint was the need to update the software wirelessly before using--took a long time on hotel internet.", "verified": true, "helpfulness": "0/0", "author": "C. Mucius"}, {"rating": 5.0, "review": "the best little device i never knew that i needed in my life. i purchased (pre-ordered) it on a whim, and from the minute it arrived i've been amazed at this little thing. its the best way to be fully emerged into the 'prime' experience. all your music, all your photos, all your movies, all your apps in one place on the tv screen. the interface is beautiful and the speed is impressive. i love this device. forget the cable and forget the dish!pros:netflixhuluprime videosprime cloudprime musicbeautiful interfaceside-loading app's for developersgamesairplayspeed!your digital world in one placeprice!cons:the app store is a little confusing and not too many apps worth playing but its getting there", "verified": true, "helpfulness": "1/1", "author": "demo"}, {"rating": 5.0, "review": "Amazon should consider getting standard KODI/XBMC software.", "verified": true, "helpfulness": "0/0", "author": "qwertyu"}, {"rating": 4.0, "review": "Worked right out of the box without any issues.  Only inconvenience is setting it up so that the remote will work when the device is hanging behind a TV that is mounted on a wall.", "verified": true, "helpfulness": "0/0", "author": "Looneypenguin \"Looneypenguin\""}, {"rating": 4.0, "review": "Easy to set up and works as advertized.  But after a few days of use I have noticed that is has lost connection to my wifi network and I have to re-enter the password again. Not sure if it is my issue or the Stick, but none of my other wifi devices, which is about 6 other devices, have had trouble staying connected. I really like it as long as this issue doesn't persist.", "verified": true, "helpfulness": "0/0", "author": "Dow Kennedy"}, {"rating": 5.0, "review": "Spot on!  Significantly more user friendly and reliable to the Dongle we used to have.  Easy to install, easy to use - loved the remote.", "verified": true, "helpfulness": "0/0", "author": "mike c."}, {"rating": 5.0, "review": "ordered by mistake but I don't regret it one bit.", "verified": true, "helpfulness": "0/0", "author": "STEVE J REYNA"}, {"rating": 4.0, "review": "Fantastic product for the $20 intro price. I just bought the Nexus Player when amazon revealed the Fire Stick for $20, well there was no reason to jump on it. They have done a fantastic job with it. The menu is very well put together. The remote app for android just works (Google you need to learn from them). For ppl who love customizing and tinkering with this device, it's very easy to side load apps into it. When I mean sideload I mean pushing apps like xbmc onto the device from your computer using adb over wifi. I am going to remove 1 star just because there is no way to access sideloaded apps from the home screen. You need to go all the way deep into their menu to access it.One thing I hope amazon would incorporate into their device is to add a universal search like Roku does.", "verified": true, "helpfulness": "0/0", "author": "D'Silva"}, {"rating": 5.0, "review": "Really great.  Quite a lot better than Chromecast", "verified": true, "helpfulness": "0/0", "author": "Luis N. Amaral"}]