[{"rating": 5.0, "review": "Easy to set up.  Easy to use.  Replaced a Chromecast with it so I no longer need to use my phone.  Very happy..", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Wedtwuk\""}, {"rating": 4.0, "review": "Super easy to use, and a lot faster than my Tivo. I'm a fan.", "verified": true, "helpfulness": "0/1", "author": "Kendra L Nichols"}, {"rating": 5.0, "review": "As good as the Amazon fire TV, the only issue with it is the need to power it via the TV USB or using the supplied power adapter. You might need to get a longer Mini USB cable if your TV is too high like mine is on a dresser.", "verified": true, "helpfulness": "0/0", "author": "scorpio1st"}, {"rating": 4.0, "review": "Received my Fire TV Stick today (a day earlier than anticipated) and so far, it's a great little device. The menus are not as clean as the Apple TV, but I like them much better than the Roku menu system. Set up was beyond easy - it took less than a minute. I really did not know what to expect, not having purchased any Amazon TV products before, but I was pleasantly surprised by the ease of installation and use. The menu system took me about 5 minutes to get used to, and the picture and sound are very nice. I wasn't expecting the plug, which is a little awkward, (something this small, just doesn't seem like it should have a plug) but nothing that I can't deal with. I've watched a couple of shows on this device and everything has run very smoothly and as expected. Overall, very happy with the purchase!", "verified": true, "helpfulness": "0/1", "author": "M. Wire"}, {"rating": 3.0, "review": "I had to call customer service because the stick would not update.  After trying all could for an hour I contacted them and after all he could do as well ordered a replacement.I tend to be hard headed and continued with all sorts of tricks until it finally updated.  Cancelled the replacement so Amazon wouldn't be out anything due to the stick FINALLY updating.", "verified": true, "helpfulness": "1/1", "author": "Allin"}, {"rating": 5.0, "review": "It works perfectly so far.  It responds quickly when you hit the buttons on the remote.  It seems to get good wifi signal and the only thing that I had to program in was the password for my router.  They set it up with my prime account before they sent it to me.  I am very happy with it.", "verified": true, "helpfulness": "0/1", "author": "Morgan"}, {"rating": 4.0, "review": "Fire stick exceeded expectations. I only wish that The Prime membership included more up to date movies and games.😄", "verified": true, "helpfulness": "1/2", "author": "Maya"}, {"rating": 4.0, "review": "Not a horrible product, however, it is not MHL compatible!  This is a big fail for a \"stick\"!  Roku stick is MHL which basically means the HDMI MHL port on the back of your TV or AVR powers the device so you don't need to run the power adapter.It is really designed (IMO) for Amazon Prime members.  Netflix is great quality, but I have noticed a little jitter every 30 seconds or so (not so with my other devices).Pandora works great! No problems there, however, I have noticed that when I press play on a title in Netflix, the last Pandora song that I had played begins. This resolves itself after a few tries of pause/play.Search function isn't very user friendly.  I would rather be able to find prime members content in a more intuitive way, however, I have heard that for Prime members this is as good as it gets as Roku isn't as great regarding this.If you change your router password it causes this stick to freeze up when trying to connect to a network.  I had to completely reset the stick to factory defaults to fix it.Overall, I would recommend this stick at the discounted price that I purchased it at.  If it costs the same as the Roku stick than I would definitely go with the Roku stick, not only because it is MHL certified but I like the user interface better.", "verified": true, "helpfulness": "0/1", "author": "jhughy"}, {"rating": 4.0, "review": "Accomplishes what it says it does. No problems using Netflix or Amazon Prime.Setup process is a bit drawn out, but fine. Not a huge fan of the remote because of how the directional button was designed. I also much prefer my kindle fire HDX for text entry.I subtracted the star because Twitch.tv app is practically useless. You could say that it's not Amazon's fault that app is bad, but they advertise the app on the product page. I expect anything they advertise to work well.", "verified": true, "helpfulness": "0/1", "author": "W. Wood"}, {"rating": 5.0, "review": "This product more than meets our expectations. It is quick and the remote is easy to use. WE are very, very pleased with our new Fire TV Stick!", "verified": true, "helpfulness": "0/1", "author": "rbmomof4"}]