[{"rating": 5.0, "review": "Easy to setup. Most media choices cost extra for non-Prime members, but the third-party apps are easy to access.", "verified": true, "helpfulness": "0/0", "author": "Pauline Pewther"}, {"rating": 4.0, "review": "Extremely simple installation and setup. I paid $20 for this (as an early promotional price) and at that price, it's an excellent device. I currently have an older version of Roku (which is functionally very similar to the Fire Stick but with longer buffer times) and a Boxee Box (which is functionally similar to the Fire Stick, has longer buffer times, and handles FAR more file types than the Fire Stick) that perform equally or better than the Fire Stick. Having to have an app to \"cast\" content is sort of a pain, too, especially considering you have to buy the app (with \"points\" that are already credited to your account, but still...). At any rate, load / buffer times are very short and the picture and sound quality are great.One of the biggest downsides, though, is the size of the Prime Instant library; it's very, very small. BUT, I can't hold that against the device, itself.", "verified": true, "helpfulness": "0/0", "author": "D. Marks"}, {"rating": 4.0, "review": "It's mostly great; the remote doesn't have to be pointed at the device (I can stay cozy under the blankets), I don't need a brand-spanking new tv, or a new BluRay/DVD player. It comes ready to connect to some great apps, including to Gaiam, which has some awesome yoga videos. My only problem is that I'm constantly having to reset the internet connection; nothing else experiences connection problems at the same time. Not my phone (we have Vonage), not my laptop, not my phone's WiFi.The upside is, I've memorized my network password now... If that can be considered an upside.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I received it early this morning and been or it all day. So far very happy with it!", "verified": true, "helpfulness": "0/0", "author": "Carmen Avalos"}, {"rating": 4.0, "review": "Needs HBO to go for 5, but for me, it's all that", "verified": true, "helpfulness": "0/0", "author": "L. STOKES \"va golfer\""}, {"rating": 4.0, "review": "The set up was fast, and we are very happy with the huge selection of movies and shows.", "verified": true, "helpfulness": "0/0", "author": "Cathy Ortiz"}, {"rating": 1.0, "review": "The first one I ordered would not connect to my network so amazon sent me another one. This would not connect automatically, I had to go into the advanced settings and change all the incorrect DNS settings, and finally it recognized my network. No customer should have to go through this nightmare!!!Upon getting it to connect, it starts an automatic download of the latest software....or at least it is supposed to. I tried no less than 20 times, and it crashed every time!!WARNING!!!! DO NOT BUY THE GARBAGE!!! THEY DO NOT HAVE THE BUGS WORKED OUT!!!", "verified": true, "helpfulness": "0/0", "author": "Jeff Waugh"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "ocala girl"}, {"rating": 3.0, "review": "Does the job, but don't buy it if you want games. All the good ones are not available on the stick. Even if you have a controller. You need Fire TV box for the good games. My kids have been disappointed.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Hunter"}, {"rating": 5.0, "review": "The Fire TV Stick exceeded my expectations!!!", "verified": true, "helpfulness": "0/0", "author": "Laurie Paxson"}]