[{"rating": 4.0, "review": "Not quite as fast as the mainline FireTV, but you wouldn't expect it to be.  Works great for what it is though, and is super portable.", "verified": true, "helpfulness": "0/0", "author": "Sharon Barber"}, {"rating": 1.0, "review": "this is the second one. you sent me. It sucks. I does not work. it is defective. You sent me a second one. It is also defective. p.s. thanks for outsourcing jobs", "verified": true, "helpfulness": "1/2", "author": "smith"}, {"rating": 5.0, "review": "works fine.  easily used. Gives PRIME members lots of movies and TV series to watch free.  Music, and much other things.  I like it.", "verified": true, "helpfulness": "0/0", "author": "Herbalist \"healthy driven\""}, {"rating": 5.0, "review": "Love the Amazon Fire Stick if you are deciding between the Chrome Cast and this, the Amazon Fire stick is the better buy. You are provided with a remote to control it and are able to use it from your cell phone. Great Purchase", "verified": true, "helpfulness": "0/0", "author": "Steph"}, {"rating": 5.0, "review": "Great Product! the remote is a little difficult to get the battery cover off but so far that is my only complaint. I love that I can change what tv it goes to and that I can set parental controls.", "verified": true, "helpfulness": "0/0", "author": "Anika"}, {"rating": 4.0, "review": "hesitates at times.", "verified": true, "helpfulness": "0/0", "author": "G. Wolf \"like in big bad\""}, {"rating": 2.0, "review": "Sorry Amazon, I really wanted this to be as good as Apple TV, especially with the lower price, but it has been unreliable with connection issues like cutting out during programs. It also does not have the amount of apps I would like to see.  At this point, I would not recommend it. Please keep working on it.  I love Amazon.", "verified": true, "helpfulness": "0/0", "author": "P. Sierra/Phoenix"}, {"rating": 4.0, "review": "if only it can work in Asia, nontheless its a very great product, and im beginning to be a fan of Amazon.Amazon, please come out with more and more devices in the coming future.", "verified": true, "helpfulness": "0/0", "author": "Kelvin Chew"}, {"rating": 5.0, "review": "Add KODI to this and it will be the \"Go To\" travel device.  I take mine everywhere and use it daily.  HIGHLY recommend!!", "verified": true, "helpfulness": "0/0", "author": "TechsMex"}, {"rating": 1.0, "review": "Got this stick recently and up to this day I can't watch five minutes of a TV show or movie. The connection to the WiFi sucks so bad.", "verified": true, "helpfulness": "0/0", "author": "A&V"}]