[{"rating": 3.0, "review": "When using the Fire TV Stick it will stop randomly and I have to get up and unplug the device to reboot it.  When it works it works great.", "verified": true, "helpfulness": "0/0", "author": "charles gillin"}, {"rating": 5.0, "review": "It is working out great.", "verified": true, "helpfulness": "0/0", "author": "Glenda Jarrett"}, {"rating": 5.0, "review": "Works great, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Shannon Allen"}, {"rating": 5.0, "review": "We really like this product!", "verified": true, "helpfulness": "0/0", "author": "Cheryl"}, {"rating": 4.0, "review": "Inexpensive way to convert TV to Smart TV.  Super easy to install!", "verified": true, "helpfulness": "0/0", "author": "Stephen Pappaterra"}, {"rating": 3.0, "review": "Almost all TVs are \"smart\" these days. Unfortunately, this means the Fire TV Stick is a redundant device in our house.On the plus side, the remote feels nice. I wish the interface was more intuitive, and that I could get the thing to work with my AV receiver. It's hard to imagine this replacing any of the array of smart devices plugged, strapped and glued into the credenza that we call an entertainment center. For now, I'll stick to my Frankensteined home theatre setup.", "verified": true, "helpfulness": "0/0", "author": "Zachry Frazee"}, {"rating": 3.0, "review": "I love the ability to watch my Prime shows, but it requires a fast bandwidth.  Ours is pretty basic, so we just use our AppleTV for everything but Prime videos.", "verified": true, "helpfulness": "0/0", "author": "Robin M."}, {"rating": 4.0, "review": "Works well but too many additional costs for watching!", "verified": true, "helpfulness": "0/0", "author": "Jacqueline E. La Place"}, {"rating": 5.0, "review": "SO much better than Chromecast. It is amazing and I have recommended it to many of my friends and brothers and sisters. They are now looking into getting their own. I recommend this to everyone interested in alternative viewing of their favorite shows and movies.", "verified": true, "helpfulness": "0/0", "author": "Stephen V Sellner"}, {"rating": 2.0, "review": "Always drops the wifi - will check the signal says signal is \"very good\" then try and use it and it won't work, but I guess that is what you get for the price.", "verified": true, "helpfulness": "0/0", "author": "Tessa"}]