[{"rating": 5.0, "review": "I got the fire tv stick during the limited $19.99 promotion and it was a great decision! I cancelled my cable service a few months ago and switched entirely to my roku 2. It ran smoothly but the picture quality was always poor. Didn't think the fire tv stick would be much different but I was entirely wrong! First, the setup and interface is awesome and way better than the Roku. Amazon prime and Netflix stream in HD and the quality is superior. Also, the stick saves counter space and has less wires- a plus. Second, you can stream Dpotify from your devices with the Spotify app, so no need to go into the tv app version to play a song (like Roku). Also, for$2.99 I got the AirPlay app and you can AirPlay everything just like the Apple TV!! I love this device- works great and it is a million miles away from Roku. Love.", "verified": true, "helpfulness": "0/0", "author": "Ivet Taneva"}, {"rating": 4.0, "review": "The Fire Stick is a great device. The steaming quality is fantastic and integration with amazon video/music is great.If you regularly steam video online using amazon video, then this the device for you! The one major problem I have with this device is that there is no way to control the volume from either the app or the remote. There is also no integration with Google movies/music but that should be expected as the Chromecast does not have amazon video/music either.Pros:-Good streaming quality-Amazon app integration-Amazon prime video/music-Netflix-Remote-Easy to useCons:-No Google movies/music-No volume control-Requires Amazon Prime membership to be goodOverall: I prefer it to Chromecast as the controller is very easy to use and more convenient than my phone but the lack of volume control is a real bother as I must use the TV remote to change it since music/movies have different base volumes which is really annoying. The voice search via the phone app is great but I don't use it often. Lots of potential.", "verified": true, "helpfulness": "1/1", "author": "Peter M"}, {"rating": 4.0, "review": "Good but very few free movies!!The fire stick is great but I was so disappointed at how few movies were free. I actually watch net flex more and so the fire stick isn't really used.", "verified": true, "helpfulness": "0/0", "author": "Janet Trout"}, {"rating": 4.0, "review": "The Fire TV Stick compares favorably to the Roku I have used for years, and I like its capabilities. It has a somewhat different set of \"extra\" content providers than Roku does, as other reviewers have notged, but most of us are just here for Amazon Prime videos, Netflix, Hulu Plus, and other major content providers.However, my unit has a quirk: every two minutes -- while I am watching TV with the stick plugged in and powered up -- it interrupts the TV signal just for a second.This signal interruption happens every two minutes (timed by a stopwatch) and is replicable . I powered it off and back on, but that did not help it.  And it happens whether or not the stick is in \"sleep\" mode.I've searched the other reviews, but no one else seems to have reported this issue.I could live with this, but I'll contact Amazon regarding a replacement. I simply wanted to get this issue out there in case others have experienced it.UPDATE: I originally wrote this as a 'power interruption', but that was incorrect.", "verified": true, "helpfulness": "0/0", "author": "Paul Havemann \"umbrage at ambage\""}, {"rating": 5.0, "review": "I just got it today, with my 3Ghz DSL it comes in great. I upgraded to HD, & it's definitely worth it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "did not like it at all, found a free movie on Netflix picked it next thing I know amazon has charged my prime account $4.99, it is a money making tool for amazon", "verified": false, "helpfulness": "1/4", "author": "ronny windsor"}, {"rating": 5.0, "review": "This works rad well.  Easy to navigate and smart search functions.  Maybe a step above took but need to see how new apps are riled out", "verified": true, "helpfulness": "0/0", "author": "Huskernut"}, {"rating": 3.0, "review": "This was an \"Out of the blue\" gift so I had no expectations...it has been fun though and if the Prime service can be billed monthly I may continue that", "verified": true, "helpfulness": "0/0", "author": "Dobridge Jones \"earthtojohn\""}, {"rating": 5.0, "review": "Love this! Easy to operate!", "verified": true, "helpfulness": "0/0", "author": "Zechiel"}, {"rating": 4.0, "review": "Absolutely love it. It almost knocks out the need for expensive satellite.Pros it streams all kinds of media. From amazon prime- hulu, netflex ect ver wellConnects to apple products easily with adv apps.ConsWish it had more apps adv like showbox for free tv.Limited to app adv. however I have noticed they keep coming out with more all the time.", "verified": true, "helpfulness": "0/0", "author": "lkjghjgkjhg"}]