[{"rating": 5.0, "review": "Got 2 when they were on sale for $19.  Great buy!  Used one to replace a bedroom roku that started buffering all the time.  No buffering issue at all with the Fire Stick.  The menus are better too on Netflix and Prime.  No problems at all so far but will update if any issues arise.  I also have a chromecast dongle and is great for casting from my computer to the tv but the Fire Stick has it beat if you are going to use it mainly for watching movies etc because of the remote it comes with.", "verified": true, "helpfulness": "0/0", "author": "fatcatdeals \"fatcatdeals\""}, {"rating": 3.0, "review": "I'm giving this stick 3 stars why because its not really wireless it really needs to be plug in to really work well other then that its pretty fast it out beats roku and Chromecast 100%", "verified": false, "helpfulness": "0/1", "author": "noah"}, {"rating": 4.0, "review": "I thought I would give this a try. At the pre-order price of $19 I figured I couldn't go wrong.  I always take my Kindle Fire and a HDMI cable when I go to a hotel, so that I can watch my selections from Prime, Netflix, PBS etc. instead of the junk that is on regular TV.  I have an older Kindle Fire that doesn't \"fling\", so I have to be tethered to the TV with a cable.  I thought the Fire TV Stick would allow me to leave the HDMI cable at home.  What isn't clear in the pictures or the description is that the Fire TV Stick has to be powered from an electric outlet.  Not every hotel room has an electrical outlet (that you can reach) close enough to the TV to allow the Stick to be plugged in.  So, I would not be saving any room in my suitcase because I would have to bring along an extension cord in case I need it.  No worries,  the way I do it now works for me.I have been using ROKU at home for years, ever since it came out and it works fine.  I have been using the Fire TV Stick at home since I received it and I really like the interface, once I got used to finding my way around.  The Fire Stick has some things that ROKU doesn't, like some interesting apps, games and the ability to view my own photos that are stored on Amazon cloud.  You can even use your photos as a slide show and/or screen saver.  You also have access to any of your music that is stored on Amazon cloud.ROKU has a ton of channels, but face it, most of them aren't anything that you want to watch.  The Fire TV Stick comes from Amazon, so it is geared towards Amazon content.  Other \"channels\" are apps that you have to add, but it is easy to add them.  Just make sure you have all your username/passwords handy when you go through set-up.Since I was one who got in on the pre-order special, I am sure that all of the early released sticks were beta versions because mine had to update software for about 20 minutes when I plugged it in.  It has worked fine since then.I think that if I was new to streaming video, I would get the Fire TV Stick over ROKU.  I have not tried Fire TV, so I can't compare it.  At $39 the Fire TV Stick is a great way to stream for very little money.", "verified": true, "helpfulness": "0/0", "author": "Buzzard"}, {"rating": 3.0, "review": "Overall works decent, additional power source is somewhat annoying and wifi antenna feels lacking.I purchased it for the promotional $19.99 so overall I'm happy but if you're looking to purchase this at the price point of 39.99 don't.Spend the extra money and get the full size Fire TV box minimum or look at other products.Also just a side note, I have the full size Fire TV box as well and it works flawlessly, no regrets there.", "verified": true, "helpfulness": "1/1", "author": "Matt Moore"}, {"rating": 1.0, "review": "Very disappointed.  I was excited about this product and looking forward to using Amazon for more of my future digital purchasing due to its availability across more platforms.  Now I'm not sure.  I have to unplug power supply every two days to get it to log back into my network.  After it repeatedly says my wifi password is invalid. By the way it was not. Freezes often as well.  Was very excited about this product but now it makes my Apple TV and original roku look amazing.", "verified": true, "helpfulness": "1/3", "author": "bakerj"}, {"rating": 5.0, "review": "It made my tv a smart tv. It was cheaper than buying a new tv. I love it!!", "verified": true, "helpfulness": "0/0", "author": "Great Game!!"}, {"rating": 4.0, "review": "don't like wire for power.  wish better way...plan on removing mounted flat screens to run through wall.  on the flip side... provided cable fairly long and also includes HDMI dongle for awkward/tight TV placements", "verified": true, "helpfulness": "1/2", "author": "Amazon Veteran"}, {"rating": 3.0, "review": "I love the interface, however I am noticing that the remote some time looses signal as if it is being blocked by the tv. not sure of this is a problem with other people or if i need to return it", "verified": true, "helpfulness": "0/0", "author": "JIb"}, {"rating": 5.0, "review": "Got it for $19 as an early Prime member, and at that price you can't beat the value.  Remote, clear menus, fairly smooth and fast performance, and nearly unlimited possibilities with its open Android interface, an app that allows your phone to double as a remote, the ability to sideload non-app store apps, and compatibility with any HDMI enabled device.The only cons at the moment is that it is somewhat buggy (for a new device, that is not at all unexpected).  Have had a few crashes and app hangs.  Also, at $39 it is a bit more expensive than the Chromecast, even though it is adding more functionality.", "verified": true, "helpfulness": "0/1", "author": "D. Dutta"}, {"rating": 3.0, "review": "Laggy and buffers a lot. You definitely get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "Gavin D"}]