[{"rating": 4.0, "review": "The Fire Stick is a slick little device and worked great once the software update was complete.  But like other people who complained online, I had problems getting it to update it's software the first several times I tried to set it up.  It would stop updating about 75% of the way through the process.  I did an online search and one user mentioned installing the Fire Stick in HDMI1.  I tried that and it finished the update quickly.  I don't know why that solved the problem but it did.  Other than that, I have been happy with the performance and I really like the remote that comes with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Very easy to hook up. Amazon cloud drive works well. Unlike some reviews said it can be organized now.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Great picture easy to use.", "verified": true, "helpfulness": "0/1", "author": "Josh"}, {"rating": 5.0, "review": "Pleasantly surprised!! I have had a chromecast for nearly a year now and it has survey its purpose but this is so much cleaner. The menu system is really user friendly the remote is actually very useful. The only complaint I have is the need for the usb to be connected to a power outlet and not just the USB connection on my TV. I enjoy the apps that are available I would recommend this item to anyone.", "verified": true, "helpfulness": "0/0", "author": "Marcelle Budnick"}, {"rating": 5.0, "review": "I might order another one... I love it", "verified": true, "helpfulness": "0/0", "author": "elizabeth huerta"}, {"rating": 5.0, "review": "Love it!!!", "verified": false, "helpfulness": "0/1", "author": "Maurice Lightner"}, {"rating": 5.0, "review": "So cool!  We now have way too many options to watch things off prime, but great that the kids can now sit on the big comfy sofa rather than gather around the iPad or computer screen.", "verified": true, "helpfulness": "0/0", "author": "MCJmom"}, {"rating": 5.0, "review": "Had a small issue with it not licensing movies. The phone support was top notch!Works well well!", "verified": true, "helpfulness": "0/0", "author": "Alan Lamb"}, {"rating": 4.0, "review": "I used to own chromecast but sold it because I can only cast non-amazon content.  FireTV stick is essentially a stick version of FireTV or Kindle tablets.  I can watch amazon prime instant video and amazon mp3 as prime member which I could not do with crhomecast.  I seriously doubt whether it can play game because you need to install the game on stick that only has few gb space.  I wish amazon could've improve in following areas.1. I plug firetv stick into one of the 6 HDMI on my receiver.  Because the usb cable is on the side, it blocks the neighboring hdmi.2. youtube quality is not as good as chromecast.3. I wish kindle ebook reader be added in the future.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "does not connect", "verified": true, "helpfulness": "3/4", "author": "Jeff Underhill"}]