[{"rating": 3.0, "review": "My Flat screen is mounted on the wall.  The cord is not long enough to make the device stick out in the open to reach my WiFi.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I didn't do the actual set up but was told it was very simple.  I have used for a week now and find the remote and menu very user friendly and easy to navigate.Very glad I made the purchase and highly recommend to maximize benefits of Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "SoCal"}, {"rating": 5.0, "review": "Not thrilled I had to renew my Netflix to get Breaking Bad for \"free\" but some things are worth paying for!  VERY happy!! Like that I can take advantage of all Prime has to offer.  Well rounded offering.", "verified": true, "helpfulness": "0/0", "author": "Nannette"}, {"rating": 3.0, "review": "Great product but unfortunately, it is not supported by Dish Network so I had to return it…bummer!!!", "verified": true, "helpfulness": "0/0", "author": "Gran14"}, {"rating": 5.0, "review": "Great interface! Very easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love this gizmo.  Better than Roku or the Google version.  Has all the apps you need and works flawlessly.  Interface is very easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Matt F"}, {"rating": 5.0, "review": "Very easy to install and was ready to go with all of my information.", "verified": true, "helpfulness": "0/0", "author": "Megan P Dyer"}, {"rating": 5.0, "review": "I was amazed how easy it was to set this up.  As simple as plugging the usb into the TV and the power cord into the usb.  That was it!  I turned on the TV and before I knew it I was selecting a show from Amazon Prime with the tiny remote that came with it and watching.  I don't even think it took a full minute between taking it out of the box and sitting down to a great show.", "verified": true, "helpfulness": "0/0", "author": "C. Cook"}, {"rating": 5.0, "review": "Great product.  Installed this on my kid's TV and she loves it.  No loss in picture or sound and the quality of both is really good.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "I love the fire stick.  The remote is handy and being able to run plex and Netflix without changing source on tv is convenient for my last days in bed", "verified": true, "helpfulness": "0/0", "author": "colin"}]