[{"rating": 5.0, "review": "Better than the rest, and I tried the rest out of need not choice.  I'd purchase this item again and would recommend to friends.", "verified": true, "helpfulness": "0/0", "author": "Mike Miller"}, {"rating": 1.0, "review": "Very disappointed", "verified": true, "helpfulness": "0/0", "author": "C. Turula"}, {"rating": 5.0, "review": "The perfct answer to my TV problem. Changed wifi providers and coukdnt get programming. Fire stick was the most economical choice and it works perfectly!!", "verified": true, "helpfulness": "0/0", "author": "P. Wolf"}, {"rating": 4.0, "review": "Love it and intend to get another one for my 2nd tv", "verified": true, "helpfulness": "0/0", "author": "L"}, {"rating": 3.0, "review": "It is easy to use, but didn't really add much beyond what my DVD player already offered.", "verified": true, "helpfulness": "0/0", "author": "Dana Barbarick"}, {"rating": 5.0, "review": "Got this free with Sling TV..Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Amazonian21"}, {"rating": 5.0, "review": "Excellent device.  Very compact and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Arthur J. Duquette"}, {"rating": 4.0, "review": "I haven't used it that much yet but I have enjoyed the programming.", "verified": true, "helpfulness": "0/0", "author": "jjoplin"}, {"rating": 1.0, "review": "what a waste of my time and money. bought this and when we finally got it and hooked up, it CONSTANTLY goes black. not like it's buffering because if your watching something it's doesn't pause when it cuts out it just keeps playing. we contacted amazon and they sent us another and that one did the same. tried everything we could on every TV and nothing different. we have very few issues with our Wi-Fi and none of our other devices do anything like that. their excuse with the first was it was \"defective\". should've spent the extra $20 for a roku. needless to say, I'm pretty disappointed amazon would put their name on such junk", "verified": true, "helpfulness": "0/0", "author": "Taylor"}, {"rating": 5.0, "review": "Awesome. Love it.", "verified": true, "helpfulness": "0/0", "author": "Chad Eckert"}]