[{"rating": 2.0, "review": "I purchased this device on black friday; and, for a while, was enjoying it. I'll bullet point my feelings belowPros- hides behind the tv, using the USB as a power source- has netflix/hulu/pandoraCons- i have fast cable internet, and excellent wifi; however, the home screen takes forever to load- i have to regularly log in to netflix. while this isn't terrible, it's time consuming and annoying with the remote- the apps are very lacking. i want hockey streams and several other offerings that this device simply doesnt have..i mean, they seriously just added HBO GO- i frequently have to restart the device because it stops reading the remte control commands- scrolling through the home menu is laggy and choppy at times- amazon prime offers nothing really that netflix and hulu arent already offering.all in all, it works. If you just want netflix and the basic streaming services on a tv, then go for it. i got it because i really like amazon, the price is on point, and it boosts some good tech stats compared to competitors...but once you get over the \"oh yay, i have a streaming stick!\" phase, you enter the \"ok, what about all the cool stuff out there other than netflix?\" stage...and it gets boring", "verified": true, "helpfulness": "0/0", "author": "Jp"}, {"rating": 2.0, "review": "The two stars are specifically for the excellent Amazon customer service I received.  I was very excited to receive this fire stick but sadly was unable to install it on my TV.  Things were moving along fine - remote ready, fire stick ready - installation program comes up on my TV screen and asks me to hit play to move on.  What appears is a grey screen simply saying \"connect to the internet\" but gives me no options to do so.  Can't go forward, can't go back.  So after a lengthy chat with Amazon customer service and all the turning on and turning off and unplugging and resetting (we all know THAT drill) it was concluded my fire stick was defective and was returned and replaced. The second fire stick produced the same results, so I had to return it.  Either Amazon was incorrect in their assumption that the device was faulty and there was in fact a problem on my end, or the quality of these is very poor.", "verified": true, "helpfulness": "0/0", "author": "Peggy"}, {"rating": 3.0, "review": "The fire stick is great when it works. We have had issues with stalling while loading and unavailable episodes, multiple times", "verified": true, "helpfulness": "1/1", "author": "Nicole Bledsoe"}, {"rating": 1.0, "review": "We expected more movies that would have been MUCH newer under the prime category.....  as far as the other movies go the prices are too high for prime members. There should have been some kind of discount even if it was JUST a $1.00......i feel amazon can afford more than a dollar........ so, change the deals  and get rid of those OLD movies.", "verified": true, "helpfulness": "0/2", "author": "Nancy Marsh"}, {"rating": 5.0, "review": "I love my fire stick. Gives me many options.", "verified": true, "helpfulness": "0/0", "author": "tawnia noel monroe"}, {"rating": 5.0, "review": "Received my fire stick for Christmas and let's just say by far it has been the best gift ever.  I really enjoy catching up on some few older HBO and showtime series, like that I can purchase movies rather than go out and rent, and enjoy all the free movies as well.  Since I did not do netlike or even possess cable this stick is great for me since it connects with my wi-fi making it easy fro me to keep my bills down when I travel a lot.  I recommend  the fire stick to anyone plus its so easy to install trust me anyone can set it up and it takes all of 30 seconds.", "verified": true, "helpfulness": "0/0", "author": "vadim69"}, {"rating": 5.0, "review": "I do love the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Huge disappointment. I feel like I paid $40 to watch YouTube on my TV, I expected much more than what it offers. And, it is clearly android ready, but NOT Apple ready.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I like it so far. Hopefully I will be able to drop some of my cable items.", "verified": true, "helpfulness": "0/0", "author": "Sandra Conway"}, {"rating": 5.0, "review": "worked right away, I like that. just plug it in and use it.", "verified": true, "helpfulness": "0/0", "author": "ann pragar"}]