[{"rating": 5.0, "review": "Works great and fairly easy to setup.  If you have a issue - use the built in HELP - and they will call you direct.", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "You will need to plug in the 'stick' part if you want the best performance. The wire is a bit short so you will need to be close to an outlet.Other than that, the remote is very smooth and simple to use. Both the stick and remote are very lightweight and small, making it easy to carry with you for travel or simply move it to different rooms. Since it is a bit small, it can be easy to lose so keep it in a safe place. The actual program interface is very clean and favors Prime's material (obviously). If you want to use Netflix, you will need to access it as an 'app' along with Hulu Plus, etc.If you buy it for a friend, it will come logged in with your account, but this is easy to change. Still learning it, but overall I would definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Delphi"}, {"rating": 5.0, "review": "Easy to setup,  easy to use. Best way to make your dumb tv a smart tv", "verified": true, "helpfulness": "0/0", "author": "Dracon59"}, {"rating": 5.0, "review": "In terms of its interface, speed and responsiveness, the Fire TV Stick is a remarkable step up from the previous-generation Roku XD I've been using on my primary HDTV. I hope it proves to be more stable than the occasionally flaky XD. My next step will be to relegate the XD to my smaller, secondary screen and move the Stick to the big room. Set up was quick and simple, especially with preinstalled account info.", "verified": true, "helpfulness": "0/0", "author": "Ross V"}, {"rating": 2.0, "review": "i was hpoing for a better choice in the free movies.", "verified": true, "helpfulness": "0/0", "author": "risa lehrer"}, {"rating": 4.0, "review": "Great concept but it would be nice if it didnt  also have to be plugged into a wall outlet.  I also wish that it had more recommendations as to what apps or whatnot to download so I could use it to its full potential instead of just blindly searching.  It is great to stream movies from Netflix which is really all I have been able to do so far.", "verified": true, "helpfulness": "0/0", "author": "JMC"}, {"rating": 5.0, "review": "Fire TV Stick totally exceeded my expectations. I have had it for about a month and have had no issues with streaming. I can't speak for the long term yet though, so this review is strictly first impressions. It is incredibly simple to set up, and the user interface is intuitive. I bought it to get access to Amazon Prime Instant Video and Netflix from our bedroom. It did that and gave me access to games that my kids like also. I have a 2011 Samsung Smart TV in another room and although it has Netflix the user interface isn't as nice and it does not have Amazon Prime Instant Video. I was shocked at how good this was for the price. Nice Work Amazon!", "verified": true, "helpfulness": "0/0", "author": "PB"}, {"rating": 5.0, "review": "Works great...super fast! Definitely worth the $39.95 that I paid for it!", "verified": true, "helpfulness": "0/0", "author": "Hoosier1470"}, {"rating": 5.0, "review": "Was very pleased", "verified": true, "helpfulness": "0/0", "author": "James P. Utley, Jr. \"Jim at Myrtle Beach\""}, {"rating": 4.0, "review": "Far more functionality than the Chromecast for only a couple dollars more", "verified": true, "helpfulness": "0/0", "author": "Joe Mainwaring"}]