[{"rating": 4.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Monique"}, {"rating": 1.0, "review": "This is a useless device that I wouldn't pay a dime for, I got it as a gift and tried it out. This is to get you to pay for more content, most of the shows are overpriced and Prime choice of entertainment sucks big time. Wherever you click it wants you to pay for something, seriously, DirectTV or DishNet with HBO and SHO will cost you much less than this. It's yet another try at STB by a big corporation for sheeple to keep lining the shareholders pockets.", "verified": true, "helpfulness": "0/1", "author": "Tom Derylo"}, {"rating": 5.0, "review": "Awesome...incredibly easy to set up...priced right!!!", "verified": true, "helpfulness": "0/0", "author": "Kevin Schultz"}, {"rating": 1.0, "review": "Drops connection all the time.  I will be returning if Amazon doesn't come up with a quick fix.", "verified": true, "helpfulness": "1/1", "author": "JayZ13"}, {"rating": 5.0, "review": "The Fire TV Stick in a single word is AWESOME !!!!I received this last week and the installation was extremely easy.  Hook it up and within less than 5 minutes you are streaming.  It came programmed with my Amazon Prime account already installed and takes you through the setup. Awesome,  There is NO BUFFERING when watching movies, tv shows like I have had with my wireless blue ray player. It also allows you to go directly to the next episode of any tv series your watching without going back to the main menu which is a great feature.  I downloaded the app to my phone which make the remote obsolete and allows you to use voice search from your phone which is the coolest thing.  I have not come across ANYTHING that I don't like yet about the Fire TV Stick, but if I do I will update my review.", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 3.0, "review": "It appears to work okay but it won't access my amazon prime account and will only give me the30 free days.  So what did I spend my 99$ for?", "verified": true, "helpfulness": "0/0", "author": "beth fleming"}, {"rating": 3.0, "review": "Since the instructions that came with the product were not very good, I had to buy another book to tell me why it wasn't working. I don't own a device that supports the Kindle app, so I had to spend an extra $10 for the paperback book. There was one very simple thing I had to do to make it work. It seems to me this could have been included in the enclosed instructions. I'm still learning how to navigate everything, but so far it's doing what I wanted it to do.", "verified": true, "helpfulness": "0/1", "author": "April Brown"}, {"rating": 5.0, "review": "Works as advertised-satisfied.", "verified": true, "helpfulness": "0/0", "author": "p"}, {"rating": 5.0, "review": "simple to use.", "verified": true, "helpfulness": "0/0", "author": "Carice K. Nolan"}, {"rating": 5.0, "review": "Was watching Netflix on my Ipad...and now the whole family can enjoy movies, TV shows, and more on our living room screen. Binge watching Sons of Anarchy as I type this.", "verified": true, "helpfulness": "0/0", "author": "Mark Karwoski"}]