[{"rating": 1.0, "review": "I didn't realize that in addition to plugging in the stick to the TV, that you also need to connect to a power outlet which makes it more difficult to use easily.", "verified": true, "helpfulness": "0/1", "author": "Laura Valan"}, {"rating": 1.0, "review": "A few months ago, I wrote a rave review and gave the product four stars.  That review is still here, below the divider.More recently, though, I've experienced the same problem many others are reporting: that the stick seems to get \"hung in left rudder,\" leaving me staring at a twirling circle instead of a TV show.  Today has been the worst ever: the thing has hung up several times, enough to make it unusable.  Twice, I've done the trick recommended by Amazon: Unplug the Fire Stick, unplug its power cable, then plug them back in again.  No help.I'm also getting \"lost network connection\" messages -- five or six in the last hour.  Yet my computers  connected to my Comcast cable are working fine, and the Xfinity speed tests shows speeds faster than advertised.What's more, the picture on my second TV, a new Vizio with built-in WiFi, is working perfectly.The Fire Stick runs a little hot, even though it's physically located just below an AC duct.  My theory is, it's slowly degrading with time.  At this point, it's basically a lightweight boat anchor.-------------------------------This thing has changed our lives.  My productivity has gone down dramatically, but the smile on my face continues to grow.With both Fire TV Stick and Amazon Prime, we can and have watched old (and new) movies and TV series that we would never have seen otherwise.Only one problem:  We find it difficult to find the shows or movies we might like.  The Search engine is virtually worthless.  It's not a \"Smart Search\" like DirecTV offers.  If you don't know the name of the movie, you will not find it.Amazon claims there are some 60,000 movies available.  Note to Amazon:  Give us an on-line browser/locator we can use to find the other 59,970.", "verified": true, "helpfulness": "0/0", "author": "Jack W. Crenshaw \"bird lover\""}, {"rating": 5.0, "review": "amazing, very good", "verified": true, "helpfulness": "0/0", "author": "Benedetto Catania"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "thien tran"}, {"rating": 2.0, "review": "After two weeks the remote has totally stopped working. I press buttons but nothing happens. Returning it to the store tomorrow. It was nice for the first two weeks before this happened.", "verified": true, "helpfulness": "0/0", "author": "Desert Rat"}, {"rating": 4.0, "review": "pretty easy to work", "verified": true, "helpfulness": "0/0", "author": "patricia keshmiri"}, {"rating": 5.0, "review": "Opens a whole new world. Really glad I got it", "verified": true, "helpfulness": "0/0", "author": "Kwame Rogers"}, {"rating": 3.0, "review": "First of all, I don't have one.What I want to do is talk about why the Apple TV is a better value, and for one reason:It doesn't have 0 games, it has tens of thousands, if you own an iPod or iPad. See, the Apple TV let's you play your phone/tablet games on the big screen, which can be pretty awesome.Otherwise, the Fire TV stick is a good option, to be sure.", "verified": false, "helpfulness": "0/1", "author": "Holden Lowe"}, {"rating": 5.0, "review": "I love it!  It's so much simpler than having to drag out the long HDMI cord, my laptop, and a table to set the laptop on.", "verified": true, "helpfulness": "0/0", "author": "Mary A. Winings"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "LaQuita V. Patterson"}]