[{"rating": 4.0, "review": "Faster than our ROKU players.", "verified": true, "helpfulness": "0/1", "author": "niapriv"}, {"rating": 1.0, "review": "I hate this thing.  It constantly drops our wifi connection.  Telling me to rearrange my house so the fire stick can be next to the router seems a little ridiculous to me.  Perhaps a software fix is needed.  Yes, when it is connected it says \"excellent connection\" so the router is not the problem.  Beware this thing still has a lot of issues.  Hopefully the 2nd generation will not have this issue.", "verified": true, "helpfulness": "3/6", "author": "steven t smith"}, {"rating": 5.0, "review": "Great Product !!! Far Far better than Chromecast in terms of Streaming content", "verified": true, "helpfulness": "1/1", "author": "Hareesh"}, {"rating": 1.0, "review": "can't get it for 2 weeks after Christmas.. The price is right..jury still out on performance.", "verified": true, "helpfulness": "1/7", "author": "David Goodale"}, {"rating": 5.0, "review": "Technology is amazing, and the stick is simply a beautiful thing!", "verified": true, "helpfulness": "1/1", "author": "DRSACM"}, {"rating": 2.0, "review": "**UPDATE 4/2015**So my feelings about this device has changed quite a bit, rating has changed from 5 star to 2 star. Wifi on this device is absolutely horrid.5 Ghz is spotty and 2.4 Ghz isn't much better. I switched out my router thinking that was the problem but all of my other wireless devices perform as expected. A quick google search will back up my claims about the poor performing wifi on this device. The remote seems to \"skip\" through selections while navigating items in the menu. I thought it was a problem with Netflix, but it does the same thing under the Fire stick menu, HBO GO, etc. push right on the navigation rocker once, sometimes it will jumps ahead 5-6 selections. If it only did this every once in awhile it would n't that big of a deal, but it does it all the time. Take my advice and either spend more on the Fire Tv or go with a Roku, Apple TV or similar media box. This stick is junk. I REALLY wanted to like this thing. Waste of time and money.Amazon is on to something with their media streaming devices. The interface is fast and well laid out. Remote is well constructed, buttons are clicky and works very well. I've sideloaded XBMC on the the stick and WOW, it works very, very well, even better than my Apple TV which I was hoping the stick would replace and will completely as soon as Amazon allows HBOGo. You can spend $100 on another device and probably wont get the same experience as this tiny device. This runs so well that I wonder what the Fire TV runs like when that has so much more power! For $39 you CAN'T beat this, best bet for your home theater needs! Just get it!", "verified": true, "helpfulness": "2/3", "author": "Jon Diaz"}, {"rating": 3.0, "review": "It is an okay device.  Not great.  Playback will freeze, then quickly catch up skipping parts.  Remote jumps 2 or more spaces when browsing.  Pretty much does what an Apple TV will at half the price.", "verified": true, "helpfulness": "0/2", "author": "Dan"}, {"rating": 4.0, "review": "Works great.  I would have given five stars but for some reason the Showtime Anyware app does not give DirecTV as an option to sign in when it does on my phone.", "verified": true, "helpfulness": "0/1", "author": "Jared"}, {"rating": 2.0, "review": "Although it streams non-Amazon content in addition to Amazon content, the Amazon content is to \"in-your-face\" for my taste.  I'm sure it's great for someone who's up to their neck in the Amazon ecosystem, but that's not me.", "verified": false, "helpfulness": "3/3", "author": "M. Quinlan"}, {"rating": 4.0, "review": "Much better than CromeCast.  However, the 1st unit I received was defective...Makes one wonder if there is sufficient quality control during assembly", "verified": true, "helpfulness": "1/2", "author": "GT \"GT\""}]