[{"rating": 5.0, "review": "I'm so loving it better than expected", "verified": true, "helpfulness": "0/0", "author": "sharon"}, {"rating": 5.0, "review": "Fire Stick was so easy to setup.  The app worked on the first try.  I almost like it better than Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Ant"}, {"rating": 5.0, "review": "Easy to set up on TV with a great remote. I just set it up today and have not seen any TV with it yet, but I will start using it tonight. The battery compartment was a little difficult to open to insert the batteries.Looks like a great bunch of apps on it.", "verified": true, "helpfulness": "0/0", "author": "James H Kilburn"}, {"rating": 4.0, "review": "It does what is supposed to do. It works fine .It could do more  at supporting more app from android store .", "verified": true, "helpfulness": "0/0", "author": "hectorite"}, {"rating": 4.0, "review": "The Fire stick did setup easily. It has several apps and you can watch the Amazon prime videos as promised. This is why I ordered it. But you need a subscription for some apps like Netflix or Hulu plus. I gave it a four stars due to the menu is hard to get thru to find what you want quickly. The app for your phone is worth downloading to speak what you want to watch quickly. I am looking forward to use this when we go on vacation.", "verified": true, "helpfulness": "0/0", "author": "Mommadamiri"}, {"rating": 1.0, "review": "Started off loving this thing, but little by little the forced ads are getting sleazier and sleazier.  First it started with slipping ads into the Amazon Prime content which I was paying for so I could watch it ad free.  Then ads even started showing up in TV Shows and movies I purchased out right.  If I have to watch ads no reason to pay for it.The final straw is that the episode lists for some TV shows now have fake episodes listed that are actually tricks to auto enroll you in other services.  ( See the picture.  Note that episode 13 is listed twice.)  If you click on that you will be auto enrolled in Hulu, and auto billed.  It will then be on you to go to Hulu your self and manually cancel the subscription you never wanted your self.  This is just sleazy.  This is a show that I already had access to on Amazon Prime.  It is ridiculous for me to be dragged to Hulu where I have to pay for it a second time, AND where I would have to watch it with even MORE ads.  The only one benefiting here is the money Amazon is clearly getting under the table to trick and screw over it's customers.I have thrown in the towel and gone back to AppleTV.RE-UPDATE:  There no longer seem to be ads at the start of Amazon Prime content, so that has at least improved.", "verified": true, "helpfulness": "887/940", "author": "Brian \"Another over opinionated mammal\""}, {"rating": 3.0, "review": "Keeps disconnecting frequently...apart from that the clarity and apps are all good...but everyday have to keep removing and replugging the device...we have never had a day without this happening since the day we ourchased. I am seriously pissed about it...our wifi connection is strong..but still it keeps getting disconnected..and asks us to rescan and forever searches for the network. I keep thinking if I could have avoided this issue if I purchased the Fire Tv for $70 more .... I hope the Amazon guys can rectify it somehow", "verified": true, "helpfulness": "0/0", "author": "Rajashree"}, {"rating": 5.0, "review": "It is a good product", "verified": true, "helpfulness": "0/0", "author": "Abdul Beydoun"}, {"rating": 4.0, "review": "I'd probably give this thing closer to 4.5 stars if that were an option, but overall I'm pretty impressed with this device. It's fast, simple, and easy-to-use. Out of all the other small, HDMI, streaming devices out there, this one truly seems like the biggest bang for the buck. I'm particularly impressed with how fast it streams content in comparison to other devices in already in my house, especially with the HDMI extender connected.The free Fire TV phone app is pretty good, too. My one gripe with it is that while the voice control works great, navigating menus by touching the phone screen can be a little inaccurate, but it's not a major problem. Definitely recommended.", "verified": true, "helpfulness": "0/1", "author": "Bennettovnikolai"}, {"rating": 4.0, "review": "Netflix performance on this is jittery even with the usb power plugged in. Otherwise, it's alright. Decent for the price.", "verified": true, "helpfulness": "0/0", "author": "Gabriel"}]