[{"rating": 5.0, "review": "Plenty of reviews here. Just a few quick additional perspectives for this ridiculously strong offering that really ups Amazon's game in this space, as in wow!1) SET UP: What \"they\" are telling you is accurate. It is ridiculously easy. I bought two of these puppies when offered at half price to PRIME members. Setup for both, combined, took me 20 minutes.2) USER INTERFACE: Easy and awesome. I'm an Apple fan boy. If Apple is serious about this market, they need an Apple TV update yesterday.3) RANGE OF CONTENT: What can I tell you? I bought this as a screaming solution to stream Amazon Prime content without firing up a DVD player, without AirPlaying my iPhone, etc. In addition, there are quite a few (not a lot of) other choices. Pandora and Spotify are nice touches for audio. The TuneIn app is extremely well done if you have already set this up for your other devices.4) PERFORMANCE: With Amazon content, it is excellent. It's early days for me so far, but on VIMEO content in particular, I get some latency. I imagine this must be a Vimeo issue? PBS performance is erratic.5) TRUE DOLBY YADDA YADDA FOR YOUR HOME THEATER RECEIVER: I'm not getting some of the other comments, but perhaps I'm missing something. My 2011 Samsung HDTV runs through my Denon home theater receiver. Depending on the OTA signal I'm tuning in, I get bona fide Dolby quality through my receiver. THIS UNIT is essentially a dongle connected to my TV. I've tested it with multiple programs, I've checked each of my speakers up close, including my two rear surrounds. I am distinctly getting \"the real thing\" versus \"stereo through four speakers.\" If you're a purist looking to run everything directly through your receiver, this solution is not for you. If you're simply seeking to ensure you get the audio quality you think you should be getting....ummmm....I think this unit provides it.For $40 I think this is a very compelling product. For $20 (what I paid), it is jaw droppingly awesome.", "verified": true, "helpfulness": "2/2", "author": "Highly Opinionated Man"}, {"rating": 5.0, "review": "Good deal on a system that functions like the Fire TV. A little slower processing and voice search by app only but a great deal.", "verified": true, "helpfulness": "0/0", "author": "Matt Korf"}, {"rating": 1.0, "review": "This is a waste of money!  Cannot hold connection to wifi for more than 60 seconds and the router is 2feet away from the fire tv stick.  Good idea....terrible execution.  I have tried other routers and all the troubleshooting I could find, it still won't work, calling Amazon and returning this junk.", "verified": true, "helpfulness": "1/1", "author": "Catherine A Koury"}, {"rating": 3.0, "review": "The setup was annoying. The interface is cumbersome. It surprisingly feels slow in many apps. Youtube is almost unusable.Otherwise I love it and prefer it over my PS4 as it has much more content. Great price too.", "verified": true, "helpfulness": "0/0", "author": "Bryan D"}, {"rating": 1.0, "review": "Product freezes and reboots if you use a Vizio remote in the same room.  Using the included usb and power brick.", "verified": true, "helpfulness": "2/2", "author": "Matthew U."}, {"rating": 5.0, "review": "Really great little gadget. We have about a 2 year old LG 42\" HDTV in our master bedroom, but it's not a smart TV. We're spoiled because our den set is a smart TV. Installed the Fire Stick, & almost at once we now have 2 smart TV's. I almost gave up on it but I waited a few hours after installing it, came back to it, & there it was. Netflix, Amazon Prime, & everything else. When I first installed it , it kept going in & out of pairing with my WiFi. Kept saying loss of signal, but then it said signal was very good. Forget Netflix, it wouldn't let me begin to sign in to my account. I shut the set off & came back to it in about 3 hours. Turned it on again, changed the input to Fire Stick, & like I never had trouble, everything worked flawlessly. Netflix sign in, Amazon Prime movies, etc. For me it's great, judge for yourself.", "verified": true, "helpfulness": "0/0", "author": "Stevie S"}, {"rating": 5.0, "review": "I have an older projection tv and it works great! sooooo glad I got it....", "verified": true, "helpfulness": "0/0", "author": "Mike Haemmerle"}, {"rating": 5.0, "review": "The hardest part of the setup was opening the remote to insert the batteries :). After that, attached to the TV and up and running in less than 10 minutes. Very pleased with streaming performance.", "verified": true, "helpfulness": "0/0", "author": "atroman1"}, {"rating": 5.0, "review": "I love the Fire stick. It has quickly replaced my Sony streaming device. The interface is very intuitive, offers great suggestions and works seamlessly with Prime. I am looking forward to trying the voice response feature using the app on my Android phone. Great buy.", "verified": true, "helpfulness": "0/0", "author": "G. Cates \"catg35\""}, {"rating": 5.0, "review": "Very happy with the Fire Stick. I purchased the stick mainly for easier viewing of Amazon prime, instead of using the PS3. As it turns out, the stick is much faster and easier to use than my Samsung smart tv for many apps such as netflix and hulu.", "verified": true, "helpfulness": "0/0", "author": "Yrag"}]