[{"rating": 5.0, "review": "The fire stick is great.... There are many movies I had forgotten about....", "verified": true, "helpfulness": "1/1", "author": "Dennis  Bisbee"}, {"rating": 4.0, "review": "Love it but I have my own internet connection and it still has trouble with internet connection it's frustrating", "verified": true, "helpfulness": "0/0", "author": "Morgan"}, {"rating": 5.0, "review": "LOVE IT!!!!!  Wish I had it sooner, beats trying to find something on cable to watch, with this you can watch what you want when you want.", "verified": true, "helpfulness": "2/2", "author": "Helping hand Susan"}, {"rating": 5.0, "review": "We got rid of our satellite to save money and ordered the Fire stick. We absolutely LOVE it!  We can watch shows when we want to, pause and watch something else and it will come back to the exact same spot.  It's very fast and easy to navigate. We also love the voice search available on the free app!", "verified": true, "helpfulness": "1/1", "author": "JTraylor2612"}, {"rating": 5.0, "review": "Does everything I thought it would do!", "verified": true, "helpfulness": "1/1", "author": "Louise B."}, {"rating": 5.0, "review": "LOVE my Amazon Fire Stick. Everything I expected and plus more. Love the added series to the Prime Instant Videos. With the Fire Stick, I feel like I am really getting my money's worth from the subscription.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "have lots of trouble watching Netflix  it keeps stopping and then goes.  I will be watching Netflix.  I can afford $100.00 for amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Karen Boettger"}, {"rating": 5.0, "review": "Love it!!! Its so much easy to access and find what I look for.", "verified": true, "helpfulness": "2/2", "author": "Rebecca"}, {"rating": 5.0, "review": "Excellent streaming device. Easy to install. Recommend using Plex app and subscribing to amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Newportbeacher"}, {"rating": 5.0, "review": "I love it. It works every well.", "verified": true, "helpfulness": "0/0", "author": "wendy wolber"}]