[{"rating": 5.0, "review": "It works", "verified": true, "helpfulness": "0/0", "author": "Coault"}, {"rating": 3.0, "review": "This device is more than I expected, but not in a good way. Much to my dismay and contrary to all of the advertised images, this thumb-drive-sized unit must be plugged into AC power in order to work. If I had known that, I'd likely have opted for the larger but more versatile Fire a TV or another Apple TV unit. That said, it performs well. It is faster than my Apple TV, just not as versatile.", "verified": true, "helpfulness": "0/0", "author": "Michael S."}, {"rating": 4.0, "review": "Item performs perfect.Voice command has been removed from the remote making the remote very small and hard to handle.Great for a child or someone with small hands.I own both Fire TV and the Stick and find no difference in the performance,Great Item.Update: had installed on tv in living room and it keep going of,contacted Amazon with error code and said my tv was out of date for the stick so moved to new tv,now stick is to far away from wifi modem and have a lot of pauses and slow load time.If you plane to install close to your modem its great.but for a room down the hall and maybe with the door closed I would go with the box,it has more power.", "verified": true, "helpfulness": "0/0", "author": "michael r. williams"}, {"rating": 3.0, "review": "The content from Hulu and other services are restricted in a confusing way, even though I am accessing it \"over the web\", it is restricted as web-only content not viewable through the Fire TV Stick, a device that is communicating wirelessly through my router as a \"web\" device. This flaw makes my Fire TV Stick much less useful, as does Hulu, which was already pretty useless. Great concept, good hardware, poor participation from outside sources of content. But to be fair, most content is prettycrap anyways today.", "verified": true, "helpfulness": "0/0", "author": "Ryan of Indiana"}, {"rating": 4.0, "review": "I loved my Fire TV and I love the Fire Stick; only thing negative (and it's not that negative) that I could say about the Fire stick?  I wish the remote had the \"voice\" control like the remote for the Fire TV.  However...I just downloaded the Fire Stick app to my Iphone and Walla!!  VOICE CONTROL issue solved!  Whoever came up with this Fire idea is a genius and my granddaughter loves having everything on the TV's!", "verified": true, "helpfulness": "0/0", "author": "MommaDukes \"MommaD\""}, {"rating": 5.0, "review": "Love it! Even came sooner than I expected .", "verified": true, "helpfulness": "0/0", "author": "Laura Skelton"}, {"rating": 4.0, "review": "The device itself is easy to use and performs as described.  It's very easy to access Amazon Prime programming.  The missing 5th star relates to the documentation for remote and for customer service.  Setup itself was simple.  But I had to access you tube video to figure out how to open the battery door to the remote.  In trying to complete the set up online, I needed to contact customer service to figure out how to navigate using the remote.  The answer was simple and was explained in the online video that FOLLOWED the set up requiring navigation.  Better documentation for these two issues packed with device and/or in help section online would have prevented substantial frustration.  And for heaven sake, please hire customer service reps who speak English!  Woman i spoke to was quite nice and she understood me.  But I had to ask her to repeat each comment 3-4 times before i could understand her.", "verified": true, "helpfulness": "0/0", "author": "Gail L."}, {"rating": 4.0, "review": "Simple installation and great picture quality.  We are hopeful that there will be more apps available as time goes by so we can get rid of our satellite espense.  Having more than one makes it easy to move from one room to the other and saving viwing history, while being able to resume what we were watching on the other tv.  We don't plan to purchase Prime as it looks like it can be expensive. First we'd have to buy the subscrription and then many of the films that we'd be interested in are not free and the rental rate is much higher than just going to Redbox.  Also, selecting from the Prime menu is requires that you open each one of interest to see the price unstead of just adding the films to your watchlist so even with a free month, we never watched anything on Prime.", "verified": true, "helpfulness": "0/0", "author": "Kindle lover"}, {"rating": 5.0, "review": "It works great. We are enjoying watching movies and TV shows on the big screen instead of on the Kindle Fire's small screen.", "verified": true, "helpfulness": "0/0", "author": "Diann"}, {"rating": 5.0, "review": "This is a great product! We can watch so many shows on this.", "verified": true, "helpfulness": "0/0", "author": "ACB \"AB\""}]