[{"rating": 1.0, "review": "This product is a nightmare. It constantly freezes. All. The. Time. I never have this problem with my Apple, only this. Ive done every troubleshooting option and it still is horrible. Worse is the remote! Jeeeezzzz the remote is a NIGHTMARE. It is nearly impossible getting the back off. Im not exaggerating. So not worth it. Significantly cheaper than the Apple but man do you get what you pay for. And thats nothing. Wish I bought a second Apple, dont know what you have good till you get something horrible like this.", "verified": true, "helpfulness": "1/2", "author": "HappyAuntie"}, {"rating": 5.0, "review": "Great Investment!  I would never leave home and watch movies ALL day if I did not have to work :-/The Amazon fire stick is the new hot thing since slice bread :-) !!!", "verified": true, "helpfulness": "0/0", "author": "Caesar Boone"}, {"rating": 5.0, "review": "Love it ! So glad I bought this !!!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Castillo"}, {"rating": 5.0, "review": "I use it on the tv in my kids' room.  It has everything I want and even includes games.  The kids know ho to use it too even for being pretty young.  It is pretty fast for such a small device.", "verified": true, "helpfulness": "0/0", "author": "Beata Fik"}, {"rating": 5.0, "review": "I refuse to pay for cable, i have a netflix & Hulu account and i use both frequently. I would connect my laptop via hdmi to my tv so that i could watch on a big screen, but that was just a hassle when i had to disconnect it to use my laptop, I considered buying a smart tv, but didn't really want to spend that kind of money and my tv is only a few years old. So after researching the Fire stick i decided to give it a shot.I LOVE IT!!!!! I'm so glad i made this purchase. Now i can watch Netflix & Hulu on my living room tv, not to mention access to my Amazon Prime stuff as well Thanks AMAZON!", "verified": true, "helpfulness": "0/0", "author": "Toni \"toni572\""}, {"rating": 5.0, "review": "Amazing little device ! I tell everyone I can about it . Very easy to use !", "verified": true, "helpfulness": "0/0", "author": "Mike Wells"}, {"rating": 5.0, "review": "Works Great!", "verified": true, "helpfulness": "0/0", "author": "abstar"}, {"rating": 5.0, "review": "The fire stick is really so much better than cable or regular TV!!!  My husband can't get enough.  I plan to get rid of cable as soon as I can.", "verified": true, "helpfulness": "0/0", "author": "Esther C. Ball"}, {"rating": 4.0, "review": "Really good", "verified": true, "helpfulness": "0/0", "author": "Raul"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Andrea De Graff"}]