[{"rating": 5.0, "review": "What can I say I love love love my fire stick! It did mess up a month ago but after I changed the batteries it hasn't messed up again.", "verified": true, "helpfulness": "0/0", "author": "Danuelle"}, {"rating": 3.0, "review": "Gets a little buggy, responds poorly to remote.  Waiting for next gen of TV box hopefully with better specs. Otherwise it's good.", "verified": true, "helpfulness": "0/0", "author": "Richard Cervantes"}, {"rating": 3.0, "review": "First of all I'm a big Amazon fan. I have both the Fire TV Streaming Media Player as well as the Fire TV Stick. I have been using them both for many months now. Playing \"Amazon content\" is great on either device. The disappointment I have with the \"Stick\" is playing content from other vendors via one of the apps such as Netflix or \"Watch ESPN\".  On the Streaming Media Player all plays fine. Clear and uninterrupted. On the Stick however, playing Netflix or ESPN content quite often results in buffering. It's annoying to be watching and then to be interrupted frequently with the endless circular arrow -or- a frozen picture that, after 5 or 10 seconds, fast forwards to catch up. This happens frequently too.  like every 5 to 10 minutes. I've tried all I know to resolve this. I've uninstalled and reinstalled the apps, deregistered and reregistered my Amazon account. I've replaced my old router with a new dual band router. I have a strong signal throughout my home and I use Xfinity as my provider and get 30 Mbps speeds. Not really sure what else I could do to get uninterrupted playback. This issue only occurs with the Amazon Stick and not the Amazon Media Player.", "verified": true, "helpfulness": "0/0", "author": "Paul \"PW\""}, {"rating": 5.0, "review": "It is easy to install and use and everything that I expected it to be! ABSOLUTELY WONDERFUL! The comparison to similar products was correct. It is the best, hands down. I'm so glad that I purchased one!", "verified": true, "helpfulness": "0/0", "author": "suzanne cooley"}, {"rating": 2.0, "review": "Great when it works. How often do I have to unplug or de register it for it to work properly? ALL THE TIME! it's not like technology is a new thing. My old ROKU works better than this. I have been a loyal Amazon Custer for 12 years now and I am highly disappointed!", "verified": true, "helpfulness": "0/0", "author": "Amber.marentette"}, {"rating": 5.0, "review": "it rocks. so much entertainment for such little money", "verified": true, "helpfulness": "0/0", "author": "william carter"}, {"rating": 5.0, "review": "I am very pleased with my Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Lavitta Galarde"}, {"rating": 4.0, "review": "easy to install up & running in < 30 min", "verified": true, "helpfulness": "0/0", "author": "James A croft"}, {"rating": 5.0, "review": "I love this product!  It was incredibly simple to hook up and has tons of things you can do with it.", "verified": true, "helpfulness": "0/0", "author": "Gina Jones"}, {"rating": 3.0, "review": "I got this for a good price and use it often, but I prefer my Roku. My Fire Stick lags often, is sometimes buggy, and doesn't have as many channels to choose from.", "verified": true, "helpfulness": "0/0", "author": "Jessica Blount"}]