[{"rating": 5.0, "review": "This is a great product if you have a non smart TV with HDMI imput, fast home wireless WIFI, and especially if you are a Prime member, and why wouldn't you be if you are reading this. Easy set up using included cables, batteries, and power adapter. So nice to be able to watch online content away from my laptop. Loaded the Crackle app and watched Comedians in Cars getting coffee without issue but it stopped during a movie and displayed error message and when I tried to resume where it left off it went right back to the error message. This happened before the Fire Stick software update was installed and I have not tried again since that. But this is a super great product especially for the price and the small remote works very well and has a nice design. Also paired with my Android smartphone and voice command does work. Very happy with this purchase and now will be even harder to get any work done around here. This is certainly a CPCD - Couch potato certified device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy set up and simple to use.", "verified": true, "helpfulness": "0/0", "author": "josh gutek"}, {"rating": 3.0, "review": "This worked great for awhile but the more it got used the worse it got. It constantly gets hot then the video lags or begins buffering and stops. We use this device as our primary television so I would not recommend for that purpose. If it is for occasional use I would recommend.", "verified": true, "helpfulness": "0/0", "author": "jennifer benedetto"}, {"rating": 4.0, "review": "HDMI Channel has to be change on original TV remote to use stickCustomer service rep. was excellent in helping solve installation", "verified": true, "helpfulness": "0/0", "author": "Paul Blackwell \"Paul Blackwell\""}, {"rating": 5.0, "review": "It is great.  worked perfectly as predicted.  Enjoy the choices", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I'm quite pleasantly surprised by this little device.  Slick and powerful and easy to use and setup.", "verified": true, "helpfulness": "0/0", "author": "Pete"}, {"rating": 5.0, "review": "The 5-star rating is for Amazon Customer Service.  I received this item today and it was not at all what I expected. :-(  Everything was connected correctly and it did search and find my wifi network, then did an update.  After everything loaded and I clicked on a couple of movies.  The quality was not good at all.  I also tried a couple of Tv shows and again the quality was not good.  It was fuzzy/out of focus.  I get a much better picture on my Chromebook which is connected to my HDTV.  Everything is always clear.  I don't like to complain, but I also don't like getting something that is not what I thought it would be.The best part of the whole situation is how well Customer Service handled my return and refund all in the same day which is today, the same day I received the Fire Tv Stick.  They have already credited the $34 back to my debit card.  That is awesome service.  The also sent me a prepaid label to send it back at no charge to me.  UPS will be here to pick up the return tomorrow.  I can't say enough good things about Amazon Customer Service.  They are amazing.  The entire process was handled through email.  Way To Go Amazon!  Thank You!", "verified": true, "helpfulness": "0/0", "author": "HeartsGirl"}, {"rating": 1.0, "review": "I bought it because of a special offer the picture continuously breaks up and lags.  The fire TVs I have work fine just the fire sticks seem to have a problem. Should not have waisted my money and just bought the fire tv", "verified": true, "helpfulness": "1/1", "author": "BCC \"Bill\""}, {"rating": 5.0, "review": "This little stick is awesome !  I don't have to plug a cable from my laptop to my TV anymore to be able to watch programs and movies on the big screen !  Thank you Amazon !  It streams fast, never loses signal and it is so inexpensive.  Wish I'd have done this a long time ago.", "verified": true, "helpfulness": "0/0", "author": "Marsha"}, {"rating": 3.0, "review": "We enjoy the Amazon TV, I feel it is a great value . However , the remote is junk.  The  disc gets stuck quickly and makes it hard to select a  program.", "verified": true, "helpfulness": "0/0", "author": "JacklynPatterson"}]