[{"rating": 5.0, "review": "Love", "verified": true, "helpfulness": "0/0", "author": "Noahs Mama"}, {"rating": 4.0, "review": "Wanted an inexpensive streamer because the apps on my smart tv are painfully slow. I tested both the Chromecast and FireTV stick. Hands down the FireTV stick was the best of the two. The Chromecast was quick and simple but really buggy (especially with Netflix). The netflix app constantly kept losing the cast icon forcing me to quit the app and launch it again just to get it back. FireTV was also fast, and having a nice UI to navigate between apps was pretty great. Also being an Amazon prime user makes this a no brainer as chromecast is unable to stream prime content.", "verified": true, "helpfulness": "0/0", "author": "mntngr"}, {"rating": 5.0, "review": "It's great.  Way better than Netflix and Hulu put together", "verified": true, "helpfulness": "0/0", "author": "ryan"}, {"rating": 5.0, "review": "Great product! Pretty fast for such a small and low price device.", "verified": true, "helpfulness": "0/0", "author": "Anderson Moles de Matos"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "l jordan"}, {"rating": 3.0, "review": "Put some movies for free", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Might have given it 5 stars, but trying to open the remote to install batteries was way too difficult. I even had to search for help after failing to figure out how to open it. Otherwise, the device works just great, though I have not explored all the options. More instructions also would be helpful, though more can be found online than the meager info that comes with the device. I got it on sale, so it's been well worth the money, though I would have liked to have had Vudu included among the streaming options.", "verified": true, "helpfulness": "0/0", "author": "C. Clines"}, {"rating": 3.0, "review": "Looking to easily type things? Get a Chromecast. This Fire TV Stick toy has an ABCDE keyboard that makes NO sense. No QWERTY in sight.Looking to use it quickly? Get a Chromecast. This Fire TV Stick toy forces you to watch a horribly long tutorial. Our family bought a few, and it took FOREVER to get them all setup because of the psychotic tutorial.Want to get around the obsolete idea of a physical remote and use the app quickly? Get a Chromecast. This Fire TV Stick toy forces you to watch the POINTLESS tutorial. I finally gave up.Want to use the voice search on the app to search YouTube? Get a Chromecast. This Fire TV Stick toy doesn't even search YouTube in the main search. Even then, Fire TV Stick does NOT have native YouTube ! HA!I've gone back to the Chromecast and using my Bluray player for my Amazon Prime TV.When I hear about these design flaws being fixed, then I'll try again. I don't have enough patience to suffer through all that.This is truly an infuriating little toy.", "verified": true, "helpfulness": "0/1", "author": "David Betz \"quantzai\""}, {"rating": 5.0, "review": "Just arrived -- Quick ReviewSetup was the easiest I have found on this type of device.  Just entered the WiFi password and boom.The controls are very intuitive.  The ring for L/R/U/D is a bit clunky but certainly workable.Steaming from Amazon Prime was flawless.I have an Android unit on HDMI 1 that may be more sophisticated.  The tradeoff with that is complexity.  The Fire Stick is just so simple that I really prefer it.  What it does it does as well or better than the fancier device.  For watching movies this device is as good as it gets.", "verified": true, "helpfulness": "0/0", "author": "KenP \"ken-p\""}, {"rating": 5.0, "review": "Easy to use. Better than crome cast because it has a remote. I don't like having to plug into the wall though. Otherwise works great, fast set-up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]