[{"rating": 5.0, "review": "I love it! It's so easy. My Wii remote just stopped working right before I received the Fire TV Stick so it was good timing.", "verified": true, "helpfulness": "0/0", "author": "Becky L. Tilghman"}, {"rating": 3.0, "review": "Don't watch TV that much anymore", "verified": true, "helpfulness": "0/1", "author": "Jack Weber Jr."}, {"rating": 3.0, "review": "It functions \"OK\". It had a hard time connecting to my wireless at first. Once connected, everything worked well. There are some major quirks. One issue is the choppiness of Netflix. There is a stutter, almost as if the program wasn't calibrated well enough. The second issue is the remote. It's hit and miss; literally. Some times it's responsive and a single click will move you 1 space over, and some times it launches you 100 rows over. I'd say buy if you can get it for super cheap (under $20), if not buy something else. Also, not all the games that play on the Fire TV can be played on the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "ERICKPRIME"}, {"rating": 5.0, "review": "Decided to get the Fire Stick because of the 2day deal Amazon had although having 2 Chrome Cast within the home. I have to admit that I have found the Fire Stick to be my go to device because I actually can use my prime account on there. I like the interface and that it comes with remote in addition you can download the app with allows you speak your searches.", "verified": true, "helpfulness": "0/0", "author": "D. Bryan"}, {"rating": 5.0, "review": "This is great!However if you have a gameconsole it might be a little redundant.", "verified": true, "helpfulness": "0/0", "author": "Jimmy Darkz"}, {"rating": 2.0, "review": "Doesn't work well with my wireless, the connection keeps cutting in and out, had to return it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I cannot say enough about this. I gave some as gifts and we kept one. We loved it so much we purchased another one!!", "verified": true, "helpfulness": "0/0", "author": "TERRI MARTIN"}, {"rating": 5.0, "review": "I am very happy with the Fire TV Stick. I had previously purchased a Fire TV and loved it. When the Fire TV Stick went up for sale I decided to pick one up for my father on the off chance he might be interested in what it could do. I'm happy to report that he loves it. It may have been the perfect purchase for him since he is retired and has a lot more time on his hands lately.The device itself is not much different from the Fire TV except for the obvious hardware and software limitations. I was expecting the Fire TV Stick to perform much slower and to be much more limited than it is. After a few weeks of using it and comparing it to it's more expensive sibling I can definitely say I am impressed. I'd definitely recommend this to anyone curious about online streaming. My father is now considering cancelling his cable service completely and just using his Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "BG"}, {"rating": 1.0, "review": "Streaming is lagged, buffering is horrible. This is not even remotely close to the efficiency of the Chromecast, Roku, or PC.  I wish I could get a refund.  Even with the latest firmware, still stutters and at best shows with pixelation. Sad and disappointing wait for this.", "verified": true, "helpfulness": "0/2", "author": "AdoptAPet \"Adopt a shelter pet PetFinder.\""}, {"rating": 3.0, "review": "It was a great price for $19 to stream to a small TV for the kids.  Interface looks very close to the Plex Home Theater interface (not a bad thing).  However, I personally don't like the navigation.  Beautiful and smooth and you get right to content if you are just running Prime.  However, Hulu, Netflix, etc.. seem to require a few extra clicks. Funny, when I use my brother-in-law's Apple TV or my own Roku I don't have this particular thought.  Maybe it is because I can pick back up on a show from the menu if it was Prime but I can't from another app.  Also lack of support (I don't see this changing anytime soon/ever) for accessing the Google Play Store or any official Google Apps just kills the potential for this beast of a stick.  I bought this stick with the sole purpose of access the Prime content but also Netflix as well and that is it.  So it is serving it's purpose.  However after use, I lost my enthusiasm to buy the $99 Fire TV for my main TV.", "verified": true, "helpfulness": "1/2", "author": "asif"}]