[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Dennis Ortiz Jr."}, {"rating": 3.0, "review": "Love all the programs videos. Have a problem with  stick. Fire Stick. When  I switch from cable to Fir Stick.it does not work and I have to unplug Stick. Same thing happens with my ons Stick also.  basically happy with stcick.", "verified": true, "helpfulness": "0/0", "author": "eileen irgang"}, {"rating": 3.0, "review": "FIRE STICK,WHY? Installation,was a breeze,setup and settling in to explore took 15 minutes maximum,and all was sublime until the stuttering and frozen playback began. We explored forums but have found no true solution. Overheating, perhaps?", "verified": true, "helpfulness": "1/1", "author": "Queenie 55"}, {"rating": 1.0, "review": "After waiting forever for this, it won't connect to my home wifi network.  Do not waste your money!", "verified": true, "helpfulness": "0/0", "author": "Scott Wolff"}, {"rating": 4.0, "review": "I like it, but problem is my wifi needs to be rebooted every night for us to watch, plus, need to unplug and replug insert every time I use???", "verified": true, "helpfulness": "2/2", "author": "Paul Jolie"}, {"rating": 5.0, "review": "It's great. Use it everyday.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Connection issues with Comcast", "verified": true, "helpfulness": "0/0", "author": "Keisha Conway"}, {"rating": 3.0, "review": "Loses connection more than my Roku but less than my Google TV. I had to lower my Netflix quality to the lowest setting for streaming. Otherwise the show I was watching would skip around. It shows that wifi signal is max strength.", "verified": true, "helpfulness": "1/1", "author": "M.Brand"}, {"rating": 5.0, "review": "Amazing! Great instructions. We absolutely love this product. Perfect compact size remote.", "verified": true, "helpfulness": "0/0", "author": "Karen Hokenson"}, {"rating": 5.0, "review": "LOVE the FIRE TV STICK!!!! you can do so many things. and it's got many great apps. It truly meets my expectations and it's so easy to use my 5 year old loves it.", "verified": true, "helpfulness": "0/0", "author": "kim marten"}]