[{"rating": 5.0, "review": "So happy with the fire stick!easy to use and i love that it has everything i need!", "verified": true, "helpfulness": "0/0", "author": "Cass H."}, {"rating": 1.0, "review": "When comparing the Fire Stick to a Lightening Cable, Chromecast or Apple TV, the Fire Stick definitely comes in 4th place.  I don't think they know what they are doing.  I constantly get errors, that Netflix movies that will easily play on the Netlfix App,Chromecast or on Apple TV, which is very frustrating.  Out of any of the 4, this one is the worst.  I imagine Amazon could make improvements, and I hope they do soon, otherwise I will ditch the device completely.  Also, they said HBO Go would be available for the stick in Spring of '05, and haven't seen it on there yet.While I love Amazon, this product is very subpar", "verified": true, "helpfulness": "1/1", "author": "Jason M Tuel"}, {"rating": 5.0, "review": "We use it all the time. Love that it takes up virtually no space.", "verified": true, "helpfulness": "0/0", "author": "SpaceCadet"}, {"rating": 3.0, "review": "I would've given this 5 stars a couple days ago.  I've only had it 9 days and it worked GREAT the first 7 days.  Then I got a message on the screen that there was an update, which I did. HUGE MISTAKE!  Now it buffers ALL.THE.TIME.  I've been binge watching \"Sons of Anarchy\" on Netflix since I got this....had NO problems before the 'update'.  Now I keep getting a message that says \"The series you are trying to watch is not available at this time.  Try back later.\"  I'm PISSED!  It worked so great for the first few days!!!  I can still watch \"SOA\" on my laptop on netflix so it's definately the firestick.  I'm pretty disappointed.  But I'll keep trying to use it!  I was going to buy my dad one for Father's Day but now I'm a little doubtful.  Or will buy it and tell him not to do the update!", "verified": true, "helpfulness": "0/0", "author": "DG"}, {"rating": 1.0, "review": "I tried to stream Amazon Prime from my VisioBD Player with no luck so I stayed with Netflix.  BUT since I’m paying for Prime and should reap all of its benefits…  I bought an Amazon Fire TV Stick hoping that this would allow me to watch Amazon Prime on my TV… again no luck.  My WIFI signal strength is very good to strong per the Fire TV Stick and still the Fire Stick won’t stay connected.  I have to do an unplug reboot to get it going again.  3 times in one movie is too much!!!  And when it is working it runs slow.  If I hadn’t thrown out the packaging I’d return it. Don’t buy the Amazon Fire TV Stick… It’s a total waste of money.", "verified": true, "helpfulness": "0/0", "author": "Sue Ellen Miller \"Dragonfly Stained Glass\""}, {"rating": 5.0, "review": "Easy to install and I have no issues with it.", "verified": true, "helpfulness": "0/0", "author": "Michele"}, {"rating": 3.0, "review": "Meh, intermittent at best... HIGH quality streaming, though! Nice interface. It just \"stalls\" a bit", "verified": true, "helpfulness": "0/0", "author": "JTWarren \"Pseudonym4Reality\""}, {"rating": 5.0, "review": "I decided to try Amazon Prime mainly because I'm getting ready to cut the FIOS cord and want to increase my viewing options. My BluRay downstairs has an option to add Prime, which I did, but it isn't available on the BluRay upstairs so I bought the Stick.  It is ridiculously easy to install and everything is well marked. If you have a password for your internet access, have it handy for your setup. There are a boatload of movies and TV shows included at no charge with your Prime membership. Amazon lets you know if a movie is not included with your Prime membership so you will know if it will cost ya. The picture quality is terrific and even though I have the HD version of Netflix, I swear the picture I get with Prime is sharper.My next step is to add Sling TV for $20/month - bunch of channels and is available via the Fire TV Stick. Also purchased an Ooma from Amazon - phone service for $3 a month - you can even port over your existing phone number for a one time fee of $38 (N.B. Do this BEFORE you cancel your existing phone service.) The final piece of the puzzle is the internet service. I'll either keep FIOS or switch to Comcast/Xfinity - whoever gives the most bang for the buck. In my personal situation, there is only one channel I regularly watch that, at present, I won't be able to get once MY PLAN is in place. But the trade off is a savings of well over $1,200 a year. Not bad for a little upfront fancy footwork.So Amazon Prime, Sling TV and Netflix for movies and shows, Ooma for phone and some sort of Internet service...hah, made in the shade!", "verified": true, "helpfulness": "0/0", "author": "Sharon K."}, {"rating": 5.0, "review": "good quality", "verified": true, "helpfulness": "0/0", "author": "Ruth"}, {"rating": 5.0, "review": "I had to give up cable. This made life great! I have added apps to this and I never have problems streaming my programs. Great purchase", "verified": true, "helpfulness": "0/0", "author": "PS"}]