[{"rating": 3.0, "review": "The Stick was really easy to set up.  I was able to up load my pictures and videos. I was able to download the app for the controller.  However I Can only connect to Prime and Netflix.  Having trouble with everything else.", "verified": true, "helpfulness": "0/0", "author": "Bankable Family"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Catherine Saunders"}, {"rating": 5.0, "review": "Works great. No complaints.", "verified": true, "helpfulness": "0/0", "author": "Lee"}, {"rating": 1.0, "review": "Very Slow and i cant access PBS or any of the channels", "verified": true, "helpfulness": "0/0", "author": "Maged Salib"}, {"rating": 5.0, "review": "Love my Fire Stick!!!", "verified": true, "helpfulness": "0/0", "author": "Amy Asche"}, {"rating": 2.0, "review": "Amazon is trying to take all my money.lol I kid. I prefer the Google Chromecast. Amazon looks awesome but it's mostly for the paid content.", "verified": true, "helpfulness": "0/0", "author": "Carmen Zeron"}, {"rating": 4.0, "review": "Great but takes a little while to learn how to navigate. The selection of things that can be are almost limitless! Love it. I recommend this device to everyone!", "verified": true, "helpfulness": "0/0", "author": "Tab Brown"}, {"rating": 4.0, "review": "It works good, its small and was easy to install  But I find the remote is touchy,  often takes me not where I want to go. it is also kinda hard to navigate.  I'm sure it will improve with time.", "verified": true, "helpfulness": "0/0", "author": "R. Kern \"Rachelkayz\""}, {"rating": 2.0, "review": "Hard to understand the tv and movie lineup. After realizing I still needed to join prime, it would still charge me to watch already ran TV shows?  I was hoping to be able to at least watch tv and some movies without a fee. Cannot figure this darn thing out.", "verified": true, "helpfulness": "0/0", "author": "Debbie Witherow"}, {"rating": 5.0, "review": "I don't really have cable and I just absolutely love this. I used to just watch things on Netflix so this just gave me some more options.", "verified": true, "helpfulness": "0/0", "author": "Valeria"}]