[{"rating": 4.0, "review": "I like that I can travel with it and connect to any wifi, ie. hotel, relatives, and enjoy.", "verified": true, "helpfulness": "0/0", "author": "Celeste Bowman"}, {"rating": 3.0, "review": "There are not a lot of choice so of Free Movies and/or TV shows the package should include a booklet what can be accessed for free besides the paid services that are being offered.", "verified": true, "helpfulness": "0/0", "author": "Hector Leguillow"}, {"rating": 5.0, "review": "Very satisfied with the performance and features.", "verified": true, "helpfulness": "0/0", "author": "Steve Kodra"}, {"rating": 5.0, "review": "I love my Fire TV Stick.  I am not good with techy stuff but this was so easy to install and setup and it works perfectly. I have a smart TV so could already stream Netflix directly but wanted the Stick to use with my Prime membership and Fire tablet.  The remote makes it simple. Great job Amazon", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "It is great, easy to use and easy to program.  I had been using A similar", "verified": false, "helpfulness": "0/0", "author": "Ed Berlien"}, {"rating": 5.0, "review": "Loving the fire stick.  We watch movies and TV series as well as play some of the games.", "verified": true, "helpfulness": "0/0", "author": "Randy Amos"}, {"rating": 5.0, "review": "It is great", "verified": true, "helpfulness": "0/0", "author": "Lonnie Franklin"}, {"rating": 2.0, "review": "Received as gift and returned. You still have to buy subscriptions to all the services this just allows you to access them easily on your tv if you don't have a smart tv, game console, etc to do so for you. I have apps on my xbox and wii which serve the same purpose. I can see its very limited possibilities, but highly dissapointed all the same.", "verified": true, "helpfulness": "0/0", "author": "Victoria Hunter"}, {"rating": 2.0, "review": "The interface is laggy and the playback has serious stutter issues when I watch Hulu", "verified": true, "helpfulness": "0/0", "author": "Raphael Hamzah"}, {"rating": 5.0, "review": "I absolutely LOVE this product.", "verified": true, "helpfulness": "0/0", "author": "ana espinoza"}]