[{"rating": 5.0, "review": "Works Great!", "verified": true, "helpfulness": "0/0", "author": "Christopher S Gardner"}, {"rating": 5.0, "review": "Perfect for my setup. I have a Fire TV on my main TV and set up the Stick on one of my other TV's for my wife. Setup took mere minutes without incident. Looking forward to the iOS app to make the stick even better. Would recommend this product as either a primary or secondary device.As an aside, I love the packaging Amazon has chosen for its electronic devices. Clean and snazzy!!", "verified": true, "helpfulness": "0/0", "author": "Henry Farpolo"}, {"rating": 3.0, "review": "Pretty neat device. I expected a bit more from it but I guess for $20, it'll do. I'm a bit disappointed that I didn't do my research on this stick as I didn't know that I wouldn't be able to move away from Amazon's ecosystem. Granted, this is to push their ecosystem, but I would have enjoyed it if they didn't have EVERYTHING they have on the home screen. Plus, today I even saw an ad on the homescreen. That is what's really ticking me off", "verified": true, "helpfulness": "1/1", "author": "Wallou"}, {"rating": 5.0, "review": "Love it! It works as well as advertised and it is so nice not to have to tie up my laptop to watch Netflix or Hulu on the TV.", "verified": true, "helpfulness": "0/0", "author": "Irish Eyes"}, {"rating": 5.0, "review": "I got it for $19 and bought 2.  Aboalutely love it.  It wont be my primary streaming device as my xbox one is, but for what i need it for, it does the trick and its super fast", "verified": true, "helpfulness": "0/0", "author": "D. Lama \"Ms. Dainty\""}, {"rating": 4.0, "review": "I found this to be a very good product, it responds very quick, has a lot of extra apps you can download and use with it, including games to play on TV. The only drawback is, you cannot  steam anything to your TV from any  “ios” product, like (iPhone) (iPad) or (iPod) otherwise I recommend it if you want a good product, for a good price.", "verified": true, "helpfulness": "0/0", "author": "Stanley H."}, {"rating": 5.0, "review": "Got this when it launched for $19 so that's a big plus for me. I'm a huge Amazon fan and I was going to buy the Fire TV but just happened to catch this first.It was super easy to install and set up. I have not run into any problems as far as loading or downloading games, apps, shows, or music. The picture quality is wonderful. My almost 4 year old has already mastered getting to the shows or games that he wants so it's obviously not difficult to use.I don't have any experience with ChromeCast, Roku, etc. so I can't compare anything to them. However, I am very happy with the Fire TV stick and don't feel the need to check out any other streaming devices.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "So easy to use and the app makes it so much fun. This was a great buy", "verified": true, "helpfulness": "0/0", "author": "theMightyThor \"theMightyThor1212 at youtube\""}, {"rating": 4.0, "review": "The Fire TV Stick is just what I hoped it would be. I was ready to use it after plugging it in and entering my network settings. I've used the Pandora app and watched a couple of movies on it. I like how you don't have to turn it off. My only disappointment is the availability of the remote app. It is not available for iOS. It is not available for the first generation Kindle Fire.", "verified": true, "helpfulness": "0/0", "author": "B0b"}, {"rating": 5.0, "review": "Easy to set up, use.  I found it much easier to add apps via the Amazon web site, not via the Fire interface.Blown away when I played my Amazon Prime music. My sound bar connected to the TV was amazing!I only wish Fox Go app and NBC Sports app were available.", "verified": true, "helpfulness": "0/0", "author": "Albert J. Moore"}]