[{"rating": 5.0, "review": "Hands down better than Chromecast. The remote is a great feature!", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 4.0, "review": "Never saw Gary Bussey have to use a USB Power cord to power the Fire Stick - so that is a little misleading.Otherwise a very good product.", "verified": true, "helpfulness": "0/0", "author": "Douglas Simms"}, {"rating": 1.0, "review": "I have been able to use my Fire Stick as there is a clicking noise that get continuesly worse the longer I watch.  Amazon customer support was great and sent me a new one....but it was even worse! It is not my TV/internet/HDMI port as my chromecast works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "taylor"}, {"rating": 5.0, "review": "The Fire TV Stick is awesome. It adds an entirely different dimension to my TV. I have a \"smart\" tv, but the smart features within the tv are not great. I can log into Netflix and Hulu but the search features are pretty slow and tedious. The Fire TV stick solves this problem since it's much faster. Just clicking the middle button on the remote brings me to my HDMI input and I can just start scrolling through my Amazon, Netflix and Hulu accounts' movies and shows. My amazon products are really starting to give my Apple products a run for its money. Awesome!", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Duong"}, {"rating": 5.0, "review": "Great unit, works well.", "verified": true, "helpfulness": "0/0", "author": "allen leichtman"}, {"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "Michael solomon"}, {"rating": 3.0, "review": "It still takes a long time to charge my kindle although better than before", "verified": true, "helpfulness": "0/1", "author": "Paul A Feinberg"}, {"rating": 1.0, "review": "I found the product to meet all my expectations. And the service dept was very helpful also.", "verified": true, "helpfulness": "0/0", "author": "Joanne"}, {"rating": 5.0, "review": "I purchased the Fire TV Stick and I'm very happy with it.  It was easy to set up and I love the small lightweight remote.  I had been using my old Wii to watch Netflix and it was inconvenient to switch from Netflix to Amazon Prime TV.  I almost purchased the Chromecast, but noted that Amazon Prime TV doesn't play well with it and that was the primary purpose I wanted a product.  In the last 2 weeks I've been watching Amazon Prime TV and Netflix to my heart's content.  I know there is much more content available but watching TV is not my full time job.", "verified": true, "helpfulness": "0/0", "author": "Gloria \"tapp4010\""}]