[{"rating": 2.0, "review": "I have a Chromecast on my bedroom TV. I decided to get this because I thought it would be better for the living room. I figured it came with a remote and you didn't need to use your phone so anyone could just use it and it would be simpler. I also got it because I decided to pay for prime mainly for the shipping but might as well get something for the video on my tv.I'm ordering another Chromecast.It's very laggy at times. Sometomes the video has to catch up with the audio. But the most annoying thing is when you go and play a video and it just returns to the home screen. Every time. All the time. I give up. Sending it back.The ui was nice though. Good luck.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Great way to view your Netflix. No mess with the computer. Easy as pie to use as long as you know how to change the imput on your TV set. I love it.", "verified": true, "helpfulness": "0/0", "author": "Trisha Bee \"Trish\""}, {"rating": 5.0, "review": "Great price and works great!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "I am pleased with the product.", "verified": true, "helpfulness": "0/1", "author": "Chuck Bush"}, {"rating": 3.0, "review": "I think I got a defective one. I have to constantly unplug it and plug it back in and sometimes it just signs off the network randomly. At first I thought it was my wireless router because I was having issues with that too, but I changed my router and I have even got a new internet provider, every thing else on the new router works just fine but I am still having issues with the stick. I loved it because its small and easy to move from room to room and has all the necessary apps I need. It's just frustrating to have to keep unplugging and plugging.", "verified": true, "helpfulness": "0/0", "author": "Laurene DaRosa"}, {"rating": 4.0, "review": "Wish it was wireless.", "verified": true, "helpfulness": "0/0", "author": "Michael LeWinter"}, {"rating": 5.0, "review": "The Fire TV stick was simple to setup.With a good wireless connection in your home network, the Movies and Music stream without hesitation.", "verified": true, "helpfulness": "0/0", "author": "Michael S."}, {"rating": 5.0, "review": "Best purchase ! Works like a charm", "verified": true, "helpfulness": "0/0", "author": "Charles A Hunter"}, {"rating": 5.0, "review": "This is the best thing I've purchased in a long time, so easy and my family love it!!!", "verified": true, "helpfulness": "0/0", "author": "Mamie"}, {"rating": 4.0, "review": "This is exactly what I was hoping it would be. I purchased the Fire Tv for my living room and the Fire Stick works just as well only $60.00 cheaper.", "verified": true, "helpfulness": "0/0", "author": "Richard Gutierrez"}]