[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "anton bova"}, {"rating": 5.0, "review": "Easy set up and works great. Use it mostly for Netflix but also MLB. No issues thus far (had it two weeks) and find it faster than most other ways of accessing my Netflix. Only think that is a pain is having to power the stick with a cord. PITA..... Should be a better way. But other than another damn cord hanging from the back of my TV it works great....", "verified": true, "helpfulness": "0/0", "author": "Sparky San Diego"}, {"rating": 5.0, "review": "Excellent and easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Jean S. Kirkpatrick"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Roberto Salinas"}, {"rating": 5.0, "review": "Easy to use and works great.", "verified": true, "helpfulness": "0/0", "author": "cudaone.       cuda                                                                    Joan Johnston \"Book Lover\""}, {"rating": 4.0, "review": "Its great,easy to use and install. The only thing I need to do is put parental controls on so the kids can't rent movies without me knowing!", "verified": true, "helpfulness": "0/0", "author": "Sherri Moreau"}, {"rating": 5.0, "review": "I couldn't be happier with my Firestick! Set up was super easy and fast. I am not a techie but have had no trouble using or navigating with it. Very occasionally it will buffer while I am watching as show but it is usually only for a few seconds. It is awesome to have Prime Video, Netflix,  Hulu, etc all at my fingertips! I think it is an amazing device especially at this price point.", "verified": true, "helpfulness": "0/0", "author": "ED 63"}, {"rating": 5.0, "review": "We're having a very good time with this.  Quite a generous library of free programs/movies with Amazon Prime and, when supplemented by Netflix, the options increase tremendously.  Easy, easy, easy.  I believe the necessary internet connection needs to be fast enough to handle the streaming, as once in a while the program would stop while (I assume) buffering.  Just pressing \"Play\" after a few moments got it going again. Yesterday I doubled my service's speed to 30Mps and still experienced the \"pause\" issue, so trying to figure that out.  Our friends with the Fire TV Stick are also enjoying their experience with it.", "verified": true, "helpfulness": "0/0", "author": "tj"}, {"rating": 5.0, "review": "Ease of use and speed was fantastic.", "verified": true, "helpfulness": "0/0", "author": "ms"}, {"rating": 5.0, "review": "Very easy to set up and navigate", "verified": true, "helpfulness": "0/0", "author": "Linda D."}]