[{"rating": 3.0, "review": "Roku has much better app availability.", "verified": true, "helpfulness": "0/0", "author": "Jimony \"The jimony of There\""}, {"rating": 2.0, "review": "When I talked to someone at Amazon prior to purchasing the fire stick I was told there were a lot of free shows available for watching, when I actually received it there were very few free programs I wanted to watch.  It also had trouble going into the HDMI port", "verified": true, "helpfulness": "0/1", "author": "Judy Gavis"}, {"rating": 5.0, "review": "I got it for $20 when they first announced it for Prime members. Well worth it. It actually is less buggy than my Apple TV.  If it didn't need to be plugged into a power outlet, it would be more than perfect for travel.  Not bad, even with the AC cable though.  Love it.", "verified": true, "helpfulness": "0/0", "author": "JConsumer"}, {"rating": 5.0, "review": "Love this lil stick, 100 x better than the Amazon prime pre loaded on my so called smart tv. Nice interface, awesome picture quality and sound. And no buffering at all on the few movies we have watched.", "verified": true, "helpfulness": "0/0", "author": "CPO Smitty"}, {"rating": 5.0, "review": "I love the remote control, something the Chromecast doesn't have.", "verified": true, "helpfulness": "0/0", "author": "Khanh L."}, {"rating": 5.0, "review": "I love this handy little gadget. This has replaced my PS3/XBOX for online media. Its much faster to turn on and simpler to use", "verified": true, "helpfulness": "0/0", "author": "Sid \"Sid\""}, {"rating": 4.0, "review": "No complaints", "verified": true, "helpfulness": "0/0", "author": "Derek W. Collins"}, {"rating": 5.0, "review": "bought this as a  replacement of Roku 3 that died in less then a year!  Easy set-up, easy navigation with all the channels we want---hardest part of the set-up was getting the cover off remote to install aaa batteries(included)--another fine product from Amazon!!", "verified": true, "helpfulness": "0/0", "author": "W. S. Dean \"2fat\""}, {"rating": 5.0, "review": "The fire stick had me watching Netflix within 5 minutes after I received it in the mail.  Great price.  Very easy to get up and running.", "verified": true, "helpfulness": "0/0", "author": "CHR"}, {"rating": 4.0, "review": "Can someone tell me how I can get audio through my home theater system with the Fire Stick?", "verified": false, "helpfulness": "0/0", "author": "sherryburke"}]