[{"rating": 5.0, "review": "Great easy to use, setup, and operate", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Mohammad Siddiqi"}, {"rating": 5.0, "review": "This device is slammed packed full of viewing, playing and listening options. This is an excellent value and if they continue to get more channels that we regularly see on cable, good-bye Comcast. It's as close to a-la-carte TV as you can get so far.", "verified": true, "helpfulness": "1/1", "author": "Cbraun"}, {"rating": 2.0, "review": "Seemed like a great value when it came out. I pre-ordered it and received it in December I think. The idea is great, however the execution is poor. My main complaint is that the device is not engineered well. It constantly over-heats, has to be power-cycled, and has stutter in it's video. I have 2 media players from another well-known brand, and they continue to work flawlessly year after year. This device however, is more headache then it's worth.", "verified": true, "helpfulness": "0/0", "author": "Kevin Bidwell"}, {"rating": 5.0, "review": "Love it!  I had no idea it would make the picture so much clearer than the Roku!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good tool to combine all the apps into one device.", "verified": true, "helpfulness": "0/0", "author": "Anthony Delgadillo"}, {"rating": 5.0, "review": "Fantastic-Hours of entertainment and easy to install!", "verified": true, "helpfulness": "0/0", "author": "Bruce Kennedy"}, {"rating": 3.0, "review": "It works.Prime video has a very limited variety of content.Works fine with Netflix.", "verified": true, "helpfulness": "0/1", "author": "Casiopea"}, {"rating": 1.0, "review": "This is great in theory, but it doesn't work half the time. It stops shows midway through, won't mirror my tablet consistently, and doesn't accurately keep track of where I am in the show. I normally love Amazon products, but this one is too buggy.", "verified": true, "helpfulness": "0/0", "author": "jessica7531"}, {"rating": 5.0, "review": "Amazing for the price!", "verified": true, "helpfulness": "0/0", "author": "JMC"}]