[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Great and easy set up", "verified": true, "helpfulness": "0/0", "author": "Juan C. Garay"}, {"rating": 4.0, "review": "I love it! I have been trying for a very long time to get rid of any cable service period because I just cannot afford to waste my money when all I seem to do is watch commercials. The Fire Stick allows me to get all my shows from Netflix and Hulu, plus I love the fact you can search on YouTube + all the prime shows and prime movies. It did take me a little bit to get a hang of it because one feature I don't care for is it only shows \"recommended\" prime shows and movies and not the Full selections. However, I am about to buy a second one and I am just amazed that I wasted so much money when I could have just purchased this and paid a couple small monthly subscriptions.", "verified": true, "helpfulness": "0/0", "author": "Vince C."}, {"rating": 4.0, "review": "I like it alot! Very convenient, good shows, and great visual. The only thing I would add, is a channel or station list, so we can search shows by Channel. A list would help me find shows when I don't know the names to search for...Oh, and maybe the option to change payment method on screen, and not have too run to a PC mid-show hunting.", "verified": true, "helpfulness": "0/0", "author": "Monique Boykin"}, {"rating": 1.0, "review": "I didn't realize we needed prime or some kind of cable tv to use it for the most part.", "verified": true, "helpfulness": "0/2", "author": "Rebecca Dean"}, {"rating": 5.0, "review": "streams as well as my roku 3 at a third of the price", "verified": true, "helpfulness": "0/0", "author": "rusty"}, {"rating": 5.0, "review": "Great piece of hardware works great, amazing value!!! Enjoying it very much, grandkids love it.", "verified": true, "helpfulness": "0/0", "author": "Gerald Miller"}, {"rating": 5.0, "review": "I love love love it", "verified": true, "helpfulness": "0/0", "author": "CmSmiles"}, {"rating": 2.0, "review": "It's okay.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 1.0, "review": "1. Doesn't support bluetooth headset...seems like Amazon would make up the price vs fire tv in bluetooth headsets if they allowed the fire stick to work with Bluetooth headsets2. Has trouble consistently connecting to WiFi (see photos)3. Mirror cast should not require any additional download but you have a download your choice of poorly written software4. Search function from fire stick apps from the device it self", "verified": true, "helpfulness": "0/0", "author": "aidan brock"}]