[{"rating": 3.0, "review": "Needs ui improvement", "verified": true, "helpfulness": "0/0", "author": "Stephen Jr"}, {"rating": 3.0, "review": "We have had a number of issues where the Fire Stick will lose connection with the wifi or say there is not enough bandwidth.  I can look at my phone or any other device and the wifi is working with a high strength in the same location as the Fire Stick.It also is slow to load some of the apps.Not too impressed with the app options compared to Roku.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"luna1174\""}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Gwen Queen"}, {"rating": 5.0, "review": "Easy to set up- easy to use!", "verified": true, "helpfulness": "0/0", "author": "Jessica Blitz"}, {"rating": 5.0, "review": "Incredible!", "verified": true, "helpfulness": "0/0", "author": "Kevin Fitzpatrick"}, {"rating": 4.0, "review": "Great little addition to my TV.", "verified": true, "helpfulness": "0/0", "author": "Jedika"}, {"rating": 5.0, "review": "I love this device!!", "verified": true, "helpfulness": "0/0", "author": "David G."}, {"rating": 5.0, "review": "Does using one of these require a lot of internet?", "verified": false, "helpfulness": "0/0", "author": "Brett"}, {"rating": 1.0, "review": "I have got the Fire TV stick shipped to Saudi Arabia and it did not work, I thought in the beginning that this is due to Saudi Arabia restriction on internet (despite the fact that i was just trying to play kids and cartoon movies), I have tried it in Egypt and UAE and it did not work.There was no warning that such device si working on in USA.I'm totally dissatisfied from that product and the fact that I have paid its cost and its shipping cost to KSA with no use.", "verified": true, "helpfulness": "0/0", "author": "Ruby"}, {"rating": 5.0, "review": "I have both the fire stick and Roku. I prefer the fire stick over the Roku. Fire stick remote is so light and flat. The control buttons are not sticking out like the Roku. It seems to be quicker than the Roku.", "verified": true, "helpfulness": "0/0", "author": "dean jackson"}]