[{"rating": 5.0, "review": "I installed this today on my not smart tv -- and voila -- movies, tv shows, etc -- all for $34.99 (on sale).  Easy to install for a non-techie -- easy to use.  It comes with a tiny remote -- few buttons and easy to use.  I then installed the free app on my iphone and can now use that as a voice controlled remote.  So simple, so easy, so inexpensive.  Made my day!", "verified": true, "helpfulness": "0/0", "author": "Big Suze"}, {"rating": 5.0, "review": "Love it..thinking about second one for travel.", "verified": true, "helpfulness": "0/0", "author": "Marsha S Banks"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "rc"}, {"rating": 5.0, "review": "How great the videos look great.  Should have bought a long time ago", "verified": true, "helpfulness": "0/0", "author": "Donna Lincoln"}, {"rating": 4.0, "review": "Good product and we enjoy using it. Nice to have our netflix on the TV now. One thing I don't like is a lot of the \"free\" apps still require a cable provider login to watch shows on them. But works good with prime and for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Katie Love"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Errick Hildebrant"}, {"rating": 3.0, "review": "The stick is functional, has a few good apps, but my opinion is that the Roku is still head and shoulders above what the fire stick offers.", "verified": true, "helpfulness": "0/0", "author": "SHAWN KERMANI"}, {"rating": 4.0, "review": "Works fine so far, fairly easy to hook up (had a little confusion)-  didn't come with explicit directions for set up and use - only use it to stream NF but it works great. beats buying a smart TV or game console to stream movies", "verified": true, "helpfulness": "0/0", "author": "SE in NY"}, {"rating": 5.0, "review": "Have enjoyed it so far!!", "verified": true, "helpfulness": "0/0", "author": "Carrie Allee"}, {"rating": 4.0, "review": "Really like the convenience of this, but really wish there was a way to add more apps to it.", "verified": true, "helpfulness": "0/0", "author": "tsmith"}]