[{"rating": 2.0, "review": "Like many of the other reviewers, I have been plagued by connectivity problems. My stick is probably 15 feet from my router (in direct line) and this thing drops the connection constantly. Even when it maintains a connection, video is choppy and stops to buffer all the time (Youtube seems particularly bad). Have spent hours trying to find a solution to no avail. It's essentially useless - glad I only paid $20 for it.Other gripe is that the UI is totally centered around Amazon video. It takes way too many clicks to launch other services like Netflix / Youtube.", "verified": true, "helpfulness": "0/0", "author": "K. McCann"}, {"rating": 5.0, "review": "Easy to install with instant gratification.  Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Eva Curington"}, {"rating": 5.0, "review": "I am able to watch all my favorite shows when I want to without ads.  I can pause the show and come back to it later.  I have been able to cancel cable and save a bundle monthly.  I just watch the news on my laptop now.", "verified": true, "helpfulness": "0/0", "author": "Amanda B. Smith"}, {"rating": 4.0, "review": "The Fire TV Stick is great! It runs all the apps very well and it is super fast at starting videos.  Especially on Netfix and Amazon Prime Video.  I am coming from an older Apple TV and the picture quality is just as good.  And for the price point it cant be beat!  My only dislike is that screen sharing with an iPhone is not inherent.  A purchasable app is required to make it work.", "verified": true, "helpfulness": "0/0", "author": "Billy Flanary"}, {"rating": 5.0, "review": "Fabulous so far. More than meets my expectations.", "verified": true, "helpfulness": "0/0", "author": "Stephen G. Frondorf"}, {"rating": 5.0, "review": "Great device!!!  Opened the box, plugged into HDMI port of the television and it welcomed me by name.  I had to wait longer than anticipated for the Fire TV Stick but that's OK as we had other devices for streaming.  It works great and the price was favorable......sorry to have missed out on the introductory super $$$ deals on the device but I suppose that's why it wasn't immediately available.  Everyone should have one of these.....and Amazon Prime too!", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "So far I LOVE my Fire Stick! It's so simple to plug in and use.", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 5.0, "review": "I really like this doorway to unlimited entertainment...my only regret is that it doesn't  have EWTN like the Roku system has.  Hopefully something will be done to fix this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The Fire TV Stick works as expected.  We haven't had time to use it a lot, sadly.", "verified": true, "helpfulness": "0/0", "author": "N. Deines \"shakleegal\""}, {"rating": 5.0, "review": "Really easy to use.  The remote is small, simple and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jim Zarifis \"Jim Zarifis\""}]