[{"rating": 5.0, "review": "Yes I love my Fire Stick I received as a birthday gift. I have watched several movies now and I know I will continue to enjoy this for years to come.", "verified": true, "helpfulness": "1/1", "author": "Beth Foster \"Foster Books\""}, {"rating": 5.0, "review": "Forget google chrome - go for the firestick. Super easy to install and use. LOVE IT", "verified": true, "helpfulness": "1/1", "author": "Sanders"}, {"rating": 5.0, "review": "Excellent device. Very convenient and useful.", "verified": true, "helpfulness": "0/0", "author": "Arafat Ahmad Qureshi"}, {"rating": 5.0, "review": "I USED TO HOOK MY COMPUTER TO MY TV SO I COULD WATCH AMAZON THROUGH MY PRIME MEMBERSHIP. SOMETIMES THE THING WOULD GET OUT OF SYNC AND I WOULD HAVE TO RESTART EVERYTHING, BUT WITH THE VAST AMOUNT OF MATERIAL AVAILABLE THROUGH AMAZON I WOULD STUMBLE THROUGH AND CARRY ON BECAUSE I LOVE TO WATCH MOVIES. I PARTICULARLY ENJOY MOVIES WITH A CHRISTIAN THEME, AND AMAZON HAS A LARGEER SELECTION BY FAR THAN NETFLIX, WHICH I ALSO WATCH. TO WATCH NETFLIX I HAD TO OBTAIN A BLUE RAY PLAYER AND THEN HOOK IT TO THE TV. IT SEEMED LIKE EVERYTHING WAS BEING HOOKED TO THE TV, AND THEN I DISCOVERED THE FIRE STICK. WOW AND WOW AGAIN. MY COMPUTER IS BACK ON THE DESK WHERE IT BELONGS, MY BLUE RAY PLAYER IS ONLY USED TO PLAY BLUE RAY DISCS. AS FOR THE FIRE STICK I FIRST FOUND OUT OF ITS EXISTANCE WHEN I WAS VISITING MY BROTHER WHO HAD A APPLE TV DEVICE AND WHEN I GOT HOME I DID A LITTLE RESEARCH AND COMPARISON AND THE LARGE VARIETY OF MEDIA AVAILABLE THROUGH THE FIRE TV STICK THAT I OPTED FOR THE LITTLE, INEXPENSIVE WONDERFULLY UNOBTRUSIVE DEVICE. WHEN YOU HAVE GONE THROUGH THE PACES AS NOTED ABOVE YOU REALLY ENJOY SOMETHING SO EASY TO USE, SO EASY, AND IT FUNCTIONS PERFECTLY OUT OF THE BOX. THE PRICE IS LOW ENOUGH SO EVERYBODY CAN HAVE ONE, AND I THINK THEY SHOULD. IT DESERVES MORE PRAISE THAN I AM ABLE TO EXPRESS.", "verified": true, "helpfulness": "1/1", "author": "John W. Prewitt"}, {"rating": 5.0, "review": "Enjoying it", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to set up spent 3 hours watching!", "verified": true, "helpfulness": "1/1", "author": "michele dolan"}, {"rating": 2.0, "review": "Great in theory but is a huge let down. lets start by saying the picture was misleading. You cannot just plug it into a hdmi, it requires a usb cord that is plugged into a wall adapter. Next the usb is on the top not the end so if you have a vga or any other hdmi or a coax plugged in it has to positioned in a way that you will use the abliity to use those other plugs. Once you have your fire stick on and working every 15 or 20 minutes the picture will freeze for a few seconds but the sound will continue, followed by the video playing really fast to catch up with the sound. This happens on amazon prime video and netflix and hulu regardless of internet wifi strength. OOOOOH i forgot to mention amazon started forcing you to watch ads before you start a movie or tv show. They are in cahoots with hbo and showtime so they will give you like one or 2 seasons of a show then trick you into purchasing the rest. So if you start a show dont get involved because you wont be able to watch the whole thing without paying. adding apps is easy, can be done from computer or the remote. If i had to go back i wouldnt have bought this although i hear roku and chomecast have similar issues. Got it on prime day for cheap. I wouldnt pay full price", "verified": true, "helpfulness": "1/1", "author": "Aaron"}, {"rating": 4.0, "review": "Works great.", "verified": true, "helpfulness": "1/1", "author": "Irish lass \"Katie\""}, {"rating": 5.0, "review": "Love the fire stick! I might buy a couple more!", "verified": true, "helpfulness": "1/1", "author": "Mike Berry"}, {"rating": 5.0, "review": "It is small, easy to set up and works great. I love it.", "verified": true, "helpfulness": "1/1", "author": "A. AKOBI \"says akobi\""}]