[{"rating": 2.0, "review": "CAUTION:  THERE IS AN OVERHEATING ISSUE.  IF THIS SHOULD OCCUR, UNPLUG, ALLOW TO COOL, AND PLUG BACK IN.  IF THE PROBLEM PERSISTS, IMMEDIATELY UNPLUG AND RETURN TO AMAZON. This means hot and not warm.  The device will be warm because it is carrying a continual current, which isn't well insulated.Review for amazon fire TV and 2 amazon fire TV sticks.I recommend the Roku 3 over these units any day.I was attracted to these units due to its voice feature, but it can only be used in the search mode, and it only works to search in amazon.  For the fire TV stick, I purchased the voice remotes at an additional cost.Yes, I know this is an amazon product, but they made it difficult to use the other apps.You will need to create an amazon account if you do not have oneFirst, you automatically open up in amazon. That is fine if you don't want to use other apps; it also wouldn't be bad if your apps went into the app library, but for some reason they don't always go there. I also had a lot of difficulty with getting Netflix to download on the Amazon Fire TV. We had to do a factory reset, and after some searching I was able to find and download Netflix, which never went into the app library. (It was suppose to be in the app library from the very start, but it has NEVER appeared there, not even after being downloaded.). Netflix also keeps disappearing, so I continually have to find it download it again and enter my account information. I have contacted customer service, but they feel like the problem is fixed, since I can download Netflix again and again and again.The Roku appears to search all or MOST of my apps for the movies or shows I want. It tells me the prices or where I can get it for free. The amazon doesn't have this feature. (I know it searches VUDU, Amazon, Netflix and Hulu Plus all at one time.)Ok, I can imagine everyone shaking their heads and thinking I got a dud. In that case, I got three duds, because I also ordered two amazon fire TV sticks, and they each were flawed in different ways. On one, it wouldn't download the software at first. Then it took two hours to download. On the other, it wouldn't download the software at first, but then I got it to work quickly (no slow download issues). The second one had the same problem as the amazon fire TV had with the Netflix, but this time it was with Hulu Plus. So there are definite quality issues. (I also set them all up on the same TV, so it wasn't related to my hardware.). All of the flaws were due to poor quality issues with the amazon products.Also, the Fire Sticks, while plugged directly into the TV, still require a power cord be attached to them to work.As for the search features on the amazon fires, it doesn't allow you to search genres in just prime.  You get everything, both the pay TV and prime (as far as I can tell).Overall, I would recommend the Roku 3 over amazon, net gear, chromecast, Sony (or other DVDs based media), or apple. While this is a great device if you only want to use amazon, it has many irritating flaws that still need debugging. However, for overall all performance and selection, I would suggest the Roku 3.", "verified": true, "helpfulness": "2/3", "author": "Kelli"}, {"rating": 4.0, "review": "Haven't had the opportunity to use it fully yet.. but so far, it has been awesome!", "verified": true, "helpfulness": "0/0", "author": "Jon Williams"}, {"rating": 1.0, "review": "FAIL!!! I was seriously hopeful for the fire stick to replace my roku boxes but it fails on the very basic level of not having access to my local NAS drives where all of my movies, tv shows, music, et al live. how on earth does amazon expect to compete with all the other streaming sticks yet omit this most basic necessity?! if they don't announce an update including local nas access, both fire sticks are going back!!!", "verified": true, "helpfulness": "0/0", "author": "friede \"über geek\""}, {"rating": 1.0, "review": "several issues1. have to watch video2. downloads update when 1st connect.  why can't stick be shipped with update3. have to reconnect with network after update4. slow response to remote. Hit 5 keystrokes before the unit responded to all 5.  I thought system had frozen.5 still can't log on to Netflixusually very satisfied with Amazon, but this can't compete with Roku stick, Chromecast or Apple TV, which I own all of.  Huge disappointment.  Will be returning", "verified": true, "helpfulness": "1/2", "author": "Chas \"satisfied customer\""}, {"rating": 1.0, "review": "The setup was easy and connection was established to my WiFi without a problem. However, I don't get the full sound on Home Theater System. I guess this device is designed to work only when it is hooked up to the TV directly, but not to a home theater system with external speakers.", "verified": true, "helpfulness": "3/4", "author": "Albert Gabri"}, {"rating": 5.0, "review": "Excellent product for the price, would recommend friends to buy!!!!", "verified": true, "helpfulness": "0/0", "author": "Abid A. Kazi"}, {"rating": 4.0, "review": "I bought an ouya last year, and was very disappointed in it, however this little device is everything my ouya should be.  It has lots of games, play movies, music, and allows screen mirroring.  The only thing it is missing is native apple airplay support, but that aside, it is a great device.Side bonus.I was able to pair my ouya controller to the fire tv stick, so now it is an absolute dream.", "verified": true, "helpfulness": "0/0", "author": "ME?"}, {"rating": 5.0, "review": "Really nice! Fire TV Stick has an abundance of content and I'm very pleased with it.", "verified": true, "helpfulness": "0/0", "author": "B Henry"}, {"rating": 4.0, "review": "Set up was easy as pie. I wish they gave me the option to get the voice remote by replacing the normal one instead of having me get both (so it would offset the price some).Once HBO GO is offered a la carte, I hope they add the app in here. If not, this will definitely be a \"no go\" for many.All in all, I think this device represents value for the money if you're an Amazon Prime member. And the specs are definitely better than the Roku stick.", "verified": true, "helpfulness": "0/0", "author": "WONREDSTICK GUY \"WONREDSTICK GUY\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "..."}]