[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Frank Crockett"}, {"rating": 5.0, "review": "Wow this little device is amazing!!  How wonderful my life has become now that I am able to watch (and listen) to Prime content on the main TV.  Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Karen L."}, {"rating": 1.0, "review": "The stick is too slow and it can never stay connected to the internet. I'm sending it back and I'm purchasing another Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Robert Gonzalez"}, {"rating": 5.0, "review": "Awesome this made my TV viewing opportunities much more. I can even use other apps like I heart. Radio. This made my TV like the one I have with the Internet all ready in it.", "verified": true, "helpfulness": "0/0", "author": "John Robarge"}, {"rating": 5.0, "review": "Love the way this works. No delay after selecting something to view. Movies start playing immediately and with great HD quality.", "verified": true, "helpfulness": "0/0", "author": "MSpud99"}, {"rating": 5.0, "review": "Installed in now time! Remote takes very little time to understand as well!", "verified": true, "helpfulness": "0/0", "author": "Doc McIntire"}, {"rating": 1.0, "review": "This loose internet connection all the time and harder to search for the movie I want.  6 months into owning this and the remote stops working!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "it ok .", "verified": true, "helpfulness": "0/0", "author": "keith moland"}, {"rating": 5.0, "review": "Worked much better than I expected.", "verified": true, "helpfulness": "0/0", "author": "Terry Schoenholz"}, {"rating": 4.0, "review": "Update: never shoot first ask questions later, never express opinions while angry, one runs the risk of making a fool of himself. The operation problem previously described turned out to be me, not my fire stick. My previous crucifixion of fire stick is unfair. although still second best it wouldn't take much to make it superior. More user friendly menu, a channel store with as many options as the competition your there.  In all other transactions with Amazon it has been obvious they're concerned about providing quality, I have little doubt these issues will addressed and fire stick will be the best. The remote already is regardless of switch bounce. Four stars is fair.", "verified": true, "helpfulness": "0/1", "author": "ron"}]