[{"rating": 5.0, "review": "I bought this as a Father's Day gift, but my kids have used it mostly. It's a nice way to get Prime TV etc. on a big screen without having to connect computer. So far, so good. I don't like that the stick has to be plugged in to wall socket, it just makes for more confusion in the cord jungle that is behind TV, but that's no big deal really.", "verified": true, "helpfulness": "0/0", "author": "MRM"}, {"rating": 3.0, "review": "Pretty good. Not as many channels as Roku, but the channels it has work well.", "verified": true, "helpfulness": "0/0", "author": "Kari Langkamp"}, {"rating": 5.0, "review": "Amazing product, I'm able to watch every TV show and movie that I want at any time!", "verified": true, "helpfulness": "0/0", "author": "carlos cervantes"}, {"rating": 5.0, "review": "We've been trying to decide between a number of competing products in this category and had to accelerate our decision before an upcoming road trip so we'd have the ability to watch movies in hotel room(s) without the nearly $20 movie prices at most hotels.  The final choice for the Fire TV stick came down to our heavy use of Prime and Netflix.  Product shipped fast and my Amazon Prime Acct info was already loaded so we were up and running in minutes.  We had standard hotel broadband and had no issues watching Netflix movies/shows on our trip.  One tip if you plan to use this in hotels - take a 8-10 foot extension cord with you!  Many of the hotel entertainment stands are heavy or secured in place making it very difficult to reach the outlets behind the tv so having a cord you can run to an easily accessible wall outlet will save you a lot of frustration and maybe even your back!  Extremely please with this purchase!", "verified": true, "helpfulness": "0/0", "author": "SCarolinian"}, {"rating": 5.0, "review": "Works great & gives me channels that I could otherwise not get overseas!", "verified": true, "helpfulness": "0/0", "author": "Dave In Arizona"}, {"rating": 4.0, "review": "Great if u r using Amazon but not that good if u use Netflix.", "verified": true, "helpfulness": "0/1", "author": "Ruth C. Coburn"}, {"rating": 5.0, "review": "I  am very pleased with my Fire TV Stick.I don't watch a lot of Television so I don't have cable, now when I'm in the mood for TV I know l will be able to find something to watch with my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "DW2"}, {"rating": 5.0, "review": "Works great - little to no buffering at all operating on Comcast Wi-Fi signal. Happy with it!", "verified": true, "helpfulness": "0/0", "author": "Daniel Leach"}, {"rating": 1.0, "review": "Would have been nice if I could use it. There was no stable connection between the stick and my wireless connection. I understand this is a big problem having to do with the security type on wireless networks. I don't want to deal with all that.", "verified": true, "helpfulness": "0/0", "author": "Jaime O."}, {"rating": 5.0, "review": "This is the best streaming stick for the price. I love this thing and you can use both 2.4ghz and 5ghz. Best money ever spent.", "verified": true, "helpfulness": "0/0", "author": "Mannie Fresh"}]