[{"rating": 1.0, "review": "VERY BAD QUALITY---POWERS OFF, FREEZES....OVER HEATS---WILL BE RETURNING SOON", "verified": true, "helpfulness": "1/2", "author": "vicky lakhati"}, {"rating": 5.0, "review": "Use through Xbox One HDMI pass through:I have standard definition cable, so the Xbox One's HDMI pass through was pretty much useless to me. I picked up the Fire TV Stick from Amazon on a whim for $19.99 during their pre-order special for Prime members. This thing is fast. I used to use a Chromecast, and now it's going to collect some dust because the Fire TV Stick has replaced it. Now I can snap some Amazon Prime Videos in the corner of my screen while playing a game on my Xbox. Its really cool. Its great for turning on some tunes too with Prime Music. Just don't try any \"active\" games on the Fire TV while using it through an Xbox. The input lag is about 500 milliseconds. That fine for the UI, but not for games.Use on its own:This streamer is awesome for Amazon Prime Members. Shows through Amazon buffer almost instantly. Great device!", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 5.0, "review": "This device is 10 times better than a chromecast. I had one for about a week, and returned it because it's only purpose is to blow up some apps on your phone.The fire TV stick can be completely independent, the remote works GREAT, is designed very intuitively (can use in the dark on the first night; controls are where you'd think) and phone integration works great too.I would definitely buy this again.I'll update my review if I ever have a problem", "verified": true, "helpfulness": "0/0", "author": "SatEotU"}, {"rating": 4.0, "review": "I can only compare to the older roku, chromecast and my Xbox one but it's kinda like they all had a baby. Excellent processing makes it fast. The interface is clean and strait forward making it easy to find what you want. The size makes it portable. Overall very please with this purchase. (Biased in that I got the early prime member discount and only paid $19)", "verified": true, "helpfulness": "0/0", "author": "James Bitting"}, {"rating": 3.0, "review": "It is a good product and a worthy competitor to Chromecast but it badly needs a YouTube app! How hard is it to do that Amazon? I like the feel of the remote and it is really nice to navigate using it. This is a must have if you have Amazon prime membership, not so much otherwise. I have two tvs, one running with ChromeCast and the other has Fire Stick and I guess I have the best of both worlds that way.", "verified": true, "helpfulness": "0/0", "author": "ranjith"}, {"rating": 5.0, "review": "So far so good, easy setup. I haven't noticed any bugs and picture and sound quality are good. Have yet to load any of the apps though so can't comment on how they perform. I would say I am satisfied with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Richard Hutton"}, {"rating": 5.0, "review": "So easy to set up! Works just the same as Fire TV, but without voice feature. I have this on a smaller TV in a guest bedroom. Now I have Fire TV everywhere! If you don't have one already, be jealous.", "verified": true, "helpfulness": "0/0", "author": "MTCUBED66"}, {"rating": 5.0, "review": "It's awesome, side load XBMC and this is thing BLOWS the chromecast out of the water.", "verified": true, "helpfulness": "0/0", "author": "DayLateDollarShort"}, {"rating": 5.0, "review": "I hooked this up on our bedroom TV so our son can watch Amazon Prime and other streaming material in our bedroom. That leaves the bigger front room TV for my wife and me.  Set up was easy, once I realized I wrote down the WiFi password wrong.  It has worked flawlessly since set up and has gotten a lot of use in the short time we've had it.  I would definitely recommend this item.", "verified": true, "helpfulness": "0/0", "author": "Ezrway"}, {"rating": 1.0, "review": "ORIGINAL REVIEW: Just ok. I have used the unit for about a week. Overall it is cheap, the content is very good and unit is responsive. I am not happy with the power set up. The stick comes with a power brick and a fairly short cord, which means one needs an outlet nearby and the cord clutter increases. I tried connecting to a USB port on the TV (LED FH6030 Samsung), but I received and error message that the power was insufficient. While the stick still worked, it was only intermittent and the signal was not the best.In the end, I purchased this instead of the bigger boxes (Roku, Fire TV, Apple TV) because I wanted something confined to the TV and reduce clutter. The Fire Stick did not fit that role.UPDATE. I lowered my rating from 3 to one star after two months of use. The device has terrible connection issues even when using the power adapter and dongle. Most times I try using it, I get a spinning icon and/or a notice of a network connectivity problem. The problem is surely with the stick not my network as while the problem occurs I can connect a Roku or AppleTV on the same TV to the same WiFi without issues. The only way to fix this is to unplug the device and plug it back in. Extremely inconvenient and frustrating. Definitely not a good device. Don't waste your money.", "verified": true, "helpfulness": "0/0", "author": "Mek \"MeK\""}]