[{"rating": 4.0, "review": "Pretty good device. I switch between this and my Chrome cast.The Fire Stick is good replacement to my Apple TV, its easy to use with the remote and menu as compared to a Chrome Cast where you need to explain to users how to push video from a tablet/phone.I do notice it gets overloaded at times and crashes with some of my favorite apps like Plex so I have to fail back to ChromeCast sometimes.", "verified": true, "helpfulness": "0/0", "author": "Chris Hansen"}, {"rating": 5.0, "review": "Love it ... Great product .. Great price .. Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Kim Roy"}, {"rating": 4.0, "review": "It's a great solution and very straight forward to operate.  The only thing that kept it from being 5 stars is that Netflix is an application like any other and now and then, you need to re-enter your user name and password.  Makes sense I guess since it's the \"competition\", but in general, it was well worth the $20 I paid when introduced.  Even at the current price, it's well worth it.  It was easy to pair my laptop and phone and like the fact that you can send any youtube video from your laptop to your TV and that your phone can be a remote with voice.I was also pleasantly surprised that you can operate it easily with the remote even though the stick is behind your TV.  The remote navigation is a bit tricky to get the hang of, but you get it fairly quickly.  It was also easy to \"pair\" my phone with it so that it too can operate as a remote.  That is also nice because it also allows you to speak to a search just like the more expensive remote.", "verified": true, "helpfulness": "0/0", "author": "D. J."}, {"rating": 5.0, "review": "This is better than cable, dish and direct TV!! Love it!", "verified": true, "helpfulness": "0/1", "author": "Chriss"}, {"rating": 5.0, "review": "A", "verified": true, "helpfulness": "0/0", "author": "Cameron B. McKay"}, {"rating": 5.0, "review": "Easy to use and set up. The fire tv stick is very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Pmorphy \"pmorphy\""}, {"rating": 5.0, "review": "Works great with my insignia tv. Streams fast. Was so easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Michelle Fowler"}, {"rating": 5.0, "review": "Awesome product so far!", "verified": true, "helpfulness": "0/0", "author": "Linds"}, {"rating": 5.0, "review": "i love the amazon fire stick! so thats why i ordered 2 more amazon fire sticks so my kids have them for in their bedromms!", "verified": true, "helpfulness": "0/0", "author": "Heather Marie Bell"}, {"rating": 5.0, "review": "For $39 you can't go wrong. Slick looking. Great packaging. I was very surprised with how fast it isand responsive .... very happy with the 8GBand love the interface. Amazon continues to update and with Amazon Studios we will see moreAMAZON original series. The remote is good. Bit difficult to open the back to place the battery.Overall ..I have been using this product for over a week now and very satisfied. Highly Recommend this product !!", "verified": true, "helpfulness": "0/0", "author": "FABIO A PENA JR"}]