[{"rating": 2.0, "review": "Buffering is awful on Netflix. Had I known how crappy this was I wouldn't have spent the $50. Should have returned it. Amazon prime doesn't have near the amount of free movies netflix does so I prefer netflix.", "verified": true, "helpfulness": "0/1", "author": "barb dilliard"}, {"rating": 5.0, "review": "We use this at our cottage for Netflix and more! It is fantastic technology and will save us tons on our cable bill. I am also able to access my premium channels from any tv that I install the fire stick on- which is nice... The interface is simple enough for my 6 year old to navigate.", "verified": true, "helpfulness": "0/0", "author": "Steven A. Wambaugh \"S. Wamba\""}, {"rating": 1.0, "review": "I have had constant problems with the Fire Stick since I purchased it.  Apps and videos freeze, pause, restart, freeze again, etc.  Often I get a \"video error\" when watching certain news apps.  VERY frustrating.  I have tried ALL of the trouble shooting suggestions from Amazon and everyone else and nothing works.  I e-mailed customer service and they suggested I call them.  I HATE calling anyone's customer service only to be told to do the exact same things I have already done.  My Internet connection is strong, there is nothing wrong with my TV, etc..... VERY frustrating.  I really wanted to like the Fire Stick so that I can disconnect from COMCAST completely.", "verified": true, "helpfulness": "1/1", "author": "d still"}, {"rating": 5.0, "review": "Simply perfect. Does everything I need. Wish I could connect with my laptop/tablet without internet access. Also would be nice if Bluetooth capable for headphones or had a headphone jack on remote. But not a big deal.", "verified": true, "helpfulness": "0/0", "author": "kenneth n"}, {"rating": 5.0, "review": "Love the Fire TV stick and you can't beat the price!", "verified": true, "helpfulness": "0/0", "author": "Nils Smith"}, {"rating": 1.0, "review": "I still can't figure out what it is for and what it does for me that me smart TV didn't already do. I really tried to read and understand the description on the web, but it didn't make sense to me. I guess I am technically challenged.", "verified": true, "helpfulness": "0/0", "author": "Neil A Lash"}, {"rating": 1.0, "review": "I am so unbelievably disappointed with this unit. I bought the stick to view Netflix and it continuously stops mid viewing to stream stops at 25% and then gives an error.  I have reviewed other posts about this problem and the general consensus is that Netflix and Fire TV stick need to get their act together and fix the bug. Otherwise I would absolutely love this technology. I do not understand why this is a problem. I would love to hear any fixes but so far nothing helps.", "verified": true, "helpfulness": "0/0", "author": "Michaela E. Fry"}, {"rating": 2.0, "review": "The Amazon Fire Stick constantly buffers, making it nearly worthless. Very, very frustrating to say the least.", "verified": true, "helpfulness": "1/1", "author": "Nathan L Shumate"}, {"rating": 3.0, "review": "While this device definitely has the technical horsepower advantage over the Roku stick, there is much room for improvement.Pros (Where my Fire Stick wins):-Very snappy, you can tell the Fire Stick has better tech specs than the Roku Stick.-Comes with an HDMI extension.-More games on Fire Stick.Cons (where my Roku wins):-For one thing the home interface is terrible. It is very cumbersome and just not pretty at all.-Search will only search Amazon Prime content, not Netflix, Starz, Plex, etc.-Apps are listed in a long line, so if you want to go to an app you haven't used in a while you have to scroll through every one.-The same apps are listed in different categories... It doesn't sound bad but it's annoying to me.-Lots of apps listed on the front page that aren't really useful for the Fire stick (VLC, File browsers, etc)-Movies and TV tabs only list Prime content-Apps that I don't own are listed in my front page, there is no \"store\". Undownloaded apps riddle and clutter the home screen.-I GET AN EMAIL EVERY TIME I DOWNLOAD AN APP!!!!!Push:-Streaming quality is great on both.-Remotes are basically the same.-Similar streaming apps, the Fire page lists that the Roku doesn't have an official Twitch app... But Roku does in fact have an official one now.In conclusion, these two devices do basically the same thing. However I MUCH prefer my Roku to the Fire TV. When I search for a show from my Roku home screen it lists all of my subscriptions that I can watch it on. It seems like Amazon is pushing prime way to hard on this device instead of offering an all-in-one streaming device that gets you to the right app for the show/movie you are looking for. It looses one star because of this.It looses the second star because the interface is just plain ugly. Fix this and you gain at least one star back. Maybe fixing this will help with my first complaint... Not to mention cut my cons list by at least half.", "verified": true, "helpfulness": "0/0", "author": "Jared"}, {"rating": 5.0, "review": "From my Wii U, to my BluRay, to my native TV apps, there are no shortage of options to stream stuff in my house. This wins by far because of the interface and simple remote. It also has all the big apps I use.I am insanely grateful for the screen saver, having a plasma TV and a wife that does me care about my burn I'm terror. This takes the fear away when she pauses. :)", "verified": true, "helpfulness": "0/0", "author": "Buda"}]