[{"rating": 5.0, "review": "excellent product, very fast and reliable. love it!", "verified": true, "helpfulness": "0/0", "author": "Saul Gudino de la Torre"}, {"rating": 5.0, "review": "This is a very nice, easy to use device.  I can't wait for the iOs app so that I can drive it from my iPhone.", "verified": true, "helpfulness": "0/0", "author": "JRB01"}, {"rating": 5.0, "review": "Totally awesome!  My family was quite surprised w this early gift;) as they did not expect it- score 1 mom;) took seconds for my husband and son to set up and w my prime membership too many movies to count. I am getting a second one for my bedroom as I love this product", "verified": true, "helpfulness": "0/0", "author": "L. Whittaker \"gatormom\""}, {"rating": 5.0, "review": "I had purchased a roku stick prior to this one and it failed terribly.  I thought I would try this one in my daughters bedroom on her tv, and LOVE it.  She loves the ability to play games as well as watch her favorite shows.  so far it is working out wonderfully for us.  I am thinking about buying another one for the living room so I can get rid of cable all together.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Rebecca Stinnett"}, {"rating": 5.0, "review": "The Fire TV stick arrived earlier than originally expected, but seems to work very well.  The only confusing thing is that some features require bit coins to activate without a clear path to obtain them.", "verified": true, "helpfulness": "0/0", "author": "Robert Brown"}, {"rating": 5.0, "review": "Easy to use. Fantastic selection - TV - Movies - Music and my photos!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "There is something about this stick that makes my router die EVERY TIME WE USE IT. If we are not using it the router is fine. The minute we watch movies on the fire stick it dies.", "verified": true, "helpfulness": "0/1", "author": "SimplyAtomic"}, {"rating": 5.0, "review": "I was so happy with the fire phone that I purchased the fire tv stick and wow for a tiny thing it's fantastic keep up the good work Amazon!👍", "verified": true, "helpfulness": "0/0", "author": "Charles C."}, {"rating": 4.0, "review": "Great for TVs lacking apps. Beware of purchasing by mistake!", "verified": true, "helpfulness": "0/0", "author": "GameDesignDude"}]