[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Robert Galante"}, {"rating": 1.0, "review": "It was missing Cinemanow. It has to be unplugged after use. Was not worth the money..", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "makes it so easy to get netflix and prime movies on your tv. amazing picture quility.", "verified": true, "helpfulness": "0/0", "author": "LENNY VENITO"}, {"rating": 4.0, "review": "Love my fire tv stick! So much better than roku.", "verified": true, "helpfulness": "0/0", "author": "PattyPetitti"}, {"rating": 4.0, "review": "Remote was sticky at first but better now.  Not as many apps as I thought it would have.  VERY easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "seems to have connection issues", "verified": true, "helpfulness": "0/1", "author": "Fabtastic"}, {"rating": 4.0, "review": "This is a really good streaming stick. It has a really aesthetically pleasing set up and runs smoothly for the most part. There are glitches sometimes when running Netflix, but nothing major. I like the fact that it has a remote and you can use your smart phone to type in searches and control content as well. I wish it had more apps (like Vudu), but overall it is excellent for the price I paid.", "verified": true, "helpfulness": "1/1", "author": "Greg Williams"}, {"rating": 1.0, "review": "It doesn't work as good as I was thinking in Costa Rica.. I can't use crackle, nor the application to the phone because it is not available for my country (Costa Rica)... So I think Chromecast it's better than Fire tv stick....", "verified": true, "helpfulness": "1/2", "author": "Greivin Bejarano Loria"}, {"rating": 5.0, "review": "This thing is slick and works great with Sling TV", "verified": true, "helpfulness": "0/0", "author": "Fred Behning"}, {"rating": 5.0, "review": "Absolutely love the Amazon  firestick!! It replaces a cable box that just shows repeated tv shows or reruns on movies. With the firestick I have different choices on movies ,tv shows , games ,music etc . Best part is there is no monthly fee its included on the Amazon prime!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]