[{"rating": 4.0, "review": "Works really well. I may purchase a 2nd for another tv?", "verified": true, "helpfulness": "0/0", "author": "joro67"}, {"rating": 3.0, "review": "Keeps stopping when other apps are being used", "verified": true, "helpfulness": "0/0", "author": "Ozzie T."}, {"rating": 5.0, "review": "I am surprised and pleased.  Easy to setup and use.  Nice addition to my basic cable.  Refuse to pay a ton for premiums.  Lots to choose from.  Glad I purchased it.", "verified": true, "helpfulness": "0/0", "author": "redhead"}, {"rating": 5.0, "review": "Easy to use and install. Works great for what we planned to use it for.", "verified": true, "helpfulness": "0/0", "author": "shell22"}, {"rating": 4.0, "review": "I probably have more than 10 different ways already to view streaming media and movies... so why not add another?I currently have my laptops (Macbook Pro and PC), a PS3/4, a Wii u, a PS Vita, a 3DS, a smartphone, 2 tablets, a Chrome cast, an Apple TV, and a smart tv... now, what does the fire stick bring that my current devices can't? Honestly, nothing. It does what any of my other devices can. Regardless, it's a nice little addition to the guest room that I bought it for.First off, the interface is fast and very responsive. It's a lot faster than my outdated 2010 Apple tv. You simply plg the USB shaped stick into any available HDMI slot, plug in the AC adapter into the stick, and plug the other into an available outlet and you're good to go.When you turn it on, it will prompt you to register your stick to your Prime account (If you have one). This takes about 2-3 minutes. This is mainly so you can watch all of the movies that you have on queue or want to purchase.I chose a random movie and clicked play. The movie started almost immediately, and the movie played in HD pretty well. There were a few drops where I saw it drop from HD to SD. I guess that was a latency issue. For the most part, it was pretty stable.The sound was loud and clear during my movie playback.The remote that comes with the stick has a very simple layout. The remote too is responsive.Like with most other streaming devices, you can download apps and games. I downloaded a few apps to watch clips and such, and the apps were available on the main screen after it is downloaded. I don't really have any complaints about the device. I got it on the pre-launch Prime member exclusive $19.99 price, so there's really nothing to complain about.", "verified": true, "helpfulness": "0/0", "author": "Ethan H."}, {"rating": 5.0, "review": "I love the fire stick, its amazing.  My kids love it too, thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Mar"}, {"rating": 4.0, "review": "Learning more about the fire stick all the time. Liking it more and more......", "verified": true, "helpfulness": "0/0", "author": "Skb"}, {"rating": 2.0, "review": "It doesn't hold a WiFi connection, what's the point of having it if I can't watch anyway; my roku play's like a champ on the same WiFi and I get 20 MBPS one it", "verified": true, "helpfulness": "0/0", "author": "Keith Williams"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Timothy  Mcphan"}, {"rating": 4.0, "review": "Since I'm never home, this was a great alternative to cable.", "verified": true, "helpfulness": "0/0", "author": "Marlene Hodos"}]