[{"rating": 3.0, "review": "there were some TV shows I wanted to watch but you had to pay additional for them, very few TV shows to watch that you don't have to pay extra for", "verified": true, "helpfulness": "0/0", "author": "Reggee"}, {"rating": 5.0, "review": "LOVE this contraption!! The movies, shows and works so well. I've considered canceling cable because I mostly use this.", "verified": true, "helpfulness": "0/0", "author": "sarah Doherty"}, {"rating": 4.0, "review": "JW Broadcasting, a major streaming favorite of mine, is missing from the Amazon Fire TV Stick. I was very disappointed at that omission because I can access JW Broadcasting on all my smartphones and tablets, and even on Roku and Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Melvin D. Craig"}, {"rating": 5.0, "review": "nice addition", "verified": true, "helpfulness": "0/0", "author": "timothy w reilly"}, {"rating": 5.0, "review": "Fine", "verified": true, "helpfulness": "0/0", "author": "William G. Smith"}, {"rating": 5.0, "review": "After much frustration with my Samsung SMART TV losing its connection with my wireless router, a friend suggested I purchase an Amazon Fire TV Stick. Great decision! I now can watch Netflix and other internet apps without losing connection. Wish I had know about it sooner!", "verified": true, "helpfulness": "0/0", "author": "Ron Maz"}, {"rating": 3.0, "review": "The usage of the stick was fine and easy.  I bought this to watch Amazon VOD Prime videos.  The biggest issue is that the Amazon VOD app mixed paid and free content, so you get stoked on a show, only to find out that it's not a free show.The Netflix interface is better on the Apple TV gen 2, so I use that for Netflix instead of the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "matthew c bennett"}, {"rating": 3.0, "review": "Its OK for what it does, but I prefer the Chromecast.  If the phone\\tablet app had actual features like searching for titles and such it would be MUCH better.  Fumbling around with the remote is irritating.  Compared with the Chromecast where I can find what I want on my tablet and push it to the TV without disrupting what it currently playing.", "verified": true, "helpfulness": "0/0", "author": "AJ Fav"}, {"rating": 5.0, "review": "Works great!  Love it!", "verified": true, "helpfulness": "0/0", "author": "Tracy L. Petersen \"Bobsey\""}, {"rating": 5.0, "review": "Perfect price for accessing Amazon Prime/Amazon content.  Great for access to apps like Netflix too.  Used on Sharp smart TV,  where Amazon app is not loaded nor download able.", "verified": true, "helpfulness": "0/0", "author": "Michael German"}]