[{"rating": 1.0, "review": "Really Amazon, no Dish network or Direct TV? One of the main reasons I bought the fire stick was for the Showtime Anytime app and lo and behold, I cannot use the app because Dish network and Direct TV are not listed as service providers. How is that possible in 2014?  Almost everybody has Dish or Direct TV, well except for Amazon. They had a message stating that if you didn't see your TV provider listed, then it does not currently support Showtime Anytime. That may be true for Dish Network but I'm certain that Showtime Anytime is available on Direct TV, be it a laptop, tablet, phone or video game system, apple to and even roku. Just not on the Amazon Fire Stick. Why Amazon? Why does the Showtime website list Direct TV as a service provider, but you don't?", "verified": true, "helpfulness": "1/2", "author": "Raymond L. Shepard"}, {"rating": 2.0, "review": "The fire stick worked great for the first few weeks and then slowly one fine day it froze up. I restarted the device and all was well for a little bit. The frequency of this problem started increasing with each occurrence. The only way to get the device to work is to unplug it completely. I do not know if the whole line has issues or if I was unlucky enough to get the malfunctioning one. I am just glad I didn't pay full price for it and got it on sale!!", "verified": true, "helpfulness": "1/2", "author": "shriya"}, {"rating": 2.0, "review": "Our Stick worked with videos from Netflix and Amazon Prime the first day. The next day we could not get any video. I called tech support and we ran several tests to correct the problem. All to no avail. Then the tech asked how old our tv set was. We bought it in 2008. He told me all TV's had to be from 2011 forward. This caveat should be plainly shown in the material. No explanation could be given as to why we had good service the first day.", "verified": true, "helpfulness": "1/1", "author": "duffer77"}, {"rating": 1.0, "review": "Well mine only lasted a couple weeks. Netflix started hitching more and more and after a couple days of doing that a movie just stopped buffering completely. I went back to main home page on the device and then it went blank and never came back. I tried  unplugging the device from the TV and the power cord from the wall and back in but no luck. My TV knew something was plugged in as it would say 1080p but again nothing but a blank screen so the device is certainly dead.", "verified": true, "helpfulness": "2/2", "author": "robert edwards"}, {"rating": 5.0, "review": "Quick, easy installation.and setup.  Provides a huge variety  of catagories and programs within esch.", "verified": true, "helpfulness": "0/1", "author": "SD"}, {"rating": 5.0, "review": "Works well, use for Prime Instant Video, Netflix, and Plex.  All work well.", "verified": true, "helpfulness": "0/0", "author": "William Dupuie"}, {"rating": 5.0, "review": "Pleased", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Update 5/10/15 - I decided to give it a shot one more time hopeful that maybe software was updated in the last five months.  Here is my update.  Plugged it in and waited for the software update, took THREE hours and 10 Minutes to download via DSL.  Installed the download and unplugged and plugged it back in.  Attempted to play The Pacific via Prime, got a message about my connection being too slow and It lost my wifi about 5 times,  I cleared the cache for Amazon video and tried again, got the same message about connection too slow  but proceeded anyways.  the show ran it's entire length without buffering.  Tried Hulu and that also worked, other than some issues with the commercials.  So I am changing my review to 3 stars.  It's still not as good as Roku LT, but at least you can play Hulu and Prime without the constant buffering.  I'd like to review this after a few more days, but I'm turning off DSL this week and installing CABLE on Tuesday.  I'd still stay with Roku if you have DSL, maybe try Fire TV after a couple more updates.Original review in Dec 14 -Ok, I plugged it in and first off it updates the stick.  It took 1 hours and 45 minutes to update..Definitely not ready for DSL.  I finally got to log into my prime account and started an episode of Enterprise Season 2.  It ran for about 30 seconds and then buffering, another 30 seconds and more buffering, finally it displayed a message saying my internet was too slow for Prime.  At that point I plugged my Roku LT back in and watched the exact same episode with no buffering, no issues.So I guess with DSL it is better to have a single core, single band, 512 MB Roku than a dual core, dual band, 8 GB Fire Stick.Very disappointing.  Unusable for me..", "verified": true, "helpfulness": "1/1", "author": "mike in mass"}, {"rating": 2.0, "review": "I would suggest waiting until more app functionality is released, especially with regarding streaming videos from websites. For users that like to get their media fix outside of the standardized apps such as Amazon prime, netflix, hulu, or whatnot I think you are better off with an HTPC, laptop, or perhaps a chromecast (I find chromecast to be rather buggy and slow though). I don't have another fire device so perhaps if you had a Fire tablet it would be more convenient to cast videos you are watching.", "verified": true, "helpfulness": "1/1", "author": "KL"}, {"rating": 5.0, "review": "Easy to use- plenty of available apps!", "verified": true, "helpfulness": "0/0", "author": "George"}]