[{"rating": 5.0, "review": "Great product. Easy to set up. Variety and options are great!", "verified": true, "helpfulness": "0/1", "author": "robert reyna"}, {"rating": 4.0, "review": "very easy to set up. picture quality is very good. Purchased this to utilize the sling tv app.", "verified": false, "helpfulness": "0/1", "author": "Kristi Graupman"}, {"rating": 5.0, "review": "I have mine pluged into a repeater, I use it in the living room and the bedroom. The remote is RF, so it works through walls, seems to work well at 40 feet. My DSL runs at 2 to 2.5 mb, the fire stick works great with no buffering.", "verified": true, "helpfulness": "0/1", "author": "Donald H"}, {"rating": 5.0, "review": "I freaking love it!", "verified": true, "helpfulness": "0/1", "author": "Scott27"}, {"rating": 5.0, "review": "Works great. Lots of options available to watch. I love it so far.", "verified": true, "helpfulness": "0/1", "author": "Jeffrey D Christian"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "sean ray brazeal"}, {"rating": 5.0, "review": "great addition to our home video set up", "verified": true, "helpfulness": "0/1", "author": "Gordon Crow, Jr."}, {"rating": 2.0, "review": "I purchased this to watch hulu and hbonow on my tv. The hulu playback stutters constantly and although hbogo is supported, hbo now is not. The interface is quick and easy to navigate, but lacks any customization options.", "verified": true, "helpfulness": "0/1", "author": "kenneth chatman"}, {"rating": 5.0, "review": "I wasn't sure that I would like it better than my current Roku, but now I am sure. This Fire TV Stick is great! The on screen screen setup instructions were easy to understand, although it's easy enough to setup without them. It's more responsive than the Roku. The UI only took me a day or two to get accustomed to as well. Great product! I'll be purchasing more to swap out my remaining Roku boxes!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Not really sure why I waited to purchase the Fire TV Stick, and I had high expectations of this product so for it to exceed those expectations is unexpected.  Usually I wait a few months to make a review as a few days or weeks isn't enough time to test out a purchase, however in this case I'm extremely pleased with my purchase and expect you will be too.", "verified": true, "helpfulness": "0/1", "author": "Joseph R. Hertel"}]