[{"rating": 5.0, "review": "The firfire stick is great.  I like the compact size.  It was very easy to install and works great.", "verified": true, "helpfulness": "0/0", "author": "Mary Dowrick"}, {"rating": 5.0, "review": "Works like a charm. Glad to have amazon media library available on my TV w/o needing to connect a computer.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love our new stick.  Much easier to access our digital movies than trying to go through our Wii.", "verified": true, "helpfulness": "0/0", "author": "Kristy Spence"}, {"rating": 1.0, "review": "Not long enough cord to reach where the TV is to an available outlet. Not easy navigate. I much rather perfer my Apple TV", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 3.0, "review": "--------------------------------------------**EDIT** The longer I have this thing the less reliable it is. It worked great for the first few months, but now it freezes and/or reboots at least a few times a week. The interface is simple so the kids still use it, but I have gone back to using a PS3 as my primary streaming device.--------------------------------------------A little bigger than expected but it fits into one of my TV's HDMI ports without the dongle. Like others have noted, the TV's USB port won't provide sufficient power, so you're stuck using the provided adapter. On the bright side, it's a very nice 5W adapter.Setup is a snap. If you can plug in an HDMI cable, you can set up this device. It did a good job of staying connected to my WiFi even from behind the TV, and my router is across the house on a different floor. Very impressive for such a small device!I don't have a current-gen Roku, Roku Stick, ChromeCast, or Apple TV to compare the performance, but it loads content faster than I expected. Netflix and Hulu+ load content even faster than my PS3!App installation is easy, even if the app selection interface isn't ideal. It still works well, though, and is intuitive enough to not cause any issues. After watching a few videos I spent a couple of hours playing games with the simple non-gaming remote and it was surprisingly entertaining.Over I am very satisfied with the Stick, especially at the 50% off pre-order price. If you have a dumb TV that needs some new life you should definitely check this out.", "verified": true, "helpfulness": "0/0", "author": "B"}, {"rating": 5.0, "review": "Great product at a great price.", "verified": true, "helpfulness": "0/0", "author": "Timothy J Little"}, {"rating": 3.0, "review": "This product is great for viewing Amazon content - especially Amazon Instant Video.  It is pretty good accessing other apps like Pandora and Netflix.  I really like that it has a remote control.On the downside - I wish it supported YouTube video (a big hole) and the layout of the UI is confusing and unorganized.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Moomaw"}, {"rating": 5.0, "review": "Only had it a short while but it was very easy to set up and start using.  No complaints!", "verified": true, "helpfulness": "0/0", "author": "Kirby Konz"}, {"rating": 5.0, "review": "I have been using chromecast for some time and I love it. The fire stick has taken the idea and made some improvements. I'm impressed. Works great with the android fire stick app also.", "verified": true, "helpfulness": "0/0", "author": "Eugene Armstead"}, {"rating": 4.0, "review": "Works Great!!!", "verified": true, "helpfulness": "0/0", "author": "James"}]