[{"rating": 4.0, "review": "So far so good. Easy app install and kids learn how to download and play games.", "verified": true, "helpfulness": "0/0", "author": "Angela H."}, {"rating": 5.0, "review": "2nd stick I bought. Put this one in the office TV. The other one is in the Great Room TV.", "verified": true, "helpfulness": "0/0", "author": "TripRock"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Betty Jean Pinto"}, {"rating": 5.0, "review": "Awesome... No lag time or issues what so ever", "verified": true, "helpfulness": "0/0", "author": "Norah's mom"}, {"rating": 5.0, "review": "How do I love this, let me count the ways! I caught it while it was on sale for $34.  It was easy to set up, worked immediately and I've been using it every day since I got it.  Very, very happy!  Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "A. H. Lindsey \"Audrey H. Lindsey\""}, {"rating": 1.0, "review": "It was okay", "verified": true, "helpfulness": "0/0", "author": "brandon caradine"}, {"rating": 3.0, "review": "This thing worked fine the 2 weeks I used it.  First of all the reason why I got it was the size.  It is so tiny and hides behind the TV you can't even see it unlike the Fire TV box which can be distracting with its bright white light.  I hooked it up and connected it to my 5ghz network.  The UI looks great in 1080p so I tried some apps.  First HBOGo and YouTube are unbearable with this stick.  Very slow to navigate and sluggish.  Other apps like iHeart Radio run fine.  My primary app though is Netflix and it loads fine and navigates fine.  The issue that I had with it that made me reconnect my Fire TV box was the constant video stuttering.  It was at the point were the video would freeze for a couple of seconds then speed up or the video would freeze up for a half a second every 5 seconds giving me a headache.  I ended up using my PS4 which is powerhog and video playback was smooth.  Then I tried other apps and even Hulu Plus would stutter aka not as bad as Netflix but still but what got me was that Amazon own Instant video was also stuttering which I never had a issue on the Fire TV box.In the end I reconnected my Fire TV box and instead moved it to my closet where I can't see it.  I should have done that from the beginning.  Now the Fire TV box also stutters with Netflix but not as bad as the Fire TV stick.These problems are not the app developers fault.  The Fire TV stick has pretty powerful hardware in it.  There are way less powerful boxes and sticks that can stream this apps smooth.  It is the Fire OS problem as it runs a very old version of Android Jellybean which I read soon will get the current version of Lollipop which should get rid of all these issues then I might try the stick again and update this review.", "verified": true, "helpfulness": "0/0", "author": "Tony Ramirez \"tonyram57\""}, {"rating": 5.0, "review": "We have the Fire TV downstairs, but needed something for the bedroom TV. This was less than half the price of the big unit. Set up was a piece of cake. The speed of this is pretty impressive, nice and fast. No complaints, very happy with our purchase! Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Daddy"}, {"rating": 5.0, "review": "This thing is great,more user friendly then Apple box", "verified": true, "helpfulness": "1/1", "author": "dana anderson"}, {"rating": 5.0, "review": "I love my fire tv stick.  It works great for my family. It's nice and small doesn't get in the way.", "verified": true, "helpfulness": "0/0", "author": "dringstrum"}]