[{"rating": 4.0, "review": "I am so very pleased to not have to get up to tap the tablet to prevent it from going to sleep so whatever I'm watching doesn't get timed out. There is a lagging issue at times and the constant updates but this is a really good buy for me since I love binge watching everything.", "verified": true, "helpfulness": "0/0", "author": "Ty Walker"}, {"rating": 5.0, "review": "Does what they say it does. Nifty and convenient.", "verified": true, "helpfulness": "0/0", "author": "Phillip L."}, {"rating": 5.0, "review": "As promised, it's very easy to set up. I am so pleased with my results (it was my first time setting up anything electronic) that I have bragging rights with all my friends!  I was enjoying my shows within 10 minutes!  Along with my kindle fire these are the best products I have ever seen.  Thank you for having my best interests in mind!", "verified": true, "helpfulness": "0/0", "author": "Orysmom"}, {"rating": 5.0, "review": "Absolutely love the Fire Stick! It's really easy to use and the kids love that they can play the games on the television when the grownups have the TV with the Playstation in use.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Amy F\""}, {"rating": 5.0, "review": "Love it! Low price, easy to get up and running, easy to use, and works just fine!", "verified": true, "helpfulness": "0/0", "author": "BENZEEL \"Ben\""}, {"rating": 4.0, "review": "So far I like it but the reception is spotty even with the extender. During my shows its annoying. I would like to get fire TV however it's not available and I'm not sure why.", "verified": true, "helpfulness": "0/0", "author": "Brady"}, {"rating": 5.0, "review": "Very worth the investment. Many apps to choose from and movies to watch.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 1.0, "review": "I'm not real impressed with the Fire Stick.  I have a Chromecast and actually prefer that.  I typically use my smartphone for Netflix and things like that and was looking forward to using the screen mirroring feature in order to display things from my phone on the TV.  The Mircast feature that the Fire Stick claims to handle that, hasn't worked for me.  Chromecast handles that feature much better.  Pretty disappointed!", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's amazing", "verified": true, "helpfulness": "0/0", "author": "Rick Beard"}, {"rating": 5.0, "review": "Have tried the roku chromecast and this device and by far this is the quickest and most responsive although there can be some intermittent pauses.  Wish the search system was more reliable as it does not always show every provider that being said this is a must have for those who do not have smart tvs or are dissatisfied with the speed and responsiveness of other systems", "verified": true, "helpfulness": "0/0", "author": "Nelly Vossoughi"}]