[{"rating": 1.0, "review": "I've had the Fire Stick since it was first launched. Initially I would have given it 5 stars. It was fast, responsive,  and streamed will. But for some reason, lately it keeps having connection issues, Hulu Plus doesn't work, it's just a mess. It's more of a headache than its worth. I regret not getting the Chromecast", "verified": false, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 4.0, "review": "It is doing the job. The only reason I did not give five stars is because when I first installed the Stick the default language was German. I was not able to change that until after the Stick had been registered. My German is quite limited, but I was able to muddle through. It likely took about three times longer to install than it would have, had the guidance been in English.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works very well. Easy set up. Cancelled our cable and got this for our Bedroom. There is enough shows and movies on Netflix to gets us through. Worth the money.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 1.0, "review": "I wish I hadn't given away my roku. was quite satisfied with the fire tv stick at first. every since the last firmware update, it refuses to keep a wifi connection for any meaningful amount of time. Netflix won't work consistently, will stop and buffer, often times getting stuck on 25%.my phone is testing my Internet speed at over 100mbps. so it's not speed. Netflix on any other device in the room works fine.I'm running enterprise level cisco meraki switch and AP. signal strength is not an issue.I've cut the cord as far as cable tv, so when the stick refuses to cooperate...I have to watch on my tablet or phone.horrible product. stay away.", "verified": true, "helpfulness": "0/0", "author": "ti truong"}, {"rating": 1.0, "review": "Does not work", "verified": true, "helpfulness": "0/0", "author": "Irvin P."}, {"rating": 3.0, "review": "The MAIN issue I have is its repeated inability to connect to Netflix, though I'm able to connect to it via other devices, using the same high speed internet connection .. Ironically, I have NO issues connecting to  Amazon prime. This has been going on for months and would appreciate it being corrected! If it were, it would be a great streaming device.", "verified": true, "helpfulness": "0/0", "author": "Steph"}, {"rating": 5.0, "review": "It works as expected", "verified": true, "helpfulness": "0/0", "author": "LEROY KNOPP"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Set up was very easy and I had none of the connection issues that I experienced with the Roku Stick (since returned).", "verified": true, "helpfulness": "0/0", "author": "K. Rennie"}, {"rating": 1.0, "review": "The fire stick Nerflix app doesn't work very well. Buffers all the time.  This is definitely a problem with the stick.  I've run it side by side with my roku and the roku never falters while the fire stick consistently does.  Check other reviews... Everyone has the same problem.  Amazon help is worthless too, they just run you in circles telling you the issue must be on your side.  Go with roku, chromecast or Apple TV.  I can't think of one reason to go with firestick over these.", "verified": true, "helpfulness": "0/0", "author": "James Cruikshank"}]