[{"rating": 5.0, "review": "I like the Fire Stick integration with Amazon prime offerings.  Easy set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Yogi47"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "ShepardsFool"}, {"rating": 4.0, "review": "Easy to install,great addition to an older tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this.  I watch many things on my Kindle and it is nice to be able to watch them on the larger tv screen when desired.  Also able to browse Amazon Prime free shows even without my Kindle.Found that for my Kindle HD I can only watch Amazon videos on the tv.  For my wife's HDX she can mirror her screen and show any App up on the larger tv screen.  Very nice.", "verified": true, "helpfulness": "0/0", "author": "D. Berdanis \"endymion9\""}, {"rating": 4.0, "review": "I love the Fire TV Stick. But it's not compatible with my Logitech Harmony 650 Remote. So I can't use it on the main TV. It's on the one in the bedroom. So I don't get to use it as much as I'd hoped.", "verified": true, "helpfulness": "0/0", "author": "StormyMarch"}, {"rating": 5.0, "review": "Great stick.  Has tons of movies great price also.", "verified": true, "helpfulness": "0/0", "author": "Texas BJ"}, {"rating": 1.0, "review": "It's cool that I'm basically turning my standard TV into a smart TV but you gotta pay 100 bucks for the year all at once. It would be more convenient if you could pay your monthly pymnt like Netflix and Hulu. PLUS on top of the straight out 100 you gotta pay for almost everything else you want to watch. I like it BUT I ALSO REALLY DONT.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "My son-in-law installed it and I find it very easy to use.  Very much enjoy the ability to watch movies and TV shows from Amazon with a good selection free with Prime.", "verified": true, "helpfulness": "0/0", "author": "Patricia Taylor"}, {"rating": 4.0, "review": "Good, would like more apps though", "verified": true, "helpfulness": "0/0", "author": "michelle"}, {"rating": 5.0, "review": "The best purchase EVER", "verified": true, "helpfulness": "0/0", "author": "Juan Jose Martinez"}]