[{"rating": 5.0, "review": "Makes my television functional without cable.", "verified": true, "helpfulness": "0/0", "author": "alison859"}, {"rating": 5.0, "review": "Wonderful. Amazon did an excellent job of making a wide variety of features available through the Stick. It can be paired with a kindle for viewing from the Kindle to a TV. Couple it with Prime and you can watch many videos free and all of your music prime. So hook that TV with the theater sound and you'll be set. Super easy to setup, it walks you through the process.", "verified": true, "helpfulness": "0/0", "author": "Lovely Lily"}, {"rating": 5.0, "review": "I was surprised that I would like it so much, but I love it. I've had Amazon Prime and streaming via my smart tv and did player for a few years, but this stick made using it effortless and finally something that I use. He interface is very nice and the stick is fast. I'm a true fan and barely watch cable TV any more. Now it's all streaming all the time.", "verified": true, "helpfulness": "0/0", "author": "J. Spinner"}, {"rating": 5.0, "review": "One word....OUTSTANDING", "verified": true, "helpfulness": "0/0", "author": "Reggi"}, {"rating": 5.0, "review": "This thing is worth it! It is better than Apple TV and I get to stream my netflix and my amazon prime to big screen!", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "Installed kodi software and now it's flawless have everything you could ever want when it comes to media", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Great!!!!  BEST EVER!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Isaac Torres"}, {"rating": 5.0, "review": "I just got it, but think it's fantastic. Shows, movies, and games for everyone! Easy to set up and use. I had to purchase a Hulu account, but that beats paying cable monthly. Upgrade to Prime, and you get a lot more shows and movies for free. Only an annual fee, not bad at all! Saves SO much money!", "verified": true, "helpfulness": "0/0", "author": "Lindsey"}, {"rating": 3.0, "review": "I have a Roku and decided to try fire stick.  As much as I love Amazon and its products next time i'll stick to Roku", "verified": true, "helpfulness": "0/0", "author": "alvina willliams"}, {"rating": 5.0, "review": "Very easy to use for a non-techie, and I love the convenience.", "verified": true, "helpfulness": "0/0", "author": "Cynthia H. Albertson"}]