[{"rating": 4.0, "review": "This has been great! I don't own a gaming system...not into video games and was watching Netflix on my laptop or tablet. No more! Now, I can see them on the big screen. It was a breeze to set up and navigation is intuitive.Just one, tiny complaint--not sure who designed the remote, but they missed the mark on the opening feature for inserting batteries. It is very difficult to open. Because it is smooth, there is no clear way to gain grip or determine where to apply force. There is no indication where to push or in which direction. I spent 15 minutes trying to open it, getting frustrated, feeling stupid and finally calling customer support. Fix this slight flaw and five stars would be yours.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Extra costs of use of stick should be more up front.", "verified": true, "helpfulness": "0/1", "author": "Stephen W Kelly"}, {"rating": 5.0, "review": "Outstanding device! Enjoying all the free movies and music prime has to offer! The selections of the movies are far better than Red Box! :-)", "verified": true, "helpfulness": "0/0", "author": "Manuel J."}, {"rating": 5.0, "review": "Awesome!! Works great. Easy to install. My daughter enjoys hours of movies. Just got one for my Dad and another one for my bedroom.. Love it!!", "verified": true, "helpfulness": "0/0", "author": "Denise  Chambers"}, {"rating": 4.0, "review": "Very nice....but....some glitches,  like a skip on a old record in Hulu plus. Need to use my rogue for that app?", "verified": true, "helpfulness": "0/0", "author": "Bob Walters"}, {"rating": 1.0, "review": "About all I can say is..I Love it.I'm sure I will have many hours of enjoyment.", "verified": true, "helpfulness": "0/2", "author": "Barbara Sutton"}, {"rating": 5.0, "review": "bought this so I can watch my shows at my girlfriends house. Very happy with the fire stick. works great with Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "michael wilkes"}, {"rating": 5.0, "review": "simple to install and use.  Wish it had volume control as well, but otherwise I love it.  Thank you, JW", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "I like it, however I'm pretty disappointed that I bought this and STILL have to pay to use it. And on top of that, I even purchased the Amazon Prime ($99) and STILL have to pay to view basic shows I wanted to watch. Wish I would've know this info before I purchased it.  Seems kind of pointless to have it if I still have to pay to use it.", "verified": true, "helpfulness": "1/1", "author": "Wendi Elder"}, {"rating": 3.0, "review": "Does this have any regular tv channels? Like any sports channels?", "verified": false, "helpfulness": "0/0", "author": "Stephanie Davis"}]