[{"rating": 5.0, "review": "Incredibly easy setup! Great streaming device!", "verified": true, "helpfulness": "0/0", "author": "jumpinjill"}, {"rating": 5.0, "review": "Got it on a great sale offer from Amazon.  Works perfectly and easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "sunesis"}, {"rating": 3.0, "review": "It not easy using the remote to type on the monitor for searching.I am your old, friend and sincere customer, but you charged me SHIPPING & HANDLING FEE : $ 12.98 !Some things are better then CHROMECAST.", "verified": true, "helpfulness": "0/0", "author": "samhe"}, {"rating": 4.0, "review": "Nice remote and internet access for not Smart HD tvs.  Works great", "verified": true, "helpfulness": "0/0", "author": "Jake Orbin"}, {"rating": 5.0, "review": "The fire TV stick works great. I had a few connection issues in the beginning but once it got up and running it worked perfectly. I use it on my son's TV to give him access to amazon instant video. He loves it. He is too young to just have a DVD player or other system out and this unit easily connected to the back of the TV. It was a great purchase. If you have another device that connects and does what you need, you don't really need this.", "verified": true, "helpfulness": "0/0", "author": "PB"}, {"rating": 2.0, "review": "This should be a great device, but only in theory...  They won't allow Apple users to get their \"remote app\" and can't stream even lowdef tv shows do to the fact that it won't keep an internet connection for more than 2 min! Apple TV may be expensive but it's a far better product with zero technical issues, get it instead", "verified": true, "helpfulness": "0/1", "author": "Jessica Watts"}, {"rating": 5.0, "review": "Easy installation and buffers data preventing stopping of movie for data movement while streaming.", "verified": true, "helpfulness": "0/0", "author": "Texas D \"Don\""}, {"rating": 5.0, "review": "Lot of movies , lots of games, many of them free, some you pay for. No problems so far with this thing.", "verified": true, "helpfulness": "0/0", "author": "Perry S \"Perry S\""}, {"rating": 5.0, "review": "This is the BEST thing I bought for Christmas!  I bought Fire stick so I could play my Amazon music on my home stereo system. Wow, it does this does that and so much more! I can play all my Prime movies and my uploaded my photo albums. Great speed, no lag or interrupts.", "verified": true, "helpfulness": "0/0", "author": "J. Ramirez \"J. Ramirez\""}, {"rating": 5.0, "review": "FireTV stick has been a wonderful upgrade to viewing experience of our old Xbox 360. I wish the darn remote was a bit bigger so it was harder to lose but Ill live. Controls are intuitive and it literally came out of the box loaded with my Amazon Prime account. it was a pleasure to setup, one of the best unboxing experiences I've had.", "verified": true, "helpfulness": "0/0", "author": "DustinLeblanc"}]