[{"rating": 1.0, "review": "This thing has so many issues going for it.Connecting to wifi issue cuts in and out, slow performance, overall compared to my roku 2,is like the Honda next to the Mercedes. I will be upgrading to the roku 3 after this.", "verified": true, "helpfulness": "1/1", "author": "Jayson gift"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Stacey M."}, {"rating": 5.0, "review": "This took us a few minutes to figure out.  It doesn't come with instructions really, but you can access all the info on line.  I don't suggest buying the instruction books sold online (NOT BY AMAZON my mistake) it was completely useless (luckily only 2.99) but once we got the hang of it WE LOVE IT !!!!!!!  My friend came over with her 2 small children and they loved it.  Now they are thinking about getting one too.  The remote works very well.", "verified": true, "helpfulness": "0/0", "author": "JSR"}, {"rating": 5.0, "review": "This fire stick is great. Brings my Prime Membership to another level.  I watch all my videos andMovies on my TV.", "verified": true, "helpfulness": "0/0", "author": "Aida"}, {"rating": 5.0, "review": "Awesome device, and a great alternative to replace cable!!!", "verified": true, "helpfulness": "0/0", "author": "Tynella j, gaines"}, {"rating": 1.0, "review": "Really poor Twitch.tv support, it doesn't allow you to search. I have to spend several minutes trying to find the games I watch or the streamers I watch.", "verified": false, "helpfulness": "0/0", "author": "iopq"}, {"rating": 5.0, "review": "Fire Stick is awesome!  Very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Shawn Johnson"}, {"rating": 1.0, "review": "Will not stay connected to my wireless internet at home.  It has very good signal strength, but then drops every 10 seconds or so.  Was able to get one show to play for about 20 seconds before the picture went blurry. It had to buffer and then lost connection again.  Went through all the troubleshooting advice to no avail. This is the only device in my house that has a problem staying connected to the internet.  I stream netflix over my Mac, Android phone, and PS3 all the time without any problem. Returning ASAP. Guess I'll try the Roku next.", "verified": true, "helpfulness": "0/0", "author": "Taylor Poole"}, {"rating": 4.0, "review": "A+", "verified": true, "helpfulness": "0/0", "author": "Uri Pineda"}, {"rating": 5.0, "review": "Cool", "verified": true, "helpfulness": "0/0", "author": "David Trujillo"}]