[{"rating": 4.0, "review": "Good product, but even better is Amazon's warrantee service.  My FireStick recently stopped picking up my network - including any in the area.  I called Amazon and they are shipping me another in under two days (it is Saturday afternoon and it is to arrive Monday).  Makes me want to buy everything through Amazon!", "verified": true, "helpfulness": "1/1", "author": "JACY-B"}, {"rating": 5.0, "review": "I love amazon fire stick!", "verified": true, "helpfulness": "0/0", "author": "Giancola & Ramos \"Jeysan Giancola\""}, {"rating": 2.0, "review": "youtube app sucks when using through Fire Stick", "verified": true, "helpfulness": "1/1", "author": "kedar"}, {"rating": 3.0, "review": "The Fire TV Stick was purchased in order to access Amazon Prime content, which can't be done via the Chromecast. I'm a heavy Netflix and Hulu user and found the performance for those two apps to be worse on on the Fire TV Stick. There has been a lot more buffering and video quality/compression issues on the Fire TV Stick, and my internet speed tests are way above the minimum requirements for both products. So, the Fire TV Stick gets used exclusively for Amazon Prime access and nothing else.The remote included with the Fire TV Stick is a difference in user experience between the Chromecast, but I didn't find it to be any better or worse than the native app experience for operating a Chromecast on my iPhone. You get used to either.", "verified": true, "helpfulness": "1/1", "author": "sos8weall"}, {"rating": 3.0, "review": "While all of Amazon's services stream flawlessly, third party apps don't fare so well.  Netflix is particularly problematic.  I have consistent connection speeds above 20MBPS and yet the Netflix app does weird things like stalling the video while the audio continues.  I also dislike the fact that I can't side load any Google services.  While the price is right for this device, I'm thinking the right choice is a hardware vendor who isn't pushing their own services.", "verified": true, "helpfulness": "2/2", "author": "Thomas Raven"}, {"rating": 5.0, "review": "OMG this is the best thing ever.  I am enjoying it so much!", "verified": true, "helpfulness": "0/0", "author": "Mary Anne Nargi"}, {"rating": 1.0, "review": "The only thing I regret out of all my purchases from Amazon. Had high hopes for this product and it's a turd.", "verified": true, "helpfulness": "0/0", "author": "Kyle lawson"}, {"rating": 5.0, "review": "I love this thing!  Easy to set up, easy to understand. Great purchase for me.", "verified": true, "helpfulness": "0/0", "author": "April"}, {"rating": 1.0, "review": "We would have really enjoyed it had it worked...either one actually as we tried two. The Fire TV stick kept dropping our internet connection. When it would finally play something it lasted for about 20 seconds and buffered for 10 of those seconds. We have no issues with any other wireless peripherals connecting and holding the connection. Overall a big disappointment.", "verified": true, "helpfulness": "1/1", "author": "Ev's Dad"}, {"rating": 5.0, "review": "Can't say enough about the fire stick. I own two and love them both. Only exception has to do with Hulu app, which is outstandingly poor in performance. Not a fire stick issue.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]