[{"rating": 5.0, "review": "I am really enjoying my fire stick. My husband loves that he can watch movies that he loves!", "verified": true, "helpfulness": "0/0", "author": "Janet Maxwell"}, {"rating": 5.0, "review": "Simplest Installation of any electronics I have bought.", "verified": true, "helpfulness": "0/0", "author": "Loren Seely \"Balloonatic\""}, {"rating": 5.0, "review": "Awesome!  Too bad you still have to pay the $61/mo. for the internet to make it work.", "verified": true, "helpfulness": "0/0", "author": "Adolfo Alvarez"}, {"rating": 5.0, "review": "The set up was easy. The remote app works great on my iPhone. I can almost get rid of Chromecast now.  I still need it for HBO Go.", "verified": true, "helpfulness": "0/0", "author": "Mike Allen"}, {"rating": 3.0, "review": "I live in the country and our internet is not super strong connection - which means that streaming anything is difficult.  I thought that if I could stream on Kindle Fire HDX, then I could mirrorcast it to the Fire Stick.  This doesn't seem to be working.  I can't mirrorcast it at all.  Sort of a disappointment but understand that it is mostly due to our slow connection.  Without a high speed/type internet, I wouldn't bother with this product.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Too many free movies to watch in a lifetime. Easy to hook up- easy to use", "verified": true, "helpfulness": "0/0", "author": "Donald C Nickason"}, {"rating": 4.0, "review": "The circle pad for the controller is weird.  The device works great though.  Great present for my mother who does not have a device to connect to NETFLIX and other services.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 1.0, "review": "Wanted this to work well, but can not say that it did. I could not get the Fire Stick to connect to my Wifi. I googled the issue and saw there were a bunch of Amazon related threads for troubleshooting with people having similar issues. I followed the instruction as per those links (unplugging router/wireless, restarting, un-powering/rebooting device, etc.)  and was unable to get my device to connect. I tired calling amazon customer service for tech support and they were of no help either. Returned my device two days after receiving it.", "verified": true, "helpfulness": "0/0", "author": "MACâ\u0084¢"}, {"rating": 5.0, "review": "It works very well once I fixed an issue with accessing Netflix.  I think i might buy another to give as a gift to someone else who may really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Terry"}, {"rating": 2.0, "review": "I  expected more free movies with amazon prime,  like Netflix ,  not to have to rent them,  I could have just stuck with Netflix", "verified": true, "helpfulness": "0/1", "author": "Kristina Atkinson"}]