[{"rating": 5.0, "review": "I think it works better than Apple TV, easier to use and seems to be faster unloading the apps. Does required external power will not work off the USB port.", "verified": true, "helpfulness": "0/0", "author": "Ren"}, {"rating": 5.0, "review": "We absolutely LOVE our Fire TV Stick. Best $20 I could possibly have spent for our viewing pleasure. Crisp, clear, very good quality streaming. No skips, no issues. Automatically starts TV, or changes to the appropriate input. Has a good menu system that's easy to navigate. Probably the only suggestion for navigation is that I'd like the ability to make subfolders in areas such as Watchlist. We've got over 100 videos on our Watchlist, and it's a nuisance to navigate to the end of the list.Oh, and on top of everything else, it has a great screen saver app with >100 gorgeous full HD images. I only wish there were subtitles on them to tell me the locations being shown.", "verified": true, "helpfulness": "0/0", "author": "Charlie Russel"}, {"rating": 5.0, "review": "Love this little thing", "verified": true, "helpfulness": "0/0", "author": "jason wolfe"}, {"rating": 5.0, "review": "The Stick is absolutely amazing I would recommend this product to everyone. Best way to stream without a bulky box and no wires. I recommend the TV Power mini 1a USB attachment for powering your fire stick.", "verified": true, "helpfulness": "0/0", "author": "Jersey"}, {"rating": 4.0, "review": "I love it!!", "verified": true, "helpfulness": "0/0", "author": "Albert Trevino"}, {"rating": 3.0, "review": "I was told all the movies will be free- Not true", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Easy to use, and with my android phone I have apps for this, direct tv, and my tv itself so I only need my phone.", "verified": true, "helpfulness": "0/0", "author": "Donovan Vernon Borman"}, {"rating": 5.0, "review": "Received as described, great product!!", "verified": true, "helpfulness": "0/0", "author": "Troy Gaudette"}, {"rating": 4.0, "review": "Plug it in and it works, I wish I had this a long time ago.....lots of movies and shows.", "verified": true, "helpfulness": "0/0", "author": "Jrod"}, {"rating": 5.0, "review": "Can't filll out survey.... Watching netflix.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]