[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/1", "author": "Tom Cannon"}, {"rating": 1.0, "review": "Amazon stick kept freezing up in the \"amazon\" screen that comes up om the screen when it is powered on. Looks like i got a defective product.", "verified": true, "helpfulness": "0/1", "author": "tomas ramos"}, {"rating": 2.0, "review": "Extremely frustrating to use. Everytime I pause OINTB in Netfix it causes my sound bar to malfunction. Other television programs like Futurama work just fine. The audio programming is set up the same on both shows in Netflix so I don't understand it, but it's driving me crazy.", "verified": true, "helpfulness": "0/1", "author": "Ashley M. Wright"}, {"rating": 5.0, "review": "Easy to setup and use.  I love the fact that it is portable.  I have even taken on vacation with me and used in hotels.", "verified": true, "helpfulness": "0/1", "author": "Marty Rand"}, {"rating": 5.0, "review": "Awesome love it a d easy to setup", "verified": true, "helpfulness": "0/1", "author": "Columbia /Columbo"}, {"rating": 5.0, "review": "Best way to get everything shown onto your tv without having to watch it on a computer. Can even surf the internet.", "verified": true, "helpfulness": "0/1", "author": "My Stuff"}, {"rating": 5.0, "review": "The Stick itself is great and we have really enjoyed using it. My only down fall for it is our own internet connection. We have the fastest speed offered in our area and there are times that we get the warning \"connection to slow\". If we watch the movie or show anyway, it becomes pixelated and will stop for a little bit. But I don't really blame that issue on the stick but our internet.", "verified": true, "helpfulness": "0/1", "author": "rrgirl816"}, {"rating": 5.0, "review": "I love this fire stick.  We more TV's than we have cable boxes.  We liked this for our TV in the basement.  It was very quick to set up and worked right away.  We just watch the free shows when we use the fire stick.  It is a very worthwhile purchase.", "verified": true, "helpfulness": "0/1", "author": "Michelle Henkelman"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Daniel R. Larrabee \"DRL\""}, {"rating": 1.0, "review": "Doesn't work well at all. I experience slow downs on an otherwise fast network all the time. Apps will sometimes quit for no apparent reason and the interface needs work too. Some apps when you click on them in the recent section will simply move the interface to where the app is instead of launching the app. I called tech support and they said to use the HDMI extender which, like powering off and on again does, \"fixed\" it for about a day. Furthermore, what is the point of having a \"stick\" device if it still needs to be plugged into a wall outlet. The remote creaks and bends easily too. As a prime member I took advantage of the pre-order so I suppose its possible I got a bad build from the first round to be manufactured. It took months from when I pre-ordered to when I actually got the device. If so, I wish Amazon would replace it with one that actually works.", "verified": true, "helpfulness": "0/1", "author": "Michael"}]