[{"rating": 5.0, "review": "Amazon I want to thank you for giving me something to do without college football being on.  Interface is great and my 2 year old loves pbs kids", "verified": true, "helpfulness": "0/0", "author": "Jenny Dell"}, {"rating": 1.0, "review": "If this was for a smart tv it should have sad so, if not need more info on how to use it without paying $8 + for instruction book", "verified": true, "helpfulness": "0/0", "author": "Karron White \"Karron\""}, {"rating": 1.0, "review": "I am really disappointed with Amazon's method of marketing this device. I pre-ordered it back in October for the Prime Member price. it sat there pending for three months and when Amazon tried to authorize my card without warning and the charge was declined. The cancelled the order without an opportunity to remedy and now expect me to pay full freight.Not impressed at all.", "verified": true, "helpfulness": "0/1", "author": "Tom Keaney"}, {"rating": 5.0, "review": "Easy setup, so many choices. So glad I got it.", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 4.0, "review": "Streams fine. Read the tips first.", "verified": true, "helpfulness": "0/0", "author": "Lloyd A Barnhart"}, {"rating": 5.0, "review": "Works great! Can watch Netflix in the bedroom now. The remote is a great addition over the Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "JimV"}, {"rating": 1.0, "review": "This thing has to be plugged in while in use. Doesn't that defeat the purpose ? Small device great then a giant cable running down the wall ??", "verified": true, "helpfulness": "0/2", "author": "Simon Neilson"}, {"rating": 4.0, "review": "I love that for $19.99 I was able to make my tv a smart tv. Works great with my newer tv, but not with my 3 year old Tv. I get tons of static and popping noise with my living room TV and that one is more expensive tv than my other TV. I would give it 5 stars if it worked on my other TV's", "verified": true, "helpfulness": "0/0", "author": "Grl...wishing for fall \"Momx23\""}, {"rating": 4.0, "review": "Gave as a gift.  So far, no complaints.Update - Decided to keep it. Great but no TWC app really hurts this. ROKU still up one because of the TWC app.", "verified": true, "helpfulness": "0/0", "author": "Jose Sanchez"}, {"rating": 2.0, "review": "It freezes all the time. Plus remote doesn't like to work. Changed the new batteries out that came with it but same issue. Really regretting my purchase.", "verified": true, "helpfulness": "0/0", "author": "Cristy M. Russell"}]