[{"rating": 1.0, "review": "Cannot recommend until Miracast is fixed! Its the only reason I got this over Chromecast. My Android 4.4.4 (no not Fire) phone and Surface Pro cannot connect. Bad marketing Amazon..", "verified": true, "helpfulness": "0/0", "author": "Bee Kay"}, {"rating": 5.0, "review": "Great Product that actually exceeded my expectations. It needs a few more apps, but it is well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Takpro"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Carey Jennings"}, {"rating": 5.0, "review": "We love the Fire Stick. Great selection of movies and TV. Also you can view pictures from your Amazon cloud.", "verified": true, "helpfulness": "0/0", "author": "Whitney Powell"}, {"rating": 5.0, "review": "I bought this for an older TV that we were connecting a laptop for occasional Netlix and Amazon Prime streaming to. This was a perfect, simple and inexpensive solution and the remote works great. The interface is simple and effective, setup was a snap and since I pre-ordered it upon release, the price was only $19.99 and it even arrived a week early.", "verified": true, "helpfulness": "0/0", "author": "Steven R. Huizenga \"Must Have Coffee\""}, {"rating": 4.0, "review": "Missing a few apps/games that the full \"Fire TV\" experience has.  Like Minecraft for example.  Also, some games are \"controller only\" (so you can't play them on the stick remote).  The stick won't pair up with any third party controllers either, so you can forget about using your Playstation or Xbox controller.But wow!  For the money, this is still a good buy - it's much a much more exciting purchase than the Chromecast, although lacks the same casting capability. I still strongly recommend purchasing one though. The Plex app and Fibbage game make this a must-purchase.  It's well made, well designed and the interface is great.", "verified": true, "helpfulness": "0/0", "author": "Rob Chapman"}, {"rating": 4.0, "review": "Just hoping they add HBO GO soon...other than that no complaints!  I love it, it's easy to navigate and has been a great replacement for watching Netflix off of my Wii which is not HD.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "Works perfect for us!  Quick streaming.  Works with our Prime account, Netfix, and Pandora.  We love it!", "verified": true, "helpfulness": "0/0", "author": "Leandra Goedvolk"}, {"rating": 1.0, "review": "wifi keeps disconnecting. Funny Chrome cast does not...", "verified": true, "helpfulness": "0/0", "author": "Jose D Ramirez"}, {"rating": 5.0, "review": "Works great! If you have access to TV provider login you can get full use of the fire stick. Very user friendly. Just wish there were more apps like the ABC, FOX, HBO apps!", "verified": true, "helpfulness": "0/0", "author": "M M"}]