[{"rating": 4.0, "review": "Absolutely love it, we have been watching a lot of prime movies. The only problem is that at the last part of the movie it will say that the internet connection is too slow and stop playing the movie. Very frustrating! I reset the Fire Stick and it will then finish the movie so I don’t think my connection is the problem. Other than that issue we are enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Barkfire"}, {"rating": 5.0, "review": "No more Netflix  buffering with Xbox....no more fees with Xbox...I highly recommend purchasing a Fire TV stick.  I purchased mine from a Best Buy, & I found it interesting that the salesman was very uneducated about the product and really didn't recommend it.  Really glad I trusted my own judgement.", "verified": true, "helpfulness": "0/0", "author": "Lisa L"}, {"rating": 1.0, "review": "Not good. Very Very slow .You tube application is a joke. Not even comparable to Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Rohit Gupta"}, {"rating": 5.0, "review": "Love the Fire TV Stick. Very easy to setup, fast feedback form the box and a pleasure to use.", "verified": true, "helpfulness": "0/0", "author": "Karim B"}, {"rating": 5.0, "review": "Great and Fast Delivery", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 2.0, "review": "Pro: The Stick is plugged into an HDMI port on my receiver, down in my entertainment center, out of sight.  I thought I'd have laggy connection with wifi and the remote...but it works great.  The Stick is very responsive.Pro: The Amazon remote app is neat.Pro: The kids love playing some of the apps. We like some of the family/group games.  Going to have to get a remote.Pro: Voice search is awesome and quick.Pro: Works great with my Plex app.Con: Some of the services/apps won't recognize the keyboard in the remote app.  You have to use the remote's arrows to slowly and painfully enter your sign in information for those apps.Con: The Prime membership is under my wife's account.  I'm linked to it.  Even though I'm signed into the Stick under my account, it doesn't recognize that I'm a prime member.  Had to reset the device and sign in with my wife's account.  Well this sucks because I have apps from the Amazon app store that my wife doesn't have (e.g. Plex) that I can't use now.  BOO!Con: Two times now this thing has basically reset itself.  I've had to log back into everything (refer to CON #1)[EDIT] I did have a comment about Miracast not working.  It started working and it is repeatable with my LG G2 and G Tab.  Bump 1 star.For $20 it's not a bad device, but the problems I've experience outweigh the good parts.  I'll keep it, the kids will use it, but it certainly won't be my \"go to\" device for streaming.[EDIT #2] Miracast stopped working again.  Back to 2 stars.  Also, I'm disappointed in the small selection of games compared with the Google Play store.  I'm sure it will get better over time though.", "verified": true, "helpfulness": "3/3", "author": "DAVID CLUFF"}, {"rating": 5.0, "review": "So much better than a roku! This is more fluid and works seamlessly. The best $19.99 I have spent! Love it.  Must admit as a loyal Prime member I AM disappointed about special offers only given to a select few as with the Echo. It alienates good customers. This deal kinda made up for it.", "verified": true, "helpfulness": "0/0", "author": "amazon#1fan"}, {"rating": 5.0, "review": "This Fire TV Stick is exactly what we were looking for! Great product, especially for those of us looking to rid ourselves of those overpriced cable companies. We also have a few Roku streaming players in our house which we've been using for a couple years now, and while they each work beautifully, the only real difference we've noticed is that the Fire TV Stick remote responds a bit faster than that of the Roku which was surprising. Also, navigating the home screen of the Fire TV platform can be a bit confusing at first, especially if you're already used to the blissfully straightforward Roku platform, but it only takes a bit of playing around to get the hang of it. Now if only these companies would recognize the need for a \"remote locator\" button like that of a cordless phone, life would be much simpler. ;)", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love the remote.  The interface and programming features rock too!  We used to use Chromecast (mostly for Netflix) but grabbed the Fire Stick when it was on pre-order discount, and I'm so glad we did!  Now we get Netflix AND Prime Instant.", "verified": true, "helpfulness": "0/0", "author": "CS"}, {"rating": 3.0, "review": "Received the device and it works well enough.  I do not have a chromecast to compare it to, but the device will replace much of the functionality of my dedicated computer that is hooked up to my TV.  My biggest gripes are that I cannot access my own video content easily and display mirroring does not exist for 90% of the products out there.Pros:The device was easy to set-up.The interface is relatively simple and doesn't bog itself downA physical remote control is handy and preferred over having to use a phoneApps that do exist seem to work wellAmazon Prime streaming works flawlesslyCons:False advertising about being Miracast Certified.  This only supports a subset of Miracast, and it will not work with your Windows Laptop/tabletNetflix app jitters/stutters from time to time (appears to be resource constrained)Few apps overall, and finding new apps is a bit cumbersomeNo obvious way to share videos between my home streaming box and the device", "verified": true, "helpfulness": "0/0", "author": "Arthur D. Bogard"}]