[{"rating": 5.0, "review": "Life made easy!  It's perfect.", "verified": true, "helpfulness": "0/0", "author": "Jane Schuster"}, {"rating": 1.0, "review": "This purchase was a total disappointment. It suffers from a very limited app selection, has no web browser, can't add the Google Play store (so all the content and apps I've purchased there are inaccessible). I can't connect to bluetooth devices like mice, keyboards or external speakers/headsets. There's no native DLNA player so I can't stream content from the other devices in my home. Compared to generic Android HDMI sticks available at a similar price from overseas vendors, this product is a total loser. A $45 HDMI stick I bought over a year ago from a website in Hong Kong can do all these things and more, it even has USB ports to attach local drives, wired ethernet and other devices - another no-go for the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "Very good streaming device! Easy to use and comes with many free TV shows and movies if you're a prime user.Pros :Low price!Great hardwareAmazing capability to interface with almost every remote without configuration.Awesome user friendly GUI.Great shows for prime users.Great apps.Cons:No access to home servers over FTP. You can't play home movies via this device.No force stretch option for older shows.", "verified": true, "helpfulness": "0/0", "author": "three_legs"}, {"rating": 5.0, "review": "I didn't expect to love this device as much as I do.  I may even like it more than my Roku Streaming Stick.  It's got so many features, including games and educational content for my kids (ages 3 and 5).  My only issue is that my kids keep losing the remote!  It's pretty small, so it can get misplaced easily.  Fortunately, we always find it in the same place...under the couch!  :)", "verified": true, "helpfulness": "0/0", "author": "Kindra D. Wessel"}, {"rating": 4.0, "review": "Works well, so far so good. Seems to have occasional lag time when buffering during a movie. Maybe if it had more internal storage it could cache more content.Overall I like it however, nice and easy to access Prime movies, which is all I've used it for so far.", "verified": true, "helpfulness": "0/0", "author": "Spectraman"}, {"rating": 5.0, "review": "Love this and how versatile it is!", "verified": true, "helpfulness": "0/0", "author": "Ashley Smith"}, {"rating": 4.0, "review": "Firstly, the speed of this device is fantastic. It blows the roku stick out of the water in that respect. Amazon content is amazing and works amazing with the fire hdx. However.... All other content kind of falls short, or is the fire stick designed that way? Amazon prime tv and movies play flawlessly. Netflix, not as much. WWE Network, also does not perform well at all. It is choppy video 90% of the time. I also have a roku stick that plays everything from the same tv perfectly. Not sure what the deal is with the fire stick, but it is annoying. It is still new so they have some kinks to work out for sure. Which is why as of right now I can only give it 3 stars. The lack of content for the fire stick compared to the roku is laughable, but i am sure it will grow over time. Once they get the content that the roku has (media browser for instance) then I may come back and give it a higher rating. But as of right now in fire stick 1.0 its 3 stars at best. Speed and price are why I give it 4 stars. Now amazon, just get us more content and work out the bugs.", "verified": true, "helpfulness": "0/0", "author": "Doc"}, {"rating": 5.0, "review": "The Fire TV Stick is everything I hoped for plus more! I've been using my Wii to steam Netflix and Amazon Instant TV but its so much easier with the Fire Stick. Plus there is many more channels and ways to watch. Love that they've included Pandora as well!", "verified": true, "helpfulness": "0/0", "author": "Krysta lockard"}, {"rating": 1.0, "review": "Bought one and never  had a chance to do more than boot it and register it before it was stolen. My complaint stems from there's no apparent way to figure out if anyone else has been using it. While this hole in security and an obvious value-add for Amazon is across all Amazon devices, I was directly affected by the inability to do any detective work on where this went after it was stolen. No dice Amazon, my review is based solely on lack of security features.", "verified": true, "helpfulness": "0/3", "author": "John Marshall"}, {"rating": 3.0, "review": "Requires an insane amount of wifi bandwidth to work properly. Doesn't seem like they accounted for less than 10mps throughput. No buffer was included apparently...", "verified": true, "helpfulness": "0/0", "author": "spawn_mc \"Auditorially inclined book lover.\""}]