[{"rating": 5.0, "review": "love it, most of the same features of roku with a cleaner interface. I use this for traveling and work and have the roku at home. I kind of wish there were more channels but to be honest I only really use the netflix, prime video, plex, and hulu on my roku. The miracast feature is pretty broken, It seems able to stream youtube from your phone but any videos downloaded and played on the phone don't play or play like crap. I've heard people getting it to work but it gives me loads of trouble on my galaxy s4. Overall though I'm very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Eric M. Rogers"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kelly DaBrescia"}, {"rating": 5.0, "review": "I'm more than satisfied with the Fire Stick. I love it!", "verified": true, "helpfulness": "0/0", "author": "Julie77"}, {"rating": 3.0, "review": "I wish there was a troubleshooting manual that came with it. I have had it two weeks and still can't get it to work. It will not pick up my WiFi and I haven't been able to get it to connect. Needs to have a little more help with it.", "verified": true, "helpfulness": "0/0", "author": "kim"}, {"rating": 5.0, "review": "Well worth the money, the interface is easy to use.", "verified": true, "helpfulness": "0/0", "author": "UN4G1VN"}, {"rating": 5.0, "review": "very easy to use", "verified": true, "helpfulness": "0/0", "author": "M26"}, {"rating": 3.0, "review": "Having a hard time with this trying to get it to work.  I thought it was going to be easy and it is not  dissappointed", "verified": true, "helpfulness": "0/0", "author": "Pat Corcoran"}, {"rating": 5.0, "review": "I got this for my daughters room. She lives it does everything she wants it to do. I also at times watch it asee I switch it from tvs. I feel the stick is best for switching TV then the fire TV is. That may just be me but I don't like to hall around a box with I can move a USB shape around. Also it's not as powerful so it does lag when a lot of things are at the same time but after everything is done and video/movie is playing it's all good.i got it free with the 3 months of sling tv. I have 2 other fire tvs. Love all 3. Fire tview is best for me when I don't have to move it around and the stick feel better to move around.  Also the apps of remote work with the stick. Everything is good.love it.", "verified": true, "helpfulness": "0/0", "author": "Ezequiel Garcia"}, {"rating": 5.0, "review": "Since I don't have a smart tv this Fire TV stick works amazing. I no longer need to use my iPad and connect to TV to watch netflix or other apps.", "verified": true, "helpfulness": "0/0", "author": "Tanya"}, {"rating": 5.0, "review": "It works so well.  I love it.", "verified": true, "helpfulness": "0/0", "author": "D in D fan"}]