[{"rating": 5.0, "review": "Works extremely well", "verified": true, "helpfulness": "0/0", "author": "Reeds Investments"}, {"rating": 5.0, "review": "The Fire stick meets all my needs. Very easy to set up, hides neatly behind mt TV. I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "kmeyers"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 3.0, "review": "The first stick I received was a lemon.  Tech support was very helpful and aided in rushing a stick out to me.  If the new stick works, I expect it to be a great item!", "verified": true, "helpfulness": "0/0", "author": "Bradley Brzuchalski"}, {"rating": 4.0, "review": "The stick is great! It is very easy to navigate, the selections are plenty to choose from. We loved watching Bosch, I hope there is a second season.", "verified": true, "helpfulness": "0/0", "author": "Beverly A. Byrd"}, {"rating": 3.0, "review": "It worked perfectly out of the box, but I ran into a problem when I wanted to use it the second time.  First, my TV couldn't find it.  After plugging it in and out, and searching for a while, it loaded.  Then the remote didn't work.  I downloaded the remote app on my phone, and got it running, but the phone app isn't very good either.  I was able to re-program the remote using my phone.  I then just turned the whole thing off, and unplugged everything, and tried again.  I found that if you unplug the firestick from the wall for a moment, and then plug it back in, everything works.  If you leave the firestick plugged into the power, the next time you want to use it, it doesn't work.  It's a pain plugging it in and out every time I use it, but at least it's working now.", "verified": true, "helpfulness": "0/0", "author": "Milton D Conrad"}, {"rating": 5.0, "review": "I am completely surprised with how well this works and how affordable it was.  If you want to stream content to you tv buy the fire stick", "verified": true, "helpfulness": "0/0", "author": "M"}, {"rating": 5.0, "review": "Love it, easy to use", "verified": true, "helpfulness": "0/0", "author": "Clark Kopish"}, {"rating": 5.0, "review": "Excellent, just as good if not better than my Roku. Easy to connect and get set up. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Kim Barraco"}, {"rating": 5.0, "review": "It is easy and fun to use. It has 1000 of tv, movies and games for your enjoyment.", "verified": true, "helpfulness": "0/0", "author": "Natasha Bell"}]