[{"rating": 5.0, "review": "So easy to install and use. We love it.", "verified": true, "helpfulness": "0/0", "author": "Chuck Maro"}, {"rating": 3.0, "review": "I'm still to figure out how to use it.  Instructions were not very clear.", "verified": true, "helpfulness": "0/0", "author": "Sarah Acquistapace"}, {"rating": 5.0, "review": "This device is fantastic.  It does what is described and it does it well.  It is also super easy to sideload apps such as Kodi/XBMC on it.", "verified": true, "helpfulness": "0/0", "author": "Steve L."}, {"rating": 4.0, "review": "I am happy with it I like my roku3 and stick a bit better since more apps,but this is cool I don't know if infill stay with the prime member after the 30 days, $99 not bad a yr but don't know yet,but it works really good and to set it up was very easy great signal", "verified": true, "helpfulness": "0/0", "author": "Sjimenez"}, {"rating": 5.0, "review": "Thanks love the product", "verified": true, "helpfulness": "0/0", "author": "Juan Uribe"}, {"rating": 4.0, "review": "I am generally happy with my purchase of the Fire Stick. It's great to get all my Amazon choices directly on my hdtv, but I think I still have to learn more about navigating around Fire tv. The plug in process is as easy as expected; I just had to understand how to navigate my tv's source list. I also have to figure out how to access all my photos that I have in the amazon cloud; not sure how to do that and will have to look on line for more info on all the navigation and access. All in all, I highly recommend the Fire TV stick since if you all ready have Prime etc, why not enjoy it all on your tv for such a small price?", "verified": true, "helpfulness": "0/0", "author": "janice g carlin"}, {"rating": 5.0, "review": "It works great.", "verified": true, "helpfulness": "0/0", "author": "Ethel Winters"}, {"rating": 5.0, "review": "I just need Amazon to start providing high speed internet and I will cut the cable cord permanently.", "verified": true, "helpfulness": "0/0", "author": "Timothy Harvey"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Ryan Lively"}, {"rating": 3.0, "review": "not what I THOUGHT.  Very few good movies.  Now if you want to learn the F word there are a lot that can help you with that.  Not needing that help I find the Fire Stick a lot less exciting  and useful than the hype that is given in the commercials.  So far not a good deal.", "verified": true, "helpfulness": "0/1", "author": "Kermit Harson \"chughorse\""}]