[{"rating": 5.0, "review": "Brought new life to an old LCD TV without smart capabilities. Perfect for guest bedroom without having to spend tons of money. Prime Day special pricing. Unit is fast and responsive. Connected without issues. Plenty of access to different apps for videos.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Quick and easy setup. Great picture quality and tons of apps to pick from.", "verified": true, "helpfulness": "0/0", "author": "Kevin Arp"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my Fire Stick. It's allowed me to down grade my cable package and the pricey monthy bill!", "verified": true, "helpfulness": "0/0", "author": "Nanapjs3"}, {"rating": 5.0, "review": "You can install Kodi on it. Enough said", "verified": true, "helpfulness": "0/0", "author": "Leo Meza"}, {"rating": 5.0, "review": "After buying one when they first were introduced for the bedroom TV, I really wanted one for the main TV in the theater.  It is great, love the content.  Set-up was super easy.", "verified": true, "helpfulness": "0/0", "author": "Ronald L. Babb"}, {"rating": 5.0, "review": "Excellent.", "verified": true, "helpfulness": "0/0", "author": "Charles Wilkinson"}, {"rating": 5.0, "review": "Having a remote is a game changer", "verified": true, "helpfulness": "0/0", "author": "Akhilesh Goswami"}, {"rating": 4.0, "review": "So far I'm loving the fire stick. It's just as good as my Roku. We've loved playing dumb games on it and I like that I can install apps (like Lifetime) to watch the shows that I miss since canceling cable and utilizing Netflix. This is our second go around with canceling cable (only got it back for football season) and I don't regret it at all.", "verified": true, "helpfulness": "0/0", "author": "Jay Bee"}]