[{"rating": 5.0, "review": "I bought the fire stick for my parents. It is easy to set up and use, but it took awhile to figure out that you have to log a credit card on the Amazon website in order to utilize Netflix even if you already have a Netflix subscription.  It is definitely easy to use and my parents have been enjoying it.", "verified": true, "helpfulness": "0/0", "author": "happy shopper"}, {"rating": 2.0, "review": "The Fire TV Stick didn't work for us (service kept going in and out even when our internet was still working).  We also tried Roku and have had better luck.", "verified": true, "helpfulness": "0/0", "author": "Dana"}, {"rating": 1.0, "review": "Product has to be registered. Would not recognize my Amazon account. After hours on the phone trying to resolve the problem, the representative told me she was passing it on to the \"tech\" department. After two days, the has been no communication. I'm sure the product is good, but the service is awful at best.", "verified": true, "helpfulness": "0/0", "author": "Woodrow T. Parker"}, {"rating": 3.0, "review": "Nice streaming stick but the network connectivity seems to be a bit flaky. My chromecast never has a problem with the network dropping out, even though it is in the same location behind my tv as the amazon stick.The interface is confusing and difficult to find things to watch, even if you know what you want. Netflix experience is great until the network drops, at which point I need to do a hard reset and remove the power.Biggest annoyance is that you cant turn it off unless you unplug the power source. The stick eventually falls asleep (screen goes black).", "verified": true, "helpfulness": "1/1", "author": "Billy-Bob"}, {"rating": 4.0, "review": "Fire TV Stick is a great concept. I personally had some challenges connecting up with my TV and local Cable set-up but that's not a Fire Stick problem but a matter of so many remotes to juggle switching back and forth from cable to amazon movies. in the Fire TV Stick package the greatest was the physical difficulty of opening the remote to add batteries. I found the case release required a lot of carefully applied pressure to get a release. It shouldn't be forced or pried open but I've certainly seen better designed release mechanisms that require batteries. Once you get past these challenges for your unique set up, the actual movie experience layout is quite nice and you can start watching films.", "verified": true, "helpfulness": "0/0", "author": "Lewis Baker \"Lewis Baker\""}, {"rating": 5.0, "review": "Very cool! !", "verified": true, "helpfulness": "0/0", "author": "Bryan D."}, {"rating": 5.0, "review": "A very good solution to bring internet TV to my TV!", "verified": true, "helpfulness": "1/1", "author": "Jon Libman"}, {"rating": 5.0, "review": "Another Amazing product from Amazon.  I've been happy with this since the 1st day I received it.One thing I wish you could do from within using the FireStick, is search for a movie by typing or selecting letters with the remote.  You can accomplish this by using your phone or computer.  However, that can sometimes be a little cumbersome.Otherwise, I love my Fire Stick.  It is much better than Roku and ChromeStick by a long shot.The picture quality is awesome.  Much better than Netflix.For those that are curious as to the service and content offering, the movie/TV shows offering is similar to what Netflix does, but MUCH better with Amazon Fire Stick/Prime Video subscription.  Amazon has a much nicer and broader Offering than Netflix.  Netflix is still a bit behind.  I've since discontinued my Netflix Subscription, as what Amazon offers is Much better in terms of the selection and what they offer also with the fact that you can still access a  lot of the newer movies that Netflix still does not offer.  Amazon, has some of the newer movies, that although are not part of the subscription, you can Rent them still.  As opposed to Netflix, you cannot even find them at all.For movies that you would typically have to Pay/rent, it's much cheaper than my Home TV Service Provider.  Similar to PPV.Overall, I'm very satisfied with my FireStick and would highly recommend it to anyone who has and/or utilizes Netflix or most Paid subscription video services like it, as Amazons offering is much better.  And also the Stick is a lot more efficient quick and offers much more capabilities than Rofu and ChomeStick.", "verified": true, "helpfulness": "0/0", "author": "ZiggyZ"}, {"rating": 5.0, "review": "This has been a great source of entertainment for the whole family. We love playing the app games on it.", "verified": true, "helpfulness": "1/1", "author": "me"}, {"rating": 5.0, "review": "This Fire TV Stick is GREAT and exceeded my expectations.  Installation was quick and easy.  Love having access to Amazon's TV shows; Motzart in the Jungle, and Transparent.  Good stuff.", "verified": true, "helpfulness": "0/0", "author": "G. Davies"}]