[{"rating": 2.0, "review": "The ui is not good and very slow.", "verified": true, "helpfulness": "1/2", "author": "J. Vin"}, {"rating": 1.0, "review": "Bought this thing on the first day it was available. Love the remote, love the interface, CAN'T STAND the constant buffering. I have 50Mbps Internet and the modem is less than 12ft from the stick.Taking it back to Best Buy tomorrow!", "verified": true, "helpfulness": "1/6", "author": "Brad Gramlin"}, {"rating": 4.0, "review": "Amazing so far. had a little glitch at first, however customer service was quick to respond and handle the glitches.", "verified": true, "helpfulness": "0/0", "author": "C.NELSON"}, {"rating": 1.0, "review": "The stick is probably ok but my ISP only provides me with DSL which doesn't have enough \"juice\" to accommodate the stick, so I was never able to get it up and running. I was hoping for a miracle as all my streaming is very sluggish.", "verified": true, "helpfulness": "0/7", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I have an apple tv and my friends have a roku.  That being said, I was able to compare the fire stick to them both.  I really like the menu setup and allowing prime movies to go the screen.  I haven't tried out the transparency function, but the idea is great.  IMO the menu and functionality favors more on the roku side than the apple tv.  However the price point on this device is great.  The only issue I had was during setup.  I had to input the wifi password several times before the device can connect and update.  Even after the update it asked me for the wifi password and in the middle of me typing it in, them menu popped up.  Perhaps an update will make it better.", "verified": true, "helpfulness": "0/0", "author": "kc1911 \"CNP\""}, {"rating": 2.0, "review": "It needs a lot of improvement.1) The biggest issue is \"HDCP unauthorised. Content disabled\" message. It worked fine for a month, then famous blue screen with this message showed up while trying playing Netflix or Amazon Prime movies. Too many people have this problem. You just need to Google the message.2) The other issue is using any other HDMI adapters like angles. It's 5 GHZ reception is so weak and sensitive. It stops working as soon as you use any HDMI adaptor!!! This machine reminds me the old days when I was trying to connect a simple mouse to a PC, but any other piece of PC was stopped working due to a lot of conflicts in COM ports!3) Be aware about your Google or YouTube purchased movies. You can see them in YouTube app, but when you try to play them, you'll get an error message.4) I was on waiting list for over 2 months while Bestbuy was selling that for $25. Amazon's famous unfaithful behavior to their loyal customers.Conclusions: It is faster than Chromecast, but it's less stable than that. It's better Amazon updates its software URGENTLY before start losing the market to Chromecast.", "verified": true, "helpfulness": "0/0", "author": "amprg"}, {"rating": 5.0, "review": "Really simple connection to wireless and setup.  Appears it will really help me get my moneys worth from Amazon Prime.", "verified": true, "helpfulness": "1/1", "author": "Harry L Colman"}, {"rating": 4.0, "review": "Awesome, turns any hdmi ported tv to a smart tv. Love it. NEED IOS APP ASAP AMAZON", "verified": true, "helpfulness": "0/0", "author": "Randy M."}, {"rating": 5.0, "review": "Runs XBMC just as fast as my Apple Tv.", "verified": true, "helpfulness": "6/7", "author": "Matt"}, {"rating": 5.0, "review": "Great deal!! Completely satisfied!!", "verified": true, "helpfulness": "0/0", "author": "Sagarika Ray"}]