[{"rating": 4.0, "review": "I'm Lovin it. Just ordered a second one for my bedroom tv", "verified": true, "helpfulness": "0/0", "author": "Carol Rivera"}, {"rating": 5.0, "review": "Good items easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Could not be happier with the Amazon Fire Stick!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Faith Witzig"}, {"rating": 5.0, "review": "More than I expected love it.", "verified": true, "helpfulness": "0/0", "author": "Gary E. zimmerman"}, {"rating": 4.0, "review": "Receiced very fast shipped and was very happy with product", "verified": true, "helpfulness": "0/0", "author": "Daniel I Kletz"}, {"rating": 1.0, "review": "Remote would not work. Very very very slow internet connection. Will be returning", "verified": true, "helpfulness": "0/0", "author": "paige new"}, {"rating": 2.0, "review": "No I'm not happy,  I'm disappointed in the Fire Stick. You have to pay for everything that I've looked at so far. 2.99$ for a single episode of a TV show, please, I might as well just stay with the outrageously priced Comcast. I will say my Netflix I already had comes in nicely. But all I can really says is I'm glad I didn't pay for the Fire Stick, with a credit and gift card I had I got it for nothing except the warranty I chose to get. I'm much happier with my Netflix and Red Box they are much better price wise. I could go on and on but will stop here.Linda", "verified": true, "helpfulness": "0/0", "author": "LSWilliams"}, {"rating": 3.0, "review": "Not sure if our WiFi is strong enough, but it will start paying a video, then show the message \"no signal\" & we lose the video or TV show.  Not sure how to solve the problem.  Does the WiFi router  need to be in same room?", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "Have Prime (That I pay for yearly) but still had to buy a Firestick for $40 to watch Amazon on my TV.  Once I got it to work, I saw that there was a very small selection and for movie I get for free on my Verizon package, I have to pay a dollar or more to watch on Prime.  Also the movie you can rent for 6 or 7 dollars you can get a more recent and greater variety from Zerizon.  In short, we will not be watching Amazon, the Firestick was a waste of money.", "verified": true, "helpfulness": "0/0", "author": "cheryl"}, {"rating": 5.0, "review": "I absolutly love the Fir TV Stick!!!I got the Fire TV Stick through the Sling TV deal and it is awesome. The stick is very fast and has a lot of content that I want to watch through my Amazon Prime account. Best of all I am a cord cutter and now you can use the Sling app on the Fire TV Stick to watch cable TV channels.For $20 bucks I get most of the stations that I have been missing and they are adding more stations every month. The Fire TV Stick also streams all of my favorite app such as Pandora and I Heart Radio. Everything works awesome.There is one bad point in my honest opinion with the Fire TV Stick and it is the remote. Feels bad in my hand. I find my self pushing the enter button accidentally while navigating the menus when all I wanted to do was to move up or down. In my opinion the little ring around the outside of the enter button is by far to thin. It needs to be a bit larger to keep the accidental button pushes down.Other than that I love the device! I think it is a perfect complement to my Apple TV. I get everything I want between the two devices.", "verified": true, "helpfulness": "0/0", "author": "Eric Champine"}]