[{"rating": 5.0, "review": "This works amazingly well.  Now I can watch Netflix and Amazon Prime in my bedroom.  Yipee", "verified": true, "helpfulness": "0/0", "author": "Julie Franklin"}, {"rating": 5.0, "review": "OMG! this thing is great...the only complaint is that it doesn't have the voice search. if you can afford the next step up, get that one but my deal on this thing for pre-order was so good i had to get it. Great, solid, and able product. Thanks!", "verified": true, "helpfulness": "0/0", "author": "NMS"}, {"rating": 5.0, "review": "I have Amazon Prime video and Netflix. Best little gadget to own and affordable too!  I Love it, works great!", "verified": true, "helpfulness": "0/0", "author": "josiane"}, {"rating": 4.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "Gary S. Van Wert"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Angela Sierra"}, {"rating": 5.0, "review": "Bought 4 of these for xmas, love them!!!  We have used at hotels, and many other places, ZERO issues.  Easy to stream music, netflix, amazon vid's, etc.  Does all the Apple TV does, but I paid $30 for this and $100 for Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Andy Ullrich"}, {"rating": 5.0, "review": "Quick and easy to set up, streaming seems to be fast and clear.  Easy to move between TV's in case you have kids that want to watch something.  If you'd rather search with a voice controller, there's a free app in the apple store for it.  Great product!", "verified": true, "helpfulness": "0/0", "author": "Jennifer McEwin"}, {"rating": 3.0, "review": "While you will find a lot of glowing praise from loyal Amazon reviewers I find that I must add the one problem with this stick that is not mentioned in the other reviews that I read.  I must point out that this stick will do everything that it says it will do, and for the most part do it well.  The price is good but I feel I paid more for fancy packaging instead of performance.  When streaming from Netflix or Hulu I find that the show will skip 1 or 2 seconds every 6 to 8 minutes.  This can be annoying when it happens during a crucial dialog moment and you have to rewind to catch what was said.  Incidentally, this problem does not manifest when streaming from Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Igziabeher"}, {"rating": 5.0, "review": "I was used to stream my videos on my Xbox but I was paying for Xbox Live over the other streaming services so I started to look for a final payment solution. I saw the amazon stick offer and the benefit of having one as a prime member with a Kindle in the house and I thought This Might be one!. When I got it I spend 10 minutes learning how to use it and lot of hours just looking at the options i had.Here are just few:My daughter can play the games of her tablet on the big screen and download new ones.With the ASAP technology videos load twice faster.To See Live sports gamesHeard music.Friendly Interface, even for my 60+ years mom.And take all of this where ever you go and when ever you want on its good looking box.And lot more if you are Prime memberTry it. You wont regret it.", "verified": true, "helpfulness": "0/0", "author": "Omar E. Peralta \"op-tech\""}, {"rating": 3.0, "review": "can't mirror Windows 7.  Otherwise had everything I needed.", "verified": false, "helpfulness": "0/0", "author": "Vishal"}]