[{"rating": 1.0, "review": "Terrible product. The hulu app kept slowing down to a crawl requiring constantly clearing the cache and forcing that app to stop. Also required constant restarting of the router. Every time you reset the stick I evidently had to re-enter passwords for apps.", "verified": true, "helpfulness": "0/0", "author": "JFoz"}, {"rating": 5.0, "review": "No longer tied to my computer to watch all my Amazon prime videos &  Netflix  one on every tv", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "Great, just what I expected from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "The Fire TV stick was very easy to use right out of the box.  The paper instructional booklet diagrammed how to plug into our flat panel television and from there, the onscreen directions took over.  The easy steps allowed us to use the remote and connect to our wireless internet connection.  The screen selection for movies and television is easy to navigate and the choices are endless.  We have amazon prime which gives us the ultimate selection for hundreds and thousands of entertainment choices.We watched World War Z the first night, and loved having the ability to pause the movie to get snacks.  No issue.  I love this product and it has given us so many more choices right at our fingertips.  I am not sure why we waited so long.", "verified": true, "helpfulness": "1/1", "author": "preppygirl56"}, {"rating": 3.0, "review": "Quit working at about 35 days. The message that displays on screen is \"no signal.\" It was good when it worked, though.", "verified": true, "helpfulness": "0/0", "author": "Trigger"}, {"rating": 4.0, "review": "I'm very excited about being able to watch the shows I like both on my Kindle Fire and now on my TV!!", "verified": true, "helpfulness": "0/0", "author": "Nana28"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "andrew w garcia"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "steve d england"}, {"rating": 3.0, "review": "Still a little buggy, I imagine many issues get resolved in the near future. Sometimes it attempts to start playing a video and then fails until I security wipe it. Seems like a common issue that needs to get cleared up soon. I feel that most people aren't going to know how to resolve the issue easily and, because of this, I feel the Fire TV Stick should incorporate more reliable automated clean-up tasks.Amazon's advice: http://www.amazon.com/gp/help/customer/display.html?nodeId=201612210", "verified": true, "helpfulness": "0/0", "author": "Chris Gates"}, {"rating": 5.0, "review": "Love the fire stick. Awesome selection!!!!", "verified": true, "helpfulness": "0/0", "author": "Miguel"}]