[{"rating": 5.0, "review": "Very happy with the Fire TV Stick, works Great, very easy to set up and easy to use!I may have to retract my previous statement!", "verified": true, "helpfulness": "0/0", "author": "Charles R. Pires Jr."}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Kipukat \"Kipukat\""}, {"rating": 1.0, "review": "It constantly paused for buffering. When it started playing again you would hear the audio only with a paused video feed. Really annoying! It's only 35 ft from my wifi modem. My Apple TV in the same place plays perfectly. The apps aren't that great either. Apple TV has a lot more to offer.", "verified": true, "helpfulness": "0/0", "author": "Kristy Auerbach"}, {"rating": 4.0, "review": "Alot of wanted programs,  u have to pay for them but its nice because it turns ordinary tvs into smart tvs", "verified": true, "helpfulness": "0/0", "author": "Raymond Spinelli"}, {"rating": 1.0, "review": "Not worth it. You still have to pay for all the extras. No recent movies. And not a lot of hit movies", "verified": true, "helpfulness": "1/1", "author": "TeraRae McMillan"}, {"rating": 5.0, "review": "I have a great success with the Fire Stick.  Quick load time and no delays while watching shows.  I watch tv through this almost exclusively now.  Use it for Hulu, Netflix and apps like PBS and Youtube.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Michelle Lanier"}, {"rating": 5.0, "review": "Amazing device and has completely changed the way I view TV and listen to music!", "verified": true, "helpfulness": "0/0", "author": "Roger Murray"}, {"rating": 5.0, "review": "No need to pay for expensive movies again. I enjoy it.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "It works great I love it so do my girls thanks amazon", "verified": true, "helpfulness": "0/0", "author": "kathy"}, {"rating": 5.0, "review": "LOVE it. Was thinking of getting this or Chromecast. Got this so I could watch Amazom Prime video service. I love the onscreen interface, remote, and iPhone app. So easy to watch HBO Go and Showtime Anytime. Soamy other free apps as well!  Great choice for me. Very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Christopher Yow"}]