[{"rating": 5.0, "review": "Fire TV is very user-friendly for a person who's not really talented electronically.", "verified": true, "helpfulness": "0/0", "author": "Diane Fasciano \"Dog Lover\""}, {"rating": 4.0, "review": "Honestly, I would probably say this was awesome.  However, I also got the FireTV Box around the same time, and in comparison, the FireTV Box is far superior.Compared to other sticks out there, this is great - and a great price.  But if you want a processor that is going to keep up, buy the FireTV box, it is way worth the extra cost.  I installed KODI on it, and it is not fast enough to run x265.  The youtube interface is not nearly as good as it is on the FireTV Box.I do use it frequently, and have never had problem with it though.", "verified": true, "helpfulness": "0/0", "author": "Ty"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "paulie p"}, {"rating": 5.0, "review": "Works great, very convenient.", "verified": true, "helpfulness": "0/0", "author": "S Chamberlin"}, {"rating": 3.0, "review": "It works well but everything on there worth watching costs money. Nothing is free so just be prepared to be nickel and dimed. I don't have Amazon prime", "verified": true, "helpfulness": "0/0", "author": "Anne Neville St Aubin"}, {"rating": 5.0, "review": "I really enjoy it. Very easy to install and has my favorite shows.", "verified": true, "helpfulness": "0/0", "author": "darlene adams"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Way cooler than expected.", "verified": true, "helpfulness": "0/0", "author": "Matthew Hammons"}, {"rating": 1.0, "review": "Just another product that you need for proprietary (Amazon) use. All other uses can be gotten from any other product already on the market.", "verified": true, "helpfulness": "0/1", "author": "Recononee"}, {"rating": 4.0, "review": "If you have amazon prime you must get at least this to watch Amazon prime videos.It's great and fun that it plays some games and many apps. My kids like the kids shows that Amazon prime have put out.I took away a star because every once and a while I have had to disconnect the power and reboot it.It seems to work better when connected to my router at 5 ghz than 2.4 ghz.It feels a bit cluttered with apps but it does do it's best with a simple menu. I wish there was a good filtering system for what to display; I wish it had a better front end display and organization. It would be great if different users could be implemented as an option to switch between. For example, a user for children to filter out all the adult shows available.I do have a smart TV and a Chromecast and a Netflix account. Chromecast is great too but I seem to favor the quick accesses of a remote that the fire stick has. However, Netflix runs better and looks better when using Chromecast or my smart TV. It seems to differ also with the TV. For some reason on my 2011 Samsung TV I have to turn off the HDMI Black levels because it's too bright washing out the blacks. It looks great when adjusting the TV levels. But when plugged in our Element TV it looks fine without any adjustments. The fire stick is really the best for Amazon Prime shows.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Technic\""}]