[{"rating": 1.0, "review": "Netflix constantly can't play shows (while I switch over to my chromecast and they play fine)Other apps just sit on Loading... with nothing happening.I also ordered one on Amazon on Oct 17. Beginning of December it said it would be delivered on Dec 18 - I canceled the order, drove down to BestBuy and bought one off the shelf that was on sale.", "verified": true, "helpfulness": "1/2", "author": "Michael Gauley"}, {"rating": 1.0, "review": "What a disaster. I waited 2 months for this thing to arrive. I have been using Apple TV for years now, but wanted something for my glitchy smart tv in the bedroom, so I ordered this. I got it today, packing was sleek and stylish, easy to set up, done in a few minutes, working perfectly. Then in the same time span it completely stopped working. It won't hold a connection 10 feet from my wireless router. I have already requested a refund. I think Amazon rushed out a product to get ahead of competition. Sadly, what they have provided is a worthless lille black stick. I also just purchased a normal fire tv and have enjoyed that. It works fine minus one issue so far. Not sure what happened with the stick, but I cannot recommend it in the least.", "verified": true, "helpfulness": "0/2", "author": "J. Lucia"}, {"rating": 3.0, "review": "Does not work with iPhone, hopefully they would improve on it soon", "verified": true, "helpfulness": "0/0", "author": "O.Bruin"}, {"rating": 5.0, "review": "My older 50\" Pioneer Plasma is not internet ready so needed something to watch Amazon on Demand.  This unit does the trick.  Super easy to set up and watching shows in no time", "verified": true, "helpfulness": "0/0", "author": "Gadget Geek"}, {"rating": 5.0, "review": "What a great TV stick. No buffering like some other TV sticks. The remote works as great as well as the app to use your smartphone as the remote , whch can be used hands free. I do haope that in the near future they will make it compatible with the Google play store for Droid Movies and other apps. Also adding Amazon prime instant movies App that can be used on Android tablets, But you can't go wrong with the Fire TV Stick it's a WINNER !!!!!", "verified": true, "helpfulness": "0/0", "author": "Joffa \"joffa\""}, {"rating": 1.0, "review": "It's worse than the Roku!Disconnects from network every few seconds. So often that I never was able to search for Crackle because the connection would drop and I'd have to start over again. It wouldn't connect long enough to type in \"Crackle\". And that was on the TV next to the router. In my bedroom? never would connect in the first place.The remote? Both physical and Android app - well, it took me the better part of an hour to connect to Netflix. The app is just ridiculous. It looks neat. It just doesn't WORK.As a Prime member, I bought this stick for $19. I thought the thing had to be worth at least $19. I was so wrong.", "verified": true, "helpfulness": "1/2", "author": "Erica Burdett"}, {"rating": 3.0, "review": "Great First effort by amazon.I don't mind the External power requirements, but the Device in it's current state is very laggy,and frequently drops the internet connection, regardless of which room it is used in, which being ableto move it around is one plus.  Also, the user interface feels rushed and needs polish, and willalso lag out on you, to all of a sudden jump to different areas.  Hope to see firmware updates addthe polish it needs.", "verified": true, "helpfulness": "0/0", "author": "Samuel Simmons"}, {"rating": 4.0, "review": "Love the Fire Stick.  Easy to install and use!!", "verified": true, "helpfulness": "0/0", "author": "Debra A. Skaggs"}, {"rating": 5.0, "review": "I have the Apple iTV box, Roku and Chromecast.  I am only on DSL with best case speeds of 1400mps and usually slower.  The Fire TV Stick streams the best of all three with a marginal connection.  There is almost no buffering.  The iTV is next, with the Roku last buffering frequently.  My only complaint is that there is no iOS app, but I did not hold that against Amazon since I knew that going in.  Hope the iOS app posted soon.  Very happy with the Fire Stick and recommend it highly.  I have not tested it yet in a hotel to see if it works there when the others do not.", "verified": true, "helpfulness": "1/1", "author": "R. Hendrickson"}, {"rating": 2.0, "review": "Not that impressed.  Not hard to set up, but it should not be so no points there. Menu is okay, but it was hard to find the YouTube app and there is no way to build a custom menu of my apps as far as I can tell.I can stream Amazon content and other content with good results but I already had devices that can do that, so no real benefit there for me at least.The really big disappointment is with the screen mirroring.  It seems to be an afterthought for the Fire Stick.  I am sure Amazon wants to make it easy for you to buy their content and difficult for you to find entertainment elsewhere.  I can screen cast from my Motorola Droid Maxx phone, but there is always a lag between the screen and the phone.  I have tied it on different routers configured in various ways. It is just laggy. Worse, there is no support for Windows 8.1 even though mircast is supposed to be standard and windows 8.1 includes native support (this is not just me...just Google \"Fire Stick and win 8.1\" to see what I mean).  Weirdly enough, my win 8.1 laptop can see my phone because it has the Firestick app on it, but it can not see the Fire Stick it self.  So if you are like me and were hoping to fling your mobile phone/Tablet/PC content to your TV with the Fire Stick then until Amazon gets its software together then I suggest taking a look at ChromeCast, Apple TV or a device that supports Mircast and has a proven track record.I guess it does what it is supposed to do, which seems to be to make it easier for you to transfer wealth to Amazon by buying their  digital content. If they get the mirroring to work at least on an average level then I will bump it to 3 stars.", "verified": true, "helpfulness": "1/1", "author": "Charlie Brent"}]