[{"rating": 3.0, "review": "Works well, very good picture.  Extremely small number of channels compared to Roku.", "verified": true, "helpfulness": "0/0", "author": "Joseph Buchanan"}, {"rating": 5.0, "review": "Awesomeness!!!! If you do not have a smart TV buy this fire stick. It's faster than my blu Ray player with WiFi", "verified": true, "helpfulness": "0/0", "author": "Thomas Pannullo"}, {"rating": 5.0, "review": "Love this thing.  So much better than my chromecast, my smart blu-ray, and my smart tv.  I bought another for the bedroom.  Best money I spent this christmas", "verified": true, "helpfulness": "0/0", "author": "T. Clark"}, {"rating": 1.0, "review": "Pretty disappointed, buy it to see my shows while I'm working away from home (overseas) and as a user of Amazon Prime I can not see the free content outside the United States. According to the description of the article: \" Perfectly Portable. Take it with you on the go.Take Fire TV Stick with you and never miss an episode while you’re away from home visiting family or friends.\"As usual, Amazon does not explain the exact description of what can or can not do with the product...", "verified": true, "helpfulness": "1/4", "author": "Cilian"}, {"rating": 3.0, "review": "Seems to have limited range. Works most of the time and was a Bargain.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"J. Whitten\""}, {"rating": 4.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "Teankum Conway"}, {"rating": 5.0, "review": "Very good product in a small package.", "verified": true, "helpfulness": "0/0", "author": "K. Larson"}, {"rating": 2.0, "review": "I have to restart it often by unplugging the power", "verified": false, "helpfulness": "0/0", "author": "Chad Hawkins"}, {"rating": 1.0, "review": "It doesnt want to connect to public optimumonline with wich i have an account and password,just in a different housr.very dissapointed", "verified": true, "helpfulness": "0/3", "author": "Maciej Ramotowski"}, {"rating": 2.0, "review": "I'm going down to 2 stars.  I was close to 3 stars but I've got some issues that I think most others will agree with, after using for a while.  When this device hibernates, it doesn't wake very well.  In regular use, randomly it is quite sluggish here or there.  The fact that this device requires you to choose something before you can start enjoying content...  it is a pain in the butt to wait for it to let you choose something at times.  Sometimes I have to actually go and unplug it and then plug it back in.", "verified": true, "helpfulness": "0/0", "author": "B. McGill"}]