[{"rating": 5.0, "review": "Very easy to set up and super easy to use. What a great product.", "verified": true, "helpfulness": "0/0", "author": "David J. Bedini"}, {"rating": 5.0, "review": "Luv the ease of viewing ;)", "verified": true, "helpfulness": "0/0", "author": "anna olivo"}, {"rating": 5.0, "review": "So far, so good.  This was relatively easy to set up and maneuver through the menu.  It had no problems connecting to my home WiFi.  My wife and I love the huge selection of free programs we can watch through our Prime account, but I haven't tried to watch Netflix through this device yet.  Unfortunately, I can't replace the small remote with my universal remote since there is no line of sight with the FireStick, and as such, the FireStick uses RF signals rather than the IR signals that my universal remote uses.  So we have to keep the FireStick remote next to my universal remote and hope it doesn't get misplaced since it's not that big.  A small price to pay for this device's functionality.  I will experiment with adding photos next.  So I may update my review in the near future.", "verified": true, "helpfulness": "0/0", "author": "BrainDoc"}, {"rating": 1.0, "review": "Still can't get it to work  where are these thousands of free of movies", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome little device that takes up no space.", "verified": true, "helpfulness": "0/0", "author": "A. Customer \"Marti\""}, {"rating": 5.0, "review": "Well worth the wait!  Simple and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Jon DeMott"}, {"rating": 5.0, "review": "I love it!! It fits my life perfectly!! I recommend this product!!", "verified": true, "helpfulness": "0/0", "author": "Bryce"}, {"rating": 5.0, "review": "It was a gift from my son to his father,so far i am the only person that has used it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 3.0, "review": "It works great i just want to know why they charge me money to watch blue bloods when i can watch it for free on nexflix, just easier to get nexflix", "verified": true, "helpfulness": "0/0", "author": "joe"}]