[{"rating": 5.0, "review": "Purchase of the year, I sign up for prime, Netflix and hulu plus and get rid of cable, over 200 savings a month. Best acquisition of the year.", "verified": true, "helpfulness": "0/1", "author": "viniciuslopes"}, {"rating": 5.0, "review": "Bought this for my son.  I purchased the previous version for myself so when I saw this I thought he would like it. He loves it! it works great.", "verified": true, "helpfulness": "0/0", "author": "Judy E. \"Ms Book Worm\""}, {"rating": 4.0, "review": "Was easy to setup and came already paired to my Prime account.  The reason it gets 4 stars and not 5 is that when I attached it to my TV and 100 Watt per channel receiver, I didn't know that a demo would start playing and that there is no volume control.  The movie scared my wife and 17 month old son.It is my only device attached to the TV that doesn't have its own volume control so when I switch back and forth, I will need to change the volume on the receiver.", "verified": true, "helpfulness": "1/2", "author": "Robert E."}, {"rating": 4.0, "review": "Works very well.", "verified": true, "helpfulness": "0/1", "author": "Betty Weber"}, {"rating": 1.0, "review": "Chromecast connect to my network. Roku connects to my network, Fire Stick WILL NOT  connect to my network. Worthless.", "verified": true, "helpfulness": "0/3", "author": "BruceT"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Jessica"}, {"rating": 5.0, "review": "Really is great for any TV that does not have smart features.  Netflix and Amazon are easy to access.  Was a breeze to set up.You do have to plug it in to a power source either to electric or USB if you have one on the television.  I should have bought more when theywere only 19 dollars", "verified": true, "helpfulness": "1/2", "author": "marian kellerman"}, {"rating": 2.0, "review": "The fire stick works well and was easy to set up but you are very limited as far as what you can access and few apps are available.  In my opinion if you aren't a huge fan of Amazon Prime the fire stick isn't for you", "verified": true, "helpfulness": "1/3", "author": "Michelle Parry"}, {"rating": 5.0, "review": "Great value and easy setup.  Amazon has a winner here!", "verified": true, "helpfulness": "1/2", "author": "RNO"}, {"rating": 5.0, "review": "After having used the Amazon Fire TV Stick for several months now, I can tell you it is one of the easiest and best ways to watch all of your favorite shows any time and almost anywhere! We have cut back on our cable channels (and bill) because there is so much available when you have a Fire stick. We watch Netflix a lot, as well as streaming Amazon videos, music, TV - just about anything you want to see is out there. We LOVE this little device and highly recommend it if you like EASY to use and lots of choices.", "verified": true, "helpfulness": "1/2", "author": "EJB \"Emily\""}]