[{"rating": 5.0, "review": "Best product that i had ever try.", "verified": true, "helpfulness": "0/0", "author": "Javier fonseca"}, {"rating": 2.0, "review": "I already had Roku and Apple TV. Picked up a Fire TV. Fire TV is the worst out of the 3. Biggest complaint is the buffering. I am on 75 mb for internet. I understand that I will not get that on wireless but the Apple and Roku are wireless as well with no issues.  The home page for the Fire TV ia awful as well. Cluttered and no ability to hide or organize apps. The only thing Fire TV has going is the ability to load Kodi.", "verified": true, "helpfulness": "1/1", "author": "Shay44"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "dj atrain"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Nino"}, {"rating": 5.0, "review": "I got this primarily to connect to Netflix. Previously, I've used Push2TV to connect my laptop to the TV using WiDi. That worked OK, but I had to set it up each time we wanted to watch something.Then I used a feature on my Blu-ray player that allowed me to connect to Netflix. That was easier, but navigating the menus was slow and cumbersome.The Fire Stick is an entirely different experience. Set up was quick and easy. It is intuitive. It shows the new Netflix menu system which is much easier to use. Pausing, rewinding, and fast forwarding works perfectly. It loads the movies or TV shows and starts them in a few seconds (less than half the time with previous options, including my laptop). They don't stop part way to buffer, and the streaming quality never falters. It is how streaming Netflix on TV was meant to be.Someone mentioned in their review that the quality of the streamed movies seems better than other things they've tried. I agree with this. After the five minute set up, I watched \"House of Flying Daggers\" as a test. It looked so pretty that I just kept watching the whole thing. When my wife came in, knowing she didn't care much for that movie, I said we could watch something else. She said, \"But this is so pretty!\"The Fire Stick might be doing some enhancing on the fly, but I suspect that the increased quality may be because less of the video data is lost due to the Fire Stick's speed and large buffer. Regardless of the reason, it does seem that the quality of Netflix streamed content is improved when using the Fire Stick.One caveat. While setting up, I plugged the power adapter into a strip that powers my TV, DVR, Blu-ray, &etc.; I got a warning advising me to use the power adapter that came with the Fire Stick. Since I _was_ using the Fire Stick's adapter, I tried plugging it directly into the wall outlet. That cleared up the problem; I no longer got the message. In any case, there was nothing wrong with the Fire Stick or the power adapter; the problem was with the power strip. I suppose I need to get a new one of those.In short, this is how streaming Netflix on TV was meant to be.", "verified": true, "helpfulness": "1/1", "author": "xtsigs"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick works awesome, changed our whole TV experience from the way we've been watching and listening. Now we have our Amazon Prime, Netflix, Pandora, Spotify all streaming at lightning speed from one device!", "verified": true, "helpfulness": "1/1", "author": "Thomas F. Ivancic"}, {"rating": 5.0, "review": "A great way to increase your programming at a cost effective price.", "verified": true, "helpfulness": "0/0", "author": "Jack Alexander"}, {"rating": 5.0, "review": "Just received and very impressed with all that can be done with its use and amazon prime.  So much available without additional expense.  Highly recommend particularly if on a budget.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 4.0, "review": "FireTV Stick has outdone AppleTV on many levels...", "verified": true, "helpfulness": "0/0", "author": "Patrick S. McKoen"}, {"rating": 5.0, "review": "Happy with item", "verified": true, "helpfulness": "0/0", "author": "Francisco J Serna"}]