[{"rating": 3.0, "review": "I have a smart tv, so this is really only used when I travel. If I'd know I could access amazon prime subscription through my tv, I probably wouldn't have purchased this.", "verified": true, "helpfulness": "0/0", "author": "Cwilcher \"Charles Wilcher\""}, {"rating": 5.0, "review": "Perfect choice for streaming Netflix, Hulu and Amazon streaming content.  Easy to install and it hides behind TV instead of having a box taking up room.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Geno"}, {"rating": 5.0, "review": "Purchased on sale and it has been great for watching Amazon Prime movies and shows. Still learning other uses.", "verified": true, "helpfulness": "0/0", "author": "PB"}, {"rating": 5.0, "review": "everything i wished and more...", "verified": true, "helpfulness": "0/0", "author": "Sandra Kahl"}, {"rating": 5.0, "review": "I have a Fire TV and two sticks. The only problem I've had with the stick is the memory issues. I have a stick to my sister to checkout and she is already complaining about the memory. I've used the stick myself, but I know how to clear the cache, she doesn't. Because of that, it doesn't make it a bad purchase. It does everything the FireTV does, but just a little slower and without the same amount of memory. It is a good buy because of the cost. I like the Fire Stick and would not hesitate encouraging others to pick one up.", "verified": true, "helpfulness": "0/0", "author": "jwillin"}, {"rating": 5.0, "review": "works great but cant use my harmony remote with it", "verified": true, "helpfulness": "0/0", "author": "Jon Curtis Morris Jr"}, {"rating": 3.0, "review": "Worked okay for a few months, but then constantly froze and buffered every video I ever played. Called the internet company a few times a month for 6 months and after all of the headaches, went out and bought a Roku. Now my videos load perfectly every time.", "verified": true, "helpfulness": "0/0", "author": "Jenna"}, {"rating": 1.0, "review": "not as great as showed, also the Netflix doesn't work or don't know how to put the username and password", "verified": true, "helpfulness": "0/0", "author": "Ali Hassan"}, {"rating": 2.0, "review": "I over heats and stops working.  If I am on my tablet cruising the internet, it also stops working saying it cannot reach the signal.  Being 8ft away further from the wireless signal, everything is fine on my tablet.  Can't return it as I am outside of my window to do so.  I would suggest buying the other Fire TV item and not the stick.  If people had a better outcome than I do, I must have been sold a refurbished one with a \"new\" description.  For now I will use it when my tablet needs to charge.  Luckily I bought it on the Amazon birthday sale so it wasn't a complete bust.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 1.0, "review": "DOES NOT WORK WITH ANY OTHER APPS EXCEPT AMAZON. Netflix, skips. Hulu, skips. Most annoying price of equipment I have bought. Do yourself a favor and just buy chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Zack"}]