[{"rating": 4.0, "review": "Not at this time", "verified": true, "helpfulness": "0/0", "author": "Roberto M Gonzalez"}, {"rating": 5.0, "review": "Just awesome. Don't have to use your laptop connected via cable to your tv to watch all your subscribed services. Just one remote and access to it all. It's well worth the convenience.", "verified": true, "helpfulness": "0/0", "author": "D. Garcia \"garciad\""}, {"rating": 5.0, "review": "Great product. Hours of enjoyment!", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 5.0, "review": "the best $39 I:ve ever spent", "verified": true, "helpfulness": "0/0", "author": "DENISE KAHLE"}, {"rating": 1.0, "review": "What a complete joke. This POS wouldn't connect to the internet no matter what I tried. All my other devices connected just fine. I got online and phone support from Amazon and I did everything they told me to do and it still didnt work. Then they tell me my wireless router needs to be within 2.5 feet of the stick for optimal performance?! Wtf is the point of wireless? Not to mention it said signal strength excellent but still wouldn't connect. After searching online, apparently this is a common problem. Nice job Amazon of having a junk product you don't fix. Save your time and go with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Laura T."}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Joni L. Boykin"}, {"rating": 5.0, "review": "This is an awesome little stick! We plugged it in our TV and it was ready. We use it for Prime steaming, Netflix and amazon music. Also can watch you tube. Very simple to use! Great price!", "verified": true, "helpfulness": "0/0", "author": "Missy \"Missy\""}, {"rating": 5.0, "review": "I purchased this primarily to use in Hotel rooms, on their somewhat challenged WiFi. It worked, however, there were sometimes issues with buffering. I found I could pause it for 5 minutes or so, then restart the show and never had any buffering pauses after doing that.  It became my routine to find what I wanted to watch, start it, then pause while I did something else for a few minutes, then watch the entire show without interruption. Given the fare at most hotels, this was wonderful and well worth the price.Now I am home, and using it on a second TV with my high end WiFi equipment and there are no issues. The only thing I want is the ability to control it from my PC so I could search for content faster.", "verified": true, "helpfulness": "0/0", "author": "Charles F. Dwyer"}, {"rating": 5.0, "review": "pretty slick", "verified": false, "helpfulness": "0/0", "author": "Joan King"}, {"rating": 5.0, "review": "so far so good", "verified": true, "helpfulness": "0/0", "author": "Rick Strebel \"Fishing nut\""}]