[{"rating": 4.0, "review": "Good and makes for lots of fun watching. The only thing I would recommend is make sure your internet is fast as I have the best that we can get in this area and it can not handle it sometimes at peak volume hours.", "verified": true, "helpfulness": "1/1", "author": "Jim Dandy"}, {"rating": 5.0, "review": "just what i was looking for sooo happy :)", "verified": true, "helpfulness": "0/0", "author": "jade carbonell"}, {"rating": 5.0, "review": "its just what i needed & more.", "verified": true, "helpfulness": "0/0", "author": "andy"}, {"rating": 5.0, "review": "So great, I bought four Fire TV boxes (two for me and one for a daughter).  We have one in our RV and one at home.  It is the perfect RV companion because we don't have to worry about the local channel line up or our finicky BluRay player on the road.  The best feature is the voice search - unbelievably accurate and fast.", "verified": true, "helpfulness": "0/0", "author": "Pacaurora"}, {"rating": 5.0, "review": "The best!!!!! love this little guy!", "verified": true, "helpfulness": "0/0", "author": "Sparks \"Dasha Aussies\""}, {"rating": 1.0, "review": "Very slow and buggy. We had to restart it often. The Fire TV box is much better.  Try to wait till it's on sale if you can.", "verified": true, "helpfulness": "0/0", "author": "CC"}, {"rating": 5.0, "review": "Great for travel!  For the Size packed a big punch.  Very happy.", "verified": true, "helpfulness": "0/0", "author": "BOB"}, {"rating": 5.0, "review": "It is awesome!!!!!", "verified": true, "helpfulness": "0/0", "author": "Marquito"}, {"rating": 5.0, "review": "I love this device. Wish it had more apps like the Apple TV. The only issue is I don't think it has good child safety features on it. My son bought several movies the other day, like $120 worth, most movies we already had on DVD. So I have to learn how to lock that part of it.", "verified": true, "helpfulness": "0/0", "author": "Justin Wilson"}, {"rating": 5.0, "review": "Love this Stick, turned my great 55\" LED  TV into a Fantastic Entertainment center, complete with music.", "verified": true, "helpfulness": "0/0", "author": "K.Mc"}]