[{"rating": 4.0, "review": "Great!  Wonder if the bigger model (more $$) is any more reliable or if it's just my wifi service.  Decent selection of Prime videos.", "verified": true, "helpfulness": "0/0", "author": "H F"}, {"rating": 5.0, "review": "Great product and very affordable for $25.  Works great in the bedroom for streaming.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing is awesome! My husband and I have a really nice tv but it was purchased when Smart TV's were just hitting the floor. So it's not a smart tv and we've always had to run his Xbox or PS4 to watch Netflix or Hulu . . . now it's just this tiny thing we can take from tv to tv in the house easily!", "verified": true, "helpfulness": "0/0", "author": "Rose"}, {"rating": 5.0, "review": "Love this little bad boy!", "verified": true, "helpfulness": "0/0", "author": "Zxguy"}, {"rating": 4.0, "review": "I have had the Firestick only one day; if any of my comments change I will update this review.I have three Roku devices in my house, all of which work fine except at one location where all three have the same problem.  I have a hunch there are wires or other metals in the wall that are behind the TV that interfere with the roku and though the router is strong and in the same room, occasionally (two or three times a day) the Roku drops signal and re-boots.  And, two different TVs have been in this one location and the problem happened with both.  This is annoying and if I am deliberately leaving the TV on, say for music streaming, the streaming is shut down until I sign in to the streaming service again.  I did not contact Roku because I have found their support lacking.I bought a Netgear router to see if that was the problem and in fact it is much stronger than the one Verizon Fios provided me (they won’t admit that) so the speed of the downloads and the frequency of dropped signal were less,  but, still occuring.I then bought the fire stick hoping that the communication between the router and the fire stick would not be interrupted and after 24 hours it has not (not constant operation).There are two downsides to the Fire stick.  One, I had hoped it would draw sufficient power from the HDMI jack; it does not, so it does need supplemental power (power source provided in the box), which means I have one power wire I cannot conceal.  No big deal.  The second problem is that I stream music from Spotify.  The fire stick does not have access built in apparently so I had to (and it worked) download an app.  When I want to use Spotify I have to start it via my cell phone rather than just using the fire stick remote.  Not a big deal but took me awhile to figure out what they were trying to get me to do.  I have to imagine there are other programs out there that have the same requirements and I hope Amazon is not being dishonest by leading the user to Amazon prime (built in to the fire stick) instead of Spotify or other music streaming services and, again, it does work.The rest is all good.  This thing is speedy, a bit faster than Roku. It is less bulky (would be even less so if it did not need the power cord).  It was very easy to set up and, as I wrote earlier, seems to have taken care of the problem I was having with the dropped signal to the Roku.  During programs, such as music streaming, where there is no viewer interaction, the screen defaults to beautiful (probably UHD) photographs of geographic features from around the world.After one day I am happy with it other than the Spotify streaming complication and would buy it again.  I will consider it as gifts during the upcoming holiday season.", "verified": true, "helpfulness": "0/0", "author": "Karen53501 \"Karen Tyson\""}, {"rating": 5.0, "review": "Works with my WiFi  and TV", "verified": true, "helpfulness": "0/0", "author": "Gerald M. Schierberg"}, {"rating": 3.0, "review": "Having trouble with the sound quality at times. Picture will freeze up.", "verified": true, "helpfulness": "0/0", "author": "michael phillips"}, {"rating": 3.0, "review": "We have an apple tv and a roku that are 2 years old.  We tried the Fire TV Stick as an alternative because of the low price.  It is slower to load and stream any show compared to the other devices, and the format/layout is cluttered. Our future devices will be Roku brand.", "verified": true, "helpfulness": "0/0", "author": "david m."}, {"rating": 5.0, "review": "I would recommend one to anyone with prime account and a good internet connection. makes prime worth wile.", "verified": true, "helpfulness": "0/0", "author": "distillerman"}, {"rating": 3.0, "review": "It is cheaper than other system like Apple TV but it has also much less features loaded onto it. Other than this, it does its job with the basics like Netflix.", "verified": true, "helpfulness": "0/0", "author": "Alain Blasizzo"}]