[{"rating": 5.0, "review": "Awesome. Waiting to get the second one!", "verified": true, "helpfulness": "0/0", "author": "JLR"}, {"rating": 5.0, "review": "I've thoroughly enjoyed the Fire TV Stick....so much that I had to add another!  Besides Prime, it also gets me into other services I use such as Hulu, Netflix and Showtime.  Easy to set up, I had it up and running in less than five minutes.  Phone app on my android also makes it easy to use and voice searches are handy.  Highly recommended.  Hopefully more services to be added in the future to make it even better...HBOGO, MAXGO, CBS, etc. would make it a must have!", "verified": true, "helpfulness": "0/0", "author": "MartianSccr"}, {"rating": 5.0, "review": "Everything you want in one.", "verified": true, "helpfulness": "0/0", "author": "justin"}, {"rating": 5.0, "review": "Everything worked as expected.", "verified": true, "helpfulness": "0/0", "author": "Jerome L. Mccormick"}, {"rating": 5.0, "review": "I am really enjoying it.  It was very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fire stick is above and beyond ChromeCast without a doubt!  So much more available on the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "CQ Richardson"}, {"rating": 4.0, "review": "It is aperfect product and i do many things with it but i have some proplemls because in egypt full options not work", "verified": true, "helpfulness": "0/0", "author": "mhmd samier"}, {"rating": 3.0, "review": "Its ok. It would be excellent but for a lot of those apps like watchespn and such, u still need a cable provider. I bought the fire stick to avoid a cable provider. If i could have watchespn without a cable provider, 5 stars!", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 1.0, "review": "This product failed to start a fire. I was very disappointed. :( Now I have nowhere to cook my TV.", "verified": false, "helpfulness": "1/2", "author": "Riley Meacham"}, {"rating": 5.0, "review": "Fire stick is fast and awesome.  As good or better user interface than Apple TV.  As fast as Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Cory Dzbinski"}]