[{"rating": 5.0, "review": "I pre-ordered it the day it was announced so I got it super cheap - at the price I paid, it's definitely worth it. At full price, probably still worth it - particularly if you are an Amazon Prime member.  I also have a firetv, and this provides almost the same experience, only slightly slower (and cheaper).  Even though it's not as fast as the firetv, it is definitely faster than the Roku stick, which I think is it's main competitor - the Roku stick is slow enough to be annoying.  I also have a chromecast, which some people like to compare this to, but to me, they are completely different animals as the chromecast has no functions without a phone or tablet to send things to it, while this firetv stick can operate without a phone or tablet sending content to it.  As far as recommendations, if you are heavily into amazon and it's media portals, then absolutely this firestick is the way to go, if your not into amazon prime so much and maybe watch more netflix, then the chromecast mght be a better option.", "verified": true, "helpfulness": "2/3", "author": "Ms. T"}, {"rating": 1.0, "review": "Apps do not support Charter as Cable provider. This is pointless. Stick with Roku.", "verified": true, "helpfulness": "0/4", "author": "Nate Swartz \"Zeppelin1521\""}, {"rating": 3.0, "review": "Long time prime and Chromecast user. Acts just like Chromecast but with the addition of  UI on the TV. It is pretty quick and very responsive compared to the Chromecast and the upgraded WIFI helps a ton with buffer times. My biggest complaint with the FireTv Stick is that not all apps work with it. Googles chrome browser and app, play music, photos and plex all fail to detect the FireTv stick while the youtube and Netflix app detect it just fine. There is a plex app on the amazon app store that is advertised in the FireTv's UI which would lead me to believe plex will work. But I do not want to buy the same app for another 5 dollars. On the plus side, It does support dolby digital for 5.1, which is definitely a big plus over the Chomecast.The FireTv wants to be treated as an Operating system that you can launch apps and it does this pretty nicely. But It does not incorporate the apps enough into the OS like it should. Instead they force you to go to a list and launch the app to use it in any way. This means that when you search in the UI and use it to find stuff to watch, It is only amazon stuff and guess what, most of it cost money.Some key apps not working or maybe blocked(?) Really hurts this guys rating. And the UI needs more time to develop and figure out the best way to interface with apps and users, which will come in time. I look forward to a number of these complaints going away with software updates and then it will get the extra two stars.", "verified": true, "helpfulness": "2/3", "author": "Troy T."}, {"rating": 3.0, "review": "My major complaint is that the audio and video frequently stutter. Also, the UI is a little sluggish (sometimes one click gets registered as two, etc.). Overall, I think the chromecast is better.", "verified": true, "helpfulness": "1/2", "author": "Allen"}, {"rating": 5.0, "review": "The fire stick is fast friendly and a joy to work with. It has a lot to offer and more on the way. Ultraviolet films are missing but not a big deal as the prime movies generally has me covered. The speed and quality of the device is excellent. The remote is much nicer than the lack of remote with certain other dongle. If you are a cord cuter who uses amazon a lot, this is a needed item.", "verified": true, "helpfulness": "1/2", "author": "zman0179"}, {"rating": 3.0, "review": "First and Foremost I reserve the right to come back an edit, weekly if need be.I bought two Fire TV sticks because of the amazing deal for Prime members. I had been hemming and hawing between a Fire TV, a Roku 3 or a Chromecast device for a couple of weeks and then the deal popped up. I instantly ordered them.I have used the Amazon Prime instant video app on a game console for a while now and I had an idea what to expect. Fire TV adds access to several other apps from the App store including Watch ESPN, Netflix etc. All of the biggest hitters you would want access to.Installation was a mixed bag. I initially installed the stick on my TV's 4th HDMI input on the side, I figured it would give the best access and there were 2 USB ports for power if I wanted them. However, from this position the stick was too close to the edge of my entertainment center and also close to a couple other electronics. Namely two wi-fi connected game consoles, and an external HD. I believe this caused the Wi-Fi in the Fire TV stick to have issues connecting. One other thing I did was to plug in the ac adapter. It is recommended for a more consistent power supply. I am okay with this, and I could have plugged it in to my USB ports and been fine too, or used a Y USB splitter for more juice.That wasn't so much the issue as was the software not being able to notify me of an issue. It would initially show that it was searching for networks and then the screen went blank. There was no prompt stating there were issues. Some kind of error coding when the stick is getting interference or having issues would be great.I after several failed attempts to reboot and troubleshoot, I moved to another television. I was able to connect seamlessly and update and install everything for the stick. This is all handled automatically. It's pretty painless. Once the software is installed, there is a mandatory tutorial video that I would have loved to skip. I know what I am doing, give me the option. Unstoppable videos suck.One I got through all of the set up I poked around in the menu. There are a lot of options and your normal Prime and Instant video categories. As well as access to apps and games. I look forward to playing around more and more with the Fire TV sticks. If you are a Prime member I can definitely recommend getting one for an extra tv or a basement tv or guest room. It is fairly fully featured, and I will be back to update once I have had more time with it.", "verified": true, "helpfulness": "33/35", "author": "Paul Indelicato"}, {"rating": 1.0, "review": "I, like many others, grabbed two of these when they were on sale for $19.  I live in a 1400 SF one story house and have used other wireless streaming devices.  Our favorite has been a Roku, which we had no problems with setting up and connecting.  We have also used other devices (Blu-ray with Wifi, etc).  This device has been nothing but a pain in the butt to setup.  We tried in a bedroom and could not get this to recognize our wireless....we plugged the device in and followed all steps.  After several restarts (fire stick and router/modem) and troubleshooting, we finally got this thing to work in the living room, right next to the router.  Tried to move it back to the bedroom...same connectivity issues.  Seems bogus since we never had one problem using any other wireless streaming device in our home.  We still aren't using it, because it isn't working how/where we want it to.  Overall, such a disappointment for this loyal and loving Prime member.  It shouldn't be this hard to setup.  I bought the other for a gift, but it doesn't seem like a gift anyone would want to deal with.", "verified": true, "helpfulness": "124/141", "author": "MamaMer"}, {"rating": 4.0, "review": "limited to only certain apps.  would be nice to download stuff like abc, nbc, etc for free.", "verified": true, "helpfulness": "2/3", "author": "game player"}, {"rating": 4.0, "review": "Responsive, easy to navigate, simple to setup. One thing if you're a prime member and ordering it for someome be sure to purchase as a gift.  Or deactivate it from your online account. The device comes linked to your prime account.", "verified": true, "helpfulness": "1/1", "author": "Joseph Kaminski"}, {"rating": 5.0, "review": "Great product, easy to install. Enjoying the Netflix and Amazon movies in our living room!", "verified": true, "helpfulness": "0/0", "author": "LauraBen74"}]