[{"rating": 5.0, "review": "love my new fire stick still more to learn about it", "verified": true, "helpfulness": "0/1", "author": "Flutterby"}, {"rating": 5.0, "review": "I have used this without any problems. Love it. Stopped my premium cable subscription. Every day the Fire Stick has something new to offer. I got another FS for my bedroom.", "verified": true, "helpfulness": "0/1", "author": "cmeplay"}, {"rating": 3.0, "review": "It was too slow. The picture got blurry and would freeze and then go really fast. I returned it. We migh try the fire TV.", "verified": true, "helpfulness": "0/1", "author": "Katie Rich"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Maria Claudia Granovsky"}, {"rating": 5.0, "review": "I really love the Fire stick, we usually use chromecast on our house but this is definitely better, more speed, very good HD quality even with regular speed DSL about 5MB/S, is easily to use compared to chromecast since you don't need another device to control the streams, extremely good integration with amazon video.", "verified": true, "helpfulness": "1/2", "author": "Leonardo Tovar"}, {"rating": 5.0, "review": "I love the Fire TV Stick.  I plugged it in and within 5 minutes I was browsing the menu.  It even registered my Amazon Prime account automatically.  I wish I got one a long time ago.", "verified": true, "helpfulness": "0/1", "author": "S. Burks"}, {"rating": 5.0, "review": "Easy to use and great access to all my shows!", "verified": true, "helpfulness": "0/1", "author": "Thi Kim Eichen"}, {"rating": 3.0, "review": "Its funny that prime works fine, but Netflix doesn't. Its OK, I guess.", "verified": true, "helpfulness": "0/1", "author": "Shauna Thompson"}, {"rating": 2.0, "review": "I'm having issues with my fire stick in that it \"stalls out\" every 90 seconds or so. Whenever I play music, games, or attempt to watch a movie, the media will pause after about 90 seconds and I have to press play to resume. How am I expected to watch a movie if I have to select play every 90 seconds????", "verified": true, "helpfulness": "0/1", "author": "Tar Heel Girl"}, {"rating": 5.0, "review": "It arrived on time and I'm very pleased with it so far.", "verified": true, "helpfulness": "0/1", "author": "Lisa Haumann"}]