[{"rating": 1.0, "review": "I guess I had a different experience than the other people who left reviews.  I had my brother buy it since he has prime - it was $20.  I used it and had all sorts of issues.  The Amazon Fire TV and TV stick are supposed to have really powerful processors but when streaming netflix or sling TV, both programs would stutter a lot.  The WiFi router really wasn't far away and I've used my Roku 3 (which I bought to replace) with no issues.In addition, I would constantly get the \"HDCP unauthorized. Content Disabled\" error.  I could unplug the stick from the TV, disconnect its power and cycle the TV off/on but it KEPT COMING BACK.  I tried all the HDMI slots on the TV but it continued over and over.  I would have the error maybe 1 out of every 10 times I tried to use the stick.Overall, had a very poor experience, switched to a Roku 3 and have seen a night and day difference", "verified": true, "helpfulness": "0/0", "author": "Dee Way"}, {"rating": 5.0, "review": "This is truly incredible. My husband, who is not a tech expert, LOVES his Fire Stick. He uses it every night and can't believe how easy it is, not to mention a fantastic value.", "verified": true, "helpfulness": "0/0", "author": "CC Roberts, Ph.D. \"Dr. CCR\""}, {"rating": 3.0, "review": "I bought this to sideload kodi on it, and there is a lot of buffering issues with it. I can watch a show or 2, then have to clear the cache from the app and restart kodi. Problem solved, but it would be nice if amazon would fix this issue. They have the kodi app for download on the amazon site, so it's something that they should be supporting.", "verified": true, "helpfulness": "0/1", "author": "quickster"}, {"rating": 5.0, "review": "I really love my fire stick and plan on getting another one for another tv!!!", "verified": true, "helpfulness": "0/0", "author": "stacey r green"}, {"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Chris Ostolski"}, {"rating": 5.0, "review": "Works just like is was suppose to. Love it.", "verified": true, "helpfulness": "0/0", "author": "Van Hagan"}, {"rating": 5.0, "review": "easy to set up and my mom has no trouble using it great deal", "verified": true, "helpfulness": "0/0", "author": "slowmotoad"}, {"rating": 3.0, "review": "Great product but I wish it had a power button as it stays on forever causing it to freeze fairly often.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm not much of a television fan. I don't turn it on everyday & personally could live without it completely & not miss it...until...Firestick! I was thrilled from day 1. The HDMI connection was a snap to install &  the selection of tv shows & movies is larger than expected. Prime is a must though, so even more is available at no additional charge. Shows/movies are separated by genre & using the search feature is simple & effective. I'm thoroughly pleased with it.", "verified": true, "helpfulness": "0/0", "author": "CSACHB"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Nick Aleszczyk"}]