[{"rating": 3.0, "review": "Well let me start out by saying HOW DISAPPOINTED  I am I was led to belive that with my amazon prime membership movies we're free (NOT SO) I could have saved 140.00 dollars  and continued doing  what I was doing all along just going to the store and renting a movie yea it's convenient to just push a button but damn I didn't want to do that I want to just sit down and watch a movie .", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "I have 3 Roku's and ChromeCast, and all put together they aren't as good as fire tv.  Being able to sideload apps is gold, Kodi (XBMC) runs like a charm.", "verified": true, "helpfulness": "0/0", "author": "Blaze"}, {"rating": 5.0, "review": "Just incredible. I've been a Prime member for two years and own the Amazon Prime box for streaming TV. My college age daughter wanted one like mine, so when Prime released this little gem, I immediately snagged it for her. She loves it and uses it with her own Prime school account. Another winner, Amazon! Keep bringing us innovative products like this one!", "verified": true, "helpfulness": "0/0", "author": "KY girl living in L.A."}, {"rating": 5.0, "review": "I  love it, thinking about getting another one for my room.", "verified": true, "helpfulness": "0/0", "author": "Theresa Kolb"}, {"rating": 5.0, "review": "My wife loves this product. She is able to watch her TV shows and NETFLIX. She is extremely happy and loves the versatility of the product. I got it at a great price too.It runs a little hot though.", "verified": true, "helpfulness": "0/0", "author": "Arif Amjad"}, {"rating": 4.0, "review": "The stick itself was fine.  The problem was I did not realize the stick itself needs to be attached to its own power source.  I thought it was free-standing like a flash drive.  They don't show it with a power cord sticking out.To make matters worse, the cord they provide is only 3 Ft long, barely enough to reach an outlet unless the outlet is directly behind the TV.  I had to spend another 15$ to get an adaptor b/c the port is not a standard micro port.", "verified": true, "helpfulness": "0/0", "author": "JustMe \"Corinne\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "tamika"}, {"rating": 5.0, "review": "I love my Fire Stick. It is great way to use more of  my Prime benefits. Having access  to not only the Prime offerings but the other apps and games on a big screen is amazing.", "verified": true, "helpfulness": "0/0", "author": "Victoria Fain"}, {"rating": 3.0, "review": "I get serious lag while trying to stream netflix despite a strong wifi signal. Has unresponsive controls sometimes.  Needs occasional restarts.  It still streams better than my cheap smart TV,  so that a bonus.", "verified": true, "helpfulness": "0/0", "author": "M.C. \"Mike\""}]