[{"rating": 5.0, "review": "I love the fire tv stick. It has all of my favorite apps and so easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Fatoumata"}, {"rating": 5.0, "review": "Live this!  It's so easy to use and instant access.", "verified": true, "helpfulness": "0/0", "author": "Zoogs"}, {"rating": 5.0, "review": "Great, easy to install and program.  Get it.  You'll be happy you did.", "verified": true, "helpfulness": "0/0", "author": "Susan A. \"Susan A.\""}, {"rating": 3.0, "review": "Connection don't stay well!", "verified": true, "helpfulness": "0/0", "author": "Michele"}, {"rating": 5.0, "review": "best best best best best", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Easy to use, works well. Good value for price.", "verified": true, "helpfulness": "0/0", "author": "M. Riley"}, {"rating": 1.0, "review": "This is the worst piece of garbage I've ever gotten from Amazon.  I'm shocked.  I've had 3 different types of Kindles from Amazon, different Amazon brand things like batteries, etc...and now this stick.  Everything else has worked wonderfully, but this stick...I'm ready to just throw it away and be done.  It does not stay connected to the internet, and when it actually does then the Fire Home screen tells me it's \"currently down.\"  It will stop mid show, even!  There is no winning with this ridiculous device.  My old Roku box that I replaced with this stick worked and functioned much better.  I'm sorry I ever purchased this.", "verified": true, "helpfulness": "0/0", "author": "Iisha"}, {"rating": 4.0, "review": "It's nice to have the remote and access to all my programs with the Fire Stick. Set up was fairly easy, though if you don't have an immediate connection it takes you back to the beginning menu to start over, which is a pain. My mother's stick suddenly has stopped working in the same house, and she can't figure out why, and it can be pretty hard to get tech support.The one enormous draw back which I don't see a reason for is that you have to have an external cord running to a plug to use this. There are hacks to get around this I believe, but it is frustrating to have to find excess plugs to use to make the Fire Stick work when for example you have a flat screen mounted to the wall with 2 outlets - one for the tv and the second for a DVD player or a modem, and you then have to run a cord for the Fire Stick. Amazon seems to know this is a huge downer as they market all photos with no mention or images of the cord necessary for it to work. Keep this in mind if it's a big deal to you.Overall I'm glad I have it, but frustrated about the outlet situation as it makes the wall look messy and our dog keeps running into the extension cord.", "verified": true, "helpfulness": "0/0", "author": "Drewry"}, {"rating": 5.0, "review": "enjoy it all the time", "verified": true, "helpfulness": "0/0", "author": "jo ann cherry"}, {"rating": 5.0, "review": "Love this! It is very fast and has all my favorite apps!", "verified": true, "helpfulness": "0/0", "author": "BrittneyBeard"}]