[{"rating": 4.0, "review": "I'm loving it! It's small easy to use it packs a pretty big punch for how small it is, and the wi fi reception is awesome, and the really cool thing about it is you can un plug it and use it anywhere you have a TV set.", "verified": true, "helpfulness": "0/0", "author": "gene a correa"}, {"rating": 3.0, "review": "I like it but, with a caveat.  One of the sights I was looking forward to was FoxSports.  The apparently have relinquished their permission and it is no longer available with the FoxSports Go app.  The stick seems to work as advertised.  I would appreciate more choices though.", "verified": true, "helpfulness": "0/0", "author": "Harry Taylor"}, {"rating": 4.0, "review": "Easy to use & install. It does hang up occasionally. We are really enjoying it!", "verified": true, "helpfulness": "0/0", "author": "cgarber11"}, {"rating": 5.0, "review": "I love it.  I have only watched a couple of movies but am pleased with the way it works.  Easy to set up and easy to use.  Thanks.", "verified": true, "helpfulness": "0/0", "author": "marcia johns"}, {"rating": 5.0, "review": "Love the new Fire TV Stick. Quick and easy to use. The only criticism i'd have is that the card should be longer but other than that, this was a great purchase and a good price", "verified": true, "helpfulness": "0/0", "author": "Kelli Davis"}, {"rating": 1.0, "review": "Is crap!!!!!! , burned in a month", "verified": true, "helpfulness": "45/47", "author": "Ricardo F"}, {"rating": 5.0, "review": "I absolutely love this product, I have been using a Wii for Netflix and Hulu and such, and this makes all that so much easier! Honestly cannot say one bad thing about it.", "verified": true, "helpfulness": "0/0", "author": "Kirby"}, {"rating": 5.0, "review": "I love the fire stick!!!  Item is a lot more responsive than the other products of this type and easy to use", "verified": true, "helpfulness": "0/0", "author": "Noriyuki W Turbeville"}, {"rating": 5.0, "review": "definitely a great buy recommend all my friends and familygreat value", "verified": true, "helpfulness": "0/0", "author": "charles l bush"}, {"rating": 5.0, "review": "Very pleased with the Fire TV Stick. It performed extremely well, only difficulty experienced was the \"streaming speed\" of the internet provided, which obviously has nothing to do with the Stick. I like that it is small and out of the way. Highly recommend it over Apple TV, which I also have, but use the \"stick\" while on vacation and to access Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "John Bielagus"}]