[{"rating": 2.0, "review": "Jumps a lot seams to be slow.", "verified": true, "helpfulness": "0/0", "author": "kenny boone"}, {"rating": 5.0, "review": "Runs all programs just as well as the big brother except a lot warmer.That said, it's the best device out there at this price point.", "verified": false, "helpfulness": "0/0", "author": "Thang T."}, {"rating": 5.0, "review": "Absolutely live this!  It is so easy to use!!", "verified": true, "helpfulness": "0/0", "author": "fred burningham"}, {"rating": 1.0, "review": "Horrible picture quality.", "verified": true, "helpfulness": "0/0", "author": "Eric Duvall"}, {"rating": 5.0, "review": "Does the job and does it well. No lag that I notice. Menu is as good or better than AppleTV. I refer this over AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Huther"}, {"rating": 5.0, "review": "Love it! So much better than a Chrome (stick?) and less expensive than an Apple TV. If you want to make your TV smart...use this! If you want to make it smart AND incorporate it into your Mac Household, go with the Apple TV. BUT I will NEVER say go buy a ChromeStick...I just can't. It's a terrible piece of equipment, while your other less expensive or more useful products put out by Amazon and Apple are must haves!", "verified": true, "helpfulness": "0/0", "author": "Jacob Stanfield"}, {"rating": 3.0, "review": "there were some TV shows I wanted to watch but you had to pay additional for them, very few TV shows to watch that you don't have to pay extra for", "verified": true, "helpfulness": "0/0", "author": "Reggee"}, {"rating": 5.0, "review": "LOVE this contraption!! The movies, shows and works so well. I've considered canceling cable because I mostly use this.", "verified": true, "helpfulness": "0/0", "author": "sarah Doherty"}, {"rating": 4.0, "review": "JW Broadcasting, a major streaming favorite of mine, is missing from the Amazon Fire TV Stick. I was very disappointed at that omission because I can access JW Broadcasting on all my smartphones and tablets, and even on Roku and Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Melvin D. Craig"}, {"rating": 5.0, "review": "nice addition", "verified": true, "helpfulness": "0/0", "author": "timothy w reilly"}]