[{"rating": 5.0, "review": "Great product. Replace my Roku that I was using, night and day difference.", "verified": true, "helpfulness": "0/0", "author": "Patricia K Mapel"}, {"rating": 5.0, "review": "Extremely easy setup....Worth the money.  Makes any of your Tvs a smart tv. The only thing it needs is to be plugged into a HDMI port and let the fun begin.", "verified": true, "helpfulness": "0/0", "author": "cara tamburich"}, {"rating": 5.0, "review": "This is awesome! I haven't had any issues with it so far. I did struggle to open the remote backing but got through it! Ha. The only thing is I wish you can add other TV viewing apps like NBC or ABC so I can catch up on shows that way! But we have a Netflix account and everything was so simple to connect to. I have a Wii and connecting to Netflix is a 30 minute process and even longer when the wireless connection is \"weak.\" But with the stick it surprised me how easy it was! And I love how easy it is to go from one TV to the next. Great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "👍", "verified": true, "helpfulness": "0/0", "author": "Nitin"}, {"rating": 2.0, "review": "Paying for each App/channel ends up to be the same cost for cable. Most of the free channels are not worth watching.", "verified": true, "helpfulness": "0/0", "author": "NL"}, {"rating": 1.0, "review": "This is a very disappointing device.  I have very fast WiFi but this stick drops the signal and has to rebuffer repeatedly.  The Fire TV device is listed as not knowing IF it will be restocked.  Come on Amazon, WiFi just cannot handle HD programming without issues.", "verified": true, "helpfulness": "0/0", "author": "T. Berwick"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Amalia Gutierrez"}, {"rating": 5.0, "review": "Everything works as advertised, very good value for money", "verified": true, "helpfulness": "0/0", "author": "Gill Moran"}, {"rating": 2.0, "review": "Having problem with the sound cutting out. I don't have a problem with my TV Fire.", "verified": true, "helpfulness": "0/0", "author": "litehoss \"Hoss\""}, {"rating": 5.0, "review": "Love it!!!!!!", "verified": true, "helpfulness": "0/0", "author": "vcsurferdude"}]