[{"rating": 1.0, "review": "In the first day it was working good but now im on my third stick and im crossing my fingers. I have sound problem and now playback. In addition to stuttering on any bitrate I seem to experience severe playback issues,with complete freezing sometimes  CPU on the stick, or networking issues. never had a problem with my Roku or Ps3.", "verified": true, "helpfulness": "0/0", "author": "lenny peralta"}, {"rating": 1.0, "review": "Don't know because I won't get it until January!  Not sure why the big ad blitz and all if you don't even have the product ready to sell.  Poor choice, Amazon.", "verified": false, "helpfulness": "1/6", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Better than Chromecast, but I think the Roku 3 is still the champion.  My wi-fi connection is much stronger on Roku.  This is imperative for streaming.", "verified": true, "helpfulness": "0/1", "author": "Tony T"}, {"rating": 2.0, "review": "I wanted to like this.  I really did.  I was so excited to get the 2 I pre-ordered that I went ahead and sold my Roku stick as I could buy both of these for what I got out of my Roku.  My main use for these would be Netflix, Hulu, Prime Video and Watch ESPN (live streaming).  I eagerly installed this just in time to watch a college basketball game on ESPN3.  I've been using ESPN3 flawlessly on my Roku.  The Fire TV stick was a different story.  Streaming would buffer at least every 30 seconds and it closed out on me on multiple occasions.  I thought maybe I had a bad unit, so I set up my other fire stick.  This one, I put in my living room, within about 15 feet from my router.  The same problem occurred.  I was so disappointed not only in this product that I had eagerly anticipated but also in the fact that I sold my Roku stick.  I will be returning and re-ordering Roku sticks.I will note that Amazon streaming content and Netflix streamed just fine in the limited time that I used these.The thing that really bothered me was how much these sticks were bogging down my network while they were idle not streaming anything on my TV's.  The background buffering of Amazon content must consume large amounts of bandwidth.  The interface is quick and nice looking, but to me its not worth the negatives.  I thought these were a steal at $19, but now I'm ready to admit my mistake and make things right again for me.", "verified": true, "helpfulness": "5/6", "author": "CG- Illinois"}, {"rating": 5.0, "review": "Does great job...everything i wanted", "verified": true, "helpfulness": "0/1", "author": "LARRY WAYNE PORTER"}, {"rating": 2.0, "review": "Wifi performance is not good.  Only Amazon content is stable, Hulu regularly stutters (not a problem on the ATV2 in the same room) and Plex is so slow it's almost unusable.  I like the interface and remote, but if it doesn't stream well what's the point?  For $19, it's a nice cheap way to view Amazon content only, at $39 I'd say you'd be better to spend the money to get a fully functional box.", "verified": true, "helpfulness": "0/1", "author": "T. Morrow"}, {"rating": 4.0, "review": "Extremely practical. The price was perfect for the value of me using it. I just wish amazon would add more movies to their rent section so I could rent ANY movie thats out like redbox or other sites.", "verified": true, "helpfulness": "0/0", "author": "BackwoodsDoc"}, {"rating": 4.0, "review": "Works as advertised - my only quibble was that it wouldn't update on my home wireless network. Worked just fine at my dad's house, though. Once the software update was done, everything else was fine.", "verified": true, "helpfulness": "0/1", "author": "tppeake"}, {"rating": 1.0, "review": "One of the reasons I ordered the stick was because it plugs directly into the tv, so I was surprised that it came with a power cord that plugs into the wall.  Could have just used a box.  The stick gets hot and didn't connect to my wifi reliably.  I have several devices that connect to my network without issue, but the stick will no longer even recognize an available network to which it can connect.  It is useless, so I'm returning it.", "verified": true, "helpfulness": "1/4", "author": "Amanda Bibb"}, {"rating": 5.0, "review": "Works great. Easy to setup and use and this is my first step into streaming devices.", "verified": true, "helpfulness": "1/2", "author": "Joshua David Jordan"}]