[{"rating": 1.0, "review": "Very disapointed. It kept dropping the wifi signal even though all other devices in the house didn't have an issue.", "verified": true, "helpfulness": "0/0", "author": "Neelima"}, {"rating": 5.0, "review": "Easy to hook up, easy to understand and is great for the money.", "verified": true, "helpfulness": "0/0", "author": "Nola wondernine \"L\""}, {"rating": 5.0, "review": "really enjoying the movies and the Bosch series", "verified": true, "helpfulness": "0/0", "author": "Silas L. Jervis"}, {"rating": 5.0, "review": "I previously owned Google's Chromestick and really enjoyed that, however the Fire Stick has so much more and is much easier to access and use. There are a lot of apps and it is very easy to navigate. If you have Prime Membership, the Stick is even more enjoyable. Definitely great value at this price. Highly Recommended!", "verified": true, "helpfulness": "0/0", "author": "Joshua H. Bird \"StreetGang\""}, {"rating": 5.0, "review": "Absolutely marvelous, A must-have", "verified": true, "helpfulness": "0/0", "author": "jeffrey jimenez"}, {"rating": 5.0, "review": "This this is phenomenal! I love it better than my Apple TV (which feels like a total betrayal) because I'm able to access my Amazon Prime. We can't watch HBO Go, but it's a good trade off in my book. I definitely would recommend a Fire TV Stick to anyone. It's so easy to use and set up as well.", "verified": true, "helpfulness": "0/0", "author": "Alesha"}, {"rating": 5.0, "review": "Best tool for a true core cutter.", "verified": true, "helpfulness": "0/0", "author": "Larry Austin"}, {"rating": 5.0, "review": "It's everything it says it is. You'll get the max experience if you have amazon prime. I love that you can play games too", "verified": true, "helpfulness": "0/0", "author": "sofija mlakic"}, {"rating": 5.0, "review": "I love the Fire TV Stick! It was so easy to install, and the options for viewing are great--so much to choose from, I don't know where to begin! Also, the quality of video is so much better than our cable, which keeps sputtering and skipping and telling us \"this channel will be available shortly.\" We are using the Fire TV Stick with WiFi, from our cable company, but we will probably be discontinuing the cable tv. For the ease of use, the quality of the watching experience, and the huge selection of movies, television shows, etc., available through by Prime subscription, the Fire TV Stick is an amazing value. If you are a Prime member, what are you waiting for?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super duper!", "verified": true, "helpfulness": "0/0", "author": "xl33tgamerx"}]