[{"rating": 5.0, "review": "So easy to plug in and start using!  We have netflix and amazon prime and had just gotten rid of several cable channels and a few set top boxes so we were thinking of ways to have just as many programming choices and watch on more then one TV.  This is an affordable solution and the amazon prime app on this fire stick is much more user friendly and easier to navigate then the app on our Sony Google TV.  You can also stream prime music through this app on any TV.", "verified": true, "helpfulness": "0/0", "author": "Oldita Doherty \"Dita\""}, {"rating": 2.0, "review": "So far... not impressed.What the product description does not tell you is that only SOME TV providers allow the Showtime app to work. I have DirecTV and the Showtime app works on all of my mobile and streaming devises... except the Fire Stick. For some reason, DirecTV does not support Showtime on the Fire Stick. Nowhere in the product description does it list the approved TV providers so I would have no idea that this limitation existed.Sure, Netflix and Prime streaming works, but did I need a new devise to do what my PS3 and PS4 can do... nope!I got this devise so that I could use it with all of my subscriptions and take it on the road with me.... guess what, can't do that either. If you plan to use this devise in a setting like a hotel room with a web protected WiFi, DON'T GET THIS. You cannot use this devise with web protected WiFi. I just paid for something that 3 other devises in my house can do... not to mention my Ipad and Iphone as well.One last disappointment is that I cannot use my TV's on-board USB for power to this devise... It says it is not a supported power supply and it makes you plug it in to an outlet which I find to be unattractive and unnecessary.I normally love Amazon and everything they touch... this however is a huge disappointment, and if I had not received the Prime price of $19.99 I would be returning this... but for $20 I guess I can keep it.The only reason I am giving it a 2-Star and not 1-Star is because Netflix worked really well and the HD video quality was good.", "verified": true, "helpfulness": "0/1", "author": "David Orsi"}, {"rating": 5.0, "review": "AMAZING! IT REALLY WORKS AS EXPECTED.- I TESTED IN \"LATIN AMERICA\", AND IT WORKS! AS EXPECTED, AMAZON VIDEOS DOES NOT WORK.- AIRPLAY = YES!  I DOWNLOADED  \"AirPlay&UPnP;\" FOR THAT PURPOSE.- EASY TO USE, NICE INTERFACE.", "verified": true, "helpfulness": "0/0", "author": "Alvaro Munoz \"MUAR\""}, {"rating": 4.0, "review": "I love almost everything about this. It has great features and has many apps to download. However, aside from the wonderful features and user friendly abilities, it tends to have a lot of trouble staying connected to the internet and the videos almost never match with the sound. Aside from this, I absolutely love the product. I am simply hoping that I am experiencing internet problems and hoping that it will resolve itself. I think the any future products should have the ability to search within amazon prime movies rather than a general search, that way I can search movies that are included exclusively with amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Matt Schwartz"}, {"rating": 2.0, "review": "I have not received my Fire Stick yet,  (projected delivery December 21st.) but I have done some research on what it will and will not do.As a long time Prime member, I ordered the Fire TV Stick when a discount was offered to Prime members.  Since my Internet TV (Toshiba) does not have an Amazon App, I have to use my Windows 8 PC to play Amazon videos, using the TV as a monitor screen.  This works great, but ties up my PC.The other reason for my interest was because it supports Miracast.  I have a Surface Pro 3 and conduct a lot of classes using PowerPoint.  This would allow me to project my Surface Pro 3 onto the TV as an expanded Display and see how my presentations appear.  I considered ordering the Actiontec ScreenBeam Mini2 Wireless Display Receiver which got really good reviews, but this appeared to be a better solution and offer more functionality.The info on the Fire Stick says it is \"Miracast Certified\", but I could not find anything on the Miracast feature on Amazon's website, but I did find quite a bit of information on forums.  If you are planning to use Miricast with a PC, this apparently does not work.  Although Amazon indicates that the Fire Stick will work with \"Tablets\", they do not specify that this is not true of ALL tablets.  Miracast as implemented by Amazon is incompatible with the Miracast on Windows PCs.  Whether this will be fixed or not is unknown.Amazon Prime recently gave subscribers to some really nice storage/sharing for photos and videos on their Cloud Drive....and you can share them by URL.  However, I tried uploaded a small video in AVI format that I created from my camera.  Although pictures work well, when I tried to play the video from the cloud drive, it would stop and start.....obviously a streaming problem.  I contacted customer support, and the best answer I could get after several weeks from \"development\" was to \"TRY reducing the screen size and see if that helps.\"  Obviously they are not interested in fixing the problem, which makes sharing video from my cloud drive unusable.Of course, for $20, it's probably worth it to get Amazon Prime movie streaming. I will modify this review after I receive my Fire Stick and get it working.Update 12/20/2014Finally received my Fire Stick a couple of days ago.  It's easy to set up, and the interface is incredibly simple. However, beyond that I was not impressed.-  It simply does not work with Windows 8.1 Miracast on my PC's.  Links up, then Windows times out with \"there was a problem\" message.-  Playing videos with the Fire Stick (and on my PC) uploaded to Amazon's Cloud Drive are simply unusable....broken up, stop and start....pretty much useless.  I tried .avi files, .mpg files, and .mp4 files with the same result.-  Pictures and playing music from the library works well.I will keep the Fire Stick because it makes it easy to play Amazon Movies....and there are other useful apps...like Netflix, Vimeo, etc.....but for those of us who are not slaves to cellphones, Android devices, and Kindle products, it is of limited use, especially if you are not a Prime member.Since I have a DISH Hopper, which will use Windows Media Player as a NAS server, I can play any video or audio file directly to my TV from any of my PC's hard files (One Windows 7, two Windows 8.1)and from my backup NAS network drive, so the above problems are of little consequence locally. The big interest for me was direct TV access to Amazon Movies and Music directly from the TV, Miracast and being able to share videos via the internet. You can email pictures, but videos are usually too large.  One out of three....guess I will have to order that Actiontec Screenbeam and come up with another video sharing solution.  For 20 bucks, OK...but I am disappointed in Amazon not having their act together on this product by publishing misleading and inaccurate information.....and their support doesn't have a clue.Update 1/4/2015After a couple of weeks using this it just died.....tried it on a couple of TVs, but nada.  If it had continued to work, I would have kept it, although I was disappointed with the performance.  Looks like the ROKU 3 is a better choice, although significantly more expensive.", "verified": true, "helpfulness": "5/6", "author": "R. T. Holland Jr. \"Three Creeks Farm\""}, {"rating": 5.0, "review": "I was using my WII to watch amazon movies but no HD. I received the fire stick early and i love it. I use it for movies, Pandora, and Vevo. Its full HD, smooth transitions between screens and when I watch movies there are no longer buffering times that i was getting with the Wii. Having a controller is nice, easy to use and I would say overall its a great deal....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This Fire TV stick works great if you are already an Amazon prime member or Netflix member or any other member. It works through your Wifi after you set it up on programming the Fire TV stick. Just follow directions on set up. Instructions are easy. This Fire TV stick doesn't have a monthly fee like some programmers do.", "verified": true, "helpfulness": "0/0", "author": "Actual Experience with Products Reviewer"}, {"rating": 5.0, "review": "great little stick.  Works well.  No voice search on the remote, but you can get another one with the voice search if you need it.", "verified": true, "helpfulness": "0/0", "author": "Donald Signorino \"Don\""}, {"rating": 5.0, "review": "We received the device ahead of schedule and it was sent timely. Quick and fast setup from the get go. My wifi connection was acting stupid so it too me a little longer than normal, but set up time was maybe 10-15 minutes if that. Navigation is easy once you get the hang of it. Netflix, WatchESPN, and other apps download real fast and are very pleasing to the eyes to navigate. What will make this device better is when the remote app for your phone (available now on non-apple platforms) comes out for apple and it has voice command which will eliminate that desire to have voice command remote, but not for a heftier price. I was real satisfied with it after using our gaming console for netflix and limited items. We might keep the prime subscription around since its about the same price as netflix yearly. Im happy, the wife is happy because we can finally watch college football and sports again, and the kids are happy because we now have more kids programming than before. I will say this, if your wifi router is in another room, it might be best to move it closer. Ours was in our bedroom about 30 feet away through about 2 sheetrock walls, so wifi was spotty, but once I put it near the TV stand, it was lightning fast and everything moved quicker. This is not a fault of FireTV stick, but the router. Overall, we are happy and I am never going back to using the gaming console for movies.", "verified": false, "helpfulness": "0/0", "author": "Z. Taylor \"BackpackZach\""}, {"rating": 5.0, "review": "Ditched my Google Chromecast and can keep my Kindle somewhere else instead of connecting it to the TV to stream movies/shows now that I have this. So easy to set up and love having the remote though may get the voice version for easier searching (have to \"type\" on the screen to search for something). I have been using to access Prime and can see all purchased movies, music, etc... and if you store your photos you can view them, too.  I have not used the other services that are available from the main menu nor do I play games but my son who also has this has had no issues streaming from Netflix.", "verified": true, "helpfulness": "0/0", "author": "ChrisNY"}]