[{"rating": 5.0, "review": "Love it. So far exceeds expectations. Only complaint would be the need to disconnect from power occasionally to reset the stick or reconnect to wifi.", "verified": true, "helpfulness": "0/0", "author": "Erika Clark"}, {"rating": 4.0, "review": "The Fire TV Stick is a decent platform and definitely suits our needs, but its processor occasionally reminds us of its underpowered nature.We occasionally use the stick for renting and streaming from Amazon. Every now and then when streaming something in high def, we'll get a bit of frame stuttering or odd buffering when the network should otherwise be clear.We've also loaded up some of the JackBox party games to the stick. When entering a sequence with significant 3D animation, sometimes it will chug a bit or take a bit too long to load. It has never outright crashed from the load, but it was significant enough to be an annoyance.Overall, it's a good value, as long as you don't punish it too harshly.", "verified": true, "helpfulness": "0/0", "author": "Brandon B"}, {"rating": 5.0, "review": "As advertised .. Very satisfied w the product ..a little confused as to how I was to download the apps ..but called costumer service (A+ rating on that too!) and was fixed up in a matter of minutes ..the Fire Stick is a must have ...", "verified": true, "helpfulness": "0/0", "author": "Mark Anglin"}, {"rating": 5.0, "review": "I love this little thing. We can watch Netflix now without firing up the Xbox. The remote is very responsive, but easy to lose. I put colored tape on mine so I can find it better on my dark tables and couches. They should put a bright fire logo on it or some flames!", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "I'm buying another!!! I love this Fire TV Stick!!!", "verified": true, "helpfulness": "0/0", "author": "Charlie Martin \"chazzm\""}, {"rating": 5.0, "review": "It is amazing.  So worth the money.  Easy install.", "verified": true, "helpfulness": "0/0", "author": "Elida Barnes"}, {"rating": 5.0, "review": "Awesome, I love it, thinking of buying an extra for my other TV", "verified": true, "helpfulness": "0/0", "author": "WT"}, {"rating": 5.0, "review": "The feature set is excellent. Outperforms every competitor in the price range", "verified": true, "helpfulness": "0/0", "author": "Nate K"}, {"rating": 5.0, "review": "Amazon is just amazing, I love my fire stick.  It is easy to setup and to navigate the menus.  Wifi antenna must be good as I am pretty far from my wifi router and get very strong signal.  Netflix also works great on the stick as well.My only complaint and it's a small one is the battery cover on the back is a pain in the butt to get off, I have big hands and it's not easy for me to grip it and slide.  For $99 a year I just wish they had more free shows, but I guess the free 2 day shipping makes up for that.", "verified": true, "helpfulness": "0/0", "author": "MattS85"}, {"rating": 5.0, "review": "The Fire Stick is great alternative for watching movies and easy to hook up", "verified": true, "helpfulness": "0/0", "author": "Ben  A"}]