[{"rating": 4.0, "review": "For the price, a great streaming device, but still a little buggy.  The interface can be a bit sluggish at times, but generally works well for streaming Netflix and Amazon Prime content.  The little remote is a great feature, too!", "verified": true, "helpfulness": "1/1", "author": "kg47795"}, {"rating": 5.0, "review": "I was surprised at how good this is....I am very glad I bought 2 of these on preorder.", "verified": true, "helpfulness": "0/0", "author": "Jared H."}, {"rating": 1.0, "review": "Really disappointed in this product... Over the course of a few hours, I couldn't get it to consistently stay online and, in some cases, even gain access to my WiFi network -- despite decent reception.  Glad I still have my Apple TV.", "verified": true, "helpfulness": "1/3", "author": "Neil Sroka \"Neil\""}, {"rating": 5.0, "review": "The remote doesn't feel quite as nice as that which came with the regular Fire TV, but despite that the functionality of the device is great. Plus, I have access to Amazon Prime music on this which is not yet available on the Fire TV. Overall, this was an amazing value for $19 with the discount for Prime members.", "verified": true, "helpfulness": "0/0", "author": "Brian S."}, {"rating": 4.0, "review": "I bought the Fire TV Stick as a supplement to my A", "verified": true, "helpfulness": "1/2", "author": "Chris"}, {"rating": 5.0, "review": "Absolutely love it! The picture is beautiful and all my previous streaming issues with roku have been resolved with this little gem. Used it for a week now with no buffering or lost signal issues (those were constant with Roku). I see others were bothered at having to plug the device in, for me that is not an issue. It would be great if it could charge directly from the TV but not a deal breaker. A great product.", "verified": true, "helpfulness": "0/0", "author": "thethunderingheard"}, {"rating": 5.0, "review": "Fantastic!  Worth every penny!", "verified": true, "helpfulness": "0/0", "author": "tishabarr"}, {"rating": 5.0, "review": "I'm very happy with this.  Yet another product that puts Apple TV to shame.  This is quick and easy to use.  I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Joseph Kirby"}, {"rating": 5.0, "review": "Ordered this when it was 20 bucks for prime members and it showed up and worked great. Replaced my laptop as my streaming through my tv device. Especially good with casting from my phone to the tv", "verified": true, "helpfulness": "0/0", "author": "Alex Krippner"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Kwangsuk Kim"}]