[{"rating": 5.0, "review": "This was our second one.", "verified": true, "helpfulness": "0/0", "author": "Laura Gaas"}, {"rating": 5.0, "review": "Works great will buy other later", "verified": true, "helpfulness": "0/0", "author": "HAROLD THORNE"}, {"rating": 4.0, "review": "Well! I have to say I'm very happy. Except for the remote that I had to Google before I could get it open, I had no trouble getting it all up and going very quickly. So far I've only been exploring the Amazon Prime material, but I do look forward to branching out into other areas such as Netflix.  Very pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Diana"}, {"rating": 5.0, "review": "works great if you have a fast internet.", "verified": true, "helpfulness": "0/0", "author": "Ellery L Holesapple"}, {"rating": 5.0, "review": "Easy to set up. works fine.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 4.0, "review": "One week-end in and so far I like it. Got it to watch sling TV, worked without flaws. I'm using it to watch netflix and amazon prime as well now even though I have a smart tv. I didn't give 5 starts (I would have given 4 and 3/4) because there I would like to have I way to know that the remote run out of battery (the batteries that came with it lasted only 3 days, I didn't expect the problem to be the batteries couldn't understand what was going on for a while)", "verified": true, "helpfulness": "0/0", "author": "Carlo"}, {"rating": 4.0, "review": "Great product, easy to navigate, excellent picture quality. Maybe doesn't have as large application base as I expected, but it is growing.", "verified": true, "helpfulness": "0/0", "author": "Archy"}, {"rating": 4.0, "review": "Really love this Fire TV stick! All of the apps are wonderful.", "verified": true, "helpfulness": "0/0", "author": "Jacqualyne Nichols"}, {"rating": 4.0, "review": "Very easy to install even for a beginner, it just has some buffering issues", "verified": true, "helpfulness": "0/0", "author": "Cyndi Nelson"}, {"rating": 5.0, "review": "I love this product.  The only problem is that because I have a tv with only one hdmi port, I had to also buy an extra cable with multiple ports to allow me to use it along with my tv.  This is the second Fire TV Stick with purchased (for the bedroom tv) because we use the one in the living room every day.  It's easy to use and gives me a wide range of viewing options which are not available on cable or directv.  It was easy to install and ready to use in just a few minutes.  With the snowstorm we had over the weekend, our directv was out of service.  We didn't even notice because we were using the Fire TV Stick all night.  Definitely worth the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]