[{"rating": 4.0, "review": "Very nice works great", "verified": true, "helpfulness": "0/0", "author": "Judy F."}, {"rating": 4.0, "review": "I am so glad Amazon made this available. We were able to take our family room TV and turn it to a great resource for family movie night.  I would have given the rating the 5 stars but one glitch I have is getting to home screen to come up upon connection ... I have to hit the home button on the remote and would rather it just come up. This could be user error and it is not a big issue. Still an awesome accessory for our family room and we are going to get a 2nd for the bedroom. We are even cutting back on our mainstream Dish pkg. Being a Prime member is worth it in so many ways!", "verified": true, "helpfulness": "0/0", "author": "fbh"}, {"rating": 5.0, "review": "This is awesome!! We got rid of our TV provider, saved tons of money, and now watch hundreds of movies and other offerings from Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Steve  McCullough \"Steve Mc2\""}, {"rating": 5.0, "review": "Works very good. Fast! Recommend it.", "verified": true, "helpfulness": "0/0", "author": "Elmy S. Perez"}, {"rating": 5.0, "review": "Makes viewing my tv a lot easier.", "verified": true, "helpfulness": "0/0", "author": "Barb Tefsky"}, {"rating": 5.0, "review": "The remote has a serious design flaw in that you almost have to break it to get the latch open to install the batteries, however once you manage to do that the actual product is amazing. Can't imagine how I ever lived without it.", "verified": true, "helpfulness": "0/0", "author": "Caitlin"}, {"rating": 5.0, "review": "Easy to install, works great...", "verified": true, "helpfulness": "0/0", "author": "T. Siblo"}, {"rating": 3.0, "review": "works great in the evening but will not turn on during the day", "verified": true, "helpfulness": "0/1", "author": "Mark Eyler"}, {"rating": 5.0, "review": "the best thing to tv in a long time", "verified": true, "helpfulness": "0/0", "author": "Tiffany S."}, {"rating": 1.0, "review": "The main problem with the stick was connection. Every time you would watch a show it would buffer at least every 5 min. I have a very decent Internet speed and know that the stick was the problem. I would not recommend the only reason I gave it a star was because there was no option for zero stars.", "verified": true, "helpfulness": "0/1", "author": "Ben-E"}]