[{"rating": 5.0, "review": "this is the best.I have been watching all the tv series I have missed.since I don't have a dvr this is great.", "verified": true, "helpfulness": "0/0", "author": "shopper"}, {"rating": 5.0, "review": "Yes, you can operate 2 (or more?) sticks in the same household.  I have Xfinity Wi-Fi at 14-19 Mbps according to their SpeedTest site and there's no problem streaming two sticks/HDTV's at the same time (plus use a laptop to do Internet stuff).My original thought was not so much the Wi-Fi speed, but the possible conflict of Fire TV Stick remote controls.  The remote for the Fire TV Stick is RF, not infrared, and that's absolutely excellent.  No need to point the remote towards the TV and hope it works.  Heck, you can have Fire TV remote control  under your bed covers and it works.  AND... its RF range is such that you can do \"remote\" functions from another room in the house.Which brings me to this:  I was hesitant to buy a second Fire TV Stick, thinking that a second RF remote control would conflict with the first -- especially when you realize they work beyond the room where the HDTV is.  I didn't see it mentioned anywhere in the marketing blurbs or tech specs that two (or more) can work on the same Wi-Fi network in the same house on two HDTV's.  But I took a chance, figuring I could return the second one if there was a collision. (note: I can't speak for everyone in that your Wi-Fi will support simultaneous streaming).Well, heck, Amazon makes it so danged easy with pseudo A.I. that the second remote programs itself automatically once \"it\" realizes it has a \"sibling\" in the household (I wish I could've said the same for my kid sister).  In other words, the second stick & RF remote does NOT conflict with the first; even naming itself as \"Name's 2nd Fire TV Stick\" (where \"name\" is my Amazon Prime account name).A further bonus is the free Amazon Fire TV stick Android app, which is awesome and also knows there are two sticks in the household and allows you to select each time you use it which stick you want the app to control.So Kudos to the techies that designed the ultra convenience of a RF remote instead of infrared and had the foresight in making it program itself to the appropriate Fire TV stick (and the Android app, too).", "verified": true, "helpfulness": "1/1", "author": "Brad Mpls"}, {"rating": 5.0, "review": "We've been streaming through the XBox and this is sooooo much easier to use and it actually will save me money since now I can drop my Microsoft Gold Live account when it renews in the spring. It works great and we've had no buffering issues. We stream from Hulu Plus, NetFlix, and Prime.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"M Phillips\""}, {"rating": 5.0, "review": "One satisfied customer.", "verified": true, "helpfulness": "0/0", "author": "Brent Collins"}, {"rating": 5.0, "review": "This thing is amazing!!! So far, no complaints!!!", "verified": true, "helpfulness": "0/0", "author": "Twinmom"}, {"rating": 4.0, "review": "I have only had the stick for a couple of days and I am still trying to figure it out. Super simple to hook up but I am still having trouble scrolling through to see what is available on Netflix, etc.  I think in a little more time though I will have it figured out. At least now I do not have to connect my PC to my TV via HDMI cable. I think they could have given you a little more length in the power cord though. I had to plug into a power strip.", "verified": true, "helpfulness": "0/0", "author": "april showers"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Janet Barnes"}, {"rating": 5.0, "review": "I have a Chromecast a couple generations of Rokus and I have to say the amazon stick blows them all out of the water. I use these streaming boxes/sticks mostly for Plex and I'm going to replace my older rokus with the amazon stick after getting one and testing it. The only issue I ran into was during setup, the amazon stick did not want to download the update but after hooking it to the included HDMI extender it worked like a champ(not sure if this was a placebo or if it genuinely helped).", "verified": true, "helpfulness": "0/0", "author": "Ryan Spindt"}, {"rating": 5.0, "review": "I bought this for $19 back in October. I am in Costa Rica and you will not be able to get some of the apps, but I was able to get the Netflix app which was the main purpose of the purchase, so I do not need to connect my laptop to the HDTV anymore. I was also able to get some good games and other apps. One thing that I would like to mention is that you need a good internet connection for streaming (at least 3 mbps) as this device will try to stream always in HD. Overall, I am happy with the purchase and my family and I are enjoying Netflix more than before.", "verified": true, "helpfulness": "2/2", "author": "Daniel Zuñiga"}, {"rating": 5.0, "review": "The Fire TV always works better and is more responsive than the Roku's. Can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Blake"}]