[{"rating": 3.0, "review": "I have had 2 Rokus for almost 4 years now. Im happy with them, but I wanted to give my mom a streaming device and she has an old tv with no HDMI ports, so I bought an Amazon Fire TV Stick to replace one of the Rokus I gave her. It's worth the $19 I paid for it, but for full price, there are better options available.ProsAll the channels I want are available.It's fast enough for my needs.It's small and simple to plug in.ConsIt seems to lose connection with my network frequently, which wasn't an issue with my Roku, nor any other wifi devices I own.The remote on occasion is super sensitive and will go up/down 3-4 times when I push a button once.The picture messes up more often than with Roku (it's still not too often, the picture is usually fine)A previous con was that it didn't auto-adjust all shows to my screen, and I'd have big black bars on the sides for a few shows, but that seems to be fixed.", "verified": true, "helpfulness": "0/0", "author": "Jessica Williams"}, {"rating": 3.0, "review": "I have Amazon Fire TV and I was excited to receive the Fire TV Stick so that I could watch Bloomberg TV on a second television set. Well, the Fire TV Stick just arrived and much to my disappointment, it does not include Bloomberg TV. I hope there is a way to get Bloomberg TV on the Fire TV Stick. Otherwise, I don't have much use for it.", "verified": true, "helpfulness": "0/0", "author": "Vahan Janjigian"}, {"rating": 1.0, "review": "Basically useless to me.. Can't even start it at the play/pause prompt because the remote doesn't work.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 1.0, "review": "Was excited to get this devise since it had a remote and for the price I liked it better than the chrome stick which I have. Well after using it I would say its junk. Constant popping and stuttering video. Then it randomly reboots. Based on the specs it should be a winner but it is a dud. Have returned mine and am going with another Roku. I have a Roku 3 and a chromecast . they both work without a problem. Maybe Amazon should stick with retail an not development of products.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Super slow. Constant buffering. No search for apps. Plex app is a purchase. The killer is the slowness and the buffering. Returning", "verified": true, "helpfulness": "0/0", "author": "Madmurrdock"}, {"rating": 4.0, "review": "Faster than ChromeCast", "verified": true, "helpfulness": "0/0", "author": "BILL"}, {"rating": 4.0, "review": "So I have the chromecast and decided to get this for two main reasons, 1 being that it had a remote and another that I could finally watch prime stuff without having to cast from my computer.The fire stick is very nice and certainly turns your TV to a smart tv. it seems to function fairly well. slightly slow on start up but no complaints here. Easy to search and find what you are looking for.If you download the fire stick app you can do voice search without paying for the voice controller. The app has full remote apps well.The chromecast was nice too and easy because half the time that is how I was searching for the show or movie,  so easy to just cast. But I would prefer the fire stick, as the first stick you can also \"cast\" to your tv from your phone or tablet (atleast the fire).If amazon prime would of worked with chromecast I probably would have held off for a while but I also got the introductory price of 19 dollars. typically I was using chromecast for Hulu and Netflix but now I can add in prime as well.Get the stick if u want the functionality of a smart tv with minimal cost.", "verified": true, "helpfulness": "0/0", "author": "Kent"}, {"rating": 5.0, "review": "This streaming stick works great. I'll be honest, I am on my second stick, I had to return the first one because I think I got a malfunctioning unit. But this is a testament to Amazon's excellent customer service. They sent me a pre-authorized return label after going through some steps with their tech support team and sent out a replacement. The replacement worked great with no issues whatsoever and I'm happy with it. I now have every streaming device there is and while they all have their good qualities, if you have Prime you really can't go wrong with the Amazon Fire Streaming Stick. I'll tell you why.The cost is the first thing. I got this on a promo for 19 bucks. Can't beat that price at all. Even the regular price is only 39 bucks which is still a deal. But 19 bucks for Prime members, if you got in on that deal is pretty much as cheap as anyone can get a streaming stick for anywhere. Unheard of for a brand new stick.Now one might argue that the Fire TV has some options that the stick doesn't and it does, but it's also a hundred dollar box. Even at full price you're shaving off 60 bucks here by buying the stick and getting pretty much the same functionality stream-wise. When the app is available on all formats you will, if you have a smartphone, be able to utilize the voice search feature which is one of the selling points.Netflix and Hulu Plus both worked great for me on the stick and I absolutely loved having a remote that worked similarly to my Apple TV. I think it was a genius move designing a remote that is similar to Apples. It makes things intuitive for those who already have an Apple TV and need to figure out a new remote.A lot has been said by other reviewers about the way the power cable has been placed on the stick on the side of it, which may get in the way, depending upon where it is placed on your tv. Also, the USB end needs to be plugged into a wall socket rather than a USB plug, which further complicates matters. However, one should always follow the directions provided by the manufacturer. They have their reasons for wanting this stick to be powered by a 110 outlet and plugged into the side of the stick. For me, I used an HDMI plug on the side of my tv where it wasn't a hindrance to have the power cable off to the side.USAGE:Once I actually got a working unit in hand I found that it is indeed a wonderful device. Amazon has done a great job of doing a few things well. They do great customer service, have a great reputation and offer great products. When you purchase an Amazon product, be it a Paperwhite, a Prime membership or this streaming stick, you expect that you won't have any issues with it and that it will be up there with the best in class competing for top place at what it does. This device does not disappoint. It just works as you would expect, no hiccups, no burps, no bull. If you run into an issue like I did, you call, you send it back, you get a fresh unit. And that reinforces my faith in Amazon as a company and a service. I trust them with my credit card info, my money, my business because I know they stand behind their products and those of their sellers.Once your user name and password are in for your other services, such as Netflix and Hulu, you can use them as usual. Netflix worked out of the box, and Hulu required me to authenticate it with a code using my mobile or laptop. This stick really excels with the free content offered through Prime. You can browse seven ways to sunday for whatever you like and it's all free.Perhaps the most understated is that there is a ton of free HBO content on Amazon Prime. You aren't getting the current stuff but it's the closest thing to having an HBO GO subscription for cable cutters than actually having one. You get a lot of older content, including Sopranos, The Wire, Oz, all the great stuff that most people want HBO for. Frankly The Sopranos is reason enough to pay for a Prime membership.But the fun doesn't end there. You have a lot of other networks that have their fingers dipped into the Prime offerings as well. HBO is the most famous perhaps but there's a bunch of others on there for you to discover. You can search by genre, network, many different ways. I like to spend a little time once in awhile digging through and adding stuff to my watch list and then later on when I'm in a tv watching marathon I just keep watching away without having to stop and look for stuff.GAMES:You can purchase and download free games as well on here. Some can be played with the remote and others require you purchase the game controller separately which you can use with the stick and also with the Fire TV. Thus you get a little more functionality out of this than you do out of some streaming devices because you can play a lot of games and with the gaming controller you actually get a full on gaming platform experience.GUTS:They pack this thing w/ more memory and guts than you get in other sticks so that your Fire TV Stick can handle playing the previously mentioned games, run video smoother, store more stuff and give you an all around better experience than other streaming devices. It may seem like a hassle to have to plug it into an outlet and all that but once you start to look upon this as more than a glorified chromecast and akin to a streamlined wii you will feel like you're more justified in plugging it in. Instead of thinking \"why do I have to plug this in to watch a movie when I don't have to on a chromecast\" you should be thinking \"why doesn't chromecast let me play games and do all the cool stuff I can do on the Fire TV stick?\"SUMMARY:You are getting a lot more for a little bit of money with this device than with competing products. Amazon wants you to buy into their ecosystem, yes. When you buy a Prime membership you buy more stuff from Amazon and you will probably buy more games from them. You might even buy a movie or two that isn't free from them, especially if it's cheaper than iTunes. So it makes sense for them to offer you a more powerful streaming stick for a good price. And they've done a great job of making it great so it works the way it's supposed to, no, better than it's supposed to, out of the box. If it doesn't then you need to call them and have them replace yours or let tech support fix your issue, maybe there's something you're doing wrong. They made it beefier and more powerful so that it can work better so you will choose it over the other options because they know in a business where the competition is inexpensive you probably have the others already. Like me, you might have all the different streaming sticks and a few of the boxes. If you're gonna use the Amazon stuff over the other brands more than it has to be better. I'll say this: I have a Fire TV on the way for one of my other tvs that's how much I like the stick.", "verified": true, "helpfulness": "0/0", "author": "Steven M. Mcmahon \"deal hunter\""}, {"rating": 5.0, "review": "Fast and easy to use. Still in its infancy and it rocks! Google Cast can learn a lot from Fire Stick TV.", "verified": true, "helpfulness": "0/0", "author": "idontwantto"}, {"rating": 5.0, "review": "I bought this for a mere $19 and I consider it the bargain of the year! I wanted a low profile HDMI connection to get my Amazon Prime and Netflix on a 19\" HDTV in the workout room. Set up literally took 5 minutes plus another 3 to log in with my Netflix password. I was happy to find that the Fire Stick already had my Amazon data on it. I get excellent speed using cable modem and ASUS RT-N66U router, very stable. I find the remote to be more than adequate, it is very intuitive. Truthfully, I would have paid $99 for it.  This product is another reason why I love Amazon, they deliver goods as promised and back it up with easy returns if necessary.", "verified": true, "helpfulness": "0/0", "author": "Cheryl A. Deangelo"}]