[{"rating": 3.0, "review": "I was recently given a Fire TV Stick as a gift, and admittedly $40 for all that is offered is a great deal. However, within the first day of ownership it had become apparant how this great bang for the buck was possible... Its REALLY slow. The wifi my device is conmected to gets 10mbps download speed, more than enough for HD streaming on Netflix. However despite that, roughly every 3-5 minutes, whatever it is that I am watching on Netflix, stops... To buffer, sometimes for minutes on-end.Bottom line, this thing would be GREAT if only it had the strength that would allow it to do so.", "verified": false, "helpfulness": "1/1", "author": "jacob edelman"}, {"rating": 4.0, "review": "definitely better than Net Gear I had, but does sometimes stop in the middle of longer running movies or shows", "verified": true, "helpfulness": "0/0", "author": "Diane H."}, {"rating": 2.0, "review": "Slow, skips, freezes. Bought 2, and both skip. My Roku 3 runs flawlessly. You can upgrade to Roku 3 for not much more.", "verified": true, "helpfulness": "0/0", "author": "Cory Huff"}, {"rating": 5.0, "review": "I really like the Fire TV Stick. I am glad I got it and enjoy it very much. It is easy to operate and works great.", "verified": true, "helpfulness": "0/0", "author": "Ervsbookreviews"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Chanel H. Avilla"}, {"rating": 1.0, "review": "Doesn't explain what TVs they work on doesn't work on mine", "verified": true, "helpfulness": "0/1", "author": "harvey"}, {"rating": 5.0, "review": "Got to watch sling TV work great...", "verified": true, "helpfulness": "0/0", "author": "brandon"}, {"rating": 5.0, "review": "Works great. I does everything I need it to do", "verified": true, "helpfulness": "0/0", "author": "Dan Alessi"}, {"rating": 4.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "James Wimbish"}, {"rating": 3.0, "review": "Occasionally stutters, lags", "verified": true, "helpfulness": "0/0", "author": "Momo"}]