[{"rating": 2.0, "review": "It freezes a lot.  I have to un plug it and plug it back in.  Not what I expected.  Also not a lot of local channels to watch.", "verified": true, "helpfulness": "0/1", "author": "CCcc"}, {"rating": 2.0, "review": "So upset I wasted money on this! My internet is perfect on all devices EXCEPT the fire stick. It never seems to hold connection long enough to do anything, and when it does it buffers everything minute or so. Seriously so frustrating. I own several Amazon products and have never had this kinda of issue before", "verified": true, "helpfulness": "0/1", "author": "Alison Olson"}, {"rating": 1.0, "review": "keeps coming up with network connection not found. It will start then lose it...very frustrating.  I had high hopes.  I increased my internet speed and now I just use my smart tv to play amazon and other movies. it did not fair well for us.", "verified": true, "helpfulness": "0/1", "author": "Robert Duhnke"}, {"rating": 4.0, "review": "I don't know how sliced bread took over the invention of the wheel, but in the world of gadgets and technology, this is a marvel. I know there are other similar devices, but this animal can hunt. I couldn't give it 5 stars because 1) it needs a firmware update to accept Bluetooth headphones like the FireBox, 2) I was excited to use the mirroring option but it is quirky. Very difficult to connect and stay connected. BUT, the AirPlay app you can DL (for $3.99) works great with Apple apples.", "verified": true, "helpfulness": "1/1", "author": "DVG"}, {"rating": 5.0, "review": "Easy intall. And easy to hook up wirelessly to my internet. Great deal!", "verified": true, "helpfulness": "1/1", "author": "B2wice"}, {"rating": 5.0, "review": "Meets all expectations.", "verified": true, "helpfulness": "1/1", "author": "Thomas J Degnan"}, {"rating": 5.0, "review": "Tons of storage!", "verified": false, "helpfulness": "1/1", "author": "Leah Gross"}, {"rating": 4.0, "review": "I don't have cable so I'm enjoying my fire stick", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Yeah...no more fascist cable & dish providers for me. Love the firestick. Still finding new stuff every time I use it!", "verified": true, "helpfulness": "1/1", "author": "Joel"}, {"rating": 3.0, "review": "This is the first review I have written about a product. I bought this a month ago. Every time I try to watch something (hulu, sling, etc) videos will hang when playing. Sling dosen't have many channels to choose from. I like the apple tv much better", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]