[{"rating": 5.0, "review": "GOOD DEAL", "verified": true, "helpfulness": "0/0", "author": "Mike S."}, {"rating": 5.0, "review": "Very easy to use and set up, well worth it if you are a prime member", "verified": true, "helpfulness": "0/0", "author": "WILLIAM H WHITSETT"}, {"rating": 3.0, "review": "Quality of product is good.  The picture quality is good over the WiFi.I don't care for the list of free movies that are available", "verified": true, "helpfulness": "0/0", "author": "Robert Miller"}, {"rating": 5.0, "review": "Easy to set up, works incredibly well and fast with no delays in commands from the remote. The remote is small and simple to use but with great functionality. The on screen menus and interface are clean and intuitive with nice categorization. I have a PLEX server in my home and this interface is near identical to the one on the PC, easy to use and very responsive. I was  former Chromecast user and this product is miles better and well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Albert Gunnarson"}, {"rating": 3.0, "review": "I have not yet been able to use this to the extent I had anticipated. I kept getting error messages that I had \"low bandwidth.\" I finally called my provider and learned that I need to upgrade my router to a dual bandwidth model. Of course they wanted to sell me their model. I'll be shopping for one on Amazon, but I wish I had known I needed to do this before ordering the Fire TV Stick. Obviously I'm not up to date on technology the way some of your reviewers are; if I were, I probably would have paid more attention to requirements. I do appreciate the reviews from others who know a lot more than I do about these things!", "verified": true, "helpfulness": "1/1", "author": "Marty G."}, {"rating": 5.0, "review": "The fire stick was easy to hook up and get going. The little video was very helpful. I'm still learning, but we really like being able to catch up movies and TV that we missed.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "Third fire stick I have purchased for me and my families use! I love the ease of seri and operation", "verified": true, "helpfulness": "0/0", "author": "Timothy"}, {"rating": 5.0, "review": "Great product!! My husband is the techie in our house but I like the ease of use!", "verified": true, "helpfulness": "0/0", "author": "sd \"sd\""}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "william taylor"}, {"rating": 5.0, "review": "Fun & easy to use!", "verified": true, "helpfulness": "0/0", "author": "Marilyn Rosa"}]