[{"rating": 5.0, "review": "Bought this as a gift for my mother who is awful at working anything technological! It works flawlessly for her! She can watch her MASH on Netflix and jump over to Hulu for current shows! I have been recommending this to everyone!", "verified": true, "helpfulness": "0/0", "author": "Kristen"}, {"rating": 5.0, "review": "Incredible commercial free access.  Much programing is available that is available elsewhere but it is all combined in one resource.  For example a mini series loses continuity when you see an episode a week or maybe a month.  Fire TV stick lets you watch it all the way through.  Great for snow days!", "verified": true, "helpfulness": "0/0", "author": "Roger A. Bower \"Roger Bower\""}, {"rating": 5.0, "review": "Works as advertised and stupid easy to set up", "verified": true, "helpfulness": "0/0", "author": "Matthew Douglas Pastorius"}, {"rating": 5.0, "review": "Love it. So simple to move from our TV screen at home to our screen at our small cabin. Didn't want to invest in cable at our cabin because we're just not there that much. So the fire stick is a perfect solution.", "verified": true, "helpfulness": "0/0", "author": "Carol L. Gobler"}, {"rating": 3.0, "review": "I bought this thinking it would be better than the Roku I already had that required me to hook up a bunch of wires.  I never had any problems with the Roku; I was just tired of seeing all those wires.  I actually bought two Fire TV Sticks.  The one I hooked up in our living room only works some of the time.  It randomly pauses the show I'm watching, when I'm not even touching the remote.  It will also freeze up frequently, requiring me to unplug it from the TV, wait awhile and try it again.  Sometimes I have to do this 3 or 4 times before it will begin working again.  It's like there's a glitch in it or something.  While it's nice not having all the wires of my previous Roku, the quality of this product seems to less than optimum.", "verified": true, "helpfulness": "0/0", "author": "Tiffany A. Roosa"}, {"rating": 4.0, "review": "This is an excellent little device.  I would highly recommend it for anyone wanting to convert their TV to a smart TV, particularly people with an Amazon Prime account.  I have never had a smart TV, so I cannot say how it compares in performance, but I really doubt it will beat the Fire TV Stick.  I also found that it was cheaper to buy a non-smart TV and then buy this device.", "verified": true, "helpfulness": "0/0", "author": "Thomas Elder"}, {"rating": 5.0, "review": "Worth the money.", "verified": true, "helpfulness": "0/0", "author": "AJM1979"}, {"rating": 5.0, "review": "Loved it so much - purchased another for my son.", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 5.0, "review": "I'll keep this fairly succinct. Should you buy this over other media streaming devices/dongles? Yes.  It offers a lot of great functionality and yet is very intuitive.  Very easy to setup, download apps, and stream media/play games. My only knock against it is that it doesn't allow (to my knowledge) you to reset the device from the menu, you must unplug the power to restart the device.At certain points it will not connect to my wifi and the Fire Stick TV must be rebooted for it to reacquire the networks. I believe is more on my wifi network than the Fire TV Stick in terms of connectivity loss.  A reboot/reset option within the GUI would be a great \"quality of life\" addition.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 3.0, "review": "I'm still testing it out. but..  it was very easy to install, easy interface, even great packaging.  But it buffered a little too often yet I have 802.11ac about 15ft away through two walls.", "verified": true, "helpfulness": "0/0", "author": "Jeff Perley"}]