[{"rating": 5.0, "review": "Love it .  It was viery easy to connect", "verified": true, "helpfulness": "0/0", "author": "elsie buelteman"}, {"rating": 5.0, "review": "A must buy!!!! Ships fast tons of free movies and shows. I love it.. Remote is bulky but they have a free app that will blow appletv's remote out of the water. It even has games you can buy an additional controller or use the remote or app remote. The free app even has voice search on it and it is on point....", "verified": false, "helpfulness": "0/0", "author": "Johnathan"}, {"rating": 1.0, "review": "It is not working at all as I am living outside USA. The application on itunes is limited to USA store. All applications on it even movies while I have prime account are restricted to be used while u r inside USA ONLY. So its a piece of non-functional metal if you are outside USA. They should mention that. even I have sent a query question regarding Fire TV & Kindle Fre, but the support team response was confirming it will work properly even if you are outside USA.", "verified": true, "helpfulness": "0/0", "author": "mahmoud mohab elsawaf"}, {"rating": 5.0, "review": "We were using Chromecast until they \"updated\" their product, which caused ours to crash.  After two weeks of Chromecast not finding a fix and being frustrated, we bought Fire TV Stick.  We love it.  Fire TV is more reliable, has more choices of movies, doesn't buffer or disconnect like Chromecast did.  Right now we love Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Theresa Parker \"Sparkles\""}, {"rating": 5.0, "review": "A great way to watch tv if you don't want cable. There are lots of options, including options to get channels like TBS, CNN and other cable channels. You Tube is available on you television screen.  Fire T.V. stick is also very easy to install and set up. It was a great purchase!", "verified": true, "helpfulness": "2/2", "author": "Ellen Cole \"ellen\""}, {"rating": 5.0, "review": "GREAT PRODUCT, FAST DELIVERY  AAA+++", "verified": true, "helpfulness": "0/0", "author": "J. FORRESTER"}, {"rating": 5.0, "review": "Works great. Price good, I could have purchased a cheaper item for this use. But the Fire Stick offered more features.  So far ( 2 days) so good.  Many features, easy to  install and operate. One complaint the screen for typing in password, etc. is too  sensitive and the means to delete the double postings was difficult to locate.  Otherwise seems great.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Ricci"}, {"rating": 3.0, "review": "The equipment is easy to install and use. Simple to set up as well. It is just another way to rent movies.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Boyd"}, {"rating": 5.0, "review": "Love the fire stick!", "verified": true, "helpfulness": "0/0", "author": "sheila"}, {"rating": 3.0, "review": "I don't hate it, but it's very hard to like. Have yet to be able to stream an entire movie or song. Our router sets just 3 feet from the stick, so that's not an issue. We can watch Prime or Netflix on any other device in any room with no issues. So, it has to be the stick.Thought about sending it back, but I really don't need it. It was more of a convenience to give the game systems a rest every now and then.And I can not remember if it says anything about gaming or apps. But, don't bother. The games really aren't free. They give you a trial and then you have to pay to actually acquire the game.", "verified": true, "helpfulness": "0/1", "author": "Scott"}]