[{"rating": 5.0, "review": "Love the Fire TV Stick!!", "verified": true, "helpfulness": "0/0", "author": "shannon specht"}, {"rating": 5.0, "review": "Great product and my kids can easily use it as well!", "verified": true, "helpfulness": "0/0", "author": "M. Libertini"}, {"rating": 5.0, "review": "On par with all similar products. ..but offers Prime content...and convenience.", "verified": true, "helpfulness": "0/0", "author": "Jesseo"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "JANENE A SMITH"}, {"rating": 5.0, "review": "The fire stick is amazing.. Love it!", "verified": true, "helpfulness": "0/0", "author": "Charlotte Rickman"}, {"rating": 4.0, "review": "Great product, great value.  Only thing keeping me from giving it a fifth star is the remote: a keypad would be nice.", "verified": true, "helpfulness": "0/0", "author": "Christopher Cawley"}, {"rating": 5.0, "review": "Pretty impressed, I think this is going to be my pick of the litter between my Chromecast, Xbox One, and a Roku 2 XS.  It's fast, pretty and has the apps I want.  It is a bit Amazon heavy in the home page, but it's simple to just scroll down to my Apps to use Plex, Hulu, SlingTV, etc...", "verified": true, "helpfulness": "0/0", "author": "Levi Smith"}, {"rating": 1.0, "review": "I can get Amazon Prime movies to work but not Netflix...which has better movies.  It always says \"aan error has occured with this program, please try another\" and it does that for every program...so far it is a waste of money.", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 4.0, "review": "It's got some bugs but overall I am very impressed with all of the amazing things this little device can do.  If twenty years ago I had shown someone this device and demonstrated it in action I would have been called a witch.  Or whatever they call a witch who is a dude.The Netflix part of it has been a little choppy lately but I suppose that's not why Amazon sold these devices.  They want you to buy Amazon content and my Amazon Prime video watching has been pretty flawless unless I am having internet issues.", "verified": true, "helpfulness": "0/0", "author": "Travis Gagnon \"Rebel With A Camera\""}, {"rating": 5.0, "review": "We pre-ordered this when it first appeared, and have been really pleased with the ease with which we can watch Prime movies and TV shows! We used to hook up my laptop to the TV with an HDMI cable. But it was a bit inconvenient, and I couldn't use the computer while we were watching TV.  We have since purchased the larger AFTV unit with remote control for our family room TV.", "verified": true, "helpfulness": "0/0", "author": "Tom S. \"Math Rookie\""}]