[{"rating": 3.0, "review": "Not as strong as I thought. But maybe it is my equipment", "verified": true, "helpfulness": "0/0", "author": "Kmhooker \"Kathleen\""}, {"rating": 5.0, "review": "So far this thing it is AMAZING. I have a flat screen- not smart TV in the bedroom, and now I can watch everything I want!Extremely intuitive. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "tlynne \"terri davis\""}, {"rating": 5.0, "review": "Wow, do I love this or what. Everything I'd need for all my Television, Music, Movies, Photo pleasure all at my finger tips with the easy-to-use remote and the smallest device ever. No more messy wires going across your room. I love this & recommend it to anyone who uses a Television set!", "verified": true, "helpfulness": "0/0", "author": "John Stamos"}, {"rating": 3.0, "review": "Plug and play. I enjoy using my IOS as the remote control. Too many pay for use apps though...", "verified": true, "helpfulness": "0/0", "author": "Jason H."}, {"rating": 1.0, "review": "The firestick constantly runs slow, freezes, and it's just not worth it. Unless you have the patience  of Job, just get a chromecast. I have both, and I've had my chromecast longer and it works like a dream. I got the firestick because as a prime member, I got it for 50%, so I figured, why not? Now I know why, lol. It sucks, or I just got a really bad one.", "verified": true, "helpfulness": "0/0", "author": "wkugirl382"}, {"rating": 4.0, "review": "I had mega issues syncing with my home computer, but once I got the Fire Stick to work, it's dandy!  My only issue now is the downloading time or \"buffering\".  While I've only used this one evening, our show was constantly interrupted by the buffering.  I called Customer Service (both Amazon and Netflix), and both were extremely helpful. But I practically had to disassemble the entire operation to get going again.  I'm hoping the downloading issue levels out.  We've never used a streaming service, and the convenience of that is remarkable!", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 5.0, "review": "Bought two of these for my daughters - they love them.  Great gift.", "verified": true, "helpfulness": "0/0", "author": "power ranger 1"}, {"rating": 4.0, "review": "Overall, a great piece of work.  A bit sluggish in its own menus though, which is probably what affects my star rating--down from a 5 to a 4.  It's actually annoying enough to drop it down one star. However, the functionality is great.  The remote suffers from the same little glitches that my parents' Amazon Fire TV's remote does.  \"Ghost clicks\" after releasing the directional buttons.", "verified": true, "helpfulness": "0/0", "author": "LordJair"}, {"rating": 2.0, "review": "iPhone app for Amazon instant video works always. Fire stick will only work about 1/2 of the time. Too many error messages.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "This thing is great!", "verified": true, "helpfulness": "0/0", "author": "T. Heslin \"Yogi12\""}]