[{"rating": 5.0, "review": "I was sick of paying $160+ each month for cable (we didn't watch most channels), internet and telephone (we didn't need/use).  A co-worker told me about FireStick, I had no clue what she was talking about, however I knew I had to find a more affordable way to enjoy watching TV. i ordered my stick in June I can honestly say my family loves it.  I also ordered HuluPlus, Netflix and Showtime Anytime for $25.97 a month my cable is $59.99 (no tax) so my total TV entertainment bill each month is $85.96.  That's half of my former bill. There are so many options TV shows, movies, specials, comedies, videos, games, apps...etc.  I only purchased one stick we keep it in the main living area and we have antenna's for the bedrooms.  There are 13 or 14 channels to choose from so it's working out fine so far.  I may purchase another stick for the master, but for now we enjoy this affordable way to watch TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I enjoy having the stick, it is easy to use and makes any place I go feel a little more like home.", "verified": true, "helpfulness": "0/0", "author": "Joe Davis"}, {"rating": 5.0, "review": "We received the fire stick as a birthday gift from my in laws. We don't have cable and pretty much watch Netflix all the time. After receiving this, we've noticed that we use the fire stick more. It has a great mixture of cartoons for the kiddos, action for my husband, and movies for me. The only problem we've had is a few of the apps don't run that well on the stick. Which is fine because we don't really need to user them. One of my favorite apps is Pandora.Highly recommend this product.", "verified": false, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "It is just wonderful.  I have been using my large Vizio smart tv to view Amazon movies, and it is slow and tiresome.  I bought the firestick for my smaller tv, and it is exceptional: so much better than the smart tv.  Downloads are instant and the user has much more control over viewing.  Love it!", "verified": true, "helpfulness": "0/0", "author": "firestone"}, {"rating": 5.0, "review": "We have had Chrome Cast for a couple of years now, and when we needed one for another of our TV's we decided to try the Fire TV Stick.  What a fabulous product.  Everything loads so quickly - no buffering!  And I became a Prime Member (was an associate on an account until then), so we could have access to the prime movies and TV shows.  Our choices are so broad now, none of us will ever be bored!  This is a great product - and very easy to set up and use (and I LOVE the remote!)", "verified": true, "helpfulness": "0/0", "author": "Mary Bulla \"S's Mom\""}, {"rating": 5.0, "review": "Love the stick so versatile I can take it with me from room to room. Loves being able to watch Netflix and amazon show's. Great product for price, will buy more of them and definitely recommend people to purchase.", "verified": true, "helpfulness": "0/0", "author": "Autumn ny"}, {"rating": 5.0, "review": "Absolutely love this. I have DirecTV with all the bells and whistles, but this allows me \"on demand\" with so many other opportunities. I love that it is portable and goes with me when I go to the beach for a month, etc. It was so easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Peggy Woods \"beach gal\""}, {"rating": 5.0, "review": "awesome!", "verified": true, "helpfulness": "0/0", "author": "emmanuel urbano"}, {"rating": 5.0, "review": "The only issue I have is the streaming staying active.", "verified": true, "helpfulness": "0/0", "author": "Kay"}, {"rating": 4.0, "review": "So far so good. It works great with my Sony HD TV. No complications on installing. Just wish HBO Now and Showtime Anytime were available apps..", "verified": true, "helpfulness": "0/0", "author": "Kenya Edwards"}]