[{"rating": 5.0, "review": "Love our Fire TV stick!  Allows us to watch so much more as a family.", "verified": true, "helpfulness": "0/0", "author": "db1895"}, {"rating": 5.0, "review": "This is my first non-PC streaming experience and it's awesome. Over my 5mbps wireless internet service I'm able to stream Prime SD video perfectly and it looks great on 50\" 1080p screen. Setup was quick and painless with a to-the-point guided video. The remote might be little too light.  I'll update later on once I've lived with it for awhile. Prime video works better through this than through Chrome imho. Start playing right now, near instantly where my PC has to buffer for awhile.", "verified": true, "helpfulness": "0/1", "author": "Ochadd"}, {"rating": 3.0, "review": "Having tried out the original Fire TV for free twice, I was excited about the announcement of the Fire TV Stick, especially for the special $19 price for Prime members. As opposed to the wonderful problem-free setup for the original Fire TV, the Fire TV stick proved very difficult to set up.Although the Fire TV Stick was connected to power using the included adapter, I kept receiving a warning that it wasn't plugged in using the provided adapter. After skipping that screen I was prompted to connect to my wireless network. I also noticed that unlike the original Fire TV, this device only supports 2.4 GHz bands. I received a message on screen I was successful connected to the network, and went to the next step, which was a software update. This is the part where the \"simple setup\" went south. The Fire TV stick was unable to download and install the required software update, and prompted me to reset the device (by pressing Home + Select until device restarts). I tried restarting several times, and went as far as completely unplugging the device and using a different HDMI port. I tried looking for help on the Fire TV support site, with no luck. After searching Google I found a Reddit thread with users having similar issues. On of the suggestions explained that the issue might be related to problems with the wireless router set to automatically select the channel. I made the change to my router to use a specific channel and restarted the Fire TV Stick, and I was able to get past the Software update screen. After the device played the welcome/intro video I was again in my home screen, but nothing was loading. I had to force restart the Fire TV Stick again, and it finally loaded the content. I installed several apps, including Netflix, but I was unable to play content from it. After playing around, I found that the software update that was giving me problems earlier hadn't installed. So I installed the update, and I was finally able to stream content from Netflix. I didn't continue to have some hiccups with Netflix a few days later, but restarting the Fire TV stick appeared to fix this problem. Content from Amazon Prime I have had no problems so far. Compared to the original Fire TV, setup was very lengthy and frustrating, and issues kept happening after a couple of days use.Considering the price I paid, I'm sure this is adequate, but it's not the type of device I'd be willing to give as a gift considering how many issues I had.", "verified": true, "helpfulness": "0/0", "author": "Torito P."}, {"rating": 5.0, "review": "Easy! Great interface with terrific  content.", "verified": true, "helpfulness": "0/0", "author": "Howard Pitzer"}, {"rating": 5.0, "review": "I've only had this thing for a day, but so far, I LOVE IT!!!Out of the box it came with:Fire TV StickRemote w/batteriesCharging cableCharging adapter boxHDMI Extender cord (for if you have a tight squeeze on the back of your set, VERY NICE, Amazon, thank you, it was needed)Easy set up guideAnd just because I've had tons of friends and family ask, no you do not need a \"Smart TV\" to use it. You just need to have an HDMI port in the back somewhere, which most of your newer flat screens do have. Just double check before purchasing. You also have the HDMI extender for those really tight spots like I had. Makes it much easier to connect when you have tons of things (like USB flash drives, and surround sound wiring) plugged in the back.It was the easiest thing to set up. Just plug it all in and turn your TV on. The great thing about the stick is it asks you if you want it connected to the account you bought it from. I like options because we have a few different Amazon account holders in our house. I'm not tied down to one account and I adore that.The short, nifty video at start-up explains everything you need to know and the user interface is easy to use and understand. This stick does not come with voice controls, however, you can easily download the Amazon TV Fire app to your phone or tablet that includes it. It was pretty neat last night when I was finding content on my phone.I absolutely LOVE the mirror screen feature. I was able to show some of my pictures from my phone (Samsung Galaxy Note 3), that were not stored in the Amazon cloud, to my family by mirroring the screen. Totally awesome. There is also a feature that allows you to stop watching something on the Kindle and restart it back on the Fire TV stick, and vice versa. We haven't tried that feature out yet, but it was shown on the video at start-up.I do wish the parental controls were a little more in depth. I can block come content similar to the Kindle fire like pictures, videos, password protect video playback and purchases, but that's annoying to have to do that on every single video. I'd like to be able to require passwords for certain ratings, not all or none.So far, I'm in love. I don't have Chromecast or any other streaming media stick, so I can't compare it to any others, but what I love the most is that it's already programmed to my account when I hook it up and all my content is easily found right on the screen. I now want 2 more for other rooms in the house.Pros:Easy to set upAlready programmed at set up (with the option to change accounts if you want)Everything you need is in the box (no running around trying to find extenders or batteries)Easy user interfaceThe fact there are parental controls at allGreat app selection (Netflix, flixster, Hulu, several news outlets, Pandora, IheartMusic, etc)Phone and Tablet compatible appCons:Parental controls definitely need to be tweaked and offer more optionsRemote is kinda flimsy and cheap feeling (I'm scared I'll break it)Is kind of slow starting up when I turn the TV on (Although, to be fair, this could be my TV and not so much the box, just an observation)If I unlock content with my PIN (like photos) I have to go back through the parental controls settings to lock again. This isn't hard to do though, just annoying there isn't an easier way to relock content.I will MOST DEFINITELY will (and have) recommend this to a friend. I might find things in the coming days and weeks I don't like it about it, but so far, I adore the Amazon Fire TV stick.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Husband loves it! Waaaay better quality than watching Netflix through the wii and a lot more choices with Prime.", "verified": true, "helpfulness": "0/0", "author": "Jenn Mayrand"}, {"rating": 1.0, "review": "Device is a data hog. Used 4GB in 1 hour of prime movie and there is no way to adjust data usage.", "verified": true, "helpfulness": "0/2", "author": "Amazon prime member"}, {"rating": 5.0, "review": "These Fire Sticks are awesome.  I got them when they were on promotion for prime members and I'm glad I did.  I can't compare to Chromecast or Roku but these do the job and they do a great job of streaming netfilx and pandora.  Hopefully they can add HBO next year and then I'll be set.", "verified": true, "helpfulness": "0/0", "author": "SweetbabyJsus"}, {"rating": 5.0, "review": "I have a Chrome stick, and a Roku Stick, but this Fire TV Stick is so awesome, I don't use the others anymore.  In fact, I wish I pre-ordered more of them, because at this price level, there is nothing that will touch it performance wise.The Roku stick is so slow, it has been a frustrating experience.  When I ordered the Fire TV Stick, I wasn't expecting much better, considering how cheap it was ($20 during pre-order), but the speed & quality of the Fire TV Stick interface is on par with Apple TV (which is extremely smooth).  It also boots up much faster (instant if you don't cut power to the USB power source).Wi-Fi performance (using a Netgear NightHawk router) seems to be fine.I wish there were more apps for it (Time Warner's app would be a big one for me), but it looks like it's pretty easy to add your own Android apps, so I'll have to give that a shot.Compared with the Roku, it doesn't offer as much content, but if your primary media sources are Netflix and Amazon Prime, it's a great fit.I'll be buying more sticks soon!A couple of things to keep in mind (especially if you are new to this type of device):1) You need an external power source (typical for most sticks), but it comes with a nice looking USB power adapter.2) No Ethernet.3) It comes preconfigured with your Amazon account, so keep that in mind if giving one away.4) The remote is RF, so you can't just copy it to your standard IR universal remote.5) The included remote does not support voice search, but you can upgrade to the Fire TV remote if desired (or use the free app on your smartphone).6) It doesn't offer as much content as the Roku Stick, but hopefully that will change.7) USB port is on the side, which might make it a tight fit in some scenarios.", "verified": true, "helpfulness": "0/0", "author": "Mr. G"}, {"rating": 5.0, "review": "I live my amazon fire stick. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Baer"}]