[{"rating": 5.0, "review": "Love it, super easy set up!", "verified": true, "helpfulness": "1/1", "author": "Connie Rincon"}, {"rating": 1.0, "review": "It stops working all of the time. I have to disconnect it and reconnect every time I want to use it. Mine must be a lemon. I'm very disappointed that I got rid of my Wii and replaced it with fire stick for streaming.", "verified": true, "helpfulness": "2/2", "author": "Michele"}, {"rating": 5.0, "review": "Does it all, easy to use simple control, I like it better than Google or Apple TV.", "verified": true, "helpfulness": "1/2", "author": "Rocco Santori \"Rocconet\""}, {"rating": 5.0, "review": "I love my Fire Stick!  It is great for streaming Amazon Prime movies and tv shows!  It is also great for Netflix, YouTube, Hulu Plus, and Pandora!  I am obsessed!The only downside is that it needs to be plugged in to work, but as long as you have an outlet near your tv it is a great product!", "verified": true, "helpfulness": "1/1", "author": "K. Cunningham"}, {"rating": 5.0, "review": "Finally have this connected to my new to me network wi-fi wireless router. It is very important to do your research when considering this device for your setup as it needs an active internet to connect with. If you do not have a wi-fi wireless capable computer like me, you can purchase a separate wi-fi wireless router and switch its internet address to 192.168.2.1. The more expensive way is to just purchase the Fire TV which is wired and wireless capable. My setup works with a total of $52.97 ($39.00 for the Fire TV Stick and $13.97 for the wi-fi wireless router) for the compared to the Amazon Fire TV ($99.00)Either way your internet speed is related to what else is sharing your ISPs internet connection based on my personal experience...", "verified": true, "helpfulness": "1/2", "author": "llponce \"llponce\""}, {"rating": 5.0, "review": "Love it. I'm so glad I bought this when it was on sale for $20 because this is so awesome.  I put it on my guest TV and I've watched movies from Amazon prime account and I'm going to setup my Netflix too.", "verified": true, "helpfulness": "1/1", "author": "Cutie"}, {"rating": 5.0, "review": "Works great. All as promised.", "verified": true, "helpfulness": "0/0", "author": "Michael R Rubin"}, {"rating": 5.0, "review": "I got this when they offered it for $19. It performs 95% as well as my Fire TV Box.  The only difference I notice is a VERY SLIGHT delay in response as compared to the Fire TV. But for an HDMI dongle, it is AMAZING. It has so much more functionality than Chromecast.  I use it in my downstairs (basement) but the wifi works perfectly and I have never had any buffering problems. It is lightning fast and well worth the money.", "verified": true, "helpfulness": "0/0", "author": "russ5811 \"russ5811\""}, {"rating": 4.0, "review": "Useful gadget if you have prime", "verified": true, "helpfulness": "0/0", "author": "M. Turton \"mitchly\""}, {"rating": 3.0, "review": "It is okay for what it is.  Glad I bought it at the $20 pre-releease price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"jgh1204\""}]