[{"rating": 5.0, "review": "I'm not going to sit here and explain all the wonderful things this product does but I will say that it does do everything it says it will and can do. I am not really tech savvy and the great news is that you don't have to be. I actually set it up with no freak outs on my part because it will walk you thru the process.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Gave this a 4 because the remote doesn't work all that great.  connects well to my ATT WI FI. Streams well.", "verified": true, "helpfulness": "0/0", "author": "Matt Riggs"}, {"rating": 5.0, "review": "Excellent!  Our internet is the slow \"fast internet,\" but so far it's been working well.", "verified": true, "helpfulness": "0/0", "author": "KAO"}, {"rating": 5.0, "review": "Love it...makes life easy!", "verified": true, "helpfulness": "0/0", "author": "Brandi"}, {"rating": 1.0, "review": "Some apps more than others do not work. In particularl sling TV. Amazon customer service has not helped my circumstance in 2months. I'll likely return the fire TV. Seems like s rushed product with very low functionality.", "verified": true, "helpfulness": "1/1", "author": "Denmark R."}, {"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "Donita"}, {"rating": 3.0, "review": "I wish I could have be able to root my Amazon fire stick, as well I wish the remote's that came with would work in all application and not certain applications, for instance, if you sideload them. I would also change UI.", "verified": true, "helpfulness": "0/0", "author": "Leonardo Mico"}, {"rating": 3.0, "review": "I also have Apple TV and compared to that, this is much less self-explanatory or user friendly. It will work for what I need for the price, but more direction starting out would have been nice.", "verified": true, "helpfulness": "0/0", "author": "Black Velvet"}, {"rating": 4.0, "review": "Love it.. looking forward to more options", "verified": true, "helpfulness": "0/0", "author": "stlman"}, {"rating": 4.0, "review": "I don't like that you have to pay for a lot of the movies and shows, but overall it is pretty good.", "verified": true, "helpfulness": "0/0", "author": "Michele E. Ansert"}]