[{"rating": 5.0, "review": "Really easy to install and great viewing options then just cable.", "verified": true, "helpfulness": "0/0", "author": "Peggy King"}, {"rating": 5.0, "review": "I really love it. But it's really more important to mention that my kids love it, because they are the main TV abusers... especially the 1 year old. I mean who doesn't love to watch Creative Galaxy and PBS Kids Shows at just about every waking moment? Of course, I do! So since the baby of the family tends to dictate what we watch, I hear \"Arty! Arty!\" more than any other words he should be learning around my house. So thank you Amazon, for the amazing Fire TV Stick and for the wonderful Creative Galaxy that I just haven't been able to quit watching for everyday of every minute so far.", "verified": true, "helpfulness": "0/0", "author": "Eclectrically Sane"}, {"rating": 5.0, "review": "This little tool is welcome breakthrough. I really enjoy the simple set-up, and the convenience of searching for Apps. and programs.(Thank You Amazon for this wonderful tool!)", "verified": true, "helpfulness": "0/0", "author": "nostalgic-man"}, {"rating": 3.0, "review": "I am terribly frustrated with the Fire Stick.  My daughter talked me into buying it even though I had Chromecast. She has a Fire Stick and has not had a single issue. Why am I?  Granted Amazon's Fire Stick has more variety in viewing from which to choose than my Chromecast, but I have NEVER watched a series (i.e. \"The White Queen\") without it freezing or buffering during every 1 hr. episode - several times.  My WiFi connection is absolutely fine but I continually get a message that my \"broadband width\" is the issue.  We all are wondering if I simply got \"a lemon\".  However, after reading other reviews I see many customers are having the same problems.  I am a huge Amazon fan....a great customer....but am terribly disappointed in this product.", "verified": true, "helpfulness": "1/1", "author": "Jann"}, {"rating": 2.0, "review": "Terrible video playback, freezes up a lot. Also have to enter PIN number multiple times when using service.", "verified": true, "helpfulness": "0/0", "author": "GENERAL R. L. STAFFORD"}, {"rating": 3.0, "review": "Tech smart person I gave this a three because Netflix and only Netflix glitches and reloads funny huh good to compete with the competition I guess .", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "I have had the fire TV stick since December. It works when it wants to. I receive great WiFi reception and yet this thing disconnects regularly during streaming of Netflix. Plex signs out after a minute and requires me to \"sign in again or activate.\" I use a chrome-cast in the same TV and it works much better. The only thing that Amazon Fire TV stick seems to work with is amazon services - which is primarily why I bought it. Renting TV shows and movies - for now - work, but I am worried that one day I will start this up and will end up buffering or worse - keep disconnecting! Seriously, Amazon had a great a idea and ruined it. I would of used this exclusively if it worked at least 95% of the time. Now I can guarantee that barely works flawlessly 0% of the time with anything other than Amazon services and even then..for Amazon services I would be surprised if it won't work 100% of the time either. Maybe Amazon just needs to send me a new fire stick?Netflix sucks on it. Plex don't work. Buy this only if you want to watch Amazon stuff.", "verified": true, "helpfulness": "0/0", "author": "zillah"}, {"rating": 3.0, "review": "I've had time to use this device, and I can only give it three stars. I mostly use it for Netflix, and it's quite frustrating that I have to sign in almost every time I use it. Maybe once I start using more of the apps, I will be able to rate it higher.", "verified": true, "helpfulness": "0/0", "author": "D. Rich \"Expressing myself - one review at a time\""}, {"rating": 5.0, "review": "Fire stick is the best ever of streaming devices I have had other but you get a lot more for your money and it's well worth it.  I must say it's a device that will be put to use I watch a lot of TV and now I down use red box anymore..........", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Does its job!", "verified": true, "helpfulness": "0/0", "author": "Divas"}]