[{"rating": 5.0, "review": "very happy with item", "verified": true, "helpfulness": "0/0", "author": "trisha roy"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "NVSOONER"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "KMur"}, {"rating": 1.0, "review": "Horrible, barely connects and the remote is trash.  Amazon wants you to download an apptocontrol your tv.  Annoyed that I need yet another app to function in life. I will try and return and get a roku.", "verified": true, "helpfulness": "0/0", "author": "Mencken"}, {"rating": 5.0, "review": "very intuitive and easy to use.  simple operation.  been binge watching Downton Abbey.  glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "GR MOORE"}, {"rating": 5.0, "review": "Inexpensive and so convenient. Bought one for every tv in the house.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 3.0, "review": "I have been watching Netflix using an old Wii and thought the fire stick would be better...wrong! The fire stick reloads and many times stops at 25% for a minute or two.  This happens with HBO Go, and even Amazon Prime. This hardly ever happens with the Wii.  I have followed the tips listed in some reviews, such as rebooting and clearing unused apps but nothing helps and the signal strength is good. I am surprised and disappointed by this purchase.", "verified": true, "helpfulness": "0/0", "author": "D. Yates"}, {"rating": 4.0, "review": "Easy to install and use. Really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "James A. Buddie"}, {"rating": 5.0, "review": "My kids had lost the remote been looking for 2 wks. Found it after i placed the order.", "verified": true, "helpfulness": "0/0", "author": "Francisco J. Ramos"}, {"rating": 1.0, "review": "The WIFI requires too much power.  My other devices work fine off of my router but the Fire TV Stick cannot connect.  Very disappointed.  I may go out and purchase a more powerful router or a booster.  Do not think this should be required.", "verified": true, "helpfulness": "0/0", "author": "Barry T. Cuda \"Barry T. Cuda\""}]