[{"rating": 5.0, "review": "More than i expected.", "verified": true, "helpfulness": "0/0", "author": "loise c boyd"}, {"rating": 5.0, "review": "working great, easy to install", "verified": true, "helpfulness": "0/0", "author": "Rufina Oboite"}, {"rating": 4.0, "review": "Great little device.  I own a Roku and Google Chrome stick and would put this at a close second behind the Roku.1.  The remote is great.  It's not infrared so works anywhere in the room similar to the Roku.  The Google Chrome stick does not come with any remote so you need to use either your phone or computer to stop the video.  While using another device to control the playback seems simple enough, it is not convenient especially when you have kids and a show you are watching suddenly turns NSFW.2.  The Fire Stick is quick.  I use the USB to outlet adapter that comes with to give it all the juice it needs.  The option to plug into the TV USB does exist but from past experience direct power works better.  The menus load quickly and the shows start instantly.3.  The only downside I've seen so far is that the PLEX app does not respond like it does on the Roku.  It is buggy and will play then stop suddenly and ask me to login after I already have like 3 times.  Not sure who to blame (plex or firestick) but want consumers to be aware that not all apps run as smoothly as other devices.", "verified": true, "helpfulness": "0/0", "author": "MandM"}, {"rating": 1.0, "review": "Poor video quality.", "verified": true, "helpfulness": "0/0", "author": "noname"}, {"rating": 5.0, "review": "Love it love it love it...", "verified": true, "helpfulness": "0/0", "author": "Babbee Wiggins \"Babs\""}, {"rating": 5.0, "review": "Excellent product, would buy again", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best purchase on Amazon hands-down! Use for watching Amazon shows as well as Netflix streaming on my TV.", "verified": true, "helpfulness": "0/0", "author": "Michelle Delecki"}, {"rating": 4.0, "review": "Works like a champ. A little glitchy 😭when it gets too hot but(otherwise) ...it's smooth, fast, & very, very enjoyable!!! 👍👍", "verified": true, "helpfulness": "0/0", "author": "Eric Beater"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "val"}, {"rating": 2.0, "review": "Not kid friendly. My 6 year old can work the roku with no problems. This fire stick is difficult for an adult to use. It's been one headache after another. Can't even set up his favorite stations because Amazon doesn't acknowledge Charter. Should have bought another roku", "verified": true, "helpfulness": "0/0", "author": "Stacy"}]