[{"rating": 1.0, "review": "I ordered two of these gadgets, they both were easy to set up and use...  for the first two months, then they started freezing and losing WiFi connection, and even with soft and hard resets it still has trouble maintaining a connection for the length of a movie. I also own two Roku streaming devices, and they don't have any issue connecting to the network.", "verified": true, "helpfulness": "0/0", "author": "M.Demartini"}, {"rating": 5.0, "review": "It's worth the price!", "verified": true, "helpfulness": "0/0", "author": "ogi"}, {"rating": 5.0, "review": "Very easy too install on TV.  However, getting the cover off of the remote to install batteries is very difficult.  No instructions came with it on how to remove cover.  Had to go to YouTube to find out how to get the cover off.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Does what I want it to do at a great price.", "verified": true, "helpfulness": "0/0", "author": "ZEKE"}, {"rating": 3.0, "review": "The stick works pretty good.  I was not aware of the bandwidth because it keeps asking me if I want to continue viewing.  I also wasn't aware how few shows and movies Amazon Prime membership covered the fees for.", "verified": true, "helpfulness": "0/0", "author": "Shawn E Shimek"}, {"rating": 2.0, "review": "Would be great if HBOgo worked with comcast. That was my whole reason for getting it.", "verified": true, "helpfulness": "0/0", "author": "Chris Mendoza"}, {"rating": 5.0, "review": "It does what it advertises.  Easy installation.  I wish the main page was not so cluttered, but I have not spent any time yet to see if I can make a personalized usage page.", "verified": true, "helpfulness": "0/0", "author": "Dawn \"Dawn\""}, {"rating": 5.0, "review": "We cut the cord. Between the fire stick and an antenna we see all we want. The fire stick is awesome.", "verified": true, "helpfulness": "0/0", "author": "Peter B. Van Winkle II \"Pete\""}, {"rating": 4.0, "review": "Great device.  The only thing that really bothers me is having to plug it into an electrical socket. It would be much more user friendly if I had the option to plug it into a USB port like Chromecast does.", "verified": true, "helpfulness": "0/0", "author": "KariK"}, {"rating": 4.0, "review": "It was very easy to hook up and I love that", "verified": true, "helpfulness": "0/0", "author": "Pamz18"}]