[{"rating": 1.0, "review": "When i got my fire stick i connected it too my vizio tv nd it doesnt work!!! Dont know if its the stick or my tv... When i connect it the screen shows Amazon then turns black and starts acting dumb havent been able too use it....... How can i return it? Or fix this problem", "verified": false, "helpfulness": "0/0", "author": "alyce"}, {"rating": 5.0, "review": "Love this! Very great product.", "verified": true, "helpfulness": "0/0", "author": "Alexandra R"}, {"rating": 5.0, "review": "Best thing i have purchased for my tv. Seems to be faster than my roku and the games are fun too. Definitely going to buy more for my other tvs when on sale again.", "verified": true, "helpfulness": "0/0", "author": "sean scott"}, {"rating": 5.0, "review": "Wao. Its amazing. Great TV stuff. All your prime shows plus more... just dowload the apps. Dropping down Dish to the 19.99 pak. Stick has everything else.. Buy it. Its worth it.", "verified": true, "helpfulness": "0/0", "author": "alberto rosario"}, {"rating": 2.0, "review": "waste of money.  it stopped working after a month.", "verified": true, "helpfulness": "0/0", "author": "ANITA MORTEL"}, {"rating": 5.0, "review": "Works great :)", "verified": true, "helpfulness": "0/0", "author": "cindy miranda"}, {"rating": 5.0, "review": "Received earlier that promised (even with Prime!).  Works great.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Delostrino"}, {"rating": 2.0, "review": "I bought this to replace my Apple TV because in addition to HBOgo and Netflix it also has YouTube and Amazon instant video.My first annoyance was that YouTube is really choppy and only works half the time while Netflix and HBOgo don't have a choppy issue.My second annoyance is how it significantly slows down my internet, so much that I can't carry a Google chat conversation while streaming.My third and biggest gripe is how the screen keeps going to sleep every 8-10 minutes while watching a show. It'll start displaying the default screensaver while the sound is still playing. I had to hit any button on the remote to wake it up at least 5 times during one episode of The Wire. Can't find a solution to this problem in forums.Definitely will be returning this and going back to my Apple TV setup.", "verified": true, "helpfulness": "0/0", "author": "V.N."}, {"rating": 4.0, "review": "I purchased the Amazon Fire TV Stick mainly for streaming Netflix on our bedroom television. It was very easy to set-up, and I logged on to Netflix almost instantly. It is serving the exact purpose I purchased it for well. I don't care for the cluttered look of the home screen, and occasionally my streaming gets interrupted. I don't think this is a problem with the wiFi, as I have never had this problem with any other device. I also wasn't happy to see this go on sale for $19 on Prime Day, after I had purchased it for $34. Overall, it works well for our lesser used television.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "This  definitely get my pick for product of the year. I have purchased 2 more.", "verified": true, "helpfulness": "0/0", "author": "Jaylyn"}]