[{"rating": 4.0, "review": "I'm loving it!", "verified": true, "helpfulness": "0/0", "author": "Manny"}, {"rating": 5.0, "review": "Love it, very easy to install. The power cord could be a little longer.", "verified": true, "helpfulness": "0/0", "author": "Robert Ketcham"}, {"rating": 1.0, "review": "So tired of trying to get this thing to work.  Trying to get it to hook up with my wifi connection is a nightmare. According to other comments online it uses tons of bandwidth and data, (as well as getting BLAZING hot) so I unplug it when not in use. EVERY SINGLE TIME I plug it back in is a nightmare. Kids are upset. I'm upset. Not worth $40.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 1.0, "review": "I have Roku on one of my TV's and the Fire-stick on another and i find, so far, that the Roku seems to be much more organized and the Fire-stick seems to be more scrambled.I have just recently set up the Fire-stick and may be more pleased the more I use it.I am an Old Guy so maybe performance is not being up to the task but sincerely for me Roku is easier to operate.Old Guy", "verified": true, "helpfulness": "0/0", "author": "Old Guy"}, {"rating": 5.0, "review": "i love it!", "verified": true, "helpfulness": "0/1", "author": "T Hunt"}, {"rating": 5.0, "review": "We love it!  Lots of variety.", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 2.0, "review": "Like most have experienced...a lot of skipping and freezing during playback...had no previous issues with Chromecast on same TV", "verified": true, "helpfulness": "0/0", "author": "Eric F."}, {"rating": 5.0, "review": "Works awesome! Even better than roku! We love it. Easy to use and set up", "verified": true, "helpfulness": "0/0", "author": "e bobcat"}, {"rating": 5.0, "review": "luv it!", "verified": true, "helpfulness": "0/1", "author": "Whatever 22"}, {"rating": 3.0, "review": "Have not been able to use, as our TV has only one HDMI port and it is already used by satellite receiver. Will look for multiple adapter next time we are in town.", "verified": true, "helpfulness": "0/0", "author": "BIff Basham"}]