[{"rating": 1.0, "review": "seems ok have not gotten to find movies that i want to watch just amazons lists still looking for search option. it seems like a waste of money to me i canceled my99 dollar amazon subscription it would not let me sign up for hula or netflix waste of 39 bucks", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I like the clarity of the movies also setup was easy I am sixty three and it was a breeze. I had a little problem opening battery case to remote.", "verified": true, "helpfulness": "0/0", "author": "rena"}, {"rating": 1.0, "review": "This is a great way -- to view AMAZON TELEVISION!!!!!!It won't play Netflix, and hundreds of other customers are having the EXACT same problem as me: a message, no matter what show/movie you pick, saying \"We're having trouble delivering this title at this time, please try again later.\" I updated the app, rebooted the stick, did all the little fixes, and IT STILL DOESN'T PLAY NETFLIX! AMAZON, I'M STARTING TO SMELL A RAT!From a longtime Prime customer.", "verified": true, "helpfulness": "0/2", "author": "C. Carr \"the baron\""}, {"rating": 3.0, "review": "Which ever 1 isn't showing activities is the 1 I can't get activated my brother has the other 1 he's watching True Blood his was a gift", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "hooked143"}, {"rating": 5.0, "review": "Wonderful product!! Very pleased!", "verified": false, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 5.0, "review": "I would not mind having less connection issues...", "verified": true, "helpfulness": "1/1", "author": "NikkiLee"}, {"rating": 5.0, "review": "Amazing! ! Totally enjoy benefits of a smart tv with my fire stick! !", "verified": true, "helpfulness": "0/0", "author": "Dee"}, {"rating": 1.0, "review": "I bought this specifically for use with mlb.tv, opening day and I couldn't watch the live stream on a 50mb connection. EPIC FAIL!", "verified": true, "helpfulness": "0/2", "author": "Paul G. Westcott"}, {"rating": 5.0, "review": "Just love it that all I can say", "verified": true, "helpfulness": "0/0", "author": "Donta m."}]