[{"rating": 5.0, "review": "This is a great way to have amazon prime and Netflix wherever you need it! I also like that it comes with its own remote.", "verified": true, "helpfulness": "0/0", "author": "Casey"}, {"rating": 4.0, "review": "At first I was really disappointed that it was buffering and seemed to not work.  Then I re-read the email stating that you should use the USB extender, when I connected the extender chord, it made the stick work pretty flawlessly.  I would give it 4 1/2 stars, just because the Kindle app doesn't work with my Kindle HD device.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"kara_scene\""}, {"rating": 5.0, "review": "Awesome and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Trina"}, {"rating": 5.0, "review": "Cannot love it any more!", "verified": true, "helpfulness": "0/0", "author": "Sators \"Sators\""}, {"rating": 5.0, "review": "I absolutely LOVE my fire stick!  There is soooo much you can do with the fire stick.  It has so much to offer, I'm super excited I bought it.  I primarily use it for netflix and Amazon Prime streaming movies and shows.", "verified": true, "helpfulness": "0/0", "author": "jackson2013"}, {"rating": 5.0, "review": "love the fire stick.  I can finally watch amazon prime on my television. haven't watched prime for awhile because I couldn't find the shows easily.  Now with the stick it sets it up more like Netflix style when finding the shows and keeping them in line.", "verified": true, "helpfulness": "0/0", "author": "Berg137"}, {"rating": 4.0, "review": "Awsome device.A ton of thing to navegate through and watch.The movies to purchase/rent should be cheeper!? Great purchase all in all", "verified": true, "helpfulness": "0/0", "author": "erik Mars"}, {"rating": 3.0, "review": "Plain simple the best for the price point", "verified": true, "helpfulness": "0/0", "author": "Gilberto G."}, {"rating": 5.0, "review": "Great way to watch Netflix, Hulu, Showtime and more. Easy to set up and use. Much cheaper than a smart tv!", "verified": true, "helpfulness": "0/0", "author": "McKinney Mom \"MM\""}, {"rating": 3.0, "review": "When I was looking at the movies and show that were listed for the Fire Stick, I was impressed at the number of film available. Silly me, I forgot to see if you were Charging for the movies. Soon AFTER I bought the Fire stick, I suddenly realized my mistake. I have been using Netflix for many years and the download selections are all free, Sadly I was wrong. I realize I should have looked a bit harder. So I'm the one at fault.However, I must admit that the Fire TV Stick has some GREAT screensavers.", "verified": true, "helpfulness": "0/0", "author": "Art C"}]