[{"rating": 5.0, "review": "The Fire TV Stick was easy to set up within minutes.  Was able to connect to my wireless router without difficulty. Price is reasonable. Would reconmend product.", "verified": true, "helpfulness": "0/0", "author": "Juby M \"Juby\""}, {"rating": 3.0, "review": "Ok, just wish prime video app had a search box where I can type in the name of the movie I'm looking for. I have to search through hundreds of movies just to find the movie I'm looking for. Maybe I'm doing something wrong? If I am then I'll rate higher.", "verified": true, "helpfulness": "0/0", "author": "L. Coleman"}, {"rating": 4.0, "review": "Amazing product!!  BUT.....the only reason we got one was so that my kids could mirror their Kindle Fires.  Turns out you can't mirror your Kindle Fire HD6.  You can mirror your Apple device or Android device via app but not your Amazon product!  Only the Kindle HDX will mirror.  However, streaming Amazon Prime and Netflix in HD is fantastic!  So is playing games.  If you are just interested in streaming video, this is, hands down, the best product on the market.  If you want to game, the Fire TV is a little better.  If you want to mirror your device, go Apple.", "verified": true, "helpfulness": "0/0", "author": "ASH"}, {"rating": 3.0, "review": "Doesn't work with Time Warner Cable, and the parental controls are really lame. So, I have access to a little bit of content because I'm a Prime member (for another 6 months) but to be honest, it rarely gets used.", "verified": true, "helpfulness": "0/0", "author": "Samiam888 \"--Samiam--\""}, {"rating": 5.0, "review": "I also found the remote hard to put the battery in, to the point where I watched a you tube video, but once I set it up my family and I were thoroughly impressed. Will be canceling cable in the near future ! Gotta love technology.", "verified": true, "helpfulness": "0/0", "author": "dd622"}, {"rating": 5.0, "review": "Installed two Fire sticks last week. They work perfectly. No phone , tablet or computer needed. They connect to your Wifi , and contain the needed software to stream all the services you could ever imagine. I will be adding a fire stick to every TV in the house. The Chrome Cast that I previously had,don't come close competing with Amazon's Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Mick Moyer"}, {"rating": 3.0, "review": "You get what you pay for.  I have Fire TV and love, love, love it!  So I bought the Fire TV Stick for a second TV and I have been disappointed.  It it very slow and frequently times out.  I would recommend spending the extra money and buying Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 5.0, "review": "A lot better than I expected! It plugs into an HDMI port and it's easy to move around from room to room. It doesn't require any bulky equipment, which is a major plus! It isn't spotty, even though our internet doesn't have the greatest connection because of the area we live in. I love that you can have Amazon prime, Hulu, Netflix, HBO, YouTube, and then some all in one place! If I want to go back to my cable I just switch sources using my remote and I don't have to unplug/plug anything.", "verified": true, "helpfulness": "0/0", "author": "Jzmn"}, {"rating": 5.0, "review": "We love it. Perfect for what we need.", "verified": true, "helpfulness": "0/0", "author": "Crystal C Rumsey"}, {"rating": 5.0, "review": "Very easy to set up.  Includes both Netflix and Amazon prime apps", "verified": true, "helpfulness": "0/0", "author": "White collar"}]