[{"rating": 5.0, "review": "Easy to set up and use. I will be buying one more.", "verified": true, "helpfulness": "0/0", "author": "cate"}, {"rating": 5.0, "review": "A cheap easy way to watch amazon prime on your TV. It also plays Netflix, showtime, hulu plus, Pandora,and others. I also have a chromecast but like the fire TV stick better because of the remote for the fire tv. It is nice not to need to use your phone as a remote. You cannot stream content from your computer to the fire tv stick like you can with the chromecast. I now use the fire tv stick almost exclusively.", "verified": true, "helpfulness": "0/0", "author": "Samantha M."}, {"rating": 5.0, "review": "We have found so many movies that we watch for free with Amazon Prime. The Fire Stick has been an awesome gift.", "verified": true, "helpfulness": "0/0", "author": "Barbara Pitts"}, {"rating": 4.0, "review": "Not much use of it yet, but so far, so good.", "verified": true, "helpfulness": "0/0", "author": "old duffer"}, {"rating": 5.0, "review": "The amazon Kindle has been my favorite product for years.  We just got our Fire TV Stick, I have a new favorite.  So EASY to use.  Worked perfectly right out of the box.  It was awesome to buy something, get it set up in minutes, and working with no issues.  Better than advertised!  Love the remote and the ease of use.  Even the welcome video was awesome!  We got the Xbox One for Christmas and getting it set up was an all day event!  We will be cancelling cable in the summer.  THANK YOU AMAZON!", "verified": true, "helpfulness": "0/0", "author": "M. Spires \"Hoots\""}, {"rating": 5.0, "review": "Awesome...", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 2.0, "review": "When you click on some programing such as The Documatary program, I had to unplug the power to the stick and Re-Boot the stick. This happens 3 times the same evening. On other programs you try to open it opens and then just sits there with a blue screen. Again un plug and start again. Another time your in the middle of watching something and the commercials cut in in the middle of a sentence or the show. I know it's going to take sometime to get used to it but these are a few things that don't seem to be normal.", "verified": true, "helpfulness": "0/0", "author": "Gordon P."}, {"rating": 4.0, "review": "I didn't find the remote as easy to use as others I have used. I did not understand that the Fire Stick had an AC connection. I've used it a few times and it's getting easier.", "verified": true, "helpfulness": "0/0", "author": "Joyce Wallen"}, {"rating": 5.0, "review": "Realy am enjoying it and watched all the Bosch series.  Hope there will be more of them!!!", "verified": false, "helpfulness": "0/0", "author": "Larry Roath"}, {"rating": 1.0, "review": "Constant problems which take hours of Amazon phone time to correct. Causes router problems with other household wifi devices. Requires setup of an Amazon account & their system continues to drop info. & not allow re-establishment of the account because the email address was already used. Best advice: buy a new wifi equipped DVD player for about $80 which already has Netflix, Youtube, & more built-in. Amazon is selling this defective crap & making little attempt to correct the flaws in it. My unit was replaced once after becoming so hot that it was about to catch on fire. The first unit got my attention because it was smoking & now the replacement unit is doing the same. Amazon needs to spend less phone time trying to convince you to keep the defective item & more time solving the problem which could lead to a fire which could potentially harm. Maybe they should fix what they already have instead of trying to use drones to deliver more defective products. I'm going to stop making Amazon purchases because their quality standards seem to be low.", "verified": true, "helpfulness": "0/0", "author": "DC-Jim"}]