[{"rating": 5.0, "review": "So easy to use , price is worth it!", "verified": true, "helpfulness": "0/0", "author": "wendy dicarlo"}, {"rating": 5.0, "review": "I now own two Fire TV Sticks and one Fire Tv, which I love. I tried the Roku and Andriod box before I got my Fires, and they just do not measure in anyway. I recommend either of the two over anything out there when it comes to streaming.", "verified": true, "helpfulness": "0/0", "author": "J.P.G."}, {"rating": 5.0, "review": "It was difficult getting it to work, but once I got it to work it was fine", "verified": true, "helpfulness": "0/0", "author": "Mel"}, {"rating": 1.0, "review": "Hit or miss rarely works", "verified": true, "helpfulness": "0/1", "author": "pranee mclean"}, {"rating": 3.0, "review": "My kids love watching youtube on the tv. We have loved having amazon prime for the last 3 years this makes it easier to watch prime movies. The only down side is most of our movies are on VUDU and it is not supported by the amazon fire tv stick. We tried using flixster but can not get it to work.", "verified": true, "helpfulness": "1/1", "author": "Kenneth Peterson"}, {"rating": 4.0, "review": "It's pretty good for the price.", "verified": true, "helpfulness": "0/0", "author": "johnny cash"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Eder O Palma"}, {"rating": 5.0, "review": "LOVE THIS THING!  If you're a Prime member and up I like TV and/or movies, this is it!  There are very many movies and TV series that come as part of your Prime membership. If you TV is not capable of tapping into internet features, (and even if it is) this fire stick can do that for you.  The interface with this is much better and easier to navigate than the interface that comes built into your smart TV if you have one.  I'm sold and even cancelled my NetFlix membership!", "verified": true, "helpfulness": "0/0", "author": "Mark E. Wilson"}, {"rating": 5.0, "review": "I had a Roku and I sold it after I bought this, and I will be buying a second Fire TV stick. We didn't think we needed it as we have various game consoles, but it works so smoothly and boots up quickly. Great quality and of course great Amazon customer service. Love it!", "verified": true, "helpfulness": "0/0", "author": "thatgamermom"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Hope Pickhartz"}]