[{"rating": 5.0, "review": "I Iove this thing!  I am so impressed with all it can do. I love the simple remote. It's only flaw is the home button is right above the play button which sends me home a little too often. l also love that you can use an app as the remote. Perfect if you misplace it or the batteries are dead.", "verified": true, "helpfulness": "0/0", "author": "Sarah W \"Quality Assurance: Home Version!\""}, {"rating": 5.0, "review": "I think the Fire TV Stick is going to make me buy new couch. I am turning into a couch potato...I am not sure about this yet because I have just received it in the mail box 31 minutes ago. I opened it and received a gift of a paper cut for my struggle of the box. Was it worth it? YES! Not saying that I would like another paper cut for another device. Those things HURT! But this thing is fast. It zooms right through. I wonder how people can say that it took them 15-30 minutes for hookup with it. The Amazon Fire TV Stick took me a whole 8 minutes 31 seconds to hook up. Yes we timed it. Pulled out our track stop watch and Poof there it went like a Christmas tree it lit up my screen.What is the Amazon Fire TV Stick?Amazon's Fire TV Stick is an HDMI dongle version of the Fire TV set-top media streaming box. It's a very similar product to the Google Chromecast and Roku Streaming Stick.In this SIZE does matter!!!It is 5 inches of length and 1 1/2 inches wide of goodness for the remote. The HDMI Angular adapter is 5 inches long of yumminess. The android cord to connect to the wall is a long 60 inches to connect to USB wall charger. The wall charger is a tiny 1 1/2 inch box to connect to your outlet. All of this deliciousness was included in this for the outstanding price of $39. (Although I received mine for $19 using Amazon Prime.)The smaller the better. Although by the end of the month I will be losing the remote because it is so small. Glad I can have an app on another device. I just find that the Fire TV Stick is not cluttering my TV stand or my kitchen counter with a box the size of a suitcase anymore. Easy as can be.Amazon Fire TV Stick: Specs and featuresThe Fire TV Stick plugs directly into your TV (or a monitor with an HDMI port) and connects to your router so you can stream content over the internet. It comes with services such as Netflix, Amazon Prime Instant Video, Spotify and Plex. See also: Netflix vs Amazon Prime Instant VideoUnlike the Chromecast, the Fire TV Stick comes with a physical remote control but can also be controlled via an Android app. Amazon says the iOS app is coming soon. I am glad I use an android phone at this point. It also is compatible with my Kindle Fire HD 8.9\", . (Can we say I am in AWE of Amazon?)If you're not a Prime member, then the Fire TV Stick is a good way of trying the 30-day trial and Amazon access to 200,000 TV episodes and movies, millions of songs, and hundreds of games. (Oh and if you don't have prime you should get it. It pays for itself with 2 day shipping, movies, music, books, and games. You get the point.)Fire TV has four times the storage (8 GB) and twice the memory (1 GB) of the Chromecast. It also features a dual-core processor and dual-band Wi-Fi with multiple input multiple output.Dual-core processor ,8 GB storage, 1 GB RAM, Dolby Digital Plus certified surround sound, Dual-band Wi-Fi (with MIMO), Remote control and HDMI extender included, Video output up to 1080p, Netflix, Amazon Instant Video, Hulu Plus, YouTube, Pandora,  PBS Kids, Watch ESPN, Bloomberg TV, Crackle, Twitch, HBO GO, 200+ games", "verified": true, "helpfulness": "1/2", "author": "Amindreader"}, {"rating": 3.0, "review": "It is nice but was hard fitting in the HDMI TV inlet. I had to use the extension although it was not needed if the stick fit. Also for some reason it fails and stop working.", "verified": true, "helpfulness": "1/1", "author": "kamal a. hage"}, {"rating": 4.0, "review": "Using on second TV to watch Netflix.", "verified": true, "helpfulness": "0/0", "author": "C. Smith"}, {"rating": 5.0, "review": "Loved it", "verified": true, "helpfulness": "0/0", "author": "pongdict"}, {"rating": 4.0, "review": "Works as expected. Bought this at promotion cost of $19.99", "verified": true, "helpfulness": "0/0", "author": "djod41"}, {"rating": 5.0, "review": "great product, good price, great service!", "verified": true, "helpfulness": "0/0", "author": "Rafy Levy \"designer\""}, {"rating": 5.0, "review": "Best investment I could have made! I will be using this very often. I'm telling all my friendsand would say that everyone should have this!", "verified": true, "helpfulness": "0/0", "author": "Ronald Gibson"}, {"rating": 5.0, "review": "I bought it as gift. He said works like magic. Loved it. Loved it.", "verified": true, "helpfulness": "0/0", "author": "aidan61"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "monkeyshine"}]