[{"rating": 1.0, "review": "One star because this thing over heats, cuts out and won't stream, and too boot I have sent multiple emails and requests for support and I have gotten nothing but more emails telling me to email support again so they can contact me at a later date.  I believe a week later would sufice.", "verified": true, "helpfulness": "0/0", "author": "Robert Stearns"}, {"rating": 5.0, "review": "I use a hot spot for wifi I have tried a lot of different ways to watch tv and movies, Fire TV stick has been the best way I've found yet. Chrome cast didn't even work this well way to go Amazon", "verified": true, "helpfulness": "0/0", "author": "tom"}, {"rating": 3.0, "review": "I thought one of the features was to access HBO Go. It's not. HBO Now is an option, but I don't even know what that is....", "verified": true, "helpfulness": "0/1", "author": "Ant"}, {"rating": 5.0, "review": "I am so sick and tired of Direct TV and their endless phony reality shows.  And the gouging costs!!!!  So we decided to give this a try.  After all I love reading but couldn't believe that Kindle could be a good reading experience and I absolutely love the Kindles...we have four now, and more books than I ever thought possible to get in our little house.  And I love the Kindle reading experience, probably spend 4-6 hours a day reading....So now we look forward to learning how to use the Fire Stick....and being able to watch what and when we wish.  good riddance to Direct TV and many many thanks to Amazon for all the cool stuff they keep creating.  I think they are making my old age much better than it would have been!", "verified": true, "helpfulness": "0/0", "author": "Austintatious"}, {"rating": 2.0, "review": "I was really excited about the Fire Stick but unfortunately it's been a disappointment as it will not connect to our xfinity x1 wifi. All of our devices  connected to our wifi effortlessly but for whatever reason the same cannot be said for the Fire Stick. We only get error messages when trying to connect. If the issue was fixed I would gladly give a better rating.", "verified": true, "helpfulness": "0/0", "author": "eppfam06"}, {"rating": 5.0, "review": "FAST DELIVERY!!", "verified": true, "helpfulness": "0/0", "author": "Felicia Blessing"}, {"rating": 5.0, "review": "I love my fire stick. The simplicity is great and I cannot believe how affordable it is!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The most bang for your streaming buck.  I own 2 apple TVs and swear by them.  The firestick I bought to have while traveling and it has far exceeded my expectations.  It's fast, has lots of apps, even some that can do AirPlay streaming/mirroring (ymmv).  Access to amazon content, games, etc. make this item a no brainer.  You won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Joseph B"}, {"rating": 4.0, "review": "Not as many network station apps as I had hoped.", "verified": true, "helpfulness": "0/0", "author": "ipr151"}, {"rating": 5.0, "review": "This is a great, great device.We have a rook and a chromcast to stream and this is my favorite.The Roku is good, but the last version keeps breaking and they don't have as many agreements with movie channels as Chromecast and Amazon do.Chromecast is so-so.  The app section is better, but not having a remote is not convenient (for our family at least) and we have found that when we travel, the wifi better be VERY strong for any hope of the chromecast working.  Another downside to the Chromecast is their lack of partnership with Amazon.The GUI on the fire is great.  There are a few things I would change- like having a favorite app section on the home screen to easily navigate to other \"channels\" right now we mostly use \"most recent\" and I wish the \"back\" button and \"home screen\" button on the remote were in a different spot.  Overall- little things compared to being able to have channels like HBO, Showtime, Starz and Encore- along with the big three streamers; Amazon, Netflix and Hulu.", "verified": true, "helpfulness": "0/0", "author": "fatbald1 \"jjwise1\""}]