[{"rating": 4.0, "review": "Works Well, but occasional conflict with Wireless Router.", "verified": true, "helpfulness": "0/0", "author": "Francis A"}, {"rating": 2.0, "review": "while playing anything, it continues to buffer so that I am unable to view anything.  I need to send it back.  Just have not had the time to do so lately because of other pressing obligations.  I have high speed internet and it should work.  I also have apple TV which works with no problems.", "verified": true, "helpfulness": "0/0", "author": "Randall D Smith"}, {"rating": 1.0, "review": "The Fire Stick was buffering every few minutes. Very irritating. Returned it. Dont waste your money. Roku is much better. Great customer service from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Mary S \"Mary S\""}, {"rating": 4.0, "review": "I had a Fire TV, but couldn't resist one of these at the Prime introductory price of $20. And, for the most part, it works as well as the former. The wireless is slightly less strong; I had to put the Fire TV in the room with the weakest signal. The lack of voice control didn't bother me at all, I never use it on the other anyway. I also don't use either system for gaming or \"non-watching\" apps.The downside with both is that Amazon apps are the last priority for many companies. A fan of Community, Yahoo had an app for Apple TV and Android at its release; however, they still lack a Fire TV version.For the price, I'd recommend this over the full-blown Fire TV in most cases.", "verified": true, "helpfulness": "0/0", "author": "Chris A Crawford \"cjcmd\""}, {"rating": 4.0, "review": "Love this item.Head and shoulders above a chromecast, this stick is way faster.I am having a few issues with suddenly losing wifi connection (or losing good connection and HD movies going to fuzz) or freezing when starting an app first thing after it loads the \"Home\" screen. The freezing issue only happens when it has been on all day. The wifi issue is a little more common. Movies suddenly stop loading, and it shows a \"No Internet Connection\"  message after about 30 seconds. Fixing it requires that I unplug the stick, wait a few seconds, and then plug it back in. Not sure if this is an isolated issue or not, but this is where the star came off my review.Have used it almost constantly since arrival, as I have a 2-year-old who loves to watch PBS Kids and a wife who uses Netflix or Prime Video when she is doing things around the house.Remote is nice, but has a tendency to double directional button presses rarely and randomly (in other words, not just on a single direction).Bottom line: The Fire TV Stick loads faster than a Chromecast, has great features, and gives access to all of the main entertainment apps I use. I am having a few issues, but nothing deal breaking, and am satisfied with my purchase. Would buy again.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Paul Rouse"}, {"rating": 5.0, "review": "Five stars - nuff said.", "verified": true, "helpfulness": "0/0", "author": "george l. morgan"}, {"rating": 4.0, "review": "Works like a charm!", "verified": true, "helpfulness": "0/0", "author": "kathy tilton"}, {"rating": 2.0, "review": "I would give Fire TV Stick 5 stars if HBO GO was part of it as all commercials and ads state HBO GO is included.  It should be stated that Comcast subscribers will not get HBO GO.", "verified": true, "helpfulness": "0/0", "author": "Lorenzo"}, {"rating": 2.0, "review": "Slow and buffers often.  It's not my connections as I use a wii and it's fast for playing Netflix.  We wanted to move the wii into another room, so I got the fire stick.  Fire stick is less than 10' from router (same place as the wii was).  When looking at the menu it will not save what you were looking at before, so you have to scroll all the way again.  Does not offer categories for Netflix, like all my other devices, phone, tablets and computers.  The \"apps\" it offers, many of them are no longer working and have not been removed or replaced with something new.Does it work?  YesIs it up to my expectations?  No", "verified": true, "helpfulness": "0/0", "author": "Bill Franklin"}]