[{"rating": 1.0, "review": "Not what I expected or what was advertised! The Fire TV Stick needs to plug into a HDMI port and needs power. If you have a Cable and Blue Ray player then you have to have a TV with 3 or more HDMI ports. Also the power cord which is the same as the Kindle is too short so I had to plug it into a an extension cord. The number of options advertised don't show up on my Fire TV Stick. Would not recommend. Doesn't replace a good smart TV.", "verified": true, "helpfulness": "51/65", "author": "William Denninger"}, {"rating": 5.0, "review": "Buy this, don't even bother with other stream sticks. I'd almost consider this to be a better option than the Fire Tv, I own both and they both work flawlessly the difference is this one doesn't have voice activation on the remote (but you could use your phone) and cost a fraction of the Fire Tv.", "verified": true, "helpfulness": "0/0", "author": "Fernando Fonseca \"Computer geek\""}, {"rating": 5.0, "review": "I give fire stick 5 stars!!", "verified": true, "helpfulness": "0/0", "author": "milagros"}, {"rating": 4.0, "review": "Very impressed with the user interface and viewing speed. Searching is better too.  And, I no longer have to deal with the 'Sony' problem when viewing Netflix content.", "verified": true, "helpfulness": "0/0", "author": "FXHetherington"}, {"rating": 3.0, "review": "Often hesitates when remote is used, picture freezes and loses the wireless signal. When it works it works great. (Should add Slacker to Apps).", "verified": true, "helpfulness": "0/0", "author": "Michael W. Cornish"}, {"rating": 5.0, "review": "It work fine,easy to intall.lot movie and show to chose.great product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I like the small footprint and it automatically configured the device when the device was on the wireless. However, the wireless connection does not stay all the time. The device required power cycle to reconnect to the wireless.", "verified": true, "helpfulness": "0/0", "author": "WBC \"CaptKave\""}, {"rating": 1.0, "review": "Could not make it work no matter how hard I tried or how much time I spent trying.  Had to return it.  A disappointment, no doubts about it.  Maybe the next generation of Fire TV Stick will work better for me.  By the way, I do have a 2014 Samsung TV packed with all kinds of bells and whistles, including Wi-Fi and it picks wireless just fine, so that was not an issue.", "verified": true, "helpfulness": "1/1", "author": "QBN"}, {"rating": 4.0, "review": "I don't really notice much difference than Roku as far as streaming Netflix goes.  I don't really use the other features, such as moblie streaming or apps.  And, Netflix service is probably the biggest problem with it, so the stick doesn't make much difference.", "verified": true, "helpfulness": "0/0", "author": "PLG"}, {"rating": 5.0, "review": "Works like a champ!  Love it!  Just wished I could add HBO to it.  :-(", "verified": true, "helpfulness": "0/0", "author": "E. Benson"}]