[{"rating": 5.0, "review": "It is awesome! User friendly!", "verified": true, "helpfulness": "0/0", "author": "Deanne Holman"}, {"rating": 5.0, "review": "It performed well and did everything it was supposed to do.Easy to set up and get started.", "verified": true, "helpfulness": "0/0", "author": "Deborah A."}, {"rating": 4.0, "review": "I was impressed with the Fire TV stick's easy install and setup. I installed the physical device on a HDMI port on my surround sound system which not only let me us the TV but gave me a much better listening option. The interface is simple and saves recently viewed or listened to items which allows easy continued viewing of TV episodes in a series. As well as favored music choices of Prime music. It imported all the saved music from all of my networked computers. The only downside to that was a lot of duplication and I have yet to learn how to reduce the duplications.I would have given it five stars if I had been able to listen to Prime Music Stations but, alas, I could only access saved music and playlists along with the Prime playlists on the device. This was a big disappointment as it was the primary reason for getting the Fire TV stick was to listen to Prime Music Stations on my stereo. Big disappoint there, but what I can listen to sounds really great.", "verified": true, "helpfulness": "0/0", "author": "Colonel C."}, {"rating": 5.0, "review": "I haven't watched any movies or programs yet, but have set up a watch list for later.  It was so easy to hook up and I'm sure I'll enjoy using it in the future.  One thing I really like is the great variety of things available.  The quick shipping was an added bonus.", "verified": true, "helpfulness": "0/0", "author": "Mary K. Heath \"Marida\""}, {"rating": 5.0, "review": "Easy to use even for a novice", "verified": true, "helpfulness": "0/0", "author": "Gregg Arickx"}, {"rating": 5.0, "review": "Makes using prime movies and music easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jason B Iha"}, {"rating": 5.0, "review": "I got this the day after I ordered it.  It was easy to install.  Love it!!!", "verified": true, "helpfulness": "0/0", "author": "KAYE PROPST"}, {"rating": 5.0, "review": "Best purchase ever! Easy to install, all the TV, movies, games and music you could ask for. I have only had it for a couple days and am totally hooked. Have been binge watching Netflix and HBO since Sunday. Highly recommend :)", "verified": true, "helpfulness": "0/0", "author": "Trish"}, {"rating": 5.0, "review": "Easy to use and good quality picture.buying a second one for my other tv soon.", "verified": true, "helpfulness": "0/0", "author": "Mapathe"}, {"rating": 5.0, "review": "I absolutely love my Amazon Fire TV Stick. Its really easy to set up and use. I love that its all just on my tv screen and I don't have to use my phone or computer.", "verified": true, "helpfulness": "0/0", "author": "Carrie Kragt"}]