[{"rating": 5.0, "review": "Very quick response and easy to set up. Love my Netflix, I just wish Comcast would contract with Amazon so I can have my HBO Go!", "verified": true, "helpfulness": "0/0", "author": "KissaMew"}, {"rating": 5.0, "review": "Good product does what it says it does", "verified": true, "helpfulness": "0/0", "author": "Omar f"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "D. Provost \"grandma27kids\""}, {"rating": 3.0, "review": "I have to restart it every 2 or 3 days. It freezes and I would recommend the chromecast instead.", "verified": true, "helpfulness": "0/1", "author": "JL85"}, {"rating": 5.0, "review": "Love this thing! Had two Chromecast and now they are collecting dust. Bought 2 of these to replace them and never looked back.  Offers the same and so much more with a remote, streaming capabilities, and countless apps. I use it even with a smart tv so that in itself shows how much I think of them. Great product!", "verified": true, "helpfulness": "0/0", "author": "brown92"}, {"rating": 5.0, "review": "Great item!", "verified": true, "helpfulness": "0/0", "author": "Ronald R Schrieber II"}, {"rating": 5.0, "review": "Zipa di dooda. Can't believe how simple plug play and work great. I can't believe I waited so long. Get one today seriously.", "verified": true, "helpfulness": "0/0", "author": "joseph rich"}, {"rating": 5.0, "review": "Amazing! Much faster than Chromecast! Works perfectly with Plex! Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "F. Zamiri \"Persian Prince\""}, {"rating": 5.0, "review": "recently bought this as a bday gift for a friend.  so far, it has gotten rave reviews and they love it.", "verified": true, "helpfulness": "0/0", "author": "Robin Burgos"}, {"rating": 4.0, "review": "I am very disappointed in this item. For starters, I bought it to watch HBOgo on my TV and it is not compatible with my cable provider (Comcast Xfinity) so it is useless to me. Then when I was setting it up, it offered a FREE 30 day Prime trial yet they charged me $99 for membership. Very frustrated right now!EDIT- Amazon refunded me and I've grown to like my Fire TV Stick for Netflix and Youtube. Still one star off for not being able to use it for HBOgo, the main reason I purchased it. I assume this is more of an issue with Comcast and/or HBO, just wish I would have know when buying.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}]