[{"rating": 4.0, "review": "Very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey L. WIley"}, {"rating": 5.0, "review": "It has worked great and it has delivered everything I need and more thank you AMAZON", "verified": true, "helpfulness": "0/0", "author": "Zach lujan"}, {"rating": 5.0, "review": "One of the best items that I have purchased in a long time.  I'm having a great time with it.", "verified": true, "helpfulness": "0/0", "author": "KENNETH GORR"}, {"rating": 5.0, "review": "One of the better streaming sticks around. Enjoy the remote as opposed to using my phone on a similar product.", "verified": true, "helpfulness": "0/0", "author": "RdvG"}, {"rating": 5.0, "review": "Got this for my extensive travel and options for viewing on the road. Been great and working well!", "verified": true, "helpfulness": "0/0", "author": "Molly Collie"}, {"rating": 3.0, "review": "The stick constantly disconnects from my wireless internet.", "verified": true, "helpfulness": "0/0", "author": "Richard Tebbano"}, {"rating": 4.0, "review": "Great value for the price (got it for $24 during prime day), especially if you're a prime member (view prime movies and video). You can load \"Apps\"/code to expand its functionality (area video from media server, access content from other sources). Great deal!", "verified": true, "helpfulness": "0/0", "author": "Johan Reyes"}, {"rating": 5.0, "review": "I love it. Thinking about getting another one for upstairs TV so I don't have to keep switching from one TV to the other.", "verified": true, "helpfulness": "0/0", "author": "Linda McCloskey"}, {"rating": 5.0, "review": "I love the Amazon Fire TV Stick....great streaming, ease of use, easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Terri Corthell"}, {"rating": 5.0, "review": "I am moderately tech savvy, but hated hooking up my laptop to my television to watch Prime Instant Video. I read all the reviews on the Amazon Fire Stick and took the jump. I am thrilled with it! It is easy to use and to hook up. I can take it to my daughters house to babysit my grandkids. Best $40 you'll ever spend.", "verified": true, "helpfulness": "0/0", "author": "ggglendale"}]