[{"rating": 5.0, "review": "Worked as it should and provides great service.", "verified": true, "helpfulness": "0/0", "author": "GLENDA"}, {"rating": 5.0, "review": "I'm very happy with my device  !!!", "verified": true, "helpfulness": "0/0", "author": "CHARLES SCOTT"}, {"rating": 1.0, "review": "The Fire TV Stick is great in theory. The interface is fairly eye pleasing and I enjoy the option of being able to control it via the provided remote or via the smartphone app. However, that's about the extent of the positives from my experience with it. Despite self-reporting that it's receiving Very Good signal strength from the wireless router it tends to have a slow connection that leads to pixelated streaming and/or pauses to buffer. Keep in mind that I have many other devices I use for streaming (PS3, Xbox 360, Chromecast stick, laptop, smartphone) and it is the only one having an issue. I looked online for a solution but found that mostly it's just a lot of people who ran into the same issues I've had. I'm very disappointed by this product since I love most things Amazon. I am hopeful that it's a software bug that will be fixed in the future by an update but in the meantime I am left with a poor quality device. Another drawback to this point has been the lag in response-time for the interface. Sometimes it won't respond to button presses on the remote and other times it seems to be overly sensitive and it will jump around multiple times for every button press. I would recommend sticking to one of the other streaming device options out there.", "verified": true, "helpfulness": "0/0", "author": "Jenna"}, {"rating": 5.0, "review": "Awesome product. Functions exactly as advertised.", "verified": true, "helpfulness": "0/0", "author": "George E. Crosby"}, {"rating": 5.0, "review": "I bought the Chromecast first because the fire stick was on back order, but it wasn't really what I was looking for because it relies heavily on your mobile device, the fire stick fire stick odds exactly what I was looking for. You can watch shows independent from your mobile device, and it also allows for casting similar to the Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Met my expectations.  Works well and is fast.  Love it.", "verified": true, "helpfulness": "0/0", "author": "NikonLee"}, {"rating": 5.0, "review": "This device brings new life to a 2nd TV that is not internet ready. I have watched a few movies via Amazon using this over my home WiFi and the video quality was great on my 32\" LCD 720P TV. I was especially impressed with the quality of an old B/W John Wayne movie that was adapted to HD format through Amazon's library. The instructions recommend leaving the device attached to the power adapter while its plugged into the TV's HDMI port - a good idea, since some TV's may not be able to supply enough current through the HDMI ports to fully power the device. The remote control, although of an odd size, worked very well.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Works as advertised best buy for the money", "verified": true, "helpfulness": "0/0", "author": "Richard Proctor"}, {"rating": 5.0, "review": "Love this works perfectly and the games are awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Erik Dabach"}, {"rating": 5.0, "review": "This. Is. Awesome.", "verified": true, "helpfulness": "0/0", "author": "josh"}]