[{"rating": 4.0, "review": "This thing works great wish i would of orderd sooner. Iv had 4 streaming devices this is by far the best. It has over heated a couple times i just unplug and cool off and it powers right back up. Hopefully it has some longevity. As for the apps very happy, it gets alot of movies and tv. I got sling right now and thats good. As for free tv not bad and as for pay as you go there is a ton of options.", "verified": true, "helpfulness": "0/0", "author": "MARK BONNENFANT"}, {"rating": 5.0, "review": "This is an update to a previous review (left below).  I purchased a second fire stick as we got another television in the home and as it turns out the problem was with my receiver.  I ended up purchasing a Panlong hdmi switch from Amazon https://www.amazon.com/gp/product/B00LM3R4L2/ref=cm_cr_ryp_prd_ttl_sol_24 which outputs audio over optical which solved all of the problems .  As a result all of the cons from my earlier review have been negated as they were the result of HDCP issues related to my pre/pro.  The pros all still remain and make this an excellent device with a 5 star review.Having had the Fire TV Stick since launch I will list the pros and cons within the realm of my home theater setup as some users may have different experiences.Pros:1.  Easy to setup and use.2.  Familiar interface to users of Amazon ecosystem devices.3.  Excellent picture quality and the ability to output multi-channel audio, when coded to the source.4.  The ability to run select games is great for kids.5.  Excellent Amazon library, Pandora, Netflix, other media availability through one device.Cons:1.  When used with my preamp/processor the audio feed drops wen clicking through menus.  Once audio is playing in a movie or video this problem disappears.2.  A few months in, the Fire Stick now takes a significant amount of time to sync the video and allow it to appear on the display.  This may be the result of a recent update to the Fire Stick as it is something that has just begun.3.  Despite power isolation, there is an audible low frequency hum from the subwoofer when the Fire Stick is actively playing audio.The cons are significant and severely hamper the enjoyment of the device, but the access to the Amazon ecosystem using the great interface weigh heavily in allowing me to give 3 stars.", "verified": true, "helpfulness": "0/1", "author": "TGFather"}, {"rating": 5.0, "review": "Love it!!! I just hate that some of the movies u have to buy but besides that I love it thinking bout buying another one my husband done took over it so I barely get to watch what I want", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great, it's fast and easy to use. The remote makes it so much easier to navigate.", "verified": true, "helpfulness": "0/0", "author": "Novarox71"}, {"rating": 5.0, "review": "Makes streaming so easy!", "verified": true, "helpfulness": "0/0", "author": "Nindy \"Nindy Lou\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "juan"}, {"rating": 3.0, "review": "It works well  Easy set up", "verified": true, "helpfulness": "0/0", "author": "cheryl"}, {"rating": 4.0, "review": "USB on tv was already in use, so had to buy a splitter. Stick works well - remote works well also.", "verified": true, "helpfulness": "0/0", "author": "Richard A Gilbert"}, {"rating": 3.0, "review": "I love the product, and when it's working, it's fantastic. The reason I can't give it 4 or 5 stars is that it freezes far too often. About once a day everything will freeze up and it will either restart itself or I will have to unplug it and plug it back in to get it running again.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 2.0, "review": "I was not impressed that I have to use a power adapter for this.  If that was the case I would have just kept the fireTV.  I was trying to go wireless.  also because the unit is behind my TV, the remote does not work will with this at all.  I press a button once and the unit thinks I am am holding it down.  I am not impressed with this at all, I feel like I wasted my money.  The programming, however, is great.  Its just the hardware that is lackluster.", "verified": true, "helpfulness": "0/0", "author": "Kobayashi Maru"}]