[{"rating": 4.0, "review": "It's neat but my internet is slow sometimes.", "verified": true, "helpfulness": "0/0", "author": "Cavaid"}, {"rating": 3.0, "review": "Does have trouble streaming at times had to reboot 6-7 times. Likes to get a mind of its own when surfing as well.....They could make that a bit better in my opinion. It's not a bad product but they could make improvments.", "verified": true, "helpfulness": "0/0", "author": "Mark V. Motl"}, {"rating": 5.0, "review": "THIS IS A GREAT PRODUCT", "verified": true, "helpfulness": "0/0", "author": "hamlet disla"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "cj"}, {"rating": 5.0, "review": "It was easy to install. Works great!Would buy again.", "verified": true, "helpfulness": "0/0", "author": "Pam"}, {"rating": 5.0, "review": "Never regret this purchase.", "verified": true, "helpfulness": "0/0", "author": "camera enthuast"}, {"rating": 1.0, "review": "It is worthless at this point because it will not work! It will not connect to the internet/TV whatever, it says it cannot connect to Amazon.com. You cannot just plug it into your TV and start using it.  It also appears that you can just plug the it in and it works, they forget to tell you that it has a cord that has to be plugged into an outlet in order for it to work.  For me this is a big inconvience because I have to buy another surge protector because I need the extra plug. I will be contacting the tech support on this, which I'm sure is going to be another inconvience because it will be some long drawn out process that will probably end in me sending this back for a retund, but I will hold out for hope that that is not the case.", "verified": true, "helpfulness": "0/1", "author": "D.A.K"}, {"rating": 5.0, "review": "It took a little getting used to since I am used to the ROKU box, but loved the functionality.  I really liked the fact that it played the next episode instantly without having to select it.  I also liked the fact that I didn't have a box sitting on my TV stand.  I would definitely recommend this to buyers.  I will be replacing my other ROKU boxes with the Fire Stick..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "AMAZON HAS SOME DECENT MOVIES BUT MOST OF THE GOOD STUFF YOU HAVE TO PAY FOR, BUT IF YOU DOWNLOAD THE NETFLIX APP ON IT AND GET A SUBSCRIPTION, IT OPENS UP A WHOLE NEW WORLD", "verified": true, "helpfulness": "0/0", "author": "D-Rod"}, {"rating": 5.0, "review": "I bought this as a gift for my parents and they love it!", "verified": true, "helpfulness": "0/0", "author": "Jimmy Prince"}]