[{"rating": 5.0, "review": "Arrived ahead of schedule, was very easy to install, works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "BSJ"}, {"rating": 5.0, "review": "Daddy and I watch something on it at least one a week or more. Worth every penny 😃", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Amy Clark"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "cheryl corriveau"}, {"rating": 4.0, "review": "Husband is playing games on it. He likes it.", "verified": true, "helpfulness": "0/0", "author": "Golden wolf"}, {"rating": 5.0, "review": "Tremendous!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Dr. Samuel A. Namey \"Dr.S.\""}, {"rating": 5.0, "review": "Works awesome!love watching netflix in bed :)", "verified": true, "helpfulness": "0/0", "author": "Dina"}, {"rating": 1.0, "review": "This was advertised as an easy to travel stick Well I had it shipped to me so that I could use it in my motel room to free up my laptop well you cant do that in any motel room that has a user agreement which 100% of the places I've stayed at so basically a waste of my money and time Called customer service explained that I couldn't use the fire stick cause I couldn't get to the user agreement he has me do all these stupid things and making excuses like my internet isn't strong enough but the whole time my phone and laptop are connected to same internet . An hour later after a lot of please hold he tells me that the fire tv doesn't support user agreement pages.", "verified": true, "helpfulness": "1/1", "author": "Rick"}, {"rating": 5.0, "review": "Easy to install and set up. The picture is super sharp and clear.", "verified": true, "helpfulness": "0/0", "author": "Joey Aguayo"}, {"rating": 5.0, "review": "My children bought me a 40 in tv for my bedroom for Christmas, I ordered the Fire Stick to use there. This is the best investment I've made so far this year (2015). I. Was so impressed with it I ordered a second one for the big screen in the basement.  This little stick out performs my wireless Blu ray player that cost 4 times what I paid for the Fire Stick. I was actually so impressed with its performance that I downloaded the Sling tv app, so between that Netflix and my Amazon Prime instant videos I cut the cord to the very expensive satellite tv. With the available apps such as PBS and Smithsonian channel (which is free tv) and my over air antenna this $40.00 investment is saving me over $1200 a year in tv programming.  I would recommend it to anyone who is looking to \"cut the cord\" to expensive cable and satellite bills. It definitely been worth it to me.", "verified": true, "helpfulness": "0/0", "author": "Blackberry mom"}]