[{"rating": 5.0, "review": "it does everything amazon says it does. Videos stream much faster through here than on my PS3", "verified": true, "helpfulness": "0/0", "author": "KJF1983"}, {"rating": 5.0, "review": "Amazon hit it out of the park here.  I purchased two of these for $19 each for my kids, and it's looking like one of the best Amazon buys ever made.  After reviewing the very simple directions, setup is quick and intuitive.  No problems with setup, navigation, or reception with either one.  I suspect at least some of the problems experienced by others is the result of NOT plugging it into a regular power outlet.  I wish I could control access to specific Amazon Prime content (by rating) from my online account, but perhaps that will eventually come.Update:  I don't understand how/why some people can't make this work.  I've used the two Firesticks on three different TVs from three different manufacturers, including an ancient DLP model.  They've worked great on all of them.  I wished I would have bought a couple more at $19, but they are easily worth $39.", "verified": true, "helpfulness": "0/1", "author": "GBS"}, {"rating": 2.0, "review": "I thought this was a really neat device until I tried to play some music on it using the Prime music service as well as YouTube.  The sound quality (at least for classical music) is so poor and has so many ugly sounds that the device cannot be used for listening to music.  Thanks  a lot Amazon! (for nothing).", "verified": true, "helpfulness": "1/2", "author": "Mitch P"}, {"rating": 5.0, "review": "In my opinion, Amazon did pretty well about this Fire TV Stick. I'm an existing prime member and have recently received this item (my profile was pre-installed in the system). I plugged the TV stick at the HDMI port of the TV (plus following other steps on the supplied document), connected it on the network using the supplied remote (this is very user friendly and easy to navigate - excellent remote) and everything went smoothly. I have added (downloaded) Netflix, PBS, History and Youtube on the program. My Router (Network) is approx. 20 ft away from the TV stick (using the 5 GHz wireless band) and the HD reception on the TV is really good.I am using my android phone as a secondary remote (have downloaded the app from the Google play store). That's neat.My big mistake; I should have bought (pre-ordered) another two when it was being offered at a discount. I have learned my lesson (i.e. my expression; okay, now moving forward).I have chromecast too and if asked which one to buy next for the other TV's, the choice is clearly Amazon's Fire TV Stick. I would highly recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Mitless"}, {"rating": 5.0, "review": "The Fire TV Stick was very easy to set up.  I was pleased to see how many apps are available for the Fire TV Stick, much more than I expected.  It is easy to navigate with the minimalist remote.  I have not tried the Android remote app yet but intend to do so soon.  I wish I had bought more of these as gifts.", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 1.0, "review": "Mine would not allow me to log in. Amazon customer service determined that my unit was defective and gave me a credit with which to purchase another unit. It now shows that a new one wouldn't be available for six weeks. I think I'll pass.", "verified": true, "helpfulness": "0/1", "author": "Henry Rose \"Amanda\""}, {"rating": 5.0, "review": "Love the new Fire TV Stick!  Connected it to our receiver and surround sound system without any issues.  Love using Pandora on the surround.  So glad I bought two.  One will be gifted this season!", "verified": true, "helpfulness": "0/0", "author": "Nichole Lewis"}, {"rating": 4.0, "review": "In the limited time that I have had the Fire TV Stick I have been very pleased with the performance. I bought it because it was on sale and I saw that ESPN3 was available to watch with this device. Any other device I use to watch ESPN3 I have a lot of buffering, the picture going from HD to SD and back to HD and many times when the sporting event goes to commercial the picture freezes requiring a complete reboot of the system to get it working again. Using the same wireless network that I have used in the past I watched a couple different NCAA football games this past weekend and had no problems with the picture.I also have used it to watch content on Netflix, Hulu+ and Amazon Unlimited Instant Videos with no problems. On my PS3 play back of Netflix and Hulu+ was always very good but when watching content on Amazon Videos I would get a lot of buffering.If your looking for a good and inexpensive way to watch online content through your TV I think this is a very good choice.", "verified": true, "helpfulness": "1/1", "author": "HuntleyMC"}, {"rating": 3.0, "review": "I got this already having had a roku 2 and apple tv. I can say it is a mid level performer. It is not as fast as the apple tv but faster than the roku 2. The one thing that made it a must have for me was the Hulu Plus app. The Hulu Plus app on the Roku 2 is hot garbage and almost completely unusable. The app on Fire TV stick was much better, still a bit slow compared with Apple TV, but at least useable. Overall, I would recommend it for people who don't care about HBOGo (which it doesn't have).A few things to note before you get it:1) Fire TV stick told me that the usb port on my TV didn't provide enough power so I had to plug it in using the wall adapter. Which is not a big issue for me since I have power right behind my tv.2) The Fire TV was has lots of issues with WiFi connectivity until I changed its location. On my roku this causes the occasional slowness. On Fire TV, it meant that I could not control it anymore with the remote.3) There is no iOS app right now, so if that sort of thing is important to you, I would hold off.4) As mentioned above, there is no HBOGo. However, I did find most other apps, History Channel, Hulu Plus, Netflix, etc... Also, the apps seemed snappier than the roku 2, but not as good as apple TV. However, this is 60 cheaper than apple TV so the trade off is acceptable.", "verified": true, "helpfulness": "0/0", "author": "Kaveh Noorbakhsh"}, {"rating": 5.0, "review": "Way better than I expected.  We live in a rural area where DSL and Cable internet are not options.  That means slower internet and long buffering times for streamed content.  I have been able to stream Netflix through our 4 year old Sony Blu-ray player with some success, I have also streamed using Android phones with less success and a bit better streaming when I connect my Windows tablet to the TV.  So the $20 pre-purchase price was the only reason I felt it was worth the gamble on buying another internet streaming device.Success.If I knew it would work this well, I would have bought the Fire TV Stick at full price.  For streamed content this device maximizes slower internet connections.  I use a rural broadcast Wi Fi network which does not have the lag times of satellite I used in the past, but it isn't lightning fast, yet the streaming on the Fire Stick is quick and painless.  Netflix works well, as expected, but better still, I can stream Amazon Video.  This is something I have not been able to do well, even on a computer, because of the constant buffering.  On the Fire Stick so far, no buffering. The video quality is better too.  The way my Blu-Ray and Computer makes up for less buffering time is lower video quality.  The Fire TV Stick video isn't always 100% HD, but it is vastly better than the streamed content on other devices on my internet connection.  I Heart Radio streams without buffering pauses over my home Wi-Fi.  Streaming I Heart Radio over a phone using my home Wi-Fi experiences occasional buffering pauses so I typically disable the Wi-Fi on the phone to stream that content over my 4g network.  On the Fire TV Stick though, I can stream I Heart Radio over my home Wi-Fi without the same buffering pauses.I can also play my home network stored music using the available Plex App.  I had previously set up my network to play my music content via the Plex app on the Blu-Ray and tablet, which worked, but there were long waits while my music content buffered on my own network. On the Plex ap available for the Fire TV Stick, I can access my home network stored music content quicker and with more success.In short, it is well worth the price.  Thanks.", "verified": false, "helpfulness": "1/1", "author": "Lost Weekend"}]