[{"rating": 5.0, "review": "Worked perfectly and was easy to install.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Very disappointing.  They say it takes minutes to set up, I'm on 60 minutes and my frustration level is growing.  I gave up on the parental controls part.  It simply gets stuckIt is struggling to maintain connection to Internet, but none of my other device including kindle have issuesPiece of junk that I will be returningGo with Roku. They are they only device out there that works without issues", "verified": true, "helpfulness": "1/1", "author": "Field \"booksforalex\""}, {"rating": 1.0, "review": "This is a piece of junk. I cannot recommend buying it. Once connected, it takes over my Sony Bravia TV and does not allow me to switch HDMI inputs to the BluRay or cable TV. I have to literallly unplug this stick in order to get back control of my TV. While plugged in and running, the Fire TV Stick has no way to control volume and it will not allow my TV/cable remotes to work, so I'm stuck withj one volume, and no way to change or mute it nor make any other TV setting modification. And the final flaw is that the screen resolution is terrible. It looks like old VHS quality. Not even close to 1080p I get with cable and OTA broadcast.", "verified": true, "helpfulness": "0/0", "author": "C. Jack Swinden \"W5JCK\""}, {"rating": 2.0, "review": "You have to clear the cache EVERY time you watch a 30 minute TV show, or it with start buffering. Annoying.", "verified": true, "helpfulness": "0/0", "author": "KH \"lukesmom\""}, {"rating": 2.0, "review": "WIFI keeps dropping out on it.  Everything else in the house can connect fine.  Will be returning for a replacement.", "verified": true, "helpfulness": "0/0", "author": "Bridgit"}, {"rating": 5.0, "review": "The Fire TV Stick was very easy to install.  It guides you through the installation process.  Within minutes I was logged into my other accounts and was even able to fling YouTube from my IOS device simply by pairing my phone and typing in a passcode provided. I have an Apple TV downstairs and the Fire TV Stick loads and navigates faster and I haven't had any buffering pauses while watching a movie.  I am very happy with it so far.", "verified": true, "helpfulness": "0/0", "author": "Randy"}, {"rating": 5.0, "review": "I just love it. Much more than I ever expected. Thanks!!!", "verified": true, "helpfulness": "0/0", "author": "Greg First"}, {"rating": 2.0, "review": "I was excited to have a device to easily run Amazon Prime on my TV; however, I have been very disappointed by the Fire Stick.  I purchased the Fire Stick on special for $19 and would be very upset had I paid full price for the device.This is the third streaming device I have connected to my TV, and it is the only one with connectivity issues.  The Fire Stick loses connection every couple of minutes.  I have two wifi networks in my home, and I have the same issue on both networks.  Meanwhile my other streaming device never drop connection.The other issue I have with the Fire Stick is the menu.  The menu is not as convenient and user friendly as its competitors' menus.  It took awhile to find the videos I own versus the videos on Prime and the videos you have to pay to video.There is much room for improvement and would wait for Amazon to develop their streaming devices a bit more before investing in one.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "If you have Direct Tv its pretty much worthless for any tv apps. I bought it for the Showtime Anytime app and it doesnt work with Direct tv which stinks... works good for prime videos and such.", "verified": true, "helpfulness": "1/1", "author": "rex"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "G Man Satre"}]