[{"rating": 4.0, "review": "The First TV Stick is lite and easy to use. It took no time to set up. The only issues I have with the product are sound and internet connectivity. I the first stick is on and I switch to a different HDMI Port the first stick sometimes loses connectivity and sound gets distorted. It took the stick 3 minutes to connect to my wireless modem which is located 4 feet underneath the stick.", "verified": true, "helpfulness": "0/0", "author": "Joshua Kovach"}, {"rating": 5.0, "review": "Definitely", "verified": true, "helpfulness": "0/1", "author": "dn"}, {"rating": 5.0, "review": "This was an easy set up. I now can get everything on a bedroom TV that did not have a Sony Google box. I wish I had this a long time ago. It is cheaper than the Google box and quicker to set up. Netflix and the Amazon Prime is running smooth. I am not a geek, so if I can set it up, anyone can. I love all the Amazon Prime TV shows! We would never have watched them otherwise.", "verified": true, "helpfulness": "0/0", "author": "savinggrace \"savinggrace\""}, {"rating": 5.0, "review": "Loved the set up process.  So much easier than setting up Chromecast.  Much more user friendly.", "verified": true, "helpfulness": "0/0", "author": "Lucinda Howell"}, {"rating": 5.0, "review": "Extremely easy to set up and use.  Everything worked great.", "verified": true, "helpfulness": "0/0", "author": "M. S. Meyers"}, {"rating": 5.0, "review": "So far, so good.  I bought it strictly for Netflix,  but I'm beginning to branch out to the other apps.  Its simple to use, and if you're a Prime member, then it would be extremely beneficial, as all movies and shows are free.", "verified": true, "helpfulness": "0/0", "author": "JUSTIN C DOZIER"}, {"rating": 3.0, "review": "I don't see where it does any more than suddenlink on demand", "verified": true, "helpfulness": "0/0", "author": "Gloria Phelps"}, {"rating": 4.0, "review": "I like the Fire Stick.  It's inexpensive, works well in hotels (huge plus because I travel) and has as many channels as the other companies in this racket.  What I don't like is it pushes Amazon content hard...meaning movies, shows, etc that you like on other apps (like Netflix or HBO GO) don't readily appear on the home screen.  You have to go into the relevant app to view that content; but anything Amazon related is easy displayed.This is not a showstopper for me, so I only knocked the Fire Stick down 1 star for the hassle.  That said it works as advertised and I'm thrilled to be done with my $200+ Comcast bill.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Larry Everett"}, {"rating": 3.0, "review": "I found the firestick to be a mixed bag.  First off, some misleading marketing.  You look at the picture, and you think that all you do is plug it in.  In fact, \"for best performance\" you need to connect it to a wall power outlet.  That isn't a deal breaker, but if you need to plug it into the wall, then market it as such.  The second issue that I had with it was its size.  It's fat and doesn't play well  with other hdmi outlets.  Since you have to connect to a power outlet anyway, it would be better to design it more like a cable that is flexible and can easily connect to any connection.  Third item is networking connectivity.  It works great when it has a good wireless connection.  When you are at the outer range of your wireless router, I find that Netflix does a much better job of handling the poor connection.  Fourth, its login process gives unhelpful error messages.  I am having connection issues, and it tells me that I have an invalid password.  If the connection is bad, then it should say the connection is bad - it shouldn't route all error situations to a single, misleading error message.On the positive side, once I moved it to a TV with a better connection, it performed flawlessly.  It is much more enjoyable to watch Amazon Instant Video using this device, than trying to hook up my laptop.  My wife and I binge watched a season of the Bachelorette and it was just as good as watching a series on Netflix - better since the device is always on, and you don't have to log into it.  Just turn the TV on, switch to the correct HCMI port, and immediately pick your show on Amazon.", "verified": true, "helpfulness": "0/0", "author": "Tod Frye"}]