[{"rating": 2.0, "review": "Why does it take so long for validating the PIN? Sometimes it takes forever validating the PIN and I have to quit watching a program. I'm on high speed XFINITY @ 50MBPS.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazing.  I wish I could simply leave it at that but there's a minimum character limit.  The fire stick is easy to use and allows me to actually take my Kindle Fire tablet to work.  As an added benefit, besides having a remote and being able to use my Fire to control it, it seems to work better than my Fire for watching TV and is certainly easier.Bravo, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "So far so good! Easy installation and very user friendly. Great value", "verified": true, "helpfulness": "0/0", "author": "Claire Troxel"}, {"rating": 3.0, "review": "Drops wifi reception at times, and only way to connect back is by rebooting it.", "verified": true, "helpfulness": "0/0", "author": "aditya dhanuka"}, {"rating": 5.0, "review": "Great value with such small tiny package. Get it, you won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Brad Lai"}, {"rating": 2.0, "review": "First of all, I ordered this when it was offered for $19.99 to Prime Customers I believe back in October with a guaranteed delivery date of before Dec 23rd.  When I checked out, the delivery date changed to Jan 2015.  Best Buy then had them on special at the first of Dec for $24.99 so I Bought 2.  Amazon's Fire TV Stick arrived around Dec 18th finally, well after Best Buy and everyone else had them available and for only $5 more than that \"SPECIAL PREORDER PRICE FOR PRIME MEMBERS ONLY.\"I am extremely disappointed that it does not have the two most important Channel Apps that I use, HBOGO and SHOWTIME ANYTIME and several others.  I was going to give all 3 as gifts but am selling them on eBay instead because all three ppl that would have been the receivers of them, must have HBOGO and SHOWTIMEANYTIME.  And also the Time Warner Cable channel app as they all live in NYC.So, I and they are sticking with the ROKU 3 streamer, still the best on the market in my and many other friends and families opinions.Very disappointed in Jeff Bezos for releasing this half baked item.  Also, same with the Fire Cell Phone, which I will rate later in the appropriate space.....a disappointment.", "verified": true, "helpfulness": "0/1", "author": "gmpt"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Mtqpham"}, {"rating": 5.0, "review": "I love it.  I have access to lots of music  downside is not all prime music can be downloaded to listen too. I fine it on prime but when I search to add it it's not there.  It plays beautiful wallpaper on the tv.  It has the song lyrics so you can sing along like karaoke. I Attached the app to my kindle and also have voice command.  Couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Wild Irish Rose"}, {"rating": 1.0, "review": "amazon fire stick tv \"upgrade\" took me off my prime free trial and charged me for the non-free trial. Upgrade did not have any confirmation it just charges you. (the free trial and non-free trial have the exact same benefits)", "verified": true, "helpfulness": "1/2", "author": "David"}]