[{"rating": 5.0, "review": "We have a smart TV, however, hotels where we stay charge for movies. Most, if not all, offer free WiFi, so the fire stick is a great work around. I recommend the purchase of one of these devices.", "verified": true, "helpfulness": "0/0", "author": "Philip W. Snyder \"Leftneck\""}, {"rating": 5.0, "review": "I got it on sale at best buy for 25, it is a great device for the size. If you need an easy way of streaming to a tv that has no smart capabilities, Fire Stick is the way to go. And then you get extra content from Amazon so you can rent movies as well. I still don't see why one would spend 99 on the Fire Tv or the stick does it all... If you want the extra gaming capabilities of the Fire Tv, then it's fine. We are still missing the iOS app.", "verified": true, "helpfulness": "0/0", "author": "lric"}, {"rating": 5.0, "review": "easy to use....like the selection it gives, can use it with the music I had on my computer....", "verified": true, "helpfulness": "0/0", "author": "I CAN"}, {"rating": 5.0, "review": "Was gonna go with chromecast but glad I didn't, exceeded my expectations. And with the app to use your phone as an optional remote you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Chris Colon"}, {"rating": 5.0, "review": "Love it this  lil thing is a beast...no buffer & games. Happy i bought this have to get another obe", "verified": true, "helpfulness": "0/0", "author": "J. Grifith \"b-nas\""}, {"rating": 5.0, "review": "really nice addition, now to dump the pay tv movie channels", "verified": true, "helpfulness": "0/0", "author": "J D"}, {"rating": 5.0, "review": "Works great easy setup", "verified": true, "helpfulness": "0/0", "author": "Paul W. Kase"}, {"rating": 5.0, "review": "Totally exceeded my expectations. Super responsive, not what I expected from a stick streamer. I would recommended to anyone and for $39, you can't go wrong.", "verified": true, "helpfulness": "0/1", "author": "Geovanni Mendez"}, {"rating": 5.0, "review": "WOW - sold my ROKU's! this thing is fast and easy - highly recommend. I cannot believe the speed difference. I use Netflix and Prime and this stick is much faster than another type of box I used. Don't think twice, if you use netflix or prime get this! LOVE IT!", "verified": true, "helpfulness": "0/1", "author": "hacker007 \"hacker007\""}, {"rating": 2.0, "review": "I am still holding out hope that software will be improved. As of last night when we installed the stick, we also dealt with the usb power problem, our chromecast was able to work using the usb port on the tv so we had to reconfigure plugs because it kept crashing due to not enough power I would assume. We then tried to watch a show on hulu and it constantly paused, we kept watching that episode on the fire stick but ultimately decided to switch to the roku to watch our next show.  This morning I tried to put on a show for the kids off of the watch list and when I hit play the screen goes black, like it is trying to load but cannot or something.Once all of the bugs get worked out the fire stick will be replacing the roku on our main tv, and we will also keep the chromecast for the cast a tab feature because as far as I can tell the fire stick does not have that. We really like the interface, just hope that the productivity improves!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]