[{"rating": 5.0, "review": "Does Netflix, Hulu and Amazon Prime TV really well. Only drawback is the need for a wall outlet", "verified": true, "helpfulness": "0/0", "author": "Peter fenoff"}, {"rating": 4.0, "review": "I am very happy with my Fire TV Stick, which I got for free as a promotion from Sling TV. The only thing missing is a web option (unless I am missing something). Some tv shows on Hulu Plus aren't able to be viewed, so I'd love to be able to access the web instead of having to plug my laptop into the TV to watch. I have had to unplug my Fire TV Stick a few times because it seemed stuck thinking but it hasn't become a pattern.App wish list (please reply if they already exist and somehow I have missed them): AMC, HBO Go (hopefully once the standalone streaming service is launched!), and antenna tv apps that truly work. I am missing my local news (although I found a great AirPlay app for viewing one local news station from an iPhone). More apps for watching live tv, since Sling is still working on getting more channels added.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "simple to connect and easy to use", "verified": true, "helpfulness": "0/0", "author": "Laura Greeley"}, {"rating": 5.0, "review": "really good.", "verified": true, "helpfulness": "0/0", "author": "Marangeli"}, {"rating": 5.0, "review": "Thank you great item!!", "verified": true, "helpfulness": "0/0", "author": "Alan Azevedo"}, {"rating": 2.0, "review": "Works ok but has issues with streaming content from apps such as Netflix and others.  Even after clearing data and cache and restarting still has issues.  Only time it works well is if it's Amazon provided content, makes you wonder.", "verified": true, "helpfulness": "0/0", "author": "Bill F. Norris"}, {"rating": 5.0, "review": "What a great product - works as advertised and so easy to set up. Just make sure you have the password for your Wi-Fi and you can literally plug-and-play. The preloaded apps are useful, and it has access to many apps that aren't preloaded but good as well - like the Slingbox player, for instance.", "verified": true, "helpfulness": "0/0", "author": "csutley \"csutley\""}, {"rating": 5.0, "review": "I love it! It was worth the money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Does exactly what you need.  Even thinking about getting another netflix account just for this.", "verified": true, "helpfulness": "0/0", "author": "Aaron P. Beach"}, {"rating": 5.0, "review": "LOVE IT!!", "verified": true, "helpfulness": "0/0", "author": "Sarah Miller"}]