[{"rating": 5.0, "review": "Have only used once but am looking forward to having access to Netflix and watching the shows my kids talk about.", "verified": true, "helpfulness": "0/0", "author": "George G."}, {"rating": 5.0, "review": "Great product! Easy to use! I would buy again.", "verified": true, "helpfulness": "0/0", "author": "R. Lindsay \"Reg\""}, {"rating": 5.0, "review": "Great product. Bought this for my parents since their DVD/Netflix player went out.", "verified": true, "helpfulness": "0/0", "author": "Ryan Parker"}, {"rating": 5.0, "review": "The only thing that I would like is for this to stream my information from other electronic devices. That was the only thing I miss about CHROMECAST. Other than that alot more choices to stream vs. your competion. Easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Robert Reynolds"}, {"rating": 5.0, "review": "Kodi works great on it", "verified": true, "helpfulness": "0/0", "author": "James B."}, {"rating": 5.0, "review": "Works great with minimum installation time. Large variety of material to choose from in many categories.", "verified": true, "helpfulness": "0/0", "author": "Russell C"}, {"rating": 4.0, "review": "The Fire TV Stick is awesome overall!! It does everything I wanted and more. My only complaint is the amount of ads and commercials I see while watching a movie, TV show or playing a game. I understand that is what I get for getting access to free movies and games. But sometimes it seems a little much.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Grabek Jr."}, {"rating": 5.0, "review": "Absolutely fantastic!!! Easy peasy setup and navigation. So much better than my ROKU 2....and PORTABLE! It's like traveling with your smart TV...I take it to hotels in my RV.....to my workshop.  If u have wifi Servce  and an HDMI TV you can use this anywhere", "verified": true, "helpfulness": "0/0", "author": "Susan R. Schrank \"garden bug\""}, {"rating": 4.0, "review": "It has been a great trade-off buying into the Fire Stick and cutting the cable cord.  There are plenty of apps to support us in making the trade possible however... obviously Amazon Prime, but Netflix and HBO Go really made a huge difference.Be careful of accidentally buying content you don't intend to buy.  That part is way too easy and really what kept this review from being 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Marcus Ealy"}, {"rating": 5.0, "review": "Works very good. NOW I am hoping to get the fire TV.", "verified": true, "helpfulness": "0/0", "author": "Charles Canode"}]