[{"rating": 5.0, "review": "Very easy to access.", "verified": true, "helpfulness": "1/1", "author": "Shesmit"}, {"rating": 5.0, "review": "Takes getting use to but I am figuring it out.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Loved it,Easy to useworth the money!!!!", "verified": true, "helpfulness": "0/0", "author": "OCTAVIA AKINES"}, {"rating": 3.0, "review": "This inexpensive stick is usable and works fantastic for amazon video but has very few apps but the deal killer is how buggy the Netflix app is. In every video you watch on the netflix app, the video freezes for several seconds but the audio keeps going. Then the video plays really fast to catch up with the audio. I have a roku on the same network and don't have this problem. Also in the Netflix app, after you watch a few videos it tells you that you aren't connected to the Internet but if you go to the home screen and come back it works fine.Most of the apps available for the fire stick are crummy games and the streaming apps are very limited. I guess you get what you pay for.", "verified": true, "helpfulness": "1/1", "author": "oneaustin \"oneaustin\""}, {"rating": 5.0, "review": "My main reason for buying the Amazon Fire TV Stick was to have ability to watch movies from Amazon Prime Video with closed captioning (CC).My primary TV is a high end Sony but since it is a 2012 model, it did not allow CC with Amazon. I also subscribe to some premium cable channels and Netflix which does have CC in this TV. I always watch movies with the CC turned on. I have no hearing impairments but with some movies being released lately, it is very hard to understand the dialogue, sometimes due to loud background music, sound effects or British and Australian accents, etc. I have even seen some movies with a telephone conversation where only one side of the audio was reproduced but the CC showed both sides. I realized I was missing out on watching many movies that were available on Amazon and not on Netflix just because of this inability of CC.I couldn't be more satisfied with the Fire Stick. I find the loading of the video for both Amazon and Netflix is faster. I find the clarity of the picture is better on the Fire Stick than the applications in my TV even though my video settings are the same. The Fire TV application I downloaded to my smartphone is fantastic. A voice search of a movie title will bring it right up on the TV screen and one click on the remote takes you to the video service that has the movie. No need to type in titles!I could go on forever about all the positive points of the Fire Stick but I would only be repeating other reviews. So far I cannot find any negatives. I am totally satisfied with the Fire TV Stick and suspect that some of the negative reviews are only due to another problem, such as, low internet speed, modem or router problems or the users' lack of knowledge in dealing with their problem.", "verified": true, "helpfulness": "0/0", "author": "wdsnls"}, {"rating": 1.0, "review": "Disrepair up. With my tv and after thirty days of frustration it's out of return time", "verified": true, "helpfulness": "0/1", "author": "greg hegeberg"}, {"rating": 5.0, "review": "Great product. Makes it easier to \"cut the cord\" with cable!", "verified": true, "helpfulness": "1/1", "author": "Janelle D Potter"}, {"rating": 4.0, "review": "A+", "verified": true, "helpfulness": "0/0", "author": "Mark G."}, {"rating": 1.0, "review": "Save your money and get something nice, went to an apple tv, this crap sucks ass.", "verified": true, "helpfulness": "0/0", "author": "aaa"}, {"rating": 5.0, "review": "Saving so much money and able to cancel satellite provider. Wide variety of programs.", "verified": true, "helpfulness": "0/0", "author": "Silver L. Tabor"}]