[{"rating": 5.0, "review": "Beats Google Chromecast!", "verified": true, "helpfulness": "0/1", "author": "Megan"}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/1", "author": "Paulo R. R. Silvestre"}, {"rating": 4.0, "review": "need more choises", "verified": true, "helpfulness": "0/0", "author": "patpac"}, {"rating": 1.0, "review": "This was a complete surprise.  My sister has a wireless system so I bought this because all of the pictures showing it showed no wires.  We said ok we can live with one wire hanging down from the TV.  Then we went though the set up and found out that we had to open an account on Amazon and give them her credit card number in order to use the darn thing. We took it back to the store and got the Google Chrome cast even though it too had a wire the hung down. It was easier to set up and did not require her to provide a credit card in order to use it.  It works great with her PC and Android phone; so if you have a chance to buy the Fire Wire and you do not have an account with Amazon check out Google Chrome cast.it is free.", "verified": true, "helpfulness": "0/1", "author": "Joe Cundiff"}, {"rating": 5.0, "review": "I use the fire stick for Netflix and sling. Works perfectly and is very easy to use. I am very happy with this purchase and do recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "Deb"}, {"rating": 5.0, "review": "Awesome just plug and play no hassle what else can I ask for and for that price...", "verified": true, "helpfulness": "0/1", "author": "Ivan"}, {"rating": 5.0, "review": "Very nice , awesome !!!", "verified": true, "helpfulness": "0/1", "author": "Rick"}, {"rating": 5.0, "review": "Use it daily to catch-up on old tv shows and some movies I missed.  The electronics of it is fantastic and the remote is superb!", "verified": true, "helpfulness": "0/0", "author": "VietVet"}, {"rating": 2.0, "review": "doesn't mirror or work with the ipad...", "verified": true, "helpfulness": "0/1", "author": "Dave D."}, {"rating": 5.0, "review": "We are very pleased. Better than the competition, and good tech support.", "verified": true, "helpfulness": "0/0", "author": "Andy H"}]