[{"rating": 5.0, "review": "I think this was the best Christmas gift of all. My family is totally enjoying the stick. Should have ordered two more. We don't get to watch TV much during the regular work/school week, so we are totally binging during this break. Awesome sauce!", "verified": true, "helpfulness": "0/0", "author": "SamRich"}, {"rating": 1.0, "review": "Connection issues.  Fire stick won't connect to my home network (network works just fine with all other devices).  But connected just fine to my parents network.  Working with customer service to resolve issue.  Better rating once issue is resolved.  To update this post, 3 devices later, fire stick still won't connect.  the second one we finally got to connect to the network but wouldn't stream any video.  after several suggestions from tech support, still nothing worked.  the 3rd fire stick went back to the initial issue of not even connecting to the network.", "verified": true, "helpfulness": "1/1", "author": "Team Davis"}, {"rating": 5.0, "review": "I am tech challenged and I had no trouble installing and using the Fire TV Stick. Love it!", "verified": true, "helpfulness": "0/0", "author": "Gma \"expertreader\""}, {"rating": 4.0, "review": "I was surprised that the \"stick\" works as well as it does so cudos to Amazon. I would also mention that a good, strong signal from your router is important. Otherwise you'll have a lot of buffering and you certainly don't want that! There are numerous methods of increasing your Wi-Fi signal to the location of you \"stick\" so if you're signal is weak to that area in your home, you may want to make arrangements for a stronger signal.", "verified": true, "helpfulness": "0/0", "author": "cm"}, {"rating": 5.0, "review": "Happy", "verified": true, "helpfulness": "0/0", "author": "Eduardo"}, {"rating": 3.0, "review": "Have to keep resetting the stick to get it to work, does not always let you fast forward", "verified": true, "helpfulness": "0/0", "author": "Leland O. Karras"}, {"rating": 4.0, "review": "For $20 via Prime pre-order, this is a nice device.  We operate both Apple and Amazon ecosystems, so can compare the two from time to time.  Compared to the $100 Apple TV3 (not really a fair comparison), this Stick, at $20, is a very good high value alternative.  The Stick's interface is not as polished, intuitive or efficient as the ATV, and it does not integrate as well into its Amazon ecosystem as an ATV can with airplay.  And when you consider the outboard dongle and USB power supply, it is no more convenient to physically set up than the puck sized ATV (which hangs on the back of the set).  It also runs much hotter than the ATV.Where the Stick really falls down is in Wi-fi reception quality, which is genuinely hit-or-miss.  We have a high end wireless router with uprated signal power, and were able to eventually focus the Stick to pull a consistent HD quality signal from 35-50 feet.  But the many reception complaints are well founded, even with the most current firmware as of this review date.  The little Stick just does not pull in wireless as well as most pads or phones can.But once locked into a good signal, the Stick seems to operate very quickly and smoothly for the most part.  Picture rendering quality is excellent.  The Fire app works well, even on an iPad, but the voice feature is choppy until it learns your voice.  That Amazon ships the device preconfigured to your account is also a nice plus.  We don't play games, but it comes well equipped with them and has a nice assortment of other apps.  The Netflix app is not anywhere near as polished as that on the ATV, unfortunately.So at $20, this is a really good buy, provided you have a strong and dependable wireless signal.  I absolutely do not recommend this device for marginal or uncertain signal conditions.  At the standard $40 price, the now long in the tooth ATV is still a better value in our opinion, as it does more and more importantly does it better (and it should for 5x the cost).  Had we not received the pre-order price, we would have more strongly considered the full size Fire TV model which might invite a better comparison.  Perhaps the cross-platform comparison is not fair, but having both, we can at least share an honest opinion.Obviously, these Fire streamers are only worth their prices with a Prime membership, and offer no local streaming ability for those with large server or NAS libraries (which the ATV does quite well via iTunes).", "verified": true, "helpfulness": "0/0", "author": "M. Malone"}, {"rating": 5.0, "review": "It's so easy. Perfect for my son's room.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 3.0, "review": "I've been playing with the fire stick for a couple of days. Yes it is smooth and offers lots of content, and the remote is handy.The set up is very easy as it comes configured for your Amazon account. Watching Amazon videos is fast and seemless. Music not so much. There are a few things that keep it from being great.1. There are many places where it is hard to navigate accurately with the remote or the phone/tablet app.2. It does not come installed with a browser or YouTube.3. Amazon Music is not well integrated. You have to add music to your library on your computer, can't do it directly on the TV stick. This would be ok, but it takes ~ 5 minutes to sync, so no adding music or creating play lists on the fly. Nor can you stream from your computer music app.directly to the TV stick (as you can with YouTube, well once you install it).4. The phone/tablet remote is ok, but does not display any information from the TV stick, so you can't, say, navigate a playlist from the kitchen where you can't see the TV directly.Fortunately you can sideload non Amazon apps using ADB: http://forum.xda-developers.com/showthread.php?t=2786505", "verified": true, "helpfulness": "0/0", "author": "Eric A. Cutter \"Eric\""}, {"rating": 5.0, "review": "Works great easy to install great picture recommend highly. Good value with Amazon prime", "verified": true, "helpfulness": "0/0", "author": "John Randall"}]