[{"rating": 4.0, "review": "Pretty good. Waiting to see how it improves.", "verified": true, "helpfulness": "0/0", "author": "Judd Rogers"}, {"rating": 4.0, "review": "I love the device. I had a bug with mine initially and had to do a factory re set after going through everything with technical support, but it seems to work good now.  I noticed the mirror function has a small delay from the phone to the TV, but that could also be my internet. Besides this, the stick seems to work just fine!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey S Spatz"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Jimmy Barbosa"}, {"rating": 5.0, "review": "I can't imagine why I waited so long to buy the Fire TV Stick. I absolutely love it. It is easy to install and use. I am enjoying the movies and especially the documentary series. My grandkids love the kids and family selections. My granddaughter who just turned three uses the remote to choose her favorite Kipper and Barney programs. I can't stop recommending it to family and friends. This is an amazing device.", "verified": true, "helpfulness": "0/0", "author": "Cheryl A. Parker"}, {"rating": 5.0, "review": "The first TV stick is excellent, easy to use, and I'm very satisfied and would recommend the fire tv stick.", "verified": true, "helpfulness": "0/0", "author": "Christy Zavaleta"}, {"rating": 3.0, "review": "1. the Sling TV kept catching up or going back to Home all the time. 2. Sling TV didn't allow to go back to previous channel or stay input.  it kept going back to ESPN and quite annoy.  3. there's no power button to turn off Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "KV"}, {"rating": 5.0, "review": "So far the fire tv stick has exceeded my expectations. I would highly recommend it if you are an occasional user of Netflix, Hulu, Amazon Prime, or Sling TV. Especially for the price offered.", "verified": true, "helpfulness": "0/0", "author": "xez"}, {"rating": 2.0, "review": "The UI is clunky and busy. There is no way to pin you favorite apps. It's lost connectivity to my home router 3 times. The only way to recover is to power cycle the stick. Never had these connectivity issues with my chromecast.", "verified": true, "helpfulness": "0/0", "author": "T. Vu"}, {"rating": 5.0, "review": "So much better than my Samsung smart tv. That was the worst purchase ever, thankfully the fire stick bipasses all of that and makes my tv smart again!", "verified": true, "helpfulness": "0/0", "author": "DeeDee"}, {"rating": 4.0, "review": "Great piece of equipment  Set was easy  Does exactly  what is supposed  to do without problems", "verified": true, "helpfulness": "0/0", "author": "dawg74"}]