[{"rating": 3.0, "review": "It's really only great if it's all you have to do what it does, and you like spending money on individual shows a lot.Positives:+ It's inexpensive+ It works largely as advertised (exceptions below)+ The controller is simple+ It's tiny, easily hidden and neat+ Lots of shows, movies and songs available if you're fabulously wealthyNegatives:- The controller and interface are simple to the point of madness- Finding and adding shows/etc. that aren't being pushed to you is teeth-grindingly fiddly- Music searches are even worse- Prime movies/etc. are largely drek- The service starts feeling expensive if you don't love drek ($90+ a year and rentals on top)- If you already have a media PC, a gaming console, or a smart TV, you have this thing beat by furlongs", "verified": true, "helpfulness": "0/1", "author": "diskinetic \"Geek translator!\""}, {"rating": 5.0, "review": "The stick works really well and because it is so small, it takes up no space by my TV. The remote is intuitive and the app selection is really good. Now it only needs HBO Go support and it ill be the perfect device. For $40, you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Brent Metcalfe"}, {"rating": 4.0, "review": "I purchased the stick with it's introductory price of $20 and I really like it for the price I paid. I was especially thrilled when I got way before the original estimated delivery date. I used to only have the Apple TV and while that works extremely well with my other Apple products but I have to mirror my iPad when I want to watch any content from the Amazon Prime account and it can get pretty annoying. Aside from the Amazon apps, most of the apps are the same in the Apple TV and the Fire TV stick but I was drawn to this because it is a great way to get more out of my Amazon Prime membership.The only thing I do not like is the home screen. With the Apple TV all my apps are displayed on the home screen. So if I want to switch from Netflix to Hulu or iTunes I just have to go to home and from there I can scroll up or down, left or right until I get to the desired app. On the Fire Stick, it's a little more work than that. What can I say? I'm a lazy person. Other than that the Fire Stick is perfect.Wish they would offer them at that price again. It would be a really good and inexpensive Christmas present!", "verified": true, "helpfulness": "0/0", "author": "ladydi37"}, {"rating": 3.0, "review": "It streams our Netflix more effectively.  I was really hoping for it to help with Hulu.  We can't maximize our internet streaming anymore and I was hopeful this would help.  It didn't.  I need to have more time with it to know its further use.", "verified": true, "helpfulness": "0/0", "author": "BG \"Beth\""}, {"rating": 5.0, "review": "Love my Fire TV Stick! I just got it the other day, much earlier than expected too. I couldn't wait to get it set up and try it out. It works PERFECTLY!!!! I am an Amazon Prime member so all the extra movies are awesome. It's very easy to search a movie by name. Saving shows or movies to your watch list is easy too. And the fact that it doesn't take up any space, it just plugs into the back of my TV. Now I just need to find a remote that will work Dish Network, the volume for my sound bar, and be able to toggle between HDMI settings without using five remotes! If anyone has a suggestion, please let me know. I need to consolidate!! But get the Amazon Fire TV Stick...It is Amazing!!", "verified": true, "helpfulness": "0/0", "author": "~AW"}, {"rating": 5.0, "review": "Good product. Works better than chromecast for sure. As the ios app comes up, i will be using it more frequently for sure. It is great with prime membership.", "verified": true, "helpfulness": "0/0", "author": "Okan \"Okan\""}, {"rating": 1.0, "review": "Lovely idea, now if it just worked! Have been getting the blue screen of death every few minutes when we attempt to stream any videos.  It has audio but no picture. We will be returning it.Also we have the fire box and love it but the sick is just a waste of monies until it is fixed.", "verified": true, "helpfulness": "1/3", "author": "Scarlett R."}, {"rating": 1.0, "review": "Worst streaming product that I have bought to date. Shows a lot of promise but the remote that they provided does not work - it just keeps pushing me to the home screen and none of the other buttons are functional - and when I try and use the remote app it often times fails to find my Fire Stick. Very disappointed and contemplating sending it back. I expected more from Amazon", "verified": true, "helpfulness": "2/3", "author": "BBallCardShark"}, {"rating": 5.0, "review": "Love love love!! It was so simple to set up, streaming is very fast. I've never had any issues with streaming quality or freezing during an episode or movie. I got it for the Amazon prime promo price but would easily have paid $39 for it! It's wonderful!!! Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Holly Brisson"}, {"rating": 5.0, "review": "Excellent portable streaming stick and having the remote included is great, I love Chromecast but I'm not a fan of using my phone to control that device.", "verified": true, "helpfulness": "0/0", "author": "V.G."}]