[{"rating": 5.0, "review": "I have (2), very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Pamela Olsen"}, {"rating": 5.0, "review": "Everybody Needs one of these! Tons of shows and movies and even sweeter if your a prime member!", "verified": true, "helpfulness": "0/0", "author": "D.G.P"}, {"rating": 4.0, "review": "nifty gadget.  we are enjoying it", "verified": true, "helpfulness": "0/0", "author": "Linda Lanting"}, {"rating": 5.0, "review": "I'm very busy and watched more recored tv than anything; and it cost me a lot of money. Fire TV is excellently priced and has more apps than you'll know what to do with. Fire TV turned my smart TV into a Genius! Just get it!", "verified": true, "helpfulness": "0/0", "author": "Fire Fan"}, {"rating": 5.0, "review": "oh my gosh so fricken cool!!  and SUPER easy to install!!  I thank my dad for buying this and sending to me as a gift - I never would have purchased myself, but now I see what it does (makes non-cable tv's like they have SUPER cable!) I'm telling all my friends about it!", "verified": true, "helpfulness": "0/0", "author": "beth1307"}, {"rating": 4.0, "review": "Easy to set up and use.  No real problems with it.  Occasional waiting on it to stream to the TV but that has only been a handful of times at most.  I live in a rural area and I have a solid internet connection.  I would recommend it to others to use.", "verified": true, "helpfulness": "0/0", "author": "Timothy C Cassidy"}, {"rating": 3.0, "review": "Meh. You need an Amazon Prime membership for this. All the other stuff you would also need to be a subscriber to use as well. My main issue is with the remote. Pressing left or right either way doesn't do anything at all, or, flies 30 \"clicks\" in either direction. Pain in the butt when you're trying to zero in on something I want to watch. Great for $19 (launch promotion).", "verified": true, "helpfulness": "0/0", "author": "Massimo"}, {"rating": 5.0, "review": "I love it. It was so easy to install, less than 5 minutes. It is amazing how much Amazon has in its library. I wish I had purchased this sooner. The remote is tiny and for someone with a larger hand, it could be a problem. But the on screen graphics are good, but the intro video is pretty lame and could be updated. Otherwise, for $39.00 dollars, very well worth it.", "verified": true, "helpfulness": "0/0", "author": "Susan Crawford"}, {"rating": 5.0, "review": "Awesome Gift", "verified": true, "helpfulness": "0/0", "author": "cathy scherer"}, {"rating": 2.0, "review": "When it worked I really enjoyed it. The UI is nice and easy to use and navigate.With the first one I had, about every 6 hours it would lose connection to the internet and the only fix was to unplug and plug back in the power. I had that one replaced and after a huge mess of confusion in trying to get a replacement since it was out of stock, I finally received that replacement 3 months later. This second one is even worse. It loses connection to the internet about every 15-20 minutes. I give up.For anyone who is interested, this is my setup:Connected to TV using the HDMI extension cable. Using a Linksys Wireless-N Home Router (WRT120N) with the basic quick setup. The TV and router are about 20 ft. apart with one wall in between (wii and xbox have no internet problems)", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]