[{"rating": 5.0, "review": "I love this thing I use it to watch all my prime , super fast at loading and smooth playback , nice job Amazon", "verified": true, "helpfulness": "0/0", "author": "ts"}, {"rating": 4.0, "review": "So far I really like it.  It streams much better than a Bluray player I bought that is always buffering.  I did have some problems at first getting a connection.  I was trying everything (rebooting my Uverse system,etc) and was afraid I would need to return it, then I changed which HDMI port I had it in and it works perfectly now.", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 1.0, "review": "I was gifted a Fire TV stick for my birthday. I've been unable to use it so far because to open the remote - the 4.7 inch version - requires such an impossibly thin pry tool that I can't get the batteries into it.", "verified": false, "helpfulness": "0/3", "author": "Paul Gadzikowski"}, {"rating": 2.0, "review": "Very disappointed in the fire stick its slow to react and keeps reloading while watching a movie, my other media does not do that.I thought I would get a better experience from the fire stick", "verified": true, "helpfulness": "1/1", "author": "kelley47"}, {"rating": 5.0, "review": "First, I want to say I love everything about Amazon. I'm a Prime member and I recommend all my friends to Amazon. However, I'm not happy with my purchase of The Fire Stick one month ago. After plugging it in, it worked fine. The trouble started 2 days ago. The service crashed. I've unplugged and restarted several times, but to no avail. I've unplugged the Roku from the TV and the Fire just won't connect to the Internet. I'm very frustrated with the Fire TV. I do not want to return to using Roku.I'm going to continue to research and troubleshoot and I hope I can resolve the issue very soon. At least I was able to finish Marco Polo which was Franklin fantastic. If anyone has any advice and resolution for the technical,problem I'm having Please Please paleezzzz share with me what you did to get back to the land of happy. I want to be able to enthusiastically recommend the Fire TV stick to my friends.", "verified": true, "helpfulness": "0/0", "author": "Shad in DC \"SAS\""}, {"rating": 5.0, "review": "Love my Fire TV but when I saw the stick for a fraction of the price of the Fire TV, I had to give it a shot for my other TV. The result is: I see no difference. I'm not a gamer and that's where the difference justifies the upgrade.The Fire Stick is cheap enough that I was actually able to get a few for my team as a gift!", "verified": true, "helpfulness": "0/0", "author": "fdelacou"}, {"rating": 5.0, "review": "perpect..", "verified": true, "helpfulness": "1/2", "author": "YUN YOUNG SIK"}, {"rating": 5.0, "review": "Awesome device. All new technology takes time to understand and explore. My adventure to discover all the Fire Stick possibilities and advantages has just begun. ;-)", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 3.0, "review": "locks up alot the remote works when it wants too", "verified": true, "helpfulness": "0/0", "author": "Ashley Richardson"}, {"rating": 1.0, "review": "I too am having issues with the freezing watching Hulu or Netflix. I am an Amazon junkie but this is a lackluster device.", "verified": true, "helpfulness": "0/1", "author": "Gregory J."}]