[{"rating": 4.0, "review": "This is an awesome unit. Works great so long as your WiFi is stable. Totally my new go to gift", "verified": true, "helpfulness": "0/0", "author": "ludgardo"}, {"rating": 5.0, "review": "very fast and easy to work", "verified": true, "helpfulness": "0/0", "author": "sue rupe"}, {"rating": 5.0, "review": "I LOVE IT!!!  Very easy to install.  As a Prime member, I have quite a selection to choose from.  My kid loves the games as well.  I cannot see myself ever going back to cable.", "verified": true, "helpfulness": "0/0", "author": "Maggie E"}, {"rating": 3.0, "review": "Not like it much", "verified": false, "helpfulness": "0/0", "author": "Katya Orellana"}, {"rating": 5.0, "review": "I already had ordered the HD FIRE box for my living room but I ordered the FIRE Stick for the TV in my bedroom & it's wonderful. Very pleased & got me a pretty good watch list on AMAZON Prime. Quite a few series I've gotten into also. Would reccomend to anyone that has a WIFI modem.", "verified": true, "helpfulness": "0/0", "author": "Hall.Terry82"}, {"rating": 4.0, "review": "Everything very good except I wish I didn't have to activate ShowtimeAnytime and HboGo through their websites. Also would be nice to have the ATT UVerse App. Otherwise all good", "verified": true, "helpfulness": "0/0", "author": "Benjamin Aronov"}, {"rating": 5.0, "review": "So far so good. Much better than anticipated.", "verified": true, "helpfulness": "0/0", "author": "Stephen Van Vechten"}, {"rating": 1.0, "review": "The fire stick would never connect to any of the apps.", "verified": true, "helpfulness": "0/0", "author": "Zachary N. Schuyler \"Movie Maker\""}, {"rating": 5.0, "review": "better than I thought it woulored be - very easy to use - only draw back is I sit in front of the TV more", "verified": true, "helpfulness": "0/0", "author": "Judy Mohan"}, {"rating": 5.0, "review": "This is my absolute fave streaming device right now!  It is small, portable, and it has wide selection of apps.  The friendly UI makes navigation a cinch, and remote is very responsive unlike others I've tried.  I highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Tonya"}]