[{"rating": 5.0, "review": "I think this thing is great. We got a new TV and don't use cable. It only took me a few minutes to set it up and we were streaming Netflix within 5 minutes. I really like it. The start up video was very basic and would be helpful to someone who isn't very tech savvy and I didn't mind it since it gave a good overview.UPDATE: I cannot for the life of me figure out how to get this to Sync up with my Amazon Prime Music content. I've gone to setting and told it to Sync and it acts like it does but then the new albums I bought that are available in my online library are not there to listen to. I've restarted the thing and tried again but nothing works... Kinda disappointed...UPDATE AGAIN: Amazon customer service got this correct lickity-split! Yay!", "verified": true, "helpfulness": "0/0", "author": "Kelsie"}, {"rating": 5.0, "review": "Shipped fast, setup was easy and quick, so far it's working great!", "verified": true, "helpfulness": "0/0", "author": "Jason Ward"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Cara Averbeck"}, {"rating": 5.0, "review": "Having used gaming consoles for years to stream video and more recently a Google Chromecast, I must say this is the best way to do so for a great price! It is surprisingly quick for the price, often beating my Xbox One and PS4 when loading Netflix, YouTube, and Twitch. The remote is lovely and makes navigation a great experience! If you are considering a Chromecast, spend the extra money for this for sure! The included remote alone blows away the Chromecast, which annoyingly requires you to use your phone/tablet. I can't recommend this enough. Get it now.", "verified": true, "helpfulness": "0/0", "author": "Xzarron"}, {"rating": 5.0, "review": "I still haven't seen or experienced all the Stick has to offer!  Incredible tool for my new Samsung Smart TV.  With the internet access on the TV now, it's incredible to have the ability to find anything and everything that's able to view.  Amazon couldn't have provided a better product than this for TODAY!  I highly recommend this to all!  Especially those with a SmartTV.  ENJOY!!!!", "verified": true, "helpfulness": "0/0", "author": "MmmDawgy \"MmmDawgy\""}, {"rating": 5.0, "review": "The next generation of \"television\" is here.Great product, super-easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel Levin"}, {"rating": 5.0, "review": "Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Jason Makar"}, {"rating": 4.0, "review": "It is a Gadget I like very much, very easy to manage and to install. I found two problems right now. The first, I don't know why  I can't download the remote app and the second is that watching  NETFLIX sometimes I have a delay in the sound.", "verified": true, "helpfulness": "0/0", "author": "Diego Slucki"}, {"rating": 3.0, "review": "Most all of all I like it and how I can leave it plugged into the tv all the time.  One thing that bugs me the most is how it freezes at times when you are watching something.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love this thing, cancelled all my cable and just use this.", "verified": true, "helpfulness": "0/0", "author": "Leilani Cortez"}]