[{"rating": 3.0, "review": "Love the Fire TV Stick, but the only think that keeps this from being a 5-Star product for me is that there are no news channels.Bought this in hopes that we can watch everything that is currently on this TV Stick, but also wanted to be able to view CNN or Fox News that this stick does NOT offer.Otherwise, it's great without having to purchase a smart TV or an Apple TV box.", "verified": true, "helpfulness": "0/1", "author": "Rik L. Hix"}, {"rating": 3.0, "review": "I purchased this mainly because I got it on special and wanted to try it out. My hope was that I could use it to replace the PC in my basement entertainment system that kept losing it's wired ethernet connection. When I first opened it I thought it was fine, and disconnected my Chromecast to set it up on my livingroom TV. The setup went fine and updates installed. After using it for a couple of hours it dropped my WiFi connection and would not reconnect. I did a factory reset which didn't fix the issue, so I disconnected it in favor of my Chromecast.A couple of weeks later I brought it into the basement and tried again. When I turned to the input for it, I was greeted by the boot animation, the screen went dark, and I was greeted with the boot animation again, and then again, and again. I thought maybe it was doing updates, so I turned over to the game and forgot about it. Three hours later it was still looping. I tried it again upstairs, and it did the same thing. Overall it lasted for about two hours of use. Today I processed a return, and used the credit to get a decent WiFi dongle for my PC in the basement.Final thoughts:If you have a \"dumb\" TV and want to make it Smart, this is the best stand-alone solution for under $50. If you have the means and the know-how, go and piece together a cheap used PC (I can consistently take a working free used PC and turn it into a home theater PC for under $100, I've done this 3 or 4 times for myself and to give as gifts) and you will have a device that can do more than any stick or set-top box.", "verified": true, "helpfulness": "0/0", "author": "thunder2132"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Daniel A. Falkenheim \"Btown Superman\""}, {"rating": 4.0, "review": "Good product great resolution, but wish I had more control over it to install product like from the play store", "verified": true, "helpfulness": "0/0", "author": "Miguel Carbajal"}, {"rating": 5.0, "review": "Purchased 5 of these as gifts after seeing how awesome they worked. They can even run plex for your personal media. Side loading XBMC works too but speed is not as good as the fire TV it's closer to that of an Rpi.", "verified": true, "helpfulness": "0/0", "author": "Anthony Virtuoso"}, {"rating": 5.0, "review": "I give this product 5 stars. I love it!! It's easy to use and I can now share my Prime movies with my husband on the big screen. I would recommend the Amazon Fire TV stick to everyone. Buy it. You won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Martin"}, {"rating": 4.0, "review": "It's not an Apple TV but the price is right.", "verified": true, "helpfulness": "0/0", "author": "TravelerMSY"}, {"rating": 5.0, "review": "Works great for the price. Very nice alternative to the box if you have good WiFi and don't need all the games.", "verified": true, "helpfulness": "0/0", "author": "N. ward"}, {"rating": 4.0, "review": "Can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Steven Holder \"olerunner\""}, {"rating": 1.0, "review": "Won't maintain a connection. 4feet from the router, laptops, iPads, phones work fine, this thing says \"connection problems\".I found this Amazon forum discussing the problem, so it's wide spread and well known, but doesnt appear to have a solution.http://smile.amazon.com/forum/kindle/ref=cm_cd_pg_next?_encoding=UTF8&cdForum;=Fx1D7SY3BVSESG&cdPage;=11&cdThread;=Tx2CDOG0K31UBSB", "verified": true, "helpfulness": "4/4", "author": "J. Rogers"}]