[{"rating": 5.0, "review": "Love this.  Just perfect for our TV that we needed to be able to watch Netflix and Amazon Prime on.  VERY user friendly.  I especially love the phone app for the android that allows you to speak to find shows.", "verified": true, "helpfulness": "0/0", "author": "Pam"}, {"rating": 5.0, "review": "Excellent investment for an older Flat Screen TV.  Get all of the \"Smart TV\" functions for $40.00 plus internet connectivity.", "verified": true, "helpfulness": "0/0", "author": "Robert D Hendrix"}, {"rating": 5.0, "review": "Quick setup easy to use.  Great device for streaming.", "verified": true, "helpfulness": "0/0", "author": "L. Hawks"}, {"rating": 4.0, "review": "Works well, remote is nice.", "verified": true, "helpfulness": "0/0", "author": "Jd"}, {"rating": 5.0, "review": "so niceyou love amazon?buy it", "verified": true, "helpfulness": "0/0", "author": "Sung joo Kim"}, {"rating": 2.0, "review": "It works just ok had the Roku before and it had a little more channels that I liked. Think I should have kept the Roku. Only good news I heard was that HBO go was coming to the fire stick this spring.", "verified": true, "helpfulness": "0/0", "author": "Curtis Sanders"}, {"rating": 5.0, "review": "EXCELLENT!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Tony Veksler"}, {"rating": 3.0, "review": "We have the fire tv and stick. I bought the stick so we could take it with us on trips. I find it frustrating because i can't watch a whole netflix movie without the wifi getting messed up. unlike the fire tv box.", "verified": true, "helpfulness": "1/1", "author": "Shiikit \"tshiiki\""}, {"rating": 5.0, "review": "Love it, verysimple to hook up and its s o compact...", "verified": true, "helpfulness": "0/0", "author": "MARC REGAN"}, {"rating": 5.0, "review": "I absolutely love it since I am a Amazon Prime Member.I think the price of some movie rentals is expensive, and we will utilize netflix also.I think more series movies should be available as a prime member, but it is still cheaper than DISH or Direct TV.  No commercials!", "verified": true, "helpfulness": "0/0", "author": "BHRN"}]