[{"rating": 5.0, "review": "Best Bang for the buck. Way better that the chrome cast that you have to mirror off your device with. Easy set up-easy to use. I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Wendy MzTopFlyte"}, {"rating": 4.0, "review": "We bought the Fire stick for a secondary TV set up.  We already have the Amazon Fire and it works great!The Fire Stick often works as well but every now and then it quits and starts searching for a WIFI signal again. This requires us to wait or back up and start the movie over again.I am not sure why? We don't have the same issue with The Amazon Fire. We have a strong WIFI signal throughout the house. Other than that issue which has occurred a few times it works as well as the Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "Donna Darling"}, {"rating": 5.0, "review": "Awesome!!!! So easy to use !!", "verified": true, "helpfulness": "0/0", "author": "Guadalupe Hasbun"}, {"rating": 5.0, "review": "Best little stick you will every buy. No box to look at. Take up no space.", "verified": true, "helpfulness": "0/0", "author": "Steve H Tran"}, {"rating": 5.0, "review": "Fire Stick viewing is distraction free.There are no obnoxious promotions for other programs flashing and blinking at you as they take up as much a a third of the screen.  And there are no network logos permanently taking up space in a corner.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "rangemaster"}, {"rating": 5.0, "review": "Love this device.  Another cool function is that it can also be controlled from your smart phone.", "verified": true, "helpfulness": "0/0", "author": "jcross"}, {"rating": 4.0, "review": "I found the fire stick easy to use. It works great, the only draw back is there is no surround sound.  If anyone knows of a way to make the surround sound work please let me know.", "verified": true, "helpfulness": "0/0", "author": "Dan Cowart"}, {"rating": 5.0, "review": "Great investment. It practically sets itself up. I'm Catching upon the older hbo programs now. I have been recommending it to friends. It's ease of use is awesome. I have nothing negative about Amazon stick.", "verified": true, "helpfulness": "0/0", "author": "will"}, {"rating": 4.0, "review": "I have been very pleased with the performance of this product and I would recommend it to my friends.", "verified": true, "helpfulness": "0/0", "author": "Mike Henry"}]