[{"rating": 5.0, "review": "Super easy plug it in and start watching. I have prime service and everything was already pre programmed for me.", "verified": true, "helpfulness": "0/0", "author": "scott  williams"}, {"rating": 5.0, "review": "This is the best product I have ever purchased.  It does everything as advertised and much more.  It is wonderful with my Prime account and I feel like I have really got my money's worth.  Downside is there are not enough hours in the day to enjoy all of this entertainment one gets with this item.", "verified": true, "helpfulness": "0/0", "author": "Harold J Frazier"}, {"rating": 5.0, "review": "LOVE this! Definitely worth the money!", "verified": true, "helpfulness": "0/0", "author": "Amazingrace152"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "DRM"}, {"rating": 4.0, "review": "It met my expectations.", "verified": true, "helpfulness": "0/0", "author": "Lynn M Braun"}, {"rating": 4.0, "review": "Works great! 4 stars because Amazon content is not available in Costa Rica, otherwise it would be 5!", "verified": true, "helpfulness": "2/2", "author": "Jose Barrenechea \"Jbarrene\""}, {"rating": 5.0, "review": "In love with my fire stick", "verified": true, "helpfulness": "0/0", "author": "redmama0321"}, {"rating": 4.0, "review": "I love it, other than the reception for wifi is a little short.  I have to have it plugged into the TV that also has our modem attached in order to get a decent signal.  We tried it in a room 30 feet from the modem and couldn't get anything to play.  Other than that it works nicely.", "verified": true, "helpfulness": "0/0", "author": "jab"}, {"rating": 5.0, "review": "Awesome!  Easy to use.  Great value.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Friend in PA"}, {"rating": 5.0, "review": "Bought this to use with an older HDTV. Set up was very simple, I was suprised how fast it responded and the remote works great also. The photo feature and the ability to listen to your music library is great. Looking forward to when it works with iOS. For the price I think this is a great device, especially if you don't have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Michael Fantigrassi"}]