[{"rating": 5.0, "review": "Great little device that exceeded my expectations.I had the chrome cast and this device is way better", "verified": true, "helpfulness": "0/0", "author": "Jason Worley"}, {"rating": 5.0, "review": "Totally love the Fire Stick. My free month membership has been grea . I will be getting the yearly subscription", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far, superb!!  I had been watching my Prime videos on an iPad, then on a Mac, but being able to watch shows on the big screen TV is great.  Works flawlessly with Amazon content, I believe the audio coming out is also far superior to Directv; video quality is at least as good.  I tried the Google dongle using Chrome but the video quality was standard definition at best.  I think for Amazon content, Fire is the best bang for the buck.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Gorena \"schizaphis\""}, {"rating": 5.0, "review": "Works great and is so easy to use. I definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Cristine M Burns"}, {"rating": 5.0, "review": "Great product, worked right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Jerry Williamson \"pros12\""}, {"rating": 5.0, "review": "Take too long for delivery dued to serve weathering. Easy to set up, five to ten minutes at the most. Fast streaming. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "alex"}, {"rating": 4.0, "review": "Nifty little device.  I can say that my family has used the Fire TV stick alot since we got it a few weeks ago.  Everything has exceeded my expectations say for one are with this device.  It is responsive and as a frequest Amazon user, I found the interface very familiar and easy to use.  If you are an Android user, using and navigating through the Fire TV Stick should be second nature.  My only detraction from the awesomeness of the TV stick would be WiFi related.  I have a pretty fast internet connection, but I also have multiple household users using the singular connection. So between multiple tablets, smart phones and laptops, my connection can sometime get bogged down.  When it does however, the TV stick only seems to give one error message and forces you to either power down/up the stick (by unplugging the power source) or going under the TV Stick settings and making the Stick forget your network and reprogram it.  Though it doesnt take long to go either route, it can be very inconvenient.", "verified": true, "helpfulness": "0/0", "author": "Disappointed One"}, {"rating": 5.0, "review": "Love this product!! It makes life so much easier by just using one control when watching Netflix, Amazon Prime etc....Super easy to install and works brilliantly!!  I would highly recommend the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Linda M. Mello"}, {"rating": 5.0, "review": "Another option when there isn't much on the tv to watch", "verified": true, "helpfulness": "0/0", "author": "par4u"}, {"rating": 3.0, "review": "Very pleased with it but found I absolutely had to plug it in for it to work. Instructions said I \"might\" have to", "verified": true, "helpfulness": "0/0", "author": "Wayne E. Wylie"}]