[{"rating": 5.0, "review": "I purchase one, then another for both my parents and my father-in-law.  They love it because it is easy to use and they get access to a lot of programs commercial free.", "verified": true, "helpfulness": "0/0", "author": "E Kinion"}, {"rating": 5.0, "review": "It's awesome. I love it. 😍", "verified": true, "helpfulness": "0/0", "author": "Melerie Rains"}, {"rating": 4.0, "review": "very nice", "verified": true, "helpfulness": "0/0", "author": "ismael OLIVET - EXUR"}, {"rating": 5.0, "review": "LOVE the fire stick!", "verified": true, "helpfulness": "0/0", "author": "Anissa Wiley"}, {"rating": 5.0, "review": "Let's me watch when I want to wish", "verified": true, "helpfulness": "0/0", "author": "janet snapp"}, {"rating": 5.0, "review": "sweet", "verified": true, "helpfulness": "0/0", "author": "DePatto' \"DePatto\""}, {"rating": 4.0, "review": "great one", "verified": true, "helpfulness": "0/0", "author": "SUNGJIN PARK"}, {"rating": 1.0, "review": "I just picked this up to replace an original roku that was continually freezing.  The set up was super easy and I didn't mind having to plug it in (my roku had to be plugged in). The usb cord was long enough and I keep my tv on a tall dresser.  The only reason I am docking a star since the operating system is fast and set up was a breeze is that if you have Comcast and HBO, HBO Go will not work. Wish I would of known this prior to purchase but I can still view on my XBOX One so not a game changer.***update***I have dropped this down to one stars. Hulu plus stopped working as well as the issue with HBO go. I called and they confirmed it is a big issue they have had for a while. The product at this point became nearly useless to me and I returned for a chromecast which I live and all apps work", "verified": true, "helpfulness": "0/1", "author": "Jesse R"}, {"rating": 5.0, "review": "Works great canceled tv and just have WiFi now and its all I need no problems what so ever", "verified": true, "helpfulness": "0/0", "author": "Blake kaiser"}, {"rating": 2.0, "review": "Not as user friendly as Roku (it's TOO dumbed down), and doesn't have some of my favorite apps (which compete with Amazon's services). I'll be replacing it soon.", "verified": true, "helpfulness": "0/0", "author": "Amazon customer"}]