[{"rating": 4.0, "review": "Unless you got this at the giveaway price of $19, I would stick with the Amazon Fire tv box. I guess I'm a techie, and we tend to be frivolous with gadgets and buy redundant technology just to check them out. So I either own or have tried them all. I am biased against the stick because it performs poorly with PLEX. Even its competition, the supposed weaker Chromecast, streams flawlessly with Plex. Xbox One, Roku, and the Amazon Fire TV box all perform PLEX perfectly.If you don't know or don't use Plex, then you'll be happy with the Stick. It does everything else well. If you bought this for Plex, you might want to just buy the Fire TV. If you think about it, the stick isn't a bargain compared to the Fire TV. From $99 to $39 retail, at first glance, you may think it's a bargain, but it isn't. You don't get the Voice remote like you do with the Fire TV, that's $30 sold separately. So when there's no black Friday, no cyber Monday, and we're back to retail as usual, that's $70 total for the stick and the voice remote. Might as well pay an extra $30 to get the box where you get double the power, USB port for accessories like a keyboard. If you know what SIDE-LOADING is, you're going to want to use a keyboard when using Android apps that are not made for the Amazon interface. There is also an Ethernet port on the box.If the lesser Chromecast can do Plex nicely, then I'm thinking this isn't a hardware issue, and hopefully a software update can solve the problem. Others who are using it for Plex and are happy are making me per-PLEX-ed. LOL! I wonder if they had experience with any other gadgets to compare the quality to. But there are plenty of reviews similar to mine, with the conclusion that this is bad for Plex.BTW, if these box makers would just give us a HDMI input, they can completely wipe out the Smart TV business. Seem so easy, but only the high end Xbox One has this feature.-----------------------------------------------------Dec 4th, 2014 REVIEW UPDATE-----------------------------------------------------I have now revised my review for this product. Initially I was biased against it because I thought it performed horribly with Plex. I thought I couldn't use 1080p, so I had to set the quality to 720p which gave me so much blocky artifacts. As it turns out, I made a simple rookie mistake in 1080p mode. In my plex setting, when I would set the quality to above 8 mbps for 1080p, but to test out my movie, I would go into the RECENTLY VIEWED section and I would RESUME a movie. Well, the terrible quality and stuttering comes from the fact that I'm starting mid-stream cold, no buffering. I played around with it again today, this time I started all the movies from the beginning and it streamed perfectly and quality is outstanding!I initially rated the stick 2 stars. I still will not give it 5 stars because the value to me is deceptive. The voice remote is sold separately for $30 which brings the grand total to $70. At that point, you might as well get the Box version for $99 for all the reasons I mentioned above. If you got this for the pre-order price of $19, then it is a 5 star all the way!", "verified": true, "helpfulness": "1/2", "author": "GhostFaceReviewer"}, {"rating": 3.0, "review": "Many subscriptions are needed.", "verified": true, "helpfulness": "0/0", "author": "Corey"}, {"rating": 5.0, "review": "This thing is pretty amazing. It is worth it at twice the price.", "verified": true, "helpfulness": "0/0", "author": "telepathic monkey"}, {"rating": 4.0, "review": "The Fire TV stick is a sleek new stick and has some strenghts over Chromecast (and Roku). I have been using Chromecast, Roku and more recently Nexus Player, and the Fire TV Stick offers some unique features over the others. Its almost the form factor of Chromecast but with the addition of a remote and more processing power. The remote is a great addition and saves from going back to phone (and maybe unlocking it) every time you need to do control the content. Also saves from the need to install all the casting apps on your phone/tablet. The extra processing power is also immediately noticeable, smooth switching between apps, instant start of streaming.I had some issues setting up the device though, the device warned me to use included power adapter and asked me to press the Play/Pause button if I want to continue without using the power adapter, the thing is I was already using the included power adapter. So I guess it was either having difficulty detecting the power adapter, or it was just a poorly worded warning. Moving on from there I got stuck on wireless network setup, I could see my wireless network however connecting to it would keep failing. Some searching suggested restarting wireless AP to resolve this, and it did. However I never faced any such issue with Chromecast, Roku or Nexus player. One feature I liked was the option to set a static IP which is missing from Chromecast. Amazon also suggests somewhere that in future it would add support for hotel internet logins (web based login) which will be great (and first among all popular streaming devices).Finally the content; the app store can be improved, its difficult to navigate and search and providers available are less than any other platform also there is no free Plex version available.Overall a good device especially for Prime members.", "verified": true, "helpfulness": "0/0", "author": "Hesham S."}, {"rating": 5.0, "review": "I've been using this for about a week. Gotta say I love it! I have a dedicated htpc in my living room, a chromecast, and the fire tv stick. The Fire TV Stick has been great, love the user interface and how quick it responds. Videos stream really quickly and seems to be the best hdmi stick out in the market! So far, chromecast has not been used. Hope to see good things when the ios app becomes available.", "verified": true, "helpfulness": "0/0", "author": "William Jimenez"}, {"rating": 5.0, "review": "WOW, I am astounded at the quality of this product. I suspect Amazon to be on the verge of wonderful things.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I'm completely baffled by this device.  For starters, the quality of the video seems awful: washed out and pixilated. In fairness, I've never been that crazy about the video quality delivered by my Apple TV, either.  But this seems even worse.  That said, for thirty-nine bucks, I thought this would be an easy way to pump music and movies to hotel TVs with an accessible HDMI port.  I am absolutely clueless why you don't seem to be able to stream Amazon Prime music directly through the device, but instead have to log into the service and pre-select music you want to be able to hear via the Stick.  It's conceivable to me that this is a silly imposition dictated by some of the stellar strategic thinkers who populate (what's left of) the music business, but if I were Amazon, I would simply have told them to take a hike.  Then again, this might be the work of unsupervised engineers who sometimes wind up solving problems in ways that only make sense to engineers.  Regardless, if you want to use this thing to access and play Amazon Prime music, don't bother...", "verified": true, "helpfulness": "2/6", "author": "Tom Zito"}, {"rating": 5.0, "review": "I bought the Fire tv stick to give my xbox 360 a rest as my media interface and so far everything works great. Apps downloaded almost instantly and ran very smooth. So far I have used Amazon instant video, Netflix and ESPN GO all reliably with steady frame rates and good audio.", "verified": true, "helpfulness": "0/0", "author": "Ryan c"}, {"rating": 4.0, "review": "Not bad at all. If you're into the Amazon ecosystem, then this is right up your alley. I just really wish more (good) games were actually compatible with the remote.  It seems like if you want to play a decent game, you HAVE TO buy the game controller as well. Personally I think they should make your phone or tablet available for use as a decent game remote as well, but that's not the case. You can only use the app as a remote -not for games :-(", "verified": true, "helpfulness": "0/0", "author": "MotorcycleKopp"}, {"rating": 5.0, "review": "I have not used chromecast but fire tv stick is indeed speedier than roku stick with faster streaming of amazon instant videos and youtube contents. There is some lag in starting up netflix and moving through its contents but video quality is excellent (720/1080p). With AirPlay/DLNA Receiver (PRO) addon from amazon app store, you can stream almost anything from your iOS and Mac OS devices, including mirroring or extending macbook desktop. However, there is considerable lag when mirroring desktop but a little with extending desktop. You can also install xbmc on fire tv stick using adb over wifi. xbmc performs much better than on raspberry pi although some configurations about NFS/shared drives are needed to enjoy xbmc on fire tv stick. stick does heat up if I run HD video over long time, more than 30 minutes but I guess that is usual and so far it has not rebooted or given other issues. Overall, happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "alana \"List\""}]