[{"rating": 5.0, "review": "Love my Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "karen kellerman"}, {"rating": 5.0, "review": "The Fire TV Stick is fantastic!! It was so easy to install, it took me 5 minutes! Easy setup and it works great. I easily downloaded Netflix and my Amazon Prime Video library was right there when I installed it! Can't be the price!", "verified": true, "helpfulness": "0/0", "author": "Joanne C. \"Joanne Cerreto\""}, {"rating": 5.0, "review": "The best way to stream media.", "verified": false, "helpfulness": "0/0", "author": "Rachel Diaz"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Calvin Massey"}, {"rating": 5.0, "review": "I should have bought one of these a long time ago! It works great. We have \"cut the cable\".", "verified": true, "helpfulness": "0/0", "author": "Rft \"Withit Library Lady\""}, {"rating": 3.0, "review": "I really like the idea, but it seems like it has problems connecting to wifi a lot. I dont think its my wifi either because I can connect my laptop, phone, and xbox no problem to it but the Fire Stick looses connection all the time. Besides that it is pretty quick and I enjoy it. I wish I could mimic my laptop screen to it!", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "The Fire TV Stick works great. All you do is plug in, sign in to your accounts, and go. No setup needed. I also love the app for iPhone. It allows you to type using your phone rather than arrows and clicking each individual letter. The app also allows you to use the voice recognition. It's great!", "verified": true, "helpfulness": "0/0", "author": "Philip Paradis"}, {"rating": 2.0, "review": "A potentially great product was tripped up by bad policy.This item was bought for my daughter - not as a gift per se but not for my personal use.I discovered shortly before arrival that Amazon - in a move that smacked of knowing 'better' then their customers - had pre-registered the device without anyone asking.When i phoned to ask for guidance, i got another dose of condescension from someone that didn't speak clearly enough for me to understand.Then i spoke to another with English as a second language who i had trouble understanding.Finally i spoke to a woman that told me the device was reset, would have prompts to assign it to a Prime account and that a 'child could activate it'.Item arrived and would not accept identifying account and password. The only success was to phone, get put on hold [again] and have the Amazon rep manually set it.Bad form on many points.  I am hoping it was worth the effort.", "verified": true, "helpfulness": "0/0", "author": "Richard Crum"}, {"rating": 5.0, "review": "My only complaint so far is that there does not seem to be a way to search just my prime music for songs. You have to look through either artists or albums alphabetically to get to the song you want.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was everything it claimed to be. Extremely easy to set up and once that is done, just enjoy your movies! The price is right too!", "verified": true, "helpfulness": "0/0", "author": "Linda Carpenter"}]