[{"rating": 3.0, "review": "I bought the firestick very recently.  On the plus side navigation is easy and intuitive and I havent had any trouble streaming video so, but on the negative side I have experienced lag when streaming my Amazon music, which was a surprise since video worked so well  I've also had problems with lock ups when playing games, requiring multiple presses to get back to \"Home\" and then playing &!returning from a video in order to recover.  For those reasons I'm only giving the Firestick 3 stars.", "verified": true, "helpfulness": "0/0", "author": "Michael W Pyle"}, {"rating": 5.0, "review": "Great product, easy set up and quick service. exceeds expectations", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "I went ahead and got one of these when they were on sale and I'm glad I did. I've never had any problems with it and it works great. We have Roku's on all our other TV's and I needed something for my kitchen TV. I decided to try this and I've very happy with it. Learning to work the menu was a little different since we've had Roku's so long, but once you do, it's no problem. Matter of fact, I now have a Roku in my kitchen because my son stole this Fire Stick from my TV to put in his room, I wish I would have gotten another one at the sale price.", "verified": true, "helpfulness": "0/0", "author": "inkedtexaslady \"inkedtexaslady\""}, {"rating": 5.0, "review": "This is an great device for tvs. I love it.", "verified": true, "helpfulness": "0/0", "author": "Joshua Pouliot"}, {"rating": 5.0, "review": "Control is very fast and smooth. Interface is simple, yet functional. Video and sound quality very good.", "verified": true, "helpfulness": "0/0", "author": "Stan Matofu"}, {"rating": 4.0, "review": "seems to work fine but was hoping i would be able to find fox news  still need to play with it more to find more movies and shows", "verified": true, "helpfulness": "1/1", "author": "bjolly95"}, {"rating": 5.0, "review": "Got this for free when I prepaid for 3 months of Sling TV. Came with the Sling TV app so it's great that I get to watch ESPN, AMC and other channels on my TV. No wait times on loading movies and apps. Would highly recommend to get for anyone that cut cable.", "verified": true, "helpfulness": "0/0", "author": "Jose Saldana"}, {"rating": 5.0, "review": "This is the perfect part and the perfect item to add Netflix and other apps to a non- smart TV!", "verified": true, "helpfulness": "0/0", "author": "Renae Pearson"}, {"rating": 5.0, "review": "Love it! Install was super easy. Picture is gorgeous. Love the cute remote.", "verified": true, "helpfulness": "0/0", "author": "Vicki Fernandez \"Vickifer\""}, {"rating": 5.0, "review": "Its really nice sometimes a bit laggy but its really amazing i encourage people to get it", "verified": true, "helpfulness": "0/0", "author": "Cesar Robles"}]