[{"rating": 5.0, "review": "I bought one of these just to see how it was.  we now have 3 and turned our cable off.  I LOVE MY FIRE TV!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great,easy to install & user friendly. Love it!", "verified": true, "helpfulness": "0/0", "author": "christopher Frappier"}, {"rating": 5.0, "review": "I received the Fire stick on time and had it installed in minutes. It does everything it was supposed to and would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Curtis E. Ham"}, {"rating": 4.0, "review": "Oh Amazon. Why do you insist on stopping short of perfection? I am impressed with the overall quality of the fire tv stick. For such a tiny and inexpensive device it is superior in many ways to other similar devices I own. It is very responsive, very little latency or lag when using the interface, launching apps or video. Streaming video over wifi is solid with only occassional glitches. The integration with the amazon ecosystem is clearly the big attraction. What's missing? It does not support Amazon FreeTime! Aw, you came so close to perfection. Still, an admirable attempt. ;-)", "verified": true, "helpfulness": "0/0", "author": "fygar"}, {"rating": 2.0, "review": "First day we got it, worked perfectly fine. 4 weeks into using it, the remote just stopped working. We thought the batteries are dead so we replaced them. Still, it won't work. We have to use the phone app to control it but its still convenient to have the actual remote itself. The device is superb nevertheless (apps and speed and whatnot), but we expected more from Amazon.", "verified": true, "helpfulness": "1/1", "author": "Rachielle Ann Pronuevo"}, {"rating": 5.0, "review": "Just awesome!!!  We don't have cable and perfect for watching  dramas and movies on our TV. Best part is you can take this anywhere you want to!!!", "verified": true, "helpfulness": "0/0", "author": "Windrider"}, {"rating": 5.0, "review": "Beats the Chromecast. Download the free remote app if compatible with your phone.", "verified": true, "helpfulness": "0/1", "author": "Wer4jc2"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Nancy Werner"}, {"rating": 5.0, "review": "This is a very similar product as the Fire TV (and cost so much less). Unless you are going to be playing lots of games (and you can play games on the TV stick as well) just go with this and not the Fire TV. It's not worth spending the extra money for.", "verified": true, "helpfulness": "0/0", "author": "dc757575"}, {"rating": 5.0, "review": "I purchased this when it was released for $19.00 for Prime Members.  After using this, and comparing the cost of xfinity monthly HD service, I decided to pull the plug on cable and use this for streaming Netflix, Hulu Plus, and of course Amazon prime shows.  I now have two sticks, one for each TV in the house with streaming service.  I now watch only the shows that I enjoy, and instead of surfing mind-numbing TV shows at night I read more often - that is a good thing.  Not to mention the $900 a year that I now saving after dropping cable.The interface is extremely easy to use, my 5 year old son can use it to get the shows that he wants (and is allowed to watch!).  Shows load amazingly fast using Prime Service, and with very limited initial buffering on other streaming services.We have kindles and fire phones, and the interaction between the Fire TV Stick and other Prime services is seemless and a plus - with a click I can show a slideshow of pictures and video's from the cloud, \"flick\" movies and video's from my kindle to the TV screen (which is also useful for putting a new kids show on the screen from another room using my kindle!).", "verified": true, "helpfulness": "0/0", "author": "S. Fordham"}]