[{"rating": 5.0, "review": "Exactly as advertised, get everything I want in one package.", "verified": true, "helpfulness": "0/0", "author": "Zack Moore"}, {"rating": 5.0, "review": "This Thing is awesome. especially for a college student like myself. Super Easy to use and set up, plus its really portable and small. the apps are phenomenal, I'm currently watching the NBA finals on the ESPN App, plus you have Netflix, Spotify, YouTube, and tons of others that I constantly use. Picture Quality is great, no complaints! Because of this I have yet to hook up cable in my new apartment. 10/10 would DEFINITELY RECOMMEND!!!", "verified": true, "helpfulness": "0/0", "author": "Flynn Lemonnier"}, {"rating": 3.0, "review": "Super quick shipping. The product is everything I hoped for. Say goodbye to your cable bills cuz fire stick is where it is at! Keeps my kids entertained providers me with enough channels to satisfy.Update. I've had this for about three months, it has already started to malfunction. During use it randomly cuts out and my tv displays no signal. Then it will come back on. It's annoying and happens after 30 return policy. I believe its the poor design of the fire stick as it really heats up at times, it lacks any vents for cool down or fans. We all know how important it is to keep electronics from heating up so this is obviously pure ignorance in design or maybe it's intentional to make money. I say go with the roku as it has seriously addressed these concerns. Sorry Amazon you lost my prior 5 stars due to this.", "verified": true, "helpfulness": "0/0", "author": "Sonar"}, {"rating": 5.0, "review": "Love the roku but decided to try this in a spare room in our house. My wife and I love it.", "verified": true, "helpfulness": "0/0", "author": "Dillin G. Wright"}, {"rating": 4.0, "review": "Amazon, will you please get with MLB and help them to develop an MLB Premium app that is watchable. It's not my connection speed as every other thing works perfectly on my stick. The constant starts and stops make watching a game unbearable. I realize that this is more MLB's problem but I've already complained to them too.", "verified": true, "helpfulness": "0/0", "author": "Brian Mather"}, {"rating": 5.0, "review": "This is the best, very fast very easy to use,  my kids love it.", "verified": true, "helpfulness": "0/0", "author": "Luis  R."}, {"rating": 5.0, "review": "Let me start by saying I love amazon and I have a kindle fire that I'm way to attached to. I was excited to get this. Our master bedroom was an attic originally and the cable/internet was never run to that room. We didn't want to pay the cable company to run cable up there so we got a roku which we've been happy with for about 2 years. Our oldest son decided he wanted tv in his room so we passed the roku to him and bout the fire stick. I can't speak for the quality of content or speed etc because it wouldn't connect to the internet. We tried many times, but it just wasn't strong enough to get on the signal. We put the roku back in and it worked fine so I'm positive it's not our internet. My advice is not to get this unless you can have it on the same floor as our router.***editing 6/28/2015*** changing my rating because after some research I decided to buy a wifi extender to boost our signal through out the house. My lazy self hadn't gotten around to actually printing the return label for the fire stick so I thought I'd give it a try. With the wifi extender in the same room it works perfectly. I'll stand by my original suggestion that if you're going to use this you need to have it close to your router (or an extender) but I'm changing it to 5 stars because it does work great and we are keeping it.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Capone"}, {"rating": 4.0, "review": "The only issue we have is the battery cover is almost impossible to remove. We finally got it off and instead of closing it we are just putting a rubber and around it.", "verified": true, "helpfulness": "0/0", "author": "EVO"}, {"rating": 5.0, "review": "My daughter loves it!", "verified": true, "helpfulness": "0/0", "author": "Natalie Moore"}, {"rating": 1.0, "review": "This stupid thing would to connect to my WiFi. Why would Amazon sell something that does not even connect to to your friggin' network!? Google the problem.... it is extremely common and there does not seem to be a fix! Amazon needs to pull this product and stop wasting people's time with this lame POS!", "verified": true, "helpfulness": "0/1", "author": "Andrew Lukban"}]