[{"rating": 2.0, "review": "No different than my Blu-ray player except I cannot watch DVDs.  I would not recommend it.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "Great product and very easy to use!", "verified": true, "helpfulness": "0/0", "author": "rachel"}, {"rating": 4.0, "review": "Overall, really good.  Really like the idea of taking that little stick on vacation with us.Organization could improve and apps on it will cut off at times, at least once a day.  Those same apps don't cut off on our iTV nor Roku.", "verified": true, "helpfulness": "0/0", "author": "gtcone"}, {"rating": 4.0, "review": "Wish I was able to see all of the channels mentioned in the application.  This is a drawback.", "verified": true, "helpfulness": "0/0", "author": "Allicru"}, {"rating": 5.0, "review": "This is awesome 5 stars", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "It's amazing and I love it.", "verified": true, "helpfulness": "0/0", "author": "Rupesh"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "impulsebuyer042"}, {"rating": 5.0, "review": "I have a Roku 3 and the Fire Stick is very comparable with a \"way lower\" price point. I know Roku has a stick now too however it's still $10.00 more. I have been a Prime member for several years and if you have Amazon Prime then there should not be any other choice in terms of the choices out there. Plus based on the comparison charts the Amazon Fire Stick has a faster and stronger medium interface. You can look that up. On some comparison charts it was stating that there were somethings Roku provided that the Fire stick does not but that comparison chart is obsolete. Now Fire Stick does just about everything Roku does, and offers almost all of the same applications.", "verified": true, "helpfulness": "0/0", "author": "peaselove"}, {"rating": 5.0, "review": "Only problem with this TV stick is finding one. Ended up locating one at a Best Buy after trying several stores, including Amazon. I can see why. It works great and the reviews proved true. Checked with co-workers who purchased competing brands and the Fire TV Stick outperforms them all.", "verified": true, "helpfulness": "0/0", "author": "Mike D."}, {"rating": 4.0, "review": "Pretty much works as advertised. Easy to set up although slightly awkward to get into some HDMI slots with the power supply wire hanging out of it. Now I have way more TV to watch than I'll ever possibly need and I haven't even scratched the surface of what's available. Well worth the $40 I spent.", "verified": true, "helpfulness": "0/0", "author": "Randall Lewis"}]