[{"rating": 3.0, "review": "It's pretty good but still missing many desired shows and movies - unless you pay for them individually! So the yearly membership fee to be a Prime member still doesn't include disney cartoon shows and/or movies (mickey's club house, frozen, and others...) There's a fee attached per show/movie.That also includes a lot of 'fairly' newer shows/movies...", "verified": true, "helpfulness": "2/2", "author": "RTS"}, {"rating": 4.0, "review": "As a cable cutter it fits my needs. Does it feel like the software needs further tweaking? Yup.I have a rock solid 25 mg fiber optic connection and will often completely lose connection severaltimes in a 30 minute program. This does not happen with my Apple tv on the same fiber optic andwi-fi connection, watching either Netflix or Hulu.", "verified": true, "helpfulness": "1/1", "author": "John Doe"}, {"rating": 4.0, "review": "Paid 20.00 resold for 49.00", "verified": true, "helpfulness": "1/2", "author": "tatalah"}, {"rating": 4.0, "review": "very satisfied", "verified": true, "helpfulness": "1/1", "author": "John P. Childers"}, {"rating": 4.0, "review": "I like this a lot, the ability to add any apps from google's Play Store is a neat bonus if your tech savvy enough or simply know how to google lol. Only thing I am a bit dissapointed about is the selection of apps you can get via Amazon but that's ok and not all installed apps you manually input yourself works. 4 Stars it is, add more apps via Amazon and can easily be 5 Stars.", "verified": true, "helpfulness": "0/0", "author": "Tha Phy"}, {"rating": 5.0, "review": "I absolutely love the Fire TV Stick.  Actually, I now have 3 of them.  They were very easy to set up and are very easy to use.  Prior to owning these sticks, I would frequently not be able to access movies through the Smart TV's amazon app.  Nothing would load, which was extremely frustrating. I do not have that problem with the Fire TV Sticks.  Everything I have wanted to watch has loaded quickly and the picture quality has been great.  I did not purchase the voice remote, because if I want to use the voice feature I can use the Fire TV apps that I have installed on my iphone and my Kindle Fire tablet.  They work great.  Most of the time I don't even use those, because the remote that was included with the stick is more than adequate.  I am a prime member, so I am able to access a lot of television shows and movies for free, which makes the Fire TV Stick that much more awesome.  All in all, I think these are great streaming devices and I am so glad I purchased them.", "verified": true, "helpfulness": "1/1", "author": "Deborah L. Muni"}, {"rating": 3.0, "review": "When I signed up and for the stick I was led to believe there would be many movies and TV series included in my prime membership. I have used Prime for discounts and shipping and will continue my membership for that reason but I am disappointed in some aspects of the movies and TV. I do not like many of the movies coming out of Hollywood today because all they are is a race to see who can get their clothed off the fastest and who can blow up the most sets. I like the older movies from the 30's to the 50's but when I click on most of those that prime offers I have to either buy or rent. I would like to see more movies and series available on prime that are part of my membership that I do not have to pay extra for such as the British mysteries like Lewis the entire series, Morse the entire series, Frost the entire series, and the old movies that I do not have to pay extra for. If what it would take is a little more money I would be willing to pay $120 per year instead or $99 but I want in return not to have to see that I have to rent or buy the movies I want.", "verified": true, "helpfulness": "1/1", "author": "William D Deniston"}, {"rating": 3.0, "review": "Could someone explain to me how this works. It doesn't seem like it has a lot of storage. Do you use your Amazon account with wifi and can watch movies that way? Just a little confused thanks", "verified": false, "helpfulness": "0/0", "author": "Tiffany \"puglove\""}, {"rating": 5.0, "review": "This thing is worth the money and then some!  I LOVE that I can just plug in the USB module and have access to PRIME on ANY TV in my house!  My kids love it because it has kid-appropriate shows they can watch for hours!I bought this on a pre-order for $20, but even at $39 it's a GREAT DEAL!", "verified": true, "helpfulness": "0/0", "author": "Kilibreaux \"RK\""}, {"rating": 5.0, "review": "This a GREAT Product, the menu is user friendly.", "verified": true, "helpfulness": "0/0", "author": "Bryan Ridley"}]