[{"rating": 5.0, "review": "Husband is loving it! Got it for him for Christmas. Now he can watch anything on  the TV from his Kindle or from the laptop on \"the big screen\" with the \"big voice\" (stereo).", "verified": true, "helpfulness": "0/0", "author": "Elizabeth \"wealth of useless information\""}, {"rating": 5.0, "review": "This fire stick is amazing!!!!My husband and I purchased at the recommendation of a friend.  We were apprehensive because we already have the apple version and are VERY unhappy with it!But We are 100% plus satisfied!", "verified": true, "helpfulness": "0/0", "author": "Peggy"}, {"rating": 4.0, "review": "Great for streaming from Amazon.  Not very useful to mirror a laptop to the tv like I had hoped but for $20 it was well worth it.  Very user friendly navigation.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Collen"}, {"rating": 5.0, "review": "Awsome wish I had done this sooner very easy to navigate user friendly greaat product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my stick!", "verified": true, "helpfulness": "0/0", "author": "Shelby Graves"}, {"rating": 5.0, "review": "When we received this and installed it, videos and movies would not download and hold.  The problem was not with the stick but with our internet speed.  That has been corrected and we are enjoying videos, movies and music.  So glad I took advantage of the pre-sale offer and ordered it.  We expect to have many good hours of viewing.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Perilloux \"Gwammy of 2\""}, {"rating": 4.0, "review": "easy to set up, thank you my  granddaughter. Easy  to use and a host of entertainment available.. Very good investment.", "verified": true, "helpfulness": "0/0", "author": "LMP"}, {"rating": 5.0, "review": "Easy to install, set up and use.", "verified": true, "helpfulness": "0/0", "author": "Laura Wagner Venters"}, {"rating": 5.0, "review": "Purchased to watch the Bosch series.  Love them both.  We already had the Netflix stick, but don't need it any more, the Fire stick has it also.  The only negative I can see is that the remote is difficult to use.  Wish we were able to purchase a more reliable one.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "I get so many selections of movies and channels. I love it !", "verified": true, "helpfulness": "0/0", "author": "lametra Smith"}]