[{"rating": 5.0, "review": "The Fire TV Stick was easy to install and is very easy to use.  It works with a lot of different applications / services.  The only small negative part of it is that I have yet to find a way to stream YouTube through it.  Other than that, it's perfect!  I love watching Netflix with it and the remote is so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Plumeyer \"Element Lad\""}, {"rating": 1.0, "review": "half the time it will not connect to the wireless server. I tried to exchange this unit for another but the technical department said to keep trying to make it function.I will try this unit in another location in a few day and see if going through a different cable company changes anything. If not I want a unit that functions every time.", "verified": true, "helpfulness": "0/0", "author": "Harold J. Hanlin"}, {"rating": 5.0, "review": "Great for watching old tv shows and movies", "verified": true, "helpfulness": "0/0", "author": "Lisa Exum"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Rachel Taylor"}, {"rating": 5.0, "review": "It is so easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Robert Seawright"}, {"rating": 2.0, "review": "Was probably 5 star when I first bought it, but now only 2 stars. The thing I do the most is stream Netflix. However, there is a known issue with Netflix stuttering on the Fire TV stick (just google it) that no amount of resets, re-downloads, or reboots will fix. The image will freeze while the sound keeps going, then the image will unfreeze and speed up to catch up with the sound. I am sick and tired of dealing with this especially during action sequences. Everything else about the stick seems to work ok, but when the primary streaming service doesn't work well, I draw the line. I will be selling this and buying a Roku 3.", "verified": true, "helpfulness": "0/0", "author": "sakenobi18"}, {"rating": 3.0, "review": "I have Apple TV as well as an Amazon Fire TV Stick and I definitely prefer Apple TV. My biggest frustration lies with the apps on the Fire Stick; they don't work consistently. For instance, after choosing a show or movie in both HBO GO and Netflix, it won't play and immediately goes back to the home page. Very frustrating! Just save yourself the frustration, pay the extra $30 and just get the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Taylor Pence"}, {"rating": 5.0, "review": "easy to set up and use, no more $85 a month Satellite bills for us!", "verified": true, "helpfulness": "0/0", "author": "freebirdatq"}, {"rating": 4.0, "review": "Very touchy about where it is located from wifi source. Picture is still a little grainy but no problem. I am still using my motorola droid razr on the other tv with no problem. Sometime finding what you want is a pain.", "verified": true, "helpfulness": "0/0", "author": "Sharon Fletcher"}, {"rating": 5.0, "review": "Very satisfied with Wi-Fi hookup and streaming results, particularly Netflix and Amazon, Hulu is also available but no programs attract us.", "verified": true, "helpfulness": "0/0", "author": "Larry Belinn"}]