[{"rating": 5.0, "review": "Great product highly recommended", "verified": true, "helpfulness": "0/0", "author": "George Matwijec \"ghmat\""}, {"rating": 2.0, "review": "I wanted to like it but don't. I will be getting another Roku instead. Fire does not have the choices that Roku has. If you mostly use it for Amazons Prime watching it would be ok. I may be missing something??? Where is the AMC app? Only had it for a week, I will explore it more.I can always put it on my kids tv.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "Outstanding piece of equipment. Works and saves money from having to be on cable.", "verified": true, "helpfulness": "1/1", "author": "Diane"}, {"rating": 5.0, "review": "This is a great buy for the money.  Works better than expected.  Easy to navigate with the control remote.  Set up was a snap, took be no more than 5 minutes, and I'm not tech savy.  I was very surprised at the color quality it gave to my older HD TV.  I just ordered another one for my sister to watch her movies and cooking shows.  I do believe this is the best buy I've made on amazon.  This is evident, as there is normally a waiting period, for they often run out of stock.", "verified": true, "helpfulness": "1/1", "author": "Willian J. Danner"}, {"rating": 5.0, "review": "We absolutely love our tv stick. Don't know how we lived without it. Perfect for watching a streaming show or movie when we get off work, or for streaming Pandora while I clean or do dishes. Such a great product.", "verified": true, "helpfulness": "1/1", "author": "Kristin"}, {"rating": 5.0, "review": "Fantastic!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If you have Amazon Prime, this is a no-brainer. If you don't, it might be a reason to get it. Easy to use, fast, and responsive. Great for use with not only Amazon's movie streaming but also Netflix and your Amazon music library. Will probably soon be buying more for the other rooms in the house.", "verified": true, "helpfulness": "1/1", "author": "Michael"}, {"rating": 3.0, "review": "The Fire Stick is dependent upon your Internet connection speed.  The faster the connection, the less disruption to Fire TV Stick.The Amazon Prime subscription selection is decent.", "verified": true, "helpfulness": "1/1", "author": "John H Sneed"}, {"rating": 5.0, "review": "love this especially since I was lucky enough to pre-order so I only paid $20.  I find this device to be very easy to use and just love the remote..The remote is so much better than the one that comes with an apple tv. I 've had no issure so far and since I was able to get Kodi on it I like it even more.", "verified": true, "helpfulness": "0/0", "author": "Alex C"}, {"rating": 5.0, "review": "Product is as advertised. Easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]