[{"rating": 4.0, "review": "I was prepared to be a little disappointed and there are things I would like to see improved.This works with all the channels I can stream on my Kindle and will mirror my Kindle's screen if I want.  It works well with my Plex media server.  However, I can't use Cox TV Connect or Contour with this unit, so I can't stream regular TV channels.The TV stick allows you to play games, but I most likely won't be doing that.The docs say that you can run this without the power supply, but it isn't as fast.  Just plug the power supply in.Logging into NetFlix and Hulu accounts can be cumbersome with the remote and it doesn't seem to save my passwords between sessions.", "verified": true, "helpfulness": "0/0", "author": "Michael L. Muth \"Mike Muth\""}, {"rating": 5.0, "review": "Have thoroughly enjoyed being an Amazon member using the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Susan \"Susan\""}, {"rating": 2.0, "review": "Works fine. Do not like that I need an AC plug to power it. Also really dislike that the adapter cord for the AC power is only 5 feet long!! How much would it cost to include an 8 or 10 foot cord?? I purchased one from eBay for $3.95 free shipping!! Too bad I had to to use the firestick.", "verified": true, "helpfulness": "1/2", "author": "Faith A Skelonis"}, {"rating": 5.0, "review": "Love the Fire TV Stick. Easy to set up - especially important for a non-techie like me - and easy to use. I like the way integrates across multiple devices and viewing Amazon prime videos is a breeze. I rate it A-1!", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "Have used it for a few days. It is good so far", "verified": true, "helpfulness": "0/0", "author": "jianfeng qin"}, {"rating": 5.0, "review": "This is a great device. The only problem is that it doesn't have an off button so if you are having connection problems you have to actually remove the device from the TV to restart it.  Otherwise I don't have a single complaint!", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 4.0, "review": "It works quite well.  Was somewhat surprised it wouldn't operate off the 5V USB supply from the TV and had to be plugged into the wall socket adapter provided in the box.", "verified": true, "helpfulness": "0/0", "author": "Sterling Knickerbocker"}, {"rating": 5.0, "review": "Great Product.  Easy to use,", "verified": true, "helpfulness": "0/0", "author": "Mr2woodworking"}, {"rating": 1.0, "review": "It keeps going off and searching...over and over.  We can't enjoy watching movies or anything for the interruption due to searching and saying we are not connected.  We have worked on it, changed what we could, upgraded our internet speed, move to two different HDMI ports, put the extender on it, turned everything off and rebooted it numerous times, etc.  Is our Fire TV Stick simply a dud/lemon?  Surely they aren't all of this poor quality or you would be out of business.  Do you need to replace it?", "verified": true, "helpfulness": "1/2", "author": "Ann Kaiser"}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/0", "author": "Wendy A Worobey"}]