[{"rating": 3.0, "review": "thx", "verified": true, "helpfulness": "0/0", "author": "gobs1 \"dennis j\""}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "W. Petrak \"Yob2kanobe\""}, {"rating": 3.0, "review": "I'm still in the process of trying to set this up, but already this is dropped to three stars because of the remote. Go online and Google installing fire stick batteries in remote and you will see that countless people have had a horrible time doing this simple task. My engineer husband finally figured it out, but almost broke his thumbs doing so.", "verified": true, "helpfulness": "0/0", "author": "Professor"}, {"rating": 5.0, "review": "I love this fire stick. I'm not a technical person, and it took 5 min. to hook it up. I did not buy the upgraded controller and I'm glad I didn't as you can download the app for free.", "verified": true, "helpfulness": "0/0", "author": "Ella Lindenhofen"}, {"rating": 5.0, "review": "Love it! Easy to set up and use and with my Amazon prime membership it's even more amazing!", "verified": true, "helpfulness": "0/0", "author": "Barbara Ernst"}, {"rating": 5.0, "review": "Excellent. Just ad advertised!", "verified": true, "helpfulness": "0/0", "author": "Michael Erickson"}, {"rating": 5.0, "review": "Amazingly easy and powerful! My hubby was a real doubter when I gave it to him as a gift, but I can't get him off it now! Pay for Prime Membership to get the most out of Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Mrs. T."}, {"rating": 2.0, "review": "Very limited Miracast support for devices. Everything else is as advertised. If you don't have a device on the supported list, don't buy this thinking Miracast is a standard and your device should work. BlackBerry and windows 8.1 do not work with the Fire TV stick.", "verified": true, "helpfulness": "2/2", "author": "David Therrien"}, {"rating": 5.0, "review": "I love them both. If you expect more from the Fire TV Stick, I would suggest the upgrade to the Fire Box. I did not expect it to perform like the box. For the price it is better than being without it to have to put in a DVD. It was purchased because of the performance of the box and because of the 19.00 cost. Now that is a special just knowing what I paid for the box. For the cost I was not expecting the same performance. The Junior version of the box. It can also be like what I expect from a adult I am not going to expect from the child. If you're able to understand it from that point of view. I believe that I can use my voice remote from the box with the stick. If not I will make a separate purchase. I believe it is worth it. I am going to purchase another stick for my household and maybe another box. If I am enjoying my tv I would like my family to be enjoying theirs. But it is also good to have prime under your belt. It is a combo. We have to pay for what we want to enjoy in our own homes.Take it from me, enjoy for it could have and it can be worst with another product. I see a lot of comparison to others and you're not satisfied with them. Today we make a purchase and then something comes out better and we then upgrade and pass the other one on to someone whom wanted one but could not make that purchase. Be Happy, Merry Christmas Everyone and a Happy New Year....", "verified": true, "helpfulness": "0/0", "author": "Toots"}, {"rating": 5.0, "review": "amazing", "verified": true, "helpfulness": "0/0", "author": "Carmen McCormick"}]