[{"rating": 5.0, "review": "I couldn't get good reception with my Netflix before, but when I added the fire stick it is excellent well worth the money best product ever", "verified": true, "helpfulness": "0/0", "author": "Glenda Haggy"}, {"rating": 5.0, "review": "I have had it for a little over a week and really like it.", "verified": true, "helpfulness": "0/0", "author": "cyrus k hanks"}, {"rating": 5.0, "review": "Just what I was looking for", "verified": true, "helpfulness": "0/0", "author": "John Barrett"}, {"rating": 4.0, "review": "Good product?", "verified": true, "helpfulness": "0/0", "author": "KellyWilkins"}, {"rating": 3.0, "review": "So easy to set up and use. So far my favorite feature is I can search for something, not knowing if its on Amazon, Netflix or Hulu and it shows all the options.Can't wait for more channels to be part of Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "RW \"adeser2030\""}, {"rating": 3.0, "review": "My biggest problem with the stick is that every 10 minutes or so a terrible glitching sound comes through the speakers no matter if you are watching a movie on prime, ordered a movie, watching on netflix, playing a game, etc. I have never heard this noise before and it gets very irritating.  I have used it on other televisions in my home and also at a friends place on a different wifi yet still have the same issue. Other than that its a good time.", "verified": true, "helpfulness": "0/0", "author": "ryan rolfsen"}, {"rating": 5.0, "review": "Glad i tossed my chromecast for the amazon fire stick.", "verified": true, "helpfulness": "0/0", "author": "voodoo47"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Frank J. Pensabene"}, {"rating": 4.0, "review": "Waitting for HBO, and also more applications", "verified": true, "helpfulness": "0/0", "author": "vano200571"}, {"rating": 4.0, "review": "Haven't used it much yet but looking forward to exploring the many options presented.  Hoping to be able to ditch high cost cable.", "verified": true, "helpfulness": "0/0", "author": "Kathie Sybrant"}]