[{"rating": 5.0, "review": "We love it! My six year old loves taking her Amazon TV Stick to watch Netflix and her Kidz Bop music while we're on vacation almost as much as she loves being able to watch and listen at home.Thanks, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 4.0, "review": "It occasionally jumps or skips.  Otherwise OK.", "verified": true, "helpfulness": "0/0", "author": "Steven R. Agal"}, {"rating": 5.0, "review": "This has been the best purchase I've made in a while! Very easy to use. Perfect for the extra TV in the house that we didn't need a cable box for, but still wanted viewing options. My daughter loves it!", "verified": true, "helpfulness": "0/0", "author": "ladybugtn83"}, {"rating": 1.0, "review": "Constantly resets in the middle of watching a program.  Sluggish interface.  Only advantage to Chromecast is the remote, but is not worth is.  Resolution goes from bad to great, back to bad constantly even with 25Mb/s speed.  Never have that problem with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Matt O'Connor"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was everything I expected.  I will most likely purchase another one for our other TV.  Good product.", "verified": true, "helpfulness": "0/0", "author": "Brian Mendenhall"}, {"rating": 5.0, "review": "Fast!!!!", "verified": true, "helpfulness": "0/0", "author": "N. Tong"}, {"rating": 5.0, "review": "So far I love it.  I like the amazon instant new releases catalogue.  Its been great so far.", "verified": true, "helpfulness": "0/0", "author": "Robert Mcmillan"}, {"rating": 4.0, "review": "gave me everything i was looking to gain and is easy to use", "verified": true, "helpfulness": "0/0", "author": "Jac McCracken"}, {"rating": 4.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Flash"}, {"rating": 3.0, "review": "The remote is annoying and I am having problems getting apps loaded and useable.", "verified": true, "helpfulness": "0/0", "author": "rhoda sievert"}]