[{"rating": 5.0, "review": "Truly amazing!!!!", "verified": true, "helpfulness": "0/0", "author": "CJ"}, {"rating": 5.0, "review": "Awesome machine. Lighting fast. For this price, it's a steal. Loved it.", "verified": true, "helpfulness": "0/0", "author": "City Gold Hunter \"City Gold Hunter\""}, {"rating": 5.0, "review": "Great device. No complaints with it. Also useful with the web interface now for WiFi that require guest login pages.", "verified": false, "helpfulness": "0/0", "author": "Alex Charbonneau"}, {"rating": 5.0, "review": "Haven't used it yet, but both son & daughter love theirs", "verified": true, "helpfulness": "0/0", "author": "Ja Nell"}, {"rating": 4.0, "review": "Even though I like the fire tv stick, it is not without some difficulties. Sometimes I can't stream something because it's says my connection is weak, which is not true for anything else I stream! Sometimes when you pause a show, when you get back to it, you have to start all over again to get back to it. I'm still working with this and hoping I can get better at using it, and hoping it works better along the way! But I really think it has some bugs, that's why I gave it 4 stars.", "verified": true, "helpfulness": "0/0", "author": "MMCher \"M\""}, {"rating": 5.0, "review": "Easy setup. Very intuitive. Great product.", "verified": true, "helpfulness": "0/0", "author": "Hector Manuel Echevarria"}, {"rating": 5.0, "review": "The first one I got was a dud. Nothing happened when I plugged it in. I called Amazon and was sent another that had been \"tested\" first before being sent. That did the trick. Had it up and running in less than 10 minutes. Granted I only watch a few of the programs offered but my Netflix movies (easy to sign in) and my Amazon Prime movies were all there. I love the ease of using it and the phone apps looked great but I didn't really need them. I had had a Roku which I did have some issues with and then the reset \"button\" fell inside the last time I tried to reset it. A new one was almost $100. The Fire Stick was much less PLUS Amazon will stand behind it. I'm a happy camper!", "verified": true, "helpfulness": "0/0", "author": "Maine Coast \"Beth\""}, {"rating": 5.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "yosvani quinones"}, {"rating": 4.0, "review": "Great device, great price", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "No problems. Amazon netflix or you tube easy to watch", "verified": true, "helpfulness": "0/0", "author": "Daniel Goyzueta"}]