[{"rating": 5.0, "review": "I would not mind having less connection issues...", "verified": true, "helpfulness": "1/1", "author": "NikkiLee"}, {"rating": 5.0, "review": "Amazing! ! Totally enjoy benefits of a smart tv with my fire stick! !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I bought this specifically for use with mlb.tv, opening day and I couldn't watch the live stream on a 50mb connection. EPIC FAIL!", "verified": true, "helpfulness": "0/2", "author": "Paul G. Westcott"}, {"rating": 5.0, "review": "Just love it that all I can say", "verified": true, "helpfulness": "0/0", "author": "Donta m."}, {"rating": 5.0, "review": "so awesome to have my amazon library on TV when I travel.  I wish I could speak to the remote -- but aside from that it's awesome and the price is right!", "verified": true, "helpfulness": "0/0", "author": "BAMAZON \"Barry\""}, {"rating": 5.0, "review": "Very pleased with this stick and all the features that come with it.  The screen save was a surprise to me as well as the fact that I could show my personal pictures on my TV screen.", "verified": true, "helpfulness": "0/0", "author": "R JOHN BLYTHER"}, {"rating": 5.0, "review": "Work very good , picture excellentThank you", "verified": true, "helpfulness": "0/0", "author": "Ken Tran"}, {"rating": 4.0, "review": "Very close to a 5 star... I was having NO luck with Hulu Plus on a Panasonic (2014) and Samsung (2015) BluRay's for Hulu Plus... They both were nightmares, always pausing, almost impossible to restart (Maybe after 5 minutes, to the point you give up and try again another day)They also wouldn't stay connected to the network and would require me to input my password repeatedly... Good luck on connecting after that... I confirmed through a sports message board that others were having issues with Hulu Plus on BluRay's of various manufacturers...Some liked Roku3, and Chrome... I opted for Fire because I have an account and because of the price... I have entered my network password on Fire once in a week now... That being said, here are the Fire issues... NOTHING compared to the BluRay's...1) Pauses every once in a while, but hitting the center button at the top... The unmarked center, revives it... No lag2) Pausing too long takes it to a screen saver and then you have to go back through the menu to get to the show again... I haven't adjusted settings if that is it, as it is no big deal considering what I went through with the Blu-es3) Doesn't shut down that I know of... It does go into sleep mode, as far as I can tell, because switching inputs the next day is a blank screen until I press a button... I would have to hook up the power meter to figure out if it's really draining electricity or if it truly is in sleep... There should be a message saying \"Goodbye\" or \"Resume by pressing any button\" if it is in sleep...That's it... $39 to find out... I can't explain it, just happy I could return the Bluray's to Costco, because for whatever reason, they don't work", "verified": true, "helpfulness": "0/0", "author": "Mitch"}, {"rating": 4.0, "review": "Love the Fire Stick!  So easy to use and am able to access Netflix, Hulu and of course Prime easily and without having a \"smart\" TV.  Also access HBO GO, but don't appreciate the lack of user-friendliness, but that's not the Fire Stick's fault.", "verified": true, "helpfulness": "0/0", "author": "Sunshine J. Smith"}, {"rating": 1.0, "review": "Didn't expect such a horrible and unfinished product from Amazon.Youtube : Youtube casting does not work. Youtube rental videos get stuck forever. Not sure if Amazon issue or Youtube.But after using the product for a week I am very certain it is Amazons mistake.Sling TV : Main reason for me to get fire tv stick.What a disaster. Every five minutes video stops and goes back to home page or just gets stuck. Insane.... it happens every five minutes.Yupptv : Dont want to talk about it.It just makes me very angry and frustrating. Just like sling TV, channels get stuck , nav goes back to home page, automatically channel changes ..all making your watching experience horrible.So if you are a person who wants to just WATCH and relax a tv channel or youtube video rental or videos this is NOT the product for you.What a shame...Amazon...  free or not this product is NOT worth.", "verified": true, "helpfulness": "0/0", "author": "JSK"}]