[{"rating": 5.0, "review": "This product the best I have owned. I have had the Roku and the Chromecast, and neither of them compared to the speed of the Fire Tv Stick.", "verified": true, "helpfulness": "0/0", "author": "prsims88"}, {"rating": 4.0, "review": "The Fire Stick is fast and worth the money", "verified": true, "helpfulness": "0/0", "author": "luda"}, {"rating": 5.0, "review": "Great!!! I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Cotto"}, {"rating": 5.0, "review": "I love this item...it is small enough and out of the way and we have never had an issue.", "verified": true, "helpfulness": "0/0", "author": "Rory"}, {"rating": 5.0, "review": "We just ordered this last month it was delivered just as promised and we have very good service from it no lag as other products have had in their reviews all I can say about it so far is it has worked even better than expected. I would recommend this to anyone wanting to stream to your tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the fire stick.  before we got it, we went into prime video thru our WII which was messed up.  the fire stick is much more simple to use without all the in between  things we used to have to do.  We are watching more prime movies and videos now.  much more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "P. J. hugill"}, {"rating": 5.0, "review": "love it! and  it's simple to connect.  I just wish it came with a keyboard on back of remote for typing, guess I will just order one from amazon", "verified": true, "helpfulness": "1/1", "author": "janet Robison"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "mary"}, {"rating": 5.0, "review": "I didn't plan on getting one.  I figured I didn't need it.  I watch Netflix and HBOgo on my laptop.  Then, I got one for my birthday and I quickly went into a tv/movie coma for a few days!  The picture is crystal clear.  It's easy to use.  Awesome!", "verified": true, "helpfulness": "1/1", "author": "CC"}, {"rating": 4.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Valentin Vasilev"}]