[{"rating": 4.0, "review": "Comcast does NOT support HBO access with the same subscription working on Apple TV.Responsive and has Amazon Prime Movies...plus Netflix, so good. Just check if your broadcaster is giving access to HBO on Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Breton"}, {"rating": 1.0, "review": "Don't bother buying the Fire Stick unless you have a brand new TV. We spent the entire evening setting it up to find out it flat out doesn't work on our TV. Really pissed off. Thanks for wasting our Saturday night, Amazon.We did a lot of reading before buying it and now feel rather stupid.", "verified": true, "helpfulness": "2/2", "author": "Diana \"lawyerlee\""}, {"rating": 5.0, "review": "Love it, worth the money", "verified": true, "helpfulness": "0/0", "author": "Michael Saralequi"}, {"rating": 5.0, "review": "I love this thing!", "verified": true, "helpfulness": "0/0", "author": "jayag71"}, {"rating": 5.0, "review": "This is fun, and a lot more convenient than my wireless blu-ray player.", "verified": true, "helpfulness": "0/0", "author": "T. Rathburn"}, {"rating": 3.0, "review": "Bought two of these to be able to playback movies from my NAS using a wifi router. It has been working more or less until the last update. Now all videos hang and just stop every few minutes for some reason. Something wrong with it.The playback for prime content is fine, no problem there. If you want to use it as a setup box, you might not get what you expected.", "verified": true, "helpfulness": "0/0", "author": "PTY_Buyer"}, {"rating": 3.0, "review": "You have to pay for all programs.", "verified": true, "helpfulness": "0/0", "author": "Omar Rodriguez"}, {"rating": 5.0, "review": "Use it all the time", "verified": true, "helpfulness": "0/0", "author": "Patricia Ruggles"}, {"rating": 2.0, "review": "I enjoy fire tv but im getting tired of the stick. The stick will repeatedly restart when i plug the usb into my tv's usb port. It inly works if i plug it into my xbox one usb.  shouldn't most tv's produce enough power to use the stick?", "verified": false, "helpfulness": "0/0", "author": "timothy"}, {"rating": 5.0, "review": "On order", "verified": true, "helpfulness": "0/0", "author": "James Raymond Thacher \"jamesrthacher\""}]