[{"rating": 2.0, "review": "Updating Review of Product, it has been a pain over the last few months, the remote stopped working.  Some of the more popular applications like Hulu and Netflix freeze and shutdown in the middle of a program.  I would not recommend and look at other better alternatives to use.  Waste of money.Great product, would highly recommend, it is a little hard to use at first but as time goes by the interface will improve.  Shipping was another story, it was delivered on a Sunday via USPS and left on my driveway near the road, not even brought up to the door.", "verified": true, "helpfulness": "0/0", "author": "Me"}, {"rating": 4.0, "review": "Wi Fi is very unstable. No issues with Apple TV, PS4 or Roku. Works fine for a while then loses connection.Update...After installing the HDMI extension the connectivity issues no longer exist.", "verified": true, "helpfulness": "0/0", "author": "D. Marley"}, {"rating": 3.0, "review": "Navigation around the offerings is clumsy.", "verified": true, "helpfulness": "0/1", "author": "Walter Skurda"}, {"rating": 5.0, "review": "Very fast streaming faster than my Roku stick. Quality product and worth the wait if you can't find one immediately for sale.", "verified": true, "helpfulness": "0/0", "author": "SustainAbility Man"}, {"rating": 5.0, "review": "Great device, especially if you are an Amazon Prime member.  Set up took maybe 8 minutes (even with the Fire Stick video).  Once shipped, it took less than 2 days to get here.  Everything you store in the Amazon cloud is basically accessible on this device (photos, movies, music, etc).  I probably will not play games using this device (not a gamer), but I do enjoy access to YouTube once again on my TV (which I cannot get on my Roku).  The $20 introductory price was also a great bonus.", "verified": true, "helpfulness": "1/1", "author": "E. Vincent"}, {"rating": 5.0, "review": "Just got mine yesterday and plugged it in right away. The setup was super easy and intuitive although the updated software took a long time to download. The weirdest thing was how hard it was to get the battery cover off to install the batteries the first time. It took me and my husband several tries to finally get it to pry loose - we were worried it was going to break. It has a little click every time you make a selection on the remote - I find it kind of oddly cute, but it might get on some peoples nerves.It would be nice if it had a light on the remote or the stick itself to show that it was actually turned on too. Other than that, it is a super simple way to do what it does. Nice sleek remote and little fuss to use.", "verified": true, "helpfulness": "0/0", "author": "S. High"}, {"rating": 1.0, "review": "The device constantly loses my wireless connection. The only trouble shooting it has suggests making sure the stick is not in a cabinet-it is not. It is in an open area 15 feet from my router. I've had it about a week, almost constant problems.", "verified": true, "helpfulness": "1/1", "author": "Ashley Watts"}, {"rating": 5.0, "review": "easy to set up and use it's amazing", "verified": true, "helpfulness": "0/0", "author": "Harry Carbonneau Jr"}, {"rating": 5.0, "review": "It's Great!", "verified": true, "helpfulness": "0/0", "author": "Cleveland Whitmore"}, {"rating": 1.0, "review": "When it doesn't glitch during playback the stick crashes. Very dissatisfied. Doesn't matter if I use the supplied power or not.", "verified": true, "helpfulness": "1/1", "author": "Brad Sommer"}]