[{"rating": 5.0, "review": "My daughter just loves this thing. Can't get her to put the kindle down while she is on it playing games. Don't know for sure whether she is supposed to have it or not. Lol. She really does enjoy it though.", "verified": true, "helpfulness": "0/0", "author": "Mzkey07"}, {"rating": 5.0, "review": "Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Dominic"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Shirrell Robinson"}, {"rating": 1.0, "review": "When it works, it's great! You can use Netflix or watch Amazon Prime anywhere you have an HDMI connection! The problem is I've had to reset this thing 15 times in a row before to get it working again. It works one second, then just keeps saying Netflix has encountered an error, forcing me to switch to another device to continue watching a show. The \"HD\" video is really 480p, from my experience, despite me changing the settings to 720. I bought this to replace a Roku I had and it's no better. Almost exactly the same video quality, except the menus on the Fire TV Stick are in HD.  Video buffering is an issue too, as almost every video starts fuzzy like a drunken night out.  Another thing I didn't like was that you have to plug the unit into a wall power outlet. I feel like that is glossed over in all the marketing.Amazon, I expected SO MUCH MORE. Disappointed doesn't describe well enough how I feel after using this for a few weeks.  I never write reviews and felt it was my obligation to do so, after using this. I will update this review, if they release an update that fixes the video and network connection problems. It's not my network as my Xbox One, PS4, iPhone, Roku, computes, etc. all connect to my network and work just fine. Amazon, going forward let's only put your name on quality products please!  I wanted you to be the cool high-spec device you appeared to be instead of this faulty piece of stick.", "verified": true, "helpfulness": "1/1", "author": "Karl Daniel Adrian"}, {"rating": 4.0, "review": "Easy set-up.", "verified": true, "helpfulness": "0/0", "author": "SS IN OK"}, {"rating": 2.0, "review": "Love it - but getting sick of Amazon's proprietary nature - it lets you think you can watch Netflix - but 8 times out of 10 it says there is a problem with the network. Then you switch to prime and you can watch anything. Clearly trying to block anything that is not sold thru Amazon.", "verified": true, "helpfulness": "0/0", "author": "Susan S."}, {"rating": 4.0, "review": "Love it., and the remote is a huge plus in my case. The only reason I gave four stars is because doesn't mirror with apple products (my Iphone and Ipad). Come on amazon you can do it..", "verified": true, "helpfulness": "1/1", "author": "R. Casado \"Rooiso\""}, {"rating": 1.0, "review": "From the reviews it appeared to be a good product but without an air remote it a waste of time. Not to my expectations", "verified": true, "helpfulness": "0/1", "author": "R S. Salandy"}, {"rating": 1.0, "review": "Still early on, but i dont know what all the excitement is all about, maybe it's just me?", "verified": true, "helpfulness": "0/1", "author": "Michael P. Terrick"}, {"rating": 4.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]