[{"rating": 5.0, "review": "i like it a lot, found it easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Rich.  A"}, {"rating": 5.0, "review": "works great, made my TV a smart TV", "verified": true, "helpfulness": "0/0", "author": "gerry"}, {"rating": 5.0, "review": "It works great I love it its easy to use", "verified": true, "helpfulness": "0/0", "author": "J.R"}, {"rating": 5.0, "review": "It done what we wanted", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 4.0, "review": "Great price for a versatile piece of hardware.  I only wish screen mirroring was more functional and accessible.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was so excited to get the fire stick and the delivery process was awesome. I have a different streaming device in my living room and wanted to be able to use firestick in my bedroom for  prime music especially. However, I am constantly having internet connection problems...it stops playing, has to refresh..whatever ...it is annoying...will check with my cable company speed and try again..I really want this to work...so until then only 2 stars for the easy setup, no I will give it three for the beautiful landscape scenes it shows while idle....that is a definite plus.......update.....fire stick is now a five star for me... The fix was to unplug both stick and power adapter, which reset the firestick...now it works amazingly well... I love all the apps...there is no buffering for my favorites, the beautiful landscape scenes that show while I use amazon music or when idle is top notch.. My guests are in awe...if hesitant about getting it.. Don't be.. This is better than another brand that I paid double for....I am actually thinking of leaving it in my living room..and getting more as gifts..I like this product that much...enjoy...go for it..you won't be disappointed..", "verified": true, "helpfulness": "0/0", "author": "Jean ct"}, {"rating": 5.0, "review": "The fire stick was way more than I expected especially with the party games and kindle compatibility with the imdb xray. Love the fire stick!", "verified": true, "helpfulness": "0/0", "author": "JDeeZy \"Jonathan\""}, {"rating": 5.0, "review": "I love the Firestick over the Chromecast. I own both. The advantage is due to the Firestick having more memory and space and a remote while the chrome stick does not the Firestick accepted my mobile phone hotspot more easily than the Google Chromestick. Both have their advantages but for me the Amazon Firestick wins hands down", "verified": true, "helpfulness": "0/0", "author": "Techgeekazoid"}, {"rating": 5.0, "review": "It's awesome,  it works flawlessly it goes hand in hand with the prime subscription...Love it!!!", "verified": true, "helpfulness": "0/0", "author": "R. M \"Volkan\""}, {"rating": 4.0, "review": "It was everything I needed it to be. Better than the Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]