[{"rating": 5.0, "review": "Simple enough to use! (I had to use the adaptor because the stick is too thick, and I couldn't push the stick into the HDMI slot. So I plugged the adaptor pigtail into the HDMI slot, and then the stick into the adaptor.  Instructions were easy enough to follow to sync the stick to my modem for wireless com.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Flipinsacto"}, {"rating": 5.0, "review": "Sideload KODI onto the unit, and it will be the best Media streamer on the Market.Bluetooth remote, Good interface, Great Prime support, and up to date Netflix app.Really blows away the Roku, and pretty much everything else in the price range.Supports 5ghz networks perfectly fine.Not a lot of internal storage, but I stream everything and I don't play games on this device. So no problem there.I have had to reboot it a few times. But can't say I've had a problem since they updated the device to the newest version. Along with me updating Kodi to the newest version. Otherwise I had a problem with KODI that would pretty much stop it from playing media with DD/DTS. And would require a reboot to fix. Haven't seen the problem happen since.Get this!!!! Would be a fool not to own one. I got mine for $20 when they announced it. With I picked up two, they are that good.", "verified": true, "helpfulness": "0/1", "author": "Drake Gould"}, {"rating": 5.0, "review": "Was a huge ROKU fan.  Tried this on a Slick Deal.  Got a great price on it.  It is now our favorite media player.  My Mac and iPhones and iPads all stream perfectly to it as well.", "verified": true, "helpfulness": "0/0", "author": "Auburn Engineer"}, {"rating": 3.0, "review": "Well, this is a great device, but I am really fed up with Amazon Prime Video and Amazon's shenanigans  in general. I will elaborate more at the end.Pros:The remote is solid and works well.There are a lot of compatible apps.It supports 5GHz.PriceCons:The interface feels really jumbled and unorganized at times.The device definitely appears sluggish at times. This is the Fire TV stick, so I suppose it's to be expected.Prime Video continually showing me things I have to pay for.So, my biggest pet peeve is Amazon constantly showing me shows/movies as part of Prime, but I have to actually pay for them. Even some new TV series are not free on Prime and require purchase...Seriously? I have not found a way to filter this either, so I'm constantly forced to navigate through crap I don't want to buy.I'm also tired of Amazon making such a big deal about using their service on other devices. If they keep this up, I plan on getting rid of Prime.", "verified": true, "helpfulness": "1/1", "author": "Flea"}, {"rating": 5.0, "review": "Plugged it in, turned it on, worked just as described. Replaced Chromecast with Fire stick. NO COMPARISON. Chormecast had stopped the ability to use Netflix and Amazon in streaming correctly. Fire TV has a remote that allows you to connect directly to programs thru WiFi instead of only thru the computer.", "verified": true, "helpfulness": "0/0", "author": "Richard Norton"}, {"rating": 5.0, "review": "Love this thing!  Skip cable/satellite.  Tons of content for all ages.", "verified": true, "helpfulness": "0/0", "author": "Ingrid Moser"}, {"rating": 5.0, "review": "Great little item...works great..", "verified": true, "helpfulness": "0/0", "author": "Rito Zuniga"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Gerhard Van Rooyen \"HendrinaCM\""}, {"rating": 5.0, "review": "It was effortless to set up & get working.  A lot of content & great quality!!", "verified": true, "helpfulness": "0/0", "author": "Gamer Larry"}, {"rating": 5.0, "review": "The power stick  was exceptional I am well please with it use.", "verified": true, "helpfulness": "0/0", "author": "warren mingleton"}]