[{"rating": 5.0, "review": "We can't imagine not having it!!!!", "verified": true, "helpfulness": "1/1", "author": "Jean"}, {"rating": 3.0, "review": "Amazon Instant Video eats bandwidth which is bad when you have limited amount per month.  Netflix allows you to use SD rather than HD. But I cannot find that feature on Fire Stick.  Love other features.", "verified": true, "helpfulness": "0/0", "author": "Harry McFarland"}, {"rating": 3.0, "review": "having problems.  so far not a great item, but I only paid $20 on sale, so can't complain too much", "verified": true, "helpfulness": "0/0", "author": "eb"}, {"rating": 5.0, "review": "This is a miracle product, one of the very best purchases  I have ever made for entertainment. I cannot recommend this highly enough.", "verified": true, "helpfulness": "1/2", "author": "Toonoot"}, {"rating": 5.0, "review": "This is a PHENOMENAL piece of technology.  Exceptionally quick.  the remote control that comes with it is small, intuitively SMART. ALL remote manufacturers could learn from Amazon how to build a SIMPLY ASTONISHING remote with little or no \"buttons\" to navigate EFFORTLESSLY.  It literally takes seconds to install, comes with an instructional video when you first use it (which is also available in the menu(s).  The menu's are child's play to navigate. In other words: it's utter simplicity is it's finest quality.  I have been a Netflix member for years.  The Fire TV Stick makes navigating Netflix extremely quick.  I had been using one of my blu-ray players to connect to Netflix.  The Fire TV Stick comes with Netflix.  Netflix loads almost instantly.  Virtually no time lags and I also use, subtitles.  Through my blu-ray player (hard wired) I had to CONSTANTLY pause Netflix to sync subtitles with lip movement.  Fire TV Stick does away with that.  Fast Forward / Rewind are virtually instant ... they move QUICKLY.  This is one of my best investments in electronics.  You won't regret it's purchase.", "verified": true, "helpfulness": "3/3", "author": "Dane"}, {"rating": 5.0, "review": "LOVE IT.  GOT THE STICK AT THE INTRO PRICE.  WORKS PERFECTLY.", "verified": true, "helpfulness": "1/1", "author": "Debbie Kepley"}, {"rating": 5.0, "review": "This was a Christmas gift and its is of of the best ever received.  I was worried it would be hard to set up because I am not very technical.  It was very easy to install.  I use it every day.  I would recommend this to everyone.  As a matter of fact I have shared it with many of my friends.", "verified": true, "helpfulness": "2/2", "author": "TwistyJ2"}, {"rating": 2.0, "review": "Issues connecting to both Amazon and the wifi.  worked once and hasn't been able to get to Amazon since.  :(Stick with a Roku, Apple TV, or Chromecast.", "verified": true, "helpfulness": "1/2", "author": "bettina H. Reeves"}, {"rating": 3.0, "review": "I already had a roku player prior to purchase.  The initial offer for this was $20 for prime members, so I thought I'd try it out to see if it offered some advantages for access to some prime features.  Being that is was an amazon product I thought there might be an advantage there.  Unfortunately there really isn't.  There is nothing I can do with this that I can't do with my roku.  I am particularly disappointed that I can't access prime radio stations with this.  That was the number one thing I was hoping for.  Also, you can only play prime music if you have already added it to your account from another device.To be fair, I am comparing this to an $80 roku.  For someone without a streaming device, this should work fine for general use while costing less than a roku box.  I do actually like the interface a little better on this.  I does a lot of things well for less money, so I don't want to dismiss that.  It's just that an Amazon device should allow you to access Amazon content.  I will still use it, but I didn't really gain anything over what I had.", "verified": true, "helpfulness": "0/0", "author": "Candlestickmaker"}, {"rating": 4.0, "review": "Almost as good as the Fire TV. Just wish it had more storage for games.", "verified": true, "helpfulness": "0/0", "author": "Kyle Morris"}]