[{"rating": 5.0, "review": "Much nicer than ROKU, more options than netflix.  worth it!", "verified": true, "helpfulness": "0/0", "author": "Douglas F Oppelt"}, {"rating": 4.0, "review": "Bought it primarily for hookup to large screen TV.  HDMI connector on Firestick would not fit into extra HDMI port in back of TV.  I tried it outon a smaller screen TV and it works fine.  I like the Firestick very much.", "verified": true, "helpfulness": "0/0", "author": "Sox Fan"}, {"rating": 4.0, "review": "easy to use and has many movies but would like more free old, old movie classics", "verified": true, "helpfulness": "0/0", "author": "lb"}, {"rating": 4.0, "review": "This is very entertaining we love it", "verified": true, "helpfulness": "0/0", "author": "claudette leslie"}, {"rating": 5.0, "review": "good as roku", "verified": true, "helpfulness": "0/0", "author": "Marco"}, {"rating": 5.0, "review": "Love this stick.lots of new stuff to watch on TV", "verified": true, "helpfulness": "0/0", "author": "Marie"}, {"rating": 5.0, "review": "Working great!! Super easy set-up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great device that I love to usePrice: 5/5Ease of use: 4.5/5Content: 5/5Price is in the sweet spot for me to recommend you buying. The price is more than a Chromecast but with this you receive a remote. This is major selling point for me. When I'm watching TV i want a remote not my phone. So it is perfectly priced for the included items with a charger that has a very long cord and a hdmi adapter in-case your faces out the back and you don't have room.Price: 5/5The included remote is simple to use and great for navigation. Device is a little sluggish compared the the Fire TV box but it works well and its priced well for it performance.Ease of use: 4.5/5The content is wonderful. you have HULU, NETFLIX, AMAZON PRIME, PANDORA, ESPN, and the list goes on and on. Honestly it was great out of the box with lots of support.Content: 5/5", "verified": true, "helpfulness": "0/0", "author": "Benjamin L"}, {"rating": 5.0, "review": "I used to have a Chromecast before giving it away.  I recently got the Fire TV Stick as a replacement and could not be happier.  I use it mainly for my Amazon Music (awesome in and of itself,) Prime Video, and YouTube.  I usually use the remote for browsing for something to watch, but if you are trying to type something in for a search, use your phone.  I use my phone when watching youtube videos, and love how easy it is to search and play videos.  I would absolutely recommend this to anyone wanting a \"smart TV\" without buying a new TV.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Anderson"}, {"rating": 4.0, "review": "i have no problem of connection.pros +- small and simple device design- easy to set up - plug & log in.- lots of contents are free to the prime members- youtube link- bought in low price for the special promotion before it actually released.cons -- buttons of remote controller are somewhat failed for UX aspect: buttons are top. rest of half is empty. some of buttons should be different size or colors.- lack of movie contents, and amazon doesn't store past movies for the prime members- lack of some of popular apps and contents- can't control/select screen resolution/size. some of contents can't get theater mode. only full size of screen.", "verified": true, "helpfulness": "0/0", "author": "jayuinhan"}]