[{"rating": 4.0, "review": "Nice screen menu and easy to navigate", "verified": true, "helpfulness": "0/0", "author": "Yobany Hernandez"}, {"rating": 5.0, "review": "Perfectly, it works in Ecuador, no problem", "verified": true, "helpfulness": "0/0", "author": "GUSTAVO JIJON"}, {"rating": 5.0, "review": "Very user friendly and easy to set-up and use! I love the way the interface looks and operates! Great!", "verified": true, "helpfulness": "0/0", "author": "GJP \"GJP\""}, {"rating": 2.0, "review": "In theory I think it is wonderful.  However, I seem to have extreme streaming issues.  I am not sure if it is the Fire Stick, my internet service or a combination of both.  I have managed to watch some items successfully and others buffer so much that I want to pull my hair out.", "verified": true, "helpfulness": "0/0", "author": "Dreaming of Beaches"}, {"rating": 5.0, "review": "Works so much better than my smart tv with so many more options. I love it!", "verified": true, "helpfulness": "0/0", "author": "Tara Hubler"}, {"rating": 5.0, "review": "Picks up WiFi connection better than smart tv and has more options to link to.", "verified": true, "helpfulness": "0/0", "author": "Geraldine A. Fallon \"Gerry\""}, {"rating": 4.0, "review": "Its fine", "verified": true, "helpfulness": "0/0", "author": "Francis de Jesus Perez"}, {"rating": 2.0, "review": "The stick doesn't seem to have much wifi range. It drops the signal even when the wifi is within 8 feet or says its not fast enough; however, the same wifi works great with chromecast so the problem seems to be with the stick.", "verified": true, "helpfulness": "0/0", "author": "John I Miller"}, {"rating": 5.0, "review": "Easy to set up and operate", "verified": true, "helpfulness": "0/0", "author": "Carl M. Unterman"}, {"rating": 1.0, "review": "Brought several of these, looks like most of them are having a problem.  The one's I gave to my family some don't work after a month of use, and I had two fire TV's, the stick and the box, within a month or so both of them went blank.  Amazon did replace them, so that's good, but I would not recommend buying them, I think it is not stable, and has some real problems with the software.", "verified": true, "helpfulness": "0/0", "author": "lisa feldman"}]