[{"rating": 5.0, "review": "Very easy to hook up. Kind of expected a few more movies to be available for free. Looks like you need the added expense of Amazon Prime, but their movies are not free either.", "verified": true, "helpfulness": "0/0", "author": "P. Hendricks \"Blues Lover\""}, {"rating": 4.0, "review": "The remote is easy to loose as it is so small, otherwise great product.", "verified": true, "helpfulness": "0/0", "author": "Brian Taylor"}, {"rating": 1.0, "review": "Fire stock just quit working.  Tried everything changing batteries did not work plugging and unplugging", "verified": true, "helpfulness": "0/0", "author": "Jennifer Schwartz"}, {"rating": 5.0, "review": "i absolutely love it, makes me give more thought I. Getting rid of my cable", "verified": true, "helpfulness": "0/0", "author": "Dezi"}, {"rating": 4.0, "review": "Not at this time", "verified": true, "helpfulness": "0/0", "author": "Roberto M Gonzalez"}, {"rating": 5.0, "review": "Just awesome. Don't have to use your laptop connected via cable to your tv to watch all your subscribed services. Just one remote and access to it all. It's well worth the convenience.", "verified": true, "helpfulness": "0/0", "author": "D. Garcia \"garciad\""}, {"rating": 5.0, "review": "Great product. Hours of enjoyment!", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 5.0, "review": "the best $39 I:ve ever spent", "verified": true, "helpfulness": "0/0", "author": "DENISE KAHLE"}, {"rating": 1.0, "review": "What a complete joke. This POS wouldn't connect to the internet no matter what I tried. All my other devices connected just fine. I got online and phone support from Amazon and I did everything they told me to do and it still didnt work. Then they tell me my wireless router needs to be within 2.5 feet of the stick for optimal performance?! Wtf is the point of wireless? Not to mention it said signal strength excellent but still wouldn't connect. After searching online, apparently this is a common problem. Nice job Amazon of having a junk product you don't fix. Save your time and go with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Laura T."}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Joni L. Boykin"}]