[{"rating": 5.0, "review": "WORKS GREAT AS ADVERTISED ,EASY SET -UP AND USE", "verified": true, "helpfulness": "0/0", "author": "ED PENNA"}, {"rating": 3.0, "review": "I'm gonna start by saying that i don't live in the US. I will also mention that as a direct result i cannot use most of the features of this device. No Amazon Video, no Hulu, no HBO or Showtime. No Pandora or Amazon Music. This thing is solely for Netflix, Youtube, Vimeo, TuneIn and the handful of entertaining apps i am allowed to install or use. But these apps don't work perfectly either, just well enough. Netflix has a weird audio sync issue with its programming. Youtube has it as well. Sound is delayed by .5 to 1 second. There are no instructions on what i should tweak on my TV if its a compatability issue.Pros:●The wifi works well●Apps load and work really fast●Remote ontrol is responsive enough to play a few games really well●setup was a breezeCons:○Regional restrictions on content (even on Amazon created content)○Annoying sound synchronisation issues.○Sleep function is hidden away in submenu○Lack of a digital manual (or do I need to look again? I may have missed it)", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 2.0, "review": "I subscribe to Amazon Prime and Netflix.  I was expecting the navigation to view both to be much easier.  I expected the fire stick to remotely sync up with my Kindle Fire HD so I could navigate from my tablet.", "verified": true, "helpfulness": "0/1", "author": "Curt W."}, {"rating": 4.0, "review": "I knew this was going to be a great product (having seen it online) but when I opened and plugged it in, it didn't even work. I contacted Amazon for a refund and the costumer service was great. I'm putting 4 stars because this is a great product, my unit was defective.", "verified": true, "helpfulness": "0/0", "author": "Yash"}, {"rating": 5.0, "review": "like it a lot", "verified": true, "helpfulness": "0/0", "author": "Wally Courie \"peace lover\""}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Not a bad product i thought i could just plug and watch never realised i had to sighn up for prime, Netflix, hulu plus and so on thats the only disappointment", "verified": true, "helpfulness": "0/0", "author": "cleave paul"}, {"rating": 3.0, "review": "Some of the apps don't open and unless you have prime it's really not worth it for me. No YouTube and the music on vevo takes forever to load if it even loads. Prime offers the exact same viewing options as Netflix.", "verified": true, "helpfulness": "0/0", "author": "Lisa Sullivan \"read and watch\""}, {"rating": 1.0, "review": "This is a terrible product. It constantly disconnects from my home wifi network causing disruptions in my viewing experience. My google chromecast never disconnects and works so much better. I was so excited to use this product, but I would discourage others from buying it until they correct its issues dropping its network connection. Google amazon fire tv stick drops wifi connection and take a look at everyone having the same issues. Don't buy this product until Amazon can figure out a solution to this.", "verified": true, "helpfulness": "1/1", "author": "Nicholas Cosmas"}, {"rating": 5.0, "review": "Didn't disappoint.", "verified": true, "helpfulness": "0/0", "author": "Lenny Spano"}]