[{"rating": 4.0, "review": "For some reason was thinking this one had voice search but just downloaded free app to phone to use the voice search option but Liking it so far.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 4.0, "review": "A great App, but the More Like This would be good, also, sharing, like Youtube would be good.", "verified": true, "helpfulness": "0/0", "author": "Edwardegrahamgmail Com"}, {"rating": 5.0, "review": "The Fire Stick met or exceeded my expectations except one.  There is no Dish Anywhere application.  Other 5han that, great.", "verified": true, "helpfulness": "0/0", "author": "William Powell"}, {"rating": 5.0, "review": "Love the fire stick. Have satellite but sometimes nothing on worth watching. Now I can watch a lot of great old movies.", "verified": true, "helpfulness": "0/0", "author": "DEBBIE CRACCO"}, {"rating": 3.0, "review": "I guess I had unrealistic expectations. I have a Roku already, I thought I would be \"more\". The Fire Stick makes the Amazon content look really amazing in HD, and maybe I can find the *Amazon content more easly, but that's about it. I can't watch YouTube on the Fire Stick - I can with the Roku.I'm keeping both the Fire Stick and the Roku... but gonna be using the Roku as my default.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "BlackAdam"}, {"rating": 5.0, "review": "was a gift and they love it", "verified": true, "helpfulness": "0/0", "author": "OZwife \"LovePups\""}, {"rating": 5.0, "review": "Love it!!", "verified": false, "helpfulness": "0/0", "author": "Sally"}, {"rating": 5.0, "review": "We love the Fire Stick for traveling.  It's compact, easy to hook-up to almost any tv, and offers the content we like to have while on the road.  It's great for our 5 year old as she can access her favorite games and kid shows.  We also use the stick at home connected to our office computer.  It's a great way to turn any LCD screen (with an HDMI port) into an entertainment center.  We also have an AppleTv and Roku, but we always find ourselves going back to the Fire Stick as our go to device.  Definitely worth the price.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Very nice, works perfectly. Would recommend", "verified": true, "helpfulness": "0/0", "author": "Christopher hall"}]