[{"rating": 4.0, "review": "I like this a lot. Just wish that it could be controlled by Amazon Echo. There are times when it acts funny and videos just stop at 2 seconds and the main menu opens. This happens several times in a row then eventually stops. I don't know what the cause is and it is not very common, but can be annoying. I like that when searching for a video that Hulu is included in the results as well as Amazon offerings. That is nice. Video quality is very good too. I still have chromecast for google play videos, ultraviolet, and casting of my laptop screen. Thankfully I have enough HDMI ports.", "verified": true, "helpfulness": "0/0", "author": "Jim Raynor \"Vaio CW guy\""}, {"rating": 5.0, "review": "I love it..", "verified": true, "helpfulness": "0/0", "author": "Donna McElroy"}, {"rating": 5.0, "review": "This device relegates Chromecast to the dust bin of history.  You no longer need to run TV apps through your phone.  People can access a TON of TV shows, movies, music, etc. directly from the stick.  You can take your phone with you while folks at your home can watch TV.  Also, with the stick, there is virtually no reason to continue to spend $75/mo on satellite or cable TV.  I love the stick!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Cloudcroft Girl"}, {"rating": 5.0, "review": "SO FAR SO GOOD. I WILL EVENTUALLY GET 2 more.", "verified": true, "helpfulness": "0/0", "author": "mary sue richey"}, {"rating": 1.0, "review": "If you have dish network ... do not buy this  fire stick.. also when using the 30 day trial period or maybe even purchasing amazon prime .. do not expect to get all movies in HDMI.. they charge you more money in order to get HDMI FOR MOST MOVIES!! .. PLUS THE $100 COST .. with DISH NETWORK WI-FI ....EVERYTHING IS HORRIBLY SLOW!!!! ... WE ALL SHOULD HAVE BEEN WARNED ABOUT THIS FLAW!!!! .. hope this helps .. screw you dish network / amazon prime!!!!", "verified": true, "helpfulness": "1/2", "author": "rob"}, {"rating": 5.0, "review": "Truly amazing.  So simple to use.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Amazon continues to amaze me. The products and services are outstanding! The Fire TV Stick is one of those outstanding products.", "verified": true, "helpfulness": "0/0", "author": "Don Ames"}, {"rating": 4.0, "review": "I have had the Fire TV Stick for just a few days and so far it appears to be working as advertised.  However, I have not been able to access the music which was one of the reason for ordering this product.", "verified": true, "helpfulness": "0/0", "author": "Carlos E. Galvez"}, {"rating": 5.0, "review": "Great addition to my Amazon Prime!! Having this is like having unlimited entertainment. I have found shows that I had never heard of before.", "verified": true, "helpfulness": "0/0", "author": "Cali Book Worm"}, {"rating": 3.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "K. Cashman \"xboxer\""}]