[{"rating": 3.0, "review": "Not as easy to hook up as the commercials would have you believe. It comes with a small \"extension cord\" which gives you a couple extra inches to try to make it to an outlet. However, if you don't have one pretty close, then you have to use an actual extension cord, which I can't imagine is too good, and it looks like tacky. I have a power surge strip connected to my outlet by the TV but still had to use the extension cord that came included and the power strip now hangs off the floor by several inches, it looks stellar. Do you notice none of the photos show cords hanging off the stick? Yeah. Exactly.I got it because I want to be able to watch Amazon Prime movies and my Apple TV doesn't support that, since Apple likes to make it nearly impossible to use anything but their products. It did work immediately upon plugging in, it recognized my account without requiring me to enter the information, which is nice. I am interested in seeing the \"free\" movie selection that Amazon Prime offers, to see if this pays for itself over time. It wasn't expensive, which is refreshing, butif their selection is as limited as Netflix, then it's somewhat pointless to have.", "verified": true, "helpfulness": "0/0", "author": "DK \"TBlythe\""}, {"rating": 5.0, "review": "My TV has rabbit ears. I get the three channels that I watch, very clearly. Why do I need this thing?I watch NETFLIX on my Kindle Fire HD and Prime movies too. Why do I need this thing?I looked at the reviews on Amazon and saw how many there were and I got curious. Can that many people be that thrilled about this thing?Saw that it wasn't available until Feb 2015 so I put it on my wish list. I waited and read more reviews, wish list is free and easy to change.Curiosity finally got the best of me and I ordered it. Got a shipping date. Got a new shipping date. Waited for the postman to deliver on my new promised date. Didn't happen.The next day it came. I opened it and stuck it on my TV and plugged in the power. Nothing. Did I get a broken one? Are all those people lying?Checked my TV and discovered I had not selected the correct input for the TV. Fixed that and got a picture of this thing asking me to log into my WiFi. I did.THIS THING IS AWESOME. I have been living under a rock. Why didn't someone drag me by the neck and make me get one of these things before. Maybe they just couldn't find my rock.I am glad I didn't get cable, this thing has more stuff than I will ever watch and except for the initial cost is basically free. I know the WiFi is not free but I use that for other things so for this it is free.", "verified": true, "helpfulness": "0/0", "author": "night player"}, {"rating": 5.0, "review": "I love the ability to never have to pay for cable again.  And it's pretty darn easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "D"}, {"rating": 5.0, "review": "Day one: came home at 9:45 and by 9:48 was already watching netflixDay two 845 AM: I returned my GoogleChomecast to Bestbuy.Day three: I ordered Amazon Fire TV and Fire remote", "verified": true, "helpfulness": "0/0", "author": "Brett"}, {"rating": 5.0, "review": "This product is the best; all the perks of a smart TV in a small portable stick! I tried Chromecast (Google) first and there is no comparison! The Chromecast has a single bandwidth whereas the Fire TV stick as dual... please not waste your time for a few dollars less... Fire TV stick is the way to go!  I will be ordering another Fire TV stick- everyone in my household LOVES this product! Good job Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer SZ"}, {"rating": 5.0, "review": "This small sea shell sized device is just the coolest thing! I have gone through quite a few little Android streaming devices. This one by far works the best. I have also tried some higher end media streamers as well. I won't say that this works better but but it does hold it's own. You can side load apps such like Kodi as I did that lets you can stream near anything you want along with the built in apps on the stick. I also paired a mini blue tooth keyboard to make searching on the device simpler. I think I am going to get another plus a Fire TV I like it so much.", "verified": true, "helpfulness": "0/0", "author": "S. Skolout"}, {"rating": 4.0, "review": "This is a pretty great little streaming device. As far as performance I'd say it is better than the Chromecast and not quite as good as the Roku 3. The Interface is real sharp and works great and the remote works well as well. I couldn't quite give it five stars since it has frozen and bugged out a few more times than the other streaming devices I own, but it still works well a very large amount of the time.", "verified": true, "helpfulness": "0/0", "author": "Joseph Hawkes-cates"}, {"rating": 1.0, "review": "Set up was confusing. Even though I have a amazon prime sigh in, it didn't work. Had to use a trial sigh-in to start using it. Went on the website, and that was more confusing. I've used Roku, and that was a breeze.  The product didn't come for a month.", "verified": true, "helpfulness": "0/1", "author": "Christine"}, {"rating": 5.0, "review": "The Fire Stick is very easy to use. We are not very tecki and we were able to get it set up right away. We love it! It makes selection of movies and TV very easy. I highly recomend it.", "verified": true, "helpfulness": "0/0", "author": "DjBessett"}, {"rating": 3.0, "review": "Bought it at the promo price and am happy with it for that price.For about a month I went back and forth between this and the Roku LT I already had.  Right now I'm running the Roku.If this was my only device I'd use it no problem.  But the Roku remote is a delight and is not (stock) limited to the Amazon Appstore.", "verified": true, "helpfulness": "0/0", "author": "FraterMus \"FraterMus\""}]