[{"rating": 5.0, "review": "The Fire Tv Stick surpassed my expectation's. Best streaming stick on the market. The apps are great and there's so much you can do that others can't. Other companies will surely imitate this product just know amazon was the first (mainstream) to provide such a great product.", "verified": true, "helpfulness": "0/0", "author": "Santana"}, {"rating": 3.0, "review": "The content is wonderful. The problem is the stick, it was hard to get into our HDMI port. Now I had to buy a switch to get other hdmi to work.", "verified": true, "helpfulness": "0/0", "author": "Jimi P"}, {"rating": 4.0, "review": "I'm still learning what this can offer, but so far I'm very pleased with it.  It doesn't seem to require too much bandwidth to stream a good picture.  The packaging was very nice and initial setup pretty easy.  I've signed up for Sling TV and have used Pandora multiple times.  One of the big draws for me was Amazon Prime Video streaming, but I really haven't used it yet.  I have streamed some music from Amazon, which worked well.  Remote integration so both the TV and Fire Stick could be controlled from one device would be a great addition.", "verified": true, "helpfulness": "0/0", "author": "JustAGuy"}, {"rating": 4.0, "review": "5 Stars if remote was bigger for those with bad eyes. Easy-peasy setup", "verified": true, "helpfulness": "0/0", "author": "KarenH"}, {"rating": 5.0, "review": "Easy to use, easy to set up. We purchased this for our son's room, in lieu of cable. We have Roku boxes for our other TV's. This was significantly less expensive and works just fine. I don't anticipate this getting anywhere near as much use as, say, the family room TV; but for the one show a day allowed in his room it's great.", "verified": true, "helpfulness": "0/0", "author": "A. Rhodes \"Anne\""}, {"rating": 5.0, "review": "Easy as pie and love it", "verified": true, "helpfulness": "0/0", "author": "porsche996"}, {"rating": 5.0, "review": "Very easy to use and works great! We will be getting them for all of our televisions.", "verified": true, "helpfulness": "0/0", "author": "kelly"}, {"rating": 5.0, "review": "At the moment I use it only to stream Netflix and I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Danapel"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Mr Kyle J Maas"}, {"rating": 5.0, "review": "I love that I have access to so many movies and tv programs. I can't wait until the list grows even bigger. It is already huge! There are so many awesome titles!!", "verified": true, "helpfulness": "0/0", "author": "Lynn Hill"}]