[{"rating": 5.0, "review": "Spectacular deal for $19. Would still purchase for $39. Another good Amazon product", "verified": true, "helpfulness": "1/1", "author": "Grant"}, {"rating": 3.0, "review": "My God let me skip this stupid video...", "verified": true, "helpfulness": "1/1", "author": "Mike"}, {"rating": 5.0, "review": "Wow, great things do come in small packages! Only 10 minutes using it but I am impressed. Of the dozens of things I've ordered from Amazon this is the first one i'm taking the time to review.", "verified": true, "helpfulness": "1/1", "author": "A. W."}, {"rating": 5.0, "review": "I received my Fire TV Stick today and love it! Its small footprint and versatility are matchless at the moment.", "verified": true, "helpfulness": "1/1", "author": "Kevin"}, {"rating": 5.0, "review": "Very happy with my purchase. I wish I bought more @ $25 each!", "verified": true, "helpfulness": "1/1", "author": "emily robbins"}, {"rating": 1.0, "review": "Given the amazing deal I ordered 2 sticks @ $20 and was really looking forward to using the sticks once I finally received them.Oddly enough once I connected them to my Emotiva cinema processor and directly to my 2010 vintage Panasonic plasma TV nothing happened. Once I swapped out the Amazon power supply with an iPad PS the sticks would boot. After that exercise I could successfully boot up the sticks with the original Amazon PS. Go figure!Once I got to the configuration menus the sticks would insist on updating their firmware. Nothing much would happen and after a while the download would time out and I would have to reenter the entire network configuration data. My 10 MBit/sec. Internet connection is fast enough to support HD streaming on my Amazon Fire TV box but too slow to download the sticks' firmware? I dunno...Returned to Amazon without any issues.", "verified": true, "helpfulness": "0/2", "author": "walterj \"walterj\""}, {"rating": 5.0, "review": "Working as advertised", "verified": true, "helpfulness": "1/1", "author": "Shane Barrows"}, {"rating": 1.0, "review": "The picture doesn't show that you have to have a power supply hooked up to the stick.  VERY disappointing.  The layout is bad when the menu comes up.  Roku is set up much better.  Bought this a couple of months ago for $19.  That is the only reason I'm keeping it.  If I had to do it over again, I would buy a Roku.", "verified": true, "helpfulness": "2/4", "author": "Brian Rose"}, {"rating": 5.0, "review": "It works great right out of the box.. I bought it to watch Prime in my bedroom. Plugged it in and it works perfectly.", "verified": true, "helpfulness": "1/1", "author": "Mr Johnson"}, {"rating": 2.0, "review": "I am a little disappointed by the quality after a few days of usage.Firstly, the wifi problem. It kept having problem with wifi even though it shows signal strength as good. My other computers right next to it have no issue with wifi. This is very annoying since it renders the device useless.Secondly, the user interface needs some improvement. It is not as intuitive as Apple TV I also own. The left side choices appear as confusing as it can get. What the heck is the difference among these TV, video, prime, etc.?Thirdly, the remote feels cheap. You know what I mean when you use Apple TV at the same time.", "verified": false, "helpfulness": "1/2", "author": "H. W"}]