[{"rating": 1.0, "review": "It worked for one day and has not worked since I will be returning it.", "verified": true, "helpfulness": "2/2", "author": "princess"}, {"rating": 4.0, "review": "Still trying to figure out how to use it to transfer programs, channels from my kindle fire 7hdx to the tv.", "verified": true, "helpfulness": "0/0", "author": "Nan"}, {"rating": 5.0, "review": "Never been much of a tech guy but when my brother gave me the firestick i never heard of it. Was amazed how easy it was to setup just plugged it in and it was ready to go out of the box all you need is a wifi connection and about 10mins for it to update.  If you dont i would highly recommended getting netflix, hulu, and amazon prime.  All of which make this device worth way more then the 40 price tag. Its a must have you really out done yourself amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Al Perez"}, {"rating": 5.0, "review": "Easy to hook up, simple user interface. Even wife can use it with out getting lost in the menu. Only issue is searching for a movie, but I just add to my list on my pc when I find one and just shows up in my watch list.", "verified": true, "helpfulness": "0/0", "author": "scooterXXX"}, {"rating": 1.0, "review": "clunky UI, not as versatile as chromecast.", "verified": false, "helpfulness": "1/1", "author": "Eric C. Januar"}, {"rating": 5.0, "review": "Works very well. It is 99% as good as my Fire TV box but a fraction of the size!", "verified": true, "helpfulness": "0/0", "author": "Craig"}, {"rating": 4.0, "review": "I have my Fire TV Stick plugged into a Yamaha AV receiver with throughput to a HD projector. Image quality looks flawless on a 100 inch screen. Some apps have slight playback hiccups when you are streaming with the fire tv stick and navigating (controlling the app the fire tv stick is streaming) with a smart phone or tablet. I didn't have any trouble connecting to my wireless network and streaming was perfect when I was letting it play and not having it do two things at once.Many apps need better integration with the fire tv smartphone/tablet app. The app has a touch keyboard to input into fire tv but many apps do not have the ability to take inputs from this keyboard. There also needs to be better integration to get everything (instead of just some things) on a tablet to display on the fire tv stick. Overall I was able to get my Kindle to control the fire tv stick better than the remote can and that is a good thing.Biggest negative is the HDMI extension cable that came with the fire tv Stick DOES NOT WORK. Shipping cables that are easily checkable at the factory that do not work is pretty unforgivable so - 1 star for that. HDMI cables need to have plastic caps on both ends at all times while they are unplugged to keep foreign material from getting into the end connectors, this one did not. Plugging the stick straight into the receiver got it working but the usb power cord now prevents me from plugging anything into the HDMI slot next to the fire tv stick.If you have a kindle or smartphone that can control this then it is better than appletv, chromecast, and roku. If not, its still way better than roku and appletv but chromecast might be better if your entire ecosystem is google OS (I personally prefer this controlled by my kindle over my chromecast controlled by my Samsung tablet but that is a personal preference issue). I also don't have to live with the short comings of any of these devices because I have an HDMI cable from my computer hooked up as well so anything these things cant do I can boot up my computer and have it do (its pretty stupid that you can stream something for free on a computer but have to pay for hulu plus or some other service to stream that same media, from that same service in an app and a Silverlight/java browser would let you access the whole web instead of just a fraction of it).", "verified": true, "helpfulness": "2/2", "author": "A. Smith"}, {"rating": 5.0, "review": "By far the best when I compared to all the other devices. Easy to install and use. Very reliable device and I've used it on 4 different model with two of them not being smart televisions and it worked great. I'm glad I bought it on Black Friday and got an amazing deal. Highly recommend it!!", "verified": true, "helpfulness": "0/0", "author": "Madelyne Portalatin"}, {"rating": 5.0, "review": "Amazon puts the \"FIRE\" into TV Watching!!!", "verified": true, "helpfulness": "0/0", "author": "Thomas M. Edmondson"}, {"rating": 5.0, "review": "WONDERFUL!!", "verified": true, "helpfulness": "0/0", "author": "Sue MacRae"}]