[{"rating": 1.0, "review": "It would not plug into my TV.  Waste of $39.", "verified": true, "helpfulness": "0/0", "author": "rancher"}, {"rating": 4.0, "review": "It is cool and easy to hook up. I am electronically challenged and had no problem.", "verified": true, "helpfulness": "0/0", "author": "Sue Novak"}, {"rating": 4.0, "review": "Finally able to get Prime on our older Samsung", "verified": true, "helpfulness": "0/0", "author": "Melissa Dec"}, {"rating": 1.0, "review": "Tried It Would not connect to Netflix. Set up A&E; & History Channel and everything I wanted to watch cost money. Didn't Have to do any of that with my Roku Box. Watched Netflix, & Storage Wars, & Vikings didn't cost me a dime. Sorry Amazon.Horrible purchase went back to my Roku and am going to purchase their stick.", "verified": true, "helpfulness": "0/0", "author": "capn21"}, {"rating": 5.0, "review": "Better than I thought it would be.", "verified": true, "helpfulness": "1/1", "author": "Zeke Guerrero"}, {"rating": 5.0, "review": "It's perfect to just view movies and tv right on my television.", "verified": true, "helpfulness": "0/0", "author": "Brian McBeth"}, {"rating": 5.0, "review": "It covers my expectatives about tv with internet", "verified": true, "helpfulness": "0/0", "author": "Jorge S."}, {"rating": 5.0, "review": "Love it! Can easily watch what I want or play games. It has lots of capabilities that I haven't even tried yet. Planning to take it on vacation, so the kids will have endless things to watch without lugging discs or all of their devices.", "verified": true, "helpfulness": "0/0", "author": "SC Dad"}, {"rating": 4.0, "review": "Best streaming media stick on the market but lacks everything to replace streaming blu-ray player. Excellent speed, size, and best quality.  There is NO Disney movie anywhere app for Disney/ Marvel content and there is NO VUDU access to purchased digital copy's in Ultraviolet library. Flixster app falls far short for viewing and streaming via UV library; poor quality, app design, and doesn't allow for Disney library items to be accessed.", "verified": true, "helpfulness": "1/1", "author": "Nancy Klimper"}, {"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Wanda Shelton"}]