[{"rating": 1.0, "review": "This is the biggest failure on Prime day that will leave a bad test in mouth!", "verified": false, "helpfulness": "4/11", "author": "T. PANDYA"}, {"rating": 4.0, "review": "We use it all the time and we really like it. However, keep in mind that the firestick only works as well as your wireless internet connection. We live in a rural area and have really crappy internet; thus anytime we try to watch anything, the connection is constantly interrupted. But this isn't Amazon's fault, and it really is a brilliant product.", "verified": true, "helpfulness": "0/0", "author": "KCFAM"}, {"rating": 3.0, "review": "It's alright, but I think I prefer Chromecast more. The twitch interface on the fire stick is really boring, I can't even watch the streamers I'm following. Plus this stick won't connect to my 5ghz wifi.", "verified": true, "helpfulness": "0/0", "author": "Joey"}, {"rating": 2.0, "review": "I really wanted to love the Fire TV Stick -- great price point, there are options for downloading a number of apps (free and paid), easy to use and install -- for those reasons, I give this more than one star.  The issue I have is that even though I have a TV with HDMI ports, a fast WiFi connection, HD, etc. we cannot watch any videos, movies, etc. from Amazon Prime, Netflix, HBO Go, etc.  I can only get the audio while a blue screen shows an HDCP error message (but the ads and commercials come in just fine).  From what I've read online (not through Amazon), this is an issue because our TV is not new enough.  Total bummer.", "verified": true, "helpfulness": "0/1", "author": "ColieCO"}, {"rating": 5.0, "review": "This thing is sooooooo awesome! As soon as I figure out the difference between it and the fire TV I might get that, too. We already have Chromecast and don't get me wrong, I love that too... But there's so many options here. My only frustration would be pauses during play or a long time to boot an app or program whereas neither ever happens on Chromecast.I like the control from my devices with Chromecast but prefer the remote with Amazon Fire because you don't have to worry about getting your screen up before pausing or rewinding something.", "verified": true, "helpfulness": "0/0", "author": "MrsC"}, {"rating": 4.0, "review": "Works as expected.  Decent enough of an interface.  Sometimes the interface is slightly sluggish and hd videos has to catch up and you will see a few frames go ff.  These issues might be related to my wireless and not the device.", "verified": true, "helpfulness": "0/0", "author": "bbridge"}, {"rating": 1.0, "review": "Wait list", "verified": false, "helpfulness": "3/10", "author": "Loves books"}, {"rating": 2.0, "review": "I was already to spend money like it was black Friday and my first item was the Fire stick and I can't even put it on the waitlist because it's full. So I just saved a bunch of money by not buying anything. I guess that's good for me , but not so good for Amazon.", "verified": false, "helpfulness": "4/9", "author": "Steven E Phillips"}, {"rating": 5.0, "review": "Inexpensive, easy to set up and use, a great way to get Amazon prime TV, Netflix, Hulu, and more on my tv!", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Easy to setup and use and has much more than my google chrome.", "verified": true, "helpfulness": "0/0", "author": "Margaret Donahue"}]