[{"rating": 5.0, "review": "Great purchase/value as the kids love it and so do my wife and I . Fire Stick is much better that Chromecast in my opinion and it was so easy to install and begin. I  will be buying three more for my daughters bedrooms. As always, Amazon had it to my house in two days as promised with my Prime membership. I recommend that everyone become a Prime member as the free content on Amazon for Prime members is amazing.", "verified": true, "helpfulness": "0/0", "author": "Bradley E. Elzeer II"}, {"rating": 5.0, "review": "So happy with Fire TV Stick that we own two!", "verified": true, "helpfulness": "0/0", "author": "Barb OC in CT"}, {"rating": 4.0, "review": "Great stick for the price", "verified": true, "helpfulness": "0/0", "author": "Shane Jenkins"}, {"rating": 5.0, "review": "It's actually BETTER than a smart TV.  We bought a smart TV to get netflix, hulu, amazon, etc. and I am now using the fire stick with it.  Why? Because the terrible software updates and errors loading apps finally broke me.  I think every other time I turned my TV on, either an app wasn't working or an update needed to install.  RIDICULOUS.The fire stick is easy to use (my 4 yr old uses it), has an easy user-interface, and has all the basics apps on it to meet our needs.  We even took it with us to a hotel (perfect compact size to travel with) and signed into their internet and watched our shows on vacation.I would highly recommend this to anyone who has given up cable (which should be a majority of us by now ;) and is streaming their TV shows/movies on a regular basis.  My brother also figured out how to \"unlock\" his to do even more than it was intended too; I'm not quite savvy enough to do that yet.", "verified": true, "helpfulness": "0/0", "author": "Laly P."}, {"rating": 3.0, "review": "Not entirely the most reliable streaming device, but it does the trick.", "verified": true, "helpfulness": "0/0", "author": "Lstfn"}, {"rating": 5.0, "review": "great !!!!!", "verified": true, "helpfulness": "0/0", "author": "Chip"}, {"rating": 5.0, "review": "Love the fire stick. Much better than satellite or cable", "verified": true, "helpfulness": "0/0", "author": "j.schrack"}, {"rating": 5.0, "review": "I reall like my Fire TV Stick it makes it really easy to get free movies from my Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "maggie9227"}, {"rating": 2.0, "review": "All the expected apps. Hard to navigate and find the content you want. The games are unnecessary. MLB.tv app runs so poorly that it's not worth watching a game. Hulu app is not as bad, but still frustrating with constant buffering and stalls. Netflix works like a charm. Music app is good.", "verified": true, "helpfulness": "0/0", "author": "james bryan"}, {"rating": 5.0, "review": "I've been cable depended for quite a while but the Fire TV Stick has opened up a new world to me. I've used it for over a week now and I have no complaints. I'm finally ready to get rid of cable.", "verified": true, "helpfulness": "0/0", "author": "H. Gibbs"}]