[{"rating": 5.0, "review": "Loved it and had to buy a 2nd", "verified": true, "helpfulness": "0/0", "author": "lolu"}, {"rating": 5.0, "review": "Love the Fire Stick! Much better than the Chromecast we purchased last year. We have added a Amazon Prime membership and a Netflix account and love it so much we are getting rid of cable. The remote control is kind of cheap feeling like others have said but we use the app on our iPhones to control it anyway. I would recommend the Fire Stick and cutting cable all together!", "verified": true, "helpfulness": "0/0", "author": "Rick byrd"}, {"rating": 5.0, "review": "Ok I just got this and LOVE it...it was easy to install...made my TV images much clearer...and I can get to all my tv programs and movies way faster. The price was good...and the delivery speedy", "verified": true, "helpfulness": "0/0", "author": "c"}, {"rating": 4.0, "review": "The firestick is great but my internet is to slow, so I have to upgrade my internet speed to realize the full benefits.", "verified": true, "helpfulness": "0/0", "author": "BANGER"}, {"rating": 5.0, "review": "No freeze", "verified": true, "helpfulness": "0/0", "author": "LaJuan Spivey"}, {"rating": 5.0, "review": "Very impressive.  The ease of set up and activated to my account was great. The remote makes navigation quick, however it is a bit on the small side for big hands. We have used it daily since it arrived! All in all, glad we have it.", "verified": true, "helpfulness": "0/0", "author": "abarney"}, {"rating": 5.0, "review": "This is just awesome, exactly what I was looking for.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it 😁", "verified": false, "helpfulness": "0/0", "author": "annahkay thomas"}, {"rating": 3.0, "review": "It's good if you like all the junk that's on cable. I find myself going to the same few things I watch on cable. And the good stuff all costs money. Unless you pay for Hulu plus, its pay as you go. Even with huku, I still have to pay for some popular shows.", "verified": true, "helpfulness": "0/0", "author": "J. Browning"}, {"rating": 4.0, "review": "Just received it but I like it.", "verified": true, "helpfulness": "0/0", "author": "Matthew Holbrook"}]