[{"rating": 5.0, "review": "Love it so far. I listen to Pandora, watch prime, although wish the list of movies included in prime was longer. I'll just use Netflix.", "verified": true, "helpfulness": "0/0", "author": "BroniB"}, {"rating": 5.0, "review": "Love the fire stick!  Set up was a breeze and it's so easy to use.  It's my new go to gadget!", "verified": true, "helpfulness": "0/0", "author": "M. J. Mears"}, {"rating": 1.0, "review": "Ours worked for a moth, but now won't register with the TV. Can I get this replaced via Amazon.", "verified": true, "helpfulness": "0/0", "author": "Shayna R. Adler"}, {"rating": 4.0, "review": "Its good so far", "verified": true, "helpfulness": "0/0", "author": "Donn Swiney"}, {"rating": 5.0, "review": "I love it. It's amazing. Buy one or two", "verified": true, "helpfulness": "0/0", "author": "Sam Bates"}, {"rating": 5.0, "review": "Love the fire stick.  However, the app to turn my cell phone into a remote screwed up my cell phone.  Even after deleting the app, phone not correct.  It deleted some apps pre installed on the phone by LG.  Now I have to back up everything and reset to factory specs and hope that it not only restores the missing apps, but that I can get my contacts, pictures and other stuff back again.", "verified": true, "helpfulness": "1/1", "author": "linda maguire"}, {"rating": 3.0, "review": "Yes it is pretty good so far", "verified": true, "helpfulness": "0/1", "author": "leta kubo"}, {"rating": 5.0, "review": "Beyond what I  expected my family loves it.", "verified": true, "helpfulness": "0/0", "author": "Wendy"}, {"rating": 5.0, "review": "We LOVE having Amazon Prime TV at our fingertips and this cool gadget made our TV smart, which is awesome. Pictures are misleading, The Fire Stick needs plugged into the wall for power.", "verified": true, "helpfulness": "0/0", "author": "AlysssaL \"AlysssaL\""}, {"rating": 4.0, "review": "Excellent product!  It found my WI-FI easily and connection was a snap.  Since it was already registered to my Amazon Prime account, my movie/ TV show list was immediately available.  Adding apps like Netflix, Showtime and others were without issue as my Internet and TV service is currently UVerse.  So far this device has provided me with several hours of viewing in any location that I choose.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]