[{"rating": 5.0, "review": "I love it. 0 problems. Great with amazon prime.", "verified": true, "helpfulness": "0/0", "author": "LD Garcia"}, {"rating": 1.0, "review": "Despite advertised claims of its compatibility, I received a blue screen with message \"HDCP UNAUTHORISED. CONTENT DISABLED.\" when I tried to watch any Prime videos. Worked with Fire TV techs from Amazon who, despite earnest attempts, could do nothing to solve the problem. It's not their problem anyway; it's Amazon's false advertising.I am returning. Don't buy it unless you have witnessed it working on the same model TV you have.", "verified": true, "helpfulness": "0/0", "author": "J. Briggs"}, {"rating": 5.0, "review": "Awesome product. I got this at half price even! I have zero complaints and I love the starter video!! Super fast and easy to install. Runs great!", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 4.0, "review": "I think this is great I have Amazon prime and with the screen saver you can use your pics that you uploaded into your amazon cloud drive. Also it is pretty fast. Not as good as the Box but better then the roku 3 I feel. I just wished that when using it for voice search it would cross reference all your apps not just Amazon. Honestly I prefer Nexflix over Amazon prime. If it was not for the unlimited cloud drive storage on pics and music I would not be a prim member. I feel the videos aspect of prime is a waste of money you can get way better selection on Nexflix many times Amazon wanted to charge me for movies or tv shows because they were not on prime but it was free on Nexflix bad on you amazon one star for your prime video. Sorry about the tangent but it needed to be said because this amazon stick and box is designed for prime and the other apps are just there it should open to the apps and you can select Amazon if you choose but it has a crowded interface that really only highlights amazon. It has good on processor speed and memory so until roku gets off their butts it is the best choice.", "verified": true, "helpfulness": "0/0", "author": "Oki Dragon"}, {"rating": 5.0, "review": "This works amazingly fast!!  We used to watch Netflix, etc. through our Xbox and this is WAY faster with downloads, etc.  Very happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "GrahamFam"}, {"rating": 4.0, "review": "We love the Amazon Fire TV stick and since getting it rarely use the XBox 360 unless we need to play a DVD, it's just way too slow now. Unfortunately our remote died today after having it less than a month, not sure what happened there. There's an app for iPhone to control it so that's what we use.", "verified": true, "helpfulness": "0/0", "author": "David Underwood"}, {"rating": 5.0, "review": "Purchased this when it was special pre-deliver priced. And I had been using Google TV for Netflix and Amazon - thru the Sony BD player that originally introduced Google TV. I was one of those early adopters. Well, I absolutely love this Firestick. So so so much easier to navigate than the remote that came with the original Sony Blue Ray box. That remote was so \"uncomfortable\" to use - actually it was more a chore. The Firestick is so much easier to use and the navigation between the various apps is easy and smooth. I do not use the Sony Google TV box now - only for watching Blu Ray DVD's - but otherwise, PBS, Netflix, Amazon Prime - it's the Firestick!", "verified": true, "helpfulness": "0/0", "author": "J. Hovey \"joho\""}, {"rating": 4.0, "review": "Love the device and pretty much everything about it.  I am ONLY disappointed that it must be plugged into an AC outlet with a cord that attaches to it.  I knew this when I ordered it but for some reason I thought that would only apply to low end TVs for some reason.  The AC cord looks a little funny but all in all it isn't that bad a solution and it CERTAINLY is better than a huge box under your TV.  The product works well and I like having access to all of my amazon content.If they could find some way to make the power cord go away or at least become slightly more elegant it would be an EASY 5.  I am very tempted to give it one now.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Englebrecht"}, {"rating": 3.0, "review": "I got as a gift. It is okay but wish there was more in it. I have a smart tv so I have some of the features that come on the fire. My biggest grip is I wish there were better free movies or shows on prime to make the stick beneficial.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I'm only giving a three for now. I got it for Christmas and positively love it. However, the past few days, it's been freezing up. I will post again once the issue is addressed and resolved with Amazon.", "verified": false, "helpfulness": "0/0", "author": "Dundnaugh"}]