[{"rating": 5.0, "review": "The GUI is pretty decent. I like the smooth transitions between items and its fast. I may buy another one for my other tv.", "verified": true, "helpfulness": "0/0", "author": "Bradley Stepp"}, {"rating": 4.0, "review": "Great device but is laking some big apps. The first thing I noticed was no VUDU or Target ticket app.We have a lot of UV so no way to see them with this device. So Just that means It doesn't get used very much. However everything that I have tried on it works fine and it is very easy to navigate. Just with it had VUDU.", "verified": true, "helpfulness": "0/0", "author": "Joseph Wheat"}, {"rating": 5.0, "review": "I love this little stick.  They worked great and turned my cheap TV's into smart TV's for a lot less money.  Movies load quickly and the connection is great, I have officially retired my Roku!", "verified": true, "helpfulness": "0/0", "author": "MsAngelaB"}, {"rating": 3.0, "review": "There are few \"good\" apps, all the decent movies cost over $6 to rent and the remote sticks when you use it. If more apps are added and the price of the movies go down it will be wonderful. By the statement of thousands of movies leaves us to believe free movies and not expensive movies. With the stick being fairly new it's good for what it is, time will make it better. I'm very optimistic. We didn't get the free trial promised either.", "verified": true, "helpfulness": "1/1", "author": "David DeWitt"}, {"rating": 5.0, "review": "Excellent media device. I have already owned the Amazon Fire TV for a while, and once this came out, it was a no brainer to get the Fire stick. This allows me to view Amazon content, Netflix, etc on other TVs in my house, and is also portable if I ever decide to use it somewhere else. I think this is great for anybody, but if you're a prime use,r it's even better. You instantly have all of your Amazon content, music, photos, all connected to your media system.", "verified": true, "helpfulness": "0/0", "author": "Digitalmaster"}, {"rating": 3.0, "review": "Easy enough to set up.  However, in first 24 hours, it lost connectivity twice and had to be reset.  We watch a lot of IFC films (European, etc.) and often these are subtitled.  At least as far as the Netflix app on this goes, the subtitles are in black type which disappears almost entirely on any film which is not brightly lit.  The regular Netflix app on my Blue Ray DVD player and smart TV have subtitles whose type is bright white/yellow and visible under all circumstances.  I do not know if the type color can be corrected on this device or not.  This is one of two items which I am going to contact customer service about.  The second issue is that the volume from the device appears low.  For one movie we had to turn our TV volume to max in order to adequately hear the dialogue.  I am not sure if this was related again to a connectivity issue or not.  It should be noted that when the device was having connectivity issues, none of the other WiFi devices in our house had any issues.  The connectivity issue was strictly a Fire TV Stick issue.It does make using some apps easier, but the above problems make it a bit underwhelming at this point.  I will be interested to see what Customer Service has to offer.", "verified": true, "helpfulness": "2/2", "author": "Gen. Contractor \"Uppset fan installer\""}, {"rating": 5.0, "review": "Got it with the special order for Prime members for under $20. Package is beautiful and it's easy to set up. Works great ! Access to all of Prime and lot's of apps.", "verified": true, "helpfulness": "0/0", "author": "EVNJ"}, {"rating": 4.0, "review": "Falls way short of the full fire TV box, which we love.Second Thoughts Update: bumping up by a starIn the early days, we had trouble streaming Amazon prime with many pauses (annoying!).  But over the last three nights, we gave it another try and Amazon streaming has since started to work perfectly.I may come back after a few more weeks and go to full 5 stars (for a streaming stick) but still like the full Fire TV box better.", "verified": true, "helpfulness": "0/1", "author": "L. McCarter"}, {"rating": 2.0, "review": "My peeve is if you accidentally hit buy. You bought it. Before I had the stick I always had to enter a code assuring that I want to buy. Also it would as you \"OK\" then you can proceed to buy or not. Now you click it. You bought it.", "verified": true, "helpfulness": "1/1", "author": "Amazonian"}, {"rating": 2.0, "review": "This product is not that great. I was really excited about it, but it is not that great. The install is very easy.", "verified": true, "helpfulness": "1/1", "author": "Richie"}]