[{"rating": 2.0, "review": "It works great with Amazon content but really slow with Netflix and Hulu plus and HBO go it seems like it's on purpose but I have a very strong Wi-Fi signal any can't even play one episode on Netflix or Hulu but the content on Amazon place flawlessly and amazingly fast they need to fix this because it seems to be done intentionally", "verified": true, "helpfulness": "0/0", "author": "Alonso G. Rebaza \"gian\""}, {"rating": 5.0, "review": "yes", "verified": true, "helpfulness": "0/0", "author": "John Tharp"}, {"rating": 3.0, "review": "The Amazon Instant Video functionality with this is pretty good, but support for additional apps is still very rough. For example, the image quality with Netflix is terrible. I'd still choose Chromecast over this product, but good if you're just wanting to use for Amazon Instant Video.", "verified": true, "helpfulness": "0/0", "author": "Danielle Boenisch"}, {"rating": 5.0, "review": "The best android media player compared with another .Remote control so sensitive very fast .", "verified": true, "helpfulness": "0/0", "author": "Trong V. Nguyen"}, {"rating": 4.0, "review": "We're still newbies, but so far so good.  We have already cancelled a premium service on our satellite TV as we 'll be able to find about any of the older stuff we want here on demand.  We had Starz and Encore.  The \"new\" films that we would normally get on Netflix are pretty pricey however,  so we may keep Netflix going for awhile.  It is still a work in progress.  Since I already had \"prime\" it's definitely worth it so far.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 4.0, "review": "Excellent substitution for Netflix at a cheaper price.", "verified": true, "helpfulness": "0/0", "author": "B J E"}, {"rating": 5.0, "review": "love it! all good no bad", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "once Amazon replaced the refurbished part, it worked like a charm", "verified": true, "helpfulness": "0/0", "author": "Kimberly Michelson"}, {"rating": 5.0, "review": "awesome. Absolutely love it. Make sure there is power close by however. I didn't expect that it needed to be plugged in. I have Chromecast as well and that did not need power.", "verified": true, "helpfulness": "0/0", "author": "Bill Wagner"}, {"rating": 5.0, "review": "This might be my favorite Amazon purchase ever! Easy set up and easy to use. Lots of free movies and TV shows to stream with my Amazon prime membership. I love it!", "verified": true, "helpfulness": "0/0", "author": "Lisa Niven"}]