[{"rating": 2.0, "review": "It is working great for me. I have Apple TV, but it took for ever to buffer anything I wanted to watch. Having fire stick i have non of that problem.", "verified": true, "helpfulness": "0/0", "author": "FAISAL SHALWANI"}, {"rating": 5.0, "review": "Worked like a charm, easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Ronny R. Shipley"}, {"rating": 5.0, "review": "I'm ready to ditch the dish! So, I wanted to give the Fire TV a try.  The Fire Stick was easy to setup, and has a clear picture!  I didn't have a problem with buffering, although your ISP plan has a lot to do with that. I plan on ordering Amazon Prime for more movie choices. Although, I wish Amazon offered live tv with the Prime, that would be awesome!  Though, I have no complaints because I can select what I want to watch. I don't have to worry about paying for programs I don't like or multiple channels of the same thing!  Amazon continues to deliver!!!", "verified": true, "helpfulness": "0/0", "author": "Debra L. Gomez"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Holly Clark"}, {"rating": 1.0, "review": "So inconsistent w the signal.", "verified": true, "helpfulness": "0/0", "author": "Armin Hamidi"}, {"rating": 5.0, "review": "I've got a couple different versions of Roku that I love, however, and I can't believe I'm about to say this, but I think I like the Firestick better!!  You can download games.  Interface is smooth and easy on the eyes.  Nicely engineered.  I love it and might buy another to replace one of the original and now aging Rokus.", "verified": true, "helpfulness": "0/0", "author": "La Piniac"}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "A Viewer"}, {"rating": 3.0, "review": "It didn't work on my bigger HDTV, but it works on my little one.", "verified": true, "helpfulness": "0/0", "author": "Catherine Collins"}, {"rating": 5.0, "review": "This is a really good product that makes it easy to stream shows and movies to your TV.  It even has some games that you can download to play on your TV.  I would recommend the product to others.", "verified": true, "helpfulness": "0/0", "author": "Carol Ton \"Carol\""}, {"rating": 5.0, "review": "It works great.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}]