[{"rating": 4.0, "review": "I really like the Fire TV Stick; however, the remote is a little hard to use.  You really have to push hard on the directional buttons.  Other than that, the content and performance is really good.", "verified": true, "helpfulness": "0/0", "author": "Thomas Spurlock"}, {"rating": 1.0, "review": "This is the worst device I have ever bought.  I plugged it in and set it up but the sound would only come through periodically.  The picture was great and worked with no hesitation.  The device also got very hot.", "verified": true, "helpfulness": "0/1", "author": "Michelle Hafford"}, {"rating": 4.0, "review": "Remote control is the best. Don't have to use my phone to control it like my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Wasted money on this junk.  As many others say, horrible network connections.  It could not find signal from nearby Asus RT-N56 router when plugged in HDMI port in center of 50\" tv, whether direct or with the supplied short extension.  Checked signal with phone, found mid-range strength.  Plugged into side port it saw network, but would not connect to 5 ghz stream at all, and had trouble with 2.4 ghz.  When it finally did \"connect,\" it first could not download, but on re-start said it needed to download updates, then crashed.  Re-re-started it began to download, hung, then crashed for the last time here.  It's trash to me, so into the gift drawer for someone with a router closer than 25 feet.", "verified": false, "helpfulness": "0/1", "author": "RC"}, {"rating": 2.0, "review": "many of theprograms provided with the prime membership are remakably obsolete--had stick  for a couple of days now- maybe it will get better.but,  you have to be computer savvy to install this thing!!had trouble opening the battery area- do not use a knife to open it- push hard with your fingers!!  hopefully it will not crack! :-)", "verified": true, "helpfulness": "1/1", "author": "ernest milner"}, {"rating": 5.0, "review": "Too easy and simple.", "verified": true, "helpfulness": "0/0", "author": "Will A. Turcios \"slashwt\""}, {"rating": 5.0, "review": "Since I didn't have a desire for the gaming features of the Fire box nor felt the need for voice search, I thought the Fire stick would be sufficient. I am quite happy with my choice. This was easy to setup and it's been streaming flawlessly. And since I was able to catch it for the Prime early bird price of $19 it was a steal of a deal. However, I think it's totally worth the $39.", "verified": true, "helpfulness": "0/0", "author": "AK"}, {"rating": 5.0, "review": "Worth it..", "verified": true, "helpfulness": "0/0", "author": "abhilash"}, {"rating": 5.0, "review": "I am addicted to Netflix so that was my primary reason for purchasing this item. It has met my expectations.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far so good! Very easy to set up and use. We've already watched several prime movies. Nice that there are other options too like Netflix. We've been thinking about trying it. This will make it easy!", "verified": true, "helpfulness": "0/0", "author": "Slpinpbg"}]