[{"rating": 4.0, "review": "I've used Apple TVs since the first generation, and this is a much better product compared to the long-in-the-tooth Apple TV. For the most part this item suits my needs especially since I use Plex and that is a no go on the Apple TV(without a lot of tinkering). Easy to setup, my only complaint is the remote works over bluetooth or Wifi; therefore I can't use my Harmony remote with it. The price is pretty cheap, and if you use Amazon Prime streaming, Netflix, Plex, WatchESPN, Sling TV, etc this thing will likely have you covered. Nice product... not necessarily great, but pretty nice.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "First things first, it broke my internet. Sounds strange, I know, but it did. I would plug this thing into my HDMI port on my vizio, connect to the the wireless, and then bam! The wireless would all of a sudden have no internet connection. The stick comes with an hdmi extender cable and when I connect the stick with the extender, it does not break my wireless. I have no idea why this is, but it is. Three of the computers in my house, including the fire stick, had zero internet connection on the wireless while the stick was in solo. But those connected via ethernet had no problem. Using the extender made this stop. I pugged, and unplugged three times to make sure that was the problem. It worked everytime.", "verified": true, "helpfulness": "0/0", "author": "Tyler D"}, {"rating": 5.0, "review": "Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "drea"}, {"rating": 1.0, "review": "I was so excited to use the fire stick so I could watch all my shows marathon style. What a disappointment! Turns out my 5 yrs old tv isn't compatible with the stick. Had I known that was even a possibility I wouldn't have purchased it and saved myself the trouble of having to return it.", "verified": true, "helpfulness": "1/1", "author": "Nicole"}, {"rating": 3.0, "review": "It's not to bad.  You need a really strong band with.  It keeps cuting out on me.  Plus Hulu sucks there is a lag or it will cut out.  Plus you can't use a voice remote. I order one at the same time as the fire stick.  The voice bit will not work.  Do if you are going to use it for Amazon prime or Netflix you will be fine.", "verified": true, "helpfulness": "0/0", "author": "Chris Moore"}, {"rating": 5.0, "review": "An amazing piece of technology. So easy to use and set up, and connects me to everything I want to watch. Plus it's only forty bucks. Probably the best thing I've ever purchased.", "verified": true, "helpfulness": "0/0", "author": "Matt Pentello"}, {"rating": 1.0, "review": "brought fire stick for hulu plus and netflix but no sign of hulu plus very disappointed", "verified": true, "helpfulness": "0/0", "author": "Michael O."}, {"rating": 5.0, "review": "Works well as expected from Amazon. Amazingly easy to use this simple device.", "verified": true, "helpfulness": "0/0", "author": "Clive L. Sinoff \"CLS\""}, {"rating": 4.0, "review": "Fast, easy to use, simple to set up.", "verified": true, "helpfulness": "0/0", "author": "Jamie Fender"}, {"rating": 5.0, "review": "Great Price and Great purchase know I can enjoy watching movies and tv shows.", "verified": true, "helpfulness": "0/0", "author": "Stephen M Smith III"}]