[{"rating": 5.0, "review": "Great after a friend downloaded something on it and now I get my movies and shows for free.", "verified": true, "helpfulness": "0/0", "author": "dstrick"}, {"rating": 5.0, "review": "This is so easy to install it took this 65 year old w/ arthritis less than 1 minute to hook it up. I truly do love this thing. As soon as my current satellite provider contract is over I'm canceling with them. Who needs them. If you want local channels they have those new indoor antennas that have a range of about 60 miles. Works for me.", "verified": true, "helpfulness": "0/0", "author": "4th Generation Orangeite \"K.R. Schlueter\""}, {"rating": 4.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Delberta Storz"}, {"rating": 5.0, "review": "If you're tired of waiting, waiting, waiting for Amazon Prime to come up on your PS3 (And all the other problems of using a PS3 for Amazon Prime), then just spend a few bucks on this device and all those problems will go away.  Setup is easy, and once that's done, every time you use it, its ready in about 20-30 seconds after you plug it in.  Shows and movies load and begin to play in just seconds....EVERY TIME!  Great device.", "verified": true, "helpfulness": "0/0", "author": "T.C."}, {"rating": 5.0, "review": "I'm in love with  this.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "I am not very technologically savvy, but the fire stick is so easy to use...I love it!", "verified": true, "helpfulness": "0/0", "author": "Heather Robinson"}, {"rating": 4.0, "review": "I lv it :)", "verified": true, "helpfulness": "0/0", "author": "Norma palos"}, {"rating": 5.0, "review": "I haven’t had a chance to use until I recently came down with Bronchitis which I’m hoping to get over soon.  Anyway I have been a prime member for years (2010) and I love the amazon prime streaming services that they introduced last year included with prime.  Problem being that with my computer (~1yr old Dell XPS 13) seems to constantly skip or pause every few minutes which after 10 minutes becomes unbearable, hence, why I always check out Netflix first.  Bought this when they introduced (for 19.99) figured why not, and just trying this out this week.  This thing has been a lifesaver through my Bronchitis (Watching “The Americans” good show).  The interface is simple and easy to use and the remote works flawlessly.  The skipping is non-existent with the stick and now I can enjoy the streaming services as they are intended to be enjoyed.  Thank you amazon!!!", "verified": true, "helpfulness": "0/0", "author": "forney"}, {"rating": 4.0, "review": "So Easy! Found the Prime TV much easier to navigate then what I was previously using on the Xbox platform. Still playing with the apps but loving  it so far.Only con is on the Prime TV I would like to see the recently watched with a little less digging.", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 5.0, "review": "It is simple to use and works great on both tv's. We bought two!", "verified": true, "helpfulness": "0/0", "author": "mark wannamaker"}]