[{"rating": 5.0, "review": "Very happy with the firestick.  Super easy to install to TV. Opens right up with Amazon Prime movies and TV shows, saves my watch list.  I did not get the voice control remote but what an awesome feature that is available.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Really enjoy it, may get rid of our satellite service", "verified": true, "helpfulness": "0/0", "author": "Keith S."}, {"rating": 5.0, "review": "My Amazon Fire Stick showed up on time. The setup was super easy. I spent the next three hours going through the LONG list of apps. that are downloadable . You can shop directly on your TV or log into your amazon on your account from your computer/tablet and shop for the apps that way. I bought the three months of Sling TV to get the Fire Stick free. I will not pay the high amounts for cable or Dish because we only watch 2 or 3 of the channels. Sling is perfect for our family. I kept Hulu and Netflix so all together we have a great selection of shows/movies for way less then you would pay a month for cable or dish.", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 5.0, "review": "Perfect for the family room", "verified": true, "helpfulness": "0/0", "author": "Gymnast_Jillian"}, {"rating": 5.0, "review": "Really great", "verified": true, "helpfulness": "0/0", "author": "Janet king"}, {"rating": 5.0, "review": "Brand new to this service and loving it so far~!!!!", "verified": true, "helpfulness": "0/0", "author": "Jane Gue"}, {"rating": 3.0, "review": "The auto level need to be improved, we needed to set the level at max on the TV when using the stick but  had to reset to a lower auto level when back on the network.", "verified": true, "helpfulness": "0/0", "author": "robert t tobias"}, {"rating": 5.0, "review": "Great. Love the features. Only constructive feedback would be to improve upon its connectivity issues.Its a bit slow at times and seems to hang at times.", "verified": true, "helpfulness": "0/0", "author": "G. Makin \"Gaurav\""}, {"rating": 2.0, "review": "I liked the interface and the software.I thought the hardware was easy to install.It all worked great for about 3 hours, then would not restart.Read online about problems with power cord overheating so I unplugged itStarted up again next day and went out after about an hour.Read more online, found a similar power cord, plugged it in and it worked for a while, then out again.No online hints seems to fix.  Evidently has been a problem for a long time.Should have looked at reviews on sites other than Amazon.Is totally unreliable.  I'm sorry I bought it just because it was cheap.", "verified": true, "helpfulness": "0/0", "author": "Mac Whatley"}, {"rating": 2.0, "review": "I've had the Fire Stick for six months, and at first I thought it was great. So far though, it has completely stopped working once, and today after I hadn't used it for a week or so, the remote died. It took all kinds of internet navigating to get hold of the Fire Stick support people, and then when they asked for the last digits of my CC and the expiration to verify the account, they dropped the call. When I finally got through to somebody again, they processed the replacement of the \"dead\" remote, and didn't even need the info I was asked for previous. So, I have two issues. Why should I need a replacement remote after six months? And why is it so difficult to get through to a live human? Customer service is, and always has been great once you get ahold of them, but it shouldn't be so difficult. The Fire Stick doesn't work nearly as well as I had hoped, I'm not real happy with the movies on offer, and I won't be reimbursed from my Prime account for the time that my Fire Stick was unavailable. If I have any more issues with it, I'm going to replace it.", "verified": true, "helpfulness": "0/0", "author": "p51djm22"}]