[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Lejla Kovacevic"}, {"rating": 1.0, "review": "Fiance gave it to me as a gift when it was on special for $20. Tried it out, immensely annoyed with the extremely long commercial that you CANNOT skip or fast forward through telling you all the ways you can give Amazon money. Seemed to be good for very little more than buying content from Amazon, pretty useless for any other content, (one example, all of the search features will only return Amazon content, with a priority for paid content). Gave it back to my fiance for her to use and she quickly got annoyed with it too and sent it back. I like google chromecast, like the Roku, this was annoying garbage.", "verified": false, "helpfulness": "1/1", "author": "Nafi"}, {"rating": 5.0, "review": "The little time I have been able to use it I am pleased", "verified": true, "helpfulness": "0/0", "author": "papa"}, {"rating": 5.0, "review": "Love it.  It's so easy to use!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Kristoffer"}, {"rating": 4.0, "review": "Sweeeeeeet", "verified": true, "helpfulness": "0/0", "author": "Matt Larsen"}, {"rating": 3.0, "review": "Fire TV Stick is easy to navigate and great to have access to amazon prime, hulu, and netflix but the video playback constantly skips. If you try rewinding the video, it continues to skip in the exact spot each time so you will never be able to see what you missed. If that kink gets worked out, then the Fire TV Stick would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Ariaaanaaa"}, {"rating": 4.0, "review": "Can't seem to find anything for free seems you have to rent or buy everything? ?", "verified": true, "helpfulness": "0/1", "author": "Rodney  Ford"}, {"rating": 5.0, "review": "This little media device is excellent. Much better than Roku as the Roku is very limited in terms of which applications you can install. As for the fire stick, you have endless possibilities as it is based on Android.", "verified": true, "helpfulness": "0/0", "author": "Demiana"}, {"rating": 5.0, "review": "Need to learn more but think I am going to like it a lot", "verified": true, "helpfulness": "0/0", "author": "Ginny Carson"}]