[{"rating": 4.0, "review": "Easy to use, lots of free good movies.", "verified": true, "helpfulness": "0/0", "author": "Margaret A Tigan"}, {"rating": 3.0, "review": "I just set up my recently purchased fire tv stick and so far it is OK.  The set up process was very simple and with good set up instructions plus I have found it very easy to use, but I was hoping for more apps that I could stream to my TV.  For example, the watchespn app is available and so far works well, but other apps such as NBCSports and BeinSports Play are not available currently.  I didn't need this stick to watch Amazon Prime as my DVD player already had that capability.  I will try to have it work at someone else's house soon.  It wasn't expensive so it is a decent purchase for the cost, but I can see it getting better.", "verified": true, "helpfulness": "0/0", "author": "JCR"}, {"rating": 5.0, "review": "Easy to set up and works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "bobbysd1"}, {"rating": 1.0, "review": "When trying to access movies or anything other title using fire stick, I get \"currently unavailable\".If this continues, you can expect a fast return.", "verified": true, "helpfulness": "0/1", "author": "JACK GARNER"}, {"rating": 5.0, "review": "Amazing product -SO EASY to use ... Start up took under 10 minutes - service is fantastic - no hiccups at ALL so far ... AmaZon prime selection is great for TV and movies , also runs Netflix and YouTube app with no troubles at all ... AMAZING ! LOVE renting movies on Amazon prime - same day as theater Oprion on some movies is GREAT - and cheaper than our cable \"On Demand \" rentals ...", "verified": true, "helpfulness": "0/0", "author": "Pookie \"Love\""}, {"rating": 5.0, "review": "Great product with a great price for the availability of programming options. Easy to set up and works very dependably so far. Very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Steve Ellis"}, {"rating": 5.0, "review": "Just what I wanted.  Works great.  Super easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like it fine but I would like it even more if ABC and CBS apps were on it...", "verified": true, "helpfulness": "0/0", "author": "Kelsi Lancaster"}, {"rating": 5.0, "review": "It's the best devise ever.", "verified": true, "helpfulness": "0/0", "author": "Bonnia"}, {"rating": 1.0, "review": "I hate it. It is useless. Haven't been able to view anything with since I got it. What a rip off.", "verified": true, "helpfulness": "1/4", "author": "JUDY MEYERS"}]