[{"rating": 5.0, "review": "I bought this to replace the Google Chrome Dongle, and I have to say that this is much better.", "verified": true, "helpfulness": "0/0", "author": "Chris Orcutt"}, {"rating": 2.0, "review": "I would be returning it, but threw packaging away. {the box it came in}  My t.v's were not compatible with it. could not use it. Not really really sure if its the fire sticks fault. but I'm real disappointed that t didn't work.", "verified": true, "helpfulness": "0/0", "author": "Phyllis B. Prince"}, {"rating": 3.0, "review": "It worked except it didn't offer me HD on my fancy FIOS TV.", "verified": true, "helpfulness": "0/0", "author": "Susann J. Woodside \"SuziWood\""}, {"rating": 1.0, "review": "Can u tell me if it has any sports channels and also Portuguese channels", "verified": false, "helpfulness": "0/0", "author": "Carla Rebelo"}, {"rating": 4.0, "review": "works as expeced", "verified": true, "helpfulness": "0/0", "author": "Leon Allen"}, {"rating": 5.0, "review": "Great product, it was very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "McArtsy"}, {"rating": 5.0, "review": "Installed easily and began to use immediately. No issues with video quality, wifi connection etc. It just works and the picture looks great! Got to go watch some more Prime Videos . . .", "verified": true, "helpfulness": "0/0", "author": "DJH \"Dan H.\""}, {"rating": 5.0, "review": "I didn't think having a remote was that big of deal (I have a Chrome cast as well).  Also if you have Prime Video this is miles better solution than casting your Tablet to Chrome.  Of course it would make sense that Amazon got the Prime Video and viewing down pat.  It also allows access to the Amazon music (on you TV) which makes it convenient to pop on some music when you want.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Love it. Easy plug and play set up.", "verified": true, "helpfulness": "0/0", "author": "Michael P."}, {"rating": 5.0, "review": "I love this thing. I discontinued Comcast and I am satisfied with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Cassandra"}]