[{"rating": 2.0, "review": "This product was very disappointing and returned almost immediately. The main issue surrounds the device's ability to establish and maintain a proper Internet connection. After connecting to the Internet, it could not (for some unknown reason) contact Amazon. I found out how to reboot the thing and that seemed to work. Then, while scrolling through the content it abruptly lost connectivity. It displayed a message with \"unknown error\" so I rebooted again. I started a movie to seem how it would work and about 10 minutes in, it lost connectivity again. It suggested that the signal strength wasn't strong enough or the Internet connection was too slow. When actually, the problem is this horribly manufactured device. Yes the signal has to go through a couple walls to reach the router, it still had 4 out of 5 bars when displayed on the TV. And my Internet connection is very fast (40mbps d/l, 15mbps u/l). I had to return it. I'll just use the XBOX to stream content.", "verified": true, "helpfulness": "0/0", "author": "Listener"}, {"rating": 3.0, "review": "Got to watch movies because Comcast is not renting movies at additional cost to the consumer.  Well I am pretty disappointed by the selection and quality.  The free movies are pretty much B grade unknown releases. And so far seem to be pg or pg  14.  Everything else is available via subscription via net Flux and apps of that nature. At least I only list 20 dollars.I'm not into games so I can't speak for those offerings.", "verified": true, "helpfulness": "0/0", "author": "Jim P \"dedred\""}, {"rating": 5.0, "review": "Easy to install and use.", "verified": false, "helpfulness": "0/0", "author": "Nathanial"}, {"rating": 1.0, "review": "Make sure your broadband is fast enough for the sticks' needs or it won't work. How fast? I couldn't find a spec online, and the stick description doesn't address the issue. My broadband is 2.6mbps and is too slow. The stick refuses to even try to stream anything but the main menu.", "verified": true, "helpfulness": "1/2", "author": "Bill Robinson"}, {"rating": 3.0, "review": "It's ok. It has things about it that I like such as the ability to navigate between Hulu and Netflix without having to do extra work. BUT...Youtube moves extremely slow, both Hulu and Netflix often pauses as you are watching tv. It's almost like you have slow internet speed...BUT...I have the highest internet plan and this shouldn't be a problem. BUT IT IS. Fix these minor glitches, make them free to those who already have the stick to upgrade and i'll give you 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Diane Simmons"}, {"rating": 5.0, "review": "I love it the performance is great. I haven't even found all the extra's.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "OK I like stuff that just works. This plugs in, attaches to your network, installs and runs. Simple. Perfect.", "verified": true, "helpfulness": "0/0", "author": "Glen"}, {"rating": 5.0, "review": "I've used several devices to stream media including smart TVs, Roku, Xbox, Playstation, custom Raspberry Pi device, and this is by far my favorite. The interface is great and response, controller is intuitive (I can use it in the dark without having to look at it). It is small and I don't see it when plugged in to the TV. It always JUST WORKS, and streams via wifi with no hiccups. I would recommend this to ANYONE.", "verified": true, "helpfulness": "0/0", "author": "JRusty15"}, {"rating": 5.0, "review": "I have been trying to find a product that I could use for NetFlix and Amazon Prime, I got this a few days ago, and I am wondering why I did not order it sooner. This is just what I needed. I am very please with how easy it was put on the TV and use.", "verified": true, "helpfulness": "0/0", "author": "Deborah57"}, {"rating": 5.0, "review": "Love it so easy to use, I brought 3 and will give as a gift. Great product!  Plus I get to watch all amazon series which are awesome.", "verified": true, "helpfulness": "0/0", "author": "C. Iannetta \"HD Love\""}]