[{"rating": 3.0, "review": "It is ok.  I have an Apple TV and purchased through the Sling promotion (which is in itself disappointing) to get further to reaching my \"unplugged\" goals.  The set up was ridiculously complicated, i.e., the USB line to the Stick to the plug to the + HDMI cord to the Stick to the TV.  Are you serious?  I thought it was just a plug and play.  Not that impressed with the actually functionality, it is not smooth and the interface feels complicated.", "verified": true, "helpfulness": "0/0", "author": "ABC"}, {"rating": 5.0, "review": "Easy to use. Many movies and shows are available with this product. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Donna E. Duncan"}, {"rating": 5.0, "review": "I preordered this when it came out for $20 and I gifted it to my brother, him and his girlfriend love it. I should have ordered a few more at that price!", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Wow!  So easy to use and a great value!  We cut out the expensive cable pig a while ago but missed having movies or shows to watch other than on our phones or tablet.  Simply plug it in to TV follow the prompts and use your existing Prime membership to watch about any movie or show you want.  Of course some are only on Netflix or HBO but so what.  Very inexpensive way to enjoy TV and movies old and new.  Thousands of free ones included in Prime but you can also buy or rent new and old movies or shows whenever you want.", "verified": true, "helpfulness": "0/0", "author": "jason"}, {"rating": 5.0, "review": "I love it😘😍😘😍😘", "verified": true, "helpfulness": "0/0", "author": "natalie"}, {"rating": 5.0, "review": "With the recent upgrade, it now works in hotels with a \"login screen\" on their network.  Since I've gotten the upgrade, I've only tried it at a Hyatt House and a Hyatt Place, but both used a \"login screen\" and it worked fine. Video quality was very good and it was a pleasure to be able to watch Netflix, Hulu and Prime in the hotel room.  I'll probably try to determine a better packing method, but I just put the stick, the remote and the wires into a zip lock bag to keep everything together.I wasn't able to get the remote app on my Android phone to connect, but I suspect that may have been due to the hotel network.  I'll try to get it to connect at home where I have control over the network and then see if it works in hotels.  If so, I can leave the remote at home when traveling.At home I use a Roku.  I did try the Amazon Fire TV, but returned it for the simple reason that I didn't value the additional features, etc. (like voice search) enough for me to toss the Roku.  However, for traveling (which I do frequently), the Stick is terrific.  Very easy and quick to setup and connect in a hotel, then you have access to what whatever you want to watch - better than a Chromecast (I have one of those too).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Extremely disappointed.We got the fire stick for Christmas and were so excited since our Roku had just bit the dust. At first it worked great, we loved the interface, the picture was great, etc. But for the past 4 months it has been on a steady decline.It constantly disconnects from the internet, for starters. At first we thought this was our mistake, so we replaced our router even though none of our other devices seemed to have any issues. Same problem.At some points we could disconnect the fire stick from the power source, plug it back in and it would work for a while. But now that doesn't even work. We haven't been able to use it in almost a month.Tldr; don't waste your money. Amazon does a lot of things right, this is not one of them.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "Daughter loves it!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This stick is awesome !!! I'm obsessed", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wonderful device.  Easy to use and install.  Perfect for the technology challenged.", "verified": true, "helpfulness": "0/0", "author": "teresa nicholls"}]