[{"rating": 1.0, "review": "Just one star because no where does it tell you that you need a power source for the Fire to work. It does not simply plug into the USB port on your TV. You will need an open outlet and probably an extension chord as well as the provided power chord is very short.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "this is my new favorite thing! I didn't know it had to stay plugged into the wall all the time tho. I was under the impression that it was cordless. but no matter, I made it work. I love that the remote doesn't have to be pointed directly at it in order to work. that makes life easier. there's a kindle app for the remote. I was hoping there would be one for the iPhone, but there isn't, and that's understandable but irritating too. I love that you can play your kindle games on the tv :)", "verified": true, "helpfulness": "0/0", "author": "Jaime"}, {"rating": 3.0, "review": "Little disappointed with the prime selection so far... My wife and I saw the \"thousands\" of titles and was expecting some good things; however, it seems like you still have to pay for more than not.  Maybe we're just missing something.", "verified": true, "helpfulness": "0/0", "author": "Robert J McElmurry"}, {"rating": 5.0, "review": "Awesome and I'm so Happy no longer do I have a computer hooked up to my TV so I can watch Netflix", "verified": true, "helpfulness": "0/0", "author": "Margaret Kelly"}, {"rating": 4.0, "review": "GOOd Gift", "verified": true, "helpfulness": "0/0", "author": "John E. Peeling \"Jack\""}, {"rating": 4.0, "review": "Very surprised by it. IMO better than the Chromecast (I have both)", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 5.0, "review": "Awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "Maxine"}, {"rating": 2.0, "review": "I was very disappointed in the performance of the Amazon fire stick. Every other streaming device in my home was able to catch the signal off my Wi-Fi and run flawlessly. The fire stick constantly Lost the signal and if it happened to catch the signal it was constant buffering and stoppages.", "verified": true, "helpfulness": "0/0", "author": "Jared Sam"}, {"rating": 5.0, "review": "great little device", "verified": true, "helpfulness": "0/0", "author": "rwritz"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Nancy Forrest"}]