[{"rating": 5.0, "review": "so far I am very pleased with the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "inetta"}, {"rating": 1.0, "review": "I prefer Chromecast over the Fire Stick. Fire Stick constantly lags when I try to stream from Hulu or Netflix. It's absolutely annoying. I've tried everything from resetting the internet settings to a resetting the fire stick. I will not be recommending this to any of my friends/family. My Chromecast still runs flawlessly though and I've had it for 2 years! I've had the Fire Stick for 4 months.", "verified": true, "helpfulness": "3/4", "author": "tpan"}, {"rating": 3.0, "review": "Great for the price, but the user interface just seems like it puts you through a lot more steps than is necessary. Reminds me of the old iPhone interface actually, with how you need to exit out all the way back to the start screen to get from one thing to most any other things.", "verified": true, "helpfulness": "1/1", "author": "Solomon M. Kleinsmith \"Sol\""}, {"rating": 5.0, "review": "Love it! For the price it is hard to beat all that you get", "verified": true, "helpfulness": "0/0", "author": "Cooper C."}, {"rating": 5.0, "review": "Works very well. Easy interface and most of your basic video apps. Only missing YouTube but other than that its great. Works clear on the other side of our home away from the router.", "verified": true, "helpfulness": "0/0", "author": "Barakash"}, {"rating": 5.0, "review": "Easy to install and set up. Works great as a central location to access Netflix and my Amazon prime streaming.", "verified": true, "helpfulness": "0/0", "author": "KH"}, {"rating": 5.0, "review": "The kids pick it over Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Glenn"}, {"rating": 5.0, "review": "Well worth it am buying a few more for family.", "verified": true, "helpfulness": "0/0", "author": "Steve D. Martin"}, {"rating": 5.0, "review": "Easy and simple; just plug and enjoy", "verified": true, "helpfulness": "0/0", "author": "alan chavez"}, {"rating": 5.0, "review": "I have a smart TV so purchased it mainly for travel, but it is much easier to navigate and search than the TV apps so we use it all the time.  A no-brainer purchase for me.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]