[{"rating": 2.0, "review": "screen sharing is week for any sort of real business or general apps on an android device.  It starts and stops or is not supported.  Returned the product for now.", "verified": true, "helpfulness": "0/0", "author": "d funk"}, {"rating": 5.0, "review": "Love it.  I have 2 and am ordering another one!", "verified": true, "helpfulness": "0/0", "author": "Mary White"}, {"rating": 2.0, "review": "I wanted to like it so much because I love Amazon but I had to return it for a Roku. I have Comcast and a lot of the apps on there don't work with Comcast on the fire stick. So I got an amazing device that looked dope but I couldn't use a lot of the apps. Amazon disappointed me for the first time ever", "verified": true, "helpfulness": "0/0", "author": "Edwin Sevilla"}, {"rating": 3.0, "review": "It's a great device just a lot of network issues fail on Netflix", "verified": true, "helpfulness": "0/0", "author": "shaprea ziegler"}, {"rating": 2.0, "review": "Need more than standard speed TW internet speed.", "verified": true, "helpfulness": "0/0", "author": "Niner Mike"}, {"rating": 3.0, "review": "If it wasn't for the $19 price tag I got this for, I'd probably have bypassed this.  When compared to my Roku 3 it is grossly lacking in available content.  In all fairness it has a nice compact size and offers some decent features, but is still too limited in terms of available channel content.As stated, I like its small size and portability as it seems like it'd be great for taking on trips.  However, in my book, it currently cannot compete well enough with my Roku 3 to consider it a viable replacement to it in my home theatre system setup.If you're an Amazon Prime content \"die-hard\" this might be your \"go-to\" streaming video device.  Otherwise, I'd do some more shopping around.", "verified": true, "helpfulness": "0/0", "author": "D. F. \"Spock\""}, {"rating": 5.0, "review": "I am so glad I purchased this! It is so much easier to watch my amazon prime shows now. I was using the app on my Wii before and this is amazing. Love the sleep feature and how easy it was to install. Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "aefavorite"}, {"rating": 5.0, "review": "Love my Amazon Fire TV Stick - it was easy to setup and connect to my wireless. I prefer using Fire stick for Netflix and HBO GO apps (as opposed to my LG TV apps which are outdated). You can pick and choose which apps to download and install. So easy to stream the Amazon Prime movies & TV shows as well. Plus any pictures or videos on my Amazon cloud play through the stick. All good stuff.", "verified": true, "helpfulness": "0/0", "author": "dirocker"}, {"rating": 5.0, "review": "My husband loves this product", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 5.0, "review": "love this thing.  It turned my 6 year old tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Carlos Nieves"}]