[{"rating": 2.0, "review": "I am so disappointed with this product.  When I first got it, I loved the look of it.  The changing pictures with each show on Netflix were awesome.  However, I had to start unplugging it to reboot more and more frequently.  I got so frustated that I moved it to a different TV.  Same problem.  This is totally ridiculous!", "verified": true, "helpfulness": "0/0", "author": "Z Man \"Z Man\""}, {"rating": 5.0, "review": "We have used this product daily!! The whole family has enjoyed having access to ALL the movies and TV shows available for free since we have Amazon Prime. It was a terrific investment and we are planning on soon cancelling our service provider since there are so many options with this little TV stick.", "verified": true, "helpfulness": "0/0", "author": "Tracy Miller"}, {"rating": 5.0, "review": "The moment I attached the fire stick to my tv and saw all that it has to offer I thought to myself OMG what a great device. I love it, doesn't take up much space...", "verified": true, "helpfulness": "0/0", "author": "D Redd"}, {"rating": 1.0, "review": "Don't buy it.  Could not get it to connect to wireless network (router in same room).  Wish I had read reviews first.", "verified": false, "helpfulness": "0/1", "author": "Terri"}, {"rating": 1.0, "review": "When I received my Fire TV Stick, I liked it. There was a huge selection of movies and videos (Amazon Prime, Netflix, YouTube), the design was slick, downloading effortless, and the promotional price unbeatable.But in several days my Fire TV Stick stopped connecting to my Wi-Fi network. It seemed that it did not recognize the password. I did my research, went through all the options, was unable to resolve it myself and called the technical support. We went through the whole process a couple of times (\"Have you tried disconnecting it?\" \"Have you tried to reboot?\" \"Could we roll it back to default settings?\") Beyond those simple things nothing more sophisticated has been done. We haven't found a solution, so the support offered to replace the item. I reluctantly agreed, because I did not believe there was a hardware problem.The replacement wouldn't work either. It was the same problem. After going through all the process of disconnecting, reconnecting, reconnecting again, making sure the router is near the device, rebooting and updating the software with a specialist, I was told they would escalate the issue to Amazon's engineers and get back to me approximately in two days. I waited for almost a month, and there was no answer. I am returning the second item, which seems to be OK, just not able to connect to the particular Wi-Fi network.I understand this could have been a problem with my Wi-Fi settings, not a hardware problem. Still, Fire TV Stick is advertised as a plug-and-play gadget, and in some cases it is not. The problem could be solvable, but it required technical skills that were beyond my capabilities, and Amazon Support never went back to me as promised.", "verified": true, "helpfulness": "2/2", "author": "Alexey B."}, {"rating": 2.0, "review": "Works great. When it decides to work. Bought this to replace Roku 2. Once a day I have to unplug unit to reboot because it freezes. Not good! Less than half the number of apps are available vs Roku 2. Annoying.", "verified": true, "helpfulness": "0/0", "author": "S. Garcia"}, {"rating": 4.0, "review": "Very impressed with the Fire Stick.  Easy to use although the iOS app needs a bit of tweaking.  The integration with my Samsung LED TV makes using the Stick seamless in changing inputs between the Stick and my DVR.  I'm thinking abit buying another for my other room.", "verified": true, "helpfulness": "0/0", "author": "KRibit"}, {"rating": 5.0, "review": "This works pretty flawlessly with my setup.  I wish it didn't have to plug into an AC outlet, but otherwise no issues so far.", "verified": true, "helpfulness": "0/0", "author": "jpl"}, {"rating": 3.0, "review": "Too many titles require payment, or are listed but are then unavailable for viewing, they shouldn't be listed at all. Many other series provide some free episodes but then entire seasons require additional payment beyond Amazon Prime. Instructions are not readily available making it less user friendly than anticipated. Purchased the Fire Stick hoping to be able to view shows which aired for free when on the air but now have to be purchased. A lot of time spent scrolling through different lists only to find items repeatedly appearing slowing already long lists of shows. Not all I had hoped for.", "verified": true, "helpfulness": "0/1", "author": "Irish"}, {"rating": 1.0, "review": "This device has consistently given me problems since I received it as part of the prime preorder promo on Black Friday. After repeated calls to tech support, I was given no answers, and was even supposed to receive a callback from a supervisor that never came. Their diagnosis? My television wasn't capable (it's a 16-month old Vizio), yet they couldn't explain the sporadic weeks of fully functional use. I was never able to get it to cast to the screen properly from a mobile device (both android and iOS), and the audio de-syncs regularly requiring that you choose a different audio mix to jog the system's memory. I only wish I'd sent it back within the return period. Now this \"stick\" is just another piece of trash.", "verified": true, "helpfulness": "0/1", "author": "aserbant"}]