[{"rating": 5.0, "review": "great buy", "verified": true, "helpfulness": "0/0", "author": "jaime vanegas this product gets a five star cause it works great and it well worth the price, if you"}, {"rating": 5.0, "review": "This player is working out great and being able to sideload apps like XBMC makes if a great way to show my own media like photos, music, and videos on home network. Browsing is easy, lots of content, and performance is very good.", "verified": true, "helpfulness": "0/0", "author": "Alan K. Gordon"}, {"rating": 4.0, "review": "It's a great product and we enjoy using it", "verified": true, "helpfulness": "0/0", "author": "Ann L."}, {"rating": 5.0, "review": "Easy to set up. Clear directions.  I am not good with tech, but this was something I could do on my own.  How great to be able to stream so much entertainment.", "verified": true, "helpfulness": "0/0", "author": "joyce"}, {"rating": 5.0, "review": "Good price point and well worth it for the price.", "verified": true, "helpfulness": "0/0", "author": "Billy Y."}, {"rating": 3.0, "review": "Its OK.  I couldn't pass up the introductory offer but I probably wouldn't use it at all if Amazon Prime would stream to Chromecast.", "verified": true, "helpfulness": "0/0", "author": "BRN"}, {"rating": 5.0, "review": "Great access to another level of video access.  Easy set-up.  No tutorials needed to navigate  Say goodbye to Red Box and video rentals.", "verified": true, "helpfulness": "0/0", "author": "R. Henckel"}, {"rating": 1.0, "review": "Our first fire stick worked for about two weeks the went into a continuous reboot phase. We had it replaced and amazon tried to charge us 110.99.  After speaking with 3 amazon employees we finally had the charges removed.  The second fire stick arrived almost a week later than what we were told.  The box had been opened. The batteries were in the remote and the remote had fingerprints on it.. I assumed it was either used or tested before shipped.  After plugging it up it doesn't even come on..we tested on multiple tv's with no luck.  We were told we will receive a third one by Friday of next week as they are soldout.  We really like prime so we are still trying but so far poor customer service and poor quality product.  If you don't love prime don't bother getting this product go with chromecast.", "verified": true, "helpfulness": "0/0", "author": "Cory  Taylor"}, {"rating": 5.0, "review": "So much entertainment in one small package", "verified": true, "helpfulness": "0/0", "author": "Carl Marlinga"}, {"rating": 5.0, "review": "Loove", "verified": true, "helpfulness": "0/0", "author": "Hasy"}]