[{"rating": 5.0, "review": "The best investment I have made this whole year!!", "verified": true, "helpfulness": "0/0", "author": "Sharif"}, {"rating": 3.0, "review": "Works well. The reason I rate it a 3 is that I need to unpkug it to watch TV; otherwise, the tv screen goes dark every few minutes. Good selection of games, but can be glitchy at times.", "verified": false, "helpfulness": "0/0", "author": "Albert Bodden"}, {"rating": 2.0, "review": "Was so excited to get this for the special $19 price. Have been a Prime member for several years and wanted to be able to watch some of my favorites movies and shows on my TV instead of my iPad. Just hooked it up quickly and easily...beautiful streaming and great quality picture.  Just one problem.  No sound. I have a Sony sound bar hooked up to my Samsung TV that has wonderful sound quality...especially compared to the regular sound from the TV.  I saw some other reviews with similar issues. They had to disconnect the sound system to get it to work.  As that would really affect the experience, I doubt I will do that.  Stinks.  I will play with it a bit more, but expect I will be returning it.", "verified": true, "helpfulness": "0/0", "author": "Robin Taylor"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Prime Power User"}, {"rating": 5.0, "review": "I love it. It works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "As cool as fire tv except for the voice part which we don't use much but is very cool.", "verified": true, "helpfulness": "0/0", "author": "guy parsons"}, {"rating": 2.0, "review": "I have had the Fire TV and the Fire Stick.  I only have them for the Amazon Prime Video.  The stick was on sale for $19 and for that price it was an easy decision.  I recently hooked up the fire stick and it works much like the original fire tv, without voice search.  But the remote lag is almost a show-stopper.  It almost has a mind of it's own.  While trying to register the device it was very difficult to even enter an email address.  Now that I am over that the stick works well.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 2.0, "review": "Bought just as an experiment because the price was right, but the World is EMF-toxic enough without extra radio transmitters in my own house (how many folks do you know with tumors on the cellphone side of their head), so I won't add a WiFi node.", "verified": true, "helpfulness": "0/1", "author": "J. Buss"}, {"rating": 5.0, "review": "The Fire Stick is great! Fast, small and well formatted menus. This one will be going on the road with me :)", "verified": true, "helpfulness": "0/0", "author": "Randy"}, {"rating": 5.0, "review": "so far i am absolutely loving it and so is my husband!  i got a great deal on it and 30 days of netflix free", "verified": true, "helpfulness": "0/0", "author": "Brenda K."}]