[{"rating": 5.0, "review": "Lots of choices", "verified": true, "helpfulness": "0/0", "author": "ron hall"}, {"rating": 5.0, "review": "Bought two even though I lose the connections occasionally and have to remove it from power to reset it.", "verified": true, "helpfulness": "0/0", "author": "Herman A. Brown"}, {"rating": 5.0, "review": "This is great, easy set up, remote cute nd simple  but i love the remote app even more! We use it all the time and this was much more affordable nd simple than the other similar products in my opinion.", "verified": true, "helpfulness": "0/0", "author": "H. Sen"}, {"rating": 3.0, "review": "Like the idea, but felt screwed over by Amazon when they started my free trial of Prime when I placed my order, not when I received my Fire stick 1 month later.  I had no opportunity to explore Prime before I have to buy it.  Netflix, and others, are happy to let me \"try before I buy\". Real disappointment in Amazon's treatment of a loyal customer.", "verified": true, "helpfulness": "0/0", "author": "Tim Whitmore"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "JOSE G. ROMAN O. \"JOSEG\""}, {"rating": 5.0, "review": "I have a 50\" TV that is not a smart TV.  Awesome price, so simple and unbelievable!!! I would have paid $139 for it.", "verified": true, "helpfulness": "0/0", "author": "Straightshooterron"}, {"rating": 5.0, "review": "What a value!  Easy to use and it really helps you figure out what you get from Prime Video.  I didn't take advantage of Prime Video previously because it was just too difficult via my Smart TV apps.  I'm looking forward to the addition of HBOGo.  Product recommendation - add a Web Browser.", "verified": true, "helpfulness": "0/0", "author": "HDMaven"}, {"rating": 5.0, "review": "TV <3", "verified": true, "helpfulness": "0/0", "author": "katie ifert-miller"}, {"rating": 5.0, "review": "I first bought a ROKU and I promise you...setup for the Fire TV was WAY easier.  ROKU renamed my Netgear WIFI router unbeknownst to me and as a result none of my devices could connect to the internet.  After wasting a whole of time figuring out what was broken and then spending more time getting things back to the correct configuration, I boxed up the ROKU and sent it back.  But back to the Fire TV Stick...basically all you do is plug it in your TV, connect the power, enter your WIFI password and you're ready to go.  Easy!  I do recommend it, and if you're a prime member, it's a bonus.", "verified": true, "helpfulness": "0/0", "author": "JETinKansas \"JET Reader\""}, {"rating": 2.0, "review": "Make sure you look in to all TV options before you order the Fire stick.  I ordered it to save money.  It is actually a money pit.  You still have to pay for Netflix.  The advertisements for the Fire stick are misleading.  It seems that it is included.  You still have to pay the monthly fee for Netflix even if you have Amazon Prime..  I would have been better off just ordering a product like Netflix through another outlet.  I have spent a day trying to set up the firestick and some of the APPs.  I found out about the other charges by speaking to 4 different customer representatives.  What a waste of a day.  Just wanted to get something nice for my family to enjoy during this cold winter.  Now I regret the decision to go with the Firestick.  Be careful!!!", "verified": true, "helpfulness": "0/1", "author": "Duped by Amazon Prime/firestick"}]