[{"rating": 5.0, "review": "Great Item", "verified": true, "helpfulness": "0/0", "author": "alexander"}, {"rating": 5.0, "review": "Very convenient! I haven't had streaming trouble either. That alone is a huge plus in my opinion!", "verified": true, "helpfulness": "0/0", "author": "Z. Bridges"}, {"rating": 1.0, "review": "Cannot Install it!  USELESS  DIRECTIONS TO INSTALL!", "verified": true, "helpfulness": "0/1", "author": "Robert L. Hayward"}, {"rating": 5.0, "review": "Had this for about one month. Does not have as many channels as Roku but the apps work fine - especially ESPN. Little to no buffering and streams great.  For the intro price of $19.00, it is a great product.", "verified": true, "helpfulness": "0/0", "author": "JKT \"JKT5\""}, {"rating": 1.0, "review": "Amazon has a long way to go on these.  They continue to reboot as you are trying to start an App.  You have to login to Netflix about every 3 times you turn on the tv. I will be switching back to Roku until they have some software upgrades.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far it works great. Wish it had HBO Go app..", "verified": true, "helpfulness": "0/0", "author": "Amanda Simpson"}, {"rating": 4.0, "review": "It's nice if you want your videos from Amazon prime on a large screen.  I have a Kindle, that I absolutely love and I thought I could play all the games that I have on it with this.  Nope!  There are not near the amount of games available on this,  but I betcha it won't be long that more and more will be added.  It's nice to watch the prime movies on it,  also Netflix if you are subscribed to it.  I will certainly enjoy this for years to come.", "verified": true, "helpfulness": "0/0", "author": "fonts \"gayle\""}, {"rating": 5.0, "review": "Very nice - it's a great replacement for cable, 'cause there's never anything on cable worth watching except \"Law and Order.\"", "verified": true, "helpfulness": "1/1", "author": "Charles J. Allen IV"}, {"rating": 4.0, "review": "Great way to view Amazon prime video.  Wifi would not link up directly with my comcast cable modem.  I had to route it through my d-link wifi router for the fire stick to recognize the wifi and the Internet.", "verified": true, "helpfulness": "0/0", "author": "Mike HAll"}, {"rating": 5.0, "review": "This is a great product and a welcome alternative to my Apple TV.  Thank you, Amazon, for offering it at a discount for Prime members.  I LOVE this product!  I love PRIME!", "verified": true, "helpfulness": "0/0", "author": "Rosita1"}]