[{"rating": 5.0, "review": "Very easy to connect to TV and start watching some of my favorites!", "verified": true, "helpfulness": "0/0", "author": "LMoak"}, {"rating": 5.0, "review": "Plugs right in. Easy to set up. So much to watch. No need for cable ever again. I can play tv, movies, music, and display my pictures.", "verified": true, "helpfulness": "0/0", "author": "Shands"}, {"rating": 4.0, "review": "First it arrived sonnet than originally promised. Nice start. Then it was extremely was to set up and install.  It was in the middle of a major thunderstorm and it buffered quite a bit but the picture was great when it could play.  Admit I  an not sure if this was the firestick itself or ou sling tv service. Overall we are pleased so far but  it was only been 2 days.", "verified": true, "helpfulness": "0/0", "author": "Mo Simms"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amy B."}, {"rating": 5.0, "review": "I just got it and Amazon is already asking for a review.  It works.  Set up was straight forward.  Since it is so small, you obviously have to have the remote.  I like the fact that the remove is wireless and non-directional.  I am only using Netflix and it works great.As long as it continues to work, I am a happy camper.  I wish there was a way to turn it off other than pulling the plug.", "verified": true, "helpfulness": "0/0", "author": "H. McNaspy \"Spade5\""}, {"rating": 5.0, "review": "Works GREAT, easy to install and fast, fast, fast. We love it!", "verified": true, "helpfulness": "0/0", "author": "Little Tommy"}, {"rating": 3.0, "review": "The good thing, it's HD. Smooth streaming.", "verified": true, "helpfulness": "0/0", "author": "BM"}, {"rating": 5.0, "review": "I like this product very much. Awesome!", "verified": true, "helpfulness": "0/0", "author": "Julian Islas"}, {"rating": 5.0, "review": "I wasn't sure what the big difference between the stick and the box was except for storage capacity and size. In this case, smaller is better for me. Although it juts out oddly from the side of my TV, it works wonderfully. The picture is better than I expected, and the setup was super easy. No complaints yet!", "verified": true, "helpfulness": "0/0", "author": "IntSec"}, {"rating": 5.0, "review": "I could not get the stick to connect to the internet on 1 TV, but connected up on another works great simple to use controller could be a bit bigger. All in all good buy", "verified": true, "helpfulness": "0/0", "author": "Richard Kimbrough"}]