[{"rating": 4.0, "review": "Didn't realize the stick needed to be plugged into an outlet.", "verified": true, "helpfulness": "1/1", "author": "Laurie Carlson"}, {"rating": 4.0, "review": "Learning curve but love the basis! I am an Amazon Prime fan and it is now my go to place! This just made it much better! Now the kids can have movie night on their TV! All the movies we buy at their finger tips for them to enjoy together. Especially at spend the night parties! One big down side, the popping noise. Would have 5 stars if it weren't for this painful popping. I can't figure out how to stop this popping noise the sick makes through the speakers when making selections. Also another set back we got around.... make sure it is close enough to the WiFi or in an unobstructed area. If not, you will constantly have connection issues. Our port was in back not on the side and was a problem. We solved this issue by using the attachment extender. It then hung below our TV instead of behind and now it gets WiFi signal no problem. Still would highly recommend it though!", "verified": true, "helpfulness": "1/1", "author": "Angela \"The married mama who is always on the move! :D\""}, {"rating": 4.0, "review": "good I like it, sometimes lost the wifi signal but is not all the time, good for the price ..", "verified": true, "helpfulness": "0/0", "author": "Christian Cordon"}, {"rating": 4.0, "review": "Its one of the good product. Only one option I felt missing is streaming any video from any site which can be done in Chromecast. Apart from that it is superior to Chromecast in all aspect.", "verified": true, "helpfulness": "1/2", "author": "Raja Ram R"}, {"rating": 2.0, "review": "I got this through the introductory offer.  I replaced an older streaming device with the Amazon Fire TV stick, and have used it as my sole media device for most of the last month.  When payday comes, I'm planning on replacing this with a device that has broader access to sources of media content outside the Amazon ecosystem.  Not being able to access all of the digital movies I've purchased elsewhere (many, but not all - Disney in particular - are available through the Flixster app) is the deal-breaker.The interface is nice, and would work well for anyone who gets all their content from Amazon, or other subscription-based streaming content sites like Netflix and Hulu Plus, just not other sources of purchased content.  The remote is convenient and works well, and the functionality of the device is sound.", "verified": true, "helpfulness": "1/2", "author": "David"}, {"rating": 5.0, "review": "love this. better than Apple TV", "verified": true, "helpfulness": "0/0", "author": "Kenya"}, {"rating": 3.0, "review": "it works and was very cheap. but the need to supply power waste it all. It then adds cable (power) which doesn't look good, and is not convenient if you dont want to add an extension.", "verified": true, "helpfulness": "0/0", "author": "CCR"}, {"rating": 5.0, "review": "Supper for non cable free antenna extra entertainment.", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 5.0, "review": "Absolutely love My FIRE TV STICK.....Plan on buying another one for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "linette"}, {"rating": 3.0, "review": "My internet and wifi are strong but the fire stick tends to move slowly, freeze and glitch at least once a use.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}]