[{"rating": 4.0, "review": "Awesome, fast, and unobtrusive.", "verified": true, "helpfulness": "0/0", "author": "Joseph Robinson"}, {"rating": 5.0, "review": "Great product. Works wonderful with lots of options to view different shows and doesn't take up a lot of space at the back of my tv.", "verified": true, "helpfulness": "0/0", "author": "fab4hockey6"}, {"rating": 3.0, "review": "I love this stick immensely; however it overheats easily which causes the WiFi not to work. Amazon exchanged for another stick -  but it overheats too.  My other Amazon Stick in my daughters room works just fine - seems to be random.I exchanged one of my sticks for more expensive Fire TV and it works great.  The 2nd Fire Stick I'm returning and getting a 2nd Roku for the house.  I wish they would fix it as I love the stick otherwise.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Horton"}, {"rating": 2.0, "review": "the fire tv stick does not work as well as i like.it is to slow and does not respond well", "verified": false, "helpfulness": "0/0", "author": "larry kilgore"}, {"rating": 1.0, "review": "you cannot access the internet.  Only sites they allow.", "verified": true, "helpfulness": "0/1", "author": "Charles D'Agostino"}, {"rating": 5.0, "review": "Nice addition to any television!", "verified": true, "helpfulness": "0/0", "author": "Travis A. Passman Jr."}, {"rating": 5.0, "review": "Very good product. I recommend it to anyone with a smart TV. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Ken Henry"}, {"rating": 4.0, "review": "Pretty happy with it overall. Great price and pretty comparable to a Roku. Audio is a little strange at times, but it could be caused by my TV as well.", "verified": true, "helpfulness": "0/0", "author": "A. Lott \"AshleyMarkus\""}, {"rating": 1.0, "review": "This does not work with my HD Samsung TV...no matter how much I troubleshoot it still says \"not supported mode\". Waste of money. I was really excited to use this.", "verified": true, "helpfulness": "1/1", "author": "Christina Vaughan"}, {"rating": 5.0, "review": "Graphics and power for the price is awsome. I use it to mirror my Note 4 with. So far all great. Going to try airplay app I'v heard about so I can mirror Ipad's without being out $99 for an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Louis in Atlanta"}]