[{"rating": 5.0, "review": "I really love this device!!! It is perfect! I love the endless streaming opportunities. Its small enough that you never notice it! The remote is simple and easy to understand. Great product!!!", "verified": true, "helpfulness": "0/0", "author": "SpeedRacer89 \"Ryan\""}, {"rating": 2.0, "review": "Was not apparent that hbo go and shotimeanytime do not work with Comcast.  Otherwise works well. No significant difference to the roku.", "verified": true, "helpfulness": "0/0", "author": "william brook"}, {"rating": 3.0, "review": "It's nice but there is a lot of buffing time sometimes while watching shows on Netflix. The quality of the picture is not all that great.", "verified": true, "helpfulness": "0/0", "author": "BOB HODGES"}, {"rating": 1.0, "review": "The device works well, however in my country Costa Rica has very few options available, because most are restricted by geographical reasons. This seems to me a great discrimination that paying the same price as an USA citizen, do not have the same rights. In this case they should prevent those items are sold by Amazon outside the United States, as they do with other products.", "verified": true, "helpfulness": "1/1", "author": "Carlos Solano"}, {"rating": 5.0, "review": "This is by far the easiest item to work and get hooked up The remote is very basic and simple to operate and since my husband is not computer or electronically blessed this was the perfect birthday gift I would highly recomend this item", "verified": true, "helpfulness": "0/0", "author": "Kathy Dominick"}, {"rating": 5.0, "review": "great addition to our TV...we don't have a smart TV so are able to do much more now.", "verified": true, "helpfulness": "0/0", "author": "margaret"}, {"rating": 5.0, "review": "This is so easy to set and it works. I got theChromecast and it was horrible. Never worked and Ser up was not easy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I'm writing this review on my iPhone from the same spot in my home, and on the same WIFI network connection, that I had planned to use the Amazon Fire TV Stick. Unlike my phone, the Firestick was unable to connect to www.amazon.com despite repeated attempts using different locations in the room. Thankfully, Best Buy excepted the return with issue. Thanks for wasting two hours of my life Amazon. If it has to be in the same room as the router why not just sell a wired version?", "verified": false, "helpfulness": "0/1", "author": "James P. Girardeau \"jim in savannah\""}, {"rating": 3.0, "review": "Great price/value but drops the internet connect a fair amount. Also the Amazon prime interface for my Samsung TV is better than on the fire stick. But the price is hard to beat. I just would think Amazon would have a piece of hardware that did not drop the WiFi connection so much.", "verified": true, "helpfulness": "0/0", "author": "john t minze"}, {"rating": 5.0, "review": "The Fire stick is the first step to getting away from satellite TV.", "verified": true, "helpfulness": "0/0", "author": "Craig Black"}]