[{"rating": 3.0, "review": "I lile it for its android game quality and quick Prime access. Anything else i would choose Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Rex"}, {"rating": 4.0, "review": "Easy to install, and amazing picture.  I was surprised by how easy it is to use. You will love it,  awesomeness", "verified": true, "helpfulness": "0/0", "author": "DivineDiva"}, {"rating": 5.0, "review": "Best streaming device. Is just a great product.", "verified": true, "helpfulness": "0/0", "author": "Morry"}, {"rating": 5.0, "review": "We bought two of the Amazon Fire TV Stick and it is such a simple device to use. We have other streaming devices such as Apple TV and I much prefer the Amazon Fire TV Stick.  We just took one of the devices on vacation and plugged it in to the TV where we stayed, and we watched whatever we wanted during the entire stay.  Totally recommend... especially for the price.", "verified": true, "helpfulness": "0/0", "author": "Danielle Maggs"}, {"rating": 4.0, "review": "Works perfectly, specially when using Slingtv", "verified": true, "helpfulness": "0/0", "author": "EVERTON I G VEIGA"}, {"rating": 3.0, "review": "Works pretty well with everything except HBO GO. Watching HBO GO on this stick results in an extremely stuttery picture. It's like an extremely low framerate or something, looks terrible and almost makes you feel dizzy watching it.Until they can fix this and make HBO GO run correctly on the next version of this stick, it's probably not worth a buy.", "verified": true, "helpfulness": "0/0", "author": "DudeMon"}, {"rating": 5.0, "review": "Not only do I love the Amazon Fire TV Stick, I have convinced two more people this week that they needed one, too.  IMHO, if you have paid for an Amazon Prime membership and don't use a Fire TV or Fire Stick to view Amazon video content on your TV, you are leaving money on the table.  So easy to install, my 80 year old mother set up hers and installed apps with just a little phone support from her favorite personal technician (me, her daughter!).Sure, this model doesn't include the fabulous voice search on the remote, but just download the Fire TV app to your phone and then you do. Don't hesitate; it's the cost of a movie and popcorn for two in a theater.", "verified": true, "helpfulness": "0/0", "author": "damble"}, {"rating": 1.0, "review": "Its not what i expected. I was looking for something to help me save money on my cable bill, instead i find my self spending more.", "verified": true, "helpfulness": "0/0", "author": "juan antonio padilla"}, {"rating": 5.0, "review": "It is the perfect product to meet all your entertainment needs! Very fast, very efficient, and so useful! I recommend it to anyone and everyone!", "verified": true, "helpfulness": "0/0", "author": "Richard DeMark"}, {"rating": 5.0, "review": "Love this product", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]