[{"rating": 4.0, "review": "Great product. We are having some \"hiccups\" when it comes to losing internet connectivity. I have found that if we make sure other wireless devices- i.e. Wii- are powered down, we don't have these issues. The design with the remote along with the software are great! Personally, I would wait until Amazon gets the bugs out before ordering this product.", "verified": true, "helpfulness": "0/0", "author": "Audrey Keith"}, {"rating": 5.0, "review": "makes my TV a smart TV but you need prime", "verified": true, "helpfulness": "0/0", "author": "Eric Cunha"}, {"rating": 5.0, "review": "Very nice product. I own Roku stuff all over, but I bought this at the intro Prime price.I'd say it's still worth it at the full price and my only gripe is all the marketing crap that comes with.But, you get what you don't pay for and part of buying into Amazon is the ecosystem helping to supplement costs of some products.I'll take it.. cuz I like the price and quality is not sacrificed.I'd buy more if I didn't already have Roku stuff in every other room.", "verified": true, "helpfulness": "0/0", "author": "KCMoSoxFan"}, {"rating": 4.0, "review": "UI is lacking, but worth the $20 I paid for it.", "verified": true, "helpfulness": "0/0", "author": "Daniel Miller"}, {"rating": 4.0, "review": "So far im happy with the fire stick.  Works smooth and fast, I am hoping that amazon will come out with hbo go and starz play, then I can have all of my apps in one place.", "verified": true, "helpfulness": "0/0", "author": "jason epton"}, {"rating": 5.0, "review": "The Fire TV Stick is my  first experience with a streaming device. When I first set it up , I binge watched one of my favorite TV programs. It worked flawlessly. Then I tried to watch a movie and ran into problems. The device kept giving me an error message. I've actually abandoned using the device until I can approach the issue without frustration. If I can resolve the problem, I would gladly change my rating. I chose the Fire Stick because of the low cost (compared to other devices) and because I am an Amazon Prime member. I hope that wasn't a mistake on my part. (Update 1/5) There must have been a problem with my service, because I updated my Wi-Fi and the Fire Stick performs wonderfully. I look forward to years of enjoyment", "verified": true, "helpfulness": "1/1", "author": "kenneth"}, {"rating": 5.0, "review": "i purchased this to watch netflix and amazon prime. It was soooo easy to set up. Everything you need is in the little box the device comes in after ten minutes i was watching netflix,  the video is so clean. I downloaded a free game just to test it. It worked very well. I would say this is a wonderful product. I will probably buy a second one so I don't have to keep unplugging it to use in a different room.", "verified": true, "helpfulness": "0/0", "author": "wanda hallmon"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Michael Perez"}, {"rating": 2.0, "review": "Update 5/29/15 -  I downgraded my review from 4 stars to 2 because of a few reasons:  1) searching.  You cannot select free vs pay when you search.  You get every thing.  2)  Display of search results.  Cannot tell which listings are free or which cost money.A real nice enhancement is x-ray.  you can see who is in each screen.-----Do Not purchase unless you have Amazon PrimeI purchased as a gift to my kid.  She doesn't have prime and found it somewhat useless.  While you can install netflix and a few others, this unit is \"amazon\" centric.  So we traded the amazon file stick for an older roku.  The Roku worked well for people with out prime.The unit is very easy to setup.  The remote is small, plain and functional.  They have an android app that control the unit.  I found the app useless.  It crashed a lot.  Other times it could not find the fire stick.", "verified": true, "helpfulness": "0/0", "author": "bc"}, {"rating": 5.0, "review": "Simplicity of installion, the large selection of movies and the cost of the Fire Stick make this purchase and exceptional value.", "verified": true, "helpfulness": "0/0", "author": "Bill Stilwell"}]