[{"rating": 1.0, "review": "This is a piece of garbage, when I go to watch a show/movie it will cut out and go to the home screen every time. I would write more about it, but im guessing the language I would use to express my anger/disappointment for this wouldn't be appropriate.", "verified": false, "helpfulness": "0/0", "author": "Andrew Berry"}, {"rating": 5.0, "review": "I absolutely love this stick! Great addition to my bedroom. No problems at all thus far!", "verified": true, "helpfulness": "0/0", "author": "Nei'Shay"}, {"rating": 5.0, "review": "I bought this this to take with me on vacation in a hotel room. It would have worked great but the internet speed here was not strong enough to load NetFlix. But I will be using on my TV in the bedroom it has alot of apps that I already use and is super fast and easy to use. This is one of my favorite products that you hook up to the TV and I have pretty much tried them ALL from the other companies if you have Prime and plan on getting it every year its worth the price. And its worth all the apps and features in sure it will even get more better in the future. I thought about buying the FireTV because of the voice feature and the better speed but this one works fine and the speed is great and less boxes. Just hope to see even more apps and features soon and I highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Matt Hamilton \"BoysVomitCandy\""}, {"rating": 5.0, "review": "Absolutely fantastic device.  The Fire TV Stick super easy to use and really expands your viewing horizons.  Now that we have this and Amazon Prime, we're strongly considering getting rid of cable and going with just broadband and Amazon.  The Fire TV Stick also lets you play Netflix, Hulu, etc.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey S"}, {"rating": 5.0, "review": "Love it.  Works great!", "verified": true, "helpfulness": "0/0", "author": "chica"}, {"rating": 5.0, "review": "Very easy  quick to set up.  Excellent packaging", "verified": true, "helpfulness": "0/0", "author": "Jacqueline A. Shepard"}, {"rating": 4.0, "review": "Great high tech superior sound and color.", "verified": true, "helpfulness": "0/0", "author": "Julius Johnson"}, {"rating": 4.0, "review": "Pros:- Works well : Supports all the expected programs: Netflix, Amazon Prime Video, Pandora, Hulu.- Easy installation (on a Samsung TV)- Great price (got this when it was at intro price for JPrime member pre-order price)Cons:- Doesn't support my universal remote. Need to upgrade my Harmony One for that.- Lots of the \"Apps\" are pretty much garbage ... (History Channel for example ...) - but this is the same on Apple TV or Roku also- Remote is a bit primitive (for entering text and such ... ) but that is comparable to my old Roku or the Apple TV. Would like it to support the voice recognition ...- Ugly power wire and wall wart.", "verified": true, "helpfulness": "0/0", "author": "Zip \"techno nerd\""}, {"rating": 4.0, "review": "Exactly what I wanted and runs great.  The only downfall is that you can't turn it off, you can unplug it but thats a bit of a hassle. Overall the fire stick is worth the money and is another example of a great product from Amazon.", "verified": true, "helpfulness": "0/0", "author": "buyer"}, {"rating": 5.0, "review": "great and easy to use", "verified": true, "helpfulness": "0/0", "author": "robert doerfler"}]