[{"rating": 5.0, "review": "We had a bit of a wait..supply & demand,  I guess..but once we got it, Loving it!  We've already watched a movie.  I especially am enjoying my music.  We picked our own music selections and now we just enjoy!!  Enjoying it!", "verified": true, "helpfulness": "0/0", "author": "Lora M"}, {"rating": 5.0, "review": "Absolutely worth the money and very easy to set up and operate.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "How did I travel without this. I use this at home and it has more channels that we watch than Apple Tv.  We always stay at hotels with free WiFi and this plugs right into the TV and my kids can watch many of the programs they like. We have gotten rid of cable and save a ton of money with this. It has some fun free games available.  I will be buying another one as well as the game controller. I also love that I have the remote app on my phone and tablet; when my kids are watching and I need their attention I can pause it from anywhere in my house.", "verified": true, "helpfulness": "0/0", "author": "R. Syvertson"}, {"rating": 2.0, "review": "I keep losing audio.Also,I cannot delete unwanted pictures", "verified": true, "helpfulness": "0/0", "author": "Norman Quiel"}, {"rating": 5.0, "review": "Completely satisfied with my Fire Stick purchase. Set-up was extremely fast and couldn't have been easier. I would definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Daniel Kerr - Heritage Financial Planning, LLC"}, {"rating": 2.0, "review": "No. It did not meet my expectations. I have an iPhone and the connection is pretty weak to say the least.. It doesn't seem to work well at all.", "verified": true, "helpfulness": "0/0", "author": "JR Orlando \"Starship\""}, {"rating": 5.0, "review": "This passed my expectations !! Wonderful !!! I have prime membership on my tablet , and when I plugged in the Fire TV Stick (all I did was plug it in) It was already greeting me. It knew exactly who I was. Is that awesome or what !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to use.  Lots of movies and shows.  Great purchase.", "verified": true, "helpfulness": "0/0", "author": "rooCASE Capacitive stylus"}, {"rating": 5.0, "review": "Just received by Fire TV Stick over the weekend.  Install was as simple as can be and the UI is very user friendly and easy to navigate.  It basically turned my non-Smart TV in the bedroom into one that I can now access content from Netflix and Amazon Prime (as well as other options).  I would highly recommend as an easy and inexpensive alternative to upgrading your TV.", "verified": true, "helpfulness": "0/0", "author": "Karin in Atlanta"}, {"rating": 5.0, "review": "I love it.  I have been without a tv in my bedroom for years.  This way I can watch Netflix at night or when things need to get done.", "verified": true, "helpfulness": "0/0", "author": "klee2005"}]