[{"rating": 5.0, "review": "Easy to set up and simple to use", "verified": true, "helpfulness": "0/0", "author": "Joshua J Carrington"}, {"rating": 5.0, "review": "Love it, awesome!", "verified": true, "helpfulness": "0/0", "author": "Peter Montalbano"}, {"rating": 4.0, "review": "Excellent product for the price. Very powerful compared to competing products. I just wish you could rearrange the main homepage to includeNetflix, and that search included Netflix. It's obviously geared towards consuming Amazon products.", "verified": true, "helpfulness": "0/0", "author": "ASpenCO"}, {"rating": 3.0, "review": "Only one thing I did not like is that whenever you browse you don't know when you will be charged?", "verified": true, "helpfulness": "1/1", "author": "Hasmukh Patel"}, {"rating": 5.0, "review": "Wifi controlled remote is awesome.  No line of sight clicking required. High resolution video is great.  Only down side is no audio output Jacks from device.", "verified": true, "helpfulness": "0/0", "author": "David Johnson"}, {"rating": 4.0, "review": "Great little product!!", "verified": true, "helpfulness": "0/0", "author": "Carlos Gonzalez"}, {"rating": 5.0, "review": "Its great,", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 3.0, "review": "Gui is a little too specific to choose apps. It's strage to scroll through sideway from a category. I wish the home page was more inclusive like the Apple TV's homepage. It's still manageable. The device works well and streams without an issue. Happy I got it for the $20 prime sale.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 4.0, "review": "So far so good. I disconnected my Chromecast and use the Fire Stick to cover all of my streaming.", "verified": true, "helpfulness": "0/0", "author": "schultzy"}, {"rating": 5.0, "review": "Easy setup, almost instantaneous play of videos. Chromecast is so clunky and unreliable. Looking forward to HBOGo being added soon. Can't beat $20 price. Easy way to upgrade old smart tv to newer interfaces with Netflix and Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "E. Hansley"}]