[{"rating": 2.0, "review": "Wouldn't stream Netflix. After hours with phone support I just gave up and sent it back. Could have been a defective product, but decided not to try it again.", "verified": true, "helpfulness": "0/0", "author": "tellingitlikeitis"}, {"rating": 5.0, "review": "Great purchase. I do miss the voice control available with the box version—still, given the price, it's a great deal. LOVE Fire TV & have pretty much switched over from Apple TV.", "verified": true, "helpfulness": "0/0", "author": "G. Smith"}, {"rating": 5.0, "review": "This is an awesome devise for the price.  I have a more expensive android tv box, and I love that device too.  But honestly, who needs to check there email on the big screen?  This device is perfect for streaming movies, and you don't have to \"root\" the device to put KODI on it.  It's a great device that handles my streaming needs.", "verified": true, "helpfulness": "0/0", "author": "Jimmy E"}, {"rating": 2.0, "review": "Just slow when it comes to streaming movies. I am not highly impressed with its ability. It is annoying.", "verified": false, "helpfulness": "0/0", "author": "Yvonne Melendez"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Keith brooks"}, {"rating": 1.0, "review": "Needs to constantly restart the stick. Annoying", "verified": true, "helpfulness": "0/0", "author": "Jorge Castillo"}, {"rating": 5.0, "review": "This blows my mind. At first I didn't understand why we need it when we have a smart TV...it offers so much more that I was unaware of. I bought a second one for our TV in the master bedroom", "verified": true, "helpfulness": "0/0", "author": "Brian Flannery"}, {"rating": 4.0, "review": "'s OK.  Got this with Prime.  Don't use it much, though.", "verified": true, "helpfulness": "0/0", "author": "Patrick L. McHargue"}, {"rating": 5.0, "review": "With the Amazon Fire Stick, I no longer have cable. Great investment!", "verified": true, "helpfulness": "0/0", "author": "Annette R. Mays"}, {"rating": 5.0, "review": "Great little device to open up viewing options.", "verified": true, "helpfulness": "0/0", "author": "Charles R Smith"}]