[{"rating": 5.0, "review": "easy to set up simple to use", "verified": true, "helpfulness": "0/0", "author": "thom from ohio"}, {"rating": 1.0, "review": "I spent over 5 hours trying to hook this thing up....My television would not recognize it as a HDMI device. I' m not sure if the unit I was sent was just bad or what ....but I do know at a one time charge of $99 a year for Amazon I will be cancelling that too. Thanks for nothing Amazon", "verified": true, "helpfulness": "0/0", "author": "Jerry Zuehlke"}, {"rating": 5.0, "review": "I love the fire Stick.  Easy to use and sets up with ease", "verified": true, "helpfulness": "0/0", "author": "carol burgess"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "1/1", "author": "SAML"}, {"rating": 5.0, "review": "Exactly what I wanted!", "verified": true, "helpfulness": "0/0", "author": "hayley"}, {"rating": 3.0, "review": "It works but not as good as the Roku streaming stick, IMO.", "verified": true, "helpfulness": "0/0", "author": "J. Scott-Monck \"Tool Fool\""}, {"rating": 1.0, "review": "Stick can't stay connected to my wifi router which is 20 feet away.  Amazon customer service was abysmal.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "This product is better than I expected. I love it. I brought it so I could view my movies and play some games. The pictures are very clear and I am enjoying that you can play some games as well.", "verified": true, "helpfulness": "0/0", "author": "gamer55"}, {"rating": 1.0, "review": "Total piece of crap. Worked for all of about 15 minutes, just long enough for me to sign up for Amazon Prime and log into Netflix. Now it won't work at all. My settings say my wifi is \"very strong\" and my internet is definitely working because that's how I'm posting this review but when I try to go to the home screen it says Home is currently unavailable. Very frustrating considering I waited six weeks for delivery. Sending it back tomorrow and going with Apple TV which I already have in another room and have very little trouble with.", "verified": true, "helpfulness": "0/0", "author": "E."}, {"rating": 5.0, "review": "Love the fire stick! However a better set of instructions an user guide would be NICE.", "verified": true, "helpfulness": "0/0", "author": "B. Dibben"}]