[{"rating": 3.0, "review": "Enjoy Fire TV. It would be great if if there was a browser app.", "verified": true, "helpfulness": "0/0", "author": "P. Selby"}, {"rating": 5.0, "review": "My 6 year old loves it. I did not see much use for it (yet).", "verified": true, "helpfulness": "0/0", "author": "Raj Singh \"Raj\""}, {"rating": 5.0, "review": "Can't this function in Dominican Republic ??", "verified": false, "helpfulness": "0/0", "author": "Braden Perez"}, {"rating": 5.0, "review": "Fire stick is easier to use than the chromestick and has more options.  Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "David A Rundquist"}, {"rating": 1.0, "review": "I bought 3 of these, 1 for each child.  The fire sticks continuously lost the WiFi signal and locked up constantly - even with a very strong signal in the house that all other devices do not have any problems with. Some food for thought - I figured these would be a good alternative instead of having to rent 3 individual DTAs from my cable provider (due to the digital conversion) at $2 / per DTA and give the kids Fire sticks so they can stream movies. Turns out, all they really could use was Netflix because all the other apps require a participating cable provider, which Brighthouse was not. Then Netflix limits the basic plan to two streams, so I would need to pay an additional 4$ - for two more streams. All that aside - it was more cost effective to just get the DTAs. They can use their tablets and computers for streaming Netflix - if they really want it that badly.", "verified": true, "helpfulness": "1/2", "author": "cssmgt"}, {"rating": 5.0, "review": "Works great with a great variety to offer!!!", "verified": true, "helpfulness": "0/0", "author": "P Callaway"}, {"rating": 4.0, "review": "I bought this mainly for my wife since the Chromecast is a pain to play Amazon Prime videos.  It was super easy to setup and start using and she's been pretty happy with it.", "verified": true, "helpfulness": "0/0", "author": "anelson"}, {"rating": 1.0, "review": "Returned to store never worked correctly more trouble than it was worth. Got another streaming device from another manufacturer which is working flawlessly.o", "verified": false, "helpfulness": "1/1", "author": "FRANK LOWRY"}, {"rating": 5.0, "review": "so easy to use", "verified": true, "helpfulness": "0/0", "author": "Debra Smith"}, {"rating": 3.0, "review": "For some reason the device refuses to let me change the audio defaults meaning that I have to change every source from 5.1 to simple stereo. In addition, some small number of Amazon Prime videos do not allow me to make that change making the film a silent movie. Finally, while my Cromecaster works 80% of the time, this device loses WiFi connectivity at least twice as often...That said, when it works, it works great.", "verified": true, "helpfulness": "0/0", "author": "V. J. Verdolini"}]