[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I bought this at the intro price of 19.95.  I was pleased to find that it supports Netflix as well as Amazon Prime and so it is now my primary streaming device.  The interface is easy to use and the stick performs very reliably on my Comcast Wifi-N wireless network.The one down side I have found so far is that there appears to be a memory leak such that, after a few days of continuously on use, the networking will hang.  But doing a power reset quickly fixes that problem and then its fine for another few days.If they fixed the leak, I'd give it a full 5 stars.  Here's hoping.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey P. Kesselman"}, {"rating": 5.0, "review": "OMGosh, I love my Fire TV Stick!!! I have never had so much fun with my TV... now I barely watch TV proper, I'm always using my Fire Stick!I had company, and we were exploring the different things, apps, games.. types of games, music, movies, TV shows, Netflix, HuluPlus, and so much more that I had.  They were very impressed.I set it up in less than 2 minutes, and that included taking it out of its box! You get a HDMI extender, if you need it, the Fire TV Stick, and an electrical plug that goes into the Stick and an outlet.Plug the Stick into a free HDMI port on your TV, plug the electrical cord into a socket -- have the remote that comes in the box loaded with the batteries and next to the TV.I pre-ordered mine thru Prime Amazon, so it was preregistered. The Fire Stick sought out channels to connect to, registered itself, and all I had to do was put in my Wi Fi information... then I was up and running.  So sweet!Well, I hope you get one, I really like mine, and it is a great addition to my Amazon Prime account. I trust Amazon, I know that I am in good hands.  If you need something like this, I think this is really great.  Have Fun!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth J Pierro"}, {"rating": 4.0, "review": "A friend gave me the Fire TV Stick as a gift.  I live in an area where the best internet connection I can get is DSL. So far no problems with buffering, so I like the technology and content available.", "verified": true, "helpfulness": "0/0", "author": "Matthew J. Mcateer"}, {"rating": 5.0, "review": "Is every thing I expected.  Good color, sound & selections.", "verified": true, "helpfulness": "0/0", "author": "Judith Aucutt"}, {"rating": 5.0, "review": "I like it, fast", "verified": true, "helpfulness": "0/0", "author": "William Largen"}, {"rating": 5.0, "review": "This is awesome! Easy to install and operate. For the price. I'm going to order two more. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Kristian Verash"}, {"rating": 3.0, "review": "Its ok..Im not much of a tv watcher anymore...but its nice to have youtube on the tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Ryder"}, {"rating": 3.0, "review": "Interface is 5 stars.  Have had a little trouble with reception.  Looks like a fiem ware update might have fixed ime videos streaming.  And support had reset the device for Netflix to work.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}]