[{"rating": 5.0, "review": "One of the best items I ever purchased. Cable TV costs are out of control and I found we watched more Netflix anyway but we only had 1 Apple TV device. I ordered one of these for my room and canceled Cable altogether(saving me over $100 per month!). Loooove all of the HBO shows I can stream...loved it so much I ordered one for my daughters room. This is so easy to install and about 1/3 the cost of the apple tv device. Buy it! You wont be sorry!", "verified": true, "helpfulness": "0/0", "author": "Lynn Fagan"}, {"rating": 5.0, "review": "Easy to setup and use. Nice product!", "verified": true, "helpfulness": "0/0", "author": "Gretchen Lager"}, {"rating": 4.0, "review": "For some reason I can't get on to Hulu. And I tried to connect my Kindle to it and that doesn't work either.", "verified": true, "helpfulness": "0/0", "author": "blhall"}, {"rating": 5.0, "review": "Love this! Access live streaming apps and games quickly and easily.", "verified": true, "helpfulness": "0/0", "author": "Bonnie"}, {"rating": 5.0, "review": "Excellent a great value if your a Amazom Prime member", "verified": true, "helpfulness": "0/0", "author": "CRSPAG \"Olongaps\""}, {"rating": 5.0, "review": "Good image quality. Plenty of content. Ease of use", "verified": true, "helpfulness": "0/0", "author": "Oren Arad"}, {"rating": 5.0, "review": "Simply great device.... Worth the $35 I paid for it!!", "verified": true, "helpfulness": "0/0", "author": "Jude L. S. Pereira"}, {"rating": 5.0, "review": "I know it's early for a review but this was extremely easy to set up. We're traveling with work but the hotel didn't have smart T.V.'s. I ordered the fire stick, received it today, and set it up in about 5 minutes and now I'm watching a show. I was worried that the hotel wouldn't have strong enough Wi-Fi but no worries now. I'll update my review in a few months.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Believe me I am computer illiterate so I was worried I would need help setting it up. Lo and behold, everything was extremely easy and within 10 minutes I was watching my first movie. Amazon isn't kidding when they say easy set up. I think my dog could have done it. Well done as usual.", "verified": true, "helpfulness": "0/0", "author": "winston"}, {"rating": 4.0, "review": "Much better than Google TV minus the Internet but how much time do you surf the Internet with ur TV and Google tv? More and and games than Google Chrome however more options would be nice.", "verified": true, "helpfulness": "0/0", "author": "Ed Jackson"}]