[{"rating": 4.0, "review": "Overall a good value.  I've used the Fire TV Stick almost exclusively for streaming video and music.Pros:  responsive and intuitive interface, lots of content, apps such as Pandora are easy to navigate, the remote control is simple and works well, smartphone Fire TV app adds voice search which works quite wellCons:  I have a good 802.11n wifi connection but still get stutter streaming videos and even occasional stutter listening to music.  It's not a deal breaker but enough to be noticeable and keeps it from being a 5 star product.  Perhaps a firmware update could address the stutter.", "verified": true, "helpfulness": "0/0", "author": "waltcoleman"}, {"rating": 2.0, "review": "How do I review something that didn't work? I gave it 2 stars because I don't hate it and, based on the reviews, it works for a lot of people. Our wifi is one room over and we couldn't get a signal. Literally, the router is on the other side of the wall that the TV is on. It was easy to plug in, etc. I just wished it worked. We sent ours back.", "verified": true, "helpfulness": "0/0", "author": "Tammy"}, {"rating": 3.0, "review": "When the stick is disconnected from wifi due to loss of signal, it does not automatically reconnect to wifi. I have to unplug the power cord and hook it up again to reboot the device. This is really annoying. Cons: fast streaming, sleek design, good controller.", "verified": true, "helpfulness": "0/0", "author": "P. D. Tran"}, {"rating": 5.0, "review": "Love this product! Good job Amazon.", "verified": true, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 5.0, "review": "Great new toy", "verified": true, "helpfulness": "0/0", "author": "Morry Morganstein"}, {"rating": 5.0, "review": "Love watching You Tube on the big screen!  Also love the screen saver feature.  Fire TV is a must have for all Amazon Prime members!", "verified": true, "helpfulness": "0/0", "author": "JMG"}, {"rating": 5.0, "review": "I LOVE IT! I USE IT EVERYDAY!", "verified": true, "helpfulness": "0/0", "author": "Sarah Plain \"Chewys Mom\""}, {"rating": 5.0, "review": "It exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 5.0, "review": "Got this at the discounted price when first came out for my parents.  Figured it was cheap enough so why not?  They don't have smart TV's, but have the smart Blu-Ray players.  But it is limited on what it has, and doesn't offer Amazon Instant Video.  So I got them this, and is way less complicated than the blu-ray remote and much more responsive!  And the remote is small, and I don't need a guide to tell my Mom how to work it!", "verified": true, "helpfulness": "0/0", "author": "Sadie M"}, {"rating": 5.0, "review": "I got this for $20 as a Prime member before the holidays, so I've had it a couple of months so far. I figured I'd try it out. I have a few Roku players at home but they no longer provide the new software for them, so I cannot continuously play shows and the interface/software isn't very convenient to navigate thru.  So annoying.  And the quality was hardly ever full HD with the Roku. With the Fire TV Stick, it's always HD and it takes no time at all for it to automatically play the next show. It's just so useful, for both kids and adults. Setup was the easiest thing ever...I plugged it in, connected to my WiFi, and it showed my name on the screen and asked me to accept.  So friggin easy. I can finally utilize my Fios high speed internet while streaming movies and shows.I purchased another one for my kids' TV a couple of days ago and it's on back order for a month. I do have one minor complaint, which could be just an issue with my TV and not the Fire Stick: normally, I just hit a button on the Fire Stick remote and it turns the TV on & connects to the home screen of the stick.  But it's inconsistent.  Sometimes it doesn't work and i have to reboot the stick's power. Again, the issue may just be my TV.  It also stopped working on one of the HDMI ports, so I put it in a different one and it works fine. Although I have a pretty new HDTV, I need to troubleshoot this to see what the issue really is.I recommend this little device to anyone.  Especially if you binge watch shows!", "verified": true, "helpfulness": "0/0", "author": "Jen H. \"Jen\""}]