[{"rating": 5.0, "review": "got it free with my sling tv very happy with it i like it better than my apple tv because i like being able to search and download apps", "verified": true, "helpfulness": "0/0", "author": "Steve Crosby"}, {"rating": 1.0, "review": "I had high expectations for the fire stick. It had great reviews, however;  we have had nothing but problems with \" connectivity\" issues. Our internet service works fine with all of our other wireless devices and it says our connection is \"very good\" but somehow we cannot connect even with Netflix.  We tried resetting as advised by the troubleshooting prompts on the fire stick but still it will not work. I'm so disappointed.", "verified": true, "helpfulness": "1/1", "author": "Melissa Byerwalters"}, {"rating": 5.0, "review": "Got 2 cheap on intro preorder.  So nice I got a third at full price.  Super easy to use and great with prime.", "verified": true, "helpfulness": "0/0", "author": "Adam Kottas"}, {"rating": 4.0, "review": "The apps offered in this stick provide a great experience and is miles above ChromeCast due to having a remote and being independent of other systems such as a computer or tablet.  I do find however sometimes it can load slowly indicating it is a bit underpowered, but the videos still play just fine which is all that matters.Where this loses one star however, is what I found out about the other day.  This product will not work at all if you do not have an internet connection.  The other day my internet went out, but I figured since I have a local media server and Plex on the fire stick, it shouldn't be a problem since it would simply stream the movie locally.  Unfortunately the fire stick wont load any apps if it can't connect to the internet, including a local player such as Plex.  Quite frankly, this was a big disappointment since I was forced to use my tablet to watch the movie rather than my TV.Other than that issue, this product is great and I'll probably get more for the other TVs in the house.", "verified": true, "helpfulness": "0/0", "author": "meltingcube"}, {"rating": 5.0, "review": "Big improvement over my experience with a Roku stick (which I returned).  Installation and setup in less than 10 minutes (spent hours on the Roku and it never would connect to my wifi network).  Seems just as functional as my Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "Joe B Stanley"}, {"rating": 5.0, "review": "It's so easy to operate, inexpensive, and works great.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "I absolutely love it!!! So fast and easy to use. What a great purchase!!!", "verified": true, "helpfulness": "0/0", "author": "Orlando Rosales"}, {"rating": 5.0, "review": "Best money I've ever spent! I love my fire tv stick! It's so much more fun to watch movies on my tv than on my iPad when I'm at home! It was easy to plug in and to figure out! And it easily transfers from living room to bedroom!", "verified": true, "helpfulness": "0/0", "author": "Cheryl Clammer"}, {"rating": 4.0, "review": "it provides a pretty smooth interface for all the channel selections except on Netflix, dont really know how to access and make changes to the channels.", "verified": true, "helpfulness": "0/0", "author": "Jackie Lee"}, {"rating": 5.0, "review": "High quality and easy to install product.  Exceptional quality of video on my 1080p HDMI TV.", "verified": true, "helpfulness": "0/0", "author": "Elderly One \"Bob\""}]