[{"rating": 4.0, "review": "I am trying out the Fire tv stick, replaced my Chromcast with itSo far I like it, installed an app on my phone to use as a second remote.Picture good and sound very good on my Bose speakersI think it is simpler to use than the Chromcast", "verified": true, "helpfulness": "1/1", "author": "Joe"}, {"rating": 1.0, "review": "I don't have cable so I mainly get my TV fix from Netflix which was a built in app on my TV. I also had Amazon prime which I never used because the user interface for the TV app was horrible to work with. Installation and set up was quick and easy. The user interface was nice and smooth and I finally started using my Amazon Prime instant video. I also built a Plex Server. The Fire TV stick worked well with steaming TV shows, but had frequent stuttering issues with when trying to play movies or HD TV shows (anything above 420p). I read that the app version of Plex was 4 versions behind the Google Play version. Not sure why that is the case, but eventually I found the uninstalling and re-installing the app fixed almost all stuttering issues. I still get the occasional stuttering once in a while. But other than that, the device works great. I use it daily issue free, but on rare occasions the Fire TV Stick, Netflix app, or Plex app will crash, but I guess something like that can be expected.Update March 1, 2015: The lack of stuttering was short lived as it still happens regularly. Netflix crashing happens a few times a week. The remote will randomly stop working so I'll have to use the phone app to do anything. The OS will also lag regularly. So many bugs, should of gone with another device. But I only paid $20...", "verified": true, "helpfulness": "0/0", "author": "Mike J"}, {"rating": 4.0, "review": "Was fairly easy to install. I thought the Advertisment said I would get a year free Prime but now it says one month. The layout is nice and easy to get around on. Question though, if this is supposed to be prime then why do they ask me for money to watch a tv show series? Well, I use Netflix anyways. 4 out of 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Brian Eckert"}, {"rating": 5.0, "review": "Wow now I can dial up everything who needs cable Anymore. Great site.", "verified": true, "helpfulness": "0/0", "author": "sz"}, {"rating": 3.0, "review": "Works great when using it, however....we have a Panasonic 42\" plasma flat screen and with the fire plugged into hdmi while we watch regular cable...the television will loose sound and flicker usually about once every 30 minute or so. If we unplug the firestick from the hdmi, television works fine therefore fire stick causing some sort of disturbance.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "Love this.  It was easy for me to install and I know very little about computers or TVs.  The biggest problem I had was trying to open the case for the batteries on the controller.  You have to push down and slide back before you can open it.", "verified": true, "helpfulness": "0/0", "author": "Mary Crosby"}, {"rating": 1.0, "review": "Received it for Christmas. Also received a chromecast from another daughter. Tried the fire stick first. They say easy to install. I entered all the information. It ask for your amazon account. I entered it said no account. So I get on my laptop next to me and enter my account and pops right up. So I continue for over an hour trying account information and nothing. Even tried creating a new account and didn't work. Remote was difficult to use. The daughter who bought me this was heartbroken. So I try to find tech support either on line or phone. Zero Zero Zero support. Zero Zero Zero Zero Zero Zero support. Just send them your money and your on your own.So put in chromecast and started watching movies in less than 20 minutes. Used my cell phone to program. Could not have been easier.One last comment I have no attachment to either product but fire stick sucked.", "verified": true, "helpfulness": "2/2", "author": "Mike R."}, {"rating": 3.0, "review": "I expected to see a way to get Podcasts, but haven't found a way ... Yet.", "verified": true, "helpfulness": "0/0", "author": "Barry I. Gamble"}, {"rating": 5.0, "review": "puts chromecast to shame", "verified": true, "helpfulness": "0/0", "author": "johnnie brown"}, {"rating": 5.0, "review": "Easy set up, super fast, excellent selection", "verified": true, "helpfulness": "0/0", "author": "HAEvans"}]