[{"rating": 5.0, "review": "This was easy to setup. I wish I could say the same for keeping it connected to my wifi. Buffering anywhere from every 30 seconds to every 10 minutes on my 40mbit line. Sometimes it drops the connection totally. I am stumped as it shows the wifi signal at full strength. Tried to power cycle it, no change.Edit: for whatever reason, when I tried it again tonight, it has been running flawlessly. Leads me to believe this is network related and have changed to five stars. Could not have bought anything better for 19.99.", "verified": true, "helpfulness": "0/1", "author": "Brandon"}, {"rating": 4.0, "review": "Bought both a Roku stick and a Fire TV stick. The Roku stick is slow as shtanka.  Netflix takes close to 4 minutes to launch. The Fire stick is instantaneous. Plex on the Roku gives only one thumb in a series at a time. Fire TV shows a screenful with synopsis. No synopsis on the Roku. Roku search searches all services (but not Plex). Fire TV only searches Amazon Prime Video. Even so; Amazon for the win.", "verified": true, "helpfulness": "0/0", "author": "Michael Alessio \"Travel Addict\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Ian"}, {"rating": 5.0, "review": "AMAZING! Simply amazing! Just make sure its not mounted without using the included extension cable or it could overheat and pause randomly.", "verified": true, "helpfulness": "1/1", "author": "WHAT"}, {"rating": 5.0, "review": "Very easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Todd Henrotin"}, {"rating": 4.0, "review": "Very good I'm happy with it. The only downside is that if I want to put it to 'sleep', I have to click too many buttons to get there. Should be easier, it does not do it automatically after a few minutes of inactivity. Also, the navigation could be set up better to separate apps from prime, and to have easier access to wishlist.Still, good product. I'm happy I got it. I tried other vendors' and they never worked right.", "verified": true, "helpfulness": "0/0", "author": "Nelly Sabel"}, {"rating": 4.0, "review": "There needs to be more free stuff!", "verified": true, "helpfulness": "0/0", "author": "Felicia Thompson"}, {"rating": 5.0, "review": "I'm very pleased with this. It is a breeze to use and makes it easy to watch what I want on my schedule.", "verified": true, "helpfulness": "0/0", "author": "Eddie Sells"}, {"rating": 3.0, "review": "When i initially got the fire tv stick, i was happy. It connected easily, synced with my account and prime. It was easy and clear to use. Then after about 3 days i started having issues with it.  First, the audio wouldn't sync up with the words (in hulu & netflix apps) which is pretty annoying. And then it started dropping my wifi. Now it will not even connect to it. It's very frustrating, especially because i like the product, but it's just a paper weight if it won't connect to my wifi at all. Everything else connects just fine to my wifi and has no issues, so i know it's the Fire TV stick. I hope this issue is fixed soon as i have read plenty of people are having this same issue.As it is now, i do not suggest this product, unless they fix the wifi connectivity issues. If they do, then i highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "olivia"}, {"rating": 5.0, "review": "This product does everything it says it will do. We are very satisfied.", "verified": true, "helpfulness": "0/0", "author": "S. Krejci"}]