[{"rating": 3.0, "review": "It was a little hard for me because I'm not gadgets savvy. It also didn't support the main reason I brought it for: to watch my vudu movies on tv comfortably. It's still a good product and I would buy it again if it wasn't for watching movies", "verified": true, "helpfulness": "1/1", "author": "darlene bell"}, {"rating": 1.0, "review": "I was disappointed. I have Netflix and almost every movie or show was on the fire stick.alot if repeats. I barly use it cause I have to unplug the playtion or the cable box to make room to plug it in.it was easy to set up", "verified": true, "helpfulness": "1/2", "author": "kelli"}, {"rating": 5.0, "review": "I ditched cable and after using a FireTV box on the large TV in my living room, and thinking it was the best thing since sliced bread, I just got the stick for tye small TV in my bedroom.  Love the stick!!  There have been no snags, no network drops (unless the fault was with the network) and performance has been seamless.  I can start watching something in the living room and finish it in the bedroom.  I use the toggle - you just pop the device into an HDMI port and you're good to go.  Awesome!  8)", "verified": true, "helpfulness": "0/0", "author": "Wendy Ritch"}, {"rating": 4.0, "review": "Well it does all we wanted it to do in our bedroom for late night watching. Inexpensive if you already have membership to the several offerings. My only dislike is that there ins't a turn off option other than physically removing the charging cable. Really dislike that.", "verified": true, "helpfulness": "0/0", "author": "J. Verma \"brazilianloser\""}, {"rating": 5.0, "review": "Works great. Glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Joker592250"}, {"rating": 5.0, "review": "This is a total bargain!The set up was extremely easy, and the price was just right.Plus after I plugged it into my tv, it was already registered with my Prime account, and had my watch-list and everything already up and ready for me to go. The only think I had to do was log in to my Hulu and Netflix accounts. I am looking forward to streaming my favorite shows and movies on my TV now!", "verified": true, "helpfulness": "0/0", "author": "Kirstein Arpin"}, {"rating": 4.0, "review": "It was delivered to the wrong address", "verified": true, "helpfulness": "0/1", "author": "Elizabeth Osworth"}, {"rating": 5.0, "review": "Love it, worth it!", "verified": true, "helpfulness": "0/0", "author": "Happy in SC"}, {"rating": 4.0, "review": "we like it...", "verified": true, "helpfulness": "0/0", "author": "Rick Ennis"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Jessica Cortese"}]