[{"rating": 5.0, "review": "Great item, works perfectly, everyone needs one.", "verified": true, "helpfulness": "0/0", "author": "B&B"}, {"rating": 5.0, "review": "Best Value for a product in comparison to all others.", "verified": true, "helpfulness": "0/0", "author": "harry"}, {"rating": 1.0, "review": "What a disappointment!  After waiting through an interminable back order, it finally arrives and I find out the Stick that plugs into the HDMI port also needs to be connected to 110V electrical power.  I ask, how many of you have a convenient electrical outlet next to your wall-hung large screen TV?  Not many.  I'm sending it back...", "verified": true, "helpfulness": "1/1", "author": "John L. Settles"}, {"rating": 5.0, "review": "I've been using the fire stick for a week, and it does exactly what I wanted it to do. Set up was super easy, and the streaming is seamless.  I basically just wanted to be able to watch Amazon tv from my room, and I'm a Prime member so there are a lot of free shows. So, if I come across any problems I'll be sure to come back and change my rating.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Bookaholic\""}, {"rating": 5.0, "review": "Very simple to install and set up.  Easy to navigate as well.", "verified": true, "helpfulness": "0/0", "author": "Grams"}, {"rating": 4.0, "review": "Prime needs to have more movies its kind of limited.  And the movies it does have are not good.", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 3.0, "review": "I was hoping to mirror my iPad on a bigger screen but of course fire tv does not support mirroring iOS devices. It would have been better to know that before I made the purchase and wait three weeks for it to arrive. I will be returning it for that reason.", "verified": true, "helpfulness": "0/0", "author": "Rick bryan"}, {"rating": 1.0, "review": "I'm not sure how the Fire TV Stick was Miracast certified, it works with none of my devices. I purchased it purely for the wireless display feature. I have used Chromecast, Roku, HTPCs and even Raspberry Pis that perform much better than this limited device. Not what I expected from Amazon.", "verified": true, "helpfulness": "0/1", "author": "William D"}, {"rating": 5.0, "review": "Sad to have to admit this because I love chromecast...but this is better! More options, more user friendly, and having a dedicated remote is SO much nicer than I expected it'd be...  Firestick is the best on the market right now, hands down!", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "pretty cool but I cant get to you tube, which sucks", "verified": true, "helpfulness": "0/0", "author": "Ben B. Photography"}]