[{"rating": 5.0, "review": "I have a PS3, Wii U and my PC connected to my tv (for Netflix viewing etc). After I got the Fire stick I have come to only use it instead of my other devices for Netflix. It's easy to use and I love how activating it will auto-switch my TV input.", "verified": true, "helpfulness": "0/1", "author": "Julio C. Bernard"}, {"rating": 5.0, "review": "I have a Fire Stick and it works so well that I bought this one to give as a present this coming Christmas.", "verified": true, "helpfulness": "0/1", "author": "Willow"}, {"rating": 5.0, "review": "Love it!  Needed this for a long time. lol  It's nice to have so much variety at your fingertips.  Very user friendly. Now I need to get the joy stick to play the games. That's next!", "verified": true, "helpfulness": "0/1", "author": "prettyinink"}, {"rating": 4.0, "review": "I got rid of cable and replaced it with this. I have not been disappointed. It does take some getting used to but I've been doing it for several months now and it seems normal. The only thing that I wish is that Prime would write a description for every movie or tv show, and highlight the background of the description so if your TV is a distance from your table or bed or whatever you can see it, and offer trailers for all movies ( old and new alike) Back to the descriptions....they could have it to where the description could be read aloud by some kinda Prime IVR.", "verified": true, "helpfulness": "0/1", "author": "Atlproctor"}, {"rating": 4.0, "review": "Super easy way to make your old TV smart (or at least smart enough!) - works great.  I should get three more.", "verified": true, "helpfulness": "0/1", "author": "mhazel"}, {"rating": 5.0, "review": "This works great and is easy to install.", "verified": true, "helpfulness": "0/1", "author": "carol mccann"}, {"rating": 3.0, "review": "It's slow to load.", "verified": true, "helpfulness": "0/1", "author": "Angela"}, {"rating": 4.0, "review": "Love the fire stick. The wide range of apps is great for any TV.However, the stick needs to be plugged in to your tv or through an A/C adapter. More frequently however, the wall with an A/C Adapter. I recently went to a hotel and brought the stick with me and it continued to shut off and reboot over and over when I tried plugging in the USB to the TV.", "verified": true, "helpfulness": "1/2", "author": "Michael Reyes"}, {"rating": 5.0, "review": "I don't know how I lived without one of these great little devices until now.  Very easy setup and easy to use.  My TV was not smart and I considered getting a blue ray player just to make it smart.  This is even better because there is no bulk.  Just plug one end into the HDMI port of your TV and the other end into an electrical outlet and you're ready to watch!  And it's portable so you can move it from TV to TV, even into hotel rooms!", "verified": true, "helpfulness": "0/1", "author": "Lynn"}, {"rating": 5.0, "review": "I love it,  after watching all my Prime moveis and shows on my Kindle, I can now watch them on the big screen.  It works great.  I should have bough 1 for each TV in my house.  I got it on sale for $24.00,, but its well worth the original price of $40 bucks.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]