[{"rating": 5.0, "review": "I found my Fire Stick at a Best Buy, I will say this is one of my best purchases I have made in a long time. I chose the Fire Stick over the regular Fire TV for mainly price and not sure about the product and how good it would be upon initial purchase, all I can say now is this is a purchase you will not regret and in fact I will be getting another one or the Fire TV soon as its specs are better.I live in a rural area and the fastest internet I can get is around 1.5 to 2mbps and even with the slower speeds I have this thing streams Netflex, Plex, and most streaming services without much stutter or buffering. Amazon Prime Video buffers a little due to the higher def but nothing is unwatchable. If you are a Prime Member then this is a no brain purchase, even if not it is still a good buy for the price and all the other streaming apps and some of the games you can put on this device. The remote works good even though seems a little clunky at times but I have downloaded the Fire TV remote for IOS and it gives the speech search function and flows a lot better, so would recommend using the app or perhaps upgrading the remote. In closing, once you find out everything this little device is capable of, you will love it and got more bang for the buck then almost any other form of entertainment you can buy.", "verified": true, "helpfulness": "0/0", "author": "Shawn Phelan"}, {"rating": 5.0, "review": "I have no complaints about this item, and it actually streams very well. Then again, I am not a picky person. It is very easy to transport between rooms if I need to watch somewhere else. I love that I can easily watch whatever I want at the click of a remote, especially since I am not a TV person. I am a Netflix, Hulu, Amazon Prime, Plex kind of watcher. For $50 you can't beat it! Maybe the Chromecast or Roku is \"better\" but if you just want an easy TV show and movie watching experience, this is a great investment.", "verified": true, "helpfulness": "0/0", "author": "J. Ness"}, {"rating": 3.0, "review": "hopefully I will like this Fire TV stick better.  Disappointed after watching Boardwalk Empire, Season 1, that Season 2 would be a charge for each episode.  This was not made clear before starting series,  Info given was title and 5 seasons.", "verified": true, "helpfulness": "0/0", "author": "martha baldwin"}, {"rating": 4.0, "review": "I prefer it to cable, I wish I didn't need cable subscriptions for hbo and showtime, I wish I could pay for them like hulu or netflix, but as far as the fire stick goes, I am happy", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 4.0, "review": "I have enjoyed this a lot more than I thought I would.  I never really warmed to streaming content until I was enticed by the price to try the Fire TV stick.  Prime membership means a LOT of content is available to me at no extra cost.Here's the downside, though.  My remotes have been multiplying like frenzied rabbits, so I want to go to a universal remote.  No dice! At present, no one seems to offer a universal that can drive both bluetooth and IR devices.so I can't incorporate Fire TV into the universal.  So what would be great is an IR relay accessory that receives IR codes and re-sends them as the corresponding bluetooth command; alternately, it could relay commands over the wireless link.The latter would probably work better because bluetooth can only pair,  It doesn't like threesomes.Besides, the Fire TV remote is too friggin' small for my massive mitts.", "verified": true, "helpfulness": "0/0", "author": "D. E. Toland"}, {"rating": 5.0, "review": "Contrary to some reviews here, mine actually connected and worked fantastically - right out of the box.Sure, it drops signal every once in a while.  But that's only happened twice since I purchased it (far less than my old roku did).It streams well and offers very good quality.  The only drawback is the search feature is a bit of a pain...  but it's no reason to not love this device.", "verified": true, "helpfulness": "0/0", "author": "Talgok"}, {"rating": 5.0, "review": "Great.If you have a Panasonic TV, and you get a weird flashing green screen after a few minutes of using this, TURN OFF Pixel Orbiter and it'll fix the green-ness. Enjoy!", "verified": true, "helpfulness": "0/0", "author": "A Customer"}, {"rating": 5.0, "review": "Very easy to use...even for the technologically challenged", "verified": true, "helpfulness": "0/0", "author": "Candice"}, {"rating": 1.0, "review": "I love the simple design.Has never connected to my WiFi. Searches and finds but will not connect.  Called customer service 3 times without success.  Called again this morning and was transferred to 4 different people and the problem is still not solved.  Returning today.", "verified": false, "helpfulness": "2/3", "author": "PAMELA"}, {"rating": 4.0, "review": "fire stick works well for amazon prime just what I needed since I do not have netflik", "verified": true, "helpfulness": "0/0", "author": "Delta Phelps"}]