[{"rating": 5.0, "review": "works as advertised. great product", "verified": true, "helpfulness": "0/0", "author": "D. M. Seymour \"dmsapple\""}, {"rating": 2.0, "review": "It worked for a few days and then would not hold my network.  I expected better.", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Brian K Morris"}, {"rating": 3.0, "review": "Great features, much better then other similar devices on the market. Only issue so far is it tends to re-buffer even though it's close to a hi-speed router. Would have been a five star if it wasn't for that.", "verified": true, "helpfulness": "0/0", "author": "Les"}, {"rating": 5.0, "review": "One of the best purchases I've ever made! Setup was so easy, worked right out of the box, was even set up specifically for me. I use this primarily for Netflix, and it works beautifully on this device. I have previously used the Roku, and I never liked how the episodes for TV shows were so unorganized. On the Fire Stick, however, TV episodes are organized by seasons, and play through to the next episode without hesitation. Works very quickly, only buffers every so often. The remote works very well, you don't even have to point it near the fire stick, it's programmed to work specifically with yours. However, I mainly use the iPhone remote app to control it. Which is wonderful in my opinion. The only little negative thought I have on this is how you must have it plugged into an outlet most of the time. It is not an issue for me, I just think they should make that known for potential buyers.", "verified": true, "helpfulness": "0/0", "author": "Rachel Dutterer"}, {"rating": 5.0, "review": "Love my new Fire TV Stick.  My Apple TV stopped working so I was looking for a cheaper device that I could also watch Amazon Prime movies and shows with.  It was super easy to install and easy to use as well.", "verified": true, "helpfulness": "0/0", "author": "Megan K. Dunlavey"}, {"rating": 2.0, "review": "just got mine in the mail,im super excited to try it out! Kinda sad i wasnt able to get it at the price that some of u got it at($19) but never the less i think im going to LOVE it:)wll rate again later after i use.......", "verified": false, "helpfulness": "0/1", "author": "Deadra"}, {"rating": 1.0, "review": "I had high hopes during setup, but it couldn't access more than 5 seconds of a program.  It blamed the speed of my computer, which doesn't seem to be a problem when I run Netflix through my blu-ray player.  So maybe order the box and see if it will be able to do a better job finding my computer signal.  But I will probably just skip it and wait to buy a TV that has Amazon capability.", "verified": true, "helpfulness": "0/0", "author": "James D. Taylor"}, {"rating": 4.0, "review": "Watch Out Apple TV! :)", "verified": true, "helpfulness": "0/0", "author": "Rudy Young"}]