[{"rating": 5.0, "review": "Great streaming device.  I purchased 2 to wise up some not so smart TVs.  Like the fact that they are portable and can easily be moved to a different location.  Both Fire TV sticks work great thus far.  Set up was hassle free.  After connecting both units, they completed an update (that did take 10-15 minutes) and I was able to start streaming prime content and more.  The interface is easy to use and quick.  I was surprised to see lyrics (for most songs) on the screen when I tried the Prime Music app.  I am looking forward to exploring more features as time permits.", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 5.0, "review": "Very nice, easy and convenient to set up. Though, when signing up for Disney Jr. I find it is not available at least with my carrier, Directv.  Still liked the ease of sign up and use", "verified": true, "helpfulness": "0/0", "author": "Shopper"}, {"rating": 4.0, "review": "Great little device, it would be perfect if the remote included a microphone for voice search,  and if they offerd  multiple users account option or a guest account option.", "verified": true, "helpfulness": "0/0", "author": "Chump"}, {"rating": 5.0, "review": "Love this no more shaking WII remote. This is so much easier.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great. Love it!!", "verified": true, "helpfulness": "0/0", "author": "Dennis Cashwell"}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "William S."}, {"rating": 5.0, "review": "sideloaded xbmc, everything works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"chewysweettarts\""}, {"rating": 5.0, "review": "Love it, easy to install. Easy to understand. Alot more organized than my blue ray player.", "verified": true, "helpfulness": "0/1", "author": "Sandy Hall"}, {"rating": 4.0, "review": "I am very pleased with the Fire TV Stick. Having a little trouble getting iHeart radio though.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "Easy set up, the app makes searching a piece of cake (using the onscreen keyboard with the limited results is tough) nice image, sounds great through the surround sound! Gaming not a big thing on the stick (for me) though much better the Chromecast (which I also have) mirrors the screen from my Moto X easily using Miracast, the only reason for no 5 stars (and its a leftover from Chromecast) I like finding videos only available in a browser and there is no facility to cast from a browser. Other than that great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]