[{"rating": 4.0, "review": "Great streaming device,  does everything that's advertised plus some. Is fast and awesome for Amazon Prime video streaming,  as well as Netflix.  But will not replace your Chromcast.  Amazon stick is for Amazon Prime  like Chromcast is for Google Play.  Indispensable of one another and both brilliant in their way.", "verified": true, "helpfulness": "0/0", "author": "S. Dobrescu"}, {"rating": 1.0, "review": "So after waiting over 2 months to finally receive it, it doesn't work! I have prime and keep getting this error page on everything we try to watch, very frustrating!", "verified": true, "helpfulness": "133/152", "author": "Elizabeth Derencz Wolfe \"Libby\""}, {"rating": 5.0, "review": "Wonderful product, I have been using it a few weeks. My family loves to play the games it is a great option if you can't afford a more advanced gaming system and it is nice to be able to purchase movies directly to my tv without needing a dvd player!", "verified": true, "helpfulness": "0/0", "author": "Megan Blum"}, {"rating": 4.0, "review": "It works fine, but I just signed up for AcornTV and was hoping the Fire Stick would allow me pick that up also, but it doesn't.  May I suggest adding that to your list of available stations.ThanxStu", "verified": true, "helpfulness": "0/0", "author": "S B"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Beth Brunson"}, {"rating": 2.0, "review": "Comcast does NOT support any of the TV Apps such as A&E;, History, Lifetime.  At this point the only benefit of Fire TV is I get to have the ease of a remote when watching Netflix or Prime videos.  For the last year I've been doing the same thing by plugging my computer into the HDMI cable...expect when using the computer I can actually watch my Comcast shows as well!  I will return it if I can.", "verified": true, "helpfulness": "0/0", "author": "Bianca"}, {"rating": 1.0, "review": "So, when we try to watch Amazon streaming movies or shows on our Fire Stick----it skips and pauses, especially the sound.  So, we've watched You tube on it fine, but when we use it for what we got it for---I'm a prime member and want to watch streaming---we can't.  We had to go back to watching Amazon streaming on our 4 year old blu ray player.  Is that something anyone else has encountered?  is there something we can do?", "verified": true, "helpfulness": "1/1", "author": "Elizabeth A Haungs"}, {"rating": 5.0, "review": "Works great - so far we have only used it for watching Prime TV but we're very pleased.  Loads way faster than our PS3 did and the remote is a nice little tool.", "verified": true, "helpfulness": "0/0", "author": "Thomas E. Stephens"}, {"rating": 4.0, "review": "Best streaming TV stick. One thing to note is that it is very powerful which may require you to plug into a wall outlet as many TVs have an under powered USB port. Would like to see more apps added soon.", "verified": true, "helpfulness": "0/0", "author": "mcnadnerb"}, {"rating": 5.0, "review": "I've only had this thing for two days and i already love it. It is so easy to use that i am recommending to a friend who is unhappy with her Roku. Great connection, great remote response and good selection of apps.", "verified": true, "helpfulness": "0/0", "author": "Mean Jean \"really good at naps\""}]