[{"rating": 5.0, "review": "Easy to use and works beautifully so far.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love it but I would love it more if it supported YouTube as well", "verified": true, "helpfulness": "0/0", "author": "Bruno Raimondo"}, {"rating": 4.0, "review": "Probably my internet connection but stops to load a lot.", "verified": true, "helpfulness": "0/0", "author": "Allison Krulwich"}, {"rating": 4.0, "review": "I initially bought this because I wanted a low-risk way to dip my toe in the waters of living without cable. I don't think I will need to try and upgrade to any other device. This exceeded expectations. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Joseph W."}, {"rating": 5.0, "review": "Love love love the Amazon Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Chelsea Keel"}, {"rating": 5.0, "review": "This is my second Amazon Fire purchase!  My first was the bigger model, although it is tiny too.  It's a fantastic option for tuning in to Netflix and Hulu but you can also get Amazon Instant Video, video games, free movies and series through Fire!  100% improvement from the Wii I had been using!  I can't think of ANY drawbacks, only pluses,  AAA++++++. This model is smaller and directly attaches into my TV but it gives the exact same features the bigger one does!  Sometimes I think there is a little lag time with Netflix, but it's on Netflix's end.", "verified": true, "helpfulness": "0/0", "author": "Barbara \"Purplependulum\""}, {"rating": 2.0, "review": "You have to pay for most stuff especially for kids.", "verified": true, "helpfulness": "0/0", "author": "Leann"}, {"rating": 5.0, "review": "Enjoying this purchase and the ability to watch all seasons of the Wire for free with my amazon prime membership", "verified": true, "helpfulness": "0/0", "author": "CC"}, {"rating": 4.0, "review": "great little device doesn't take up much space and I've had no connectivity issues thus far", "verified": true, "helpfulness": "0/0", "author": "kay"}, {"rating": 4.0, "review": "Everything worked as described....except for the remote.  It's very cheaply made and was extremely hard to put the batteries in place.  Other than that....I am satisfied.  John (Flip)", "verified": true, "helpfulness": "0/0", "author": "flip"}]