[{"rating": 5.0, "review": "Love it. Pretty amazing really. Able to navigate Netflix fairly easy but it's 4x better streaming than the Netflix site itself.", "verified": true, "helpfulness": "0/0", "author": "Robert L Jones"}, {"rating": 5.0, "review": "This works great and is a lot of fun. I actually leave it set up all the time and mostly use it for netflix. I do find it a pain having so many remotes but I find it less of a pain than having to watch netflix online. Great quality and price it's perfect for me. Also if you have Amazon Prime you can use it for amazon movies and tv shows", "verified": true, "helpfulness": "0/0", "author": "Nic&Kev"}, {"rating": 5.0, "review": "Bought this as a gift for someone who has no tv reception but does have wifi and Amazon Prime.  Works like a champ!  Now they can watch their Amazon Prime movies and videos on tv rather than their much smaller computer screen. Great product!", "verified": true, "helpfulness": "0/0", "author": "Need To Know"}, {"rating": 5.0, "review": "This is definitely a must have, especially if you have children.  I have a subscription to Netflix and kind of forgot I had ordered this and tonight we were in the mood to watch something that wasn't available OnDemand or on Netflix.  I set up the Fire Stick in a matter of seconds, the introduction video was not needed and annoying, but it is only a couple of seconds long.  I downloaded the Amazon Photo and Fire TV apps so I can see home videos from my phone on my TV, love this option!  I also like the TV app because you can use the voice remote option with it.  Still testing this out, but so far so good.  I can't believe I've had this for a few months and let it sit there.  If you have family with Amazon Prime I also think this is a great gift.", "verified": true, "helpfulness": "0/0", "author": "kmentz"}, {"rating": 1.0, "review": "Videos skip or buffer constantly. Sometimes it will just crash and freeze... Back to the Apple TV.", "verified": false, "helpfulness": "0/0", "author": "Joe infanti"}, {"rating": 1.0, "review": "I regret not reading the 1000 technical questions posted as a red flag to this product that still needs to go through numerous updates before it is worthy for the general public. I attempted to set it up from right out of the box and directions. WARNING: No where, no where on it does it state that you need to go to 'settings' on your television remote and scroll down to Fire TV Stick to start the process. I mistakenly clicked 'parental control' after the initial set up and was immediately trying to reverse out by hit the reverse button and could NOT get out. Why? because The up/down/side to side arrows created numbers and I am now stuck in verification page 2/2, no way to get out and NO instruction manual.Here is another huge red flag about this product: there are support manuals for sale! Sending it back!", "verified": true, "helpfulness": "2/2", "author": "Kauai"}, {"rating": 5.0, "review": "Great for movies and video games!", "verified": true, "helpfulness": "0/0", "author": "Nicole Lillie"}, {"rating": 5.0, "review": "The fire stick is awesome the remote makes it very easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Sandra Cabaniss"}, {"rating": 5.0, "review": "I was apprehensive about purchasing the Amazon Fire TV Stick, but I am so glad I did!  It was incredibly easy to set up. It probably took about five minutes, honestly. It is easy to navigate, and I love being able to have all of my favorite programs right there, and accessible to me at any time.", "verified": true, "helpfulness": "0/0", "author": "Samantha W."}, {"rating": 5.0, "review": "Having family fun using the Fire TV Stick to catch up on our movies and shows. Easy to use. Can't wait to take it along on vacation with us!", "verified": true, "helpfulness": "0/0", "author": "Sonshine"}]