[{"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Paige"}, {"rating": 3.0, "review": "Lowered my rating because I'm not able to view Crackle shows using my Fire Stick. This could be a Crackle/Fire Stick combined issue, because I am able to watch Crackle shows from my Vizio Smart TV and computer, but not from a TV using the Fire Stick. It starts out okay, but after the first set of commercials I get an error that says \"An error has occurred while playing this video.\" Everything is hooked up correctly and I'm able to watch Netflix and Amazon using the Fire Stick without any problems.", "verified": true, "helpfulness": "0/0", "author": "My Amazonian World"}, {"rating": 5.0, "review": "WORKS AS ADVERTISED STILL LEARNING ALL OF THE OPTIONAL CHANNELS BOB", "verified": true, "helpfulness": "0/0", "author": "ROBERT M SMITH"}, {"rating": 3.0, "review": "Not too bad of a stick. The remote through the iOS app is extremely senstive. No ABC or TNT app. I would like to see the HBOgo and Spotify app improved.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "To me, Fire TV stick is better than the ROKU and other devices.  I really enjoy watching Netflix or Amazon movies using this device.", "verified": true, "helpfulness": "0/0", "author": "teachermom \"teachermom\""}, {"rating": 4.0, "review": "Not as fast loading as the Amazon Fire TV but the price is a lot better.  I use on a second TV to Netflix and Amazon Instant Video.  I never use for games, etc.  It loads and runs fine. I have never had a video stop to buffer the file.  If you are going to use for gaming I would definitely recommend the more expensive Amazon Fire TV.  It works exactly the same as the Amazon Fire TV but without the microphone search option.  The microphone search works best on Amazon Instant Video so it is not much good to me since I use mostly Netflix.  Very easy to use and setup.I did notice that the Fire TV Stick gets warm if left plugged in even when not using.  Since I use mine on a second TV only occasionally I unplug the AC adapter when not using.  I would recommend to a friend.", "verified": true, "helpfulness": "1/1", "author": "Ray"}, {"rating": 2.0, "review": "Not impressed, but has to do with my crappy internet connection.  Roku works better for me.", "verified": true, "helpfulness": "0/0", "author": "Amazon_user"}, {"rating": 4.0, "review": "The fire TV stick is wonderful and has allowed me to cut cable (or in my case Directv) out of my life completely.Pros: (1) Its fast and responsive.  (2) What apps are available are nice and have well designed interfaces. Netflix is particularly nice.  (3) The remote is rudimentary but serviceable. It lacks the voice search feature, but I have never used that particular feature on the Fire TV. If you heart is set on the voice search feature you can use the android app, but it is one of the ugliest and least well designed apps that I have ever used.  (4) Streaming your local content works amazingly well even though its wi-fi only.Cons: (1) The UI is horrible. There is no way to search for Amazon Prime Videos, forcing you to go to the website, find the movie, add it to your watchlist, and then return to the Fire Stick and watch the film. This is incredibly frustrating and grounds for dismissal for whoever had this idea.  (2) There are a wide variety of TV apps that are not available for the Amazon ecosystem but are available on the Play Store. Undoubtably this has something to do with Amazon's deal with Sling TV but it hurts the vast majority of users.Note: The Fire Stick is open to sideloading apps for those in the know and this allows many of the TV apps that be installed. The only problem with this solution is that they will not appear in the recently used bar and the remote will not function properly. The remote problem can be fixed with a third party remote app.", "verified": true, "helpfulness": "0/0", "author": "STL \"Sid Littlefield\""}, {"rating": 5.0, "review": "This was a wonderful product!. Highly recommend to anyone with Amazon Prime.  You won't be disappointed!", "verified": true, "helpfulness": "0/0", "author": "Gary Tashima"}, {"rating": 3.0, "review": "Fire stick lags a lot more than my roku stick and doesn't have many good apps..needs improvement...", "verified": true, "helpfulness": "0/0", "author": "Gad Salomon"}]