[{"rating": 5.0, "review": "Works great, very compact, very discrete and easy to install.  Have HBO go and Amazon prime setup, but also comes with the NFL network, and tons of other apps.  It's easy to use and the remote is very responsive, my in-laws have the Fire TV box with the voice input, but it's a feature that isn't too useful.", "verified": true, "helpfulness": "0/0", "author": "CLTGUY"}, {"rating": 5.0, "review": "I Love it!", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 5.0, "review": "Works well good price thinking of getting another one for the Living room.", "verified": true, "helpfulness": "0/0", "author": "Roberto Sital"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Larry Tuttle"}, {"rating": 1.0, "review": "When something is too good to be true, it usually is. The stick worked for a few days and then quit. Refused to work on my 51in Samsung and 24in Insignia.", "verified": true, "helpfulness": "0/0", "author": "Brian M Wood"}, {"rating": 5.0, "review": "Best streaming device for the price! Better than Chromecast!", "verified": true, "helpfulness": "0/0", "author": "kgriff47 \"french girl\""}, {"rating": 3.0, "review": "I have this, the Google Chromecast, and a Roku. The Fire TV Stick doesn't play Google Play content. The Chromecast doesn't play Amazon content. The Roku does both, plus Netflix, HBO Go, Hulu, and so much more.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Having  a hard time setting the stick up", "verified": true, "helpfulness": "0/0", "author": "John s. Reed"}, {"rating": 4.0, "review": "I enjoy my Fire TV Stick.... I wish there was a way to \"turn it off\". Right now I just hit the home button and just turn my TV off.. Set up is very easy and I love how I can download the app to turn my cell phone into a remote...this comes in handy when I misplace the small remote that comes with the fire stick. No complaints.", "verified": true, "helpfulness": "0/0", "author": "SusyQ"}, {"rating": 1.0, "review": "the first one i received was defective which means in my case that i was able to surf through the different menus and select different shows and movies to watch but the wireless internet connection would drop out. This is not a problem with streaming on any other device in the house on the same network. I have tried updating the firmware and also trying factory resets. This seems to be a hardware/software issue that amazon is aware of. Although it doesnt seem like everyone is having this issue. So amazon replaced just the fire stick but not the remote or cables which is fine. The second one i received had the same problem so i returned it and received only some of my original investment. Not a bad device if it worked correctly. If i were to buy another amazon streaming device I would probably go with the Fire TV Box which seems to be more dependable with better hardware.", "verified": true, "helpfulness": "0/0", "author": "Brian Smith"}]