[{"rating": 5.0, "review": "Really enjoying Fire TV Stick!!", "verified": true, "helpfulness": "0/0", "author": "caroline inadeski"}, {"rating": 4.0, "review": "EDIT: April 04, 2015. If I unplug the Fire Stick for a while and the plug it back in, it seems to work. I do not use it often. But today I tried to watch basketball on TBS on Sling TV. It buffered endlessly on my Roku, my IPad, my laptop, and my PC. In desperation I tried the Fire Stick. It works without buffering. Fire Stick to the rescue. I am watching the game in the second half as I write this.The game is over. I am watching the post game. It did not buffer once. I like my Fire Stick! I once hated it.******************My first review.I signed up for three months of Sling TV and received a free Fire Stick as part of a promotional campaign. I am glad that I did not pay for the Fire Stick. It worked well for two days. Now, it does not want to recognize my home network.It says that Home is currently unavailable.  I unplug it and plug it back in and that does not work. My PC in the same room is connected to my network. I put in my Chromecast in the same television and it works. I tried the XBox to the same TV and it connects. My IPad connects. The Fire Stick is the only product that does not connect.The error message tells me to go to settings. I go to settings. Every time I try to manually connect  it goes back to the first step. There is nothing wrong with my network. My router is working. Other gadgets connect to the internet to the same TV.I guess I will box it up and put it in a drawer, where it will stay until I throw it away. I was really hoping that it would work.", "verified": true, "helpfulness": "0/0", "author": "Utah Pete"}, {"rating": 3.0, "review": "I would have preferred a longer cord for it to plug in to the wall.  Was actually hoping that it was cordless, would make it much easier to install.  Also since this needs to be hooked to the USB port it can be difficult to change from TV to TV.  The picture is great.", "verified": true, "helpfulness": "0/0", "author": "Morgan"}, {"rating": 5.0, "review": "Works great, and make for something easy to use on the road.", "verified": true, "helpfulness": "0/0", "author": "PERRY"}, {"rating": 5.0, "review": "Please with the ease and flexible use.  I do have questions on how all this will work if you want to add more TV's in our house.  I understand buy more sticks, but just how does it all work or will it?  Has anyone else done this?", "verified": true, "helpfulness": "0/0", "author": "Johnnie & Mel Cunningham \"Roc n Mel\""}, {"rating": 4.0, "review": "actually the function is 5 star but it took 2 calls to Amazon, one to install batteries into the poorly designed remote the other was to use it.The designation symbols are not clear or are missing. Once we got it going it was terrific", "verified": true, "helpfulness": "0/0", "author": "JOANNE GOLDFARB"}, {"rating": 4.0, "review": "It would have gotten 5 stars but it seems that you have to  have a power cable plugged in to it. It is really cool besides that. I downloaded the fire tv app is awesome!", "verified": true, "helpfulness": "0/0", "author": "Joshua"}, {"rating": 4.0, "review": "Works really well , setup was easy and movies play flawlessly . Pic quality is great . The only problem I have is the volume when playing movie from prime, I have to turn volume up high to hear. At this time I am using Amazon prime for service on its trial period but plan on using Netflix next month to see which suits my needs best and check sound quality", "verified": true, "helpfulness": "0/0", "author": "al Bagley"}, {"rating": 4.0, "review": "Works really well.  I wish there was a selection for just free stuff however.", "verified": true, "helpfulness": "0/0", "author": "LARRY VANHOY \"ace\""}, {"rating": 5.0, "review": "The Fire Stick has allowed us to use our new TV in HD and all the stations we normally use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]