[{"rating": 5.0, "review": "Great device! Easy to setup and user friendly. Would recommend to a friend!", "verified": true, "helpfulness": "0/0", "author": "James DeNardo"}, {"rating": 1.0, "review": "need this nonsense on Christmas day eh? nope. i don't!first, there was no a/c power adaptor enclosed. not even room for one in the packaging!then, when i managed to figure out an alternative solution i found that the remote would not connect.and the fire stick will not move past the \"searching for your remote\" screen if you don't feed it the @%#$%!!! remote!it gives three instructions on how to troubleshoot that connection. none of them worked!so what do i do now with this piece of garbage!?", "verified": true, "helpfulness": "0/1", "author": "Garko"}, {"rating": 5.0, "review": "Amazing product, much better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Abdelatif Shkoukani"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Terry"}, {"rating": 4.0, "review": "Love the product.  my daughter is 5 and can nav. to her shows and loves it.  the one bad this is the Kindle Free Time is not an option in this.", "verified": true, "helpfulness": "0/0", "author": "Michael Flanagan"}, {"rating": 2.0, "review": "For the price difference you are going to get more out of the Full Fire TV vs the Fire TV Stick. You will find its much faster and contains more storage space. At a $39 price point Fire TV Stick Just isn't worth it.", "verified": false, "helpfulness": "0/0", "author": "Gower Limited"}, {"rating": 4.0, "review": "I'm not sure yet but I think it's going to be a good buy. I haven't had time to get everything checked out. I'm going to have to get my internet upgraded to be a little faster. But for the most part I'm happy with it.", "verified": true, "helpfulness": "0/1", "author": "granny 1"}, {"rating": 1.0, "review": "So here's the thing: one star is admittedly harsh.  There are plenty of reviews here you can read that talk up all the wonderful aspects of this device.  For me, however, the only true positive is that it natively handles Amazon Prime a lot better than the competition - so much so, of course, that I'm fairly certain they have crappy Prime apps for competitors on purpose, in order to steer Prime users to Fire TV.  But that just doesn't work for me.  I have Rokus and Apple TVs and smart TVs and the lot of it, and the device which is best is the device that is actually used.  Despite the fact that it handles Prime better, it doesn't do it so much better that it's frankly worth it to me to switch devices.  Additionally, it doesn't play nice with my Harmony remote, and I don't know why I'd reach for a secondary remote - especially since I got the Harmony in order to ditch all those secondary remotes - just so I can access Prime, which I already can do on multiple other devices.  So it goes unused.  I honestly might as well not have it.  Ergo: one star.  However, if this is the ONLY device you use?  Sure, why not.  I still don't think it's the best of the possible options, but, again, if you have Prime (or especially only Prime, and not Netflix and Hulu Plus, as I have), and this is your only device, then it's perfectly 100% acceptable.  Where \"acceptable\" is hardly, you know, five stars...", "verified": true, "helpfulness": "3/4", "author": "B. Coleman"}, {"rating": 2.0, "review": "Sucks that Amazon has to lie about Miracast certification.  This thing works on a VERY limited number of devices, and apparently they didn't check to see that Miracast is a standard.  It'd be like saying that a dollar is currency verified for the entire United States, but then you find out it only works in four states.  Pretty stupid overall.  It does do app streaming alright, but that really doesn't cover screen mirroring, which is the whole reason I got one", "verified": true, "helpfulness": "0/0", "author": "steven daycak"}, {"rating": 4.0, "review": "I really enjoy the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Keith W. Zollars"}]