[{"rating": 3.0, "review": "It arrived in the hassle free Amazon packaging.  I didn't have to break out scissors and knives to get it out.  Set up was a breeze.  Having the dongle extension included made hooking it up to the tv easier.  Amazons side scrolling interface works fine. It loads and plays pretty fast for the size of it. I purchased this because the price was good and I needed something for traveling purposes.  The only disappointment I had with this was I cannot play minecraft on it.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Wonderful!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "One comment: Fire TV Stick DOES work with a Receiver's HDMI port, I called Amazon about this issue they said it would have to be a direct connection. So FAR it's working perfectly fine.(Onkyo TX-SR313 5.1- Channel Home Theater A/V Receiver, Black )", "verified": true, "helpfulness": "0/0", "author": "L. Klindt \"Real_Ramit\""}, {"rating": 3.0, "review": "Don't get me wrong I like this device, and it works well, I just wish it was not as tied to the whole Amazon ecosystem as much as it is. I also find the interface a tad clunky, when compared to other Android TV HDMI sticks. Maybe with future updates they could include a app drawer. I ordered this for the 19 dollar promotion so I have no complaints. At full price, I would rather spend the extra money to buy the Roku stick.Update...01/23/2015 After owning this device for two months, I stand by my previous review. Streaming apps work great, Amazon instant streaming, Netflix, Espn, YouTube ect. Please overhaul terrible User Interface, I should not have to click on a app twice to open it. (first click to open title card, second click to launch app)The YouTube app could have a better layout as well. Streaming is very fast on this device. I would like another Stick for upstairs TV, no way would I spend $40 for it.", "verified": true, "helpfulness": "0/0", "author": "Tacitblue"}, {"rating": 5.0, "review": "Nice little device.  Very similar to the Roku stick but I think this one has a stronger Wifi receiver in it.", "verified": true, "helpfulness": "0/0", "author": "CG"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "L.breezy"}, {"rating": 4.0, "review": "I like how this is super easy to setup and use. It is a good value for the price and having the availability for use with Plex and other streaming services there is a lot of bang for the buck.", "verified": true, "helpfulness": "0/0", "author": "E Mo \"Definitively E\""}, {"rating": 1.0, "review": "Finally a way to access amazon free video prime account. Unfortunately videos available for \"free\" viewing are old stuff.  Other available services I can already access from my PC or existing media devices, so this really doesn't add anything. This is simply another tool for amazon to try to get you to spend more money on stuff you don't need.", "verified": true, "helpfulness": "2/3", "author": "Rophe"}, {"rating": 5.0, "review": "I really like this little guy. I've been using a Roku player and the only advantage it has over the Fire Stick is its native music/video player. I am using Plex on the Fire Stick to help with this. If a native player is ever added this product will be even better.Navigating the menus, settings, apps and options all are easy and quick. Setup was easy. The most difficult part was getting in into the HDMI port of my TV. That is only difficult due to me being in a wheelchair and my wife had to do it. I was up and configuring my WIFI and exploring new stuff in moments after that task was finished.", "verified": true, "helpfulness": "0/0", "author": "Kelley B. Underwood \"Blunderdog\""}, {"rating": 4.0, "review": "Works great, delivers a quick and slick streaming experience.", "verified": true, "helpfulness": "0/0", "author": "RWS"}]