[{"rating": 1.0, "review": "This thing just flat out sucks.  It claims to have a 'better WIFI performance.'  Better than what? A rock?  I've had Chrome cast since it came out on the same TV for over a year and it never disconnects.  This thing has to re-connect every 8-10 seconds.  Just terrible!", "verified": true, "helpfulness": "2/2", "author": "Brian"}, {"rating": 4.0, "review": "Just got mine in 12-11-14 and loving it for the price it's everything I need. I did a youtube unboxing and review.https://www.youtube.com/watch?v=6jIKxmsE7CY", "verified": true, "helpfulness": "0/0", "author": "IT Guy"}, {"rating": 5.0, "review": "It's a great little device. Nice interface and seems to perform well.", "verified": true, "helpfulness": "0/0", "author": "D. Mattow"}, {"rating": 5.0, "review": "Purchased when they were on sale for 19 dollars. We have 3 chrome casts which we use everyday with PLEX for viewing our offline content. We previously had tried the FireTV but returned it when it proved difficult to view our Prime content. The FireTV stick is much better, prime content plays without first being directed to purchase amazon content. In addition, PLEX works great as a downloaded app. We have no issues with the remote, and it is easier to use the remote than our phones with the chrome cast. Overall, this is great buy for under 30 dollars for PLEX and Prime users.", "verified": true, "helpfulness": "0/0", "author": "DavidC18"}, {"rating": 5.0, "review": "Great interface and navigation seems smooth. Comes with everything you could possibly need including an hdmi extension.", "verified": true, "helpfulness": "0/0", "author": "Deucer"}, {"rating": 5.0, "review": "uses both low (2.4) and high(5) bands speed superb quality great (1080P) just installed but happy so far", "verified": true, "helpfulness": "0/0", "author": "Bart Johnson"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV this summer and felt that nothing could compare to how amazing this Fire TV performed until my Fire TV Stick arrived yesterday. I had raved so much about my Fire TV that my baby brother purchased the Fire Stick and had already received his. He told me that it was amazing and so easy to set up and use. He was absolutely correct. I opened my package with zero frustration, which I love that Amazon has done. I then literally had my Fire TV Stick up and running in under 5 minutes. Another brilliant and outstanding product, Amazon.", "verified": true, "helpfulness": "1/1", "author": "Rebecca Cole"}, {"rating": 2.0, "review": "I don't normally do reviews but I was excited for this product and it turned out to be a huge letdown.Sure, I can access all my prime content and netflix and all that jazz, but it suffers from a few major flaws.1. It seems to lose connection to my wifi at random and can't reconnect until reset. As this is located right next to my 360 and wii, which don't have that issue, I assume it's a problem with the stick.2. I've had apps crash and kick me out. Wouldn't be a big deal, but I can't get back in until the device is reset, as in the above. This leads me into the biggest problem3. I can't find a way to turn this off or reset it without unplugging it from my tv and the power source every time. There is just no excuse for there not to be a reset button or an option on the main menu.4. Not a huge issue but something that needs to be addressed, the battery port for the remote. This thing took me at least 5 minutes to get open and the whole time I had to question if I was going to break it. They don't tell you that you need to push part of it in, then pull the back down toward the bottom. I have more gadgets than I can count, and this is the first time I've had a problem like that.", "verified": true, "helpfulness": "0/0", "author": "Lunacy"}, {"rating": 4.0, "review": "4 stars for Good overall productCons: More tied to amazon prime. For casting youtube from my phone I need to use chromecast. The navigation lags as we scroll through different movies.", "verified": true, "helpfulness": "0/0", "author": "same"}, {"rating": 1.0, "review": "Highly not satisfied. Not easy as chromecast.missing ios apps", "verified": true, "helpfulness": "1/2", "author": "Rajesh P."}]