[{"rating": 1.0, "review": "Kept disconnecting from wifi every couple of minutes. Returned it and purchased Apple TV and worked flawless no disconnecting.", "verified": true, "helpfulness": "0/0", "author": "oscar"}, {"rating": 4.0, "review": "I'm very happy with my Amazon Fire TV Stick.  I wanted an easy, low-cost/low-techno method of enabling my *non-Smart* TV (8 year old Sony Bravia KDL-26S3000 26-inch TV) to stream TV and movie content. I didn't want to have to watch TV/movies using my computer room PC; I wanted to be able to watch in my bedroom instead.  This unit did the trick, and I continue to discover new benefits to using it, along with an Amazon Prime membership I bought to coincide with the Fire Stick purchase.  I understand that I could have bought the TV Stick and signed up for Netflix as my streaming service, for example, instead of or in addition to the Amazon Prime Instant Video streaming service, but so far I'm completely satisfied with just the Fire Stick and Amazon Prime's streaming service.Could the Fire Stick's Android application be re-named as \"Amazon Fire Stick\" instead of its current \"Fire Stick,\" so its name would show up next to my other Amazon software in my Android -- Amazon, Amazon Kindle, Amazon Music?  I'd love to see a user-friendly listing snuggled between \"Amazon\" and \"Amazon Kindle\" instead of down in the Fs. Maybe the absence of the term \"Amazon\" in the Android app is a sort of branding deliberate move?Although, as others have pointed out, the remote that comes with the TV Fire Stick does *not* include a voice-search option, I have found that installing the Fire Stick application onto my Android does a great job at the voice search.  I simply pull down a tab on my Fire Stick application on my Android, say \"Curb Your Enthusiasm,\" for example, and that title appears on screen for then selecting on my Android -- by pressing anywhere on the screen.  No need to press buttons to enter each letter of a wanted title on my Fire Stick remote or Time Warner remote, and certainly no need to try to figure out \"what Time Warner channel do I need to be on in order to even search -- is it 500, 510, is Curb Your Enthusiasm an HBO series, etc.The setup did have one glitch, when I got an error message when the stick was trying to connect to my PC's router.  I unfortunately delved into the \"Advanced\" field and later into an unhelpful conversation with an Amazon rep who sent me to \"my service provider.\"  But finally my router (DLink) rep set me straight, reassuring me that the issue was in fact a Fire Stick issue, not a router issue (judging from my still being able to get online from my PC and phone), so I simply *cancelled out* of the connection screens, tried to Connect again, and I got a \"Connection Successful\" the second try.I just noticed today that there is a \"Prime\" banner at the upper left of the tv/movie thumbnail displays, indicating that the tv show or movie is *free* for Amazon Prime members, as opposed to requiring a one-time additional fee.  This is great!One still-remaining Amazon video streaming confusion: Did Amazon Prime Instant Video's name change to \"Amazon Instant Video\" and we're still seeing some legacy mentions of the \"Prime\" case -- or are Amazon Prime Instant Video and Amazon Instant Video two different things?  Maybe the \"Prime\" term is associated with the \"free with Prime membership\" items and the \"Instant Video,\" without the term \"Prime\" is the umbrella term for both the free-with-Prime-membership and non-free items, or perhaps just the non-free items?  I'm sure this must all be documented clearly somewhere. Found some writeups so far, but not quite answering that question.", "verified": true, "helpfulness": "0/0", "author": "catluvr"}, {"rating": 5.0, "review": "Love the options!", "verified": true, "helpfulness": "0/0", "author": "Ecko5376"}, {"rating": 5.0, "review": "This little thing is amazing !!!! I cut the cord on our satellite provider and bought the fire stick!!! Best decision I ever made!!! Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Gilbert Gutierrez"}, {"rating": 5.0, "review": "Provides all that we need to wash TV.", "verified": true, "helpfulness": "1/1", "author": "Diego Carvajal"}, {"rating": 4.0, "review": "Very nice interface - dare say better than my AppleTV (of which I have 3) and the remote is well designed.", "verified": true, "helpfulness": "0/0", "author": "C. ISSA"}, {"rating": 5.0, "review": "Worth the money......I would highly recommended it. It's  better than cable TV and way cheaper!", "verified": true, "helpfulness": "0/0", "author": "Brixtro D. Martin"}, {"rating": 5.0, "review": "I am SO glad hubby talked me into this! I almost didn't let him get it, but it replaced this huge thing he had before, I think Google tv? It works fast, and very rarely ever have we had to reboot it because of an issue. The remote is small and gets lost easily, but I'd rather it be small than something massive. The price is really great too!", "verified": true, "helpfulness": "0/0", "author": "Shawna \"Shawna\""}, {"rating": 5.0, "review": "I love it awesome my girls enjoying watching Netflix, YouTube as well going to order another one", "verified": true, "helpfulness": "0/0", "author": "meifa"}, {"rating": 4.0, "review": "This is an awesome piece of equipment.  I enjoy it and am glad I purchased it.  The only reason I gave it 4 stars rather than 5 is because it has to be plugged in to work and the cord is simply not long enough.  Unlike the Chromecast dongle which is just inserted into the TV.  Otherwise, it's all it's cracked up to be and is a great source of entertainment in my family!!!!", "verified": true, "helpfulness": "0/0", "author": "VRougeux \"Rogue\""}]