[{"rating": 5.0, "review": "5 Stars for doing exactly what it said it did. Took a minute to pair with Wi-Fi, but runs very smoothly and pretty fast for a stick. Wish they had HBOgo app.", "verified": false, "helpfulness": "0/0", "author": "norma murdoch-kitt"}, {"rating": 1.0, "review": "Unboxed, 20 mins of software updates. Then to go setup services, now the Stick wants me to type in a bunch or more complex passwords using...wait for it...the six button TV remote.  Ain't nobody got time for that.  I should be able to tie accounts to my stick via my Amazon account, use a browser to connect directly to the Stick and setup accounts, or use the way the Wii authorizes Netflix: with a code in real web browser.  I am aware there is a tablet/phone app (not available for my Android or iOS devices according to the intro video) but that just take make it feasible yet painful.", "verified": true, "helpfulness": "1/2", "author": "robdew"}, {"rating": 3.0, "review": "40 dollars for this or 69 for the Amazon Fire TV on cyber Monday.  I would rather have a device that can allow you to plug in a hardwire network cable instead of only have wifi as an option.  We had issues trying to get it to work on the hotel wifi, because of the login procedure you need to follow to get onto Hotel wifi networks.  Compared to the Amazon Fire TV where you can plug into the back of the device a network cable which bypasses the hotel internet setup.", "verified": true, "helpfulness": "0/0", "author": "MyReviewMyStory"}, {"rating": 5.0, "review": "This is so worth the wait and the money! Fast and no issues with streaming so far.", "verified": true, "helpfulness": "0/0", "author": "W. Thomas"}, {"rating": 5.0, "review": "Awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "laba"}, {"rating": 3.0, "review": "Well the concept for me was good, but I could not get the audio to work with my surround sound system on my main Television.I am using it on a smaller tv, which disappointed me!", "verified": true, "helpfulness": "0/0", "author": "Domenick Versaggi Jr"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "amanda deleon"}, {"rating": 4.0, "review": "very impressive piece of art! wide selections of apps you can download for free, and very quick browsing!the only reason I give it 4 star is because it has to be connected to the power source! not as Chromecast where it feeds off the HDML port!very good device though on a great deal!", "verified": true, "helpfulness": "0/0", "author": "malak"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Matthew Losik"}, {"rating": 3.0, "review": "Pros:Nice interfaceCan sideboard Android appsCons:-Audio slightly lags behind the video.-Netflix causes my router to crash when it works fine on other platforms.-Have had it for three days but have already encountered numerous app crashes.-Hulu videos often freeze while the audio continues to play.-Search integrates with Hulu and Prime but not Netflix or Plex.It's ok but clearly not ready for prime time.", "verified": true, "helpfulness": "0/0", "author": "Patrick Zarbis"}]