[{"rating": 4.0, "review": "Pfo", "verified": true, "helpfulness": "0/0", "author": "Rabiyah Salahuddin"}, {"rating": 5.0, "review": "Amazing product!", "verified": true, "helpfulness": "0/0", "author": "Saul Trevizo"}, {"rating": 3.0, "review": "Its good, but it does not connect to the internet as well as other devices.  It buffers too much, while other devices on the same wifi do not.  Also, the Crackle app fails constantly.", "verified": true, "helpfulness": "0/0", "author": "Landon Knoke"}, {"rating": 1.0, "review": "I prefer the mobile sharing functionality of the chromecast. I returned it at 7 days.", "verified": true, "helpfulness": "0/0", "author": "special k"}, {"rating": 2.0, "review": "Very disappointed. It disconnects constantly and freezes. I'm glad I only paid $19.", "verified": true, "helpfulness": "0/0", "author": "AW"}, {"rating": 5.0, "review": "I Purchased the fire stick to make it easier to watch Netflix and Amazon Prime Videos. So far its working great and installation was a breeze.The best part is the device comes already registered to you. Its portable and can be moved from TV to TV or go with you when you travel. It comes with a short HDMI extender. If your HDMI port on your tv is hidden and you want easier access to your fire stick, I recommend purchasing a longer cable. Other than that the item is great. It comes with a usb power supply cord and ac adapter. If you are on a budget like me and can't swing for a fire tv, this is the next best option.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Only real reason to give four instead of 5 stars is there is almost always room for improvement...which is the case here.  We have owned ours for about 6 months....like to wait to review things to get a true feel.  Overall functions very well and has a pretty good user interface.  Wife struggles with it from time to time but that is a patience issue.  Haha. It doesnt always load instantly.  Could use a bit more processing power i guess as screen mirroring struggles most of the time.  Streams most video excellent most of the time.  What i like better than my chromecast is if it is struggling to process it seems to drop the resolution down and continues to play while it catches up instead of freezing and reloading.  I think it is a fair deal overall.", "verified": true, "helpfulness": "0/0", "author": "Kyle Korstjens"}, {"rating": 5.0, "review": "Got it just for the apps! Amazing device", "verified": false, "helpfulness": "0/0", "author": "Pete"}, {"rating": 1.0, "review": "Easy setup. Great interface. Easy to navigate. Terrible wifi reception. Bought additional 6' HDMI cord but that slightly helped. Picture was always in standard definition on a HD TV. Terrible picture quality and would disconnect from network with regularity. I returned this garbage.", "verified": true, "helpfulness": "0/0", "author": "W. R. \"Waynier\""}, {"rating": 4.0, "review": "MUCH easier than the Chrome stick.  Very little effort to set up.", "verified": true, "helpfulness": "0/0", "author": "Eva M Kubinski"}]