[{"rating": 4.0, "review": "It's an amazing device and it was so easy to set up.  I simply love it and it will replace my high priced cable bill very shortly!", "verified": true, "helpfulness": "0/1", "author": "Debora Brown"}, {"rating": 1.0, "review": "Not ready for prime time.  The dreaded \"HDCP unauthorized. Content disabled\" appeared, and the Amazon digital device tech support rep said that there's absolutely no way of making it work with my Samsung HL-S5087W DLP HDTV.  Took her advice and returned it.  Unfulfilled expectations.", "verified": true, "helpfulness": "2/5", "author": "Marty3"}, {"rating": 5.0, "review": "Excellent. Easy setup, great way to view photos using the \"free\" cloud service. Movie streaming from \"prime\" is worth the price of the unit.", "verified": true, "helpfulness": "0/0", "author": "Curtis S."}, {"rating": 3.0, "review": "I won't do a detailed review since others already have, but long story short, the Fire Stick works well, no hiccups, and will completely replace my Apple TV, but the Amazon content is weird. Example, a 2014 movie is free with an Amazon Prime account, but Some older movies cost $3.99 or MORE! Netflix vs Amazon Prime? I'd go with Netflix. Why? You won't mistakenly pay for a movie that you might assume is free whereas Prime mixes free and Pay Per View. Personally, to me, the best feature of the Fire Stick are the apps, specifically Plex! Now I can watch all my ripped DVDs stored on my computer on any TV in my house.", "verified": true, "helpfulness": "0/0", "author": "Zackry Cephas \"Cream of Beats\""}, {"rating": 1.0, "review": "Constant wifi connection problems. I have never had this much trouble with a wifi device. (kindle, tablet, phones, ps4, pc, roku, chomecast, all work fine) I will wait a few weeks to see if Amazon has a solution. If not, it will be returned for refund.", "verified": true, "helpfulness": "1/2", "author": "John J Downing"}, {"rating": 5.0, "review": "love it! all set up when i got it!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "I will give a 4 star.  I mainly use this to get PLEX for my main TV. I used to use PS3 as media server but I had little lag issues with 1080 playing.  This one also skips few as I played some 1080.  But at least Fire stick gives me option to downgrade the quality of video so I don't have to skip the plays.  I got it during the $19 promition so I won't complain for 20, you cannot beat the price.", "verified": true, "helpfulness": "0/0", "author": "Cloud"}, {"rating": 5.0, "review": "Worked as stated.", "verified": true, "helpfulness": "0/0", "author": "EDUARDO RODRIGUEZ"}, {"rating": 5.0, "review": "Turned my tv into a streaming entertainment center. This is a must have for anyone with a non-smart tv.", "verified": true, "helpfulness": "0/0", "author": "D. O'CONNOR"}, {"rating": 2.0, "review": "Operates Fine. Registration sucked! The installation is simple as one would expect. It started up, I added the necessary info to connect to my network and it checked for updates. Simple.The trouble began while I was trying to register it. I typed my Amazon email address and password into the appropriate boxes and submitted. The screen changed to indicate a process was occurring but, at the end, I was kicked back to the screen for the email address with an error to the effect of \"no such Amazon account\".I carefully double checked my entries as I don't often type (really never since I use a password vault) my Amazon password. After seeing everything was correct, I submitted with the same error as the result. I tried powering off and then on the Stick: same old, same old. I did a hard reset (hold the play/pause and center button until it resets) and started over from scratch: NOPE!Finally, I turned to the forum and found the link to customer service for Fire TV: https://www.amazon.com/gp/help/customer/digital-video#aI found the link in the forum in a reply from customer service to a complaint from another user with the same issue. This was after an exhaustive search of the help pages. I think there needs to be created a few more EXPLICIT categories in the customer service \"Contact Us\" area.I started a chat with the rep and I was asked for the DSN# from the package. I had to pull out the scanning electron microscope as my reading glasses weren't up to the task of reading the 6 pt type. After a couple of minutes, I was informed that the device was registered and I was asked to power off and restart (I ignored that). I hit submit from the, by now, hated registration screen and, after 15 seconds, I was greeted by an introductory video.This all took place over the period of about 2 hours!Best that I can understand, the devices go out tied to your account in some way. Evidently, they were not processed correctly so they cannot be registered. Seems strange but that is what I have read.So, if your registration fails more than once with good email address and password, use the link above to chat with customer support. Be prepared with the DSN and ask that the device be registered for you as your attempts to do so have failed.I would give 4 stars were it not for the time-wasting hassle. The Stick works smoothly and, at least for me, streams beautifully. I would not give 5 stars because the device doesn't seem special and it should include, as part of the design, the ability to stream by DLNA so I can ditch other devices. The available apps I have seen to accomplish DLNA get mixed reviews with only PLEX getting more than an average rating.As far as PLEX goes . . . MEH. A bit buggy for me in that it won't recognize and add to the library videos that should be compatible. I have checked and compared them with a software tool that reads the characteristics of the encoding and I can find no substantive difference between those that are recognized and those that are not. I have searched the PLEX fora and help and I can't nail down the problem. If anyone knows the answer, comment here as I will be receiving updates.", "verified": true, "helpfulness": "3/3", "author": "B. Williams"}]