[{"rating": 5.0, "review": "Very nice productBe aware that even though Amazon says you need to power the FireStick,  If you have a really new TV (with a USB 1 amp connection) that USB connection ( cable included with stick) will power the FireStick.  Most TVs only come with a 0.500 amp connection", "verified": true, "helpfulness": "0/0", "author": "Bill Bunker"}, {"rating": 3.0, "review": "I actually quite like this device.... but if they don't make it so you can skip the tutorial I'm gonna flush it.", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 5.0, "review": "Quality of video playback is sub par. But it works for what I got it for.", "verified": true, "helpfulness": "0/0", "author": "Lance Sternstein"}, {"rating": 2.0, "review": "It does not have other apps like Roku does. I can only access my prime membership which lacks Hbo Go, Time Warner app, etc. You can get old seasons for variant shows that are dated. However, Prime with the Fire Stick does have its advantages. You can stream up-to-date movies, rent various (recently released) movies or shows, and they do have their own created dramas, comedies, etc.  Some of them (recent releases) you are charged for as the battle continues through the different competitive markets of on-Demand agents. It seems Fire Stick needs to catch up. Especially since I've had my Roku for ... over five years & Fire just started--a lot of kinks need to be worked out, but I'm hopeful.", "verified": true, "helpfulness": "0/0", "author": "Romeyn C. Smith"}, {"rating": 3.0, "review": "Great for Amazon Prime Instant Video, not so good for Netflix. The Netflix app on Fire TV Stick is bizarrely missing your My List, or at least I sure can't find it. On top of that during playback of a movie on Netflix I experienced multiple hiccups that I don't get on other devices like my Xbox 360 and PS4. The Twitch app is even worse and does not have the features of the Android phone version or iPhone version - for example you can't log in or otherwise have a list of favorite broadcasters. So this thing is good for Amazon Prime Instant, but not so great for anything else I've tried so far.", "verified": true, "helpfulness": "0/0", "author": "Stephen J"}, {"rating": 5.0, "review": "I've used several similar devices such as Google Chromecast, and the Fire Stick seems more stable and user friendly. I currently using it to binge-watch The Sopranos on my Amazon Prime account. Considering that it uses wireless streaming, the programs have been remarkably smooth.", "verified": true, "helpfulness": "0/0", "author": "David Schmitt \"PlasticEyes\""}, {"rating": 5.0, "review": "Still getting use to it but so far it's great", "verified": true, "helpfulness": "0/0", "author": "Caroline Bruno"}, {"rating": 5.0, "review": "Works great I just wish amazon prime came with more \"free\" content.", "verified": true, "helpfulness": "0/0", "author": "T. Mccormack"}, {"rating": 5.0, "review": "Easy to install, even for me!", "verified": true, "helpfulness": "0/0", "author": "giaco"}, {"rating": 1.0, "review": "Malfunctioned. All attempts to view programs rendered a 'not authorized' screen. I subsequently viewed the programs on my computer.", "verified": true, "helpfulness": "1/3", "author": "e l thompson"}]