[{"rating": 3.0, "review": "I was disappointed with the fact that I still need to pay my monthly fee in order to watch Netflix, and Hulu, it's all there, but you still need to be a member to it and pay to watch it.  I was hoping with the fire stick I would have it all without the 2 other monthly fees.  and as far as subscribing to the Amazon Prime,  I do not have the best Internet service and it's limited so I can't watch all the movies and stuff, but other than that, I'll still keep it and hope some day I have better Internet service.", "verified": true, "helpfulness": "0/1", "author": "Terri"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Juan Gomez"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Inga"}, {"rating": 3.0, "review": "Disappointed in the selection of movies and TV shows available with prime.", "verified": true, "helpfulness": "0/0", "author": "Sarah Llewellyn"}, {"rating": 1.0, "review": "I'm a bit disappointed with the Fire TV Stick because I get a audio interrupt (TV sound goes off/silent) for about a second or two, every 2 or 3 minutes, when viewing a program via the Fire Stick. My TV is about 15' from my computer so I don't distance is the problem. As soon as I unplug the Fire Stick the audio problem no longer occurs. I haven't been able to find out why this happens, or how to resolve it. Talked with one Amazon Tech. Rep. & he was unable to resolve the issue.", "verified": true, "helpfulness": "1/1", "author": "Roadkill \"Tasty\""}, {"rating": 5.0, "review": "Love it!  I'm  really pleased with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "snwill"}, {"rating": 5.0, "review": "I purchased this when it was discounted during Prime Day.  We have a Roku 3 hooked up in the main room, and thought that this would be nice in the guest room.  It was very easy to set up and get running.  I know that it is not as powerful and does not have the memory that the boxes have, but for the price it works great and does everything we need.  The included remote is easy to use, as is the remote app for my phone (Android based).", "verified": true, "helpfulness": "0/0", "author": "jenny8675309"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "kathy bradley"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "C. Jones"}, {"rating": 5.0, "review": "I love my Amazon Fire Stick it works great!!", "verified": true, "helpfulness": "0/0", "author": "Big Art"}]