[{"rating": 5.0, "review": "The stick has given me lots of free movies.  Some movies had buffering issues.  But what do you want for free, right?  Many of the movies offered through Prime require a payment. So I linked my device to a third party source to get movies and TV for free.  If I had it to do over, I would have bought the Fire BOX and not the Stick.  I read that theFire BOX has better hardware installed, and it comes with a \"Voice Search\" Microphone (the Stick does not).  All in all, it is worth the money.  It's already paid for itself.", "verified": true, "helpfulness": "0/0", "author": "Ted S."}, {"rating": 4.0, "review": "Works very well; the only bad part is the vagueness of the setting up instructions", "verified": true, "helpfulness": "0/0", "author": "toby rose"}, {"rating": 5.0, "review": "Loved the Fire Stick. Easy to connect. Comparable with the Apple TV but at a great price.", "verified": true, "helpfulness": "0/0", "author": "Princido Texidor"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "momof2girls"}, {"rating": 5.0, "review": "Delivers exactly what we want to see, when we want to see it!", "verified": true, "helpfulness": "0/0", "author": "Cynthia Whittenbury"}, {"rating": 5.0, "review": "Great fun I love it", "verified": true, "helpfulness": "0/0", "author": "Carla Harris"}, {"rating": 5.0, "review": "Well worth the $40. Access to Hulu and Netfix so I only have to have one device. All the things you do video on the Kindle can been done here as well.", "verified": true, "helpfulness": "0/0", "author": "jdajod"}, {"rating": 5.0, "review": "I like the fact u can put third party apps on it", "verified": true, "helpfulness": "0/0", "author": "odelmo paltooram"}, {"rating": 5.0, "review": "The amazon fire stick...I dont even know where to start. This thing is so awesome. As i dont own a regular fireTV i cannot say if this is faster or slower, but i can't imagine something that is faster than this! It get my movies from all my places and plays them with ease.I wish there was a casting function that worked super easily to play movies from my computer, but until then ill watch all my netflix and Prime movies.", "verified": true, "helpfulness": "1/1", "author": "IsaacFank"}, {"rating": 5.0, "review": "Fantastic! Customer Service is awesome!", "verified": false, "helpfulness": "0/0", "author": "Blondie"}]