[{"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "J. Luna"}, {"rating": 5.0, "review": "Great device made better by the installation of Kodi.", "verified": true, "helpfulness": "0/0", "author": "RowMan"}, {"rating": 5.0, "review": "Easy to use and works great", "verified": true, "helpfulness": "0/0", "author": "Meredith Pawlowski"}, {"rating": 5.0, "review": "Rather than agree with all the other excellent reviews, let me add some hopefully unique info on getting this thing running as a Kodi/XBMC frontend for Plex Media Server, MythTV and a plain-old http server with videos.We cut the cable (Comcast) two weeks ago and the Fire TV Stick showed up two days ago. When we ran cable, we used the excellent SiliconDust HDHomerun Prime with Comcast cable and used MythTV as our PVR/DVR. Everything was happy with the universe - except that in general Comcast is a horrible company with horrible service that wanted to charge us more than $100 just so we could watch some kids shows, some news and the rare program. It was just not worth it, so we cancelled.The MythTV server has nearly 1 TB of (mostly kids) programming and sat next to another server with about 1 TB of movies, photos and music. Myth would blast all that to three locations in the house, and also would display anything we could blast from our iPad (except Amazon Video) to about four locations in/around the house.KODI/XBMC; VIDEO on home server (NAS/HTTP): As of now, I have the FireTV stick fronting all the normal Amazon Fire stuff, plus it is able to stream the H.264/MP4 movies sitting on our video server. I did this by 'sideloading' the Kodi/XBMC app onto the stick. The Kodi site has the details, and it took me all of 20 minutes (including download time) to get it running. From there I configured the Kodi app to use http to reach our video server - which has little more than a directory open for reading via an Apache web server (everything is behind two firewalls - none of this is exposed to the world). Kodi read the movie names and populated its database with full movie, plot, cast and metadata. We can now watch all of our movies, with the new addition of Kodi linking to internet trailers for all the movies. That was something Myth never did. Note that none of the above needed Myth, and I could have used a NAS instead of http. Please note that Kodi/XBMC is not officially supported on the FireTV, so anything you break is your problem and Amazon owes you nothing.PLEX integration: I volunteered to build a FreeNAS server for a local school, and went ahead and put Plex Media Server on it as well. Of course, it is still sitting here waiting to be delivered tomorrow so I tried linking it with the FireTV Stick. In this case it is pretty easy given that the Plex app is available via the Amazon App Store directly. Everything worked fine. The only bump is a nominal one-time charge of $5. No problem because developers need to eat, and did I mention we are saving more than $100 a month after cutting Comcast off from our checkbook?My next step is to enable the Myth Client built into Kodi so that we can watch all the archived television in the Myth box. Right now the Kodi app sees the Myth backend server but I need to configure something. I haven't worked on it much, but people claim it works. I will update as we move along, because I have a lot of shows on that Myth backend that need to be available. Also, we are going to keep the Myth backend for live tv via over-the-air digital broadcasts. Maybe next week...So for those who are curious about using FireTV Stick as a front-end for more than just Amazon content, I will say it works so far. I will update with MythTV details as I get time to finish that part of the configuration. If it works, I will probably buy at least three more FireTV sticks for the rest of the house.The kids love the setup, and have not even found games yet - they have never played a video game so they are not missing much.I will subscribe to comments. If you have questions, please ask and I will do my best to help. And if you think this is the least bit useful, please, please hit that 'useful' button below. We have never gotten Amazon Booty(tm) but if enough of you rank us higher, perhaps in the future someone will offer us a free toilet brush to review!", "verified": true, "helpfulness": "1/1", "author": "XMS"}, {"rating": 5.0, "review": "Great product and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Nalini"}, {"rating": 4.0, "review": "If I were stuck on a desert island and had food and a fire stick and Wi-Fi to get it running I would never be at a loss for being bored there is more to do on the stick than anyone could ever wan,t it's great!  -Eric", "verified": true, "helpfulness": "0/0", "author": "Eric D."}, {"rating": 5.0, "review": "Easy to install and learn.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Stanley"}, {"rating": 5.0, "review": "An excellent alternative to competitor streaming devices.", "verified": true, "helpfulness": "0/0", "author": "Joseph Barbato"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "delane foster"}, {"rating": 1.0, "review": "Apparently you have to have the Fire TV Stick right next to a router for it to work without dropping the signal over and over and over.  Speech does not keep up with mouths on programs.  Constantly freezes and screen goes blank.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]