[{"rating": 5.0, "review": "Meets all expectations!  The android app works great too.  It is faster and better than going through my Blu-ray player.", "verified": true, "helpfulness": "0/0", "author": "Ninepounds"}, {"rating": 5.0, "review": "We absolutely love it!!!!", "verified": true, "helpfulness": "0/1", "author": "Lisa M. Clapp"}, {"rating": 5.0, "review": "I bought this specifically for use on the road. I stay 175+ nights a year in a hotel and trust me when I say, I needed the entertainment. The problem is, most hotels require you to visit an authentication screen via browser.....this is true with the Fire Stick; it has no browser capability. However, I invested in a HOOTOO travel router which allows you to visit a browser via your phone which in turn allows you to accept the terms and conditions page. I simply log on to the HOOTOO via my Fire Stick. Works like a charm!", "verified": true, "helpfulness": "1/2", "author": "ernie escontrias"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kennelee Anne Lee"}, {"rating": 3.0, "review": "Got it during the promotional period when it was $19. For the price, it figured it did everything that Roku does, just at a much lower price. Been using it for about 3.5 months now.So far the experience has mostly been positive. Excellent if you have Prime and want to watch your Amazon Video collection. Pretty good for Netflix and Hulu too.The only major disappointment is that there are a bunch of times when you switch on the TV and the Fire Stick wont turn on. There's no signal and nothing you do will turn it back on. Then a couple of days later, as if by magic, it turns on when you turn on the TV. I'd taken to ensuring that the Fire Stick interface was back to its main screen when turning the TV off, which used to ensure that when I turned the TV on, the Fire Stick would turn on as well. But that is just insane. You should not have to follow strange Voodoo steps to ensure the thing works again.For some reason, its now not turning on again. I think its time to get me a Roku.", "verified": true, "helpfulness": "0/0", "author": "Archit Joshi"}, {"rating": 2.0, "review": "While the design and interface of the Fire Stick are quite nice, I'm afraid I feel as though I've been sold something of a false bill of goods. Advertised as having double the memory of a Chromecast, I was expecting superior response times with similar abilities. Unfortunately, the responsiveness outside the main OS leaves much to be desired. It's slow to load and slow to respond everywhere but the main menu.My biggest gripe with the Fire Stick: want to play a locally stored video file? Better not be an mkv. Or even a large file. And it better be on the device you plan to stream from (not a network attached storage!) I attempted to use it with AllCast on my phone and it was either extremely slow or downright unresponsive, and crashed three times before I gave up. Want to stream anything of substance? Be prepared to pay for Plex (again) and have it be similarly slow to load and play, with frequent buffering. I suppose I could upload my videos to my hilariously small Amazon Cloud drive just to play them on my Fire Stick, but then I think \"nah, I can just use my Chromecast.\"Finally, I also downloaded the fire stick remote for my Galaxy S5. Unfortunately, this app takes 10-15 seconds to connect, but will lose its connection the moment the screen goes dark. This is quite frustrating if you are doing any sort of frequent navigation. The controls do seem to work reasonably well while connected, though.While I'm certain many folks will find this useful, if you want to do anything other than watch videos on Prime, be prepared to pay money for disappointment. I suppose I have only myself to blame for not digging deeper into the specs and capabilities of the Fire Stick.", "verified": false, "helpfulness": "0/0", "author": "B. Edelman \"Pluperfect Subjunctive\""}, {"rating": 5.0, "review": "Frickin Awesome! I love it", "verified": false, "helpfulness": "0/0", "author": "Ryan Rosander"}, {"rating": 1.0, "review": "Can't hate it enough.  I have never been so frustrated with a product.  We have not seen one more than 5 minutes at one time and mostly it's literally about 10 seconds.  Worst ever.", "verified": true, "helpfulness": "0/0", "author": "Jamie Amos"}, {"rating": 5.0, "review": "It is way more than I had hoped for, and probably only scratched the surface of what it can do.", "verified": true, "helpfulness": "0/0", "author": "Barry W. Harris"}, {"rating": 1.0, "review": "It does not work at all.  It plays for a few minutes and knocks every computer in the place offline.  What a waste of money.", "verified": true, "helpfulness": "0/0", "author": "Orchardman"}]