[{"rating": 5.0, "review": "It is  great I enjoy it  everyday", "verified": true, "helpfulness": "1/1", "author": "Luis Lugones"}, {"rating": 3.0, "review": "This device was better than the expectation.  The navigation is smooth and device size small.  The reason for 4 stars is there is very little free content and video which are termed as HD looks like coming from VCR rip off.  But good value for the price and better than Chromecast.Update: 2 April, 2015Some addition to the review after I subscribed to Amazon Prime.  The video quality adjust to the current download speed. So sometimes it is very good and sometime just acceptable.  The amount of content is huge but mostly the movies are foreign movies with most of them below 5.0 on imdb.  This is quite unacceptable. Further, often the music is also from unknown artistsA few things missing in FireTV is there is no file manager, cache cleaner or internet browser.  If these had been available then this would become more useful.Based on above I am reducing one more star and final rating is 3 starts.", "verified": true, "helpfulness": "0/0", "author": "Jaffer Siddiqui"}, {"rating": 5.0, "review": "I love the Amazon Fire Stick! It is simple to use and would recommend it over Apple TV and Chrome!", "verified": true, "helpfulness": "1/1", "author": "Holly A."}, {"rating": 5.0, "review": "This is an amazing little stick. Easy to set up and start using. Walks you right through it and by the time the grand kids got home from school, it was ready to go! (Actually, one of them helped me finish the setup... she's such a smart 2nd grader!) It got used so much, the remote batteries lasted only 2 days... but the replacement batteries are still going strong after 4 days of nearly continuous use. Bye Bye DVR! The phrase, \"Speak softly but carry a Big Stick\" applies here... as long as it's the Amazon Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Richard Mangum"}, {"rating": 1.0, "review": "it doesn't work it keeps cut now going slow and I can't watch a whole movie on it", "verified": true, "helpfulness": "2/2", "author": "Tami Mullaney"}, {"rating": 1.0, "review": "Limited. Not enough selection. No new movies. DVD is still better.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So simple to use and connect.  Absolutely love watching all the episodes of Downton Abbey from the start.", "verified": true, "helpfulness": "0/0", "author": "Newcrafter"}, {"rating": 5.0, "review": "Fantastic......just what I wanted for streaming media....just hope HBO GO and others come soon to device", "verified": true, "helpfulness": "0/0", "author": "HENRY E CLAKELEY JR"}, {"rating": 5.0, "review": "Very pleased... This little stick is perfect with prime.. Recommended it over the others...", "verified": true, "helpfulness": "0/0", "author": "Jennifer Williams"}, {"rating": 5.0, "review": "Gave this to a 90 year old couple and they love it.", "verified": true, "helpfulness": "0/0", "author": "Lynda \"Lynda J Poling\""}]