[{"rating": 5.0, "review": "This thing is awesome.  Much quality than using computer linked to TV.", "verified": true, "helpfulness": "0/1", "author": "Michael Miller"}, {"rating": 5.0, "review": "It works great. Wish I would have gotten it sooner. A plus was the video games. Now I have to get one for the kids.", "verified": true, "helpfulness": "0/1", "author": "Trishun"}, {"rating": 3.0, "review": "A little disappointed, thought there would be more prime movie options.", "verified": true, "helpfulness": "0/1", "author": "Lma"}, {"rating": 1.0, "review": "I really hoped this would work and it did perfectly for 10 days or so, then it just stopped. Could not get past the start up screen. Unplugged, switched HDMI inputs, changed the batteries in the remote, etc............There is no technical support online that I can find.  It works great, if it works.", "verified": true, "helpfulness": "0/1", "author": "Kelly W."}, {"rating": 5.0, "review": "Works great! Only complain is that it loses connection to my wifi every once in a while. But other than that, I'm extremely satisfied with my purchase", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best item I ever ordered", "verified": true, "helpfulness": "0/1", "author": "Tim"}, {"rating": 5.0, "review": "This Fire TV Stick is just the greatest...easy to set up, now I am watching everything on my TV. Really happy with it.", "verified": true, "helpfulness": "0/1", "author": "pattie conroy"}, {"rating": 5.0, "review": "Honestly it works very well and fast. Recommending it to my family and friends.", "verified": true, "helpfulness": "0/1", "author": "Daniel Torok"}, {"rating": 5.0, "review": "Love my FireTV Stick, I think it's definitely better than Chromecast", "verified": true, "helpfulness": "0/1", "author": "Sahak D \"Guitarchi\""}, {"rating": 2.0, "review": "My original intent for purchasing the Fire TV Stick was so that my daughter could play a few of our favorite Amazon apps on the TV instead of always having to use my kindle fire. As you can imagine, we were all very disappointed when we discovered that none of her favorite apps (most notably Minecraft) are supported by the Fire TV Stick.Our smart tv already streams Amazon Prime and Netflix without the aid of the Fire TV Stick, so the sole purpose for this purchase was to provide platform for app gaming that didn't require the Kindle Fire. For our purposes, the Fire Stick is not at all useful and a great disappointment.As a streaming device for movies it performs well, but if you own a smart tv you won't need this device to stream amazon, netflix, hulu etc, you only need an internet connection. You DO need it to access Amazon game apps, though. Unfortunately, only half of the apps are supported by the Fire Stick.I would sincerely recommend saving your money.", "verified": true, "helpfulness": "0/1", "author": "Zya"}]