[{"rating": 5.0, "review": "Love this product. Small to travel with we bring it to the hotels with us.", "verified": true, "helpfulness": "1/1", "author": "T. Smith \"BZMAMA\""}, {"rating": 5.0, "review": "Awsome!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "joseph"}, {"rating": 5.0, "review": "Amazing product.", "verified": true, "helpfulness": "0/0", "author": "Erik K"}, {"rating": 5.0, "review": "Fire TV STick gave me more options than I anticipated. It has been wonderful.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little device works great. Make sure you have an open power outlet because the USB from some things isn't enough voltage to power it.", "verified": true, "helpfulness": "0/0", "author": "daniel gilbert"}, {"rating": 1.0, "review": "I cannot recommend this device AT ALL if you are a sports fan.  I was watching MLB in what I THOUGHT was \"real time\" and my sister got on her iphone and kept teasing me because I was 2 outs behind, due to constant buffering issues.  Traded the Amazon stick in for the Roku Streaming Stick and it is BETTER, but STILL the games lag behind on television vs. watching on my laptop.  Trying Roku 2 next...because no one wants their SISTER to be ahead of them by up to half an inning due to buffering issues.", "verified": true, "helpfulness": "0/0", "author": "Wayne Randall Morrison \"BOOTPUNK\""}, {"rating": 5.0, "review": "it is great. I had to buy one for every room in my home.. no kidding..", "verified": true, "helpfulness": "0/0", "author": "Orlando"}, {"rating": 5.0, "review": "So far I'm loving it! Much, much cheaper than the $118 a month we've been paying for directv. I'm thinking of canceling directv all together. Love all the options this provides!", "verified": true, "helpfulness": "1/1", "author": "Northern Snow Bird"}, {"rating": 2.0, "review": "I'm pretty disappointed in the Fire TV Stick. I have an Apple TV on one of my TVs and it works great. I thought I'd save a few bucks and get an Amazon Fire TV Stick for my other TV. And there are a couple things I like about it: as an Amazon Prime member, the Stick gives me easy access to Amazon Prime videos, the music I buy on Amazon, Amazon Prime music, and my photos.  But the apps are not well done--they look amateurish and are not easy to find video one wants to find. But the biggest problem is that Netflix streams sometimes have buffering issues, and if you use the MLB.TV app, the app  buffers constantly (others have reported this but unfortunately I didn't read the reviews before I bought the Stick).  My wireless router is considerably closer to the TV with the Stick than it is to the TV with Apple TV, and I have none of these problems with the Apple TV. And the apps are much easier to negotiate too.  I'm pretty disappointed.", "verified": true, "helpfulness": "0/0", "author": "Thomas Senor"}, {"rating": 5.0, "review": "bought this for my husbands birthday present.  hes a techie and he loves it!  hooked up super fast, very responsive. easy to use and understand", "verified": true, "helpfulness": "1/1", "author": "DetroitAmanda"}]