[{"rating": 5.0, "review": "We absolutely love it!!!  So very happy that we made this purchase!!!", "verified": true, "helpfulness": "0/0", "author": "Kathleen A. Snyder"}, {"rating": 5.0, "review": "Awesome device.", "verified": true, "helpfulness": "0/0", "author": "Tomás Rosario"}, {"rating": 5.0, "review": "So far I am very pleased with the quality of the Fire TV Stick,was very easy to set up and get running not counting the video that started as soon as i was connected took less than 5 minutes and i wa up and running", "verified": true, "helpfulness": "0/0", "author": "Timothy Clarey"}, {"rating": 2.0, "review": "Inadequate instruction manual, requiring trial and error attempts to work with the remote.  In addition, it is obviously programmed to be user friendly to Amazon Aps at great unnecessary expense to the user.  For example, I bought it because it advertises to provide access to Netflix, Hulu, etc.  Yet, the Neflix (et.) user can be hoodwinked into selecting its Logo in an Amazon Ap environment without knowing, despite having a Netflix subscription, and by using Netflix, be subjected to substantial fees for each Netflix movie or TV series that is provided at no added cost with a Netflix subscription.  An added affront is that, while there is a way to access Netflix(etc.) relatively simply, finding it on your own by trial an error is extremely difficult.  To add insult to injury, there is no difference in the Logo within the Amazon universe and the Netflix universe, so its hard to know where one is, once there.", "verified": true, "helpfulness": "0/0", "author": "Saul Klinow"}, {"rating": 5.0, "review": "The whole family loves it!", "verified": true, "helpfulness": "0/0", "author": "Tim Gant"}, {"rating": 3.0, "review": "Great.  Will never buy a smart TV?", "verified": true, "helpfulness": "0/0", "author": "Frances Mason"}, {"rating": 5.0, "review": "So far I am very impressed. Would recommended for people to give it a try.", "verified": true, "helpfulness": "0/0", "author": "Shawn N Sharp"}, {"rating": 4.0, "review": "I am an apple TV guy, and was a little worried this wouldn't live up to what I was used to. For the most part I was proven wrong. The Fire Stick has pretty much all of the same apps as apple TV (although there are a few I still need to use my apple TV for), the system is just as fast, there are a lot of options this has versus apple TV, and all around I am very pleased. The free AirPlay app you can get for the Fire Stick is awesome too as it allows me to stream video and pictures from my phone just like the standard AirPlay.All around this is an awesome device especially at the price point. Would definitely recommend to anyone in the market.", "verified": true, "helpfulness": "0/0", "author": "Michael D. Stephenson"}, {"rating": 4.0, "review": "Feature is nice. I wish newer content movies were available. A little clunky moving through Apps", "verified": true, "helpfulness": "0/0", "author": "Tribechic"}, {"rating": 5.0, "review": "Very easy set up. I purchased it to use on my boat house and it works like a dream. Most Cable companies provide an app if you have internet with them and it gives you a hot spot to use at no cost. Beware if you use your cell phone providers hot spot it will eat your data in two movies. I love that I can take it anywhere I go.", "verified": true, "helpfulness": "0/0", "author": "Tim Silvers"}]