[{"rating": 4.0, "review": "Worked as advertised. No problems installing or using. Enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Carol A. Smith"}, {"rating": 5.0, "review": "The wifi reception is less than the chromecast but if you are not too far away from the router it works wonderful", "verified": true, "helpfulness": "0/0", "author": "Carlos Franco"}, {"rating": 4.0, "review": "Starting to catch on to it's use and really like the features. Very happy to have it", "verified": true, "helpfulness": "0/0", "author": "James W Lawler"}, {"rating": 2.0, "review": "Limited app selection hinders this compared to Roku. I have used the Chromecast and a Roku. I am going back to the Roku as the app selection is greater. I can actually watch my movies on Vudu. I was able to see some of my movies on the Firestick using the Flixster app, but the app is not longer working correctly. Amazon movies is very clunky when having used the competitors versions of a movie app.", "verified": true, "helpfulness": "0/0", "author": "Lucky Joker"}, {"rating": 2.0, "review": "It says my wifi connection is slow but that only happens with fire stick", "verified": true, "helpfulness": "0/0", "author": "George Carolan"}, {"rating": 5.0, "review": "I love the Amazon Fire TV stick.  I've recommended it to my friends.  The stick was more than I thought it would be.  I watch this more than I do regular tv.", "verified": true, "helpfulness": "0/0", "author": "Eva DeFiglo"}, {"rating": 5.0, "review": "I got this Fire Stick specifically to watch Netflix on my tv at home, and it has been so awesome!  It was very easy and intuitive to set up, although it does take a bit of time to do so because you have to type wi-fi password in with the included remote (and in my case download the Netflix app and put in your password to that as well).  Now that it's connected, it's quick to start up and load my shows.  I have never had cable, so for me this has been a very cheap alternative and a real treat.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 4.0, "review": "So far so good.  Much better than chromecast.", "verified": true, "helpfulness": "0/0", "author": "Daniel Alperovich"}, {"rating": 5.0, "review": "Excellent product I must say that is even better than apple tv", "verified": true, "helpfulness": "0/0", "author": "George Pavesio"}, {"rating": 4.0, "review": "Easy as all get out to install and set up. Now I can get prime movies and Netflix and a bunch of other things.  I love it", "verified": true, "helpfulness": "0/0", "author": "Maureen M. Markunas \"Blizz. Mom\""}]