[{"rating": 1.0, "review": "Customer service representative didn't call me back to fix all the issue that I have with the device.", "verified": true, "helpfulness": "1/2", "author": "christopher"}, {"rating": 5.0, "review": "Works fantastic!", "verified": true, "helpfulness": "0/0", "author": "Dennis Black"}, {"rating": 5.0, "review": "I give this product a 5 star rating for one reason.  I cannot give it a 6 star rating.  This is one cool item.  I like it so much I bought a second one for my other HD TV.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Simply awesome!", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "I love this!!", "verified": true, "helpfulness": "0/0", "author": "Dannette Hellwig"}, {"rating": 4.0, "review": "Would put 5 stars if it had an on/off button. kinda lame you have to unplug it every time to turn it off.", "verified": true, "helpfulness": "0/0", "author": "Joel"}, {"rating": 2.0, "review": "The Amazon streaming stick is great - when it works.  About once a week I have to unplug it to get it to connect to any wi-fi connection.  Don't get me wrong, this is a very quick and easy fix, just one you shouldn't need to do.PROS* Slim profile and easy to hide behind TV (depending on your model of course)* Perfect remote (honestly, the weight and size are perfect and feel at home in my hand)* Fast wirelessCONS* Connection issues.  We'll use it for a week or so, and then suddenly it locks up and can't connect to any wi-fi network, even though it can see them (all other devices in the home connect fine).  The only way to get to work again is to pull the power, wait 10-20 seconds, and power it back up.  We've attached the HDMI extender and moved it away, but still have issues.OTHER THOUGHTSI know VUDU is considered a competitor, but I'd love to see a VUDU channel for it in the future.  DLNA support would be great as well, if the hardware would support it.  Excited to see what the future holds.  :)UPDATE 12.19.2014 - Seems to be getting worse.  Used to be about once a week I had to play the 'unplug it, re-plug it in' dance.  Now it's every few days.", "verified": true, "helpfulness": "0/1", "author": "BrianTheSith"}, {"rating": 5.0, "review": "Very easy to set up, even easy for the kids to use", "verified": true, "helpfulness": "0/0", "author": "Huey Welch"}, {"rating": 3.0, "review": "I'll start off by saying that if it wasn't for the $20 promotional offer, I never would have picked up this product, I thought it was too good to pass up especially when comparing it to the other \"stick\" type offerings...I've noticed that a few users indicate this device doesn't work with the USB power from their TVs, I personally found these statements to me inaccurate, I've been running mine off of the power from the TV, the downside to doing this is that I have to wait for it to boot up and connect to the wireless before I can actually use it.  It also notified upon first use that utilizing anything other than the supplied power supply could result in inconsistent behavior or some such.  I haven't noticed any issues yet, but I haven't had it long...I've also seen users complain about the update process taking a long time, over an hour in some cases.  I had a different experience, mine took 5-10 minutes to update...Image/Audio quality seems decent, on par with similar devices...Apps don't \"feel\" as fast as my Roku 3...With Amazon's recent announcement for 4k streaming, this device leaves me confused as to why this capability wasn't baked in(other than cost anyway), not that most 4k TVs require this since most of them are \"smart\" and perform most of these capabilities internally...UI is about on par with amazon instant video.  I stated in another response that Amazon should consider poaching UI engineers from likes of Roku, Netflix, and/or the Plex.  I'm still of the opinion that Plex should have been included...I'm of the opinion that the ratings of the product should range between 2-4.  Ratings of 5 seem to indicate fanboys in most cases while anything below 2 I attribute to various malcontents whether it be a shipping issue, a DOA device(it happens), people don't like anything amazon, and the various other useless reviewers...Now that the promotionally period over, I would still probably choose the Roku over the Fire stick.  It's a far more mature platform which has far more intuitive interface that seems more polished in mo opinion.  I'm hoping that Amazon improves the UI overtime...", "verified": true, "helpfulness": "0/0", "author": "Jonathan D Lewis"}, {"rating": 1.0, "review": "no instructions, difficult to operate, maybe I will return it.", "verified": true, "helpfulness": "1/2", "author": "michael klamik"}]