[{"rating": 5.0, "review": "Incredible value. Amazon is the new Apple, cool and functional!", "verified": true, "helpfulness": "0/0", "author": "Jamie Yezarski"}, {"rating": 5.0, "review": "the firestick is amazing it works flawlessly and took barely any time to set up! i love it!", "verified": true, "helpfulness": "0/0", "author": "Betsy Case-Luca"}, {"rating": 5.0, "review": "Works great! :)", "verified": true, "helpfulness": "0/0", "author": "Holly Byrnes"}, {"rating": 5.0, "review": "Great product....easy and fun to use. We subscribed to SlingTV which is awesome and more affordable than cable.So many other options available as well with Fire TV!!", "verified": true, "helpfulness": "0/0", "author": "Barbara Radcliffe"}, {"rating": 3.0, "review": "It would help if they included directions on how to use it, not just on how to set it up. Scrolling through a long line of available titles is a waste of time; there should be a virtual keyboard on which to type a title you're interested in. And buffering... what a mess. There may be a way around it, but with no instructions, I have no idea what it is. I will give HIGH MARKS to their \"Help\" people, though. I clicked \"CALL ME NOW\", and they did. NEXT DAY. I just went back into my email and found a User's Guide. Haven't read through all of it yet, but maybe the answers to the buffering issue are there. At least I can no longer complain about no instructions... red faced about blasting Amazon about this.", "verified": true, "helpfulness": "0/0", "author": "Bob from Tennessee"}, {"rating": 5.0, "review": "Great Product! So easy to operate :)", "verified": true, "helpfulness": "0/0", "author": "Aimee R House"}, {"rating": 5.0, "review": "Great buy!! It is sometimes a little bit slow and I sometimes loose the remote because it's pretty small but other than that I recommend this to everyone!", "verified": true, "helpfulness": "0/0", "author": "Hannah"}, {"rating": 5.0, "review": "easy to install and worked as advertised", "verified": true, "helpfulness": "0/0", "author": "Walter O'Connell"}, {"rating": 5.0, "review": "Awesome product. Easy to install and use. Great if you don't have a Blu Ray or gaming console to stream from.", "verified": true, "helpfulness": "0/0", "author": "Ruth"}, {"rating": 5.0, "review": "Easy to use and install. I am a prime member but I only had one TV in the house that I could use it on now I can choose what room I want to watch my Prime videos on or use my Netflix account. I already recommended this to a friend of mine, great purchase.", "verified": true, "helpfulness": "0/0", "author": "Arline Brady"}]