[{"rating": 4.0, "review": "Firestick has some good and bad points.  It works well and setup was flawless.  However the free shows are still limited, Prime movies are all old or B movies and many of the History Channel shows have commercials which I don't have to suffer through if I stream History Channel shows through my computer.  I still can't figure out what they have commercials on Firestick.I was expecting a lot more free shows using this but I'll give it some time and see if they add new shows later down the road.  It could be a good replacement for a TV set if it had more free shows.", "verified": true, "helpfulness": "0/0", "author": "Real Jeep"}, {"rating": 2.0, "review": "The idea of this product is great- love the small size, convenient and easy-to-use remote, and design of the menu.  However, the function is far inferior to our Roku.  The Hulu app freezes several times during each show, and the stick will often lose contact with our wi-if (the router is in the same room).  We ordered a replacement thinking it was a faulty stick- as our iPads and other Roku (which is far from router) never freeze or lose signal...but sadly, it appears to be a problem with the apps on this product. Will be going back to Roku.", "verified": true, "helpfulness": "1/1", "author": "AGTPC"}, {"rating": 5.0, "review": "Love It!!! Easy to set up and use!! Much better than Google or Roku!!", "verified": true, "helpfulness": "0/0", "author": "Dwayne Bruns"}, {"rating": 4.0, "review": "I have used Roku, Sony's built in apps on their blue ray player, Xbox One, and Xbox 360 to stream video and so far the best are the Roku and Fire TV. Roku is good if you use lots of apps but Fire TV is great if you use Prime and Amazon. Although the Fire TV has other apps they are not as eau to access as on the Roku. Fire TV is streamlined for Amazon but one you figure it out it does work quite well. I have had a few lag problems but out is a very tiny device which means the amount of memory is limited and it had to basically constantly stream without buffering which would help avoid laggy playback. I think it works almost as good as my Roku 3, I'm happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Matthew Anderson \"Robbin505\""}, {"rating": 5.0, "review": "This thing is awesome and suits our needs perfectly! Even though the stick is mobile, we'll probably buy one for every TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Ashley Ferguson"}, {"rating": 5.0, "review": "Excellent product. Just as described.", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 5.0, "review": "I cant imagine not having this, why did it take me so long to buy it. Should of had it long time ago. Love it.", "verified": true, "helpfulness": "0/0", "author": "Ronal"}, {"rating": 2.0, "review": "Got it so I could stop using my video game consoles for streaming videos, well Amazon instant video works best, Netflix buffers every 20 minutes and hulu plus the video freezes very often and the audio continues.  Still waiting for Comcast so I can use the hbo go app on it, basically, I wasted $40.", "verified": true, "helpfulness": "0/0", "author": "twig"}, {"rating": 4.0, "review": "I really like it other than it has a hard time keeping up if you rewind and replay a video a couple of times in as many minutes. For the price, though, it is great! I love the portability. Overall, very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Heather C. \"meeko77\""}, {"rating": 5.0, "review": "This little device is awesome.  so simple to use... it is plug and play  it it cannot even be seen . Turned my bedroom tv I to a smart tv. Great product.", "verified": true, "helpfulness": "0/0", "author": "AOrta1775 \"Aaron\""}]