[{"rating": 1.0, "review": "This deserves one star just for the poor quality of the remote.  After struggling and failing to open the remote - despite viewing the video that had to be made by Amazon because so many people couldn't open the remote - I downloaded the app and it won't recognize the Fire stick.  GO ROKU!", "verified": true, "helpfulness": "0/0", "author": "Kate Ivy \"Kate\""}, {"rating": 5.0, "review": "easy installation and setup", "verified": true, "helpfulness": "0/0", "author": "Barbara C."}, {"rating": 5.0, "review": "Working well. Easy installation.", "verified": true, "helpfulness": "0/0", "author": "Joe Dolson"}, {"rating": 3.0, "review": "up and down buttons don't work 2 well on remote and cant watch youtube videos with airplay.", "verified": true, "helpfulness": "0/0", "author": "kyle steinkamp"}, {"rating": 5.0, "review": "Easy setup. Easy to use. Very cool device. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "John Wright"}, {"rating": 3.0, "review": "Liked it after I figured out how to use it. Wish it had a better instruction site.", "verified": true, "helpfulness": "0/0", "author": "catherine Byrnes"}, {"rating": 5.0, "review": "The best deal in town.  My wi-fi must be excellent because I can't tell the difference between this and my fire box. It took less 5 min. to set up.", "verified": true, "helpfulness": "0/0", "author": "Diana Nimitz"}, {"rating": 5.0, "review": "Love it, so much  more to watch", "verified": true, "helpfulness": "0/0", "author": "Richard Hayward"}, {"rating": 2.0, "review": "I received the firestick as a xmas gift and i was somewhat disappointed that i could not use the firestick to view movies that are resident on my laptop. I thought i could finally give up the chromecast and realized i could not.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 2.0, "review": "The Fire stick is severely limited by Amazon.  It contains the Miracast technology that allows screen mirroring.  However, they gimped the device, so that I cannot mirror from other Miracast devices, only Kindles.  And, I expect support for all of the major streaming services like Hulu, Google Play, Vudu (Walmart), Redbox and more.  I have a Surface and a Samsung phone.  Both are Miracast capable and neither works with the Fire Stick.  Amazon made a great product and then intentionally ruined it.Okay, if I had unlimited HDMI ports, I might consider keeping this. Not.  I don't want to have a dongle for Google ChromeCast, a dongle for Amazon, an Apple TV for Apple, etc.  I have had Windows 8.1, Mac, iPhone, Samsung/Android and Amazon Kindle products in my home.  All of them support Maracast except Apple of course.  The only products I have gotten rid of were the Fire Stick and Kindle Fire.  I dumped both or the same reason.  Amazon delivered products that were intentionally limited to prevent interoperability.  While I am on the topic, I am moving away from buying movies and TV on Amazon.  The movies I bought before could be downloaded to my PC.  Amazon removed that capability.  Now I can only download the movies to a Kindle.  What a shiest!  I'm sick of Amazon offering cools stuff and then later pulling away interoperability.  They are becoming more and more like Apple in that way.  And, it is pushing me toward other products and services like Android and Windows.  I can access any service on my Windows PC and Windows tablet.  Kindle products were appealing because the were cheap.  They lost all appeal when they put a below standard interface on top of a great product (Android) and took away most of the benefits.", "verified": true, "helpfulness": "3/3", "author": "Linda J. Advena \"busy mom\""}]