[{"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "Madison Harper"}, {"rating": 1.0, "review": "Works horribly and customer service won't help replace it", "verified": true, "helpfulness": "0/0", "author": "Bruce Roberts"}, {"rating": 5.0, "review": "Great tool for streaming online material. Would highly recommend the Fire Stick to anyone.", "verified": true, "helpfulness": "0/0", "author": "AA"}, {"rating": 5.0, "review": "Everything works great", "verified": true, "helpfulness": "0/0", "author": "Lawrence Cramer"}, {"rating": 4.0, "review": "I do like this product, but there is more to learn about it.  I picked it up during a special promotion by Amazon and I watched some Netflix as well as some cooking channels on it.  I do not pay for cable TV, so this product along with my computer and digital TV antenna is all that I need to watch programs, documentaries and movies.", "verified": true, "helpfulness": "0/0", "author": "Eddie R"}, {"rating": 5.0, "review": "I've heard about some bad reviews for iPhone app, after downloading it to my iPhone 5 and playing with it for a couple of minutes, have found it very simple to use. Highly recommend", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 4.0, "review": "Overall I love my Fire Stick.  I got it for a sweet deal.  I do find some lag when I am connected to Netflix however.  This problem does not occur with my other devices.", "verified": true, "helpfulness": "0/0", "author": "R. Becker"}, {"rating": 5.0, "review": "I managed to receive this item ahead of a lot of people. It looks like it still is on a waiting list. I tried this, figuring that my wi-fi wouldn't support it, but thought $40 was a small enough bet. I'm probably in the market for a newer router, but I'm in love with this little gadget.", "verified": true, "helpfulness": "0/0", "author": "Vagabond"}, {"rating": 5.0, "review": "Such a needlestick it's amazing what you can find on this little device would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Mr Vedder"}, {"rating": 4.0, "review": "It was easy to set up and works OK.  It skips (?) when playing Netflix and other apps, but Prime shows work fine.", "verified": true, "helpfulness": "0/0", "author": "Michael D. Spayde \"MSPAYDE\""}]