[{"rating": 5.0, "review": "I love this stick!!  It works so much better than the other devices that come adapted with the Netflix, Hulu, Youtube, etc. It picks up my WIFI better.", "verified": true, "helpfulness": "0/0", "author": "laurie thomas"}, {"rating": 4.0, "review": "Purchased when Roku started to go on fritz. I'd been planning to purchase since I am already a Prime member and wanted access to instant streaming account on tv. HBOGO was anticipated bonus.Overall, product meets expectations. Set up was easy. Navigation may be a bit unwieldy if members of your household aren't tech savvy. (Sometimes recently used apps like Netflix and Hulu don't load from most immediate menu and you have to scroll down to apps menu instead.) The remote works just fine and is better quality than some I've seen for comparably priced boxes.The only drawback: I was unable to access HBOGO. App downloads and operates, but I guess Amazon still has yet to iron out differences with some cable providers (Comcast Xfinity).", "verified": true, "helpfulness": "0/0", "author": "Melissa Walker"}, {"rating": 5.0, "review": "Love my fire stick!!!", "verified": true, "helpfulness": "0/0", "author": "Sheri S. Parker"}, {"rating": 4.0, "review": "Probably still should have spent the extra money and bought the LAN version, but... this works pretty well. Mine had a couple glitches that tech support on the website cleared up. Amazon was extremely good about making sure I was taken care of. Basically had to unplug it and use the included hdmi extension. Guessing the hot plasma tv was causing bad juju when I plugged it directly into the tv. (Unit did get pretty hot.) All is golden now.The remote and remote app take a little getting used to. YouTube and Netflix seem to be a bit more difficult than they should be.Free Android remote app is way cool because you can voice search for no extra $$$. I like the FireStick more than the Sony N200 this replaced. MUCH more content with Amazon Prime Video access.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow!!!This sure surprised me, it's only been about a month but, I'm loving this stick so far!!!", "verified": true, "helpfulness": "0/0", "author": "Arlene Deliotte"}, {"rating": 2.0, "review": "Interface is crude. Really needs work.Movie prices are high", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "You have to have a really great connection. Stalls all the time.", "verified": true, "helpfulness": "0/0", "author": "Galina L. Vaintrub \"Lisa\""}, {"rating": 5.0, "review": "Awesome!  I have basic cable so this give me an easy way to watch movies when I feel like it.", "verified": true, "helpfulness": "0/0", "author": "L.A.W."}, {"rating": 4.0, "review": "I was hoping for more movies on amazon", "verified": true, "helpfulness": "0/0", "author": "Phoenixarea"}, {"rating": 4.0, "review": "Could use some pointers on all the features, I guess I'll go to Best Buy where I purchased and hope one of the salespeople can help.", "verified": true, "helpfulness": "0/0", "author": "Jackie Smith"}]