[{"rating": 2.0, "review": "Two stars because it works... basically... but almost every time I try to use it, it takes 3-15 minutes to get it reconnected to my network, which is extremely frustrating.  My Apple TV and PS3 connect every time without delay, and I can start streaming video within a minute -- but almost never that easily or quickly with the Fire Stick. Hugely disappointing.", "verified": false, "helpfulness": "0/0", "author": "JRMlaw"}, {"rating": 3.0, "review": "It runs very smoothly but I can't get HBOgo or Showtime Anytime on it because they don't have my provider on the list. I bought this to make my cable bill lower by getting rid of the box in my bedroom, but now I can't. On the brightside Netflix and Amazon Prime work great on it.", "verified": true, "helpfulness": "0/0", "author": "Katie Warman"}, {"rating": 5.0, "review": "Great transaction! Went smoothly!!", "verified": true, "helpfulness": "0/0", "author": "todrob"}, {"rating": 4.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "Mari Carroll"}, {"rating": 3.0, "review": "Seems to have memory management issues. Will often have to reboot to restore responsiveness.Would be nice if it killed off background applications when low on memory.Casting to this device from Chrome is also not functional.I do enjoy the remote.", "verified": true, "helpfulness": "0/0", "author": "Termina"}, {"rating": 5.0, "review": "I have an Apple TV and I mainly got this for my bedroom. BUT it runs so much more smoothly, and the app you can download to turn your smartphone into a remote is great! Its a great buy. I'm thinking about getting the Fire TV for my living room now.", "verified": true, "helpfulness": "0/0", "author": "Robert Fortner"}, {"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "doodoo"}, {"rating": 3.0, "review": "The Fire Stick is fantastic (no pun intended).  However, it does 'freeze' more often than I expected. I have the Fire TV also, which has never frozen on me ever (Apple TV should be called Frozen TV by the way).  That's my only complaint. Otherwise it's awesome.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "Best little device I have. You can set it up in your sleep or have a toddler to do it. It automatically has all of the popular apps such as Netflixs and Hulu, but the best part about it is being able to watch YouTube videos on my TV.. Not to mention they have games, and everything runs smoothly. The only thing I wish is that there is a On/Off switch, unfortunately to turn it off you just have to plug it out, but things could be worse.", "verified": true, "helpfulness": "0/0", "author": "Rebecca92"}, {"rating": 5.0, "review": "Love it you need a strong WiFi tho wasn't aware of that but it's awesome", "verified": true, "helpfulness": "0/0", "author": "Julie Gonzalez"}]