[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Diane Desjardins"}, {"rating": 2.0, "review": "We own both a Roku and 2 Amazon Fire TV Sticks and have for at least 6 months. Unfortunately, both fire tv sticks freeze constantly. The picture will freeze while the volume continues and then the screen catches up and speeds through the scene. Its a terrible way to watch a show when it does this constantly. Have tried unplugging to restart it and it only works temporarily. Great products other than that but I have to say, the Roku wins if given the comparison because of this issue.", "verified": true, "helpfulness": "1/1", "author": "Daniel"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Frank Osafo Adjei"}, {"rating": 5.0, "review": "Very pleased with quality and ease of use.  Purchased a second stick for another TV after trying a different brand that was not a good experience and had to be returned.", "verified": true, "helpfulness": "0/0", "author": "treesoh"}, {"rating": 5.0, "review": "I took it with me this last spring when I went on vacation.  I loved having it and watching different shows as did my children.", "verified": true, "helpfulness": "0/0", "author": "JC37138 \"love sun shine\""}, {"rating": 4.0, "review": "Uh...I'm in the USA, my registered address is there, all my dealings with Amazon have been in ENGLISH - but this came set up in German.  I don't read German so it took a while before I finally got everything changed to English.So far so good, though.  A bit of a learning curve in spite of what they say.  It only allows you 250 songs from iTunes without paying extra so that's kind of useless.  I don't think my 20+GB of photos will be allowed, either, unless I pay more.", "verified": true, "helpfulness": "1/1", "author": "The Lawn Ranger"}, {"rating": 5.0, "review": "Great deal and works almost as good as the fire box on my other tv.", "verified": true, "helpfulness": "0/0", "author": "Igore"}, {"rating": 5.0, "review": "Very convenient!!", "verified": true, "helpfulness": "0/0", "author": "Jaylynne couch"}, {"rating": 5.0, "review": "Works great - even with a challenging wifi link.", "verified": true, "helpfulness": "0/0", "author": "John S. Martin \"jsmarti\""}, {"rating": 5.0, "review": "My granddaughter can now access her favorite shows in her room. Perfect!", "verified": true, "helpfulness": "0/0", "author": "Sandy L"}]