[{"rating": 5.0, "review": "I had a little trouble hooking it into my hdmi port of the tv but after it was hooked in, it was easy to implement.  The picture was clear and audio was perfect.", "verified": true, "helpfulness": "0/0", "author": "interested reader"}, {"rating": 3.0, "review": "Bought this as a gift for my husband and we thought it would be nice to actually utilize as a second source for cable TV but unless you are an AMAZON Prime member, it is not worth the extra money spent.  I can toggle my Kindle Fire to the TV and get the same results.", "verified": true, "helpfulness": "0/0", "author": "Karzak"}, {"rating": 3.0, "review": "Not as many free movies as I feel were advertised", "verified": true, "helpfulness": "0/0", "author": "Leslie Zinn"}, {"rating": 1.0, "review": "I purchased a firetv stick a month ago from Staples. When I tried to connect it to my tv it would not work. After an hour on the phone with amazon customer service I was told that the device I purchased was an older version and that one of the software updates was a patch to allow it to connect to 5Ghz networks. Since I have a 5Ghz network the device cannot connect to get the update, so the agent mailed me a new firetv stick. No problem.I received my new stick in the mail quickly and tried to connect it, after downloading updates, the stick still wouldn't work. I called back to customer service and after another hour and resetting the device multiple times it seemed like it was working.In the next 2 weeks I tried using the firetv device 3 or 4 times and each time it wouldn't work.I finally had a few hours to spend on the issue so I spoke to a tech support agent and explained that the stick powers on and comes to the home screen where it shows movies, etc. that are viewable. When I select something it just buffers and then goes back to the home screen, then the home screen shows no options and just says home not available. When I check the network on the stick it says \"very good\" connection and \"connected\", I have a 50Mbs connection with a wireless N router, I have 13 other devices in the house that all connect fine and have no issues, when I speedtest with my phone sitting next to the firetv stick I get about 35Mbs Down, and about 18Mbs up. So there is not issue with my network or speed.What the agent said next blew my mind. He asked me how far the stick was from my router, I guessed about 20 ft. He told me, \"the FireTV Stick will not work unless it is within 8ft of the router\"!!! What!! Amazon markets this as a device you can use in a hotel room, or a dorm, it's to add a TV in another room without needing to run cords!! How could 8ft be it's max range? I specifically asked the Amazon agent \"What you're saying is that amazon put a cheap Wi-Fi antenna in the FireTV stick and so it will not work more than 8ft from a router?\", the agent said \"yes\". I asked for a supervisor, and was connected with someone named E.J., I asked EJ about the range capabilities and he stated that the \"optimal range\" of a FireTV stick is 8-15feet!! I grabbed a measuring tape and the tv that the Firetv stick will not work on is 12 feet from my router, but there is also a wall. When I plugged the stick into a tv that is 1 foot from my router it worked just fine. I have tablets, smartphones, and even a roku stick that all work fine more than 25 feet from my router, through multiple walls, and will stream flawlessly. Lets just say I am disappointed.To sum up, the FireTV stick has a beautiful user interface, is easy to set up, and looks nice. The issues is that it doesn't do the one thing that you need it to do, work wirelessly. If you are using this device in the same room as your router it will work fine, otherwise you are out of luck. If you are looking for a device that will connect your tv in the same room as your router, I suggest going with a device that allows for a wired connection you will have a more reliable signal.Amazon should pull this product off the market. By continuing to sell it they are only going to take loyal amazon customers, like myself, and make us angry.", "verified": true, "helpfulness": "1/1", "author": "Alex A. \"AlexA\""}, {"rating": 5.0, "review": "This works perfectly and easy to install.", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 4.0, "review": "Works perfectly with Netflix that is what I wanted. RC is great!", "verified": true, "helpfulness": "0/0", "author": "Gus"}, {"rating": 5.0, "review": "I love it. Love that I can just plug it in the TV and there is no box unlike apple tv.", "verified": true, "helpfulness": "0/0", "author": "Armando Rodriguez"}, {"rating": 5.0, "review": "Too good, wide variety of apps and features. Quick response, I will recommend to my friends.", "verified": true, "helpfulness": "0/0", "author": "Arunpradeep"}, {"rating": 5.0, "review": "I love it! So much entertainment in one little gizmo.  I watch it all the time.", "verified": true, "helpfulness": "0/0", "author": "Barbara Jenshak"}, {"rating": 5.0, "review": "Works good, use every day", "verified": true, "helpfulness": "0/0", "author": "James Avakian"}]