[{"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/1", "author": "J. Angel Saucedo Carrillo \"kitazo\""}, {"rating": 5.0, "review": "Amazing! We have an Xbox that we use to stream different programs but HBOGo does not stream properly making it impossible to watch. But the Fire Stick has solved this issue. Shows seem to load quicker on the stick rather than the Xbox.  It is super easy to set up and use.  My fiance set it up and watched the informational video that plays once you start use.  I did not watch this but easily figured out the remote and how to navigate around. Well worth the small investment!", "verified": true, "helpfulness": "0/0", "author": "D. Briede"}, {"rating": 5.0, "review": "Amazing!!!", "verified": true, "helpfulness": "0/1", "author": "Ricky Roberts"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "Charles Miller"}, {"rating": 5.0, "review": "Love this item !  Easy to install , opens you up to great tv series and movies!  Much better then hbo and tv shows .  Get it !", "verified": true, "helpfulness": "0/0", "author": "susan romano"}, {"rating": 3.0, "review": "The Prime movies are not good.  Yea there are a few worth watching but most of them are old or movies I've never heard of.  There are a plethora of kid friendly things to watch.  This product is for anyone that doesn't have cable and subscribes to Hulu and Netflix...", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I like the Fire Stick, but there are still to many movies that have to be paid for (not on Prime) and the cost for those movies is OVERPRICED. It is still cheaper and just as easy to use Redbox!!!", "verified": true, "helpfulness": "0/0", "author": "Valerie Goodrich"}, {"rating": 5.0, "review": "Thanks this good but need more memory", "verified": true, "helpfulness": "0/1", "author": "chritian"}, {"rating": 5.0, "review": "Better than I thought it would be.", "verified": true, "helpfulness": "0/1", "author": "Duane"}, {"rating": 5.0, "review": "Excellent buy!", "verified": true, "helpfulness": "0/1", "author": "Miki"}]