[{"rating": 5.0, "review": "Got this as a gift for my sister....she's a very happy camper!", "verified": true, "helpfulness": "0/0", "author": "Trandy"}, {"rating": 1.0, "review": "So terribly disappointed with this product. First complaint, it did not work on the tv I originally purchased it for. It simply wouldn't boot. So it seems this thing is no where near as universal as say a roku or chromecast (both of which I have, use, and love). Big deal breaker there. Once I found a tv in my house it was compatible with, the navigation is on par with an android tablet with 3 or 4 years of use on it. I mean PAINFUL. 15+ seconds to switch menu screens? Seriously, felt like I was using a Pentium 2 windows laptop. Please introduce a no star option Amazon, for products like this.", "verified": true, "helpfulness": "0/0", "author": "Preston J. Broussard"}, {"rating": 5.0, "review": "At first I wasn't going to buy it but once I saw it at my friend house and seen how it works I went and got me one get buy ever the amazon fire stick is great to have still learning what it can do go buy one now :-)", "verified": true, "helpfulness": "0/0", "author": "silkie"}, {"rating": 4.0, "review": "Awesome!  Worth it.As long as you have a Hulu plus, NETFLIX and hbo account.  Otherwise don't bother.", "verified": true, "helpfulness": "0/0", "author": "Clay Murfet"}, {"rating": 3.0, "review": "Will know more once I use it more.  I mainly watch movies and currently can watch all the movies I want on my Netflix account for $7.99 a month or watch current movies on Comcast at good prices.", "verified": true, "helpfulness": "0/0", "author": "Juanita Charlton"}, {"rating": 4.0, "review": "It's neat but my internet is slow sometimes.", "verified": true, "helpfulness": "0/0", "author": "Cavaid"}, {"rating": 3.0, "review": "Does have trouble streaming at times had to reboot 6-7 times. Likes to get a mind of its own when surfing as well.....They could make that a bit better in my opinion. It's not a bad product but they could make improvments.", "verified": true, "helpfulness": "0/0", "author": "Mark V. Motl"}, {"rating": 5.0, "review": "THIS IS A GREAT PRODUCT", "verified": true, "helpfulness": "0/0", "author": "hamlet disla"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "cj"}, {"rating": 5.0, "review": "It was easy to install. Works great!Would buy again.", "verified": true, "helpfulness": "0/0", "author": "Pam"}]