[{"rating": 5.0, "review": "Love!  Immediately ordered another one for our second tv!  Why would anyone pay the ridiculous satellite prices?", "verified": true, "helpfulness": "0/0", "author": "Lisa Womack"}, {"rating": 5.0, "review": "Way better than google!", "verified": true, "helpfulness": "0/0", "author": "Steven Lamb"}, {"rating": 5.0, "review": "Love, Love Love....I wish I would have purchased like 10 of them when they 1st came out.  The remote is small and easy to use, the product is easy to install and is very user friendly.  I find that I use my firestick more often than I use my ChromeCast.Now I just wish major networks would get on board with their apps being offered through Amazon Prime.  I would love to get rid of cable completely and only use the firestick to watch my favorite shows.", "verified": true, "helpfulness": "0/0", "author": "Pixieleaf"}, {"rating": 1.0, "review": "I had lots of problems with getting the firestick to connect to my Buckeye Cable System router!!I spent over 4 hour over 3 day period, and 4 phone calls to Buckeye's technical support, before I could get the firestick to work!!Buckeye's Technical Support said they have many problems with firesticks, they said that Roku works much better.  If I had it to do over again I would buy a Roku!!", "verified": true, "helpfulness": "0/0", "author": "goodtimes4you"}, {"rating": 5.0, "review": "Awesome new device especially with Sling.  I cut my cable and didn't look back.  My Godson wants you all to allow the Minecraft download for the Fire TV Stick since it is available for Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Douglas R. Bailey"}, {"rating": 4.0, "review": "After about one month of viewing on the Fire TV Stick, by enlarge I am very pleased.  My wife and I have used it to watch Sling TV and the quality rivals cable.  I was particularly interested in getting the viewing desired at a low cost.  Praising of cable TV has become outrageous.There are a few glitches I will list. Once and awhile the Fire Stick will lose communication with the internet. I will then need to restart the Fire Stick or unplug and replug it in for a reconnect. Tiresome but doable.  Once and awhile a particular program Wil buffer but other stations are still broadcasting fine. After a few minutes I will return and all is well once again.  I am not sure what causes this but as technology progresses these drawbacks, I am sure, will be resolved.", "verified": true, "helpfulness": "0/0", "author": "Dennis Stott"}, {"rating": 4.0, "review": "Like it so far . . . it has frozen a few times so dropped a star for that.  Will try to update after using it awhile . . .", "verified": true, "helpfulness": "1/1", "author": "RB \"BIG READER\""}, {"rating": 5.0, "review": "for the money it is a great deal. It will help cripple the big cable company's over charging us .", "verified": true, "helpfulness": "0/0", "author": "Moondog Vinyl"}, {"rating": 5.0, "review": "Very happy. It was a gift for my daughter.", "verified": true, "helpfulness": "0/0", "author": "maryellen e mccormack"}, {"rating": 2.0, "review": "As far as the video quality goes, it's great. Performance is also good. I'm ranking the Fire TV Stick only two stars because it constantly forgets/looses the Netflix and Hulu Plus password. At first I thought this might be due to software upgrades, but it happens constantly. The Fire TV stick does remember my Amazon Prime credentials just fine. Having to resign in to services such as Netflix and Hulu Plus constantly is unacceptable. Most reviewers here seem to ignore this issue but it is a serious time waster and although Amazon is not responsible for maintaining the Netflix and Hulu apps for their device, ultimately these apps are going to be very important to many buyers. I also have a FireTV (box) and it does not have this problem. I would avoid the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Deats"}]