[{"rating": 5.0, "review": "top product, great content and super easy install", "verified": true, "helpfulness": "0/0", "author": "Ulrik Nackaerts"}, {"rating": 5.0, "review": "Love it. Minimal but powerful. Only need to invest in USB cord to help with power consumption via the TV and not an outlet.", "verified": true, "helpfulness": "0/0", "author": "Timothy Lusk"}, {"rating": 5.0, "review": "Love this thing so much I bought a second one so my lazy butt doesn't have to move it from the bedroom to the livingroom. I've also been able to introduce my girlfriend to \"binge watching\" - prime music playlists put lyrics on the screen turning my living room into the family karaoke much to the dismay of the cat. Also saved thousands of construction and pet fee dollars by downloading the free fish tank and fireplace apps.", "verified": true, "helpfulness": "0/0", "author": "Justplainnico"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "This is so easy to use, I use it all the time ! Great streaming selection!", "verified": true, "helpfulness": "0/0", "author": "MH Aero Gardner"}, {"rating": 5.0, "review": "I am extremely happy with my fire stick and its ease of use. It is an awesome edition to having a prime membership. I am also ecstatic that it's something for the entire family to use. From movies, shows and games to music, I love it!", "verified": true, "helpfulness": "0/0", "author": "Kara"}, {"rating": 5.0, "review": "It is very good", "verified": true, "helpfulness": "0/0", "author": "Gerald lopes"}, {"rating": 1.0, "review": "Doesn't work well with Comcast Routers.  You need to buy a dual band router.  I haven't been able to use it yet.", "verified": true, "helpfulness": "1/1", "author": "Mr. N"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "dave"}, {"rating": 5.0, "review": "Even better than I expected. Installation took 3 minutes and everything comes in crystal clear. Coupled with Amazon prime and I now have a one stop shop for most of my digital entertainment; movies, tv shows, tons of music, and games. Definitely worth the $30something price tag.", "verified": true, "helpfulness": "0/0", "author": "Review"}]