[{"rating": 5.0, "review": "The fire stick  is great and works really well with plex and xbmc", "verified": true, "helpfulness": "0/0", "author": "Rodney Clark"}, {"rating": 4.0, "review": "Seems nice, operates as promised, wish it would wake the TV using the REGZA-Link (CEC) protocol. If the TV is already on, it can/will switch to that input if the Firestick remote is operated. Just won't wake the TV, as does the PS3 when it is turned on.", "verified": true, "helpfulness": "0/0", "author": "C. C."}, {"rating": 5.0, "review": "So far, so good. Set up was quick and painless. Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "lisa"}, {"rating": 4.0, "review": "So far so good easy to set up and my 5yr old is finally in his room watching netflix", "verified": true, "helpfulness": "0/0", "author": "Vincent"}, {"rating": 4.0, "review": "First and foremost... The price of the Firestick is awesome! I purchased it when it was on sale and it was definitely worth the price. I definitely like Amazon products, but I am not going to say that don't think they won't have issues...I haven't found anything major going on with the Firestick as of yet.I wasn't expecting to have to plug it in, so it meant that I had to change where I could locate my tv.My largest issues with the product is the availble programs with the Fire Stick. I didn't want to have to go back and forth between my blu ray player for certain programs, but since fire stick doesn't not have access to VUDU or Disney Movie Everywhere, which is on most smart tv/dvd/blu ray players these days, it is an issue. So for that issues, I will just use my blu ray player and not turn on the stick too often.For people that don't use the program, the stick will work perfectly.", "verified": true, "helpfulness": "0/0", "author": "MzLBell"}, {"rating": 1.0, "review": "This stick will not connect to our WiFi and when it does we end up with constant buffering. When it does connect, it will only play Amazon Prime videos, it says \"no connection\" when I try to play my Netflix or the other apps. I have the extra connector plugged in, my wifi is ultra fast with no problem on any of the 7 other devices we have. The Amazon Fire Stick doesn't work.", "verified": true, "helpfulness": "0/2", "author": "Alison Lyke"}, {"rating": 5.0, "review": "The stick itself was simple to install.  It easily hooks up to your wireless system and has a very strong signal.", "verified": true, "helpfulness": "0/0", "author": "Struan \"Noble House\""}, {"rating": 5.0, "review": "Got it for 20.00 for the promotion. Item as described.", "verified": true, "helpfulness": "0/0", "author": "Joshua Woods"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is slick! We bought it for our daughter to use on her TV. It took just a few minutes to set up after plugging it in and it was up and running. It has a nice GUI that is easy to use and it's wireless connection is rock solid. I definitely recommend the Fire TV stick as an incredibly easy way to add streaming smart TV functions to your existing TV.", "verified": true, "helpfulness": "0/0", "author": "TZ"}, {"rating": 5.0, "review": "Better than I though!!!", "verified": true, "helpfulness": "0/0", "author": "michael cavazos"}]