[{"rating": 4.0, "review": "Wish their were more shows/movies available on prime instead of having to pay for them :-(", "verified": true, "helpfulness": "0/0", "author": "ashley pilant"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It will be good to have Chrome Browser inside TV stick as apps", "verified": true, "helpfulness": "0/0", "author": "arindam"}, {"rating": 5.0, "review": "I love this thing.....  I cut my cable out and now have  these on all my tvs along with an HD antenna.", "verified": true, "helpfulness": "0/0", "author": "Average Joe"}, {"rating": 5.0, "review": "Life changing.  Such an awesome device.  Cannot recommend this product enough.", "verified": true, "helpfulness": "0/0", "author": "Andrew M. Long"}, {"rating": 5.0, "review": "I am not good with electronics, this took less than 3 minutes to set up. I can't believe I didn't get this sooner. I haven't used all of its potential yet but worth the money!", "verified": true, "helpfulness": "0/0", "author": "mattb"}, {"rating": 1.0, "review": "Bought this specifically for Hulu Plus.  Hulu app doesn't work.  Very disappointed as customer support hasn't fixed this problem.", "verified": true, "helpfulness": "3/3", "author": "Sam L"}, {"rating": 4.0, "review": "Very good value for money - it is so easy to set up and use. Navigation takes a little getting used to - but that’s just a matter of practice. I recommend this product very highly. I also have an Apple TV but find the Fire Stick, on the whole a lot easier to use and definitely better value.Nice job Amazon - this is a very good product.", "verified": true, "helpfulness": "0/0", "author": "Martin R. Davis \"Truth Seeker\""}, {"rating": 5.0, "review": "This thing is awesome.  Crystal clear HD channels.  I got it for a great deal when signing up for Sling Tv.  Everything i thought it would be.  Doesnt take up any room and is hidden from view.", "verified": true, "helpfulness": "0/0", "author": "DEN"}, {"rating": 5.0, "review": "Thanks!", "verified": true, "helpfulness": "0/0", "author": "Dr.Lynn M. Pearl"}]