[{"rating": 5.0, "review": "I love this thing!!  Just one thing...  I have 50mb download and it seems like it freezes sometimes... like lag.  I'm not sure if it's a heating issue.. but my house is 69F...  Maybe a firmware update in the future will fix it.  It makes my Roku stick seem like a turtle taking a nap.", "verified": true, "helpfulness": "0/0", "author": "seattlecivic"}, {"rating": 5.0, "review": "I absolutely love this product.  I have used for Facebook pictures, Net Flix, Prime and apps.  I really enjoy the fireplace app.  It works really will to stream movies as well.  The remote is simple to use.", "verified": true, "helpfulness": "0/0", "author": "Ramona M Towne"}, {"rating": 5.0, "review": "Love my Firestick.  I can listen to all my music and the newly released movies are way cheaper than Comcast On Demand", "verified": true, "helpfulness": "0/0", "author": "Lori Marshall"}, {"rating": 4.0, "review": "I enjoy it when I am able to use it.", "verified": true, "helpfulness": "0/0", "author": "Troy G"}, {"rating": 4.0, "review": "I guess you could say I'm in the Amazon bubble or getting there. I've been a Prime member since 2005 and have 2 FireTV, this FireStick and Echo now, kindle, etc... This is awesome. I got it for when traveling to pop it in and be able to watch my stuff. It works just like FireTV and so far have been happy with all FireTV products. My only complaint is I wish they would allow you to search everything and not just Amazon stuff with voice.This would be 5 stars if the remote had the voice control like the FireTV and I wish it didn't require to be plugged in. It would be nice to just plug it in and go. Otherwise it's awesome. Got it right at Christmas time and all the family loved it. Made it so easy to get to Netflix and Amazon stuff for the kids. Amazon keeps stepping up and doing some great stuff!!", "verified": true, "helpfulness": "0/0", "author": "jasonstuff \"jasonstuff\""}, {"rating": 5.0, "review": "A very good product with a few limitations and minor bugs that are easily forgiven because of the low cost, ease of use, and overall excellent quality.Pros:-Support for the three things that matter to me- Plex, Amazon Prime, and Netflix-AC wireless is good enough for me to stream high bit-rate, 1080p content from my desktop computer using Plex.-Menus and remote are easy to use. A surprising amount of customization is available in the Plex app if digging far into menus, but necessary functions in Prime, Netflix, and Plex are all quickly accessible and relatively intuitive.-Video quality is, to my eye, quite good for such a tiny and inexpensive device. Whether streaming Netflix/Prime over the Internet or streaming Plex over LAN, there is little banding, blocking, or jaggies. Up-conversion of SD content is good, but don't expect MadVR levels of quality.-Speed is pretty good. Navigating menus, buffering times (I know this is partially WAN/LAN limited), and fast-forward/rewind are all snappy.Cons:-Twice in the few months of use, I have had to power cycle the device because it gives me an \"HDCP unauthorized. Content Disabled\" error. It seems to happen when going to use the device after my last usage included turning off the TV while a movie is actively playing. This could be a coincidence, as I haven't tried to replicate the issue. It's inconvenient.-Enabling subtitles for certain content in the Plex app will result in freezing of the video. It won't play until subs are disabled. This has only happened a few times, and I'm sure it's down to an incompatibility issue with certain styles of subtitles in the .mkv container. However, the issue SHOULD be correctable since the same files will play, with subtitles, just fine in Plex when I use the Google Chrome web player on a PC.", "verified": true, "helpfulness": "0/0", "author": "dqniel"}, {"rating": 1.0, "review": "It sucks", "verified": true, "helpfulness": "0/3", "author": "Michael"}, {"rating": 3.0, "review": "Okay, so after scouring the entire AMAZON site for useful help... my problem was that my item was not REGISTERED like they said it would, and I even have PRIME. If you must register your item... you can only do that if it is plugged in/ and in your account page where it shows your DEVICES.. it has to be shown there. Mine was not.2. You can't just plug in the HDMI stick into your tv. I was told the little extender HELPS w/reception.. so note that. The STICK is not a chargeable device. That is actually good, but you must know that the SEPARATE POWER CORD is not for charging, it MUST BE PLUGGED IN to work the STICK. That was my main issue. I thought like other devices I have used, RoKU, Cell phones, memory \"sticks\" you charge n go. But I am glad it is not that way, cuz then you would have to waste time charging the thing.Thankfully the customer service lady registered my DEVICE, FIRE TV STICK for me whilst I tried to find an outlet that would fit the FAT SQUARE POWER CORD... not a good thing, as it hogs your power strip.Finally, I hope this other issue is resolved with better design.. the remote battery cover would not come off to place the batteries in there. I felt like an ape ready to bang the thing and use a can opener to open the thing.. that could easily break from attempting to open.. until I got a rubber glove to forcefully pry the battery lid off. THEN I was able to install the batteries, and maybe foolishly, I even put a little vegetable oil on the prongs so it would slide off better next time. Uhhh.Once all that is done: GREAT to watch all my PRIME MOVIES, VIDEOS, TV SHOWS and all that good stuff. They need a better technical writer.. one who actually uses the product while writing them - as I once did in my profession.", "verified": true, "helpfulness": "1/2", "author": "therese90"}, {"rating": 5.0, "review": "Great I LOVE IT.", "verified": true, "helpfulness": "0/0", "author": "L. J. B. Philander"}, {"rating": 1.0, "review": "I thought it supported airplay.  I suppose it is great if you have an android or amazon phone.  It basically will only play netflix...  My ps3 did that fine.  I don't understand what good this is.  It doesn't even have hbo go and chances are when it gets it comcast users wont be able to use it just like on the ps3.  Also no xfinity go app which is probably comcast fault but still makes this even more useless.", "verified": true, "helpfulness": "0/3", "author": "Luke Dowell"}]