[{"rating": 5.0, "review": "I never Thought that there would be a product that comes so close to replacing cable or sat.", "verified": true, "helpfulness": "0/0", "author": "Wornout \"wornout\""}, {"rating": 2.0, "review": "It's OK.  Not great.  I prefer my Roku devices. Minus one star for not having Yahoo! Screen, minus another for having to search all over for \"apps\" that I don't use that often, and minus another star for a stick that has to be plugged in ALL the time because it requires more power than 95% of all HDMI outlets supply.  I also have an issue that whenever I play a Prime video, it stops 30 seconds in and then I have to press play, as it pauses itself.  I would choose another Roku 2 if I could make the choice again.", "verified": true, "helpfulness": "0/0", "author": "Steve Roth \"-Stevo\""}, {"rating": 4.0, "review": "Great product but sometimes has trouble with Netflix!", "verified": true, "helpfulness": "0/0", "author": "Schari"}, {"rating": 3.0, "review": "Before I purchased this item, I read the reviews and noticed people complaining about a lot of buffering when you're watching MLB TV through the stick.  They are right.  All the movies, TV shows and other items I view play fine.  But when I try to watch a game through MLB TV (I have a subscription) it pauses and buffers every 10-15 seconds.  Not a great way to watch a game.  Luckily, I also have Apple TV on the same internet connection and rarely get a buffer pause on that.  What's wrong with Fire Stick that this happens?  I'm obviously not the only one who has experienced this.  It is because it's a live broadcast and not a movie or TV show on your servers?  It's very frustrating and reflects poorly on your product.", "verified": true, "helpfulness": "0/0", "author": "Tucson Bob"}, {"rating": 4.0, "review": "works as advertised good price & almost as good as fire which I also use", "verified": true, "helpfulness": "0/0", "author": "george"}, {"rating": 5.0, "review": "The ability to sideload apps like Kodi.tv onto the fire stick make this a winner!", "verified": true, "helpfulness": "0/0", "author": "Troy"}, {"rating": 1.0, "review": "The description said when ordered directly that the stick would be pre-registered, but it did not, and we could never get it to log in, so had to return the Fire TV Stick. Very Disappointed.", "verified": true, "helpfulness": "0/0", "author": "Melissa Rivers"}, {"rating": 5.0, "review": "Very nice intuitive.", "verified": true, "helpfulness": "0/0", "author": "kip a taeschner"}, {"rating": 5.0, "review": "I had been considering a streaming stick for some time and while I didn't do a ton of research the research I did and the fact that I was already an Amazon prime user steered me to this product.  The other factors in my decision were the reviews, the lauded user interface and the available catalog of titles, services and apps.  I had some initial problems with setup (the instructions seem to be deliberately simplistic to emphasize the simplicity but I could have used more guidance.  I wanted to plug it into the my AV receiver [Denon AVR-591] and couldn't get the setup screen to appear after many cyclings thru my HDMI ports and trying and retrying various ports.  It turned out to be user error as I had the HDMI ports setup incorrectly on the receiver so that's on me.  But I still feel it would have gone faster if there was better guidance given for setup (I wasn't sure what to expect and wasn't sure if was missing a step so flailed a bit more than necessary).  Additionally Amazon and Google searches were fruitless and the only info I could find seemed to suggest the stick was not supported for AV receiver connections which, if true, would be pretty annoying.On the plus side once I fixed the HDMI port configuration issue the setup was extremely easy and I was very pleased to see that the device was \"pre-registered\" to my account so I didn't have to fumble thru forms and passwords to get it up and going.  Overall I am extremely pleased now.Pros---------* Setup was easy and fast once I got past the initial hurdle.* The interface is truly a delight.  Elegant, simple and intuitive.  I have Xfinity's X1 service and have been impressed with the work they did on that interface, but overall I'd rate the Fire Stick's interface superior.* Since I don't have experience with other streaming services I don't have a  point of reference but I am overwhelmed with the depth and breadth of streaming choices. If I retired tomorrow and spent the rest of my years making viewing selections I am pretty sure I'd barely make a dent in the available list of stuff I'd enjoy watching.  Also nice that there are quite a few choices here that seem to be exclusive to Amazon offerings.* Even with a short time using the services the recommendations algorithm is clearly better than what X1 offers (for example X1 still recommends reality programming to me, even thought I've never - and likely never will - watched reality programming).Cons---------* It's nice that the setup is so simple that it only requires a few numbered steps, but every situation is unique and there should be more in depth instructions readily available if you get stuck like I did.* But here is the biggest negative of all: when I first tried navigating the menus and streaming content it was constantly dropping the WiFi signal and or buffering or just refusing to play.  I have the best residential broadband service Comcast offers \"Extreme 150\" and a top of the line WiFi router that is only a hallway away from the TV, I frequently stream HBO Go and Showtime Anytime to my iPad in the same location without any issues whatsoever.  But with the Fire Stick I was only able to get acceptable performance late at night (I even turned off all other devices that might be sucking bandwidth with no improvement).  I decided to buy a WiFi extender for the living room and that seems to have solved the problem but that should not have been needed and I can't understand why this is the only device I have that wouldn't work in that location (laptop, smartphone and iPad get superb bandwidth ratings in the same location).  It'd be nice if the Fire Stick offered a diagnostic/speedtest to help evaluate issues like this but I couldn't find anything of that nature.  I'd be interested to hear if others are encountering this issue but it was a huge negative for me and I almost returned it before trying the extender.  The extender was pretty cheap so I am not too upset about that but others might be as a forgiving if they run into this issue.* Although I like the UI I frequently find it unexpectedly returns to me the home menu instead of the location I had navigated to.  Can be frustrating when trying to browse deeper into the offerings ...* The remote is well designed and has only the required and desired functions but it is not backlit and it is very hard to see the buttons in low light.  I'd have liked some kind of lighting or even just more tactile cues to tell me which button I am on.Even with the bandwidth issue and the niggles with navigating with the remote I am happy with this purchase and would recommend this device to friends and family, hence the 5-star rating.", "verified": true, "helpfulness": "0/0", "author": "W. Gallinger \"UMustRememberthis\""}, {"rating": 5.0, "review": "Works very well and easy to carry when traveling. Nice gadget to have.", "verified": true, "helpfulness": "0/0", "author": "Simon Le Bond \"3000\""}]