[{"rating": 5.0, "review": "Great excellent shoes and movies great.  I have a chromecast but never used it once i.got the fire stick the fire stick is excellent.", "verified": true, "helpfulness": "0/0", "author": "Deborah Pickering"}, {"rating": 5.0, "review": "I would love it if I could get it to do any thing, haven't watched a movie yet!", "verified": true, "helpfulness": "0/0", "author": "Joan Covas"}, {"rating": 4.0, "review": "Awesome easy to use and plenty of apps plus a ton of shows can't go wrong for the price", "verified": true, "helpfulness": "0/0", "author": "Mkotz13"}, {"rating": 1.0, "review": "Buffering. Buffering. This is basically unusable on my TV. It tells me the internet speed is too low for it to work, but somehow my Chromecast, computer, iPad, and smartphone all seem to be able to manage. I'll see if I can send it back, but since I threw out the package, I won't hold my breath. Also, big thumbs down that it needs to be plugged in... I tried plugging the USB into the TV rather than the wall adapter, and it didn't work (my Chromecast does this just fine). Save your sanity-buy a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Ruth G."}, {"rating": 4.0, "review": "so far so good", "verified": true, "helpfulness": "0/0", "author": "bob h"}, {"rating": 2.0, "review": "I wish I would have bought a Chrome cast,  FIre TV stick doesn't do anything new  that my DVD player doesn't already do.  I wanted to hook my laptop on my TV without using a HDMI cable. My nephew\"s Chrome cast will do that  but my Fire TV stick will not.  Plus I can only get sound to work if I go straight from my TV  I'm hard of hearing and I have to use headphones from a receiver but it will do not work with the Fire TV stick .  I'll see if anyone I know wants this or I'll try and return it.  Then I'll do has my nephew and buy Chrome cast", "verified": true, "helpfulness": "0/1", "author": "LeonR"}, {"rating": 4.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Greg Vierley"}, {"rating": 5.0, "review": "Quick, easy setup. Using", "verified": true, "helpfulness": "0/0", "author": "Ruger's owner"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Gloria S."}, {"rating": 2.0, "review": "At the time I purchased the Fire TV stick in January it was advertised that it supported HBO Go and the Plex app, and that you would also be able to stream from your phone to the TV similar to how the Google Chromecast (which I also own) operates.  When it arrived today, I was disappointed to find out that HBO Go is not currently available (with a tentative date of Spring 2015 on the website) and the Plex app needs to be paid for ($4.99).  The streaming functionality is only available if you have an amazon fire or a fire phone.  Seriously, how can you compare the Fire TV stick to the chromecast if you cannot stream from any smart phone or device to the TV.  The advertising is deceptive. Now I basically have a stick that is no better than my smart tv and provides no extra benefit.  I can't stream from my computer to the TV using the native apps without having to shell out more money.  I am planning on returning the Fire TV and buying a Roku which may cost more but provides the functionality I want without deceiving me into buying it and upselling me.", "verified": true, "helpfulness": "0/1", "author": "Tam"}]