[{"rating": 3.0, "review": "Program is good!  Would like to have a fast forward and fast reverse feature since I watch TV late at night and occasionally doze off.  Would be nice to go back to last remembered spot easil;y", "verified": true, "helpfulness": "0/0", "author": "Philip B \"Philip Blomer\""}, {"rating": 1.0, "review": "You're better off buying a refurbished Xbox 360. Fire stick continuously loses connection. Good apps require subscriptions, very little is free.  I have also been on a loading screen for over an hour and there are no issues at all with my WiFi.", "verified": true, "helpfulness": "0/0", "author": "john geller"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "James S. Cribelar"}, {"rating": 5.0, "review": "A must for Amazon Prime users!  A simple, plug-and-play design makes this awesome!  We also have a Chromcast in our home, which is fine, but the fact that this devise is about the same price point AND comes with a remote is perfect!  Plus, we have access to all the free content with Amazon Prime.  Love love love this!!", "verified": true, "helpfulness": "0/0", "author": "kipper1128"}, {"rating": 4.0, "review": "satisfied :)", "verified": true, "helpfulness": "0/0", "author": "britni moore"}, {"rating": 1.0, "review": "This does not work with older TVs. Even though my Sony TV has an HDMI port, there is no audio or ability to view Netflix and Amazon prime videos. This was not mentioned anywhere on the Amazon site or in their support documentation but customer service told me the news. Just wasted a couple hours of my life trying to get it to work that could have been avoided.", "verified": true, "helpfulness": "0/0", "author": "Jc"}, {"rating": 1.0, "review": "Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Mila"}, {"rating": 3.0, "review": "Although certainly less than perfection, -a  low-cost way for viewing internet video on your TV.  Set up is easy and mostly works properly.Have two Fire Sticks, both of which work the same---Daily they will lock-up, providing a HOME not available message.  The fix is to briefly disconnect (unplug power cord) Fire Stick, then re-connect to solve problem.  Internet video viewed with Sony Blu-Ray DVD player on same network never has lock-up issues like Fire TV Stick.  Most apps work fine, a few others such as Wall Street J. not so good.", "verified": true, "helpfulness": "0/0", "author": "D W Flemming \"Don\""}, {"rating": 5.0, "review": "Really good and served my purpose", "verified": true, "helpfulness": "0/0", "author": "Sreenivasulu"}, {"rating": 5.0, "review": "Excellent love it!!!;", "verified": true, "helpfulness": "0/0", "author": "Christine Warren"}]