[{"rating": 4.0, "review": "This is really excellent. Easy to use and it is really helpful if you have Amazon prime.  It will get the fifth star when it has HBO go.", "verified": true, "helpfulness": "0/0", "author": "Gregg A. Bannett \"drgbannett\""}, {"rating": 1.0, "review": "Waited almost a month to receive this. Got it and the thing constantly buffers any video or show I try to watch. No issue with router connectivity as it is right next to my router. My 5 year old blue ray player streams better than this supposedly state of this art device.", "verified": true, "helpfulness": "0/0", "author": "MHuge8"}, {"rating": 4.0, "review": "Little trouble getting the account setup - they helped me it right and now it works great.", "verified": true, "helpfulness": "0/0", "author": "Flyingcarpet52"}, {"rating": 5.0, "review": "very easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Patty Zillins"}, {"rating": 5.0, "review": "I am a part of the over 70 age group and learning new electronic things is not on my favorites list.  My son thought I would enjoy the 'Stick' so I said I would try it, I could alwaays send it back.  it was incredulously easy to set up.  We have no problems with it.", "verified": true, "helpfulness": "0/0", "author": "Lynn Lewis"}, {"rating": 5.0, "review": "So far...so good!  Easy to set up, easy to use! If you're a prime member even better, lots of free content!", "verified": true, "helpfulness": "0/0", "author": "john del"}, {"rating": 3.0, "review": "It's ok. But could be better if I don't need my Amazon Account to consume a FREE app or any FREE service.It make sense purchase a \"$0.00\" FREE app and go thru the same process as buy an non FREE app, instead of just download it ?Do I have to see the entire video at the beginning when first install the Fire TV stick,Why the remote control can not skip that video and keep going with the installation ?The rest is ok, easy browsing, amazing remote control very clever.", "verified": true, "helpfulness": "0/0", "author": "Michel Quintana"}, {"rating": 5.0, "review": "I Love how you can unplug it and use it in a different tv. My kids used to have a huge bulky play station to use as a DVD player and now they have Netflix and amazon and no bulky gaming system hanging off their dresser.", "verified": true, "helpfulness": "0/0", "author": "kayleigh"}, {"rating": 4.0, "review": "I personally like Apple TV better. Just a better interface and the apps don't seem to freeze as much. They do offer the FoxSportstoGO App which is a huge plus for sports and soccer enthusiasts.", "verified": true, "helpfulness": "0/0", "author": "Chris M Calhoun"}, {"rating": 5.0, "review": "Meets or succeeds all expectations. Very easy to install, ordered from Amazon so the Stick was pre-registered to me. Works beautifully. My TV has only 2 HDMI ports- had to purchase a box with additional ports to hook up the Fire Stick, DVR, DVD and Surround sound system. Also needed 2 additional HDMI cables. When all was said and done, I'm thrilled to have the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Lee D."}]