[{"rating": 4.0, "review": "I really enjoy the speed of the Amazon Fire TV stick.  It is much faster than my Roku LT. I have a 42\" 2012 Samsung Plasma TV. The USB port on this TV was not powerful enough to run the Fire TV Stick despite it being powerful enough to run my Chromecast. A bit disappointed that I had to plug it into an outlet using the supplied power block (I like to keep all my wires hidden).  I discovered this issue while the Fire Stick was going through its initial updates/setup. It restarted itself repeatedly, maybe 15-20 times. I first thought it was part of the update process but soon realized it was due to insufficient USB power coming from the TV.  I also have a 27\" 2014 LED Toshiba TV.  This TV's USB DID provide sufficient power to run the Fire TV Stick. I am unsure what the Mah output are for these TVs.My wife and I use the Fire Stick solely for Netflix.  She prefers the Roku menu layout over the Fire. I believe it's a bit more straight forward on the Roku, plus the Fire is heavily designed for the Amazon Prime user which we are not.Final Take:  For the person who mainly only wants something for Netflix and also prefers a dedicated remote, I would highly recommend this product!  If you are OK with using your Android/iOS device as a remote I would go with the Chromecast which requires less power to operate and can sometimes be found at the Big Box stores for around $25. Hope this helps.", "verified": true, "helpfulness": "0/0", "author": "Brandon Rumker"}, {"rating": 4.0, "review": "Very cool product, it works well.  I like that it has more streaming options than my Google Chromecast, but the remote isn't nearly as effective.  I would prefer a better phone interface, like the Chromecast, but overall I am very satisfied with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Jimmy"}, {"rating": 5.0, "review": "WAY cool. Super easy way to watch all my favorite Prime movies! ALSO since my music is in there we can officially take our speaker out of the living room and put it in the bedroom - Amazon MP3 is my only source of music playing so this was super handy.The only thing I wish was different was that I had the option to filter by \"song\" on the music - I can't seem to find any of my Prime songs through the fire stick.", "verified": true, "helpfulness": "0/0", "author": "asunnysnowman"}, {"rating": 5.0, "review": "So far exceeds my expectations. It's fast, bright graphics, and easy-to-use.", "verified": true, "helpfulness": "0/0", "author": "Ford Smith \"Ford\""}, {"rating": 3.0, "review": "Has lots of choices and remote easy to use and app easy, you have to keep plugged into to power and that is not good, cumbersome and has to be close to electric outlet", "verified": true, "helpfulness": "0/0", "author": "mw"}, {"rating": 3.0, "review": "one downfall leading to this rating, the stick must be plugged into power from the wall.  It cannot utilize the power from the tv's usb port.  The reason I got this was to hide it behind the tv.  The need to plug in to the wall doesnt accomplish this for me.", "verified": true, "helpfulness": "0/0", "author": "David G."}, {"rating": 4.0, "review": "Works very well.  Excellent deal.", "verified": true, "helpfulness": "0/0", "author": "Eric Persinger"}, {"rating": 3.0, "review": "Decent nothing that would pull me away from my chromcast", "verified": false, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "Excellent product - would recommend to everyone...", "verified": true, "helpfulness": "0/0", "author": "sam"}, {"rating": 5.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "Cody Wulk"}]