[{"rating": 2.0, "review": "Allows user to PURCHASE movies, TV shows, games, etc. The device works as advertised and expected.  It is fairly easy to use, and pretty straight forward. Some TV sets have a similar technology built in.", "verified": true, "helpfulness": "0/0", "author": "S. Smith"}, {"rating": 5.0, "review": "So fast and so many options. Love it", "verified": true, "helpfulness": "0/0", "author": "Lee pate"}, {"rating": 5.0, "review": "Everything I expected. I hope more apps are added over time.", "verified": true, "helpfulness": "0/0", "author": "PFKitz \"handsomepete81\""}, {"rating": 5.0, "review": "If you're like me and just want to watch a show or a movie every now and then this is perfect.  No cable bill, no satellite bill.  No complaints at all, it's simple to set up and operate.", "verified": true, "helpfulness": "0/0", "author": "Jim cummings"}, {"rating": 5.0, "review": "Compact design (stick and remote) that function well. Easy to operate, smooth streaming, many program and app choices. Great price too. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 4.0, "review": "Convenient. Annoying to have to plug in.", "verified": true, "helpfulness": "0/0", "author": "Justin Mermelstein"}, {"rating": 5.0, "review": "Love this!!!", "verified": true, "helpfulness": "0/0", "author": "Lindsey D McCartney"}, {"rating": 5.0, "review": "Very easy to install and use.  Until this came along I was having to plug in my laptop each time I wanted to access Amazon, Netflix etc. This has simplified everything.", "verified": true, "helpfulness": "0/0", "author": "Dama"}, {"rating": 3.0, "review": "I'm a little frustrated because it keeps losing Wifi connection, but the website has suggested using the included extension cable, so I will try that.", "verified": true, "helpfulness": "1/1", "author": "Hari Lupin \"Hari\""}, {"rating": 5.0, "review": "Easy to install and works very well. I'm enjoying being able to view my Netflix movies and tv on my tv now.", "verified": true, "helpfulness": "0/0", "author": "Gigi1231"}]