[{"rating": 2.0, "review": "Is no web browser included", "verified": true, "helpfulness": "0/0", "author": "Jorge Papa"}, {"rating": 2.0, "review": "If you had asked me a few months ago, I would have given this 4 stars.  It had a slightly laggy interface, but it streamed well; however, that recently changed and I have to knock it down.I recently moved and switched Internet Service Providers.  I hadn't set up my computer yet and was strictly using the internet for my Fire Stick while I waited for them to fix my cable. A long story, a whole lot of phone calls to my ISP, and several days later, my Fire Stick was constantly buffering, dropping internet signal. It was a general nightmare. The buffering was so bad I couldn't watch anything (one hour to watch one episode of a 20 min sit com is unacceptable).  Since I work from home, I was terrified as to what was going to happen when I started work.Well, imagine my surprise when I was able to flawlessly work all day, while streaming Netflix on my laptop with zero issues.  Nothing dropped, nothing buffered. Quality was perfect.  I went back to my Fire Stick and the buffering nightmare returned.  It finally dawned on me that, despite the fact that I had never had these problems before, the issue might be with the Fire Stick.I dug out the Roku 2 and hooked it up and the problem was instantly solved.  The extra fun part is I moved the Fire Stick to the other television, far away from the modem, and it seems to work there fine, without all the buffering nonsense.So, my non-technically educated guess is the Fire Stick doesn't like the \"noise\" from my new ISP's modem (they were about 2 feet apart).  My prior ISP was FIOS and my new one is cable.  This is the only explanation I can come up with to explain why I never experienced any issues until I switched providers.  To me, that is a very serious design flaw because it obviously doesn't affect the Roku.Given this particular flaw drastically limits where you can place a Fire Stick, I can't rate this higher than 2 stars.  If I didn't have a second television, the Fire Stick would have been rendered completely unusable because of this issue.  I'm also glad I figured this out before I called my ISP again.  I wasted several hours on the phone with them over what turned out not to be their fault.Tl;DR - going back to my Roku.", "verified": true, "helpfulness": "0/0", "author": "StarlaC"}, {"rating": 2.0, "review": "If I could return it, I would, but I've had it 4 months, so I think it's too late. It takes hits where my Vizio tv hiccups, like an interrupted signal. It buffers too much on a 50Mbps internet connection. Recently, when I would scroll down one program choice, it would auto-scroll through the entire list. I needed a factory reset to clear that problem, which meant I had to redo all of my preference customizations. It runs very hot, which might be the cause of my problems. If you research this product, it appears they have quality control issues. You might get lucky and yours performs normally.", "verified": true, "helpfulness": "0/0", "author": "Gianni"}, {"rating": 1.0, "review": "It sucked you have to pay for everything it not what you say it is", "verified": false, "helpfulness": "0/1", "author": "kingwillie"}, {"rating": 5.0, "review": "Better than I had hoped for. It turns any tv into a smart TV. It is amazing. Highly recommend it!!!", "verified": true, "helpfulness": "0/0", "author": "Allie French"}, {"rating": 5.0, "review": "My fore stick is amazing! It works very well and I like that I don't see it!", "verified": true, "helpfulness": "0/0", "author": "Scott tucker"}, {"rating": 3.0, "review": "Great product by the interface could be improved.  You really can't customize it yourself.  If you watch a lot of one app it'll automatically put in Home directly.  It's really responsive but the interface could freeze for a sec but there's no freezing when actually playing a movie.  I noticed unlike my Roku 3 Netflix will take about 15-20 seconds when you first play to go to HD.  These two issues can be overclock when you consider how cheap the price is.  I would get this over the regular Amazon Fire or Roku 3 because of the price.  I was able to get over any small issues with it.  With new firmware coming out it can only improve it.David", "verified": true, "helpfulness": "0/0", "author": "davidst95"}, {"rating": 5.0, "review": "Incredible value. Amazon is the new Apple, cool and functional!", "verified": true, "helpfulness": "0/0", "author": "Jamie Yezarski"}, {"rating": 5.0, "review": "the firestick is amazing it works flawlessly and took barely any time to set up! i love it!", "verified": true, "helpfulness": "0/0", "author": "Betsy Case-Luca"}, {"rating": 5.0, "review": "Works great! :)", "verified": true, "helpfulness": "0/0", "author": "Holly Byrnes"}]