[{"rating": 5.0, "review": "I really have enjoyed the Fire TV Stick. It works well with Plex and is very fast. I have WDTV's, Roku's etc. I have disconnected my Roku's for Fire TV SticksI just wish they would come up with something that works for everything. Unfortunately, that is not the case even with the Fire TV.  But all in all it works well and works perfectly with Prime for streaming. Doesn't stutter like some of the other ones. Works with Hulu, Netflix etc as well. Time Warner's app isn't available at this point, but it pretty well sucks anyway so no big loss.", "verified": true, "helpfulness": "0/0", "author": "John Q Public"}, {"rating": 4.0, "review": "Great size. Misleading picture though, needs plugging in at all times to a power source as well as TV. Great for traveling though", "verified": true, "helpfulness": "0/0", "author": "Darren D \"Darren D\""}, {"rating": 3.0, "review": "I bought the fire stick at the discounted prime member deal. Plugged it in and setup - all straight forward and easy. Runs fine and switches apps fairly quick. Some of my issues - 1. I get a weird studdering noise (sort of like a feedback noise) when I pause playback, during buffering and loading of next episodes and occasionally when loading the home screen. 2. I wish there was a way to narrow down video or search to limit to prime available titles. 3. I hope the plex app gets an update (not an issue with the stick - just a side note)Other than these few things I have no complaints. I believe this will replace my apple tv as my main streaming device (as least until (if) apple gets a native Prime app)", "verified": true, "helpfulness": "0/0", "author": "joshriley2000"}, {"rating": 5.0, "review": "Love it!!!  I know can see my faves shows. Thank you whoever came up with the idea should get a big bonus.", "verified": true, "helpfulness": "0/0", "author": "M. Zuniga \"It's Just ME!\""}, {"rating": 5.0, "review": "The best content and the best apps, plus Amazon Prime instant video all at the push of a button!", "verified": true, "helpfulness": "0/0", "author": "Michael J Brownewell"}, {"rating": 5.0, "review": "Great buy", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 4.0, "review": "Great. Works well for everything. Good quality. I wish I didn't have to pay for plex. And I wish it had hbo go", "verified": true, "helpfulness": "0/0", "author": "adam zerby"}, {"rating": 4.0, "review": "works great, easy to set up especially with the phone app.", "verified": true, "helpfulness": "0/0", "author": "toon"}, {"rating": 4.0, "review": "Love this! It skips a little but not too badly and I'm not sure if that is due to the fire stick or because my internet. This meets my expectations for $25 and then some!", "verified": true, "helpfulness": "0/0", "author": "manatee"}, {"rating": 5.0, "review": "Love it easy to use awesome  features", "verified": true, "helpfulness": "0/0", "author": "dominick l fountain"}]