[{"rating": 5.0, "review": "Lots of programs to see on it!", "verified": true, "helpfulness": "0/0", "author": "BDDDS"}, {"rating": 5.0, "review": "Easy to set up and started to use within minutes.", "verified": true, "helpfulness": "0/0", "author": "Mark Jaeger"}, {"rating": 5.0, "review": "How ironic.  This is arguably the most popular device on Amazon that I've reviewed and it'll get the shortest review from me.I love it.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 4.0, "review": "I am enjoying our fire stick, but it does have some issues. At first I believed it was the Netflix app only, but I have issues with Hulu and YouTube. So far no issues with the Amazon shows and movies, but I have not used those as much as the other apps. Netflix continues to pause every few minutes sometimes, while other times I can watch for hours without a problem. I have had it completely crash twice - turning to a purple lined staticky screen, and had to reset the device. I did reinstall Netflix after a suggestion from the help forum but that has not fixed the issue. Lately Hulu has been randomly pausing as well, though no complete crashes. Netflix turned completely purple on me yesterday over the entire screen, but I could still hear voices talking. I had to turn the device off and restart it to fix it. I have purchased an extended (6') HDMI extender cable that I'm hoping will fix the issues if they are wifi related, but I'm not convinced that wifi signal is causing all of the crashing.In general though, when this is working, it's MUCH faster than my Smart TV downstairs. Navigation is easy and I like that it's very easy to sync all your Hulu, Netflix, etc accounts. The Youtube app is also much better than the one on my Smart TV. Very easy to scroll through your subscriptions. If it weren't always crashing I would absolutely give this 5 stars.", "verified": true, "helpfulness": "0/0", "author": "MWhittaker"}, {"rating": 5.0, "review": "It works great.  I get no jitter or issues over the WiFi, and the picture quality is excellent.  The remote works great and is easy to navigate around the screens.", "verified": true, "helpfulness": "0/0", "author": "Thomas Downey"}, {"rating": 4.0, "review": "I am so very pleased to not have to get up to tap the tablet to prevent it from going to sleep so whatever I'm watching doesn't get timed out. There is a lagging issue at times and the constant updates but this is a really good buy for me since I love binge watching everything.", "verified": true, "helpfulness": "0/0", "author": "Ty Walker"}, {"rating": 5.0, "review": "Does what they say it does. Nifty and convenient.", "verified": true, "helpfulness": "0/0", "author": "Phillip L."}, {"rating": 5.0, "review": "As promised, it's very easy to set up. I am so pleased with my results (it was my first time setting up anything electronic) that I have bragging rights with all my friends!  I was enjoying my shows within 10 minutes!  Along with my kindle fire these are the best products I have ever seen.  Thank you for having my best interests in mind!", "verified": true, "helpfulness": "0/0", "author": "Orysmom"}, {"rating": 5.0, "review": "Absolutely love the Fire Stick! It's really easy to use and the kids love that they can play the games on the television when the grownups have the TV with the Playstation in use.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Amy F\""}, {"rating": 5.0, "review": "Love it! Low price, easy to get up and running, easy to use, and works just fine!", "verified": true, "helpfulness": "0/0", "author": "BENZEEL \"Ben\""}]