[{"rating": 5.0, "review": "Easy installation. Remote control easy to use. Much better than streaming thru video game box. Great purchase at a good price.", "verified": true, "helpfulness": "0/0", "author": "Mashie"}, {"rating": 3.0, "review": "This fire stick is better than the competition  especially if  the tv doesn't have apps  Like  the smart TV by. Philips the remote is great.,set up is easy.  Also become an Amazon prime member it is worth it.  You don't have to but it's worth it.", "verified": true, "helpfulness": "0/0", "author": "k"}, {"rating": 5.0, "review": "It works great", "verified": true, "helpfulness": "0/0", "author": "John Ventura"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Fawziyyah Muhammad"}, {"rating": 4.0, "review": "Love it, but just days after I bought it I saw a prime members-only sale on it! :/ Just my luck, I had been waiting to buy this, and once I finally did, it went on sale immediately afterward. Otherwise, very happy with my purchase-it solved my problem without having to spend too much money. I do wish it had a web browser, and the miracast/screen mirroring does not work well AT ALL (which I am hoping they will be updating to fix it soon or something), but other than that, I am generally satisfied with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "LanneyG"}, {"rating": 5.0, "review": "I love it! I get everything I want.", "verified": true, "helpfulness": "0/0", "author": "Tina Vest"}, {"rating": 5.0, "review": "Delivered in a timely manner. Easy to hook up. Performs to my expectations.", "verified": true, "helpfulness": "0/0", "author": "Ray McWherter"}, {"rating": 3.0, "review": "Its great when it works! A lot of connectivity problems due mainly I think to design flaws. Use the hdmi extender cable for best signal performance", "verified": true, "helpfulness": "0/0", "author": "candice hubbard"}, {"rating": 5.0, "review": "pretty cool device!!! my son has it figured out, and i'm sure i will get in the groove with it sad well.  may e dump our television hookup.", "verified": true, "helpfulness": "0/0", "author": "Charles Henderson"}, {"rating": 5.0, "review": "Does what it says. Makes entertainment  accessible and easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "SilverSurfer74"}]