[{"rating": 2.0, "review": "The interface and app selection are great. Unfortunately, it just doesn't work. I have constant connectivity issues and have confirmed it's not my network. I have also followed the troubleshooting guidelines and that didnt work either. I have no problems with my google chrome and my apple tv. My mom has the Amazon fire tv box version and that works well so I think the issues are specific to the stick.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I do enjoy the Fire Stick, I also have a Chromecast, but decided to try Fire Stick because of the remote option. I got tired of having to get my phone or tablet to rewind or do anything with the chromecast. I still love the chromecast though.  This does what it is suppose too and is very speedy as well.  I'm just waiting for some streaming apps it's lacking at the moment, such as HBO Go, but I hear it will be present in the future.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 5.0, "review": "LOVE LOVE LOVE my firestick. Dont know what I have done without it all this time !!!", "verified": true, "helpfulness": "0/0", "author": "fla girl"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "spring"}, {"rating": 4.0, "review": "Quick, Cheap, worth it! only downside was that i was an invitee to a Prime membership, in order to be able to view all of Amazon movies and shows you must have a full prime membership, not just an invitee.", "verified": true, "helpfulness": "0/0", "author": "jraborg86"}, {"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/0", "author": "dan s."}, {"rating": 4.0, "review": "Needs a longer cable, but otherwise this is amazing!", "verified": true, "helpfulness": "1/1", "author": "Pamelamela"}, {"rating": 4.0, "review": "Love having this Fire TV Stick on my TV.  I can do the same thing with my Kindle, but I have to have a cord attached to my Kindle.  Good bye cord.", "verified": false, "helpfulness": "0/0", "author": "pp1951"}, {"rating": 1.0, "review": "I rarely vent about anything, but regarding the Fire TV Stick, I'm going to make an exception.  I'm trying to use it right now and the message I'm getting is \"loading Prime Video…\" and it's been loading for awhile now.  I consistently get other messages such as \"check Internet connection\", or it's stuck in la-la land and does absolutely nothing.  For all of you that always have an reason/excuse as to why I'm having problems I have a Roku that works off of the internet as well.  I can turn my Fire Stick off and use my Roku and the Roku works, I have a laptop, the internet works.  I've tried turning everything off and the Fire Stick continues with whatever message its spewing at the time.I can honestly say that I'm completely disappointed in the Fire TV Stick; and regret that I paid for it with my hard-earned money.  I hope everyone else has better luck than I did.", "verified": true, "helpfulness": "2/2", "author": "Vivian Peña"}, {"rating": 4.0, "review": "Works great! Just not exactly what I thought I it would do. My fault for not researching it better. I thought it would allow to put what ever I wanted on the screen from my laptop like my Google Chrome device I have on our bedroom TV. However it works quite well and  allows me to play all of the Amazon Prime content on the TV with out using the computer to play it.", "verified": true, "helpfulness": "0/0", "author": "ceh300"}]