[{"rating": 5.0, "review": "Works a lot better than ROKO.  I like this 100% better easy to use", "verified": true, "helpfulness": "0/0", "author": "Gale L. Ewell"}, {"rating": 4.0, "review": "I like the fire stick,fast and easy to hookup. The only thing I don't like is you can't customize your own home screen.This update would be a big impact on more sales and would be easier to navagate. Thanks", "verified": true, "helpfulness": "0/0", "author": "J. Swift"}, {"rating": 5.0, "review": "Love it! Easy to set up and easy to use. I love the phone remote app!", "verified": true, "helpfulness": "0/0", "author": "Joan"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "G. Gray \"wbupload\""}, {"rating": 4.0, "review": "Overall a great device for the price.  However, a lot of popular apps crash on occasion, and frequent reboots are necessary", "verified": true, "helpfulness": "0/0", "author": "Krasi"}, {"rating": 5.0, "review": "When chromecast was launched, I thought having no remote was a terrific idea. But I was so wrong, and I want to earn forgiveness by endorsing Fire Stick TV. You don't have to unlock your phone to use this. It has a separate remote.", "verified": true, "helpfulness": "0/0", "author": "Enrico Nadres"}, {"rating": 5.0, "review": "The fire stick is pretty awesome. Easy to use and there is so much you can do with it", "verified": true, "helpfulness": "0/0", "author": "Jennifer Kenney"}, {"rating": 5.0, "review": "Love the Fire stick!", "verified": true, "helpfulness": "0/0", "author": "Susan Teasley"}, {"rating": 5.0, "review": "Love the Fire Stick.  Small and so easy to use.  Easy to install.  Only complaint is that the HDMI  will not connect on the new Samsung TV I bought through Amazon in December.  It may be the fault of the TV because it works on my old Samsung TV connections.  I love the fact that the Stick is portable.  Great idea Amazon!", "verified": true, "helpfulness": "0/0", "author": "Sondra Worden"}, {"rating": 5.0, "review": "The Fire Stick works great.  Only thing is I thought it went into the USB port on the TV, but it goes into the HDMI port.  I have to unplug my cable box and plug in the Fire Stick.  But that is a minor inconvenience.  I have been able to watch movies and TV shows on both Amazon Prime and NETFLIX.", "verified": true, "helpfulness": "0/0", "author": "Mary E. Harlow \"Beach\""}]