[{"rating": 5.0, "review": "I would recommend this to anyone who travels year round as I do. Small but full of options", "verified": true, "helpfulness": "1/1", "author": "Will Johnson"}, {"rating": 2.0, "review": "The Fire TV Stick is a nice product, but it  doesn't even get close to ROKU or Chromecast. First the number of actual usable Video applications is pitiful compared to Roku.  The Fire Stick interface is way too much about Prime and Amazon Instant Video and other apps like Netflix take a back seat. The arrangement of apps is terrible. Where you should at least be able to arrange applications in some order you really have no choice games, TV, Movies, New and Internet applications are all clumped in one big mess with no usable ability to arrange them as you like. Seriously Amazon, the user interface needs to be a less Amazon and a little more fair and balanced. I expect Amazon could fix all this will a software upgrade and I would strongly suggest they get with it.With that said the big plus is the Fire TV Stick has much more memory and pretty much starts playing instantly.If Amazon would fix the interface so that your apps are organizable and all apps were on an equal footing with Amazon product this would be a pretty darn great product. As it is you feel like you spent your money on a product designed to promote Amazon product over anything and everything else.", "verified": true, "helpfulness": "0/0", "author": "Bubba \"Bubba\""}, {"rating": 5.0, "review": "Easy to use and had a great amount of apps. Just plug in and go :-) we plan to order anothe one for our family room.", "verified": true, "helpfulness": "1/1", "author": "Nicole Curry"}, {"rating": 5.0, "review": "Great product !", "verified": true, "helpfulness": "1/1", "author": "lulu"}, {"rating": 5.0, "review": "Hooked it up, very easy, and did the setup stuff.  The only complaint is you need to a member of most of the programs, NetFlick, as an example.  Do love that there is one screen I can see all the available apps in one place. Buy one and see what I mean.....", "verified": true, "helpfulness": "0/0", "author": "D. Gavey"}, {"rating": 2.0, "review": "Ordered the Fire TV Stick before it was released at the Prime Membership price. Originally on back order until Xmas, was pleasantly surprised to receive it two weeks sooner.We have been using the Fire Stick for three says now as our primary method of TV watching for Netflix, etcetera. Each day, we are booted off of the program due to internet connection issues. We often have to restart the Fire Stick 2-3 times before it will work again. This is frustrating as there are no known other issues with our home internet service. Overall a good product but seems that Amazon still needs to fix some bugs with it.", "verified": true, "helpfulness": "0/0", "author": "Angie L"}, {"rating": 5.0, "review": "I've only used it a few times, but so far so good.  The interface was peppy, streaming worked well, it had no problems with my wifi.  I downloaded and used the android app, and that worked as expected too.  If you want an inexpensive streaming device you can easily carry in your overnight bad, this is a compelling consideration.", "verified": true, "helpfulness": "0/0", "author": "G. Miller"}, {"rating": 5.0, "review": "Its awesome", "verified": true, "helpfulness": "0/0", "author": "marco"}, {"rating": 3.0, "review": "Overall this is a very good device. The performance is excellent and the quality of the picture is great. The reason for the three stars is because of the wifi reception. It turns out that because the wifi signal is coming from the direction behind the tv, it had problems streaming video. After adding an HDMI extension cable, so that the fire stick was in front of the tv, everything work great. I could of purchased the fire tv if I had to place it in front of the tv; therefore, I did, and I give the fire tv five stars.", "verified": true, "helpfulness": "0/0", "author": "etm"}, {"rating": 5.0, "review": "It's sweet! Cool that you don't have to point the remote at the tv or the source lol", "verified": true, "helpfulness": "0/0", "author": "MJ"}]