[{"rating": 4.0, "review": "So far I really like the programming that is made available with the Fire Stick.  My main issues (and why I rated it a four star) is in two things.  First, I really wish the power cable would mount in the end vice the side of the unit, this design forces me to use the extension.  Second, would be he big issue I have with the Firs Stick taking over my TV when I turn it on.  I have a Harmony One remote that sets my TV to the correct input (HDMI2 for example), as soon as the Stick powers up the TV jumps to its input.  If there is a way for me to stop this I would love to hear it.", "verified": true, "helpfulness": "1/1", "author": "Scott M. Aldridge"}, {"rating": 4.0, "review": "It is an easy to use logical addition to our family due to the volume of prime videos we stream. It is easy to install and move from TV to TV. We even take it on the road when we travel.", "verified": true, "helpfulness": "0/0", "author": "Shelby Balser"}, {"rating": 1.0, "review": "I must have gotten a lemon. Didn't work at all. Flashed green noise onto the screen, couldn't stream high def even though it was 6 feet from my router.", "verified": true, "helpfulness": "1/2", "author": "Ghezbora"}, {"rating": 4.0, "review": "As an early adopter, I expected a few bugs, and got them. The device occasionally plays sound from an unknown place (not from the currently watched show). It also has a bug where a Amazon playlist of ~25 songs shows you're listening to \"Song 0/0\", so you have to constantly manually play the next song. It will also occasionally freeze completely (tho this is pretty rare). All of these glitches are resolved with a device reboot. I suspect future software updates will continue to refine the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Gary R."}, {"rating": 5.0, "review": "Easy to use and all of what it was described as.", "verified": true, "helpfulness": "0/0", "author": "Aziz Hussin"}, {"rating": 1.0, "review": "We have Apple TV, Roku, and now the fire stick. We were initially excited about this low cost solution for streaming on our third t.v. Unfortunately, it's been almost unusable. While it was very easy to set up, it was also very unpredictable in use. We thought at first it was the distance from the router that was the problem, but our apple t.v. Worked perfectly in the same location.", "verified": true, "helpfulness": "1/2", "author": "W Terry Fritsch"}, {"rating": 5.0, "review": "Amazon has delivered an exceptional product. I'm very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "behealthy"}, {"rating": 5.0, "review": "I was able to purchase this item at half price for $20 dollars. I am as pleased with it as i am with the much more expensive ROKU in the living room.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great but if you are looking to play Showtime Anytime and have Xfinity Comcast or Dish Network you're going to have to wait until they are supported", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "Easy to use. Fast set up. Love it!", "verified": true, "helpfulness": "0/0", "author": "RASHELLE RIECKMANN"}]