[{"rating": 5.0, "review": "worked great right out of the box. Setup was easy and fast", "verified": true, "helpfulness": "0/0", "author": "MikeJ \"oldno7\""}, {"rating": 5.0, "review": "Was easy to install.and works just like advertised.I was watching a movie right away.", "verified": true, "helpfulness": "0/0", "author": "rene segura"}, {"rating": 3.0, "review": "Works great. But not really that much free tv shows and movies", "verified": true, "helpfulness": "0/0", "author": "Tim lepley"}, {"rating": 4.0, "review": "Very simple to install, but is not useable. Constantly freezes and goes blank. Must hit the enter button 3 times to unfreeze. This happens about every every 2-3 minutes and sometimes more often. I am trying a few workarounds, so far nothing has worked, will probably return it.Update: I am changing the rating to 4 stars after finding out that the supplied HDMI adaptor was defective. After removing the adaptor and directly plugging the Firestick into the  HDMI port, everything works as it should.", "verified": true, "helpfulness": "1/1", "author": "John Annan"}, {"rating": 5.0, "review": "The fire stick allows me to watch my favorite shows and movies on my big screen instead of having to watch on my small Mac screen. Love it!", "verified": true, "helpfulness": "0/0", "author": "Noelle"}, {"rating": 5.0, "review": "I love my Fire TV Stick! Easy to set up. Easy to use. The price is right.", "verified": true, "helpfulness": "0/0", "author": "Abby Chase"}, {"rating": 4.0, "review": "Much easier set up than the Chromecast stick.", "verified": true, "helpfulness": "0/0", "author": "mjn"}, {"rating": 5.0, "review": "Very simple setup and to use.  Excellent Wi-Fi reception and simple to utilize.", "verified": true, "helpfulness": "0/0", "author": "Michael H"}, {"rating": 5.0, "review": "Easy to setup and to use.  Still trying to discover all the content.", "verified": true, "helpfulness": "0/0", "author": "Ceasar A"}, {"rating": 5.0, "review": "A bit time consuming to set up other then that works great so far", "verified": true, "helpfulness": "0/0", "author": "janet"}]