[{"rating": 2.0, "review": "Uh...not really what I thought it was going to be.  I don't get any more features than I already get with my TV package.  I was hoping this would unlock some content such as Showtime or specific shows, but it didn't.  And some of the content you still have to pay for even though I'm a Prime member.  My smart TV came with an Amazon \"App\" and it does just as much, without paying money for the Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "Lee Nicol"}, {"rating": 5.0, "review": "It's a great device!!!!", "verified": true, "helpfulness": "0/1", "author": "leobaldo"}, {"rating": 3.0, "review": "Overall, I'm a big fan of the speed and capability. Only thing I hate and that really detracts from the experience is that you cannot cast from non-Amazon computer devices. Really puts it behind ChromeCast from my experience.", "verified": true, "helpfulness": "0/1", "author": "Daniella Corcuera"}, {"rating": 5.0, "review": "I used chromecast and apple tv and by far the best out the three. Easy navigation. and a lot of apps can be added.HEADS UP IF YOU TIE YOU PRIME/AMAZON ACCOUNT TO DEVICE BE CAREFUL NOT ALL TV SHOWS ARE FREE!!!! I LIVE WITH MORONS... Love them thou", "verified": true, "helpfulness": "0/1", "author": "Gerald"}, {"rating": 5.0, "review": "I love this thing!! You can take it anywhere as long as there is wifi and a tv with the right connections!!", "verified": true, "helpfulness": "0/1", "author": "Chantel"}, {"rating": 5.0, "review": "Love it.  Works great! I will be buying the Fire Stick TV next.", "verified": true, "helpfulness": "0/1", "author": "Barbara McCrae"}, {"rating": 5.0, "review": "LOVE LOVE LOVE!!!!!!!!! I have a TON of VHS that I was trying to replace with DVD. Well, with the fire stick and Netflix, I don't have to replace all of them. Great item!!! GET IT!!!", "verified": true, "helpfulness": "0/1", "author": "Danyelle"}, {"rating": 5.0, "review": "Love this!! It was so easy to set up and use.  I can add so many different products to view tv shows, movies, music videos and even game apps.  My daughter is 7 and she loves it as well.", "verified": true, "helpfulness": "0/1", "author": "veronica0514"}, {"rating": 2.0, "review": "I don't get a really good signal.  It jumps in and out.  My router is a good one too.  So I am not really sure what the issue is.  However, the few times it works it looks good.", "verified": true, "helpfulness": "0/1", "author": "Femi Jones"}, {"rating": 5.0, "review": "best little gadget I ever connected to the Panasonic TV I bought from Amazon....", "verified": true, "helpfulness": "0/1", "author": "Bill Gibson"}]