[{"rating": 5.0, "review": "Really awesome.", "verified": true, "helpfulness": "0/0", "author": "penny wal"}, {"rating": 5.0, "review": "This works great and was super easy to get started.  I am not a tech guy but I had this up and running in minutes.", "verified": true, "helpfulness": "0/0", "author": "wardicus"}, {"rating": 4.0, "review": "I didn't know what to expect from this device but it has proven to be a useful addition to our TV viewing. Our young son figured out all on his own how to synch our Kindle to broadcast to the TV set.I do wish it had more parental controls. TV shows just \"autoplay\" and start the next episode of whatever you're watching. If you're not careful Junior will get sucked into a TV marathon.I found the Music feature more useful than I expected. I can put on a playlist while working around the house without having to jump around to another device or a web browser to launch Pandora or Spotify.The Fire Stick was dead simple to set up and I had no WiFi issues or anything at all, it just worked. (It was much harder to get a game console to connect to my WiFi, for example.)", "verified": true, "helpfulness": "0/0", "author": "Wakka"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick brings amazing life to our TV viewing.  It enables us to watch programming that was inaccessible to us before.  We are happy with the shows we are able to view especially Bosch which is an excellent Amazon series.  There are an amazing number of movies available.", "verified": true, "helpfulness": "0/0", "author": "Patricia DeFrancesco"}, {"rating": 5.0, "review": "Easy to set up.  My 82 year old grandma did it!", "verified": true, "helpfulness": "0/0", "author": "D. Dawson"}, {"rating": 5.0, "review": "GREAT ITEM!!! I can't live without my Fire TV Stick. Crisp and clear HD videos and audio at your finger tips. You have to buy this item. I told all my friends and family about my FTS!!!", "verified": true, "helpfulness": "0/0", "author": "Edwin Vargas"}, {"rating": 5.0, "review": "The  Fire TV Stick is easy to install and works great. As usual, Amazon support and documentation is excellent.Total plug and play", "verified": true, "helpfulness": "0/0", "author": "Sandra Kaplan"}, {"rating": 5.0, "review": "I love this thing. Better than netflix", "verified": true, "helpfulness": "0/0", "author": "wizzard"}, {"rating": 5.0, "review": "Great value for the money. Did what I needed plus some.", "verified": true, "helpfulness": "0/0", "author": "Jayne Beach"}, {"rating": 5.0, "review": "Excellent product.  Bought for two tv's.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Paula Peace \"Peace, Paula\""}]