[{"rating": 3.0, "review": "While I'm very happy to have access to Prime Video and other services (like NetFlix) to which I subscribe, the inability to log on to WiFi behind a \"captive portal\" (eg, one that requires acknowledgement of terms-of-service or one that requires input like a username and password) makes its use as a portable device limited (eg, for use in a hotel room). I've also noticed that, while the specs tout higher performance than competing \"stick streamers\", the Fire Stick has far more issues with low bandwidth/high latency connections (eg, hotel WiFi) than the competition. Ultimately, the experience with the product has been less satisfying than using my Chromecast--especially because I can stream media on my own devices (laptop, NAS) to Chromecast, bypassing the performance of the local Internet connection.", "verified": true, "helpfulness": "0/0", "author": "J. Millard"}, {"rating": 4.0, "review": "It is a little dificult to navigate and it freezes up sometimes and I have to restart it. It would be nice to separate what is included with prime and what I have to pay extra for. This device offers more than my chromecast but the simplicity of chromecast keeps it relevant in this competition. One more thing, the cable channel apps (ie. A&E;, history channel)  do not work without a cable subscription so don't expect this to replace your cable tv, although the hulu and sling apps do offer some programing they can get just as expensive. So really a fun toy and worth the 40 bucks but a little disappointed about the complex user interface and cable apps not working without cable.", "verified": true, "helpfulness": "0/0", "author": "John F. Barton"}, {"rating": 5.0, "review": "Had Roku, bought this on a whim.. glad I did... much better, faster UI, not to mention the games!", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "This is a great streaming device. I bought this device since it had great reviews and it was reasonably price. I used to have to use my Wii to stream Netflix and my computer to stream movies on Amazon Prime. Now, it's all right there in one and the remote makes it easy to scroll through the options. The setup is very easy and I love how easy it is to move from TV to TV. This is so small and portable and would be really easy to travel with if you needed to. It just plugs into the TV's HDMI port and into the wall. I like how you can also get all kinds of different apps on there, such as YouTube and Pandora. My kids also love that they can play games on it. Great device!", "verified": true, "helpfulness": "0/0", "author": "Rachel Norgaard"}, {"rating": 2.0, "review": "The tutorial is annoying and you can not skip it. It is easy to use even if no tutorial. As far as using amazon prime it is great. However it doesn't have capability to use the apps I wanted. I should have went with Google chromcast it had all the apps I would use like HBO go and crunchy roll. Had to spend more money buying an app to make it airplay from my device and it does the job.", "verified": true, "helpfulness": "0/0", "author": "Adrienne Gutierrez"}, {"rating": 2.0, "review": "Would be better if it could detect and connect to networks which require you to open a browser and log in to the network that way as is often found in hotels.  I bought this for using Netflix etc on hotel televisions so I didn't have to carry stuff to stream to the television from my laptop.  It wouldn't connect to the network though so it was pretty well useless for what I wanted to use it for. Maybe future updates will allow it to recognize and properly connect to the internet when that type of security is used on the network.", "verified": true, "helpfulness": "0/0", "author": "jeffrey clapp"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Joff"}, {"rating": 5.0, "review": "I love Fire TV Stick!Good work Amazon!!", "verified": true, "helpfulness": "0/0", "author": "damian"}, {"rating": 3.0, "review": "Disappointed that my parents cant use the voice remote to watch Netflix without paying extra.  I thought my parents would have an option easier than hunt and peck.", "verified": true, "helpfulness": "0/0", "author": "yvette king"}, {"rating": 5.0, "review": "It's so nice to view movies on the larger screen.", "verified": true, "helpfulness": "0/0", "author": "diana burfield"}]