[{"rating": 4.0, "review": "As an Amazon Prime member, I got an offer for early access to the new Amazon Fire TV “stick”, which is a small device which plug into an HDMI port on your HDTV. Since I’ve never been happy about my Apple TV, I decided it was worth a try.Here’s my experience.Unboxing was nice. Simple, clean packaging. Couple devices, cable, batteries.The Fire TV device doesn’t get power via HDMI, so it requires an external cable. The cabling is too short, and connector has the cable at the wrong angle. The cable is 4-5′ long and should be more like 7′. And the power plug looks like a AC/USB type connector, but the mini-USB portion is on the side, not the top, so it’s a hassle to plug into any power strip that has a bunch of existing plugs.Initial setup was simple. Plug it in, Fire TV tries to find the WiFi SSID, then enter the WiFI password.Fire TV initially tried upgrading software – this failed, and then told me to unplug/power-off.Another software upgrade attempt. Completed, rebooted.Another software upgrade; required another WiFi password with different keyboard. It seems that they changed the keyboard layout between versions of software. Of note, they changed how capital letters were entered.Fire TV was able to communicate with Amazon.com and it knew that this device was registered to my Amazon Prime account. Nice job by Amazon. Will be interesting to see what happens if I need to return/exchange the physical device to see if it updates the registration.The device is now working after 3 software updates.Introduction Video. Nicely done. Simple, easy to understand. Basically a walk-through of the remote, plus an ad to buy Amazon Prime.Fire TV includes integration with 5Gb of Google Drive. Was sort of surprised it wasn’t liked to an AWS S3 services, but I suppose this is because S3 isn’t really an en-user consumer service (eg. Google Drive, Dropbox, One Drive, etc.)FireTV comes with a simple remote. There is also a remote app for Android and Amazon Fire Phone (not yet available on iOS). This include the voice-activated features, which replace search. It may also have some cool console-level functionality for games.2nd Screen capable with Fire Tablet or FireTV app. I don’t have one of these devices, so I couldn’t test this.Have to “download” certain apps, such as NetFlix, Hulu Plus. Not sure how big the device is in terms of capacity and how many apps can be downloaded. After downloading a few, I suspect this is just a small chunk of code and most of it runs in the AWS cloud.Had to adjust the TV sizing for NetFlix – not auto-detecting the screen size or screen display settings. Was fairly simple – they gave you arrows on the screen and you just made sure they fit within the screen display.NetFlix login uses QWERTY keypad – yet another keypad for account entry (others were alphabetical). Sort of odd that Amazon doesn’t mandate any user-experience consistency.NetFlix navigation is different than on AppleTV – no concept of a “home” button – home button on FireTV (within NetFlix app) takes you all the way back to FireTV home screen.The games are decent. They aren’t high-end console quality, but most are free and seem to be of the quality of the early Wii games, which is good enough for young kids. And no extra consoles or controllers to buy.I’ve been playing with it for a couple days. After some of the initial setup hickups, it seems like a nice device. The responsiveness is better than an Apple TV, and the UI (while still clunky from the native remote), is still better than an Apple TV. Buying things off Amazon Prime, such as HD movies, is very simple and it’s great that they play immediately – vs the long download times from Apple. Makes the kids happy, especially during holiday breaks and bad weather.Overall I’d give it a thumbs up and a good value for under $40. Hopefully they release the iOS remote soon and I’ll be a much happier user.Nicely done Amazon.", "verified": true, "helpfulness": "0/0", "author": "Brian R. Gracely"}, {"rating": 4.0, "review": "The number of apps available are limited. Need to add religious apps. With the exception of the fore mentioned it met my expectations. A great device. I expect that new apps/channels will be added in the near future.", "verified": true, "helpfulness": "0/0", "author": "Ellsworth Hackshaw"}, {"rating": 4.0, "review": "Pros: - Faster than chromecast - remote - Good initial price for Prime members - Good Specs than chromecastCons:  - No tab casting or mirroring of any browser to see videos from other websitesI can say this is faster than the chromecast for watching Youtube or Netflix, i can see one issue where it will not stream the youtube videos as cast from the App sometimes.It would be great if they add the browser casting like the chromecast as an update from software.Over all good one.", "verified": true, "helpfulness": "0/0", "author": "Vijay Chaganti"}, {"rating": 2.0, "review": "I stream a lot through Hulu Plus, and the Fire TV stick is a lot slower than my Roku. The Fire TV Stick takes forever to load, and then stops very frequently to refresh. I'll just stick to my Roku - it loads fast and doesn't stop to refresh mid-show.It's disappointing, but I bought it pre-sale and only paid $20, so its not a huge loss.", "verified": true, "helpfulness": "0/0", "author": "Sarah C"}, {"rating": 5.0, "review": "First of all,it is lot faster than old ROKU3 I had. You can watch your videos very instantly as soon as you hit the button\"Play\".The installation,although it is as  simple as \"Plug-n-Play\", was not just as simple. With sound bar attached to my TV,when I plug it into the TV's HDMI outlet, video worked but I was not getting any audio. Finally ,I disconnected old ROKU3 from the sound bar's HDMI outlet and plugged this stick in. Ahaa ! Now I got both- audio and video.The new interface is little bit complex, but once you play around few times, you will get used to it. Much better improvements than all \"amazon prime instant video\" players in the past. I would recommend .", "verified": true, "helpfulness": "0/0", "author": "B. Amin"}, {"rating": 4.0, "review": "Unbeatable for the price I paid ($20 special deal).  Highly recommended and 4 stars if Amazon ever offers that deal again.  I'd rate it 3-4 stars at the normal price, because I expect Amazon will eventually fix a couple of the \"cons\" I listed.Pros:1. Much more responsive than Roku 2.  I have a Roku 2, and I've been getting increasingly frustrated with it, especially when using Netflix.  Netflix is almost always unresponsive on the Roku 2.  I remove a movie from my watch list, and it stays in the list for minutes.  I click on a movie/show on the Roku 2 and 5 times out of 10, it doesn't respond at all for 30-seconds to two minutes.  And at least once per month, Netflix (or any other channel) freezes the Roku, requiring a reboot.2. It has a nice user interface, though it's not always intuitive.3. I can play a game on the Fire TV Stick that I downloaded from the Android app store for my Android phone.  It apparently plays many of those games.  That was a nice surprise.Cons:1. The remote is flimsy, and it often overshoots when I try to select the next movie (or whatever).  Yes, you can use your phone as a remote, but I'm not crazy about that.  And yes, the phone remote adds voice recognition, which would be nice if I ever think to use it.  The one great thing about using the phone remote is that you can use it to type things like your WiFi password.  My password is very complex, so it was a real bonus for me.2. Fewer channels than the Roku, but I really only use a few, mainly Netflix and Hulu Plus, so this is not a con for me.  It may be for you.3. If I switch the HDMI input on my TV away from the stick, the Fire TV Stick doesn't seem to come back on when I switch back.  I have to cycle through the HDMI inputs a second time to get it to respond.4. My Internet speed has been flaky lately (I'm going to switch providers). On the Roku, I get the \"loading\" progress bar occasionally during a show.  That's annoying.  On the Fire TV Stick, I get a circle progress for re-buffering, but mostly it just stutters, which isn't as annoying -- EXCEPT, I get a buzzing noise when it stutters for a second or more.  That's incredibly annoying.Even with the 4 cons, I find it preferable to the Roku 2, especially at the price.", "verified": true, "helpfulness": "2/2", "author": "Nicholas"}, {"rating": 4.0, "review": "Our Apple TV was starting to get slow & glitchy, so we got this when it was on sale for $20.  For that price, I think it's worth it.  I dislike that we can't search by only Prime (free) streaming offerings.  The sound also glitches/freezes every once in a while.  Other than that, it works better than when we were streaming our Prime from the iPad to the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "GRRL"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/1", "author": "Gregg"}, {"rating": 5.0, "review": "Can't wait to get this baby and hook it up to get my Prime Stuff.", "verified": true, "helpfulness": "0/0", "author": "Mark Strelecki"}, {"rating": 4.0, "review": "It was easy to set up once it found the remote control. The Android app still needs some work. It was missing HBO Go. I  am sure eventually it will be added.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Rauda"}]