[{"rating": 5.0, "review": "Great product, I got it for half the price as a student prime member so that's even more awesome.", "verified": true, "helpfulness": "0/0", "author": "abhijeet"}, {"rating": 5.0, "review": "Meets all expectations and some. Will definitely recommend to my friends.", "verified": true, "helpfulness": "0/0", "author": "Hector"}, {"rating": 5.0, "review": "We love this fire tv stick. The picture quality is wonderful and has so many options for apps. Great product. You will like this.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Great I started using instead of Apple TV", "verified": true, "helpfulness": "0/0", "author": "Paul L"}, {"rating": 5.0, "review": "This is about like having a Kindle hooked to your TV.  The hook up was simple.  the wifi worked well. Account sign up was simple.  the streaming was quick.  Its cheap and reliable so i am satisifed.", "verified": true, "helpfulness": "0/0", "author": "Well Read"}, {"rating": 4.0, "review": "so far, so good", "verified": true, "helpfulness": "0/0", "author": "L. Duhamel \"ifthisismonday\""}, {"rating": 5.0, "review": "Love the fire tv stick, easy to install, love that it has a remote and works really well", "verified": true, "helpfulness": "1/1", "author": "Karen Eaton"}, {"rating": 2.0, "review": "frequently had to reset. I purchased two of these during the 24.99 promotion at best buy. the device would pick up my wifi connection and then disconnect after a couple hours. then at times, it would freeze and I would have to press the play and select button to reset. I'm not 100% sure if that was how to reset. but I knew how to do it when I had it 3 months ago", "verified": true, "helpfulness": "0/0", "author": "ViBROLOGY"}, {"rating": 5.0, "review": "This is wonderful. I'd been looking at getting a Fire TV and really began to drool when this was released. My dilema was pretty simple, I'd just had it with moving our blu-ray player from room to room, as a flight of stairs was involved. Then there was the promo with Sling, and I bit. It came earlier this afternoon and it was a breeze to install. I seriously think my 5 year old could do it with minimal help. We set up and watched some Disney with the Sling app, and the kids are now watching some wind down Netflix before they go get ready for bed. And the picture is great... no hiccups like with dish or cable. The kids watched the tutorial with me, and they're already asking about the games!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 3.0, "review": "Note what I expected.  I  thought it would help with the streaming difficulty we have while watching Hulu on our big TV but that is not what the Fire TV Stick is for.", "verified": true, "helpfulness": "0/0", "author": "Freya13"}]