[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Tho Nguyen"}, {"rating": 5.0, "review": "Works great and the cable is gone.", "verified": true, "helpfulness": "0/0", "author": "Terry L Barreras"}, {"rating": 5.0, "review": "It has all the apps I need and portable!", "verified": true, "helpfulness": "0/0", "author": "Michael Martinez"}, {"rating": 4.0, "review": "The firestick itself- DID NOT need to be replaced! It was simply updating the current one on a new tv and then using in an older tv.... so.... JUST FYI. NOW, I have to return one of them- creating more craziness in my life! Also, the replacement FIRESTICK- DID NOT COME with the remote control- as shown in this picture- so had I lost it in our move- or couldn't find it, it would be worthless anyways.... you cannot use a firestick without the special remote....", "verified": true, "helpfulness": "0/0", "author": "trimomsarah"}, {"rating": 4.0, "review": "Easy, simple, and fast. Amazon has another star product. Only grip would be lack of available free media.", "verified": true, "helpfulness": "0/0", "author": "Louis Cetano"}, {"rating": 4.0, "review": "Nice product, quick fit to the tv, easy access, able to pull up variety of videos and games. I like the portability. One draw back, although it can be 2nd screen for my kindle fire for video choices- I have Not been able to Mirror the kindle. The online help directs me a screen on my kindle but my kindle does Not contain the option to Mirror. This is a major drawback for my original purpose- I wanted to be able to share specific website actions on the big screen with my family, Maybe I don't have the newest version, but I recently added the 6\" hd fire to my collection, I thought that was the most current version. sigh.....Update:  I spoke with Amazon support, only the HDX fire tablets can mirror.", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 2.0, "review": "I would like to see fire TV stick stream any TV series that's available at Amazon that's sold in different regional coded areas !", "verified": true, "helpfulness": "0/0", "author": "Gary A. Matzke"}, {"rating": 1.0, "review": "Crapyest gimmick yet, there is no 30 day free use, as advertised, I purchased thinking I could extend my net flix  subscription to another room sorry the greedy people at amazon have a paid script ion service worst than a motel/ hotel and you get billed by just looking for something, NOT ordering the movie, well planned to be confusing for billing purposes…...", "verified": true, "helpfulness": "0/1", "author": "poor service"}, {"rating": 4.0, "review": "Once I got it working it works very well.", "verified": true, "helpfulness": "0/0", "author": "Jerry F. Shaw"}, {"rating": 3.0, "review": "Overheated and returned for another one from Amazon. New one works perfectly", "verified": true, "helpfulness": "0/0", "author": "Guadalupe Salinas"}]