[{"rating": 5.0, "review": "I love this gadget! Works perfectly. Set up was super easy and fast.", "verified": true, "helpfulness": "0/0", "author": "Steve Shuman \"bigboyrandy\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Plugged it in and away we went, watched all the series from the UK that I have missed whilst overseas. Easy set up, no problems.", "verified": true, "helpfulness": "0/0", "author": "Minimum"}, {"rating": 5.0, "review": "I am trying out the prime membership so I bought this TV stick. It works fine so far if my internet does not act up. So far so good!!", "verified": true, "helpfulness": "0/0", "author": "tcwong59"}, {"rating": 4.0, "review": "This thing is awesome for 40$ and if you are a prime member you actually do get quite a bit of extra content / movies / shows that netflix does not offer. It has shut off a few times randomly but i don't really care. Simply unplug and plug back in and realize how moderately priced the product is. One thing i did not know what that it DOES use a power outlet but no big deal.After this purchase i will be buying the bigger version for another TV set up.", "verified": true, "helpfulness": "0/0", "author": "alonzo"}, {"rating": 4.0, "review": "It is amazing! I'm giving 4 instead of 5 because it needs compatibility with dorms and hotel wifi. Also prime should be cheaper for fire stick owners.", "verified": true, "helpfulness": "0/0", "author": "Melania Rivas"}, {"rating": 5.0, "review": "Very nice app selection. Menu is fast and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Christopher Sanders"}, {"rating": 1.0, "review": "What Amazon doesn't tell you is that the Fire Stick must be within 10' of the router to work at all. Our router is on a different floor, and there's no way to achieve that distance. Too bad, but I wish that were part of the description -- we wouldn't have bothered, and now we have to send the darn this back.", "verified": true, "helpfulness": "3/4", "author": "Mary OFS"}, {"rating": 1.0, "review": "Well, had high hopes for this device.  Like many other reviewers, I've now gone through two of these and neither of them work.  The original was defective, so Amazon sent me a new one.  I was ecstatic that it seems to plug in and work with easy set up.  Unfortunately I had about a week of use before it began incessantly scanning, connecting, saving, disconnecting, scanning... you get the idea.  It saw my network, strong signal but it just simply could not stay connected.  I've rebooted it and spent far more time wasted on trying to fix it than it is clearly worth.  I would like to try the fire tv box in the hope that it works better, but now I'm pretty gun-shy about these devices in general.  I guess I'll go back to the roku.  Both are going back today.  A word to Amazon-  don't put products out that are sketchy on their reliability- every time you do that, you lose credibility with your customers.", "verified": true, "helpfulness": "0/0", "author": "Bridget Kaub"}, {"rating": 5.0, "review": "Much better than my Roku 2 .  I also have FireTV box loaded with Kodi...best smart TV box going.  Fire TV stick is great for Prime, Netflix and Sling TV. Not a big difference on load time compared to 4 core FIRETV Box.  Goodbye cable.", "verified": true, "helpfulness": "0/0", "author": "eric"}]