[{"rating": 5.0, "review": "Great for traveling", "verified": true, "helpfulness": "0/1", "author": "Eastr 0067 \"William Easter\""}, {"rating": 5.0, "review": "My second stick.", "verified": true, "helpfulness": "0/1", "author": "Mike Johnston"}, {"rating": 2.0, "review": "This little guy is cheap no doubt. Unfortunately you get what you pay for. This thing is seriously lacking a decent app library. It is probably for the best though because it couldn't ever keep up with the apps it had. It was slow, leggy, froze all the time and had to be rebooted a few times a day. This thing is not ready for prime time.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Initially, i was very happy with this product. I liked the interface and the multiple apps that are available.  However, i am now noticing an issue I have not had with my Chromcast. The picture when i am watching shows will freeze. The sou d will continue, but the picture will freeze for a few seconds and then speed up to catch up with the sound. This is very annoying and disapointing.", "verified": true, "helpfulness": "0/1", "author": "Jason Ellett"}, {"rating": 4.0, "review": "So far seems to be a great product and just what we were looking for.My one big complaint is that the font size is so small that my eyes are getting strained trying to read the descriptions (and I do have a current contact lens prescription). There needs to be an adjustment option for fnot size.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The WIFI is a bit sketchy and couldn't stream HD from my garage but my tablets stream fine from same location. Nice that it is basically an android stick. You can ADB apk's right onto it, so you aren't limited by the Amazon marketplace.", "verified": true, "helpfulness": "0/1", "author": "G. M."}, {"rating": 4.0, "review": "still working on it", "verified": true, "helpfulness": "0/1", "author": "Pearl  Eley"}, {"rating": 3.0, "review": "I like the fire stick a lot. I have a chrome stick as well. The remote makes the fire stick a winner for ease of use and closest simulation to TV. Only drawback is that I have to reset the stick every few days as it drops my wifi signal and then doesn't recognize the network so I re-enter the password and it works again. Google chrome stick never loses network.", "verified": true, "helpfulness": "0/1", "author": "Stephen M."}, {"rating": 3.0, "review": "It is the Fire Stick and not the Fire TV that takes a long time downloading while watching.", "verified": true, "helpfulness": "0/1", "author": "Orett Campbell"}, {"rating": 5.0, "review": "Very nice product,easy to set up.", "verified": true, "helpfulness": "0/1", "author": "William Beltz"}]