[{"rating": 2.0, "review": "OK so i just plugged this in. Seemed OK at first and now all i get is a \"playback fail\" and it stops the program I am watching and there is nothing I can do to fix it. Supposedly i can download an ap to link it to my phone to make another remote and tons of other options but alas it is only compatible with androids? What so now I can't use it and I guess playing games and other options they talk about is't a option. Anyone can you tell me is there a way i can get it on my iPhone, Kindle, iPod or anything I may have? Help... I want to love this but I don't know if it is an option :(", "verified": true, "helpfulness": "0/1", "author": "Jenntastic"}, {"rating": 5.0, "review": "Works very well.", "verified": true, "helpfulness": "0/0", "author": "Mike Poplin"}, {"rating": 2.0, "review": "If it would work better I would be nice. I have to restart this think four times a day.", "verified": true, "helpfulness": "0/0", "author": "Jacked"}, {"rating": 5.0, "review": "Awesome!!! Never use my chrome cast anymore!! Plan to buy a couple more for other TV's", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works pretty well.", "verified": true, "helpfulness": "0/0", "author": "Nick Phillips"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "laura buchanan"}, {"rating": 5.0, "review": "Loads fast and plays without interuption.", "verified": true, "helpfulness": "0/0", "author": "J. Mckimson"}, {"rating": 5.0, "review": "I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Jeannette Farrell"}, {"rating": 5.0, "review": "Love the Fire TV  Stick. Grandkids can watch disney all day long ..... lots of movie access", "verified": true, "helpfulness": "0/0", "author": "Paula Frazier"}, {"rating": 5.0, "review": "It works well, easy to plug in and set up and offer a higher variety of shows, channels and apps, as well as games.  If you enjoy playing chess on a big screen TV, this is for you.  In my opinion, this is better than Hoku or Crome. It works with your Netflix, HBO, and much more!  And you will save money with movies and shows. The best of all: you can download apps, games and shows directly from your Amazon account or Amazon Prime @ your computer to your Smart TV. You might consider a broadband or high-speed wi-fi for this, because the faster and stronger is your signal the better it works.", "verified": true, "helpfulness": "0/0", "author": "Flavio Van Boekel \"Flavio Van Boekel\""}]