[{"rating": 1.0, "review": "Worked great for about 2 days then started freezing up. Returned for refund. Going to get another Chromecast. Have 2 of them and never a problem with Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Jeremy C."}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Allen Tipton"}, {"rating": 3.0, "review": "The Fire TV stick is great when it works. But I've run in to 2 major issues: (1) you have to regularly re-enter your Netflix credentials. Take a look at http://www.amazon.com/having-login-name-password-Netflix/forum/Fx1PQN4FXWA96MT/Tx2EEDBH8DXKANQ/1/. And (2) it often shuts off. Unplugging and re-plugging it in is the workaround.Best feature is that you can use your iPhone or Android as a remote.", "verified": true, "helpfulness": "0/0", "author": "Honest Abe"}, {"rating": 5.0, "review": "Has everything.", "verified": true, "helpfulness": "0/0", "author": "Zonder777"}, {"rating": 1.0, "review": "don't work....stop working after 3 days", "verified": true, "helpfulness": "0/0", "author": "Gary swales"}, {"rating": 1.0, "review": "Didn't work well for me. Purchased as a longtime prime member and gave it a try. Here's my findings. Plugged it into my Vizio TV and ordered a $5 movie using my Verizon jetpack with a strong LTE signal. Movie was stopping every 1-2m after 5x's gives you a warning suggesting poor internet connection \"try later\". Waited a while rebooted everything, checked Internet connection. Same thing. Unplugged fire stick threw in a drawer and tried watching movie with Vizio VIA (Vizio internet apps) built into TV using same Internet connection and same prime account and resumed same movie. Only difference was Amazon prime via TV instead of fire stick. Guess what ? Watched the entire 2 hour movie without one buffering delay. Thought I might use while traveling. But if it doesn't work with an LTE JETPACK. With a full strength signal, I doubt a concrete hotel would be better. Oh well wasted entertainment  investment.", "verified": true, "helpfulness": "1/2", "author": "Mark revenew"}, {"rating": 2.0, "review": "Lags speed when over devices are running in the house", "verified": true, "helpfulness": "2/2", "author": "Joseph G Staiano"}, {"rating": 2.0, "review": "I've lived with the Amazon Fire TV Stick for more than 2 weeks so I feel somewhat qualified to review it.I like the Fire TV Stick! I would definitely LOVE it if it wasn't so Amazon-centric, but it IS their stick and their ecosystem so I'm playing by their rules! lol.I've trained myself to pretty much ignore the Amazon content as I won't be buying anything there (but you never know!).I use only a couple apps, but I use them daily, they are Netflix and Plex. I was THRILLED to see the latter, Plex, was offered on the Fire TV stick, and that it was a one time purchase of $4.99 as opposed to $4.99 month for a \"Plex pass\".If you are not familiar with Plex it's an incredible media center for your computer, with an elaborate server-side/local-side way of serving up all of your media to anyone you give access to, including Smart TV devices, and it was a one-time purchase of $4.99. And when I got my second Fire TV Stick, THERE IT WAS when I signed in with my Amazon credentials! I was overjoyed!It has hiccuped once or twice while running Plex, but these weren't streaming problems IMHO, this was a server lag.Both Fire TV Sticks have run Netflix flawlessly, never a stutter.I should say that both Fire TV Sticks are close to the router and I have a fast FIOS connection.I've had 4 other Smart devices so I've lived with other's ecosystems as well: Apple TV, Sony, Vizio, Plex (Plex has definite Smart capabilities), and now Fire TV Stick's. I can say that the Fire TV Stick has been the snappiest out of all of them, with Sony coming in at a VERY slow last (hate Sony's interface, at least on my cheap Bluray player).  But they are also the only Smart device really pushing it's manufacturers wares in such a big way (in my experience).The Fire TV Stick's interface took only a few minutes to familiarize myself with. The system settings were very basic and I left most at the default settings.I'm not a gamer and only downloaded a couple free games...bowling is kinda fun.I'm pleased with it, and a further endorsement is me buying a second!Inexpensive way of spreading the Smart TV love around!UPDATE 02/06/15:I'm having a love/hate relationship with just the remote in my bedroom.Pros: I love the fact that its RF, it feels great in the hand and its very responsive.Cons: My bedding is black and white and remote is CONSTANTLY getting lost in the comforter. I would love to see the brightly colored silicon covers that I've seen for the larger Fire TV remotes. I'd buy one this second if they were available.I'm also having trouble playing MKV files in Plex on just one of the Fire TV's...I've enabled MKV support but it just won't happen. I purchased another app that does a decent work-around but I hate having to purchase more stuff when Plex should be handling this.UPDATE: I have to say that I'm REALLY beginning to loath this thing, specifically the remote!When a button is pushed, no matter which, it may or may not invoke an action...when it just sits there and nothing happens your tendency is to push it again, and again...then it just scrolls uncontrollably and can't be stopped (or not, its a crap-shoot!)! This happens more times than not.This junk is going on ebay and I'm going back to ATV...at least it works!!!", "verified": true, "helpfulness": "0/0", "author": "Jeff Hoogmoed \"Jeff Hoogmoed\""}, {"rating": 4.0, "review": "Very good content, however technology still a bit clunky. But Amazon support is unsurpassed!", "verified": true, "helpfulness": "0/0", "author": "rob codo"}, {"rating": 1.0, "review": "Unable to connect with provider service", "verified": true, "helpfulness": "1/1", "author": "mmf"}]