[{"rating": 5.0, "review": "I love the convenience of the FireStick! It's awesome!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Root"}, {"rating": 4.0, "review": "Works great, and love that it came preloaded with account info so that setup was very easy.  The FireTv stick makes it (mostly) easy to access Amazon Prime and Netflix on the go.  The only real difficulty, which I hope Amazon updates, is that if you're travelling and the hotel or other wi-fi connection requires a sign-in page, the Fire TV stick will not work since there is no html browser.  This should be a simple fix with a software update, and hope one comes soon - I would give 5 stars except for that one problem.", "verified": true, "helpfulness": "2/2", "author": "Ted Howard"}, {"rating": 5.0, "review": "I have both chromecast and fire stick...I love the fire stick!! Super easy... Love it! Makes your tv into a smart tv without the cost!! Nice job amazon!", "verified": true, "helpfulness": "0/0", "author": "Melissa A Garofolo"}, {"rating": 5.0, "review": "We love it! Now we can watch movies through Netflix and Amazon. It was so easy to setup and simple too use!", "verified": true, "helpfulness": "0/0", "author": "Rose Sorendo"}, {"rating": 5.0, "review": "We got rid of our cable subscription some time ago, and while having Netflix (disks by mail) and a Prime membership helped, it really wasn't the most convenient option since there are two of us and we don't always want to watch the same thing. When the Fire TV Stick showed up as a preorder, the price was so good I decided to give it a go. I'd avoided the Roku due to price, and I hadn't tried the Chrome Stick due to reviews.The Fire TV Stick arrived in time for Christmas and has turned out to be a great little device. It was dead simple to set up (though I do wish the USB cord was one or two feet longer). I switched Netflix from disk to streaming and now we have access to Prime and Netflix for just about all the movies and television episodes we could want. My dad will be able to watch baseball on a large screen now with the MLB app. The only disappointment is the stupid ESPN app which requires a subscription to a cable company to use it - kinda defeats the purpose. That's not the Fire TV Stick's fault though, that's just ESPN/cable company greed.Overall, the \"stick\" has been a huge boon for us. Recently we both came down with the creeping crud and had no energy to do anything. Having access to tons of movies and television episodes through streaming was a sanity saver.", "verified": true, "helpfulness": "0/0", "author": "Lee Dunning"}, {"rating": 5.0, "review": "Awesome for basic use. Use this to watch Netflix and Hulu in my bedroom. Have used it every single night since getting and and not had a single issue.", "verified": true, "helpfulness": "0/0", "author": "Ryan Fruechte"}, {"rating": 5.0, "review": "perfect, no issues!", "verified": true, "helpfulness": "0/0", "author": "Burt Tabora \"Burt Tabora\""}, {"rating": 5.0, "review": "Unbelievable! How does this stuff work? Very convenient and mostly easy to set up. The only glitch I had was that I had to switch the plug in to a different HDMI port, then it was fine.", "verified": true, "helpfulness": "0/0", "author": "Breathe Deeply"}, {"rating": 4.0, "review": "Works great, I've used it in two different televisions, in different parts of the house.The only challenge I had was when using it further from the router, I had a few times where it lost signal. Power cycling it (unplugging the power and re-plugging it in) fixed the issue each time.", "verified": true, "helpfulness": "0/0", "author": "Scoutergreg"}, {"rating": 5.0, "review": "Easy to install. Love it.", "verified": true, "helpfulness": "0/0", "author": "EAS"}]