[{"rating": 3.0, "review": "If you are in the World of Amazon then it is fine but it underpowered. Found an item at CES with more power and able to load apks that work.", "verified": true, "helpfulness": "0/0", "author": "MoDirect"}, {"rating": 4.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "SAM"}, {"rating": 2.0, "review": "Worked fine but it doe t have HBO now!!", "verified": true, "helpfulness": "0/0", "author": "Dirk Schwiebert"}, {"rating": 5.0, "review": "This was one of the best buys I have had in a while. Not only does it transform our ordinary flat screen into a smart tv, it does so with ease! Set up was a breeze and navigating through the apps is seamless. My favorite part was that it was completely affordable costing less than 50 dollars. I would recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "UnspokenWords29"}, {"rating": 1.0, "review": "If I could give this thing LESS then one star I would! I have a 47\" visio thts only a few years old. Fire stick doesn't work! It skips....it makes a crackling noise....it pauses...thn blacks out. The only thing tht lets me get through the tv show is if i shut it down after the pic goes black. Ive talked to customer service abt the issues and their useless. No one knows how to fix this! Definitely does not have all the bugs worked out. Hate this thing so much it prompted me to get a new smart tv. I hate this thing! Anyone who gave this thing more then one star either works for amazon or is getting paid to give it a good review. Dont buy this!", "verified": true, "helpfulness": "0/2", "author": "jackie"}, {"rating": 5.0, "review": "My teenage kids were even impressed", "verified": true, "helpfulness": "0/0", "author": "carl w. cox"}, {"rating": 5.0, "review": "The fire stick is wonderful. Easy to install,  easy to use. Iam very pleased. I am alreadyThe fire stick is wonderful. Easy to install. Easy to use. I am very pleased. Yes I would recommend the fire stick to all my friends.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a simple to install and operate system. For what it avails in just the basic unit you procure from Amazon is rather unbelievable. What you get is an overload of video. (Oh yah, you need to be prime to take advantage of all the free stuff) there is a bounty of many other free and for minimal cost apps that are compatible with this stick. We're using it with an AT&T; uverse router which provides lightning fast response. The fire TV stick is fantastic addition to make your video system many additional expansion for a few bucks", "verified": true, "helpfulness": "0/0", "author": "Greg K \"GPK\""}, {"rating": 5.0, "review": "It has, so far, been a great product. Set up was easy and streaming is smooth.", "verified": true, "helpfulness": "1/1", "author": "steven c smith"}, {"rating": 5.0, "review": "this is our second fire stick. we love amazon prime and fire tv stick movies.  thanks Amazon!", "verified": true, "helpfulness": "1/1", "author": "maggie"}]