[{"rating": 4.0, "review": "It's been working great so far!", "verified": true, "helpfulness": "0/0", "author": "bernadette"}, {"rating": 5.0, "review": "I am so pleased with this little tech gadget!  Super easy to install; had it done in a matter of minutes.  Also, very user-friendly.  Love being able to watch movies/programs on my big TV.  Plus, similar products are much more expensive than the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Boxer Lover \"Luv2read\""}, {"rating": 5.0, "review": "amazing !!", "verified": true, "helpfulness": "0/0", "author": "Laura Catania"}, {"rating": 5.0, "review": "Works great. Easy set up. Makes your TV a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Ginny Hogan"}, {"rating": 2.0, "review": "still not provide streaming for out of US territory , even am still interesting in buying renting some series and movies.", "verified": true, "helpfulness": "0/0", "author": "Mountaineer"}, {"rating": 5.0, "review": "I LOVE the Fire TV Stick.  I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Dahlra"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "eric"}, {"rating": 5.0, "review": "Works great! Installed Kodi app on the firestick and ditched cable.", "verified": true, "helpfulness": "0/0", "author": "jeremy shirey"}, {"rating": 4.0, "review": "It's great for movie night with the family and downloading the hottest apps. Become a member and it's like almost everything is prime. My only concern is not being able to go to amazon site to purchase products.", "verified": true, "helpfulness": "0/0", "author": "TaShaka McMillion"}, {"rating": 5.0, "review": "Absolutely does everything it says it will.  Works great on the older flat screens that are not \"Smart TV's\" or internet capable. A great product and a good investment.  Cheaper than buying a new TV.  It's easily mobile between TV's. but I am going to order two more, so I don't have to switch it out.  I do however recommend you have a strong wireless router that can handle multiple devices.", "verified": true, "helpfulness": "0/0", "author": "Barry Stewart"}]