[{"rating": 2.0, "review": "I have a Roku, a Chromecast, and now the Fire Stick. Thankfully I picked it up during the 2 day sale otherwise I'd be upset. So what I like... It comes with everything think need. The stick, remote, batteries for the remote, power cord and adapter, and an HDMI extension cord. I like the remote design too, very nice in an elegant sort of way. What I don't like, the deal killer for me, was the fact that I have to pay $5 for the Plex app. I pay for the monthly service with Plex. The app on my Roku was free. The app on my phone was free, the app on my Smart TV was free. Why do I have to pay for the app here (especially when I already pay for the service)?", "verified": true, "helpfulness": "0/2", "author": "Jayms M"}, {"rating": 5.0, "review": "Better than Google Chromecast. Flawless. If you are a Prime member, this is a must-have.", "verified": true, "helpfulness": "0/0", "author": "#bergerlish \"#bergerlish\""}, {"rating": 5.0, "review": "Put it in the boys room, they are 9 and 12. They are assigned to go in to my watch list only to view anything I put in there (science, funnies, cartoons, history, etc). When I hear other stuff going on the stick gets taken for the day. It's very easy for them use... and YEP! I would recommend to to friends and family!", "verified": true, "helpfulness": "0/0", "author": "JnzWorld"}, {"rating": 5.0, "review": "Better than the Chromecast if you want to stream directly from Netflix, Amazon etc. without having to mirror from a smart device.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 4.0, "review": "Pretty good so far.  Wish Prime could handle multiple accounts within a household like Netflix does.  Also, the volume level output seems a tad high, but that's not a big deal.  Interface is rather well done.  And having a remote IS REALLY NICE, it's the one big thing over the Chromecast.  But I like that for other reasons.  Each has their strong points.", "verified": true, "helpfulness": "0/0", "author": "Bob Smithers"}, {"rating": 5.0, "review": "Wish I could have bought 2 while it was on 1/2 price. I need another one!!", "verified": false, "helpfulness": "0/0", "author": "Sherri"}, {"rating": 1.0, "review": "Nothing is happening. Checked connection, batteries...nothing.", "verified": true, "helpfulness": "0/4", "author": "Jean Conlon"}, {"rating": 4.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "This was easy to setup. I wish I could say the same for keeping it connected to my wifi. Buffering anywhere from every 30 seconds to every 10 minutes on my 40mbit line. Sometimes it drops the connection totally. I am stumped as it shows the wifi signal at full strength. Tried to power cycle it, no change.Edit: for whatever reason, when I tried it again tonight, it has been running flawlessly. Leads me to believe this is network related and have changed to five stars. Could not have bought anything better for 19.99.", "verified": true, "helpfulness": "0/1", "author": "Brandon"}, {"rating": 4.0, "review": "Bought both a Roku stick and a Fire TV stick. The Roku stick is slow as shtanka.  Netflix takes close to 4 minutes to launch. The Fire stick is instantaneous. Plex on the Roku gives only one thumb in a series at a time. Fire TV shows a screenful with synopsis. No synopsis on the Roku. Roku search searches all services (but not Plex). Fire TV only searches Amazon Prime Video. Even so; Amazon for the win.", "verified": true, "helpfulness": "0/0", "author": "Michael Alessio \"Travel Addict\""}]