[{"rating": 3.0, "review": "so there are so many streaming devices out there and this one was a total disappointment. I'll be selling this off and going back to my chromecast. The remote was a nice feature but no voice button which I thought it would being a fire tv product line. Vudu app would be nice since you have flixster which is one reason I'm looking at other options.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "I only use the Fire TV Stick for Netflix and Amazon streaming, and they both work very well with a 10Mbps internet connection. The interface is nice as well as the remote. I considered just getting a Smart TV instead, but it ended up being a far better value to just purchase the stick. No need to pay a premium for a Smart TV, and I can unplug the stick and take it with me when travelling! It would be nice if the stick could power itself through the HDMI port, but with some TV's you can power it via a spare USB port on the TV. Otherwise, you need to have an extra outlet available as it is with most other streaming type sticks.", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 4.0, "review": "Nice product. Works well. Only concern is interface is too clumsy. it can be bit simpler but overall satisfied with the product.", "verified": true, "helpfulness": "0/0", "author": "Shreyas Shah"}, {"rating": 5.0, "review": "Love it!It's far better than cable was and costs about the same for the year what cable cost me in a month. Do it.", "verified": true, "helpfulness": "0/0", "author": "Joe Sablevicius"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Kim Melton \"Kimmie G.\""}, {"rating": 4.0, "review": "Missing NHL Gamecenter, otherwise an excellent product.", "verified": true, "helpfulness": "0/0", "author": "R. Richmond"}, {"rating": 4.0, "review": "I've only been able to play with my Fire TV Stick for maybe 6 hrs.  The only trouble I've had was getting the back off the remote to put the batteries in.  Lovin it otherwise.", "verified": true, "helpfulness": "1/1", "author": "Cindy Ward"}, {"rating": 5.0, "review": "Not only the package came in so fast, but its a great little thing to have.  Installation was a piece of cake, and now I can Netflix in any of my TV's.", "verified": true, "helpfulness": "0/0", "author": "katherine ceballos"}, {"rating": 5.0, "review": "The best way to watch movies or TV, no commercials and the choices are up to you. One of the best Christmas gifts I have ever gotten!!!", "verified": true, "helpfulness": "0/0", "author": "Kem R."}, {"rating": 5.0, "review": "Great product once Amazon tech support figured out that my wireless router was too slow.  You need at least an N speed router for this to work properly.", "verified": true, "helpfulness": "0/0", "author": "Wayne J. Hamilton"}]