[{"rating": 5.0, "review": "Works great my android phone mirrors to it and gives a very good picture on my TV .was disappointed to find out the three kindles I have are the model before the one that will mirror to the fire stick should be an update or an app that would help with that. If there is please let me know.", "verified": true, "helpfulness": "0/0", "author": "Myron mccowan"}, {"rating": 5.0, "review": "Great device!!  Very easy to install.  Had a little trouble connecting to the internet, but once I got on, it works beautifully.  Now I can finally get more out of my Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Nancy M. Kramer"}, {"rating": 4.0, "review": "Just got my fire stick today. It was easy to set up and already like the fact I have many apps and movie selections on my tv.", "verified": true, "helpfulness": "1/1", "author": "Hector Rodriguez"}, {"rating": 5.0, "review": "It is great to use...lots of different items to see and do...love it", "verified": true, "helpfulness": "1/1", "author": "jenni o"}, {"rating": 3.0, "review": "This worked pretty well, and was amazing for the size.  But so is Google Chromecast and Roku.  I'm already using Roku devices everywhere, and in my opinion they offer more, so I stuck with Roku.  But, I'm still glad I got the Fire TV stick, because its a good travel companion.  I'll take this on the road to use in hotel rooms.  It will be a bake-off between Firestick and Google Chromecast.  The Firestick might come out ahead by including a remote.  But the Chromecast browser plugin ability to stream the whole browser is pretty great too.  It's tough to pick the best one.  If you already have Prime, you might like it.", "verified": true, "helpfulness": "1/1", "author": "Brian C."}, {"rating": 5.0, "review": "Very good I will be buying more. Easiest way to have a smart tv.", "verified": true, "helpfulness": "1/1", "author": "Brobooger \"Brobooger\""}, {"rating": 5.0, "review": "Works great save me lots of money", "verified": false, "helpfulness": "0/0", "author": "Ali Saboor"}, {"rating": 5.0, "review": "So easy to use!  Love it!  The only part that was difficult was getting the back cover off to put in the batteries .. took a LOT of finger force.", "verified": true, "helpfulness": "0/0", "author": "susan steege"}, {"rating": 5.0, "review": "I love this Five TV Stick", "verified": true, "helpfulness": "1/1", "author": "T. Vo \"tvo\""}, {"rating": 4.0, "review": "Easy to set up, I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Ro"}]