[{"rating": 5.0, "review": "Cancelled cable tv and ordered 2 sticks.  Money savers.", "verified": true, "helpfulness": "0/0", "author": "book fan"}, {"rating": 1.0, "review": "Had this less than a week and it's stuck on the homepage and the remote won't die anything ?????  Tried changing batteries but still nothing !!!", "verified": true, "helpfulness": "0/0", "author": "Robert Leary"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Orlando Trevino"}, {"rating": 1.0, "review": "The device was not working could not connect to WiFi while other devices in the household had no problem. Asked that they send me a new one and will see how that works.", "verified": true, "helpfulness": "0/0", "author": "Brian Hostetter"}, {"rating": 3.0, "review": "I like the concept and thought that having prime would allow me more options for free shows/movies but so far all I've gotten is the first episode free, after that I'm told I have to buy additional episodes which I feel defeats the purpose of prime", "verified": true, "helpfulness": "0/0", "author": "dawn h. erskine"}, {"rating": 5.0, "review": "Love it works really well also very easy to set up", "verified": true, "helpfulness": "0/0", "author": "Lakeshia"}, {"rating": 5.0, "review": "Had issues when i plugged into my Smart TV  while testing (wifi in Smart TV causes it to drop) but when plugged into its intended TV in bedroom it has worked perfectly. A+", "verified": true, "helpfulness": "0/0", "author": "mr s l mcgill"}, {"rating": 5.0, "review": "Works great!  Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Chris C."}, {"rating": 5.0, "review": "Very impressed. Would recommend buying it if you don't want to pay for cable anymore. Netflix and Showtime is the way to go!", "verified": true, "helpfulness": "0/0", "author": "Alex Ramos"}, {"rating": 4.0, "review": "I am very much enjoying the firestick, I can enjoy watching everything I can even remotely want to see!!", "verified": true, "helpfulness": "0/0", "author": "Floyd Farque"}]