[{"rating": 5.0, "review": "love the quality of picture and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Marjorie C. Fattori"}, {"rating": 5.0, "review": "Bought it and have been using it every day.", "verified": true, "helpfulness": "0/0", "author": "Lee Xiong"}, {"rating": 1.0, "review": "This is not streaming content for me very well. It's hit or miss but seems to mostly be a miss. I've resorted to hooking my computer up to my TV in the meantime (which streams everything just fine). I mostly use Hulu, but it does it with all of the apps.Any comments or suggestions? Anyone else having any issues? I've switched it to three different HDMI ports on my TV as some have suggested with no luck. Thinking about send it back shortly.", "verified": true, "helpfulness": "0/0", "author": "Darwin K."}, {"rating": 4.0, "review": "Easy. Remote is awesome. A little clunker interface when using other apps to watch video, but maybe I just haven't explored it enough. I enjoy it more than my AppleTV. I just wish my television would turn off when the device times out like it does with the other devices hooked to it.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "Loved it!  It streams fast and has great apps!", "verified": true, "helpfulness": "0/0", "author": "adnil hill"}, {"rating": 5.0, "review": "Excellent product; excellent price. Very happy with it. Took it on vacation and plugged into hotel tv.", "verified": true, "helpfulness": "0/0", "author": "PETER J. HERNANDEZ"}, {"rating": 2.0, "review": "On the surface it appears to work fine. However, when accessing Netflix the service is sporadic at best. I have called customer service and they have admitted that there is a software glitch that they are trying to work out but it hasn't been corrected yet. Hopefully someday the glitch will be fixed and the device will perform as promised. I would like to be satisfied with this product but right now it does not perform as advertised.", "verified": true, "helpfulness": "0/0", "author": "Colleen R. Renie"}, {"rating": 3.0, "review": "Youtube doesn't work very well but other than that it is a solid unit", "verified": true, "helpfulness": "0/0", "author": "Ethan"}, {"rating": 5.0, "review": "Enjoying the Fire TV Stick and all of the available channels", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Tiffany Lewis"}]