[{"rating": 5.0, "review": "I love it. I have the Fire TV box in the living room and the Fire TV stick in the bedroom. No big difference between their functionality. I love how well it works for Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Sylvia Haven"}, {"rating": 5.0, "review": "I recieved the fire stick for Christmas. I already was a prime member and the fire stick made watching my favorite shows wonderful. It was so easy to use. It came with everything I needed. Just plug it in and follow the prompts and your done. I just added Netflix so I have even more stuff to watch. I can also take it with me where ever I go. I would recommend the fire stick. I just love it.", "verified": true, "helpfulness": "0/0", "author": "Louise Redmond"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Abigail Bookenberger"}, {"rating": 5.0, "review": "WAAAAAYYYYYYY BETTER THAN CHROMCAST!!!!", "verified": true, "helpfulness": "0/0", "author": "Aaron Monreal"}, {"rating": 5.0, "review": "Received it as a gift and I love it!!! So easy to work and has alot of great shows and videos.", "verified": true, "helpfulness": "0/0", "author": "Sharon Brennan"}, {"rating": 4.0, "review": "So far I love this device. The only reason I didn't give 5 stars is that it needs a web browser.  If you try to use this device at some hotels that require a sign in than this device can't get online.", "verified": true, "helpfulness": "0/0", "author": "Chuckles"}, {"rating": 5.0, "review": "I love it. I am also a Netflix user, so , it's nice to have everything all in one place.", "verified": true, "helpfulness": "0/0", "author": "Lyndsay S."}, {"rating": 5.0, "review": "Easy to install, TONS of selections and my wife LOVES IT!!!", "verified": true, "helpfulness": "0/0", "author": "Greg Greenwood"}, {"rating": 5.0, "review": "Love it, especially being able to watch youtube while laying in bed", "verified": true, "helpfulness": "0/0", "author": "Tiya Shields"}, {"rating": 5.0, "review": "Awesome device. Bought this for each of my kids' bedroom TV's.", "verified": true, "helpfulness": "0/0", "author": "Joe"}]