[{"rating": 5.0, "review": "I am very pleased with my Fire TV stick now that I can watch Netflix on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Susie"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Mike M."}, {"rating": 3.0, "review": "I find it extremely difficult to navigate around the site.  With prime I already have Amazon Instant Video and it is very easy to see what is available.NOT SO.  EITHER THAT OR I'M MISSING SOMETHING.", "verified": true, "helpfulness": "0/0", "author": "Jarhead"}, {"rating": 4.0, "review": "worked very well and not to hard to setup", "verified": true, "helpfulness": "0/0", "author": "bob lawrence"}, {"rating": 5.0, "review": "Easy to use! Lots of fun!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "I love this.  It does exactly what we needed, allows us to easily watch prime series and do other streaming without the need for an internet ready tv", "verified": true, "helpfulness": "0/0", "author": "jeri montalto"}, {"rating": 3.0, "review": "This product works great, and I am very happy with it. I was just disappointed that I cannot access VUDU or HBO GO yet.  As soon as those two apps are available, I would give this 5 stars!", "verified": true, "helpfulness": "0/0", "author": "Corey"}, {"rating": 4.0, "review": "Just got our new toy. The array of available material is dizzying. We have just begun to explore all the features and options. One little nit pik however. In the commercials I've seen there is no mention of the need for access to an additional 110V socket for a power supply. The impression given is that it is powered via the HDMI port. Not so.Nit pik aside we are having a blast with this thing. In our are on-demand streaming is not available, so this is a new experience as well.Definitely worth the cost.I have only one concern. There appears to be no way to turn the Fire Stick \"OFF\". And since it is connected to the Internet does it make it possible for Google to monitor what we watch on our TV?", "verified": true, "helpfulness": "0/0", "author": "Charlie199"}, {"rating": 5.0, "review": "only have it two days and i'm very pleased with it,I just hope your standard of service stays and makes many more people happy like I am thanks", "verified": true, "helpfulness": "0/0", "author": "fred natoli"}, {"rating": 5.0, "review": "This thing mostly replaces my ps3 I don't have a need for the extras but this stick impresses me for just 40 dollarMy sister wasn't interested with this at first but she started liking it so I need to buy another one.If your planning on playing games the amazon fire game controller is a must which is as expensive as any other video game controller but gaming is not so limitedAlso it doesn't buffer much when playing a movieAlmost no ads", "verified": true, "helpfulness": "0/0", "author": "joan"}]