[{"rating": 4.0, "review": "TV content -  3 starsApp content - 4 starsGame content - 4 starsMusic - 5 stars and down!!!", "verified": true, "helpfulness": "0/0", "author": "Ale Jul"}, {"rating": 2.0, "review": "I'm generally unhappy with this product after switching from Google Chromecast. It way to often freezes and then fast forwards to catch up and other time it cuts out on sound. Had I known I wouldn't have given away my chromecast.", "verified": true, "helpfulness": "0/0", "author": "alex hartford"}, {"rating": 5.0, "review": "So, I won this product at a work function, and I went into it not knowing fully what to expect... And this little thing has blown my mind away... So much that one little stick can do!! In my opinion, it's definitely worth more than $39.99! I was expecting at least $80.", "verified": true, "helpfulness": "0/0", "author": "Katieeee"}, {"rating": 1.0, "review": "I am returning this item.  If you don't have an exceptionally strong wifi signal don't waste your money.  It worked for a few seconds at a time and then went back to saying I didn't have a signal.  Not cool!  I guess I'll have to get a dish....  Uggg......", "verified": true, "helpfulness": "0/0", "author": "MZ Lady \"Navy lady\""}, {"rating": 5.0, "review": "Wow!!!!!! This really surpassed my expectations and we are looking forward to new features that may be added to it in the future.... Truly beats cable hands down... One of the best investments I have made in Digital Entertainment. Awesome picture clarity and sound", "verified": true, "helpfulness": "0/0", "author": "tonisweets"}, {"rating": 1.0, "review": "I had to return the Fire Stick because it buffered/skipped when watching netflix. I have a Roku 3 and a Roku 2 that both work flawlessly, so it was not my wireless network, it was either poor design/hardware or just bad luck and I got defective product. Also the Fire Stick is too Amazon centric for me, I expected the product to be a little less pushy with Amazon products. Save yourself the time and just get a Roku (not the roku stick though it sucks too).", "verified": true, "helpfulness": "1/1", "author": "foo"}, {"rating": 2.0, "review": "I have repeated issues with the internet connection, upgraded my router to accomodate the issue. I have been told by two IT individuals there are issues with the firestick and not to waste anymore money on it or another router, as I already have the best on the market.", "verified": true, "helpfulness": "0/0", "author": "Todd Gerdes"}, {"rating": 5.0, "review": "I really like the ease of use and access to all content.", "verified": true, "helpfulness": "0/0", "author": "Carlos Martinez"}, {"rating": 5.0, "review": "I own both the Chromecast and the Fire TV Stick and use them extensively. The horsepower of the Fire TV Stick is impressive and will be my travel device. I have added a bluetooth keyboard/mouse and side-loaded Firefox to add a browser to increase utility to this device. I purchased this at the starting price of $19 to give it a chance since the specs were sooo much better than similar device and wish that I could have bought 10 at the time. The Fire TV Stick is worth the cost of $39 and plan to pick up a few more to give as presents. Great product Amazon!", "verified": true, "helpfulness": "0/0", "author": "JK Miguel"}, {"rating": 4.0, "review": "This is a great alternative to paying those outrageous cable bills! I added HULU and NETFLIX, and couldn't be happier. The NETFLIX app tends to lag, which sucks! But other than that, its a great product.", "verified": true, "helpfulness": "0/0", "author": "Silversurfer"}]