[{"rating": 5.0, "review": "Simple, easy and wonderful!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Didn't really know what to expect and am still trying to figure out all the ways it can be used.  But have been satisfied so far with the apps I have tried.", "verified": true, "helpfulness": "0/0", "author": "Davene Roberts"}, {"rating": 3.0, "review": "Works as advertised. Wish it would connect to VuDu, but competitor with Amazon Prime so understandable (The Flixster site sync's with most of my VuDu movies I purchased onBluRay from Amazon.)The voice control (application available for IOS smart phones) is a nice touch albeit not fully functional. (Voice commands seem to only look up artists, movies or music. For instance, if one wants to switch to YouTube it responds with comment that it can't find anything by that name or includes lists of movies and/or music with that in the title or lyrics.)Still, all in all, it works and is easy to use.", "verified": true, "helpfulness": "0/0", "author": "onokapu"}, {"rating": 3.0, "review": "We love... the remote.  The actual streaming DOES NOT WORK AS WELL AS our other streaming device-- content freezes temporarily or, other times the picture freezes while the audio continues, then it re-syncs and resumes.  We've used the Fire Stick several months and verified it is the Fire Stick and not our WiFi, as every other device we own works as described.  Yes, we have the added cord plugged into an electrical outlet.  It is bad enough that, even though we love the Fire Stick remote and don't like the remote for our other streaming device, we've gone back to the other device for all content (Netflix; Pandora) except Amazon Prime.  We have not returned the Fire Stick because our other streaming device does not allow us access to Prime.  Trying to decide if we should keep putting up with the poor streaming quality because \"the price was right\" and we love the small size and the remote, or exchange it.  Unfortunately, because of the problems, we've watched very little content on Amazon Prime and, therefore, may not renew....", "verified": true, "helpfulness": "0/0", "author": "Tenaya"}, {"rating": 3.0, "review": "I love it! Telling all my family, friends, and enemies, too!!", "verified": true, "helpfulness": "0/0", "author": "SANDRA A CHO"}, {"rating": 5.0, "review": "Super simple to plug in and set up!  I'm not quite a cable-cutter since I can't get OTA channels using an indoor antenna, but have only a basic cable package to keep costs down. I have Apple TV in my guest bedroom and love it, but decided to go with the Fire Stick for my main TV. It allows me to easily watch movies and TV shows from Amazon Prime, Netflix and Hulu Plus, etc. One of the BEST features, though, is the ease of setting up and using the Sling TV app. I can now watch ESPN and HGTV without paying the cable company an arm and a leg for those + 100 channels I'll never watch. Thank you Amazon for a great easy-to-use product!", "verified": true, "helpfulness": "1/1", "author": "Nancy M."}, {"rating": 5.0, "review": "My fire stick works wonderfully. I am so glad I purchased it!", "verified": true, "helpfulness": "0/0", "author": "Shellbell"}, {"rating": 5.0, "review": "Love it, fare better than a chromecast", "verified": true, "helpfulness": "0/0", "author": "Kyle B."}, {"rating": 5.0, "review": "Awesome stuff", "verified": true, "helpfulness": "0/0", "author": "peterpaul abiva jr."}, {"rating": 4.0, "review": "I was hoping there was a blootooth feature to Cooney to tablet for situations where WiFi is very good.", "verified": true, "helpfulness": "0/0", "author": "Paul Slocoast"}]