[{"rating": 5.0, "review": "So far this streaming device is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "rocco costa"}, {"rating": 4.0, "review": "So far, much better than expected after the fire tv did not work well with my internet speeds. However, This works just fine. Do not even bother with the ChromeCast. Very few times does it pause and buffer.", "verified": true, "helpfulness": "0/0", "author": "Patricia Porter"}, {"rating": 4.0, "review": "Great!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! I have it on my tv in my master bedroom, it reaches downstairs and to the other end of the house where my router is at, and never loses connection. I don't even have the extra power cord plugged in! I always had to wait on my samsung blu ray players to buffer with netflix/prime video. This never does that, it is awesome.", "verified": true, "helpfulness": "0/0", "author": "Gavin Strader"}, {"rating": 2.0, "review": "Cannot connect to Vudu.  I thought I could mirror off my smart phone  I can not", "verified": true, "helpfulness": "0/0", "author": "Mandy"}, {"rating": 5.0, "review": "My gf brought this Fire TV as gift for my mother today- Mother's Day. I was impressed with the Fire TV with a very straight forward installation and set up process. Even my 80 years old grandpa can easily understand its function!", "verified": false, "helpfulness": "0/0", "author": "TeemoViewer \"Never Underestimate the Power of Scout's Voice\""}, {"rating": 5.0, "review": "So far so good.....", "verified": true, "helpfulness": "0/0", "author": "bj"}, {"rating": 5.0, "review": "I bought two Fire TV sticks in a month and have been completely satisfied with them. We have an Amazon Prime subscription and also Netflix. I will be watching tv series I missed seeing in the past due to my work hours, and the limited availability on demand with FIOS. I am starting out with Fringe, and plan on moving on to The Wire, Under the Dome, Justified, and the Americans. I have watched some movies as well as the tv shows. Having the Fire TV stick in our bedroom and tv room has made our Prime subscription an excellent value. I needed some assistance installing the first one but was able to install the second one on my own. The picture quality is very good. I can't say enough good things about them.", "verified": true, "helpfulness": "0/1", "author": "Massachusetts Cinephile"}, {"rating": 5.0, "review": "Works as advertised.  I watch Amazon Prime videos, Netflix and Hulu.  I put and antenna up and get local channels and my TV bill is now $17 per month. Easy to set up. Connect to your wireless internet.  The stick requires a charge and the kit includes a micro USB plug in that is not shown in the picture. The stick plugs into an HDMI input on your TV and comes with an adapter if the fit is to tight for the length of the stick. Setup was fast. The menu and remote take a little getting used to but are intuitive and no real problem. Amazon Prime is there with your account already active. You have to download the aps for the various services but that is quite fast and once you sign in, you are always signed in. I'm very happy with the purchase and about $1200 a year richer for buying it. I do recommend Fire TV Stick and I'm enjoying it a lot!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Product is good but sometimes is not able to connect to the W-Fi network. All other devices are working OK. Tried bye reseting, removing power and no luck. After a while, it fixes by itself but this failure are annoying. Hope an update will fix this issues.", "verified": true, "helpfulness": "0/0", "author": "CarlosR"}]