[{"rating": 4.0, "review": "Love using it with Sling - that's the main reason I got it. Still learning about all its features and what is free versus what is paid.  Watching ESPN has been quite enjoyable.  Ease of use and simplicity is fantastic.  Occasional, very minor chopiness at times when streaming internet shows, and internet connection is usually 20mbps+ when this is occurring.  Not as noticible when streaming through Blu-ray player.  But, at the end of the day, it is so minor that it does not lower overall score below \"4\".", "verified": true, "helpfulness": "0/0", "author": "Andrew Williams"}, {"rating": 2.0, "review": "Not what I expected, from a person who already use a Roku Stick and other Roku Devices. I really wanted to like this, the SPECS seems better, and a Better price than the Roku Stick  - But the one I received, remote control connection did not always work. It was not as fast as my Roku. The APPs Features, where not as detailed as the Roku. but this all could be fixed maybe by updates... maybe!", "verified": true, "helpfulness": "0/0", "author": "CMJONES"}, {"rating": 4.0, "review": "I like it.  Works just like the bigger version only WAY smaller.  Smaller is always better.", "verified": true, "helpfulness": "0/0", "author": "cinanim \"B. Smith\""}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "ROY carrizales"}, {"rating": 5.0, "review": "Very fast interface, works well upstairs and down :)", "verified": true, "helpfulness": "0/0", "author": "Brittany Campbell"}, {"rating": 5.0, "review": "Awesome device.", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 5.0, "review": "works great I wish I would have had it years ago", "verified": true, "helpfulness": "0/0", "author": "TERENCE"}, {"rating": 5.0, "review": "So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Christina Raquedan"}, {"rating": 5.0, "review": "Love love love this thing....highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Thompson"}, {"rating": 5.0, "review": "Love it. Does everything it's advertised to do. Easy set up, simple to use.", "verified": true, "helpfulness": "0/0", "author": "Bobm"}]