[{"rating": 1.0, "review": "Very Disappointed in the Fire Stick. Replaced by Amazon but never worked.  I spoke with Customer Service on four different occasions and they were unable to resolve the issues.  The Fire Stick is so slow that the network \"times out\" and the connection is lost.  The first Fire Stick never got past the \"looking for updates\" step.  The second (replacement) Fire Stick did load the updates, but could never get past the Home Page.  Every time I would navigate to browse content the connection was lost.  I had the Amazon Fire App on my Android, and while it was able to connect to my Fire Stick, only the \"Home\" and \"Back\" commands worked.  I was unable to use the keypad to sign in to my Netflix account because the \"Connection Lost\" error just kept coming up.  I talked to my Internet provider and there was no router restrictions on the number of devices it was supporting or the bandwidth.  I have never had Internet connection problems on my other devices, including streaming content to my PC or to my Kindle Fire.I ended up returning the Fire Stick to Amazon for a refund.", "verified": true, "helpfulness": "1/3", "author": "D. Kiker \"DK\""}, {"rating": 4.0, "review": "I like everything about it except movies buffer like crazy.Edit:  I was having trouble with my wifi dropping out.  I did some research and this solved the problem:Go to your router settings and select a channel other than the default \"auto\".  So many people use the same channels that apparently there is interference.I did this and it worked!", "verified": true, "helpfulness": "0/0", "author": "N. Clarke"}, {"rating": 2.0, "review": "Here's the deal, it refuses to log on to my account using my email address and password, my Roku does and other devices I use my prime account on.I am hoping an update fixes it.One thing I have not yet tried is disabling WPA on my router and seeing if it connects, it seems to connect with WPA but no way to tell what IP address it has taken other than check the DHCP list on my router.", "verified": true, "helpfulness": "0/0", "author": "dnob"}, {"rating": 5.0, "review": "The interface is really nice and it's not laggy  at all, got shipped to my home earlier than expected. Android mirror works great, want my laptop to mirror but has issues although.", "verified": true, "helpfulness": "0/0", "author": "rpinoys13"}, {"rating": 2.0, "review": "Right now I am pretty disappointed. Stuttering audio makes shows un-watchable.  I tried Prime Video and Netflix.  On both the audio stuttered every few seconds. I then used my Chromecast to watch the same show on Netflix and it worked perfectly. I'm assuming I got a lemon. I've contacted Amazon and am waiting on a resolution.Comparison to AppleTV:I tend to think of gadgets in terms of \"Can my mom do this without calling me?\"Based on that I think the Apple TV interface is easier to use. Its a lot easier to explain to your mother over the phone to navigate the big Netflix button on the screen(AppleTV) than it is to say \"I haven't watched Netflix in a while so navigate down to the app's section and click to the right then find the Netflix app\"(Fire Stick). Using Netflix is much harder on the Fire TV. Prime content is not really an option (unless you Airplay it from the app) on an Apple TV.With regards to how easy it is to find prime content, intermingled in is paid content. I put a pin code on my mom's because it seems like its really easy to think something is on Prime when it isn't. I was nervous about her buying shows and not really realizing it. With the AppleTV you wouldn't have to worry with that as much.The Fire TV stick does have an RF remote. Apple TV has an IR remote. Its really nice that I don't have to have a line of sight.Set up was really easy for the Fire Stick. Pretty close to plug and play. The video at the beginning was a really nice touch.Chromecast: I prefer the Fire Stick to the Chromecast. You'll never explain how to use a Chromecast to your mother over the phone. Don't even attempt to explain how to set one up initially. Chromecast are better if you enjoy gadgets and want to watch a show on ABC.com or something when its not on anther streaming site or you want to project your desktop onto your TV.", "verified": true, "helpfulness": "0/1", "author": "Rusty T."}, {"rating": 3.0, "review": "I had difficulty getting it set up as it froze frequently and the remote randomly drops out.  When it works fine, it's pretty great.", "verified": true, "helpfulness": "0/1", "author": "Andrew"}, {"rating": 4.0, "review": "It was works great, I wish it came with the voice recognition control", "verified": true, "helpfulness": "0/0", "author": "Joshua Erazo"}, {"rating": 3.0, "review": "It works fine for what it does. I was hoping it would work through my AV receiver (a Denon 3311) but no such luck. I have to attach it to the only other HDMI port on my TV, and then run a separate digital coaxial cable from the TV to the receiver to get surround sound. Then it needs to get power from a micro USB cable. Would it really have killed them to make it a tiny bit bigger so it could hold a couple of watch batteries? The purpose of having a device that small is sort of defeated if you still have to plug it in.The only streaming service I use, other than Amazon Prime, is Vudu, and this does not support that at the present time. I have not had it very long, so haven't played with it much, but I have noticed several movies did not have any audio. This might be a result of the settings in the TV or receiver due to the way I had to install it above. I got in at the beginning when they were offering it to Prime member for only $20, so I can't complain, I guess, but I don't think I would have paid $40 for it. Compare to similar products from Roku and Chromecast for something that fits your needs before buying one.", "verified": true, "helpfulness": "0/0", "author": "Christopher Mark"}, {"rating": 5.0, "review": "Amazing!", "verified": false, "helpfulness": "0/0", "author": "Texico"}, {"rating": 2.0, "review": "The UI was pretty disappointing. The fact that you have to go download other 3rd party apps and get emails confirming that you downloaded them is really lame.I had pretty high hopes off of this but failed to deliver.", "verified": true, "helpfulness": "0/0", "author": "Todd J. White"}]