[{"rating": 4.0, "review": "easy set up  and easy to use.", "verified": true, "helpfulness": "0/0", "author": "DMC"}, {"rating": 5.0, "review": "No more Redbox for me!  I can watch movies, shows, videos in the comfort of my home.  Thank you Firestick, for saving me lots of money!", "verified": true, "helpfulness": "0/0", "author": "Cathy C. Ostos"}, {"rating": 5.0, "review": "Easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "The Loki"}, {"rating": 5.0, "review": "Great purchase - use it for our outdoor tv - connects to our Wi-Fi and works great!", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 5.0, "review": "This is a great product and works very well.  I like it much better then a Roku device and it appears to stream movies better then my old v2 Roku.", "verified": true, "helpfulness": "0/0", "author": "P. Greco \"Film, Photography, Technology & Book Aficionado\""}, {"rating": 5.0, "review": "For those of you who love movies when you have the time this device AMAZING!  Time is precious and being able to unwind when the moment is available is something to be grateful for.  Thank you AMAZON.", "verified": true, "helpfulness": "0/0", "author": "D"}, {"rating": 5.0, "review": "Bought this for my daughter as a present and she loves it. It was easy install", "verified": true, "helpfulness": "0/0", "author": "kitty"}, {"rating": 5.0, "review": "With cable TV costs going up and up every 6 months to a year, I have decided to give the Amazon Fire TV Stick a try.  I first bought one from a local electronics store a few months ago to try. Installation was easy and quick.  The online install guide was very helpful.  I was up and watching some Prime movies in no time. I like the fact that I was able to set a password for parental control.  The biggest hit for our family is the Prime music.  It plays all the music on my Prime music playlist but I can also pick a genre to play any time we want to have music in the background (instead of watching TV).  My son watches a lot of movies on Netflix and this Fire Stick did not disappoint.  I also installed the yoga app so I can do yoga whenever I want to.  We love this Fire TV Stick so much that a 2nd one was purchased on Amazon.com so we can put one in the bedroom TV (the first one is in the kitchen TV).  I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Luvmyshelties"}, {"rating": 3.0, "review": "It's convenient to have access to all of these apps on my non-SMART TV.  However, I am a little disappointed in this device based on the problems that I've experienced with it, especially since it came from a company that I love.The Fire TV stick seems to \"hang\" sometimes, where it thinks it's connected to the internet but won't load anything, or it flat out won't connect to the internet even though the rest of my devices are connected.  Oftentimes using the software restart function doesn't alleviate the problem, and I'm forced to disconnect and unplug the fire stick from the TV and AC power manually in order to get it working again.  I've had to do this about a dozen times in the month that I've owned the device.Also, I'm using the PIN parental feature to prevent my children from purchasing anything on Amazon TV; however, the feature won't let them select shows and movies that are free with my Prime membership, either.  This requires me to go up and enter my PIN number every time they want to watch a free show on Amazon Prime, and it's highly annoying!I'm coping with these problems, but I definitely wonder if competitor devices would work better and have fewer problems....", "verified": true, "helpfulness": "0/0", "author": "Jeremy Briant"}, {"rating": 5.0, "review": "IMPRESSED!!!!!  This was soooo easy to set up and all the programming you get...AMAZING!!!!  Can't wait to try it out next summer as we travel across this great country !!!", "verified": true, "helpfulness": "0/0", "author": "Judith Quinn-Goff"}]