[{"rating": 3.0, "review": "I don't hate it, but it's very hard to like. Have yet to be able to stream an entire movie or song. Our router sets just 3 feet from the stick, so that's not an issue. We can watch Prime or Netflix on any other device in any room with no issues. So, it has to be the stick.Thought about sending it back, but I really don't need it. It was more of a convenience to give the game systems a rest every now and then.And I can not remember if it says anything about gaming or apps. But, don't bother. The games really aren't free. They give you a trial and then you have to pay to actually acquire the game.", "verified": true, "helpfulness": "0/1", "author": "Scott"}, {"rating": 1.0, "review": "So far no. I bought it to stream a continuous you tube channel and it ends up stopping and spinning after about an hour", "verified": true, "helpfulness": "0/0", "author": "Brien Shamp"}, {"rating": 5.0, "review": "Excellent,  but need more apps that we can use out of the US.", "verified": true, "helpfulness": "0/0", "author": "Eddie J. Loria"}, {"rating": 5.0, "review": "Bought this when it was first introduced and considering replacing a roku in another room now as this is far superior!", "verified": true, "helpfulness": "0/0", "author": "Limited"}, {"rating": 3.0, "review": "The  remote was difficult to use. I am a senior citizen .", "verified": true, "helpfulness": "0/0", "author": "martha"}, {"rating": 2.0, "review": "For years I have been telling people that a company having the best product on the market doesn't always mean they have a great product. It simply means their product is better than the others available but can still be a bad product because the others are even worse. It's like being Moe Howard. You're the head Stooge but you're still a Stooge nonetheless. I have no idea if Amazon Fire Stick is the best because I'm not buying Google, Apple or Roku now to compare them all but it doesn't matter anyway. What I do know is this isn't a good product. I usually go into great detail when reviewing anything but if I listed all the problems with this, I'd be writing until next week. The site and company that sells a product such as this where you use other parties' services and streams or whatever is always going to blame your ISP, the services that aren't them and throw out all kinds of other smoke screens to make it seem they have no responsibility at all in their product not coming close to doing what it says it will do. Smoke screens because they're the ones giving you this alleged magical product that will allegedly allow you to use all these apps and services at the same time saying the fact that you can't isn't their fault. How does that make any sense at all? It's like selling basketballs that assure buyers of 100% field goal percentage then blaming you not shooting 100% on the court you play on, the basket, the backboard and the strength of your opponent as if those things aren't considerations at all for the magic basketball makers when they promise you'll never miss. You would shoot 100% if it weren't for those other things. Internet and electronic companies selling you something promise you the moon at the same time acting like all the conditions and factors they know make it impossible for them to deliver on their promises exist and knowing they're misrepresenting their product. Like how your ISP promises you a speed and you never actually get that speed and then they point you to legaleze that they think makes it OK that they lied and falsely advertised their service. I tell you I'm giving you a hundred dollar bill and I give you a 95 dollars I just lied to you. This device saying you can stream services at the same time saying if you can't tough luck you already paid for it. The ISP blames the devices and services. The services blame the ISP and device. The device manufacturers blame the ISP and services. Nobody takes the blame and meanwhile no consumer comes close to getting what they paid for. It's a great scam. It's totally illegal but it's a great scam that nobody is going to put a stop to any time soon because consumers getting ripped off online is great for the economy and why both political parties turn their backs to it.", "verified": true, "helpfulness": "0/0", "author": "Jason O'Daniel"}, {"rating": 5.0, "review": "First Firestick in the house. Works very well in a bedroom with wifi router in family room. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Richard Hanzlik"}, {"rating": 5.0, "review": "Great addition to cable TV, especially if you have an older flat screen that doesn't already have Amazon, Hulu and Netflicks already on the menu.", "verified": true, "helpfulness": "0/0", "author": "umberto314 \"Umberto Umbertino\""}, {"rating": 5.0, "review": "This is something a person with prime should have if they want to watch great movies without paying so much.", "verified": true, "helpfulness": "1/1", "author": "sonny reyes"}, {"rating": 5.0, "review": "This is wonderful works great since we moved to an area where we don't get cable, now we can watch netflix anytime we want to watch a movie!", "verified": false, "helpfulness": "0/0", "author": "Anitra Dubreuil"}]