[{"rating": 5.0, "review": "My favorite thing since Betty White!!  We have no connection problems like people have reported.  I've never had a problem with keeping network.  The remote is small, so it is lost easily in my house!  The plus side to this is, you can work the fire stick from an app that is available for just about any phone or tablet!  I've had to do this a couple times, but luckily we've found the remote each time :)", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "MILO"}, {"rating": 5.0, "review": "The Fire TV Stick is great!  It seems to do everything I could want from a streaming device. Installation and setup was quick and easy. The interface is clean and fast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 5.0, "review": "very good product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"the Queen\""}, {"rating": 5.0, "review": "I love this product.  I use this when I travel since I am a Prime Member and have Netflix as well.  I am able to watch movies on the TV without having to deal with trying to find something to watch on regular TV.  I sometimes have \"challenges\" when it comes to technology but I am able to use this without issue.  This is now one of my travel essentials when packing for business trips.", "verified": true, "helpfulness": "0/0", "author": "Tmrodgers"}, {"rating": 5.0, "review": "A home run for Amazon. Better than iTV and at half the price. I even like the remote better. Kudos!", "verified": true, "helpfulness": "0/0", "author": "jbrant"}, {"rating": 5.0, "review": "I really liked the Amazon Fire Stick. I enjoyed it very much.", "verified": true, "helpfulness": "0/0", "author": "Eva Montrose"}, {"rating": 4.0, "review": "Love love love it! I was going to get Apple TV but the price turned me off. Works better than expected. Picture is great!  Although, I have a slight problem. It will not except my flixter account. I can start my flixter on all my other products but this. I wish it had vudu instead. Will get more for my other rooms.", "verified": true, "helpfulness": "0/0", "author": "S in Lexington,Ky"}, {"rating": 5.0, "review": "Love this thing! It has far more apps than I had initially expected! Well worth the $39!!", "verified": true, "helpfulness": "0/0", "author": "Stephen F. Harrington"}]