[{"rating": 5.0, "review": "We needed a simple way to add our movie accounts and other streamed content to the bedroom TV and the Fire TV Stick worked perfectly.  Be aware that some of the available content is not closed captioned but that is not a fault of the device it is the content provider's.", "verified": true, "helpfulness": "0/0", "author": "IT/AT"}, {"rating": 2.0, "review": "I really wanted to like the Fire TV Stick. I have everything Amazon except the phone but this just has had too many problems and I've spent hours on the phone with customer support and it still doesn't work as expected. I should have gone with a Roku. For whatever reason the stick doesn't communicate well with any remote, I've had 3 different remotes all with the same problem, sometimes it responds, sometimes not, sometimes it acts like I hit a button several times when I only hit it once which makes entering any text or numbers almost impossible, just getting the thing set up was a nightmare. Amazon seems to think the problem is the remote so they keep sending me replacements. Clearly this stick is a lemon and I wish I could just return it.", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 5.0, "review": "I'm still trying to get the \"hang\" of typing my title into the top - have to begin again, A Lot! - am not used to this as I don't text - but I love having the world of YouTube at my disposal!!  I haven't watched anything else!!  A dream come true once I really learn how to use the site--Thank You Amazon!", "verified": true, "helpfulness": "0/0", "author": "D. MacDonald"}, {"rating": 5.0, "review": "The best there is.", "verified": true, "helpfulness": "0/0", "author": "P. Rodriguez Jr. The Mechanic \"Peterod\""}, {"rating": 4.0, "review": "Extremely easy to set up, and very easy to use. Love it", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Eye was very surprised at the channels and that eye was able to add more channels with out paying a high price. Thanks Amazon, good looking out.", "verified": true, "helpfulness": "0/0", "author": "Teraloveme922"}, {"rating": 1.0, "review": "Complete piece of s*** do not buy this it will lad at 25% for 10 min and then tell you it can't play!  I can watch everything on the computer and Xbox fine so I know it's not the InternetComplete garbageNeed my money back", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "I'm REALLY enjoying the Fire TV Stick!  I ordered it through my regular Amazon account, so it came pre-configured, except for the WiFi connection, but the little set-up that remained was simple.  Initially, I was disappointed to learn that Comcast subscribers would not be able to use the HBO GO app on the Fire TV Stick, but that has since changed, and now I've got pretty much all of the streaming service I use dialed in to my Fire Stick.  I'm using Netflix, HBO GO, Hulu Plus, and of course, if you're a Prime member there are about a bazillion movies available on Amazon Instant Video.  I was rockin' the Google Chromecast before I got the Fire Stick, and I was hugely disappointed as Chromecast is utterly incompatible with Amazon Instant Video, which is cheaper for PPV rentals.  The lack of a remote with the Chromecast was also problematic for us, as the smartphone apps didn't always assure compatibility, and there are technology-deficient people living in my household.  A remote control is familiar to them, and as a result the Fire Stick gets a whole lot more use than the Chromecast did.  The Fire Stick can also let you play simple games from Amazon's app store, using your remote.This little tiny device is a cord-cutter's wet dream!  Even if you're not planning to get rid of your cable anytime soon, play around with this device for a couple months, and you might change your mind!", "verified": true, "helpfulness": "0/0", "author": "MetalHead"}, {"rating": 5.0, "review": "I bought this for my Dad for Father's Day and he loves it", "verified": true, "helpfulness": "0/0", "author": "Rachelle Johnson"}, {"rating": 5.0, "review": "Great device for making any HDTV Smart!", "verified": true, "helpfulness": "0/0", "author": "Gary H."}]