[{"rating": 2.0, "review": "Would be great if it actually worked without having to hard reboot it every time ( unplug then plug back in ). I have yet to see a post to correct this problem.", "verified": true, "helpfulness": "0/1", "author": "GeorgiaT"}, {"rating": 5.0, "review": "For price and ease of use, I definitely whole-heartedly recommend the Fire TV Stick!I bought Chromecast for my Dad and the Fire Stick for me, and the Fire Stick is definitely the winner in my book. Had it been available when I bought the Chromecast, the Chromecast definitely would have gone back. They offer very similar things, and maybe an advanced user would have more fun with the Chromecast. But when you're trying to help a 64-year-old man use Netflix and HBO Go, the fewer the devices, the better. Showing him how to download the software on his phone and sync it to the TV was way more work than just pointing the Fire Stick's remote at the TV and using menus that look just like cable menus. And now I've downloaded the Fire remote app, so I don't have to go digging through the couch cushions every time the actual remote disappears.Occasionally I have an issue when I've left it on screensaver mode too long: the audio works but the screen is black. Simply unplugging the device and plugging it back in seems to solve the issue. I'll update if it gets any buggier, but I don't anticipate any problems.", "verified": true, "helpfulness": "3/3", "author": "J. Calvert"}, {"rating": 4.0, "review": "Works great, has one of the best interfaces I've seen for a streaming device. Only annoying aspect is how Amazon has a different UI for every app. I don't see why the UI for this Fire Stick can't be applied to the PS4, smart TV etc.", "verified": true, "helpfulness": "0/0", "author": "JCinFL \"JC\""}, {"rating": 5.0, "review": "love it!!! grate price...preorder and save$$$$$$", "verified": true, "helpfulness": "0/0", "author": "MRSR"}, {"rating": 5.0, "review": "I LOVE the Fire TV Stick. It's so easy to connect to a variety of services on a big screen.  Watched some great Smithsonian programs and downloaded cooking classes. I'm enjoying the variety of apps. I have a good stereo and the sound coming out is, as expected, great.My only complaint is the battery compartment on the remote is impossible to open. Fortunately, I was given the voice remote along with my fire stick as a gift, and that battery slot opens just fine.", "verified": true, "helpfulness": "0/0", "author": "Author Ronda Del Boccio \"Ronda Del Boccio, The Story Lady\""}, {"rating": 1.0, "review": "not able to use yet i don't have enought network power to stream any movies.", "verified": true, "helpfulness": "0/2", "author": "Margery Kirby"}, {"rating": 5.0, "review": "AMAZING! I am finding more and more as I explore what is available with the Fire TV Stick. Great picture, easy to use, seamless presentation on every single thing we've watched so far. I have dropped my cable TV service and now use this for all my movie watching and watch news using a digital antenna; I'm saving over $60 dollars a month and really feel like I have more options than I did with the cable line up. A GREAT product!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I have dsl internet about 1 mgps and that's the best offered by Frontier to me. It's not enough to operate Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "Marcus Pete Hoover Jr"}, {"rating": 5.0, "review": "LoveLoveLove it - I wish I had bought a second for the road while they were on sale!", "verified": true, "helpfulness": "0/0", "author": "K. Dalton \"Kari\""}, {"rating": 5.0, "review": "LOVE  LOVE  LOVE!!!!  A must have for any prime members  and movie lovers. Has netflix and prime music.  Works great and can put my photos  on. Just wish had more apps for photos.", "verified": true, "helpfulness": "0/0", "author": "Patricia Morgan"}]