[{"rating": 5.0, "review": "I use it to watch Netflix and listen to Pandora. It works fine for just watching tv.", "verified": true, "helpfulness": "0/0", "author": "Beeza \"vgbaeza\""}, {"rating": 5.0, "review": "Works perfectly. Easy navigation, attractive user interface, quick streaming. I love it", "verified": true, "helpfulness": "0/0", "author": "Dante B."}, {"rating": 2.0, "review": "I'm usually a big fan of amazon products but this one was a disappointment. The interface was slow and when playing a video on any service it would freeze for a second every 10-15min. I put the roku stick in the same room and it worked flawlessly.", "verified": true, "helpfulness": "0/0", "author": "aiden45"}, {"rating": 5.0, "review": "Love that I have everything in one place!", "verified": true, "helpfulness": "0/0", "author": "Deby Pressnell"}, {"rating": 5.0, "review": "Buenisimo", "verified": true, "helpfulness": "0/0", "author": "Neftaly Ruiz"}, {"rating": 5.0, "review": "Above and beyond my expectations. I travel for work constantly and it's fantastic to have something so small provide 100% of my entertainment wants.", "verified": true, "helpfulness": "0/0", "author": "Brandon Griffin"}, {"rating": 5.0, "review": "Extremely pleased with Amazon's Fire TV Stick.  I initially thought I would need to get some extra adapters to connect it to my Samsung big screen TV since I have had the TV for 4 or 5 years.  But the Fire TV Stick plugged right in and in less than 5 minutes I was watching the first  season of Downton Abbey!", "verified": true, "helpfulness": "0/0", "author": "Patti G."}, {"rating": 5.0, "review": "It's really good I'm buy more 😈", "verified": true, "helpfulness": "0/0", "author": "darstivenson"}, {"rating": 5.0, "review": "So easy to use; always fast response when accessed.  Absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Jeanie White"}, {"rating": 5.0, "review": "Very cool, good quality, easy set up, great enjoyment.", "verified": true, "helpfulness": "0/0", "author": "Jorge Vega"}]