[{"rating": 1.0, "review": "I received a Fire TV Stick as a gift; I don't think I would buy one even for that one person who you don't like but feel like you have to buy a gift for anyway. The interface is annoying to use and this fact is compounded by the delay between input and cursor action. The app selection is very basic and is beat by Google and Roku's devices. The only way to get any kind of value is if you have Amazon Prime, but even then your selection is limited compared to Netflix. To top everything off, this thing will barely stay on. There are times where after turning the TV on, I have to wait upwards of an hour or more for it to decide to stop constantly restarting and stay on.", "verified": true, "helpfulness": "0/1", "author": "Adam Britt"}, {"rating": 4.0, "review": "This little gadget is great! I am a Prime member and I also have Netflix. There is a ton of other programming that you can get as well. I wanted it for my bedroom tv so I could watch movies when I went to bed. It hooks up so easy, just plug it in and put the tv on the right source and you are going! Love it so far!", "verified": true, "helpfulness": "0/0", "author": "Checheetah A Courtney"}, {"rating": 1.0, "review": "Firestick won't work anymore.", "verified": true, "helpfulness": "0/0", "author": "joseph liquori"}, {"rating": 1.0, "review": "Borders on worthless.  In the evening it just keeps rebuffing…Samsung WiFi DVD much much more usable all the time on same LAN", "verified": true, "helpfulness": "0/0", "author": "Fred"}, {"rating": 4.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "grannybear"}, {"rating": 5.0, "review": "Fire stick is great, getting it to the house was a disaster. When the first one didn't make it to the house customer service tried to make me feel like they were doing me a favor by sending another one. Won't be ordering to much from them if at all in the future.", "verified": true, "helpfulness": "0/0", "author": "Daniel Chiswell"}, {"rating": 5.0, "review": "Very satisfied w/ stick. I am not tech wavy & it was easy for me to set up. We use it on our larger, not so smart, TV to access Netflix & Hulu. The sound is better than normal use of TV & saves having to buy a new TV. A good buy.", "verified": true, "helpfulness": "0/0", "author": "richard h. young"}, {"rating": 4.0, "review": "Very pleased,  easy to connect,  arrived when you said.", "verified": true, "helpfulness": "0/0", "author": "Mary Diebold"}, {"rating": 5.0, "review": "i love it. easy to use", "verified": true, "helpfulness": "0/0", "author": "greg"}, {"rating": 5.0, "review": "I got this because my daughter in law has one.  After going on vacation with nothing much to watch on TV, I thought it was time to get my own.  It's easy to install, easy to use and great selection.  Thank you!", "verified": true, "helpfulness": "0/0", "author": "Denise M"}]