[{"rating": 5.0, "review": "Awesome, much better than Apple TV (which I also own but don't use any more)", "verified": true, "helpfulness": "0/0", "author": "D. Hudson"}, {"rating": 5.0, "review": "Awesome changed my tv watching!", "verified": true, "helpfulness": "0/0", "author": "anthony cardenas"}, {"rating": 5.0, "review": "works great. it's exactly what i expected. took 1 min to set up, very easy to use, my young kids  can use it with no problems.", "verified": true, "helpfulness": "0/0", "author": "teresa holldorf"}, {"rating": 5.0, "review": "Love this pretty much replacing cable with this beautiful as soon as my contracts up I'm gone. Everything expected m more!!!! Ordering the gaming controllers soon . It's a must buy . Down side u need a Hulu or Netflix for some  shows  but it's a small trade off.", "verified": true, "helpfulness": "0/0", "author": "Tiffany D."}, {"rating": 4.0, "review": "Powerful device. Especially for its price point. Love it", "verified": true, "helpfulness": "0/0", "author": "Tamoor Mirza \"Tamoor Mirza\""}, {"rating": 5.0, "review": "Everything was as expected", "verified": true, "helpfulness": "0/0", "author": "Rhea Painter"}, {"rating": 5.0, "review": "Love how easy it is to use and the remote!", "verified": true, "helpfulness": "0/0", "author": "abutterfly687"}, {"rating": 3.0, "review": "Plusses and minuses to this item.  Setting it up took some work, it loses the internet signal frequently despite being very close to the router.  The HDMI stick is rather long so if your tv is mounted on the wall it may take some finesse and rearranging.  The power adapter to the stick is very short so if your tv is mounted on he wall you need to figure out a different power option. (Extension cord? Ugly.)  I'm working on a solution to that now :( Variety of shows is pretty good but the remote is not the greatest, especially for searching. I may need to suck it up and buy the voice remote :(", "verified": true, "helpfulness": "0/0", "author": "Dragonfly3085"}, {"rating": 5.0, "review": "Love it - perfect addition to any Smart or non-smart TV.Some apps (i.e., HBO Go App) are really laggy and don't run well on it.  I don't think this is a fault of the stick, but moreso the app not being optimized for the stick.  Netflix and games and other apps run just fine.  Really wish the Music section had Stations, but hopefully that comes shortly, as it is now on the app versions.", "verified": true, "helpfulness": "0/0", "author": "Tom Coran \"Tom\""}, {"rating": 1.0, "review": "I've had two of these and threw them both in the trash. You basically have to set it up within 3 feet of your router (and I have a good router) or you will constantly disconnect. PLEX is a gittering mess and Netflix plays only at the lowest quality. Yes, I have very fast internet.", "verified": true, "helpfulness": "0/0", "author": "Hernan Dreispiel \"Hondahunter2101\""}]