[{"rating": 4.0, "review": "Great system so far, but the remote control is very, very hard to open.  Had to go to Youtube and watch a girl open with a screw driver.", "verified": true, "helpfulness": "0/0", "author": "Happy daughter"}, {"rating": 2.0, "review": "Just wasn't for me.  I got it mostly for SlingTV which actually didn't work all that well.  I returned it.  I also thought it was kind of slow.", "verified": true, "helpfulness": "0/0", "author": "ana"}, {"rating": 2.0, "review": "The fire stick has connection issues often when no other device in my house has any at all.  When it decides it will have issues nothing fixes it.  I wouldn't recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Travis Bluedorn"}, {"rating": 5.0, "review": "Tried to use in Mexico but there was an issue with the license. Brought it back to the USA and no problems!! Easy to set up and very happy with the purchase. Marty", "verified": true, "helpfulness": "0/0", "author": "MartyThomas"}, {"rating": 4.0, "review": "Simple to assemble and set up.  My only \"complaint\" is in the amount of free content.  I was under the impression there would be a lot of free content, since I have a Prime membership.  Often times, only one episode of a series is free, and the rest are $1.99 per episode.  Kind of frustrating.", "verified": true, "helpfulness": "0/0", "author": "Sharon A Hostetler"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Shylah"}, {"rating": 5.0, "review": "Great entertainment, all you need.", "verified": true, "helpfulness": "0/0", "author": "Luz elena rosario"}, {"rating": 4.0, "review": "This is a great product. I did not know that being a Amazon Prime users I was entitled to some additional content which was a very nice surprise.I do miss a browser to unlock the full potential of wifi on a tv, but overall the type and quality of content available is competitive for its segment. There's plenty of other more expensive alternatives but pricewise this is some of the best value for money.I would definitely recommend. I just miss a built-in web browser which would unlock it's full potential.", "verified": true, "helpfulness": "0/0", "author": "Fabio"}, {"rating": 5.0, "review": "Works really well", "verified": true, "helpfulness": "0/0", "author": "Armando Sanchez, Jr"}, {"rating": 5.0, "review": "Love it. Easy as pie to set up and the working menu is one of the best. We are totally happy with it and just wish we had done it earlier.", "verified": true, "helpfulness": "0/0", "author": "NTH \"NTH\""}]