[{"rating": 5.0, "review": "Great, though I don't notice any difference from my chromestick.....maybe its because I dont have a amazon membership anymore.", "verified": true, "helpfulness": "0/0", "author": "H"}, {"rating": 3.0, "review": "It's a decent device. Prime movie selection could be better and MLB.TV app is useless on this. Constant buffering. This needs to be fixed. Never had an issue with this on AppleTV.", "verified": true, "helpfulness": "0/0", "author": "jaymo29"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I had it for three days and haven't stopped watching Netflix. I only watched Netflix and youtube so far but love it.", "verified": true, "helpfulness": "0/0", "author": "rochelle bustillos"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Joyce W. Ryals"}, {"rating": 4.0, "review": "We liked Amazon's Fire TV Stick enough to buy a second one a month later.The Fire Stick has much better clarity than our Roku HD does. Since I fall asleep to Netflix, I like that the Fire Stick Netflix app keeps playing one after another. That's another thing that the Roku Netflix app didn't do.There are a couple of glitches. The Fire Stick doesn't do a very good job of stopping apps running in the background. For example, if we switch from listening to Pandora to watching a movie, we end up with terrible lag. Sometimes, the music keeps playing while the movie is running. Likewise, the sound will sometimes run while the picture is still loading.We've found that forcing a restart fixes this every time. (Have you tried turning it off and on again?) :-) We end up having to restart about once a day. More on one of our Fire Sticks than the other. Strange, but not big enough of a deal to make us want to find something else.We're pleased.", "verified": true, "helpfulness": "0/0", "author": "Mandy"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Dee B"}, {"rating": 5.0, "review": "I should have purchased this long ago. It is amazing. It took me 10 minutes to get it going. If you have Amazon Prime, this is a must have for the price and what you can do on it.", "verified": true, "helpfulness": "0/0", "author": "Shellie"}, {"rating": 5.0, "review": "User friendly, very easy to navigate", "verified": true, "helpfulness": "0/0", "author": "M. Jacka"}, {"rating": 5.0, "review": "This thing is awesome! I was really skeptical because of all the mixed reviews but I ordered it anyways. As soon as I got it I plugged it in to my tv and bam it worked. It was seriously the easiest thing to set up. I really don't understand why anyone is having trouble with it. The streaming is fast, it never lags, and the HD quality is on point! Don't listen to the naysayers the is was the best 35 dollars I have ever spent!", "verified": true, "helpfulness": "0/0", "author": "Ali"}]