[{"rating": 5.0, "review": "Pretty cool and fast, there's pretty much no loading, movies just play.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product; easy to use, wide selection.", "verified": true, "helpfulness": "0/0", "author": "C.E.Carter"}, {"rating": 2.0, "review": "I was almost about to return this, but then I discovered other way to use this Fire Stick on Internet and then I decided to keep it. I have roku and this does not meet my expectations as with roku.First is available apps. Very limited when compared to Roku. Some of the apps just don't work, for example DailyMotion. There is no clean way to stream/cast my internet videos from iPad or android to Fire Stick. I am not talking about mirroring, but sending video urls to stick to be played on big screen without using your other device to keep running as server. There are many AirPlay like apps available, none of them works smoothly. All hit and miss. There is mirroring option but limited to only certain android and fire devices.I hate the home screen. No way to customize it. I just want to see my all apps on home screen, but I have to scroll down several options. Compared to roku, I felt that wireless speed is low. Good try but I think product and apps need time to mature. For some reason my remote is too sensitive. Only one press perfor several press on my fire stick.Good part, once you find out way to customize it, it's worth it. Remote is very slick looking and cool. Build quality is comparable to Apple. Feels and looks very nice and very high quality product.", "verified": true, "helpfulness": "0/0", "author": "mkn"}, {"rating": 5.0, "review": "Excellent buy.  I would highly recommend it to everybody.  A lot of everything including lots of movies I've never heard of but wind up spotting how some of our current stars got their start. Easy to install and start up, even for an old man like me and I love the way it learns what you like and will show you other movies in the same genre. Only mistake I made was not ordering the voice control model.$39.00 vs $79.99.  Not only for lazy people but us senior citizens who can hardly feel in our fingers and have a tough time navigating a wheel and hub remote.  But there is an online app that will take voice commands and become a remote remote! Haven't stopped watching Downton Abbey since I got it.  If you need more I'll be happy to answere any and all questions.", "verified": true, "helpfulness": "0/0", "author": "Alabamamex"}, {"rating": 5.0, "review": "Set up was quick and simple and the Fire TV Stick helped improve a problem I was having while watching Netflix. I kept getting a \"loading\" message frequently on my Vizeo TV and sometimes had to restart a show. I tried changing settings in my Belkin wireless router but that didn't seem to help. The Fire TV Stick seems to help resolve the problem even though it still happens but it's far less often. The navigation interface is also much better then the Vizeo navigation.", "verified": true, "helpfulness": "0/0", "author": "Torin A. Campbell"}, {"rating": 5.0, "review": "This thing is awesome.  I have 2 of them and both work great.", "verified": true, "helpfulness": "0/0", "author": "Jeff Pynenberg"}, {"rating": 5.0, "review": "It is great.  I just installed the XBMC and started to watch movies.", "verified": true, "helpfulness": "0/0", "author": "Phi Le"}, {"rating": 5.0, "review": "Works great and its saving us from getting another box and connection from our Fios server.", "verified": true, "helpfulness": "0/0", "author": "Christine Joyce \"Cj\""}, {"rating": 5.0, "review": "Excellent. No extra wires", "verified": true, "helpfulness": "0/0", "author": "james  matthews"}]