[{"rating": 4.0, "review": "Interface seems a little sluggish, but it works and has support for all the major things a chromecast can do. Controller is very nice to have as well.", "verified": true, "helpfulness": "0/0", "author": "Calvin M Siemandel"}, {"rating": 5.0, "review": "It was so easy that it seemed too complicated!  It seemed like there had to be more to the directions than what was sent.  There wasn't.  It really is as easy as indicated from the description.", "verified": true, "helpfulness": "0/0", "author": "CMBeachMum"}, {"rating": 5.0, "review": "so simple yet so powerful. everyone without a smart tv should have one.", "verified": true, "helpfulness": "0/0", "author": "jmal"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Michael R Brook"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Shantiera"}, {"rating": 5.0, "review": "Very happy with the purchase of this Fire TV stick", "verified": true, "helpfulness": "0/0", "author": "Steve W"}, {"rating": 5.0, "review": "Works fantastic! Exactly what we needed for our extra TV.  No need to buy another cable box! So easy to use, even for my kids.", "verified": true, "helpfulness": "0/0", "author": "Taryn Young"}, {"rating": 2.0, "review": "The device would be exponentially better if they improved the wifi connectability. It seems that if the fire stick is not within a 5 foot proximity to a router, it will drop connection intermediatly. I would also make the recommendation of better organizing the user interface. The app selections of the fire stick are what makes the device. I just wish the apps could be organized more like a Roku or AppleTv. The Prime and PPV selections are a mess. Tighten it up!With all of that said, the device really has potential and the price point is great.", "verified": true, "helpfulness": "0/0", "author": "Zach Foshee"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "neana"}, {"rating": 5.0, "review": "works great  ..", "verified": true, "helpfulness": "0/0", "author": "Gregory M Sullivan"}]