[{"rating": 4.0, "review": "So far so good!  Very easy to use will be 5 stars once HBO Go is added.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Bartz"}, {"rating": 5.0, "review": "OMG, love this!  I also have the Fire TV which is in the living room. I have the stick on the TV in the kitchen and it works fabulously. i downloaded the Fire Remote App and can use my smartphone as a remote. Will be getting this for a friend for Christmas.", "verified": true, "helpfulness": "0/0", "author": "Rosebud \"Rosebud\""}, {"rating": 5.0, "review": "Awesome - love this product.", "verified": true, "helpfulness": "0/0", "author": "Tracy Vanderlip"}, {"rating": 5.0, "review": "Works well.  Wish it had HBO Go, but I knew it didn't when I bought it.", "verified": true, "helpfulness": "0/0", "author": "Chris Clare"}, {"rating": 3.0, "review": "Easy to install and setup, (update took 10 minutes right off the bat) For amazon prime content the loading is fast to non existent (our internet is 60mb down 4mp up)Our Kindle Fire HD has Disney apps ESPN apps and even our cable company app which all work great. The Fire stick has the same APPS BUT we cannot choose our cable provider (CHARTER) to access them, not , listed (Coming soon).The Fire Stick Remote control application for phones and tablets is not available on AMAZONS OWN KINDLE FIRE HD. (Or my windows 8 phone)Our Roku still beats any streaming device out there I can do all of the above (even amazon prime) on our roku.Couldn't pass up the $20 price, unless they improve access for my cable company soon! then it was a poor purchase even at $20", "verified": true, "helpfulness": "0/0", "author": "Myfender"}, {"rating": 5.0, "review": "This thing (out of the box) is superior, so far, to any other set top box streamer device I've had thus far.(Note, I've had a total of 8 before this including the following: Roku 1, Roku HD, Chromecast, Xbox 360, Wii, Belkin something or other, WDTV Live, and a Sony Google TV.)The fact that it's loaded with ample memory and storage space is a big one. Also, it supports Miracast. This is big as I also have an Nvidia Shield. The apps available already are pretty great as well. Looking forward to playing You Don't Know Jack with my family tomorrow at Thanksgiving.Navigation is a bit different. It's very Amazon-centric (big surprise there huh?) and you have to navigate to find your hulu+, Plex, and other apps to stream. The good news is that they're pretty much all there. Including Disney channels and more that you can watch live stuff on.I'm really looking forward to trying out some light gaming on it as well as utilizing my iPhone as a voice search remote when that's made available.", "verified": true, "helpfulness": "0/0", "author": "Kyle Trail \"ultimate techno nerd\""}, {"rating": 3.0, "review": "I picked up one of these to add Plex and Netflix to another TV. Netflix works great, as does this little device, but Plex is horrible for this. Sadly, I didn't do my research before buying the device, but at $19 how was I going to pass that up? Regardless, for $19 it's a great little device to add Netflix or Prime streaming to a spare TV in the house, but I wouldn't use it as my main streaming device for my main TV.", "verified": false, "helpfulness": "0/0", "author": "gldoorii"}, {"rating": 4.0, "review": "As an Amazon Prime member, the initial $19 offer for this full-featured streaming stick was too good pass up.Setup was not quite as easy as Chromecast. You just plug the Chromecast into an HDMI port, plug its power cable into the USB present on most HDTVs these days, and you're done. The Fire TV Stick requires you to plug its power cable into a wall outlet. I found that the Fire TV Stick would power on if plugged into a USB port on the TV, but it would not update its software and was of limited functionality until plugged into a wall outlet. My assumption is that the Fire TV Stick requires a wall outlet becuase the more powerful processor in it requires more power than a USB port can supply and/or wall outlet power allows the Fire TV Stick to be powered on at all times, whereas a Chromecast powered by a TV USB port is only powered on when the TV is powered on. Just be on notice that you cannot use the Fire TV Stick without plugging it into a wall outlet.If you can accept the power limitation, the Fire TV Stick is otherwise superb. It operates with the same interface as Fire TV, its processor is plenty quick, and it comes with a controller that is the same as Fire TV's minus the voice search button. With the Fire TV Stick, Amazon apparently wants users to download the Fire TV Remote App and do voice searches through their phone. Of course, in my opinion, the number one selling point of the Fire TV Stick is its ability to stream Amazon Prime Instant Video and Amazon Prime Music. Chromecast, on the other hand, is crippled by its lack of official Amazon Prime Instant Video support.", "verified": true, "helpfulness": "0/0", "author": "Aaron M"}, {"rating": 5.0, "review": "I've just barely scratched the surface of what this can do, but I love it so far! Such a great purchase, and I can't wait to see what more is in store. I like this so much better than Google Chromecast, mostly because of the Amazon Prime subscription. Very affordable way to stream media. Setup was super easy, too. Way to go, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Sarah Grabowski"}, {"rating": 5.0, "review": "Being a little tech savvy and open minded can let you see the potential of the stick.The ability to side load apps sets it apart from the roku stick and chrome. Adding xbmc / kodi to the stick opens up a world of potential with its countless addons. Also, for those with a networked or wireless hard drive like seagate's wireless plus with its 1 or 2 TB capacity, you can stream your entire movie collection (mp4, avi, and mkv) formats using an app like bsplayer or vimu player using the no brainer adbfire app for apk files. I've got a 1tb wireless plus running movies this way and it works flawlessly. Also works with my google music collection using an add-on in xbmc.Yes, it needs HBOgo as an app and yes the interface can be a heck of a lot easier when accessing sideloaded apps, but those that can't see the potential of this from what it offers straight out of the box are really missing out on features that surpass the roku stick on what it's capable of. I know, I own the roku stick as well and what it offers, it does well, but then things become limited if you want to expand it's potential, plus it's slow as hell.Bottom line, if you only see what you get right out of the box, the you probably won't be bowled over. Do some internet research on what the fire TV and fire stick has to offer outside the box and you'll be impressed.", "verified": true, "helpfulness": "2/2", "author": "VAM"}]