[{"rating": 1.0, "review": "I did not have good luck with Fire stick. It froze constantly every 10 seconds. I had much better luck with Roku.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Watch something on it every night.", "verified": true, "helpfulness": "0/0", "author": "sheilagal1"}, {"rating": 5.0, "review": "Love this thing.", "verified": true, "helpfulness": "0/0", "author": "Meredith D. Dawson"}, {"rating": 5.0, "review": "One of the best setup processes EVER in an electronic product.  It arrives signed into your specific account, and the video walkthrough makes setup a breeze.  Great interface as well.  As a bonus, if you download the \"Fire TV\" app, you can use voice searching through your phone, which works wonderfully.  The price can't be beat.  I will be purchasing a couple more of these to add to our other TVs.", "verified": true, "helpfulness": "0/0", "author": "D. J. Woods \"Mom of Three\""}, {"rating": 5.0, "review": "THIS IS A GREAT BUY! I LOVE IT I HAVE FOUND MYSELF A NEW TOY AT 71 YEARS OF AGE.", "verified": true, "helpfulness": "0/0", "author": "lester gorham"}, {"rating": 5.0, "review": "Easy to set up, especially if you if you already have Amazon account (less info input). We got the the Amazon Fire TV Stick to replace our Wii for watching Netflix. It makes watching Netflix so easy, in addition to the other program options !!", "verified": true, "helpfulness": "0/0", "author": "Carol Borradori"}, {"rating": 4.0, "review": "The fire stick does everything as advertised, which by itself is incredibly impressive, but add that value at the low cost and it is amazing. To be fair, we only use this in a seldom used guest room, and have similar features of the fire stick embedded in our main TVs via either a Blue Ray player, PS3 and even to some degree in our smart TV, but in the guest room we wanted simple with no additional wires. And there's the kicker. No additional wires dropped this little device to 4 stars versus 5 because what I didn't know was that the stick does not pull power from the TV like a USB might. So, I have a beautifully simplistic TV hung on a wall over a fireplace, and an ugly little micro-usb power cable from the stick to the nearest outlet. (The cable was not long enough to run through the wall like the tv power)", "verified": true, "helpfulness": "0/0", "author": "Art School Ranger"}, {"rating": 3.0, "review": "Only useful if I watch dramas/movies from Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "yan c"}, {"rating": 5.0, "review": "Easy set up.  Fast shipping(Amazon Prime--of course).", "verified": true, "helpfulness": "0/0", "author": "Marion R."}, {"rating": 5.0, "review": "Great product. Easy access to Netflix and HBO Go.I just wish my ISP would stop limiting my data streaming.", "verified": true, "helpfulness": "0/0", "author": "Erik Shwarts"}]