[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Parker Lingon"}, {"rating": 5.0, "review": "Excellent device, works perfect.  No problem getting it setup and working.", "verified": true, "helpfulness": "0/0", "author": "Lea \"Lea\""}, {"rating": 5.0, "review": "great Product don't know I waited so long to get one", "verified": true, "helpfulness": "0/0", "author": "Kenneth Shapuras"}, {"rating": 4.0, "review": "Nice wish my internet was faster", "verified": true, "helpfulness": "0/0", "author": "Darrin Lynn"}, {"rating": 5.0, "review": "Great device at a great price....have been watching many movies.  This device is outstanding!", "verified": true, "helpfulness": "0/0", "author": "Herman Delgado \"El Soprano\""}, {"rating": 3.0, "review": "Great interface!  Etremely Simple to install, set up, and use.  One main reason I purchased the Firestick was to 'fling' things I am watching on my tablet or phone to the TV while continuting to work on something else.  After purchase I've learned this can only be done with Amazon devices.  It says other platforms may be coming, but very disappointing.  Other than that, I am very pleased!", "verified": true, "helpfulness": "0/0", "author": "Chris Tatum"}, {"rating": 5.0, "review": "Love this little gem. Easy to hook up, use with Prime, terrific!", "verified": true, "helpfulness": "0/0", "author": "gayle williams"}, {"rating": 4.0, "review": "I love being able to watch shows on my time and it frees up my computer.", "verified": true, "helpfulness": "0/0", "author": "M."}, {"rating": 4.0, "review": "You only pay once when you purchase it, no monthly fees. It is very easy to set up to your HD TV and can be moved from one TV to another and resume its function by just plugging it in and out without any problem. I use it to watch free movies through Amazon Prime. There are a few newer movies, many TV Series and many older movies. It has a pay-per view option, too. The options for using the Fire TV Stick are tremendous, some are at extra charge. It can stream movies through all kinds of sources you may be affiliated with. You can play games too (requires the purchase f a special controller). Most of the time the streaming flows without buffering. I found out that It has problems buffering around 6PM and 12AM. I believe the bandwidth of my wireless is compromised at that time, and I will have to call my internet provider about that problem.", "verified": true, "helpfulness": "1/1", "author": "Jaymary"}, {"rating": 2.0, "review": "To many pay apps", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]