[{"rating": 4.0, "review": "I had a Chromecast and I love it so much I immediately picked up a FireTV Stick for $19.99 when it came out. It's quite a superb value for that price. I deducted a star because I've had to reboot mine as it stopped connecting to my Airport Extreme.Full 1080p quality is great and you can tell there's a more beefy processor in this compared to Chromecast. User interface is easily navigable and when you first connect it, you don't have to login! It's already associated with your Amazon account before it ships.Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Cristian"}, {"rating": 5.0, "review": "Works great! Unlike it better than the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "S. Forman"}, {"rating": 2.0, "review": "It's a good reliable device, but it streams most everything that other devices (Blu-Ray) already do. Two starts until they get more TV applications to run on it.", "verified": true, "helpfulness": "0/2", "author": "Mind&Body;"}, {"rating": 4.0, "review": "Stream shows really well even on slower DSL", "verified": true, "helpfulness": "0/0", "author": "Sundown"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Joe Walentin"}, {"rating": 5.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "John L"}, {"rating": 5.0, "review": "love this device. I had a roku so glad i got the fire stick the download is so much faster.", "verified": true, "helpfulness": "0/0", "author": "Rosemary Meza"}, {"rating": 2.0, "review": "Works great. Easy setup. I didn't have any issues like other reviewers described when connecting to my WiFi and my amazon account.Pros:Easy setupPicture looks great.Easy to useWorks great but I do have some issues with it.Cons:The video at t he beginning when setting up you can't skip. There should be a skip button. Why force people to watch it for those who have the Fire TV.Why is the remote not as good as the Fire TV one???This remote sticks and works when it wants to. It also doesn't have a voice search button. Which is one of the factors I like about the other remote.The is this popping noise when watching or listening to the Stick. Whatever it is someone needs to fix it. It is annoying.Things I'm indifferent about:Having to plug it in. No big deal...I do like the extender could be longer though...Amazon fix these things and I'd give you 5 stars and recommend it to other.I do prefer the Fire TV.", "verified": true, "helpfulness": "2/3", "author": "I.D. Madrigal"}, {"rating": 4.0, "review": "Works well.  Easy set up. The only drawback is I vougt it to travel and to watch movies.  But outside of North America it will not work and we travel a fair amount. It will not work in Australia so far.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey C. Zorn"}, {"rating": 3.0, "review": "great for content, have to use remote though. App crashes,", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Dave Mac\""}]