[{"rating": 4.0, "review": "I was one of the fortunate prime members who purchased their Fire TV Stick at only $19 for the pre-order sale. I was also fortunate enough to receive it  2 weeks before the expected delivery date of December 1st.I haven't had this long enough to give an extensive review, but here are my thoughts from the get go.PACKAGING:Everything was well protected and compact.It comes with the Fire TV Stick, Remote, USB Cable plus the Power Adapter, an HDMI extender cable, and the batteries needed for the remote.SETUP:This was by far the easiest set up to any streaming device I've ever had. You literally just plug the stick into the HDMI port on your TV, and Plug it into the outlet, and it starts right up.Once I connected to my wifi, it did go thru the set up of downloading the latest software.Since it is an amazon product, it was already set up with my amazon prime account, and I liked that amazon was the \"Home\" page, so I didn't have to necessarily go to an amazon app like other streaming devices to enjoy my prime content.You can easily download Netflix, HuluPlus, Crackle to your list of apps and there are others, that I have yet to explore.I'm interested to see if the Fire TV Stick can play my NBA League Pass.I'll update the review in a month, when I've had more time to mess around with it.", "verified": true, "helpfulness": "4/4", "author": "LizJean24"}, {"rating": 4.0, "review": "Generally I'm very happy with this device. Two criticisms, or maybe more like one criticism and one semi-criticism:*The remote does not consistently move through the interface smoothly. It will get stopped up, not respond, you click right/left/up/down again and then suddenly it plays catch-up. It will also sometimes scroll across an entire screen just from quickly pressing a direction once. This has already frustrated me a number of times.*I really wish that Amazon would stop trying to insulate themselves from the Google universe. This device has better YouTube functionality than the Kindle does, so that's something, but voice searches only bring up Amazon-specific hits. I understand it from a business perspective, but as a consumer it limits the experience.Again though, generally this thing does the job well, and is really good value for a low price.", "verified": true, "helpfulness": "1/1", "author": "Leif Johnson"}, {"rating": 5.0, "review": "I got it for my television in the workshop, and it works great. All that's needed is a HDTV with a HDMI input and high speed internet with WiFi. I LOVE IT !!!", "verified": true, "helpfulness": "0/0", "author": "Sharon A Bush"}, {"rating": 5.0, "review": "It's awesome! The UI is awesome and smooth.  The performance is great it's fast at downloading and installing apps, opening up apps, and just using.  My only complaint is the remote.  The remote the Fire TV Stick ships with is cheap.  It is plastic and has a terrible feel. I purchased the upgraded remote and now love everything about my Fire TV Stick setup.  I highly recommend this device.", "verified": true, "helpfulness": "0/0", "author": "Michael S"}, {"rating": 5.0, "review": "Just hooked it up and it works flawlessly.  Liked the fact that it was already registered to me as I am a Prime member.  Had fun watching video's and downloaded the FIT exercise video; sure looked as it could be a good workout.Have not tried any games yet.  Like it very much cant wait to use more.I already own the Sony internet, the Apple TV, and now the Amazon Fire Stick.Honestly, can't tell the difference except that the Amazon does not have Apple apps and the Apple of course does not allow Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 2.0, "review": "I am disappointed in the Firesrick performance. Over the three days I used it, I experienced several start uo problems. Problems included: long startup time,  failed startups and lockups. The lockups could only be cured by unplugging and repluging the unit.I decided to try the Firestick to see if I could replace my ROKU box for video streaming. I have been a long ROKU user, but never liked its quirky performance. I am sorry to say that it seems that Firestick brings its own set of quirks.I plan to return the Firestick.", "verified": true, "helpfulness": "3/4", "author": "Kenneth P. Hodges"}, {"rating": 5.0, "review": "Setup was easy and quick and I was able to connect it directly to my Sony AV Receiver so I can have surround sound.  I have 12/mb DSL and did not have any problems streaming the HD movie I watched.  Since I used prime music and photo storage its very convenient.", "verified": true, "helpfulness": "1/1", "author": "Bean"}, {"rating": 5.0, "review": "I purchased this when it was on sale for $19!  It works great and was supposed to be a Christmas gift for my husband.  However, he opened it up on Monday when it came and I have now lost him to the TV!  Should have bought a few more for the rest of the house!Just purchased a 2nd unit for our boat.  Love it!", "verified": true, "helpfulness": "1/1", "author": "risa himaras"}, {"rating": 5.0, "review": "So far I love it. I have a Chromecast for viewing Netflix and Youtube, and use a PS3 for Amazon Prime and a few other streaming apps. Fire TV Stick does almost everything both of those do, plus more. I definitely see my family using this often.", "verified": true, "helpfulness": "0/1", "author": "JayneCobb"}, {"rating": 5.0, "review": "It was fairly quick and easy for set up. The streaming with the Fire Stick seemed to be a lot smoother with less 'hick-ups'. Easy navigation with the remote. I replaced my Boxee Box with this as I;m a Prime member and the Boxee didn't have the Amazon Prime ap. The cost for the Fire Stick was great too. I also have a Roku that works well in the other room that get's me to Prime, but I sure like the small size of the Firestick and it's wireless hookup.", "verified": true, "helpfulness": "0/0", "author": "Lynn Wilson"}]