[{"rating": 4.0, "review": "Love it,  now if only i could add the tw app to it!!!", "verified": true, "helpfulness": "0/0", "author": "Victoria G"}, {"rating": 5.0, "review": "In the interest of full disclosure: I have noticed that video (specifically through the Hulu app) will pause and I have to return to the home screen and reload the entire app to get it to play again - but this could be due to a number of factors, including many options not related to the Fire TV Stick itself. Despite this minor annoyance, I do LOVE this device!", "verified": true, "helpfulness": "0/0", "author": "abcthatsme"}, {"rating": 5.0, "review": "I've been using FireTV Stick for about a week now and it's awesome! It was so easy to install and it works exactly as I expected. I am 100% immersed in the Amazon ecosystem so getting this device was a no-brainer for me. I can stream all my videos, music and photos flawlessly. I can watch my Netflix and YouTube with no major buffering or lagging issues. I can even play some of my favorite games on it. Very happy customer so far!My only very minor complaints would be that the remote control is extremely hard to open to replace the batteries and that the device still  can't be used in hotel rooms or any place that requires a webpage internet login. Amazon says it's coming soon, so hopefully they really do mean SOON. lol", "verified": true, "helpfulness": "0/0", "author": "Mary \"sleepless777\""}, {"rating": 5.0, "review": "Arrive on schedule.  Very easy to install.  Easy to use on screen directions for installation and for navigating the site.  Would buy again.", "verified": true, "helpfulness": "0/0", "author": "Ronald Davis"}, {"rating": 4.0, "review": "Nice option for a guest bedroom. Needs IOS app for controls.", "verified": true, "helpfulness": "0/0", "author": "Rputney"}, {"rating": 1.0, "review": "If I am aPrime member why do I have to pay for some shows??", "verified": true, "helpfulness": "0/1", "author": "gayle merrill"}, {"rating": 4.0, "review": "I really like this so far.. I just purchased it so I have no issues as of now. I will have to update my review once I have been using the product for a couple of months. So far no complaints.", "verified": true, "helpfulness": "0/0", "author": "Natelya Maxwell"}, {"rating": 4.0, "review": "It would be better if the processor was faster, a little slow to load things.", "verified": true, "helpfulness": "0/0", "author": "Robert C."}, {"rating": 3.0, "review": "Good cord cutter option. Content wise it offers almost everything. Very easy to use. Menu options are a little confusing to some in my family. I setup pin requirements after a few programs were accidentally purchased. Speed is the biggest issue. Menus can be slow to respond. Streaming speed is slow at times. I do prefer very much to the Roku stick and Roku 2. Picture quality is very good.Still my three year old + Apple TV blows the Fire TV stick away in menu organization and overall speed and performance. I really only use the Fire Stick for Sling streaming. Once Apple brings their streaming service in this fall I doubt I will continue using the Fire TV stick. I did try the Fire TV full size and it was much more responsive. I just did not want to pay that much (I have three TV's , each with a Fire TV stick and Apple TV). I'm saving $127 a month after dropping cable. I hear the Roku 3 has good performance. Still I think the Apple TV is a better streaming device with one exception, content. That will change once they go live with their streaming service I think.", "verified": true, "helpfulness": "0/0", "author": "George F."}, {"rating": 4.0, "review": "Love it. The only drawback is that you have to purchase a lot of the good movies.", "verified": true, "helpfulness": "0/0", "author": "Dannielle Schwab"}]