[{"rating": 4.0, "review": "I am a complete newbie to streaming so I did not really know what to expect. I had normally played Prime movies through my browser. I am really digging the device. Super simple and straightforward. I am using my computer monitor for the HDMI input and the audio goes out to speakers. It all works well. The only thing I miss is being able to read reviews of movies, rather than just the ratings.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Lyerly"}, {"rating": 3.0, "review": "The Fire TV stick works great but I wish there was a way to to have multiple Amazon user accounts names stored so that we could log in and out with just the password rather than having to \"de-register\" the account.  I don't want to charge my roommate's account and vice-versa when downloading content.  It would also be better to have a longer power cord for those who hang their Tvs.  Other than that it seems to work fine! ~ Renee", "verified": false, "helpfulness": "0/0", "author": "Renee M. Speltz"}, {"rating": 4.0, "review": "The fire TV stick definitely delivered more then I anticipated. It's fast, convenient works well, and the interface is simple enough to navigate quickly. Having the remote is great, and I love that it does not need direct line of sight.What most surprised me is that I actually found myself playing games on it using the included remote and actually having fun and wanting to play again.I love how they tell you before you download if an app or game is compatible with the fire stick remote or a gamepad. I wish it also said if it had local coop/local multiplayer and the same for online.The only issue with it for now, is the small amount of apps for it. But I'm sure this will improve as time goes by.Don't be on the fence with this thing, it's the best bang for your buck, and it will really surprise you.", "verified": true, "helpfulness": "0/0", "author": "DeenDon"}, {"rating": 1.0, "review": "The kindle mirrored twice and quit unexpectedly each time. After that it wouldn't mirror again. Restarted each device multiple times.", "verified": false, "helpfulness": "0/0", "author": "Ross Engel"}, {"rating": 4.0, "review": "Need reset the WiFi connection once a while.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"LY\""}, {"rating": 5.0, "review": "I really love this product. Cheaper than cable!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Extremely convenient. You can take it anywhere with tv and wifi connection. Awesome if you don't want to pay for cable", "verified": true, "helpfulness": "0/0", "author": "J. Knox"}, {"rating": 5.0, "review": "LOVE LOVE LOVE!!", "verified": true, "helpfulness": "0/0", "author": "Juli"}, {"rating": 4.0, "review": "Fire Stick went on instantly-as soon as birdbrain figured out the remote. No connectivity problems at all. I love mine, so I bought another for my mom, who has a different model Samsung. It would not recognize the Fire at all. Bummer!! I wonder why??", "verified": true, "helpfulness": "0/0", "author": "lpacheco"}, {"rating": 5.0, "review": "Easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "Julie Hahun"}]