[{"rating": 3.0, "review": "why DTV is not available for showtime anytime as a provider? and the EWTN", "verified": true, "helpfulness": "0/0", "author": "dax"}, {"rating": 1.0, "review": "has had connection issues since day one. The router is right across the room and streaming is still. The idea is marvelous, unfortunately the product does not do what is promised. By the way streaming works fine in the entire house with any other device. Do not waste your money!", "verified": true, "helpfulness": "1/2", "author": "Jennifer Mikka"}, {"rating": 5.0, "review": "Good price. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jody Boisen"}, {"rating": 5.0, "review": "works equally as well if not better than my apple tv and chome stick plus you get amazon prime original programming!", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "All that's needed is a prime membership, wifi, and a t.v. with hdmi ports and you're good to go and I mean that literally; take the stick on vacation, just plug in and you have your watchlist with you.", "verified": true, "helpfulness": "0/0", "author": "and-y"}, {"rating": 5.0, "review": "I received mine as a gift.  Have thoroughly enjoyed it.  Very simple to set up.  They had some of my favorite movies & TV series for free. ;0). That was nice.  Being able to watch them whenever I wanted was great too!  No commercials!  Definitely a bonus.  Like the remote that came with it along with free batteries!  So far I have been very satisfied.  They add more movies & shows all the time too.", "verified": true, "helpfulness": "0/0", "author": "georgiagal"}, {"rating": 5.0, "review": "Love it! Definitely worth the money. Can't imagine going without it now", "verified": true, "helpfulness": "0/0", "author": "morgan"}, {"rating": 5.0, "review": "Love it much better than Chrome !!!", "verified": true, "helpfulness": "0/0", "author": "Celine Verdiales"}, {"rating": 5.0, "review": "Works great and I like the small profile.", "verified": true, "helpfulness": "0/0", "author": "St Anne \"VA Career Woman\""}, {"rating": 5.0, "review": "Absolutely love it!!  It was everything I had hoped it would be.  The smart phone app makes it even better.", "verified": true, "helpfulness": "0/0", "author": "sprite"}]