[{"rating": 5.0, "review": "Easy to install;  Easy to use;  Great picture", "verified": true, "helpfulness": "0/0", "author": "pc"}, {"rating": 5.0, "review": "Love this, easy to set up and to use", "verified": true, "helpfulness": "0/0", "author": "Laura Pivonka"}, {"rating": 1.0, "review": "Update 2More disappointments :- Memory is only 5.57 GB vs advertised 8 GB- Wifi keeps getting disconnected.- Apps takes forever to load .- Display is blurry for a while after the app loads- I tried updating the software but it just displays \"Checking now\" and then get disconnected.PS  : I have a 20 MBPS internet connection, so slow internet speed is not the issue either.------The device should have come pre-registered as mentioned on box. The sign-in keep getting failed and after troubleshooting with tech support for half an hour , I was able to get it registered.PROS-Good for prime users.Picture quality is good.CONS/Disappointments -1) USB wire is too long and keeps dangling if connected to TV's USB port. Chromecast has perfect length USB cable.The image under the Technical details page gives a wrong impression that the stick can be used without connecting to power adaptor or the usb cable.2) Amazon fire TV app doesn't work as advertised. I confirmed the android version, it is above 4.0 and I also confirmed both phone and fire stick were on same wifi network. The app keep searching for Fire TV devices and nothing shows up.The circle on the remote appears as though you can scroll similar to an ipod but it is a push-click button.", "verified": true, "helpfulness": "0/1", "author": "Anshul Jain"}, {"rating": 5.0, "review": "I got it earlier today and it was exactly what was promised. Very sharp picture, easy to use and a very good value. Would like to see some more apps, particularly one for Slingbox, but I must say, I'm very impressed....", "verified": true, "helpfulness": "0/0", "author": "HPHOKIE"}, {"rating": 2.0, "review": "hard to use, jumps around.  at this time, not a winner, will play w/ it more, can't find close  caption button, cannot hear otherwise.", "verified": true, "helpfulness": "1/2", "author": "PCMJ SR \"PETE\""}, {"rating": 3.0, "review": "This is a very cheap alternative to other set top boxes and the chromecast. If you are heavily invested in Amazon Instant Video or need a remote for your streaming device, then you can't go wrong with this. However, you can get better alternatives. This device has good specs on paper but it does lag in everyday use. For instance, the Netflix and Hulu apps can both get pretty laggy when browsing titles. When you stream a titles it does load fast and buffers quickly, but this is more to do with how fast your wifi is. There is no ethernet port, which is disappointing but expected since its a cheap stick streaming device like the chromecast or roku stick.Right now there are not a lot of streaming services outside of Amazon, Netflix, and Hulu Plus. There is no HBO GO yet. The Plex app stuttered and lagged a lot during playback for me. YouTube is really laggy and casting to it from a mobile device doesn't work half the time. Also, the Twitch app is severely lacking at the moment. This could change in the future however.The remote is very comfortable and does what it is supposed to. It's light and feels good in the hand. The buttons are nice and clicky.Personally, I use my iPhone a lot and just use a Chromecast to watch media.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 5.0, "review": "i like the simplicity of this device. i also have the chromecast dongle but actually prefer the look and functionality of this better. i would have liked the voice controller better.", "verified": true, "helpfulness": "0/0", "author": "Charles G. Tucker"}, {"rating": 5.0, "review": "This is absolutely amazing! I am so happy I bought these!!!", "verified": true, "helpfulness": "0/0", "author": "Donnita Law"}, {"rating": 5.0, "review": "The Amazon Firetv stick works very well. I haven't had any problems with it in regards to picture quality and audio. Streams effortlessly without any stops, (buffering). I think a lot depends on your wifi capability and internet speed. I'm using AT&T; u-verse at12 mbps.This was very easy to set up just answer a few questions. Updating software took the longest time just let it run and you'll be fine.My only regret was not purchasing more of these. I would definitely purchase again and I do recommend this over some of the similar type of streaming devices.", "verified": true, "helpfulness": "0/0", "author": "kingami"}, {"rating": 5.0, "review": "It works exactly as advertised. I highly recommend it. Simply plug it in and you will be ready to go.", "verified": true, "helpfulness": "0/0", "author": "Johnny Aponte"}]