[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 5.0, "review": "Easy setup, works flawlessly. Some third party apps freeze (NFL) but the rest are great.  I didn't want to wait for amazon to have this hot selling item back in stock so I paid 60 on eBay.", "verified": true, "helpfulness": "0/0", "author": "kammi"}, {"rating": 5.0, "review": "This does everything that we expected and more!  I got this for my son for his TV and so far we have absolutely NO complaints!  Now I want one for the main TV!", "verified": true, "helpfulness": "0/0", "author": "Julia Jackson"}, {"rating": 5.0, "review": "So easy to install, and it gives you access to so much!  Love it!", "verified": true, "helpfulness": "0/0", "author": "Kathleen Kolodziejczyk"}, {"rating": 2.0, "review": "Always has the same movies on the Prime video list, which is very short so unless you know the name of the movie, you're basically s.o.l. not to mention as a prime member, you too have to pay extra for shows and cartoons like the Simpsons, family guy, movies that are old even. Where's the thousands of movies that I paid for??? Not worth the money. Netflix is better with more movies and shows that you don't have to pay extra for after paying for your subscription.", "verified": true, "helpfulness": "2/2", "author": "M.A."}, {"rating": 2.0, "review": "Fire stick gets too hot and locks up A LOT (after 1-2 hours of Netflix). Love the interface over my Netgear and Chromecast, but I hate that I have to reboot it all the time. I went back to the Netgear and unplugged the Fire stick.", "verified": true, "helpfulness": "1/1", "author": "Justin Read"}, {"rating": 5.0, "review": "Love it so far! Great purchase!", "verified": true, "helpfulness": "0/0", "author": "J. Gewirtz"}, {"rating": 5.0, "review": "Very easy to set up", "verified": true, "helpfulness": "0/0", "author": "betty carlton"}, {"rating": 5.0, "review": "Easy to use and set up. No delays in watching movies or shows.", "verified": true, "helpfulness": "0/0", "author": "Alisha Toepfer \"Colossians 4:5\""}, {"rating": 5.0, "review": "I love this my son has one I love it, great for watching movies on the go", "verified": true, "helpfulness": "0/0", "author": "Toni Scruggs"}]