[{"rating": 5.0, "review": "It's incredible", "verified": true, "helpfulness": "0/0", "author": "Juanjr824"}, {"rating": 1.0, "review": "After 2 month that I bought a Fire TV stick by samsung tv it didn't have a signal to connect. I had several plasma tv to connect it but it didn't work.", "verified": true, "helpfulness": "0/0", "author": "DcrfxQqfRRMA"}, {"rating": 5.0, "review": "Love it!! Getting rid of cable was the best decision ever", "verified": true, "helpfulness": "0/0", "author": "emma flores"}, {"rating": 4.0, "review": "Works well, only after moving tv.", "verified": true, "helpfulness": "0/0", "author": "Frank Moore"}, {"rating": 2.0, "review": "At first the Fire Stick worked wonderfully however after some time the glitter has worn off. The device lags between screens and often all apps need to be force closed for everything to work \"seamlessly\". Using Netflix is the biggest issue, the screen constantly freezes and the audio continues until the video plays catch up at a sped up pace. If I could go back in time I would bite the bullet and buy a Roku or AppleTV. Maybe the FireTV works better but as far as the the Fire Stick goes I'd look elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 5.0, "review": "Using it for sling TV. Their app needs some UI love but the fire stick device itself is great. Small and portable and performant for our video watching needs.", "verified": true, "helpfulness": "0/0", "author": "Louis"}, {"rating": 5.0, "review": "This is a great product. Has everything I expected plus more.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Gonzalez"}, {"rating": 5.0, "review": "Easy to use, works great.", "verified": true, "helpfulness": "0/0", "author": "T. Stewart \"Paramedic, RN, FNP Student\""}, {"rating": 3.0, "review": "While I love the sleek design and simplicity of this device, I have issues connecting to Netflix when my XBox 360 connects fine on the same wifi network.", "verified": true, "helpfulness": "0/1", "author": "J. Woo \"J.W.\""}, {"rating": 5.0, "review": "Pretty great so far....we cut the cable and have one on every tv in the house.", "verified": true, "helpfulness": "0/0", "author": "Chad P. Poole"}]