[{"rating": 1.0, "review": "Plain and simple, It gets hot and stops and reloads over and over and OVER AGAIN! I will return it.", "verified": true, "helpfulness": "0/0", "author": "kidder64"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Laurie"}, {"rating": 5.0, "review": "Very easy to use.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Stingrai2000"}, {"rating": 4.0, "review": "I don’t know if the buttons on the remote are too sensitive or if the buttons are raised too high (as opposed to concave), or what the problem is.  But if I drop it from 18” off the coffee table, I end up having to Search and spell out the Search for Titles all over again, select whatever movie I’m watching and fast forward, or start from the Menu depending on what button was hit in the fall.  It’s a hassle but I pre-ordered it for approx $39 and it’s worth it since I have Amazon Prime.An upcoming app for YouTube was announced so that will add to the features I like.", "verified": true, "helpfulness": "0/1", "author": "David 83707"}, {"rating": 5.0, "review": "I love it just as much as the Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Jane Hoeweler"}, {"rating": 5.0, "review": "This is a great way to share movies from my fire with the family.  All can view the movie on the large screen TV.  After I set it up the first time with help from support staff, I was easily able to set it up myself.", "verified": true, "helpfulness": "0/0", "author": "LW61"}, {"rating": 5.0, "review": "I have both the chromcast and the fire tv stick. I don't even use the chromecast anymore. The fire tv stick makes it so easy to just flip through netflix and amazon to find the movies I want to watch. I love having the remote!!!!!! So much easier than having to get your phone synced up with the chromcast.", "verified": true, "helpfulness": "0/0", "author": "Me"}, {"rating": 5.0, "review": "Easy to set up. It was somehow preload with the videos I had already purchase through Amazon videos so I didn't have figure that out. No problems with getting it work right out the box. Definitely recommend this product. Thx", "verified": true, "helpfulness": "0/0", "author": "K. Jacobs \"city boy\""}, {"rating": 5.0, "review": "So far it's been great! Only had it a week though.", "verified": true, "helpfulness": "0/0", "author": "Andy K."}, {"rating": 1.0, "review": "This stick is NOT worth buying.  I purchased back in December and finally opened to use it today.  I can't put the code in for the WiFi because it keeps speeding through the numbers.  I have tried over and over.  I'm tired and frustrated and Amazon says it's too late for a refund.  I purchase so much from Amazon and to tell me January 31, 2015 was the last day for me to return this device sucks!  I wasted my money.  Just HORRIBLE!", "verified": true, "helpfulness": "0/2", "author": "DeAndrea"}]