[{"rating": 1.0, "review": "Fire stick has not been reliable for me. It works for a while then disconnects from my network.This has happened a number of times.My network is fast (75mbs) with a strong signal. All other devices connect without problems.If I remove power from Fire Stick and restart, it will work...This could be a firmware or software issue.I do think that Amazon will probably come up with a fix after enough people report this.I would not recommend buying at this time until this is resolved.", "verified": true, "helpfulness": "1/2", "author": "RONDO"}, {"rating": 4.0, "review": "I am really enjoying the Fire TV stick since ordering it.  It has a super slick interface to find content.  It is like an improved Roku.  Roku I find to be a more boring and slower version of this.  Scrolling through Roku menus and episodes can be painfully slow.  The opposite on this device.  The remote is also impressively responsive.  I thought there was no way it'd be responsive enough to do well in a game like flappy bird, but alas it was.Now, there are a few reasons I give it 4 stars instead of 5.  One is that it is too biased towards amazon content.  Like voice search only works on their content.  And the main menu stuff is all amazon prime content.  No offense to prime video, I use it from time to time, but I'm using Netflix, Hulu, etc also.  Which isn't a big problem, it just makes an extra click or two to get to those videos than probably necessary.I also find that the fire stick doesn't seem to work perfectly with my hdmi switcher.  When I put it into suspend mode, the switcher seems to think the fire stick is still streaming video.  Not a big problem, but a bit of an annoyance.The lack of HBO Go is also an issue, but I won't penalize fire tv for this, as they've announced its coming soon.  Once it gets HBO I think it's going to be the clear leader in the streaming wars.  Until then I think its a neck and neck race between it and chromecast [with roku slightly behind]", "verified": true, "helpfulness": "0/0", "author": "Mike V"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "I got this when it was on pre-order for $19.I do like it, but I don't like that you have to have cable to get a couple of the apps.", "verified": true, "helpfulness": "0/0", "author": "Kristen Johnson"}, {"rating": 4.0, "review": "It is easy to use. We're enjoying it however we found on one of the CRACKLE videos there was constant buffering. The wifi was strong on our other devices so we're unsure why that particular video had the problem.", "verified": true, "helpfulness": "0/0", "author": "Richard Harris"}, {"rating": 5.0, "review": "Easy to set up.  Good selection.  Similar to Roku but easier to use.  Much more flexible and useful than chromecase.", "verified": true, "helpfulness": "0/0", "author": "JAE"}, {"rating": 4.0, "review": "I thought there would be more PC to fire streaming instead of propriatary fire tablets and phone instant streaming to the device, but it has a lot of preinstalled options.", "verified": true, "helpfulness": "0/0", "author": "Carl Mcqueen \"xedef\""}, {"rating": 5.0, "review": "Great. Really nice.", "verified": true, "helpfulness": "0/0", "author": "Jack Weinbender"}, {"rating": 5.0, "review": "I have used the chromecast and Roku, but the fire stick has a nicer interface than the Roku and has the same streaming capabilities of the chromecast if you own a Kindle Fire tablet.  it also has a great app with voice controls built into it.", "verified": true, "helpfulness": "0/0", "author": "Andrew Garrabrant"}, {"rating": 3.0, "review": "Hate the remote. But otherwise, seems good. Disappointed that Showtime is shown as offered when, in reality, you have to already have SHO from your provider, so what's the point? Otherwise, set up was simple and I was glad for that.", "verified": true, "helpfulness": "0/0", "author": "Irm Brown \"Library Looney\""}]