[{"rating": 2.0, "review": "It only works when plugged in and doesn't load the apps at all sometimes.", "verified": true, "helpfulness": "0/1", "author": "john mclaughlin"}, {"rating": 5.0, "review": "Love it so far", "verified": true, "helpfulness": "0/0", "author": "Frances T. Ingram"}, {"rating": 4.0, "review": "It works great and is very portable. I gave it only 4 stars because it came pre-programmed with personal account information. While many people might see this as a perk, it was a hassle for me and my friend who swapped sticks and then have had to reprogram.", "verified": true, "helpfulness": "0/0", "author": "Kevin Dau"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Pamela Carmona"}, {"rating": 5.0, "review": "I love it!  It is easy to use and already can't imagine not having it.", "verified": true, "helpfulness": "0/0", "author": "Lou Paul"}, {"rating": 5.0, "review": "Absolutely love.", "verified": true, "helpfulness": "0/0", "author": "Emily"}, {"rating": 5.0, "review": "Great price for this item as well as availability prior to the holidays! The movies/series available has a great selection.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Bradbury"}, {"rating": 5.0, "review": "We love our Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "NJohnson"}, {"rating": 3.0, "review": "It does a whole lot. That is for sure. And the RF remote is amazing. I love the play/pause button for web content. 5 stars for being a great way to watch youtube, which I do quite a bit.However, I'm used to watching CBS shows on cbs.com. I can't find a CBS app that works, and if I try to watch CBS shows through amazon video they want me to pay. I'm not inherently against paying, but these shows are free on cbs.com. Ergo, I find myself preferring the old laptop and mouse setup over Fire TV stick... the very thing I was hoping it would replace. 1 star for having no browser and charging for free content. Also, I plugged the fire TV stick into the venerated power supply that came with it and it still whined to me about wanting more power. It works great, it's just whiny.Averaging 1 star and 5 stars = 3 stars.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Love it.  Has everything I wanted and more.  Can't think of any negatives at this point.", "verified": true, "helpfulness": "0/0", "author": "Gtbiv1"}]