[{"rating": 1.0, "review": "I cannot get my fire stick to load. I have contacted Amazon but haven't heard back.  Have had it 6 days and it hasn't worked yet. The screen says to unplug and try again.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am truly impressed with the Fire TV Stick. It was already tied to my Amazon account, so once I joined it to my wireless network, I was up and running.Previously, I'd been streaming Amazon video through my Sony Blu-Ray DVD player and I must say the video quality is exceptionally better now when I stream through the Fire TV Stick.Also, the ability to install apps on the stick is a plus as well. Just the other night, I installed the A&E; app, so my son can watch the most recent episodes of Duck Dynasty.The Fire TV Stick is an exceptionally well designed product, available at an affordable price. Highly recommended. 5 out of 5 stars!", "verified": true, "helpfulness": "0/0", "author": "Shaun Tabatt"}, {"rating": 5.0, "review": "So much better than the Chrome stick!  Easy to install, strong signal pickup and works beautifully!  With all my options from my Amazon Prime membership, I needed this!", "verified": true, "helpfulness": "0/0", "author": "Chelle \"always reading\""}, {"rating": 4.0, "review": "Works fine - but same as my Roku.  If you already have Roku, the only benefit I could see with the Fire Stick is that you can take it with you.  I did return it since there was no benefit to owning both - As always, Amazon service is THE BEST!", "verified": true, "helpfulness": "0/0", "author": "Mooma"}, {"rating": 2.0, "review": "Its OK. It really depends on what you want to use it for mainly. It is great for Amazon Prime, Netflix, and Hulu Plus. The biggest downfall for me was the lack of apps. I wanted a system that would work with the available tv/movie apps out there (ex. The CW Network, Vudu, etc). It does have an app for PBS (but its not that great - hard to find what you want to watch). Most of the apps that are available are worthless to me. I personally don't care for the remote control (the buttons stick) or the menu layout. Also, the stick does not work by using the usb on your tv to power it. You have to plug it into an outlet, which stinks since I was trying to get rid of the extra cord clutter. I would rather have bought a Roku but the Fire Stick was cheaper (black friday special) and I'm counting on Amazon to add more apps.Update (2/15): I had to take my rating down another star. The stick seems to be hanging up more and more. I constantly have to unplug it to get it to work correctly. Last night I was watching Netflix and it froze, it had the picture still on the screen from what I was watching but it had the audio from the Allrecipes app playing.There are still not any new apps added since I started using the the stick!  I really wish I had bought a Roku!", "verified": true, "helpfulness": "0/0", "author": "KB"}, {"rating": 3.0, "review": "Good price but why aren't we told that sound does not come through your receiver? Only the TV. Was told by one rep that I need cables to connect the TV to the receiver because it is hooked up by HDMI. Another rep told me I was out of luck, sorry. Why would we want thousands of watchable choices without any booming sound? Help!!!", "verified": true, "helpfulness": "1/1", "author": "rayman"}, {"rating": 5.0, "review": "Ordered two and both work great with only two issues, One of the units has a bad HDMI extension cable that flickers when flexed I assume it has a bad wire/connection and will try and contact Amazon about a replacement cable when more stock becomes available. The second issue is not with the unit itself but seems to be a compatibility issue with on old TV I have in my guest room. It's a 2006 era Sony KDS-R50XBR1. When the Fire TV Stick is plugged into the TV I get the initial Amazon logo but then the screen goes black. The Fire TV Stick works fine on all the other TVs (All newer Samsung units) in the house so I'm betting it is an issue with the TV. Will do more research and see if there is a fix for it. All in all I'm very impressed with the Fire TV Stick. No buffering or stuttering even connecting to my second wireless router at the opposite end of the house. I wish I could have gotten more than two at the pre-order price.UPDATE: I forgot to update this sooner. I contacted Amazon regarding the faulty cable, I was given enough credit to purchase a replacement cable which arrived within 2 days and is now working without issue. Thanks Amazon Customer Service.", "verified": true, "helpfulness": "0/1", "author": "Delna"}, {"rating": 4.0, "review": "Install was easy but I had difficulty getting the initial updates to apply without having to reset the device several times.", "verified": true, "helpfulness": "0/0", "author": "Fletus Poston"}, {"rating": 5.0, "review": "I purchased this through the early sale price for Amazon Prime Members. Some have noted that the device came associated with their their Amazon account. The one that I received did not. The connection to my wireless network was quick and easy. When I tried to login to my Amazon account, I ran into an issue. The device kept telling me that their was no account with my email. I have many devices linked with the identical information. I called Amazons great support team and got bumped to their second tier support. That agent associated my account via the serial number of the device.Once connected the device worked great. The device was about 10 feet from my router and had very good speed. No buffering issues. The apps such as Netflix and Smithsonian channel where easily accessible. Their is a search feature that is available that will take you straight to the app for installing. Had the device hooked to 1080p and I am pleased with the picture quality. One thing that I really liked was the responsiveness of the provided remote. Some devices I own have some lag, but this one has immediate response. The menus where easy to navigate. There is a good selection of app available. Prime members have access to a large number of movies that is ever changing and they are free as part of the Prime membership. This device will travel with me as the small size is perfect to pack and have some programming on the go. I am pleased with the device to this point and will advise of any problems.", "verified": true, "helpfulness": "0/0", "author": "Jewell Moore"}, {"rating": 5.0, "review": "Very easy to install and met all our expectations.", "verified": true, "helpfulness": "0/0", "author": "suzanne jones"}]