[{"rating": 3.0, "review": ". I was so excited when I opened this Christmas gift, which seemed to access well the first two weeks.  It's been downhill since then with constant access issues.  When it works, it's great.  There seems to be no consistent reason why it suddenly freezes or loops.  Access is sometimes limited  or unavailable.  I have changed batteries, held down buttons, etc, listed on Help website and it's still temperamental.  Would I suggest it to someone else?  No.", "verified": true, "helpfulness": "0/0", "author": "Lea"}, {"rating": 4.0, "review": "From initial use, it seems pretty solid. I have experienced a few problems where the sound goes out, but the picture doesn't. That gets annoying really fast. The other complaint I have is that you have to go through 3 menus to put it into 'sleep mode'. Either the remote should have a shut down button OR they should put an option right on the main menu to do that.", "verified": true, "helpfulness": "0/0", "author": "Joseph Malinowski"}, {"rating": 5.0, "review": "Awesome!  It's very easy to connect and set up. We used it to replace the internet streaming from our dvd player.  It's faster on YouTube and also has Netflix app and prime video.  Weather apps and news apps and so much more! Some apps are free trial and then you have to pay. But overall there are many free ones and we haven't even seen them all. I think we could completely do away with dish now!  I have chrome stick in our game room but I like the fire best overall.", "verified": true, "helpfulness": "0/0", "author": "Sherry Hunter"}, {"rating": 5.0, "review": "love this thing.", "verified": true, "helpfulness": "0/0", "author": "william anderson"}, {"rating": 4.0, "review": "Easy to set up and Hulu Plus (the only subscription I have) works well.", "verified": true, "helpfulness": "0/0", "author": "V"}, {"rating": 5.0, "review": "Better than I expected! Easy to use interface...", "verified": true, "helpfulness": "0/0", "author": "coolness"}, {"rating": 5.0, "review": "I wish the search feature went across all applications, not just Amazon prime. Otherwise it has been fantastic.", "verified": true, "helpfulness": "0/0", "author": "Cliff Lore"}, {"rating": 5.0, "review": "We had to stop recording at time of viewing movies problem solved", "verified": true, "helpfulness": "0/0", "author": "Margie Quinata"}, {"rating": 5.0, "review": "This works so well I threw my Chrome stick in the trash.  I take it with me when I travel and use it in Hotels.  It is easy to move around from TV to TV, but it isn't too expensive so I am buying two more and most likely will stop using my two Roku", "verified": true, "helpfulness": "0/0", "author": "tb"}, {"rating": 5.0, "review": "OMG, for someone without cable, this is a blessing upon my life!Everything about it is great! So many awesome apps I didn't expect, Love this!!!", "verified": true, "helpfulness": "0/0", "author": "tara"}]