[{"rating": 5.0, "review": "Excellent love it", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 3.0, "review": "i like my firetv stck . i have a sony bravia tv and sony doesnt pay the licence for google and youtube the tv works no smart so decided to by a firetv stick and it works fein.no trouble connect and work i like the hardware. the amazon shop is ok but no have all the languages for example movies in german but its ok. who needs a smart tv by it its ok", "verified": true, "helpfulness": "0/0", "author": "darius saidin"}, {"rating": 5.0, "review": "Cheap and works very well.", "verified": true, "helpfulness": "0/0", "author": "Tim Walsh"}, {"rating": 5.0, "review": "Have only used for a couple of weeks, but thus far am pleased with purchase.", "verified": true, "helpfulness": "0/0", "author": "Dr. T. Meadors"}, {"rating": 5.0, "review": "Works great, initialized quickly...has an appealing interface...and it gives you to all your amazon content.", "verified": true, "helpfulness": "0/0", "author": "Mitch Mercurio"}, {"rating": 5.0, "review": "This was an upgrade from Chromecast for us, and wow the choices! We can run Netflix, Hulu, YouTube, and so much more from a small remote that comes with. We are thinking seriously of downgrading our cable service as a result to save some money whilst adding to our selection of shows (currently subscribed to Netflix Hulu and one other)  all for about 1/3 the price ($30 vs $90-plus)! Although we will occasionally get a small hiccup, where the streaming needs to \"catch up\"  for a second or two (and I think this has to do more with ones internet connection and/or the number of customers online (during a holiday weekend lets say) it has really not been a problem at all. Plus when the weather knocks out dish out ( which is a lot around here) we still have TV to watch!  This is definitely a keeper!", "verified": true, "helpfulness": "0/0", "author": "M. C. Fees \"Maycee\""}, {"rating": 5.0, "review": "Love it. :D", "verified": true, "helpfulness": "0/0", "author": "Mishi"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jewrey Morris"}, {"rating": 5.0, "review": "I love it! I installed it in two minutes and it works flawlessly! It's worth every bit of the $30 bucks!", "verified": true, "helpfulness": "0/0", "author": "Paula"}, {"rating": 5.0, "review": "Works great. Its just what I was looking for, and does what I wanted it for.", "verified": true, "helpfulness": "0/0", "author": "christian jones"}]