[{"rating": 4.0, "review": "Worked Great to start with.Long Time Customer", "verified": true, "helpfulness": "0/0", "author": "Matthew M Miller"}, {"rating": 5.0, "review": "Great tool for your TV and very inexpensive.", "verified": true, "helpfulness": "0/0", "author": "Florida Jo"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "Chuck1150"}, {"rating": 3.0, "review": "Works ok. Glitches at least 8 times per half hour show.  Frustrating.  And thought with my amazon prime I would try out amazon tv.  They charged me after a week and I didn't use it since there is a charge to watch each tv show of at least 2.99!Disappointed", "verified": true, "helpfulness": "0/0", "author": "Melanie B."}, {"rating": 5.0, "review": "Love this! Easy set up and easy to use. Even my husband who wasn't so sure about this is liking it.", "verified": true, "helpfulness": "0/0", "author": "juicypez"}, {"rating": 5.0, "review": "Fire TV Stick is Awesome! It's so easy to hook up to your TV and the streaming of what ever you want to watch is great! Also with Prime you get tons of Free shows, movies, and games, You Tube and Etc. Why would you need anything else? This is It! Very happy With Fire TV Stick! I would recommend this to anyone!", "verified": true, "helpfulness": "0/0", "author": "AUGDOG"}, {"rating": 4.0, "review": "A little clumsy but works well. I would recommend The See and say though it's well worth the investment.", "verified": true, "helpfulness": "0/0", "author": "NAVPRO \"Gye\""}, {"rating": 5.0, "review": "Easy to assemble & no issues so far👍", "verified": true, "helpfulness": "0/0", "author": "kimberly layman"}, {"rating": 5.0, "review": "I don't have any other streaming device to compare this to so this is only for this device and not a comparison.The installation is very simple and can be done by most people who can operate a TV. I do recommend having an Amazon account already.The unit itself is small but seems reasonable well built. The remote is comfortable and small.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm loving my fire stick.  We have a much older tv and don't want to pay for cable so it's opened up a whole new world of entertainment for us.  It's easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Melissa Jones"}]