[{"rating": 5.0, "review": "Even though I had a problem with my Fire TV Stick yesterday, the problem was solved rather simply by unplugging it from the wal and then plugging it back in!!  I enjoy the programs on Netflix and other apps and I am planning to turn off my TV in the morning since I can get my local channels with my rabbit ear antenna!!  I get a total of 9 local channels and even though I might miss some stuff on cable, the programs on Fire Stick help ease the pain of not having cable TV.  I know I am going to catch some flak tomorrow when I go to the cable office, but I know it is time to cut the cord!!  I told a close friend about this device and she has already ordered one!!  Later this year, in a couple of months or so, I plan to try Amazon Prime but I need to make sure I can pay for it when the 30 day trial is up!!", "verified": true, "helpfulness": "0/1", "author": "Larry L Miller"}, {"rating": 5.0, "review": "1", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "Great product, very happy that this \"stick\" has it's own operating interface with remote (instead of just mirroring from a device like Google's Chromecast).  Good value too because it includes all the same apps & much more than Apple TV, for a cheaper price.  Additionally, you also get access to Prime Instant Video with your Prime membership so you have access to thousands of shows, movies, etc.  I would recommend this over the Google Chromecast or Apple TV.", "verified": true, "helpfulness": "1/1", "author": "BIGski0202 \"BIGski0202\""}, {"rating": 4.0, "review": "I really like the Fire TV Stick.  It's easy to use and I also have access to my Netflix account on it.  My only complaint is the volume of the advertisements between TV show episodes.  When they play they are extremely loud compared to volume of the show, I mean really loud.  It's quite annoying.  Fix that and you'll get 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Christine Engleman"}, {"rating": 5.0, "review": "This was a gift from a thoughtful daughter!  I do not [possess the same technical skills, but once done. it works fine!", "verified": true, "helpfulness": "0/0", "author": "Mildred Brandt"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Emmanuel Matkins"}, {"rating": 5.0, "review": "Awesome I could not be more happier. Only thing I wish the remote was better.", "verified": true, "helpfulness": "0/0", "author": "Nate Miami"}, {"rating": 5.0, "review": "Love this item! Just figured out I can also get YouTube on the TV now so I can exercise in my living room. Easy to use and setup.", "verified": true, "helpfulness": "0/0", "author": "Jmamelia \"jmamelia\""}, {"rating": 2.0, "review": "Ordered this product after my dvd player/smart hub failure. This is well worth the price and is far superior to what I had before. Edit after 4 months product sayd hdcp unauthorized content. Worked fine then no matter what i tried product would not work.", "verified": true, "helpfulness": "0/0", "author": "brown"}, {"rating": 5.0, "review": "Easy set up and use.  Excellent streaming capability if you have high speed WiFi.  Near endless selection of movies and tv shows, including many available free to Prime members.  My Fire TV stick quit functioning after one week of hard use.  Amazon customer service replaced the unit overnight.  It is working fine, but as a precaution, I no longer leave it plugged in to the TV's HDMI port and AC power adapter when not in use.", "verified": true, "helpfulness": "0/0", "author": "Nancy"}]