[{"rating": 5.0, "review": "Awsome product sometimes lags a bit plan to buy a few more for the house!!!", "verified": true, "helpfulness": "0/0", "author": "Ralph C."}, {"rating": 5.0, "review": "Does everything it should,The one I bought a few months ago has been on almost every TV in the house in that time.Now that my 11 year old son has claimed it, we picked up two more for for the other TV's when they went on sale for $34.Well worth it, even in a house that already has a couple smart TV's and Roku's", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 4.0, "review": "Very satisfied with this product. Much superior to Chromcast.. I bought one for every TV. Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Deborah El-Platt"}, {"rating": 5.0, "review": "My family and I have not had cable tv in a long time...so using the Fire stick to watch Sling TV is just like watching cable without the high cable bill.", "verified": true, "helpfulness": "0/0", "author": "brenda"}, {"rating": 5.0, "review": "I'm thrilled  with it.It was so easy to set up and use....", "verified": true, "helpfulness": "0/0", "author": "Dawnshannon"}, {"rating": 5.0, "review": "I love the interface. Smooth and It allows my phone to be a remote. the Amazon prime setup is really nice on this thing. An increased variety of apps would be nice but still okay. I like it better than the smart tv interface I have.", "verified": true, "helpfulness": "0/0", "author": "NY101"}, {"rating": 5.0, "review": "My daughter loves the Fire Stick.  She enjoys all the movies and television shows that she can watch.Donna Richardson", "verified": true, "helpfulness": "0/0", "author": "Donna Richardson"}, {"rating": 5.0, "review": "I had difficulty connecting it to the internet at first, but I moved it to the side HDMI Port on my TV and it connected right away.  As a prime member, you get access to a bunch of tv shows and movies. This is a wonderful product that saves me a lot of connection hassles between tablet, PC, laptop and TV.", "verified": true, "helpfulness": "0/0", "author": "Bill Pastorius"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 5.0, "review": "Great product if you have prime, a must have.", "verified": true, "helpfulness": "0/0", "author": "John&Monica Marchell"}]