[{"rating": 4.0, "review": "Has a mind of its own. When it works it's good. The movie rentals should be free.", "verified": true, "helpfulness": "0/0", "author": "fishingwilly"}, {"rating": 5.0, "review": "this thing is simple and effective. love it so much i bought 2", "verified": true, "helpfulness": "0/0", "author": "brian nichols"}, {"rating": 4.0, "review": "So far, great.", "verified": true, "helpfulness": "0/0", "author": "bob carlson"}, {"rating": 1.0, "review": "Poor service. This thing couldn't connect to my WiFi from my router 2 rooms away. Called customer service as I thought it was defective, they told me to get better wifi. I have the best Internet you can get... good customer support. Here's their suggestions: turn it off then back on, reset router, get better wifi. Oh ok", "verified": true, "helpfulness": "2/2", "author": "andrew"}, {"rating": 4.0, "review": "Good product especially if you got in on the amazon Prime deal. Took a while to arrive but setup a breeze. Yes, screens are skewed towards amazon offerings but it is the AMAZON Fire TV Stick so what do you expect. Still manage to get Netflix easily and awesome for hotels with free wifi when I gotta have my own in-bed movie/TV faves. Other issue is that depending on the TV, screen may not \"fit\" so you may have to adjust screen size repeatedly- means you gotta have the original remote for your tv handy. Also, now that DISH provides free Netflix app for, may not be as handy since I tend to watch more Netflix than Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Ip Lady"}, {"rating": 5.0, "review": "Great item.  Only wish I could plug in headphones like with Roku3.", "verified": true, "helpfulness": "0/0", "author": "Darlene Hall"}, {"rating": 5.0, "review": "I love my Fire TV stick!  It has made my life so much easier.  Why did I wait so long?", "verified": true, "helpfulness": "0/0", "author": "abluesfan"}, {"rating": 4.0, "review": "I have an apple tv as well. The fire stick definitely runs slower than the Apple TV, but well worth the sacrifice to have a whole host of additional apps. Not to mention, the price was fantastic.", "verified": true, "helpfulness": "0/0", "author": "Brent Dibble"}, {"rating": 5.0, "review": "this product is great. and works just as great. thank you amazon", "verified": true, "helpfulness": "0/0", "author": "duke nj"}, {"rating": 5.0, "review": "Cool technology", "verified": true, "helpfulness": "0/0", "author": "Joe Paulsen"}]