[{"rating": 5.0, "review": "Great better the n smart tv", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "We have been using it for about a week now and are very pleased with it. Very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Sherry M"}, {"rating": 5.0, "review": "Great item to have!", "verified": true, "helpfulness": "0/0", "author": "Malori"}, {"rating": 1.0, "review": "So you need an active internet connection to use this?  Most TV's are already wifi enabled or able to connect to the internet.  If you already have a Amazon Prime account.  You don't need this.Now where this would be actually advantageous is that you use it to download programs and movies available on prime to the device and migrate it over to your tv or another media viewing source (i.e. laptop) at a location not able to receive a tv or internet broad cast and watch the downloaded content.  WOW!!!  No there is an idea.  No need to waste money on this when there are cheaper identical versions from other vendors providing the same content.", "verified": false, "helpfulness": "1/7", "author": "T. Rogers \"T Rog\""}, {"rating": 5.0, "review": "Fantastic product at a fantastic price.", "verified": true, "helpfulness": "0/0", "author": "Ricky W."}, {"rating": 5.0, "review": "Very nice! User friendly! Excellent gift", "verified": false, "helpfulness": "0/0", "author": "Laura Williamson"}, {"rating": 2.0, "review": "Data compression is soft.  HD is not true HD.  Audio is great.  As per your reviews of Nov 2014 Netfix does not work!  My Driver is Oct 2014.  What good is it without Netflix?  Amazon Prime is a waste.  Movies you do not want to watch.  Everything good is Pay me now.  I wasted my money on this.", "verified": true, "helpfulness": "0/2", "author": "Thomas M. Graefe"}, {"rating": 2.0, "review": "Bought for my daughters room but it simply won't stay connected even though it has good signal strength. Tried in all other upstairs bedrooms, (routers downstairs) and it works fine. All other wifi devices work in their room fine. Doesn't make sense. Where it does work it's a nice device. Unfortunately the room it's intended for it won't work. 😞", "verified": true, "helpfulness": "1/2", "author": "Angela Patterson"}, {"rating": 4.0, "review": "Froze only once so far, had to unplug and replug power.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Great! Only issue is sound messes up but you just have to turn off/unplug and that fixes the problem.", "verified": true, "helpfulness": "0/0", "author": "Valiantotter"}]