[{"rating": 2.0, "review": "I bought the FireTV and FireTV stick as soon as they came out.  The FireTV is fast, fluid and surprisingly refined.  The FireTV stick, on th other hand, is the FireTV's slow-witted brother after the horse kicked it in the head.  It's slow, jerky and mine were plagued with wireless disconnect issues.  (Tested 2 different sticks, 2.4 and 5 GHz with 4 different APs from 4 different manufacturers and various settings with AP is less than 10 ft away through drywall with wood studs.  A Roku 3 in the same spot is flawless.).Combine all that with the cheap remote (without voice search) and this isn't worth the savings over the full FireTV.", "verified": true, "helpfulness": "1/1", "author": "DC \"DC\""}, {"rating": 4.0, "review": "Better than my Roku box.  Better than my Samsumg smart TV features (lightning fast in comparison).  Will be 5 stars when the promised software upgrade for use on portal wifi systems (as in hotels), which is why I purchased the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "RS"}, {"rating": 4.0, "review": "i like that it`s truly \"portable\"...", "verified": true, "helpfulness": "0/0", "author": "Jailer92 \"jailer\""}, {"rating": 1.0, "review": "I definitely like the roku better. Roku seems to offer more stuff free. Especially kids channels where amazon fire wants you to pay for everything", "verified": true, "helpfulness": "1/2", "author": "Billie evert"}, {"rating": 1.0, "review": "More parental controls and a users guide for them", "verified": true, "helpfulness": "1/1", "author": "Melissa S."}, {"rating": 5.0, "review": "Yes!! All expectations and then some", "verified": true, "helpfulness": "0/0", "author": "Eric C."}, {"rating": 5.0, "review": "Should've gotten this when it first came out.  Super deal when coupled with Amazon Prime!", "verified": true, "helpfulness": "1/1", "author": "W. M. Katz \"roofbk\""}, {"rating": 5.0, "review": "Works great love it", "verified": true, "helpfulness": "0/0", "author": "Daniel Castro"}, {"rating": 5.0, "review": "I am satisfy", "verified": true, "helpfulness": "0/0", "author": "DeniseBrookins"}, {"rating": 5.0, "review": "After a couple of weeks of use it failed to connect to the Internet. I tried every rebooting move I could think of but nothing worked. When I connected my iPad it streamed Netflix without a problem from the tv USB port .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]