[{"rating": 3.0, "review": "needs more entertainment apps and better use of the home screen. It is great that they show all of my amazon prime stuff but what if I wanted to add a different service. Also when scrolling into a menu, there is no need to single out that row of apps. Otherwise, it loads fast and that is great", "verified": true, "helpfulness": "0/0", "author": "NickWizz"}, {"rating": 5.0, "review": "Easy set up, tons of shows and movies", "verified": true, "helpfulness": "0/0", "author": "Becky Saucerman"}, {"rating": 1.0, "review": "The number of apps is dismal. Roku is better if you R already a member of Netflix. If you don't have HBO or Netflix, Amazon Prime will get you partial seasons of HBO original series but if you are already a HBO subscriber, HBO Go app not available to try & get u to subscribe to Amazon Prime. Plus the Stick must be plugged in to a power cord.", "verified": true, "helpfulness": "0/0", "author": "Nokautu"}, {"rating": 4.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Nicole H. Robinson \"Nik\""}, {"rating": 5.0, "review": "I was wanting something to get my Prime movies to my TV as well as Netflix, other than a blue ray DVD player that wasn't working all that great  This solved everything.  Everything is on my TV now and a click away.  And it has apps I can go to for even more videos etc. For $40!  Well, worth it. Very happy!", "verified": true, "helpfulness": "0/0", "author": "Jill"}, {"rating": 5.0, "review": "It was easy to install.  However, I wanted to view Bosch on my big screen and hope that there will be a season 2.  Excellent viewing and hope to see more.", "verified": true, "helpfulness": "0/0", "author": "rroyce701"}, {"rating": 5.0, "review": "Does what it is supposed to do.  Even included a short extension for the cable, as my tv is a little bit older and has a curve near the HDMI port that didn't allow a straight plug in.", "verified": true, "helpfulness": "0/0", "author": "April \"melissa\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Daniel de Sousa Mendes"}, {"rating": 4.0, "review": "I like the item very much", "verified": true, "helpfulness": "0/0", "author": "evelyn"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "adrienne"}]