[{"rating": 5.0, "review": "I love the Fire TV Stick. Up use it in the TV in my kitchen and I get to enjoy TV while I amworking out.  I LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Jennifer Kennerly"}, {"rating": 5.0, "review": "Great product! It allows me to watch all my favorites like Netflix and Hulu plus, but it's easier to transport than something like the full size FireTV. I love it for hotels as well because we all know there is never anything good to watch on those crappy TVs. Would love if it allowed you to just connect to the Internet.", "verified": true, "helpfulness": "0/0", "author": "David Marabella"}, {"rating": 5.0, "review": "Love it! Have Chromecast but could not use it on certain tv's as they have no remote - must be controlled with cell app. The Fire Stick has the perfect remote! Works like a charm, easier to set up than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Ask me about our weenies! www.gulfcoastdashchundrescue.org\""}, {"rating": 5.0, "review": "Very simple to install and us. Me grandkids love it.", "verified": true, "helpfulness": "0/0", "author": "Thomas R. Shoopman"}, {"rating": 5.0, "review": "Absolutely love it but the intro to it was long.", "verified": true, "helpfulness": "0/0", "author": "Angel"}, {"rating": 4.0, "review": "Works great And easy to use.  4/5 because it should have a browser.", "verified": false, "helpfulness": "0/0", "author": "TinyTurnips"}, {"rating": 5.0, "review": "This is so much easier to use than waiting for the playstation to boot up. Turns on instantaneously! What a great product. and its so small you dont even notice itl", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 4.0, "review": "I really do like it but my cable provider is Dishnet Work and half of the apps don't recognize it 😕", "verified": true, "helpfulness": "0/0", "author": "luvmykindlereads"}, {"rating": 4.0, "review": "Found out this won't work with a DVI to HDMI adapter.  It will only work if your TV has a HDMI connector.  Otherwise, I love it!!", "verified": true, "helpfulness": "0/0", "author": "AMR"}, {"rating": 5.0, "review": "Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]