[{"rating": 1.0, "review": "The item does not work. I returned and got a new one 3 times....I just bought a new 2,000$ TV and it won't work. I upgraded my internet, I called customer service, I updated my tv, I did everything they told me. This product is the worst thing I have ever bought.Amazon pulled Amazon prime app from every TV and device forcing people to buy this stick that does not even work....Amazon prime you to be amazing and something I would brag about, now it just feels like a scam.", "verified": true, "helpfulness": "0/3", "author": "NM"}, {"rating": 2.0, "review": "Didn't work at first had to call Amazon to get system to work", "verified": true, "helpfulness": "0/0", "author": "james butler"}, {"rating": 5.0, "review": "This is really a lot more than I thought it would be.  It is fantastic easy to use and install", "verified": true, "helpfulness": "0/0", "author": "Dana Grigg"}, {"rating": 5.0, "review": "Yes works great", "verified": true, "helpfulness": "0/0", "author": "Denise Johnston"}, {"rating": 4.0, "review": "More apps would make it better, but all in all a nice easy interface that I can only expect will get better and better.  It's surprisingly fast as well for a stick device.", "verified": true, "helpfulness": "0/0", "author": "Rob Keiser"}, {"rating": 5.0, "review": "Why waste time and money trying to find the right usb to Hdmi for the fire HDX 7 it's worth the $39.00 for the Fire Stick it's easy to hook up and it works great", "verified": true, "helpfulness": "0/0", "author": "D.G."}, {"rating": 1.0, "review": "I upgraded to fire tv, these sticks just don't have enough processing power.  The menu is just too slow for my taste.", "verified": true, "helpfulness": "0/1", "author": "Joshua A. Lake"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "Bravo Amazon, bravo!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If I had bought this first, I probably wouldn't have bought a chromecast.", "verified": true, "helpfulness": "0/0", "author": "Sarah Lane"}]