[{"rating": 4.0, "review": "Very happy with it", "verified": true, "helpfulness": "0/0", "author": "Jose L. Galloza"}, {"rating": 5.0, "review": "Love it, works better than my Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Excellent organization, clean home page/presentation. Shows were streaming well but there are intermittent disturbances, lasting a second or two every few minutes, that show a blurred picture and a loud electronic interference noise... I'm hoping these are growing pains and that it gets better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it works great glad I got this instead of the box.", "verified": true, "helpfulness": "0/0", "author": "G. Renieris \"georgioblindman\""}, {"rating": 5.0, "review": "Works flawlessly with remote. Good product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Ordered under the $19 deal Amazon had going and mine arrived over the weekend.  So far, I love this thing!  Easy navigation, access to most content you'd want to stream, fun games, good parental controls.  I'd give it 5 stars except I found the YouTube app to be extremely low quality and there's no HBO Go.  I'd like to see more cable network streaming apps available.  Also, more games.  Overall, pretty cool and well worth the money.  So far, I like it better than Chromecast and Roku.  Great product!  I'll be picking up another one if I see it go on sale again.", "verified": true, "helpfulness": "0/0", "author": "J. Pratt"}, {"rating": 5.0, "review": "Great little device that allows streaming of Netflix, Amazon Prime, and photos stored on Amazon Prime.  Needs a power off button though.", "verified": true, "helpfulness": "1/1", "author": "C. Marshall"}, {"rating": 5.0, "review": "I am exteremly happy with this product. It makes streaming through my Amazon Prime account features very easy. This is a total winner, and for us Prime members was offered at 50% off when introduced.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Gary in Sun City, AZ"}, {"rating": 5.0, "review": "its wonderful", "verified": true, "helpfulness": "0/0", "author": "Clay Coury"}, {"rating": 5.0, "review": "What a bargain for $19 on the 2 day sale! Streaming Amazon or Netflix through my TV or Blu-ray player always seem to buffer quite a bit with my Internet connection which is not the fastest. I have watched several movies since receiving fire TV stick and it has not buffered at all, picture is very clear and the sound is awesome through my sound bar! I use my phone as a remote and it works flawlessly. Set up was a breeze and I was up and running within 10 minutes.", "verified": true, "helpfulness": "1/1", "author": "KIBILL"}]