[{"rating": 5.0, "review": "Bought to bring Amazon Prime programming to my TV.  Works fantastic.", "verified": true, "helpfulness": "0/0", "author": "GeoWib \"GeoWib\""}, {"rating": 3.0, "review": "Streaming for Prime videos is great.  Everything in one box.  Unfortunately it doesn't allow my Surface Pro 3 to mirror cast to it.  If that worked I'd give it a five stars.", "verified": true, "helpfulness": "0/0", "author": "Edward Bruning"}, {"rating": 5.0, "review": "I really like fire stick,  its everything I was looking for but I need to purchase game control next but it's a great in vestments to have. I will be purchasing two more for my family. ..", "verified": true, "helpfulness": "0/0", "author": "bobbie barefield"}, {"rating": 5.0, "review": "I paid $400 extra to get a smart tv now for $40 I get the same thing.", "verified": true, "helpfulness": "0/0", "author": "james"}, {"rating": 5.0, "review": "Very happy with the Fire Stick. !!!", "verified": true, "helpfulness": "0/0", "author": "Zee Lynch"}, {"rating": 5.0, "review": "Love it! It is much faster and more user friendly then my blue ray player for watching Netflix & Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Somporn P."}, {"rating": 1.0, "review": "Too many disconnects and issues connecting to Netflix especially.  It doesn't work as well as my Roku.  Hulu Plus doesn't stay active as well and quits mid movies.", "verified": false, "helpfulness": "2/2", "author": "Tory"}, {"rating": 5.0, "review": "Exactly as advertised. A \"no-brainer\" if you are an Amazon Prime member. Easy to setup and use. I am not a gamer, but for watching Amazon movies/TV and Netflix it works great.", "verified": true, "helpfulness": "0/0", "author": "Michael B. Menaker"}, {"rating": 5.0, "review": "Works great just as I expected it to.  Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth VanValkenburg"}, {"rating": 5.0, "review": "As a Prime member, it was a no-brainer to order it when it was $19. I really don't need it as I have several Rokus and smart DVD players plugged into my TVs but I thought for the price, I would try it out. It is a great device, very easy to connect to your TV and get watching some content. I like the looks of it; it's small and sleek. The only gripe I have is that I had a difficult time opening the remote to put the batteries in. Overall, I would recommend it if you don't already have internet access with an existing device.", "verified": true, "helpfulness": "0/0", "author": "Boca Cat"}]