[{"rating": 5.0, "review": "Awesome,  sheer awesome", "verified": true, "helpfulness": "0/0", "author": "dustin jenkins"}, {"rating": 4.0, "review": "It was OK haven't used it much yet but I'm sure it is amazing gadget to watch show movies etc. Arriving time with amazon is great as always", "verified": true, "helpfulness": "0/0", "author": "JOEL"}, {"rating": 3.0, "review": "It works as described, basically turning any non-smart tv into a smart tv.  However, it does not work for the use I intended.  First of all, it only works if you have wifi.  We bought this to use at our campsite where we have no internet. I called prior to purchasing and was told that you did not need wifi and that it would work similar to a blue tooth device.  As such, we ordered a fire stick as well as a new fire tablet that supported the second screen function.  We planned to be able to purchase movies from amazon, download them onto our kindle and then plug the fire stick into the tv and play the downloaded movies on the kindle through the television.  Unfortunately, this does not work.  You have to have wifi in order for the fire stick to do anything. Also, the only thing \"second screen\" even works on is amazon prime, it does not work for netflix or youtube or anything else.  Here is my question, if you have a fire stick and you have wifi, why would you ever even need the \"second screen\" function on your kindle...all of the content you are able to transfer to the tv is already on the fire stick.  If anyone can answer this or has figured out how to use the fire stick without wifi I would love to hear about it!", "verified": true, "helpfulness": "0/0", "author": "Mom of two"}, {"rating": 5.0, "review": "Absolutely meets my expectations. Easy to install and works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "donk1"}, {"rating": 5.0, "review": "Wonderful device. Has the Chromecast beat hands down.", "verified": true, "helpfulness": "0/0", "author": "A. Halpern \"wifiguy\""}, {"rating": 5.0, "review": "Simply put, it's everything it is advertised to be. In 2014, that is hard to find. If you're looking for a one-stop system for all your entertainment apps, this is the product for you. I have Fire TV Stick and Google Chromecast. While I give them both 5 stars, the Fire TV Stick is more user friendly for those who are not as technologically inclined or more used to a cable operating system.", "verified": true, "helpfulness": "0/0", "author": "Brian H."}, {"rating": 5.0, "review": "Quick setup works well love it", "verified": true, "helpfulness": "0/0", "author": "evil \"evil\""}, {"rating": 2.0, "review": "While this is a nice, small sized unit with the remote, I am returning this and am not satisfied.Frequently, when watching Netflix, it will suddenly say there's no connection and stop. I can try again several times, and usually nothing happens. Occasionally, I can reboot the device and it will begin working, but not very often. When I go into the diagnostics and check the network, it puts a big, red X in front of every Netflix server.However, when I switch to another HDMI port that has my Roku stick, Netflix plays fine.Also, there is no internal way of playing local video, and I use this feature enough on my Roku that it is annoying to not have it.Basically, I have to keep my Roku stick installed in order to maintain reliable service and to play local videos. So, what is the point of having the Fire TV Stick? The Roku will still play Amazon Video just fine, including my Prime account.I don't know if the Netflix issue is just an unfortunate occurrence for me, or if it's a ploy to get you to watch Amazon Video! :)", "verified": true, "helpfulness": "0/1", "author": "Matthew J. Brock"}, {"rating": 3.0, "review": "no HBOGO yet", "verified": true, "helpfulness": "0/0", "author": "JPTech"}, {"rating": 3.0, "review": "It's ok but there are more movie selections on Netflix. So it's a good thing I already have an account. It's not all bad though . Unfortunately, my bandwidth can't keep up with its demand. It keeps losing connection with my server. Once I Increase that I am sure I will like it a lot more.", "verified": true, "helpfulness": "0/0", "author": "Chad Hitchcock"}]