[{"rating": 5.0, "review": "Love this. Already have a different brand streaming stick and didn't know if Fire Stick was also necessary but the app and program offerings are great with lots of variety. Very user friendly and the remote included is very convenient.", "verified": true, "helpfulness": "0/0", "author": "Anna McConnell"}, {"rating": 5.0, "review": "It is great & I recommend this to everyone!", "verified": true, "helpfulness": "0/0", "author": "Rebecca Sharp"}, {"rating": 4.0, "review": "I decided to get rid of cable TV because it is not worth the money. It don't give you everything thing cable gives you, but it does give you enough. Still need to be careful, because you can find yourself paying just as much as cable to be entertained.", "verified": true, "helpfulness": "0/0", "author": "RRD"}, {"rating": 5.0, "review": "Great, saved me a lot of money", "verified": true, "helpfulness": "0/0", "author": "Arial H."}, {"rating": 3.0, "review": "Though the interface has greatly improved, I find that it is somewhat sluggish compared to other devices such as the Roku (albeit the Roku 3 has a much faster processor).I also find that apps made for Fire TV are inferior to the ones made for the Roku. For instance, fast fowarding on the Netflix app on the Roku, is much better than doing the same thing on Fire TV.Overall, this is a good device, and does a lot given the size of it.", "verified": true, "helpfulness": "0/0", "author": "SweeeeeetAs"}, {"rating": 5.0, "review": "MYHUSBAND USES IT AND LOVES IT", "verified": true, "helpfulness": "0/0", "author": "SUNSHINE"}, {"rating": 4.0, "review": "Easy to install and works great.  Does not have voice.", "verified": true, "helpfulness": "0/0", "author": "David Rubenstein"}, {"rating": 5.0, "review": "so glad we got this! get to listen to youtube music and watch netflix and amazon shows on the big screen!", "verified": true, "helpfulness": "0/0", "author": "matt pletcher"}, {"rating": 5.0, "review": "This device is wonderful! So many different options. I mostly use it for Netflix, but everything loads quickly and It's very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 5.0, "review": "Worth it", "verified": true, "helpfulness": "0/0", "author": "Jeffrey S."}]