[{"rating": 2.0, "review": "I have had a lot of problems getting the fire stick to stream, costing more money to get wifi extenders and other things. I have to reboot it almost every time to watch it. It has all the same features as the Fire TV, I've had zero problem with the Fire TV. It's really just a hassle.", "verified": true, "helpfulness": "0/1", "author": "Jennifer Greer"}, {"rating": 1.0, "review": "I really wanted to like the Fire TV Stick, but it's been a total dud. I've spent an hour trying to get it up and running and it keeps telling me it can't connect to Amazon.com. We have other devices, like laptops and a PS3, in the same room that have no connectivity issues. I've reset my router, turned my tv off/on, unplugged the Fire TV Stick and it's just not working. Unfortunately I bought two of these - one for us and one for my parents for Christmas. Looks like I'm going to have to get something else :(", "verified": true, "helpfulness": "1/3", "author": "Michele Cruz"}, {"rating": 5.0, "review": "Wow! I am so pleased with my Fire TV Stick.  Very easy to setup and lots of available movies and more for me to watch. It is great for my Amazon Prime viewing and YouTube and on and on!!!I will have to purchase another one of these.", "verified": true, "helpfulness": "0/0", "author": "Ted \"tedpas\""}, {"rating": 5.0, "review": "This is awesome! My family loves it! I like the apps and the ability to listen to music and watch videos on demand. The music I had in my Amazon account plays as karaoke! Couldn't believe it, but we sure had some fun with it. The kids like the games too. I had a Chromecast before and this is 100 times better.", "verified": true, "helpfulness": "0/0", "author": "GJ \"3boysprmom\""}, {"rating": 5.0, "review": "Better than AppleTV.  Better than CHROMECAST!!!  BUY IT!!!", "verified": true, "helpfulness": "0/0", "author": "SMEGMOBILE"}, {"rating": 5.0, "review": "Love the product", "verified": true, "helpfulness": "0/1", "author": "Scott"}, {"rating": 3.0, "review": ".. the usb cable they give you is short... waaaay too short... it does what it says... not worth upgrading from even Roku 2 though.", "verified": true, "helpfulness": "0/0", "author": "eric crenshaw"}, {"rating": 3.0, "review": "So, this is great if all you want to watch is Prime.  Everything else is buried in the worst interface I have ever seen.  I taught interface design.  I don't know that it makes me an expert, but it does mean that I have seen a lot of designs.  This is second worst interface I've been subjected to.  I set it up and worked with it for an hour or two, marveling at the plethora of pointless channels like the Foggy Waterfall channel.  Really.  One waterfall. Not waterfalls.  Anyway, the vast amount of channels is a joke.  And lastly, the sound was mediocre.  I took it back off and plan to foist it off on someone else.  I gave it three stars because its OK.  I have all of the other media streaming devices, so if you want an enjoyable video experience, go elsewhere.", "verified": true, "helpfulness": "2/2", "author": "C. D. Zuff"}, {"rating": 5.0, "review": "It works much better than expected.  I highly recommend it!!!", "verified": true, "helpfulness": "0/1", "author": "SKH"}, {"rating": 5.0, "review": "Great device.  I had to get two for my travel and works great.  So I have the Fire TV box in one room and one fire stick in another and one fire stick to travel", "verified": true, "helpfulness": "0/0", "author": "nofearxp"}]