[{"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "A.P."}, {"rating": 5.0, "review": "Such a neat invention and the price was unbelievably low.  Makes movie watching easy.  Thank you Amazon", "verified": true, "helpfulness": "0/0", "author": "Sunni Morgan"}, {"rating": 3.0, "review": "The stick works quite well, easy to use. The interface is not quite as nice as an Apple TVThe only slightly annoying part is the number of clicks it takes to open an app like netflix or Hulu for example.", "verified": true, "helpfulness": "0/0", "author": "Johannes klupfel"}, {"rating": 5.0, "review": "Wow. Stayed up all night the first night watching HBO series Pacific. Received fire stick as a Christmas gift. What fun turned my tv into my Kindle !", "verified": true, "helpfulness": "0/1", "author": "Vickie Lee Zare-Grooms"}, {"rating": 5.0, "review": "So far soooo good! I love it!", "verified": true, "helpfulness": "0/0", "author": "E. Ann Gill \"A nn\""}, {"rating": 5.0, "review": "Works just like the full sized Fire TV box, except WiFi only (no Ethernet jack), no RCA and fiber audio output (HDMI only), and no voice search on the remote (but I think you can buy a remote with voice search).  I gave it five stars because it works great considering the price.  However, I sometimes have to reconnect to the network when I first start using it if it's been sitting awhile, even though Wifi signal is strong and no issues with other devices.  My full sized Fire TV box that I've had for a year is connected via Ethernet cable, and has no issues.  Hopefully this slight quirk can be corrected in firmware soon.  All things considered (including price), I'm quite happy with it.", "verified": true, "helpfulness": "0/0", "author": "SnatcherGeek \"snatchergeek\""}, {"rating": 5.0, "review": "I really like this. I used a chromecast before, but this is much easier to install and to use. Highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Moira West"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jessica Rudolph"}, {"rating": 5.0, "review": "I love the stick! The HD picture quality is superb. It was really easy to connect to the tv just stick it in the hdmi port and connect to wi fi. Great product. Its definitely an upgrade over my RoKu2.", "verified": true, "helpfulness": "0/0", "author": "SFord"}, {"rating": 4.0, "review": "All good. But remote response is slow for small games also.", "verified": true, "helpfulness": "0/0", "author": "pche"}]