[{"rating": 5.0, "review": "GREAT! Awsome little product keeps the family entertained with movies, games youtube.", "verified": true, "helpfulness": "0/0", "author": "Alberto Mattar \"BERTIMUS MAXIMUS\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "We have a few chromecasts and opt to use it instead of the Firestick for streaming netflix because it seems to have a sharper picture and never gets caught buffering. The fire stick consistently needs to buffer to watch Netflix. Our Internet speeds are 50 mbps down and 5 mbps up. The only reason we got the fire stick is because there is no Sling TV app for chromecast yet. Will be nice to be able to rent Amazon movies since we are prime customers however wish they just made a chromecast app as well.", "verified": true, "helpfulness": "0/0", "author": "dbrand"}, {"rating": 5.0, "review": "Love it. Works great. Would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Starr Gardinier"}, {"rating": 5.0, "review": "Great purchase, highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Matt manuel"}, {"rating": 5.0, "review": "I like this a lot. I bought this for my bedroom. I don't have cable or satellite. Just Hulu and Netflix. What sold me was that it came with a remote. So I am not constantly having to use my phone(con for me. Maybe a pro for others?) The 1 beef I have with the remote is that I cannot control my tv's volume or on/off. My Xbox remote can do it in my living room. Why can't this one do it?", "verified": true, "helpfulness": "0/0", "author": "Jarrett Lee Bedynek"}, {"rating": 1.0, "review": "I got this for free with the offer for 3 months of Sling TV and even for free its not worth it.  If you can get wireless signal on it at all, you will eventually lose it.  None of the other devices in the vicinity of the this have any problems at all maintaining a wireless signal yet this constantly drops it.  Right now, all it is good for is getting hot while plugged into my TV.", "verified": true, "helpfulness": "0/0", "author": "Michael Peters"}, {"rating": 4.0, "review": "I like the Fire TV Stick  and the Fire TV I have but putting in batteries is a great challenge.  This is something that needs to be fixed...put something to hold on to on the battery compartment door to remove it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Gadget Lady"}, {"rating": 3.0, "review": "The fire stick is presented as if it is wireless, however it is important to know that it has to be plugged in to work. This can make it a nuisance, and it isn't noted anywhere in the description or pictures. Additionally, we have had issues with our Netflix buffering on the TV set using the fire stick. Our other TV sets stream through other means (i.e. playstation) and we have no buffering issues.", "verified": true, "helpfulness": "0/0", "author": "Cailin"}, {"rating": 5.0, "review": "LOVE this product, awesome movie selection and games, streams really well and the shipping was very fast! better than cable!", "verified": true, "helpfulness": "0/0", "author": "Kerrissa"}]