[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Set up was very easy and I had none of the connection issues that I experienced with the Roku Stick (since returned).", "verified": true, "helpfulness": "0/0", "author": "K. Rennie"}, {"rating": 1.0, "review": "The fire stick Nerflix app doesn't work very well. Buffers all the time.  This is definitely a problem with the stick.  I've run it side by side with my roku and the roku never falters while the fire stick consistently does.  Check other reviews... Everyone has the same problem.  Amazon help is worthless too, they just run you in circles telling you the issue must be on your side.  Go with roku, chromecast or Apple TV.  I can't think of one reason to go with firestick over these.", "verified": true, "helpfulness": "0/0", "author": "James Cruikshank"}, {"rating": 5.0, "review": "I Love it. It was easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "D.D."}, {"rating": 1.0, "review": "This thing was terrible.  Don't buy it.  There are numerous connectivity and software issues with this device.  Get a roku box or wire your tv to a router", "verified": true, "helpfulness": "0/0", "author": "David Helcel"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Deanna Cristine"}, {"rating": 5.0, "review": "Great replacement for my monthly $130 satellite bill. Easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "Rbrent"}, {"rating": 5.0, "review": "I liked how I could use it for gaming, movies/videos and more.", "verified": true, "helpfulness": "0/0", "author": "tanyon jonthan harber"}, {"rating": 5.0, "review": "It's just like setting up the other Fire TV's that I have.This is perfect because we are always on the road & watching regular TV isn't the same any more w/us.When I first got my email from Amazon, I was thrilled that now I can a smaller version of it on the road.Of course, there was some issues w/using hotel Wi-Fi. I was so glad to hear that it got fixed.Waiting to use it next week on the road.I had only on problem: NO DIRECTION ON OPENING THE REMOTE! That would have been helpful. So maybe there's something that someone can work on. Maybe something like the other remote a thumb place or a latch. It really needs some work.", "verified": true, "helpfulness": "0/0", "author": "dibbers \"linda\""}, {"rating": 1.0, "review": "HORRIBLE purchase.... Right out of the box and does not work at all. Connected to my wifi (which is very fast and very reliable on every other device I own) and the Fire Stick kept saying that the connection was lost. It would reconnect for a few seconds, then lose connection again. I finally got it to play a TV show that I commonly watch on another device that I use to stream Amazon Prime, and the picture was literally so blurry that I could hardly see what was going on. I do not have HD so I'm not just seeing some difference between HD and normal definition.... This was beyond anything I've ever seen. Maybe I got a defective device?? Be sure to open yours right away so you can test it and return if needed. I'm really shocked, considering how much I love Amazon. I never even take the time to write reviews for anything but this takes the cake.... Worst purchase ever. I unplugged it and put it back into the box to return it after an hour and a half of frustration.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Proctor"}]