[{"rating": 5.0, "review": "The Best TV Stick ever ! very fast and quality product ! got it for $24 Bucks ! can't get better than this ! Love Amazon , Love Fire TV Stick !", "verified": true, "helpfulness": "0/0", "author": "Amish"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Tammy L. Swartz"}, {"rating": 2.0, "review": "I seem to be one of the unlucky ones that is having Wifi connection troubles. I'm using a Wifi \"G\" network, and the FireTV Stick is connected to the back of my Sony receiver and in a cabinet. The WiFi connection is constantly coming and going...and I am using the extender cable (which is very short...about 1\"). It's in the same cabinet with my Sony Bluray player that is able to stream HD movies with no troubles from the same router.The remote is also very \"glitchy\"...it sometimes won't respond at all, and then \"catches up\" all at once to past commands. I suspect that the device software gets hung up dealing with the WiFi problems, which causes the remote to stop responding.I'm buying a 6 ft HDMI extended cable to see if repositioning the Stick will work.From what I have seen, I like the UI, and I really like how it connects automatically to my Amazon account and CloudDrive Photos....I'm looking forward to using it for slide shows.I just hope I can get it to work...luckily I only paid $19 for it (but now I'm buying an $8 HDMI extended...hmm....)** UPDATE **Tonight, I used an Android app on my phone called \"WiFi Analyzer\" to check the signal strength inside the cabinet. The app suggested that WiFi channel 6 had less \"competition\" from my neighbors (the router was previously on the \"auto\" channel setting, and had chosen channel 1). After switching to channel 6 in my router, things definitely seem to have improved. The network drops still occur, but far less often, and I was able to stream an entire \"Flight of the Conchords\" episode with only one buffering issue. I still think that the FireTV Stick has especially finicky WiFi reception, so you have to have to be extra careful with your network setup if you're having problems. Hopefully, the longer HDMI extender will allow me to reposition the stick to improve reception further...", "verified": true, "helpfulness": "0/0", "author": "Brian R. Williams"}, {"rating": 5.0, "review": "This is a Awesome product.Quick and easy to hook up.I'm going to buy another one.5 Star product for sure!!!", "verified": true, "helpfulness": "0/0", "author": "Maurio Davis"}, {"rating": 2.0, "review": "small compact and worked fine for a while then it started shutting down and I have to unplug it several times a day  , and as an additional insult my program will stop and it asks if I am still watching what a pesty  piece of junk , I would return it but it's not worth my trouble.", "verified": true, "helpfulness": "0/1", "author": "H. Barnes \"Hi Tek Redneck\""}, {"rating": 5.0, "review": "It's 20939094 Times faster than running Netflix or anything else.. through anything else.  Amazing Quality and Load time.  BUY THIS!", "verified": true, "helpfulness": "0/1", "author": "Robert Smallwood"}, {"rating": 1.0, "review": "The product won't boot after the second time of using it.  I have it plugged in via mini USB to a power source and also to the HDMI 1 port.  The simplified design and force reset seem to work, but it never gets to the home screen.  A waste of money.", "verified": true, "helpfulness": "1/3", "author": "Kenny"}, {"rating": 2.0, "review": "Doesn't work in motels on wifi. Lacks ability to accept terms of use needs to be felt with. Not as advertised use anywere. In able to use very disappointed.", "verified": true, "helpfulness": "0/3", "author": "matt miller"}, {"rating": 4.0, "review": "I got the stick sooner than anticipated and it was SO WORTH IT. I was thinking about getting the Chromecast stick, but since this one was about the same price AND it supported Prime TV and Movies I gave it a shot. I don't have HBO-Go, which was the only thing Chromecast had that this didn't - so no big loss.PROS:1. Super easy setup. Everything is included: batteries, power cord, and remote. All you have to do is plug everything in and configure to your WiFi.2. Free app on Android devices. Using the app I can navigate with just the sound of my voice, which is pretty cool.3. NO BUFFERING. Using my laptop, tablet, or any other device I have a hard time with buffering speeds, but this thing is quick and I can binge watch Netflix/Prime/whatever to my heart's content.4. Amazon Prime movies and TV. Since I'm a Prime member, being able to stream their exclusive content made all the difference. There's only so much stuff on Netflix, you know?CONS:1. Not available on iOS yet. I have an iPhone and tend to use that more than my Kindle, but they're working on having it out soon so I just have to be patient.That's actually the only con I have so far.", "verified": true, "helpfulness": "0/0", "author": "DaniZombie"}, {"rating": 4.0, "review": "Easy to hook up and use.  A little counterintuitive that it does not shut off, and the interface is a little clunky for the Amazon Prime options.  I am mostly using for a direct path to Netflix at a very low cost.", "verified": true, "helpfulness": "0/0", "author": "Sopasalex"}]