[{"rating": 4.0, "review": "I bought this thing at best buy easy to install. The app to make your phone a remote absolutely genius. But what lacks in thought is the ability to sort my personal movie library In alphabetical order . Or TV and movie order I have get past my kids movies just to find my movies. I hate that! Give us a sort feature in our video library please.", "verified": true, "helpfulness": "0/0", "author": "Shark hook"}, {"rating": 3.0, "review": "I am sure that I will be enjoying Netflix now that it is connected.  Read comments above regarding my \"getting started\".  A video would have been so helpful!", "verified": true, "helpfulness": "0/0", "author": "Norma Jean"}, {"rating": 5.0, "review": "Best thing ever", "verified": true, "helpfulness": "0/0", "author": "Catherine Grossman"}, {"rating": 5.0, "review": "The first one was defective, but once we had the working product, we love, love love this product.  Streaming is very fast and we get a ton of movies with this.  Enough to last a lifetime.", "verified": true, "helpfulness": "0/0", "author": "Anna S."}, {"rating": 5.0, "review": "fast shipping item as described thank you AAA+++", "verified": true, "helpfulness": "0/0", "author": "Jason M. Richards"}, {"rating": 5.0, "review": "I bought this as a gift because there are few electronics that run Sling TV (live TV streaming app). Apple TV does not, though iOS does. Chromecast does not support it as far as I know. Fire TV Stick supports it and every other major entertainment app. It works way smoother than any other TV streaming device I've ever used including Apple TV and Chromecast. I love it.", "verified": true, "helpfulness": "0/0", "author": "Rick Saldivar"}, {"rating": 3.0, "review": "I lime firestick but they dont support all the sites i like. Example. Acorn tv.", "verified": true, "helpfulness": "0/0", "author": "Ted Mechnick"}, {"rating": 5.0, "review": "Good deal....FREE with Sling TV sign up. :-)", "verified": true, "helpfulness": "0/0", "author": "Simon P Mercado Jr"}, {"rating": 4.0, "review": "Super easy setup - great resolution,I dont miss cable or satellite TV at all!", "verified": true, "helpfulness": "0/0", "author": "Field Tech"}, {"rating": 1.0, "review": "Would be great if it worked. Has nice features but it won't stay connected to wi-fi and keeps resetting. Shows it has a strong signal but continuously disconnects every 30 seconds and takes as long to reset.", "verified": true, "helpfulness": "1/1", "author": "Bahamaroot"}]