[{"rating": 5.0, "review": "Ordered this item when it was on it's promo price for Prime members.  I had to wait because it was back ordered however...no big deal to me.  Still received my Fire Stick two weeks before expected delivery.Got the stick home and plugged it in.  Yes, you do need to plug the stick into a wall outlet to power.  I knew that and anyone that took any time to read the description should know that it won't power itself.Followed the simple instructions and I was connected to WiFi streaming Netflix in a matter of seconds.  1080p resolution is right on point.  I had no buffering issues even on a slower Comcast connection.  Speed is great.This is a wonderful product if you are looking for a simple quick way to get to online streaming sites such as Netflix or Prime.", "verified": true, "helpfulness": "0/0", "author": "carter"}, {"rating": 5.0, "review": "It combines TV and Internet for some fiery fun!", "verified": true, "helpfulness": "0/0", "author": "T. Barrett Stine"}, {"rating": 5.0, "review": "Works as advwetised.", "verified": true, "helpfulness": "0/0", "author": "H.Steve"}, {"rating": 5.0, "review": "LIKE IT", "verified": true, "helpfulness": "0/0", "author": "Buba"}, {"rating": 5.0, "review": "Awesome device", "verified": true, "helpfulness": "0/0", "author": "thatgirl"}, {"rating": 5.0, "review": "This thing is handy.", "verified": true, "helpfulness": "0/0", "author": "Adam Krahl"}, {"rating": 3.0, "review": "Edit:at first i thought this product was great.  but whenever i use netflix, the audio is constantly out of synnch wit the video.  it's not my internet because netflix works perfectly on my apple tv.  stream at your own risk.", "verified": true, "helpfulness": "2/5", "author": "david feldman"}, {"rating": 5.0, "review": "Hook it up was a challenge, but educational for me.", "verified": true, "helpfulness": "0/0", "author": "Karole M. Brown"}, {"rating": 5.0, "review": "I do not have a cable connection in my kitchen and thought this would be a good compromise.  I purchased an inexpensive 22\" Samsung TV and plugged the Fire TV Stick in.  I had everything set up and working in less than five minutes (including the TV :-)).  I love being able to listen to Amazon Music while I work.  I have streaming boxes on two other TVs and this device is better than either of them.  I would never have had the space to set up a Roku or Blue Ray streaming device.  Best impulse purchase ever!", "verified": true, "helpfulness": "0/0", "author": "Leigh"}, {"rating": 5.0, "review": "Purchased one of the Amazon Fire Sticks when they were a special price for Prime members.  I wish I had purchased more than one.  It works great with both Amazon Prime Video and Netflix.  The icing on the cake is that it also allows us to run a program to see our home security cameras on the TV.", "verified": true, "helpfulness": "0/0", "author": "Glenn Duquette"}]