[{"rating": 5.0, "review": "Awesome! Work's great!", "verified": true, "helpfulness": "0/0", "author": "Ann Mickelson"}, {"rating": 2.0, "review": "Still getting used to it, but as of now it looks like there is not as much free content for prime members as they claim. Maybe as I delve deeper into it, I will be more satisfied", "verified": true, "helpfulness": "0/0", "author": "Matthew J. Ciao"}, {"rating": 5.0, "review": "easy to set up.  Good choices.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Gerald Gray"}, {"rating": 4.0, "review": "Pretty cool idea. Able to watch a wide variety of movies, tv shows & documentaries. Only complaint is some of the old school tv shows/movies you have to pay for.  I'd expect to pay for new showings but old.  That's really my only complaint.", "verified": true, "helpfulness": "0/0", "author": "Megan Malouf"}, {"rating": 5.0, "review": "The Fire stick is very good. Love it.  It is very easy to use, similar to Roku box, even smaller.", "verified": true, "helpfulness": "0/0", "author": "A. Keleman \"AK\""}, {"rating": 3.0, "review": "Doesn't stay connected very well", "verified": true, "helpfulness": "0/0", "author": "Deborah Rathbun"}, {"rating": 5.0, "review": "The smart hub on my new Samsung curved 4k TV only works when it feels like it. The fire stick works flawlessly, easy to install and is loaded with features. I particularly like to photo and video transfer feature, my wife loves the exercises and other features. The only minus is having to have another remote around but it is small.", "verified": true, "helpfulness": "0/0", "author": "Gary L Rademaker"}, {"rating": 1.0, "review": "I had high hopes for the Fire Stick. After trying many times to get the stick to connect to the internet I gave up. I then had a tech friend over to help me. After trying many more time, it was determined the only way the stick will connect to my router is to have it in the same room as the router. This defeats the purpose of having the stick. My router is strong enough for me to use my Kindle in the bedroom, where the TV was suppose to connect.  I can also use my Kindle outside, so I know my router is sending off a strong signal. The Fire Stick is worthless, and now I am pass my one month to return it, so I am out $40.00.", "verified": true, "helpfulness": "1/2", "author": "Cynthia"}, {"rating": 3.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Robert Barron"}, {"rating": 5.0, "review": "arrived when it sai it would no problems at all.", "verified": true, "helpfulness": "0/0", "author": "Dennis A. Boyer \"DAB\""}]