[{"rating": 3.0, "review": "tried the amazon, and still prefer my old roku... Wish i would have paid more for the one with ethernet but the $100 price point doesn't see worth it anymore.", "verified": true, "helpfulness": "0/0", "author": "Chad B."}, {"rating": 4.0, "review": "Works as promised. But I have to say the box version works faster.", "verified": true, "helpfulness": "0/0", "author": "Alex G Salinas"}, {"rating": 4.0, "review": "Works great! Wish it had ability to hook up Bluetooth speakers", "verified": true, "helpfulness": "0/0", "author": "ashley m levy"}, {"rating": 5.0, "review": "The fire stick is awesome!  There are tons of movies and t.v. shows to choose from and the resolution is great. Best $24 I ever spent.", "verified": true, "helpfulness": "0/0", "author": "jeff Bryant"}, {"rating": 5.0, "review": "it works great, eliminated buffering that I had with my Blu ray player", "verified": true, "helpfulness": "0/0", "author": "quinn"}, {"rating": 5.0, "review": "I love my Amazon Fire TV Stick.It does everything its suppose to do.And if your an Amazon Prime member like me.You have tons of movies, TV series and music available to you for watching or listening.", "verified": true, "helpfulness": "0/0", "author": "Banny"}, {"rating": 5.0, "review": "I was having issues with streaming with one of the first generation rokus and this fixed the problem.  Easy to install and stream.  It was weird how it has apps though but great job.", "verified": true, "helpfulness": "0/0", "author": "Eric Lienert"}, {"rating": 5.0, "review": "easy to set up.  easy to use.  I love it", "verified": true, "helpfulness": "0/0", "author": "Laura Penton Lee"}, {"rating": 5.0, "review": "Simple to operate and set up.  Fantastic access to so many movies and documentaries, etc.  Can't believe I never bought one earlier. Has allowed me to downsize my current satellite TV service and save money.", "verified": true, "helpfulness": "0/0", "author": "Robin P Ives"}, {"rating": 5.0, "review": "we love the stick and all the movies we watch.", "verified": true, "helpfulness": "0/0", "author": "diane ryan"}]