[{"rating": 3.0, "review": "I could not wait to use this device.  Installation was very easy but my remote is very slow to respond and sometimes non responsive.  I have had the item for one hour and I am still not connected to Netflix because the remote will not work.  I have changed out the batteries Amazon sent as well.....  VERY FRUSTRATING!", "verified": true, "helpfulness": "0/1", "author": "Nicole Payne"}, {"rating": 1.0, "review": "So far I've used this it keeps dropping connection to the network. Every other device in the house has had no issue. When it works it is great but randomly loses connection. Then have to reboot it and get it to reconnect.Wish it also played nicer with phones. The app is basically a voice enabled track pad.", "verified": true, "helpfulness": "2/7", "author": "Paul Morehouse"}, {"rating": 4.0, "review": "I bought 2 of these within 15 minutes of them being announced because as a Prime member the $19 promotional price was way too sweet to ignore.Received them yesterday and have had a chance to put one through it's paces. I'm a cordcutter and I own 2 Chromecasts, a Roku 2, an Apple TV, an Xbox 360, and a media center running Linux XBMC as well so I am comfortable reviewing this product.Overall I'm pleased and here's why:Pros:$19 are you kidding me?Dual band WiFi is greatFaster than Chromecast with some appsPhysical remote control is nice to haveOption to play games is niceCons:HDMI extender was broken out of the box, luckily I had an extra one from a Chromecast I wasn't using because the stick itself is too long to fit in the slot for my TV without the extender to swing it out.No HBO Go (HUGE PROBLEM)Gaming is not practical without the $40 gaming remoteThis is a no-brainer for $19 but for $39 I'm not so sure. The Chromecast undercuts it by $4 but realistically you can get a Chromecast for $25 or less pretty regularly if you just watch for sales. If I didn't have a Roku or Apple TV I would buy the Fire Stick because the Prime video support is a must have and it's still not available on Chromecast (WTF Google/Amazon???) but if you have other options for Prime video I think you can pass on the Fire Stick unless you loathe using your phone or PC to cast video and would prefer the physical remote.My wife is a big proponent of the physical remote. She gets frustrated when sometimes the cast icon doesn't show up in Netflix on her phone so she has to relaunch the app. The problem with this remote as well as the Apple TV and Roku remotes is that it is just too small. The first company to add a \"remote finder\" feature to their smartphone companion app that will play an audible sound from the remote so you can find it will make a TON of money. I wouldn't pay extra for the remote with voice search in it's current state but I would ABSOLUTELY pay up if they added a speaker on it to locate it.In summary I recommend this product if you can pay $19 for it or if you are in need of a solution to stream Prime videos.", "verified": true, "helpfulness": "2/4", "author": "Paul Balcombe"}, {"rating": 2.0, "review": "Like a lot of other reviewers, I found the Fire Stick wouldn't update.  I finally used duct tape to hold the stick completely horizontal and extend past the frame of the tv back.  It finally updated after that, although my router is only about 10 feet away.Badly done Amazon.", "verified": true, "helpfulness": "0/13", "author": "Kindle Customer"}, {"rating": 2.0, "review": "I was lucky enough to see this on the initial 2 day Prime sale and get it for $19, and it is clearly a heck of a bargain at that price -- much more powerful that my Roku box.Pros:* Fast* Great WiFi connection* Good choice of apps* Simple design* Great price point* More likely to be kept up-to-date than competitors products* Fling feature to select stuff on phone or tablet and play on TV is FANTASTIC.* Remote control app on phone for voice lookup and other controls is neat.Cons:* Typeface Readability: I'm using a 32\" 1080P HDTV. I have no trouble reading movie descriptions and other onscreen info off my Roku box from across the room, even when running in 480P. FireTV stick's typeface at 1080p is unreadable from across the room. Prices for apps are unreadable. Prices for movies are unreadable. Caregory titles are barely readable. I actually spent several minutes determining what button to push for initial setup, because it looked like a circle with two dots inside instead of \"(>=)\". Really? How hard is it to make the very first instruction large and clear? Find a cleaner typeface and update, guys.* Weirdness: It should be pretty obvious that after an intital setup of an app like Netflix, if I select Netflix, I want to WATCH Netflix. Apparently not to the programmers, who move directly into the app if I select it from \"Recent Apps\", but if I select it from \"Popular Apps\" it takes me to the info page again and presents me with an \"open\" button (and all the rest of the initial info) instead of an install button. This is like selecting an icon on my phone to open an app, and having it take me to Google Play store. If \"Popular Apps\" is essentially an install category, why is it taking up space 2nd row down on my home screen?* Control weirdness: Using the back button or the left button inside apps like Netflix frequently takes me OUTSIDE of Netflix back to the nav / select app screen. This is annoying. Controls need to be more context sensitive instead of egotistically assuming I'm always trying to get back to Amazon's homepage content.* REMOTE CONTROL APP ON PHONE: For voice lookup and other controls; again \"Not Ready for Prime Time\". Relevant because it's using features like voice search on device.-- I've got one FireTV Stick: It asks me multiple times during use if I want to connect to my ONE device. Well D'uh! If it detected 3 devices, I'd need it to ask me which one I wanted to control - but I'd still want it to let me set a default.-- Voice search works, but isn't the sort of \"intelligent\" search we're now used to from Google. It will bring up a misspelled result with no relevant options and no results. If I can say an actors name and it misspells it and produces no results and no options, what use is searching by voice? Yeah, I know there's no actors named \"George Cluedy\" or \"Sharon Stonne\" or \"Steven Stegall\"-- The smartphone standard is that when you swipe right to left, icons follow under your finger right to left. If you swipe right to left in the remote control app, icons move left to right on the screen...or it boots you out of the app as if you'd pressed the \"back\" button if you're at the beginning of the list. Grrrrrrr.", "verified": true, "helpfulness": "0/3", "author": "Dex Sinister \"Dex\""}, {"rating": 5.0, "review": "got it so I could play my cloud music through my TV entertainment center. It works great all my songs are there and no glitches or pauses. I just plugged it into the wall outlet, put stick in HDMI in receiver, it found network, updated and has since worked great. Amazon video has also played great.  Very happy with the device.", "verified": true, "helpfulness": "1/2", "author": "Bob \"cbglacier\""}, {"rating": 1.0, "review": "The stick needs to be plugged in. That's a huge problem. But what's worse is that the chord is like 6 feet. Returning this Monday.", "verified": true, "helpfulness": "2/26", "author": "Tom"}, {"rating": 5.0, "review": "Remote works great for TV apps. Sideload another launcher if you do not like Fire TV's original launcher. We watch Chinese TV programs, sideload this with Shafa laucher, shafa manager (an app store, similar to play store), Taijie, MoreTV, and more...At $19, this is a steal! Even at $39, it is a great deal for a TV box, has more value if you know how to sideload android apps.", "verified": true, "helpfulness": "5/7", "author": "Danhong Yu"}, {"rating": 3.0, "review": "This appears to be an elegant solution to online/streaming movies/programs. The system is comprised of at least three parts: the wifi receiver, the remote, and the various system software packages. Everything works and is simple to set up, HOWEVER...When the wifi receiver is in precisely the same physical position as a Chromecast receiver, streaming reception is poor with frequent interruptions for buffering. The TV has a built-in Netflix receiver, which works perfectly. The house wifi is fast and issue-free. I tried the Fire Stick on another TV, with similar results. I must conclude that the fault lies in the Stick itself.FIVE starts for concept and software implementation, ONE star for wifi reception, so THREE stars overall.", "verified": true, "helpfulness": "0/3", "author": "HLE \"Supercritical\""}, {"rating": 5.0, "review": "This device is great for playing movies, especially if you are a Prime member.  Playback quality is equal to Chromecast.  It is also convenient that you can free up Kindle to play movie on other screen.", "verified": true, "helpfulness": "1/2", "author": "Bill"}]