[{"rating": 2.0, "review": "Not really a fan, I've had the Fire stick for a month.  It's so geared towards Amazon that it's hard to find the APP's you want. Most APP's that are on the Roku and not on the Fire. The phone remote voice APP doesn't work.  I have messed with that for hours.The Fire home page never changes.  It's that same old stuff on the HP.  It needs more selection.  It's as if Amazon's trying to push their shows and products. It really needs some variety.***I do have something nice to say about the Fire.  I love how it links to my music prime.  I can play it from my TV while doing dishes or cleaning.  It's not like the Roku which is limited with it come to play AP music.I still prefer the Roku.", "verified": true, "helpfulness": "0/0", "author": "Shar"}, {"rating": 5.0, "review": "great product! easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is actually exactly just as it is advertised ! Wa are elderly & our days of being tech savy are over I was sure I'd have to call a grand kid enstall it. Joy of joy I was able to do the install it myselfAs far as to how it works: it is as easy as installing it was. We love to watch movies, and fire stick allows us to do just that any time we want to", "verified": true, "helpfulness": "0/0", "author": "Pat Gilland"}, {"rating": 4.0, "review": "Works great and easy to setup,great value", "verified": true, "helpfulness": "0/0", "author": "David Gallegos"}, {"rating": 5.0, "review": "Works great.  Got the because the TC in the bedroom had a weak wireless (2.4) signal.  This has a better wireless interface (5.0) and connects better.  Content with Prime is awesome.  Netflix and everything else I would need!", "verified": true, "helpfulness": "0/0", "author": "J. Schimansky"}, {"rating": 5.0, "review": "So pleased with my purchase ~ Thanks AMAZON!!", "verified": true, "helpfulness": "0/0", "author": "Anita M Carden"}, {"rating": 5.0, "review": "Turned my tv into a smart tv!", "verified": true, "helpfulness": "0/0", "author": "Koushal Patel"}, {"rating": 5.0, "review": "excellent, I enjoy it very much", "verified": true, "helpfulness": "0/0", "author": "Eileen Kilian"}, {"rating": 5.0, "review": "it is so easy to install and to use, it's great!", "verified": true, "helpfulness": "0/0", "author": "mark marek"}, {"rating": 4.0, "review": "I love it to pieces! It runs so much faster than my Wi-Fi-enabled Blu-ray player, and I'm so glad I can use Netflix, HuluPlus, AND Amazon Instant video. I wish there were a power-off option, though. I keep going to settings and putting it to sleep, but that's a bit of a chore. Also, if the text were a bit larger as videos are loading, that would make it easier to see the episode titles when watching TV shows. I hope this stays running quickly for a long, long time. :)", "verified": true, "helpfulness": "0/0", "author": "fishdye \"Erin\""}]