[{"rating": 2.0, "review": "It was average experience nothing so good about it.  Comcast would have been a better choice and more user friendly", "verified": true, "helpfulness": "0/2", "author": "Tejas Shah"}, {"rating": 2.0, "review": "This product still needs some work. If you are planning to use it for Netflix, you may want to reconsider. Many issues with the Netflix App. The Amazon Prime seems to work fine most of the time, but still buggy. Decent product for the price but not glitch free by any means.", "verified": true, "helpfulness": "0/0", "author": "Blaz"}, {"rating": 5.0, "review": "Great gadget.  The menu works great and the software is quick.", "verified": true, "helpfulness": "0/0", "author": "Simply Jas"}, {"rating": 3.0, "review": "Average +-", "verified": true, "helpfulness": "0/0", "author": "Mishel Papiashvili \"Michel\""}, {"rating": 4.0, "review": "Enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Vivian L Shannon"}, {"rating": 2.0, "review": "I have had disappointing performance with this device for MLB.com app. I purchased this to use with my new Sling TV subscription. For that it does work pretty well. Amazon Prime Videos stream fine. But I am disappointed with my third reason for purchase MLB.com. I get frequent buffering and dropped signals. My other devices all run MLB fine on the same network in the same room (laptop, ipad and Android phone). It has to be a problem with the device working with this app. I can't recommend this product if you are primarily purchasing it to use with a MLB.com subscription.", "verified": true, "helpfulness": "0/0", "author": "Bill Yates \"Bill\""}, {"rating": 4.0, "review": "I really enjoy streaming shows now!! There were a few hiccups getting started. Once I got going, I started watching tons of shoes via Hulu and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Denise Finklea"}, {"rating": 5.0, "review": "Love it,Can  do so much with it and combined with the Kindle Fire HDX just great", "verified": true, "helpfulness": "0/0", "author": "D. Gough \"Em\""}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Maurina"}, {"rating": 5.0, "review": "I got my FireStick when it first came out and was offered to Prime members for $20. For that price I had to take a chance on it.It is WELL WORTH the full price of $40! If I'd paid full price I'd be completely happy about it.The user interface is simple and easy to navigate with the included wifi remote control. The system is also CES enabled so you can use your TV remote control to control the FireStick (If your TV has that capability)I find it works perfectly fine when the power is supplied by plugging the FireStick's power cable into my TV's USB port instead of keeping the FireStick plugged into a wall outlet all the time. This will cause it to power down when the TV is turned off, preventing it from getting updates or preloading content while you're not using it. But I've notice zero ill effects from that.If you are a Prime member the FireStick is an absolute must have due to how much free content is included with Amazon Prime. (TV, Movies, Music)This is just one of those purchases where I'm completely and utterly satisfied.", "verified": true, "helpfulness": "0/0", "author": "Skipjacks"}]