[{"rating": 5.0, "review": "Easy install ! Works great ! Highly recommend !", "verified": true, "helpfulness": "0/0", "author": "Villagenan"}, {"rating": 5.0, "review": "Love this product.", "verified": true, "helpfulness": "0/0", "author": "James Curry"}, {"rating": 1.0, "review": "QUIT WORKING WITHIN 90 DAYS.", "verified": true, "helpfulness": "0/0", "author": "Aerial Aerins"}, {"rating": 5.0, "review": "Added this to an older television which we don't use a lot so didn't see the need to add a service box. Plugged it into the HDMI port and powered it up, not a glitch. Logged right into my Prime account and synced up in a flash. Added Netflix app and tried it out streaming from both services. No lag, no muss, no fuss. Great value option for entertainment.", "verified": true, "helpfulness": "0/0", "author": "Eric S"}, {"rating": 4.0, "review": "Great for the other products, but unable to get HBO-Go content because of no deal with Comcast & Amazon.", "verified": true, "helpfulness": "0/0", "author": "BRBMOM"}, {"rating": 5.0, "review": "I'm amazed at how this tiny stick works.  It was easy to install on my TV and It was up and running in just a few minutes.  I use it for all my Amazon Prime video content plus Netflix.  It also supports several other streaming services..", "verified": true, "helpfulness": "0/0", "author": "Gar \"garp36\""}, {"rating": 5.0, "review": "I have had the Stick for less than 24 hours and I am in love! When we bought our TV, we had no hopes or expectations of getting internet at home so we did not invest in a smart one. We finally got internet so now I regretted that decision. Fire Stick took that regret away! I have one other small smart tv and it does not have 1/10 the available apps through the FS. I have downloaded more than I have been able to explore just yet, but so far they all work beautifully.. I can only get 3 mbps high speed so I was concerned about streaming ability. No problems! The Stick has only stopped once so far to buffer and that was only for about 2 seconds. Finally, with my free month trial of Prime, I am comparing their availability of shows and movies to Netflix. I have found quite a few that are not on Netflix and more current seasons than what Netflix offers. I will still likely keep my N but I think I will also sub to P. Overall, I am more than pleased with the value of my purchase and would highly recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "j97angels"}, {"rating": 4.0, "review": "I got this for the Kitchen/Nook area TV and it surpassed my expectations. It is very fast and no issue between the stick and the remote. I the user-interface could be improved so I will  take off one star. :-). If you are NOT an Amazon Prime member, I would go with the Roku version.", "verified": true, "helpfulness": "0/0", "author": "Mr.D of Texas \"Mr. D of Texas\""}, {"rating": 4.0, "review": "I'm enjoying  it . I wish I had more time to enjoy it", "verified": true, "helpfulness": "0/0", "author": "Jeffrey A.Benjamin"}, {"rating": 5.0, "review": "Great price; easy to install and use. I do not miss cable TV at all!", "verified": true, "helpfulness": "0/0", "author": "cdstokes"}]