[{"rating": 5.0, "review": "Great product, canceling my satellite service", "verified": true, "helpfulness": "0/0", "author": "gahc53"}, {"rating": 1.0, "review": "lags horribly", "verified": true, "helpfulness": "1/1", "author": "Delma R. Moreno"}, {"rating": 2.0, "review": "Overheats after a few episodes of anything then shuts down. VERY HOT.Reading reviews this looks like a common issue that amazon is not able to fix", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Robert\""}, {"rating": 1.0, "review": "My firestick literally stopped working after a month. I called Amazon customer service, and there were really helpful. The tech support was patient troubleshooting the issue at hand and they were able to handle the issue remotely.", "verified": true, "helpfulness": "0/0", "author": "Odinakachukwu Ehie"}, {"rating": 5.0, "review": "Easy to use. Love that everything is pretty much there.", "verified": true, "helpfulness": "0/0", "author": "carolina ponce de leon"}, {"rating": 4.0, "review": "I love the Fire TV Stick. Honestly, I wish I had known about it before I had gotten a Chrome Cast. I love the bluetooth remote and that you don't have to point directly at an IR sensor. I'm just really bummed that this doesn't have some sort of volume control. I have a big computer monitor that I have this plugged into an HDMI switcher, so I have no volume remote when watching TV. It's not a major deal, but the over-simple controls loses a star for me.Pros: Bluetooth remote, good apps for video/movies, clean UICons: Remote doesn't have volume control and is very minimal", "verified": true, "helpfulness": "0/0", "author": "Aaron Kelley"}, {"rating": 5.0, "review": "I am impressed", "verified": true, "helpfulness": "0/0", "author": "william alexander"}, {"rating": 5.0, "review": "This guy is fantastic. Great for anyone who has Hulu and Netflix. Easy to use. Now I don't need my PS3 anymore. It's easy to move from room to room and TV to TV. Remote is small and compact. Just love this! Probably going to buy another one to leave at the deer lease! ❤️❤️", "verified": true, "helpfulness": "0/0", "author": "Susan Miles"}, {"rating": 5.0, "review": "Cool toy plug and play love it", "verified": true, "helpfulness": "0/0", "author": "STANLEY B."}, {"rating": 1.0, "review": "Ehh no free movies unless u have prime or netflix and the app selection isnt all that great", "verified": true, "helpfulness": "0/0", "author": "Izaac Crotwell"}]