[{"rating": 5.0, "review": "I'm enjoying the Fire TV Stick. Much easier than using my laptop to connect to the TV!", "verified": true, "helpfulness": "0/0", "author": "Dr. Robert Brown"}, {"rating": 5.0, "review": "I like it so well that I bought three - one for each of my other tvs.", "verified": true, "helpfulness": "0/0", "author": "Sarah H."}, {"rating": 4.0, "review": "I like it alot we usually want to watch movie I shows that we never watch before", "verified": true, "helpfulness": "0/0", "author": "Steven Pina"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Daniel La Savio"}, {"rating": 5.0, "review": "Love this thing, was a breeze to set up.", "verified": true, "helpfulness": "0/0", "author": "lisa t"}, {"rating": 5.0, "review": "Setup in 5 minutes and watching movies through plex app.", "verified": true, "helpfulness": "0/0", "author": "Darren Gamet"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Rhonda"}, {"rating": 5.0, "review": "I am very pleased with this.  I find it easy to use and have much enjoyment from it.  More than met my expectiona.  On a side note I do wish Amazon Prime would have a month to month pmt plan.  For some of us on a fixed income the whole amount at once can be difficult.", "verified": true, "helpfulness": "0/0", "author": "Candace \"Gadget Mistress\""}, {"rating": 4.0, "review": "Works so well!!! Wish it would let me mirror straight from my phone, though.", "verified": true, "helpfulness": "0/0", "author": "Hil F"}, {"rating": 5.0, "review": "I love the Fire Stick.  I had considered Apple TV because so many people were using it and when I found this product for such a good price I thought I would try it.  It meets all the needs I was looking for and it is so easy to go from TV toTV in different rooms.  However, because of the price I am going to purchase another one so I can have it on both televisions. The extra advantage is since I am a Prime member I have the options to watch the Amazon movies also!", "verified": true, "helpfulness": "0/0", "author": "Erin Hutchinson"}]