[{"rating": 5.0, "review": "Many programs without having to pay.  The video resolution is great, and it is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Michael Haney"}, {"rating": 5.0, "review": "This device along with my Amazon Prime subscription are just awesome? I wish I would've thought of this sooner. Via Wi-Fi we get to watch shows/movies/play games effortlessly. The device is extremely user friendly & it is very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Mario E. Arroyo"}, {"rating": 5.0, "review": "This is the best thing I've ever done with my TV since going flat screen and adding HD! I disconnected my satellite service and only use the Fire Stick and have not been happier in terms of TV entertainment. In addition, the HD quality is outstanding!! I have never seen it so clear and I was very happy with the quality the satellite service provided! Obviously, I highly recommend it.", "verified": true, "helpfulness": "1/1", "author": "Patti"}, {"rating": 5.0, "review": "it wasn't easy to figure out. However the few things I have figured out I really like. So much better than cable!", "verified": true, "helpfulness": "0/0", "author": "Mieghan Damron \"Mieghan Damron\""}, {"rating": 5.0, "review": "This is so easy to use and allows me to view so much on my TV with just a couple of presses o the remote. Easy connection, just keep plugged in to TV. You can access Youtube, Netflix, Amazon Prime, Pandora, and other such apps on your TV.-- If you are an Amazon Prime Member, you are able to access your Prime Video, Prime Music, and Prime Photo accounts. You do not have to have any technological knowledge. It was up and running in a matter of minutes.", "verified": true, "helpfulness": "1/1", "author": "Yvonne Fischer"}, {"rating": 1.0, "review": "I purchased this Firestick when it was a special at $19. It worked great in the beginning. If you lightly touched the remote the firestick would  automatiucaly come on but after a month the firestick stopped working. I could not turn it on with the remote even if I  unplugged it and plugged it back in it would not work so Amazon replaced it with a refurbished one same thing happened with the refurbished one. I am highly disappointed by this Amazon product.", "verified": true, "helpfulness": "1/1", "author": "Tameka Johnson"}, {"rating": 1.0, "review": "Can't even use it. Did not offer what I needed.", "verified": true, "helpfulness": "0/3", "author": "Helena Dandrea"}, {"rating": 5.0, "review": "It is awesomw!!!", "verified": true, "helpfulness": "0/0", "author": "Adela Mendez"}, {"rating": 5.0, "review": "Loved it so much, bought another one as a gift", "verified": true, "helpfulness": "0/0", "author": "janet d."}, {"rating": 2.0, "review": "They should have done more testing before releasing the product.  It would not pickup my Wifi just 25 feet away. I have no issues with any other devices anywhere even out side of my house.", "verified": true, "helpfulness": "0/0", "author": "Deplinger"}]