[{"rating": 5.0, "review": "I love it, made my tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Trina Adams"}, {"rating": 3.0, "review": "While the device plays video with excellent quality, there are a couple things that they can improve upon. The menu really needs a lot of tweaking to streamline it. As it is, it's rather confusing. And the second item up for rating is the content providers. Work on getting more. Otherwise great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy setup on a Sony Bravia 42\" LCD that was purchased in 2007.", "verified": true, "helpfulness": "0/0", "author": "Gregory A. Schneider"}, {"rating": 5.0, "review": "Absolutely love it.  It's excacty what we were expecting and more.  Since we like our tv and it works perfectly, we didn't want to spend hundreds or thousands just to get a smart tv.  With just a fraction of the cost, We turned our tv into a smart tv and it has all the apps such as Netflix and hula plus many more.", "verified": true, "helpfulness": "0/0", "author": "dana thomas"}, {"rating": 5.0, "review": "Works excellant, terrific price.", "verified": true, "helpfulness": "0/0", "author": "Don Huettner"}, {"rating": 2.0, "review": "Streaming video varies from poor to moderately choppy. Sound is fine. The remote loses connection frequently. The FireTV app (on many devices) loses connection even more frequently. I have been unable to screen-cast, trying hard with Windows 8.1 notebook (attempting MiraCast), Nexus, iPhone 5S, iPad, Samsung Galaxy S5. The devices don't find the Fire TV Stick, even though the Fire TV Stick is in Mirror mode.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "My Fire stick doesn't recognize my Prime Account.", "verified": false, "helpfulness": "1/2", "author": "Aenis"}, {"rating": 5.0, "review": "GREAT DEVICE,GREAT PRICE", "verified": true, "helpfulness": "0/0", "author": "Thomas J. Luicci"}, {"rating": 5.0, "review": "Setup was quick and easy.  To install, plug it into the TV's HDMI port, and connect the power source and you're done.  Once the unit turns on, just choose your wireless network, give it the password if any, and you're done with the basic setup.  The unit will check for updates once connected to the internet and then boot up.  There is a useful introduction video that plays when you turn the unit on for the first time to help you get acquainted with the controls and menus and you're set.  I had installed apps and was watching shows in just a few minutes.My favorite part is that the unit is small enough to hide behind the TV and the remote doesn't need to be in the line of sight.  If you want to keep your setup looking streamlined, the Amazon Fire Stick is awesome.", "verified": true, "helpfulness": "1/1", "author": "J. Naylor"}, {"rating": 5.0, "review": "Amaaaaaaaaazing", "verified": true, "helpfulness": "0/0", "author": "sazzam"}]