[{"rating": 4.0, "review": "I've had it for a couple weeks now and am enjoying it very much.  I'm going to downsize my Dish package to just the basic so I can keep my local channels. I don't care about watching episodes a week later and I can do that with all the apps available.  I'm going to try the Prime free trial this week and see how that works out. If I like it I'll cancel my Netflix account since you can only stream old stuff with them and none of the new movies.  The annual fee for Prime works out to about the same as the monthly fee for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Esther C. Hatcher"}, {"rating": 1.0, "review": "Didn't realize I had to have a prime account to use it. Im not paying for every movie and I don't have a prime account, and I don't want one. I can use Netflix but I already had Netflix before this. Haven't used it but once since Iv had it for these reasons. :/", "verified": true, "helpfulness": "0/1", "author": "Chelsea"}, {"rating": 4.0, "review": "Having a good experience so far....only a couple of issues of buffering, but unplugged it and plugged back in and buffering stopped", "verified": true, "helpfulness": "0/0", "author": "dogs in texas"}, {"rating": 5.0, "review": "very good UI. easy to use. the best part is the app that you manage it with from your smart phone. I lost this remote so many times but i was able to use the app and manage. i wish there is more live TV.", "verified": true, "helpfulness": "0/0", "author": "Kiran \"Kiran USA\""}, {"rating": 5.0, "review": "Made my smart tv smarter, worth the money if you have Prime. Disappointed with the game controler cost.", "verified": false, "helpfulness": "0/0", "author": "Lynda395 \"Schmidt721\""}, {"rating": 1.0, "review": "I am sure it is a great product. The fact, is that after installed in an non-smart TV with an smart blue ray sony player, it works, but I cannot get it to perform simple tasks as Netflix, Pandora, Amazon TV, etc. I would love to have your technical advise, because it is just sitting there.....Again, I am sure it works with other people...I you have a resource to obtain direct help (Your tutorial you tube and other videos did not take me anywhere...I WOULD APPRECIATE IT.Carlos Calvo", "verified": true, "helpfulness": "0/0", "author": "Carlos Calvo"}, {"rating": 5.0, "review": "My husband and I love it! We have older Smart TV ' S and this allows us access more programs. The bonus of free movies, music and TV programs with Amazon Prime is well worth 99.00 years! Great invention!", "verified": true, "helpfulness": "0/0", "author": "Sunora W."}, {"rating": 1.0, "review": "Product is defective. Keeps losing network connection every few minutes, when all of my other wifi devices are working fine. Saw online that this is a very common problem with the FireStick. Very glitchy. Would like to give it a second try and get a replacement. If that replacement is glitchy as well, then I will return the product for a refund. The short experience I had with the FireStick is enjoyable, but maybe it was too soon to put on the market? This would have been an amazing product if it actually worked properly as intended.", "verified": true, "helpfulness": "0/0", "author": "Mary E."}, {"rating": 4.0, "review": "In the last few days, I think Amazon has finally update the Stick software to allow Windows 8.1 devices to mirror via Miracast.  I was just now able to use my Windows RT tablet and Windows 8.1 laptop to \"Project My Screen\" to my TV via the Fire TV Stick.  (Charms --> Devices --> Project -->  Add the Fire TV Stick as a device, and let all the drivers load.)  I can send video and audio when I'm on websites, but I'm having trouble sending audio when I'm on apps like Netflix, XBox Video, etc.  I'm poking around to see if there's some setting I need to change.  Still, after months of being disappointed that I couldn't \"Project My Screen\" to the Fire TV Stick, I'm very encouraged by the new development.", "verified": true, "helpfulness": "0/0", "author": "IM Poster"}, {"rating": 1.0, "review": "Wanted to like this product. Got sucked in to the 'Sling TV' promotion. Not happy.", "verified": false, "helpfulness": "0/0", "author": "Rosa M. Chavez Brown"}]