[{"rating": 1.0, "review": "The Fire Stick is not particularly intuitive, takes a long time to get to the selection you want, doesn't do much the computer can't do except without a cable.But the worst was when my one-click Amazon setting did not apply when purchasing via the Fire Stick - it defaulted to a gift card I did NOT want to use.  Customer service advised \"It's not currently possible to pay for digital orders with a credit or debit card when there are promotional or gift card funds available in your account. I’m sorry for any inconvenience this causes. \"When I called to speak with a customer service rep - after my email was answered promptly - I was told the same thing : they can't do it my way, they have to do it their way.  The customer service person took a long time to decide they could refund on the gift card; when he couldn't make it work to use my debit card, he decided maybe he could 'comp' me this one time.  But then he didn't.I waited too long to return the Fire Stick, which was entirely my error.  I would not recommend buying the Fire Stick (or, because of my experience, anything else electronic from Amazon) because of the poor quality, the lack of support, and the bad customer service..", "verified": true, "helpfulness": "0/1", "author": "Atlantanne"}, {"rating": 4.0, "review": "Good experience.", "verified": true, "helpfulness": "0/0", "author": "Simon L. Montes"}, {"rating": 5.0, "review": "My friend love the fire stick she wants another one so thank you", "verified": true, "helpfulness": "0/0", "author": "wilson staten"}, {"rating": 5.0, "review": "very good worked out well", "verified": true, "helpfulness": "0/0", "author": "paul desantos"}, {"rating": 5.0, "review": "Love my Fire TV", "verified": true, "helpfulness": "0/0", "author": "Scott moore"}, {"rating": 5.0, "review": "Great even if the only thing it's used for is game playing!", "verified": true, "helpfulness": "0/0", "author": "ajmehta"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "jjjjj"}, {"rating": 1.0, "review": "Purchased to stream Major league Baseball.  Prior to the fire stick I had a laptop sitting in my floor with an HDMI cable running to my TV and I wanted to clean it up.  Plugged in the Fire Stick and the games were choppy.  Download speeds are too slow.  So bad I had to unplug and go back to the laptop.  I'll have to do some research on download speeds for comparable products.", "verified": true, "helpfulness": "1/1", "author": "Kenneth Crowe"}, {"rating": 5.0, "review": "i just wish i have prime, that a perfect cable replacement", "verified": true, "helpfulness": "0/0", "author": "Tran Mitch Pham"}, {"rating": 5.0, "review": "Great entry level device on the way to \"cutting the cord\" with cable. Useful apps. I do wish the Prime movie list was larger. Prime music through the TV sound bar is a lifesaver in the room we have the Fire TV Stick set up.", "verified": true, "helpfulness": "0/0", "author": "Barb"}]