[{"rating": 5.0, "review": "This 72 year old grandmom is not from the dark ages but, not a techie, was a bit nervous about hooking up the Fire TV Stick. I need not have feared. Thank you Amazon, it was easy. During a visit with our 16 year old grandson, I hooked it up; registered my WiFi password; Peter zoomed through the movies (showing me how easy it is); and we watched Steve Martin! My only problem was my Comcast WiFi signal kept going weak; stopping the movie for a couple minutes each time. Annoying but we managed to laugh and get snacks during the interruptions. I will have to deal with Comcast over this issue but as far as the Fire TV Stick, we are sure to watch a lot of movies.", "verified": true, "helpfulness": "1/1", "author": "Carol"}, {"rating": 5.0, "review": "Works good, Must have good wifi!!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"gmilbrat\""}, {"rating": 2.0, "review": "Fire stick works good for a few minutes the cuts off and resets. I would have to change HDMI ports and it will be working fine until it cuts off and resets again this gets annoying when we're in the middle of film or live TV. It may just be mine and it's tripping out on me, but I will be trying Roku next.But when it works the picture quality and the streaming is pretty good.", "verified": true, "helpfulness": "1/1", "author": "Aaron Hernandez"}, {"rating": 5.0, "review": "Awesome TV portal!!! Easy to use!!", "verified": true, "helpfulness": "1/1", "author": "Adam I \"ADAM\""}, {"rating": 5.0, "review": "OMG! This thing is amazing. I have one Chromecast, but this one is way better....I love it and recommended it for all my family and friends!", "verified": true, "helpfulness": "0/0", "author": "JuliaGray"}, {"rating": 5.0, "review": "The best deal for tv", "verified": true, "helpfulness": "0/0", "author": "lulu50"}, {"rating": 5.0, "review": "Thanks Amazonwhat else can I say, now that my wife has the fire stick, I am beginning to feel less important.How could any stick be comparable to Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "1consumer2theother"}, {"rating": 5.0, "review": "Easy to install and easy to operate. Good choice of movies.", "verified": true, "helpfulness": "0/0", "author": "Francisco B Garcia"}, {"rating": 5.0, "review": "Work wonderfully", "verified": true, "helpfulness": "0/0", "author": "Kristin Tucker"}, {"rating": 3.0, "review": "I haven't used it yet I will when I get closer to the city and then I'll have a wifi connection but it probably works pretty good", "verified": true, "helpfulness": "0/0", "author": "William Kowalski"}]