[{"rating": 3.0, "review": "I really like the fire stick. However, I have had it for a little over 3 months and the remote is having issues. Basically the buttons are sticking making it difficult to navigate with ease which causes the Fire to select  a program I did not want to select. Of course the warranty is only 3 months so I am out of luck according to Amazon... not the quality I expected.", "verified": true, "helpfulness": "0/0", "author": "G.G. \"As above, so below\""}, {"rating": 1.0, "review": "This is my updated review: since I've had this a bit now and have traveled with it, I have a much lower opinion of it. The whole point of this device versus the Fire TV is its more compact and easier for travel. However, when traveling in hotels and you need to connect to their wifi, you won't be able to. Almost all hotels offer wifi but you still have to log in on a web browser type screen. Amazon hasn't offered this pop up or browser screen capability. So when you connect to the wifi, you will see it connect but with problems because you can't complete the final step. So, for portability/travel this device SUCKS. Especially since it's not even usable.Original review: This is a very neat device, and since I'm a Prime member, I can get a ton of free shows, movies, etc. easily. I love the portability, and ease of setup. I have had no streaming problems or access issues. It works precisely how it says it is supposed to. I didn't see that I'd need a power cord for it initially, and was a bit annoyed at first, but since the cord can be hidden, I don't care.", "verified": true, "helpfulness": "0/0", "author": "Jessss \"I read to find stories that inspire more for my life; more adventures, more expeditions to new places.\""}, {"rating": 2.0, "review": "I use my fire stick for screen mirroring because I don't have Wi-Fi, so I can't really comment on the built in apps.One of the things I can start by commenting on is that figuring out how to screen mirror took a Google search. Even after finding out how to do it, it's still not a very convenient method, multiple menus and options before you get to it..Now for the audio. Sometimes it goes out in the middle of watching something, sometimes it's not there at all. I'll have to disconnect screen mirroring, then reconnect to get it working. Other times it starts to sort of crackle and break up.Other than that, sometimes the scene will freeze on the tv, while it keeps playing on the mirroring device, again having to disconnect and reconnect to make it work.Basically, it's better than nothing, but I wouldn't say it's good.", "verified": true, "helpfulness": "1/3", "author": "Jim"}, {"rating": 5.0, "review": "I was amazed with how fast this thing is.  It would be awesome if loading third party Apps were a little easier.  XMBC/KODI looks fantastic.", "verified": true, "helpfulness": "0/0", "author": "J. fuller"}, {"rating": 4.0, "review": "Easy set up.  Easy to use. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Miguel Sanchez"}, {"rating": 3.0, "review": "If you have kids...The remote is so easily lost- it is small and thin. Ours was gone within a week. We downloaded the app onto our phones but it just does not work as well. It is hard to navigate by swiping, especially for younger kids. Sometimes it wouldn't pick up the commands at all and we wouldn't be able to select anything- it would bounce around. Also, it means handing your phone over to the kids. :/Obviously it is geared toward people with amazon prime with all the prime shows, movies, etc on the home page with the apps. The apps are organized by most recently watched. If we watched something from amazon it would prioritize that over other apps. you would have to scroll past these to select netflix or hulu. I like the organization of the Roku home screen much better because you can organize the apps in any order.There were a lot more glitches with the Fire TV- more frozen scenes, minor skips, and longer loading times. Although this didn't happen every time, it was noticeably more than the Roku. One positive is the profiles on the netflix app that were not available on the Roku.We replaced our three year old Roku box with this, but I think we may be going back. All in all, the Fire Stick is okay. I think it would be better suited towards customers who do not have kids.", "verified": true, "helpfulness": "2/3", "author": "E Greer \"E Greer\""}, {"rating": 5.0, "review": "Great piece of equipment! Easy set up.Turns your dumb TV into a smart TV. Have just tried it with Netflix and Amazon Prime, so far, so good.", "verified": true, "helpfulness": "0/0", "author": "Stephen J. Marsden \"Steve\""}, {"rating": 5.0, "review": "I ordered this on impulse when it was on sale for Prime customers, with really no expectations.  Once we started using it, though, we fell in love and considered giving away the Chromecast that we've been using every day for a year.  The ability to easily stream Amazon Prime to the TV is so good that I think I've finally convinced my significant other to get rid of cable.  Aside from the selection, the remote is really what pushes the Fire TV Stick way past the Chromecast.  I don't have to rely on some buggy app just to pause the TV or switch the song!  For such a small consideration, it's really a huge advantage.  This is a great contender in the under $50 crowd.", "verified": true, "helpfulness": "0/1", "author": "Karen"}, {"rating": 5.0, "review": "This beats the ROKU in ever regard.  I've had zero issues with the device since the simple install.  My children can easily use the device and it has rather robust features for something in this price range.  I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Eric Rosenthal"}, {"rating": 5.0, "review": "LOVE", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}]