[{"rating": 5.0, "review": "Love it !!! works great ... will never pay another Satellite bill again.... Thanks Amazon....great product!!!", "verified": true, "helpfulness": "1/1", "author": "dewayne beard"}, {"rating": 5.0, "review": "I own several media players, and the value of this one looks unbeatable. The only regret I have is that audio can only be routed to HDMI (there should be possible to send it through Bluetooth with some hacking). With some hacking, too, you can install Kodi and watch your own videos stored in your home network.If you are planning to use an A/V receiver, you better go for the full version.", "verified": true, "helpfulness": "0/0", "author": "Feanor"}, {"rating": 5.0, "review": "Works as advertized.  Straightforward setup and easy to use.", "verified": true, "helpfulness": "0/0", "author": "James A. Williamson"}, {"rating": 3.0, "review": "I'm  slightly dissapointed. The video freezes a lot with this and it's  super annoying.  I hope it's something they work on. I have had it for several months now so I really gave it a go. Also sometimes it won't play the video just the sound it gives some kind of resticted message. You have to plug and unplug it multiple times to get it to work. Also it goes to sleep and you cant wake it up with the remote it's another unplug replug situation. I do think that navagation is good. I just wish it streamed smoothly. If you want to use hulu definitely buy something else it will drive you nuts.", "verified": true, "helpfulness": "0/0", "author": "Rona \"Rona\""}, {"rating": 3.0, "review": "Not much content.", "verified": true, "helpfulness": "0/0", "author": "Larry Keyes"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "mee"}, {"rating": 4.0, "review": "Works very well. Good HD.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "Has lived up to my expectations, which were set by extensive research.  If you've already signed up for Amazon Prime, then getting this is a no-brainer.", "verified": true, "helpfulness": "1/1", "author": "Snorky"}, {"rating": 3.0, "review": "Great idea poor product. Disconnects itself after 4-5 minutes. Not good for anything. Apple TV works without a hitch!", "verified": true, "helpfulness": "0/0", "author": "Rae Gillespie"}, {"rating": 5.0, "review": "Works great.  Like the technology", "verified": true, "helpfulness": "0/0", "author": "bja"}]