[{"rating": 5.0, "review": "I use it in my daughter's playroom connected to her TV and it performs just as expected. It is not as fast as the bigger products but performs remarkably for being so small. Everything I want is on this product and my 3 year old daughter can easily utilize this controller to put on a program she wants to watch. We got rid of cable a couple of years ago and I had been using a Roku and did not like it at all. It was much slower then this and froze alot. Thank you Amazon for making an inexpensive way for watching prime, netflix, and hulu without frustrating me or my daughter from being slow or freezing.", "verified": true, "helpfulness": "0/0", "author": "Peter Wells"}, {"rating": 5.0, "review": "I like it! 5 stars!", "verified": true, "helpfulness": "0/0", "author": "Maciej Miernik \"Gauge Studio\""}, {"rating": 5.0, "review": "Nice powerful enough stick for the money.", "verified": true, "helpfulness": "0/0", "author": "Randy Ernisse"}, {"rating": 5.0, "review": "Works great. Love Amazon prime", "verified": true, "helpfulness": "0/0", "author": "ASHLEY AYER"}, {"rating": 4.0, "review": "It was very easy to set up and works well. Good deal for the price.", "verified": true, "helpfulness": "0/0", "author": "jrbou"}, {"rating": 4.0, "review": "Yes, it's great ! I highly recommend it....", "verified": true, "helpfulness": "0/0", "author": "Frankya"}, {"rating": 3.0, "review": "it is a decent device. the only problem is the Netflix streaming. stops a lot and then speeds up to catch up to the vocals on tv shows.", "verified": true, "helpfulness": "0/0", "author": "ken kirby"}, {"rating": 5.0, "review": "Fire TV Stick is a great addition to our TV viewing. We watch Prime movies and TV show almost exclusively and having other television sets available for Wi Fi access via the Fire TV Stick is a fabulous upgrade. Wish I would have discovered it sooner.", "verified": true, "helpfulness": "0/0", "author": "Freeh, John"}, {"rating": 3.0, "review": "It's value is very limited. You have to subscribe to something for pretty much everything it offers in the way of video... I listen to I Heart Radio and TuneIn, but the interface doesn't work very well; you can't save podcast programs to favorites , can't \"rewind\" or \"fast forward. It's a pain.  It is much easier to use on my Fire HD7 or iphone.", "verified": true, "helpfulness": "0/0", "author": "Bill F Johnson"}, {"rating": 5.0, "review": "So far so good. I like this better than the Roku that was misplaced.", "verified": true, "helpfulness": "0/0", "author": "deb k."}]