[{"rating": 5.0, "review": "nice high def, has all the options, but one complaint I have is there isn't as many free choices with prime as I thought there would be, and would like to see quicker availability to TV shows.", "verified": true, "helpfulness": "0/0", "author": "candy"}, {"rating": 5.0, "review": "At first I was slightly disappointed. The main appeal to me, the \"Mirroring\" or Casting from the computer to TV, would barely work. I also couldn't watch anything without AmazonPrime or Plex or some other program. I ended up getting another app on the stick and had a friend check out the casting issue. Now I love this thing. I spend a lot of time now in front of the (Fire) TV! Much better hardware and computing power than the Chromecast or Roku from what I ubnderstand. I would recommend again to most.", "verified": true, "helpfulness": "0/0", "author": "El Osito Del Lago"}, {"rating": 4.0, "review": "If you use Netflix, Hulu, Amazon Video prime, sling and Plex, then this device will be perfect for you. All my entertainment now is via this stick. GUI is smooth and looks great but sometimes you need lots of clicks to reach few settings and sadly advance network settings can only be done during inputting wifi password. To change any advanced network settings you will have to forget the network and reconnect again. I highly recommend this device.", "verified": true, "helpfulness": "0/1", "author": "Razi"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "james p."}, {"rating": 1.0, "review": "I was so excited to get the fire tv stick! Simple, easy to install, connects straight to my amazon prime account, great! It worked like magic.... for a week. One week of greatness. I have YouTube, Netflix,  and hulu plus only on this thing, I have amazing Internet so I know that's not the problem. The solution to all the buffering and freezing? Clear the cache on all installed apps, and restart it. Then repeat every five to ten minutes.  Why can't I give this negative stars??", "verified": true, "helpfulness": "0/0", "author": "Amanda Evans"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Michael D. Parsons"}, {"rating": 4.0, "review": "What they don't tell u ,a lot of stuff u hv to subscribe too,but I already had Netflix so it was still a plus", "verified": true, "helpfulness": "0/0", "author": "Mia Parker"}, {"rating": 1.0, "review": "Worked for about a week and then wouldn't turn on. Tried different outlets and different ports but nothing,", "verified": false, "helpfulness": "0/0", "author": "Connor Shaney"}, {"rating": 5.0, "review": "I'm still trying to figure everything out, but like it so far. My only complaint is that it's almost impossible to open the battery compartment in the remote. The instructions even said it was difficult, so we're wondering why Amazon hasn't figured out how to make it easier!", "verified": true, "helpfulness": "0/0", "author": "Hannah Banana"}, {"rating": 5.0, "review": "It's ok haven't used it that much", "verified": true, "helpfulness": "0/0", "author": "Ernie1"}]