[{"rating": 1.0, "review": "I may as well review this now as I may never get to use it. I have had mine for a month. It cannot mirror my Kindle on my TV. I've complained loudly and at length and all I have are emails saying their team of technicians are working on the problem. How is it possible that this can't be resolved without an earth shaking technical advance? It will let me view Netflix and other sites, but I have a smart TV and could already do that. This was purchased solely for the ability to mirror content, a thing it does not do. I can't possibly recommend it to anyone when it doesn't do what it is advertised for.", "verified": true, "helpfulness": "2/2", "author": "Jody Higinbotham"}, {"rating": 5.0, "review": "Works well amazing amazon value at promo price.  Hooked up to the TV in my office and now I can stream shows on my dumb TV such as amazon prime which I really like and use more than my netflix account these days.", "verified": true, "helpfulness": "0/0", "author": "gregg239"}, {"rating": 4.0, "review": "I love it.  I have used my TV a lot more not that I have the Fire Stick.  I don't have to hassle with the computer to pull up app and plug into TV.", "verified": true, "helpfulness": "0/0", "author": "MontaP"}, {"rating": 5.0, "review": "I just got this hooked up. And I love it! Super easy to install and operate...I've never been able to use Amazon prime video and now I can! Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Joan E. Fruth"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "1/1", "author": "John J Maharay"}, {"rating": 5.0, "review": "Wifey likes her Fire TV Stick...  All good!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome and well-priced way to add streaming to a TV or room that doesn't have it. I love that it connects to Amazon Prime Music as well since we use it all the time.  My only complaint is that the micro USB connects to the side of the Fire Stick. If you use this on an AVR, it may interfere with your other HDMI inputs.", "verified": true, "helpfulness": "0/1", "author": "gspfunk"}, {"rating": 2.0, "review": "No download option in any preinstalled app (Netflix / Hulu)", "verified": false, "helpfulness": "0/0", "author": "Alberto I."}, {"rating": 5.0, "review": "I love this.  Works great on my home network.  No issues at all.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "this is the best in the market", "verified": true, "helpfulness": "0/0", "author": "Eusebio del Rio"}]