[{"rating": 4.0, "review": "A work in progress figuring it out.", "verified": true, "helpfulness": "0/1", "author": "P. Skene"}, {"rating": 4.0, "review": "I would put 5 stars if it had more games", "verified": true, "helpfulness": "0/1", "author": "Jonathan"}, {"rating": 2.0, "review": "In comparison to Apple TV it's not as customizable and there's nowhere near the same amount of apps. Kind of a let down.", "verified": true, "helpfulness": "0/1", "author": "Josh Philipson"}, {"rating": 4.0, "review": "I have enjoyed it very much, only one day did I have problems.  Easy hook up.", "verified": true, "helpfulness": "0/1", "author": "kj"}, {"rating": 5.0, "review": "One of the Best TV sticks out there.  This is my second stick. The ability to Side Load KODI itself is worth the value of this item, all other stuff it provides are bonus (BT remote, Amazon Apps, Free Games, Prime movies, list keeps increasing)", "verified": true, "helpfulness": "0/1", "author": "Jai"}, {"rating": 5.0, "review": "Very easy to set up. I love all the programs I can watch now. Glad I bought it.", "verified": true, "helpfulness": "0/1", "author": "Scott Lacey"}, {"rating": 2.0, "review": "I received the Firestick as a gift and I am still trying to see what benefit I can get from ii; So far, it appears more limited than I hoped. If you subscribe to Amazon Prime, you can view most anything that is available on the Prime network, but I found two severe limitations. First, a number of networks like Starz, Encore, Disney XD, etc are presented as if you can simply sign on to access the service. But when you try to do that, you are told the service must be a part of your TV package to sign up. That should be spelled out up front as a DISCLAIMER to prevent wasting your time. Second, several content services are available but it seems that everything must be rented or purchased since most of the content is older, I see no reason to do that. There are also a few subscription networks that are accessed for a monthly fee. Again there is a lot of old content, but if that is what you are looking for, fine. Just be sure of what you are getting before you subscribe; I am generally disappointed with the service as I recently cut back my cable service and was looking for something to fill the gaps. So far, not much luck.", "verified": true, "helpfulness": "0/4", "author": "Ralph F, Rumpf \"Geek for Life\""}, {"rating": 4.0, "review": "This is an amazing product, although I already had a smart tv but adding this brought whole new experience altogether. It is much faster than Tv smart options and Amazon video collection is not bad at all. I found myself going less to less to Netflix and stream Amazon shows more often.", "verified": true, "helpfulness": "0/1", "author": "Imran"}, {"rating": 5.0, "review": "Good great", "verified": true, "helpfulness": "0/1", "author": "Carson vap"}, {"rating": 5.0, "review": "Great for traveling", "verified": true, "helpfulness": "0/1", "author": "Eastr 0067 \"William Easter\""}]