[{"rating": 2.0, "review": "I bought the fire stick to use for Hulu plus subscription that I already had. Just as I read in other reviews, it freezes constantly or continues with sound but the image is frozen. Other apps stream fine so I am very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Karolyn Bergquist"}, {"rating": 5.0, "review": "I installed this a few days ago and have watched quite a few shows on Hulu.  I thought wireless would not work as well as being connected directly to the computer, but not in this case.  So far it is working just as well as my Roku did, and that was hooked up directly from the tv to the computer.  It takes awhile to get used to the remote because there are no arrows for up, down, etc.  The center \"button\" is the \"okay\" and the rim around it is what you use to arrow.", "verified": true, "helpfulness": "0/0", "author": "L. Robinson"}, {"rating": 2.0, "review": "Wow I wish I loved this as much as I liked its easy installation. The menu is EXTREMELY misleading if you want to watch Netflix...even if you've been watching something on Netflix during a prior viewing you end up on amazon prime instead. I can't count the number of mis-starts where we had to go back and load Netflix first. Also fairly frequent interruptions in streaming despite a new state of the art router.", "verified": true, "helpfulness": "0/0", "author": "spankylover"}, {"rating": 3.0, "review": "Giving it only 3 stars because I had to call in for help because it would loose wifi over and over. Called support and they helped me fix it. Turns out these pick up alot of interference from the TV which makes it drop wifi. Wierd for a device made to plug directly into your TV's HDMI slot. I ended up using a tube from empty roll of paper towels along with the the 4inch extension it comes with to move it away from the TV some. Now it works just dont look behind my TV lol.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought the Fire Stick to try it out and was pleasantly surprised.  I think it works great and offers more of a variety than Roku.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Excellent, exceed my expectations.", "verified": true, "helpfulness": "0/0", "author": "mingo"}, {"rating": 5.0, "review": "I bought this for my parents because my mother was obsessed with getting a smart tv. They absolutely love it and it is easy for them to use! A great purchase!!", "verified": true, "helpfulness": "0/0", "author": "Melanie Darrigo"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Senthil Kumar Subramanian"}, {"rating": 5.0, "review": "Awesome! Easy set up!", "verified": true, "helpfulness": "0/0", "author": "Liza Z."}, {"rating": 5.0, "review": "More than I expected!", "verified": true, "helpfulness": "0/0", "author": "Autumn Meredith"}]