[{"rating": 5.0, "review": "Great product and the best part is how easy it it is to get started.  Im not very technologically advanced and so for someone like me to be able to set it up and have it working properly is something.  Havent had a chance to really download a lot of apps but for what I have it works great.", "verified": true, "helpfulness": "0/0", "author": "Denise A. Gates"}, {"rating": 3.0, "review": "It is ok. I should have researched the product a bit more before buying. I had purchased this item in an attempt to get away from the high cost of Cable and Dish programming.  I feel that I am being nickle and dimed to death every time I watch a program. The advertisement is accurate in that they offer access to a plethora of programming, but you are going to pay for it.", "verified": true, "helpfulness": "1/2", "author": "Blaine R. Hall \"Blaine\""}, {"rating": 1.0, "review": "I really wanted to like this product. I really did. But since I received it, it has had nothing but connection issues. I will be on the home screen and it will say to check my network settings. When I do, it says the connection is \"very good.\" The other issue is when trying to watch a movie or show, it constantly stops and starts buffering, then remains at 25% for a few minutes. This happens throughout the movie or show. I contacted support and they were no help at all. They said someone was going to contact me the next day. That was a month ago and still haven't heard anything. It is so frustrating that I am going to go back to using my Xbox live account.", "verified": true, "helpfulness": "6/6", "author": "A. J."}, {"rating": 2.0, "review": "Pretty lame performance. Lot's of stutters and skips. My chromecast performs much,much better. Too bad, because the UI is not bad and the voice search and firefly, or whatever they're calling it, is alright too.", "verified": true, "helpfulness": "1/2", "author": "Brick Pollitt"}, {"rating": 5.0, "review": "I had bought the Apple Tv thinking I would use it and then it became an eye sore. This little stupid box just sitting there. I then signed up for a Netflix account because I wanted to start watching Blacklist and a few other shows and I got tired of downloading all these tv shows. The Amazon TV stick is the best $34.00 I've ever spent. It turned our old TV into this smart tv with the help of this little usb flash drive looking thing. Easy to install, easy to use and now I have a ton of shows at my finger tips. I couldn't figure out which would be better - this or the other Amazon tv thing but since I don't really care about an external hard drive, this was cheaper and easier to get. I love it and am currently abusing the crap out of it. It's nice you can carry it all over the place. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Gemma"}, {"rating": 3.0, "review": "Did not meet my needs, my intention was to reduce cables to my Optima W311  projector. My projector does not have Bluetooth so I had to plug in USB speakers. I also kept getting a message that insufficient USB power no matter how I plugged it in so that added another wire. Plus where I live the fastest Internet I can get  works fine for my laptop but the fire stick would not load Netflix, whereas my laptop using HDMI I do not have any problems. Unfortunately this did not work as planned in my situation, you may experience vastly different results.If you are using it on a smart TV and you have a fast Internet connection then you will be fine but if you have a smart TV do you actually need it?I am just posting this in case your intentions are similar to mine, then you may have to research more.on a positive note it is packaged well and feels like good quality also fairly simple to use.Unfortunately it is going back.", "verified": true, "helpfulness": "0/0", "author": "Dave T"}, {"rating": 5.0, "review": "Really great piece of tech. Does its job pretty well, no problem with streaming or anything, even does a bit of gaming too ^_^", "verified": true, "helpfulness": "0/0", "author": "Nika Topuria"}, {"rating": 1.0, "review": "very slow .. stops to do some loading a couple of times during each movie.. gets really hot after watching two or three movies on it..  not satisfied at all.  I still love AMAZON for all their other products.", "verified": true, "helpfulness": "1/1", "author": "Maher"}, {"rating": 5.0, "review": "Totally love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a pretty cool lil' device. Install and registration was a breeze. I downloaded the FireTV iOS App (allows for voice search and a keyboard) in favor of the included remote, and am quite impressed with this package. The Fire TV Stick is a must have for those looking to stream Amazon Prime Videos, as with augmenting their home (iOS-driven) entertainment system. Will be handing these out during the holiday season.", "verified": true, "helpfulness": "0/0", "author": "OCTrojan"}]