[{"rating": 5.0, "review": "Why did I wait so long?  This was the easiest electronic device/system I have ever used... it took me longer to open the box than to set it up... in less than 5 minutes I was up, running, already seen the cute automatic start video on how this thing works and was already adding to my watch list!  I am serious... it was under 10 minutes and I had 20 things to watch...  I started with the Alpha House, TV Prime.. and saw almost all of season one... I love that show... it is DC based and I swear I know some of those people and I think I have to work with about half those characters!  I have not laughed so much in years!  (I am still trying to figure out how the device knew who I was and my email address.. just from the entering the router code??? Kind of scary... :) ((The hardest thing I did was to remember that letters are capitalized for the router!))Thank you AMAZON for the easiest, nicest, most affordable little streaming device... if I can install this at the end of a long day at work with not a single problem.. anyone can do this!!  (and, the device is quite durable as I dropped it trying to clean the dust out of the hdmi socket on my older tv... I need  to dust more... )  ((And, I appreciate the personal email sent last week right before shipping the Fire TV Stick to remind me that I have not been using all my Amazon Prime Perks... and to remind me of all the things I was missing!  I sure was!!", "verified": true, "helpfulness": "0/0", "author": "Flowerdragon"}, {"rating": 5.0, "review": "this is far better then firebox that i see from my friend.. highly recommended", "verified": true, "helpfulness": "0/0", "author": "Ray Chan"}, {"rating": 4.0, "review": "It needs to have more apps available.  Like HBO go and Cinemax go, starz etc... And the major cable company apps.  I travel for work and pay for cable at home.  I bought the stick to be able to enjoy the cable that I already pay for.", "verified": true, "helpfulness": "0/0", "author": "Brian Clegg"}, {"rating": 5.0, "review": "I LOVE it", "verified": true, "helpfulness": "0/0", "author": "Karen Mileham"}, {"rating": 5.0, "review": "Super product.  One of the most easiest installs I have ever experienced and I have experienced a lot.  I used it more than 8 hours the first day I received it.", "verified": true, "helpfulness": "0/0", "author": "Louis D Cain"}, {"rating": 5.0, "review": "I like it.", "verified": true, "helpfulness": "0/0", "author": "Joshua M. Welchez \"Josh\""}, {"rating": 5.0, "review": "It worked perfectly.  I have tried the Roku and Chromecast and I would definitely recommend the Fire TV Stick over the competition.", "verified": true, "helpfulness": "0/0", "author": "Lori Statler"}, {"rating": 5.0, "review": "Great product , doesn't everything it is suppose to!", "verified": true, "helpfulness": "0/0", "author": "Wabasso"}, {"rating": 5.0, "review": "Very good product easy to install and to use. Besides all paid services like Netflix there are thousands of things to watch using Youtube!", "verified": true, "helpfulness": "0/0", "author": "YA"}, {"rating": 5.0, "review": "Very good product and fast shipping, congratulations!", "verified": true, "helpfulness": "0/0", "author": "GregoryHouse"}]