[{"rating": 4.0, "review": "arrived on time and works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use!  I have not taken it on the road yet though.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love it so much", "verified": true, "helpfulness": "0/0", "author": "Jean Bruschi"}, {"rating": 1.0, "review": "Nothing but continual problems for Netflix", "verified": true, "helpfulness": "0/0", "author": "Joseph Unthank"}, {"rating": 5.0, "review": "Does exactly as advertised.  Good value for the money", "verified": true, "helpfulness": "0/0", "author": "Chris Lofgren"}, {"rating": 4.0, "review": "This is a great device", "verified": true, "helpfulness": "0/0", "author": "William Hudson"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Mindy Flynn"}, {"rating": 1.0, "review": "I was really disappointed with the Firestick It had a great start up video and I was so excited to get started. Everytime I loaded a show it would go back to \"Welcome to Firestick.\" I thought it was my internet connection, checked it and it was perfect. Sent it back.", "verified": true, "helpfulness": "0/0", "author": "Kim Snyder"}, {"rating": 3.0, "review": "Only three stars, but I do recommend it if you have Amazon Prime.  You can use an APP or the remote which comes with this.  The APP is good, the remote is surprisingly better.  The product claims it is superior than ChromeCast because it has more memory and is not given to buffering.  However, this is not the case.  It actually buffers more than Chrome, and unlike Chrome is subject to the video pausing while the audio continues on.  This disappointment aside, the Fire Stick seems to be more versatile than Chrome.  For example it allows you to run apps.  Chrome by the way, does not run Amazon Prime.  I assume this is Amazon's choice.  The stick fits into an HDMI port, and must be powered from the wall unlike chrome which does not need an external power source.  Final verdict, I'd buy it again.  Works well 95% of the time.", "verified": true, "helpfulness": "0/1", "author": "iWitness"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Jose R.O Connor"}]