[{"rating": 5.0, "review": "Love it. It is great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great buy", "verified": true, "helpfulness": "0/0", "author": "robert dixon"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Fawne"}, {"rating": 2.0, "review": "picture quality is not as good as the roku lt or the apple tv that I have, video freezes a lot.  I got mine free by paying for three months of sling tv so no big loss.  If you are looking for a streaming device, buy either a roku or apple tv.", "verified": true, "helpfulness": "1/1", "author": "Judy Yeddo"}, {"rating": 5.0, "review": "This is a fantastic product. It hides behind my tv instead of sitting on a shelf where it is visible. The remote is easy to use and there is also an iPhone app remote which is nice.", "verified": true, "helpfulness": "0/0", "author": "Julie Y. Bost"}, {"rating": 4.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Steve Schwartz"}, {"rating": 3.0, "review": "Very glitchy. I often have to reset the stick just to get things running smoothly again. The remote is horrible and 'sticks' all the time. Seriously disappointed with the false advertising in regards to a power source. It looks as if you don't need to plug it in (figured it would draw power from the TV) but that is not at all the case.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 1.0, "review": "Just one star because no where does it tell you that you need a power source for the Fire to work. It does not simply plug into the USB port on your TV. You will need an open outlet and probably an extension chord as well as the provided power chord is very short.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "this is my new favorite thing! I didn't know it had to stay plugged into the wall all the time tho. I was under the impression that it was cordless. but no matter, I made it work. I love that the remote doesn't have to be pointed directly at it in order to work. that makes life easier. there's a kindle app for the remote. I was hoping there would be one for the iPhone, but there isn't, and that's understandable but irritating too. I love that you can play your kindle games on the tv :)", "verified": true, "helpfulness": "0/0", "author": "Jaime"}, {"rating": 3.0, "review": "Little disappointed with the prime selection so far... My wife and I saw the \"thousands\" of titles and was expecting some good things; however, it seems like you still have to pay for more than not.  Maybe we're just missing something.", "verified": true, "helpfulness": "0/0", "author": "Robert J McElmurry"}]