[{"rating": 4.0, "review": "Hard to beat for the price! Can't wait for the iOS app to come out!", "verified": true, "helpfulness": "0/1", "author": "Adam"}, {"rating": 5.0, "review": "Love this. I received it as a birthday present from a family member. Works fine with my wifi too.", "verified": true, "helpfulness": "0/0", "author": "Kelsey Sperling"}, {"rating": 5.0, "review": "I just got this last night but really enjoyed it. It was easy to hook up, had it done in less than five minutes. I love, love, love it.", "verified": true, "helpfulness": "0/0", "author": "Joseph Whiters"}, {"rating": 3.0, "review": "This is for the Fire TV Stick, works great, but due to memory limitations many games my children play are not available to play on this device like they are on the Fire TV device. Works great for watching videos and other apps, just disappointed (and should have realized) that we can't play Asphalt 8, Minion game and several others that the children love to play. Will most likely replace with Fire TV down the road and use this for portable movies etc. when traveling or visiting others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Overall, its a great device. Netflix can shutter at times, but other than that no complaints.", "verified": true, "helpfulness": "0/0", "author": "ryan"}, {"rating": 1.0, "review": "I'm updating this review.  DO NOT BUY THIS DEVICE.  The Fire Stick is terrible, it's a waste of money.  It constantly locks up, sometimes the remote doesn't work for unknown reasons.  Content starts and stops repeatedly.  I own a Fire TV for my office, I'll probably end up replacing this Fire Stick with a Fire TV.  I'm disappointed I can't give this 0 stars.It works well for amazon content.  The remote appears to be \"sticky\" for some other apps making it difficult to type in text with the remote.  For example entering in my Netflix password is a nightmare of watching to see which letters somehow double or triple clicked and trying to appropriately back out the correct number of letters, which also repeat clicks.  This doesn't happen with my Amazon FireTV box, but only my Amazon FireTV stick.", "verified": true, "helpfulness": "0/0", "author": "Phil DeVeau"}, {"rating": 5.0, "review": "Beyond amazed I love this device!!!!! Wish this came out sooner!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Keys4"}, {"rating": 4.0, "review": "I got my Fire TV Stick working within minutes for both Netflix and Amazon Prime.  I also side-loaded XBMC/Kodi so that I can watch my live/recorded TV as well as access my video library.  I would love to see Amazon add a DVD player and native XBMC/Kodi support - this would be the perfect product to replace many of the components in my cabinet with one device.", "verified": true, "helpfulness": "0/0", "author": "E"}, {"rating": 4.0, "review": "I like the portability. I can even get it to work. Sort of. I wanted it for miracast when in the hotel. But the software was not able to connect to the internet on the hotel WiFi. I think the software will improve and fix this. When I was connected, it worked perfectly. I'm just waiting for this new product to gain more maturity.", "verified": true, "helpfulness": "0/0", "author": "pterpening"}, {"rating": 5.0, "review": "Super-easy to set up (plug in, choose your WiFi connection, type in your password, and a little cartoon shows up to tell you how to use your new device). If you've had any other similar device (like a Roku), this will be very easy to learn. I didn't have any trouble with the remote (yet) as a few others have reported.I bought this on sale, and my primary use is with Amazon Prime, so it seemed a no-brainer to buy a device built with that in mind. I like that there's no box to take up more space on my already-crowded entertainment stand. So far, it's streaming very well and is fast to respond when I click.", "verified": true, "helpfulness": "0/0", "author": "Space Salamander"}]