[{"rating": 5.0, "review": "This Product works amazingly , im very happy with it , im glad I made the move to drop cable service", "verified": true, "helpfulness": "0/0", "author": "cliffmd"}, {"rating": 5.0, "review": "Really like it. Prefer it to Chromecast because it offers Amazon Prime Instant Video and Netflix plus so much more. I have also used Roku boxes and prefer Fire TV stick to it as well because of lower price, similar features, yet lower profile. And I definitely prefer it over a smart TV. I would never buy a smart TV again. Fire TV stick, Roku, and Chromecast all work better than our smart TV for Netflix, etc.", "verified": true, "helpfulness": "0/0", "author": "Carissa"}, {"rating": 5.0, "review": "Works beautifully even household members with mild hearing loss can hear", "verified": true, "helpfulness": "0/0", "author": "Marie Carpenter"}, {"rating": 2.0, "review": "I got my Fire Stick free for signing up for Sling for three months. If I'd paid for it I would want a refund. It cuts off two or three times per day. I figured out you have to unplug the electric cord and plug it back in to get it to work again.  Other than that it's ok. but it's just aggravating when it cuts off. Always at the worst time.", "verified": true, "helpfulness": "0/0", "author": "Pickle Head"}, {"rating": 1.0, "review": "I started writing this review while setting up a new FireTV Stick to go in another room of the house. From beginning to end is about 1 hour. It took 25 minutes for me to go from being a happy Amazon customer to one who will probably NEVER buy another Amazon branded electronic device.5 minutes in  -  One star since your instructions say the device is already registered to me since I purchased it here on Amazon with my Amazon Prime Account, but it is not registered and I hate entering secure (aka LONG) passwords in these horrible softkeyboards using a directional button. It was already a pain putting in the long wireless key. Why can't I just type some stupid random code into a browser window to register the device like with Hulu, Netflix or Amazon Prime? I wouldn't have cared as much if you didn't pretend to have a fast trouble free setup.It didn't help that for some reason the screen began to flash green while asking me for my account credentials. Unplugging from the HDMI port and re-inserting seems to have remedied it.It just gets worseOkay...5 minutes later it happened again. A quick Google search shows that this stupid device doesn't work with the Panasonic Plasma (1.5yrs old) in 1080p. Sweet. Where's the hardware compatibility list for this $40 garbage?  Looks like this is going back and I'm buying an AppleTV device or Chromecast. I really hate that you wasted my time with this BS Amazon. The device was going on Sony LED TV but I'm not in the mood to play games with Amazon when they can't seem to work out how HDMI standards work and there is no warning about it not working with certain major brand HDTV displays. What a waste of time. I'm generally an Amazon fanboy but this and a Xmas fiasco with Amazon's tablets is definitely eroding that.50 minutes in - After speed-reading a few forums and Amazon help boards it looks like the pixel orbiter that prevents burnin on Panasonic Plasmas is what the FireTVStick can't handle. It should stop if I disable that, at the expense of possibly damaging my screen on my $2k TV with apps on it to use this $40 device. Still going back. I don't appreciate the negatives before ever getting to use it. Choose another device folks.", "verified": true, "helpfulness": "2/3", "author": "REO Speed Dragon"}, {"rating": 4.0, "review": "Easy to connect.  Easy to register.  Easy to get started.  Had to learn how to use little remote but figured it out.  Would have rated it 5 stars if remote was slightly larger.  So far am very happy with device.", "verified": true, "helpfulness": "0/0", "author": "Nealy Moxam"}, {"rating": 5.0, "review": "Works much better than gaming systems lije ps3 if wii", "verified": true, "helpfulness": "0/0", "author": "Thomas McNamara"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "karen"}, {"rating": 5.0, "review": "Love this, I watch a lot of shows from Amazon and love being able to watch on my TV when I'm at home, very easy to use", "verified": true, "helpfulness": "0/0", "author": "K. S. Chestnut \"crafter\""}, {"rating": 5.0, "review": "Now I can watch Netflix, prime movies and much more on any tv instead of my tablet", "verified": true, "helpfulness": "0/0", "author": "Ebo"}]