[{"rating": 5.0, "review": "The Fire TV Stick is fabulous!!!", "verified": true, "helpfulness": "0/0", "author": "Patric Bougher \"old cow girl\""}, {"rating": 5.0, "review": "It works well, I am happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "natasha west"}, {"rating": 3.0, "review": "I like it but one of the things that i have been having an issue with was watching my Prime on the TV series if it auto starts the next one the audio is distorted and i have to go out to the home page and restart the episode and everything is fine.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very awesome.", "verified": true, "helpfulness": "0/0", "author": "Bobby"}, {"rating": 5.0, "review": "More than I expected it to be. My daughter loves that she can play games on this and use my phone as a voice remote. She simply says the name of the show she wants  on the firestick  tv app on my phone and it pulls it right up.", "verified": true, "helpfulness": "0/0", "author": "stephanie Seel"}, {"rating": 5.0, "review": "awesome, small and convenient", "verified": true, "helpfulness": "0/0", "author": "mark a ward"}, {"rating": 5.0, "review": "Amazing!!!", "verified": true, "helpfulness": "0/0", "author": "Albert Covington"}, {"rating": 5.0, "review": "Love it.. easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "LinksAplenty"}, {"rating": 5.0, "review": "I purchased this as an easier way to watch video on Netflix, Prime, the Plex app, and to be ready for Sling Tv when it launched.  This more or less replaces my HTPC for most of those uses.  The native apps are great with a few exceptions (YouTube app is not so great for example).  If this is all you want out of the device it is hard to beat for the price.  If you have very many items in your amazon video library then it makes accessing those a breeze.  I also find myself using prime video more with this which can be nice when they get something I want to watch first.  If you want a more robust ecosystem of apps and channels this may not be the thing for you but that should be obvious.  As the number of apps increases this item will only get better and may completely replace my HTPC but there are a few things that I still use that for like NBC content.  I tried side loading the NBC app but every time it updates you have to reload it which defeats the purpose of an instant on device like this.", "verified": true, "helpfulness": "0/0", "author": "Chris S."}, {"rating": 4.0, "review": "Worked exactly as anticipated, easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Steve Rummel"}]