[{"rating": 5.0, "review": "my son loves it!!!", "verified": false, "helpfulness": "0/0", "author": "vballvicki"}, {"rating": 4.0, "review": "Easy to set up, issues with wifi staying connected, changed router channel to 10, seemed to work.  Some slowness with DSL but tolerable for the 39$", "verified": true, "helpfulness": "0/0", "author": "Alison Page"}, {"rating": 4.0, "review": "I was already an Amazon Prime member, and the Fire TV Stick came already configured with my account information. All I had to do was give it the pass phrase for my local WiFi network.My only complaint was it took me a while to figure out how to navigate the online menus with the remote - but perhaps most folks would have known that the ring at the top of the remote were the \"nav\" buttons, while the center of the ring was the \"select\" button.One feature I really like is that once you pause a movie, after a little while the Fire TV Stick begins to display pictures sort of like a screen saver. I've got my Fire TV Stick connected to an input on my home theater receiver, and the changing display keeps that input active on my receiver even when I leave a movie paused for 30 minutes.I've only used the Fire TV Stick to access Amazon Prime TV/Movies so far - but that was why I bought it.", "verified": true, "helpfulness": "0/0", "author": "Hardy"}, {"rating": 5.0, "review": "Very happy.  Set up was easy, the remote is nice and simple to work - has a fairly fast response time.", "verified": true, "helpfulness": "0/0", "author": "Rob Palulis"}, {"rating": 5.0, "review": "Set up was fast and easy. The product comes with everything you need - even batteries for the remote! Works great!", "verified": true, "helpfulness": "0/0", "author": "Susan M. Perreault"}, {"rating": 5.0, "review": "Yah!  No more cable bills!", "verified": true, "helpfulness": "0/0", "author": "Jean Hanna"}, {"rating": 5.0, "review": "I just received my Fire Stick in the mail so I haven't had a chance to do a lot with it just yet. It was super easy to set up so you don't need to be a technology junkie to use it. I purchased this item mainly to utilize my Netflix and Prime memberships and so far so good.", "verified": true, "helpfulness": "0/0", "author": "Brian Retone"}, {"rating": 1.0, "review": "It never stays connected to the internet.  It always gives me the error \"connected with problems\".  My router is less than 10 feet away from it.  Worse purchase yet for me by far!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "INCREDIBLE!", "verified": true, "helpfulness": "0/0", "author": "FRANK LARAIA"}, {"rating": 5.0, "review": "Easy to use great..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]