[{"rating": 3.0, "review": "It only works in the room where the wifi box is directly located/  Even when I plug it into televisions in neighboring rooms, and my wi-fi signal strength says strong, the Fire TV stick will not load.", "verified": true, "helpfulness": "0/0", "author": "nicole"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Billy Earney"}, {"rating": 5.0, "review": "very nice indeed..", "verified": true, "helpfulness": "0/0", "author": "Gaye Bradley"}, {"rating": 3.0, "review": "Unfortunately I can't review the stick itself as it doesn't work where we wanted to use it.  Make sure if you are getting this you have a internet connection that can handle it.  Bought for a birthday present for my son's room, but it just constantly loses signal so you can't use it.  It looks like it would have been great if we could get it to work.", "verified": true, "helpfulness": "0/0", "author": "Dawn Rose \"Dawn\""}, {"rating": 5.0, "review": "So far the Amazon Fire TV stick is living up to their name......It's great!!!!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 1.0, "review": "Dissappointed , does no work outside the US!!!  Correction,  only Netflix world because  I  have an account.... I can't access the Premium features of Amazon or any other provider. ..", "verified": true, "helpfulness": "0/0", "author": "Patricia Gomez Esquivel"}, {"rating": 5.0, "review": "The Fire stick is above my expectations.  So much better content than Netflix.  I am bragging about it to everyone I meet.", "verified": true, "helpfulness": "0/0", "author": "Brenda Ludwig"}, {"rating": 5.0, "review": "I love it! Very easy to use and totally worth it", "verified": true, "helpfulness": "0/0", "author": "Tiffany damon"}, {"rating": 4.0, "review": "It came with minimal directions on the set up process. The product itself is was good.", "verified": true, "helpfulness": "0/0", "author": "Melanie Land"}, {"rating": 5.0, "review": "Very easy to navigate and auto set up if you have a prime membership! Only had for a short time but love it so far! I downloaded the free App, and use voice search.", "verified": true, "helpfulness": "0/0", "author": "Dudabuda"}]