[{"rating": 4.0, "review": "I would have liked to have had a users manual come with the Fire TV Stick. Do not think i should have to pay to get the users manual. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Jan A."}, {"rating": 5.0, "review": "Device As Is:The best way to access prime content and Amazon Instant video Rentals. I love how easy it is to access all Amazon content. Before getting this i had considered getting rid of prime but with this and the recent addition of prime Music I think I will continue with prime always. I could describe this with more detail but at the end of the day it ties in beautifully to amazon content. It is also a nice way of accessing Netflix, i have an older Smart TV, First Gen I think and its Netflix interface is almost worthless. The FireTv version is a significant improvement. Games are good too. My wife and I fought a little over playing Tetris on it when we first got it but overall we use it for Video and music. Watching Prime is almost constant in our household now. We got cable in our house for the first time ever in march to get a better internet connection and since some channels were included  we figured why not try it. at first we used several channels then just Disney (we have a toddler) now we don't really even bother with it. there is plenty of child friendly content on prime. i'm even thinking of giving up Netflix as it seems we almost never watch anything there now that prime is more convenient (My smart Tv did support it but hardly usable at all) and the content selection is getting better all the time including more recent releases. Plus Amazon is a better Value if you use every prime benefit (I tend to) with Free Books that are next Months New Releases, 1 free Book rental, Now prime Music, the Prime instant Video, and 2 day shipping it is insane that Amazon hasn't raised the price again. Maybe next time they should create a choose your selection price increase. If you want it all it will be YYY but if you don't use most of the features the price won't change.... At the current price of $99 a year I think that's less than my current basic Netflix subscription. (8*12=96 and i think its actually around $8.50 so around $102 a year)This device does pretty much all i could hope for in such a device. still some room for Improvement as noted below.Sideloaded Improvements:I have sideloaded several things to this of which XBMC soon to be known only as Kodi is my favorite for playing any media from your network or the internet it really is hard to beat and so far it seems to work flawlessly. It pulls metaData for all your movies and music. Using XBMC with it makes the FireTv stick the best thing I have found for streaming your own digital collection to your tv.If you don't want to sideload you can use Plex for similar capability but it places limits on file structure for your existing Movie collection (must be in a self contained wrapper file not the direct DVD like multi folder structure. Kodi (XBMC) handles either and even full dvd files allowing you to have the menu features of the DVD intact.Before looking at this next part remember i rated it 5 stars. Faults often are easier to have a lengthy discussion about but I do love this device overall.Room For Improvement:Enabling reordering of the main Screen left menu structure would be a big help Music is one of the things i access most and it is near the bottom. Prime and netflix are my most acessed and prime is one down from home so that is correct by default but if its been a while since i last used netflix it is rather inconvenient to get to which is my next point:Allowing placing/locking things to home really is vital. The Fire phone allows pinning frequently used things to the home carousel. Home is mainly a list of suggestions from amazon, 1/3 of the space is recently accessed content (Music, Prime videos, Videos in your library, apps)  the rest is \"suggested\" content.The suggestions are fine sometimes what you want but a better approach would be 1/3rd recent 1/3 favorites (same content as recent but user selects what goes there and the order and it doesn't change without their direct request.) 1/3 suggestions.It needs a way to access an existing Disney Movies anywhere collection. I wish it could access Vudu for Disney Anywhere collection access built in. Ultraviolet is possible through flixster but that doesn't incorporate an existing Disney collection since Disney ins't part of the UltraViolet Consortium. Though Disney Digital codes do work with amazon instant video quite nicely. As I understand it you can get a sideload of Vudu for android to work on the fire tv line. I installed it no problem but since its designed for touchscreen it doesn't really work with the amazon remote. I wish Amazon, Vudu (walmart), etc would stop trying to compete by making customers choose one ecosystem but not allowing you to use their devices with another ecosystem. Amazon compete by making your ecosystem better and allow access for the times when someone else's is preferred in the end you will win. However I prefer amazon video on this to Vudu. Vudu's interface isn't as convenient to watch movies you own from People complain about amazon being sell sell sell but while purchasing options are conveniently placed and \"Suggestions\" really are omnipresent on the home screen you can readily access content you have already purchased or that you subscribe too. Granted they allow Netflix which competes with prime so it could be entirely Vudu who is unwilling to have more open competition. And it really wouldn't matter to me if Disney Movies Anywhere could link directly to amazon. (it links to Google play, itunes, and vudu)", "verified": true, "helpfulness": "1/3", "author": "Josh EE and all Techcentric"}, {"rating": 5.0, "review": "we are still discovering all the ways this can be used, but are VERY, VERY happy with the purchase!  SERIOUSLY thinking of ditching cable!  THANK YOU!  Great innovation!", "verified": true, "helpfulness": "1/1", "author": "Peggy Morgan \"Peggy\""}, {"rating": 4.0, "review": "Small, compact, versatile. It is nice that it only takes a few moments to turn on and open Netflix's. Compared to consoles, this device is down-right snappy.Pro'sFastPlenty of web TV options including Netflix, Twitch.tv, Hulu+, Youtube and more!compact, and (can be) self powered by the HDMI slot. Though it is recommended to use the USB > Wall charger.Integrates with your phone or tablet with either the fire app or if you like Youtube, the youtube app on your phone. This makes it easy to NOT lose your remote (unless you tend to lose your phone)Con'sArbitrarily changes the resolution depending on context even if the item can be displayed at a higher resolution. An example would be Netflix, on a PS3 you can always get Netflix at 1080p, but the Firestick will sometimes decide 720p is better and not give you the option to enforce a resolution.Some of the apps (which is not really Amazon's fault, hence only one star off) are not well designed. This FireStick uses a very specialized Android-ish operating system. So ideally you would have generally the same functionality. However this is not always the case. For example, the Twitch.tv app does not have any search or sign-in feature, so if you are following a smaller, less followed channel. You can end up going through several pages of channels to find the one you are looking for.Overall, I would buy again and recommend to friends for a low cost Web TV streaming solution", "verified": true, "helpfulness": "0/0", "author": "Blizzard McGuiness"}, {"rating": 5.0, "review": "AWESOME!!!", "verified": true, "helpfulness": "1/1", "author": "joseph f. moran"}, {"rating": 5.0, "review": "I love the fact that's it's not bulky and there isn't a lot of wires.  It's clutter free, and no interruptions.  My computer doesn't have to be on to watch TV.  I can do other stuff on computer while watching on TV.  Love, Love, LOVE IT!", "verified": true, "helpfulness": "1/1", "author": "Ed-word \"Urban\""}, {"rating": 3.0, "review": "I wanted to love this Fire Stick. Much of the time I do. It would border on being a wet dream for an Amazon Prime streamer of Instant Video and Music,  if it only it were more reliably robust when scrolling through the various menus. Right now (after a couple of months) the Fire Stick and I definitely have a love/hate relationship. When it's working, it's rather brilliant at what it does. Very little, if any buffering going on when streaming video. But the incredibly smooth and fast menu system is definitely buggy, whether one attempts to use the included remote or use the Android app. I tend to have much much better luck when controlling it with the Android app and very sparingly even fool with the remote. It feels like the hardware side of things can't keep up with the really fast and responsive Menu software controls, and then the Menu and/or hardware freezes up. Much of this is happening when utilizing Amazon Prime Music and attempting to scroll through artists and/or albums. But it also happens throughout the menu system. I have the best luck when every few hours I perform a soft boot of the device by unplugging and replugging the power.", "verified": true, "helpfulness": "1/1", "author": "​Anthony (Tony) Peña"}, {"rating": 5.0, "review": "Love the fire stick!  Especially since we can side load other apps.  The word is in your hands!  Thanks Amazon", "verified": true, "helpfulness": "1/1", "author": "Tamatha D. Ogden"}, {"rating": 3.0, "review": "The extension need to be taken off so it would work on older than 5yr TVs other wise it freezes up on you! Hulu streams in like a bad internet connection were on PS3 it comes in fine!!! All the other apps seem ok but way bummed out ab hulu n the glitches!!!", "verified": true, "helpfulness": "0/0", "author": "Marion Varner"}, {"rating": 5.0, "review": "I was surprised at how flawlessly the device installed; the user interface was simple and intuitive. Wished voice command came standard with the remote. The Android app worked well but where is the iOS app? A must for all Amazon Prime members.", "verified": true, "helpfulness": "1/1", "author": "Steven Chan"}]