[{"rating": 1.0, "review": "Bought this product with high hopes to connect to my non smart tv's in my upper level of my home (ranch style home, router in basement).  Come to find out if your more then 20ft away it doesn't really work. Even with the extention plugged in. It connects to the internet in the menu, then disconnects when you choose a show or movie.  A big disappointment for me.", "verified": true, "helpfulness": "0/0", "author": "Jeremiah Mojica"}, {"rating": 4.0, "review": "This item worked exactly as described and I am very happy with it. The remote could be a little better, but all in all a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Linda Poirier"}, {"rating": 5.0, "review": "Awesome streaming device ! ! !  Pairs well with Prime for instant video and music as well as Netflix and many other apps.  I especially LOVE the variety of setting preferences.  You can set up parental controls easily.  It streams well and has performed flawlessly.  Great and portable device.  Makes me love Prime Services even more", "verified": true, "helpfulness": "0/0", "author": "KayKay \"Karen\""}, {"rating": 5.0, "review": "I love it - easy to install. The only problem I had was trying to open the remote to put the batteries in. I had to go online to find a video on how to open the remote. Things that should be simple are no longer necessarily simple. I still find it hard to remove the battery cover on the remote.", "verified": true, "helpfulness": "0/0", "author": "Cathy B."}, {"rating": 5.0, "review": "I love my fire stick! Wish it had a bigger remote and the Google or Safari app to browse the web.  But you can download the remote app for your iPhone.", "verified": true, "helpfulness": "0/0", "author": "C. Jones \"kk729\""}, {"rating": 4.0, "review": "I have been generally very happy with this product. I use it to stream prime movies and the NBA League Pass App is great. No skips or lags and the audio syncs perfectly. However, I take huge issue with Amazon marketing Fire TV as a way to watch the new \"Game of Thrones\" season. While it is technically true that you can now use the HBOGO App on Fire TV, a Comcast customer MUST also have a cable tv package in order to access HBO. If you have only Comcast internet (which is the case for millions), Fire TV alone will not be a way to legitimately watch HBO shows.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best purchase I ever made!! My hubby has taken it over...lol...seriously...you must get one...you will not regret it...", "verified": true, "helpfulness": "0/0", "author": "Seventyschild"}, {"rating": 5.0, "review": "OMG! I love this thing! I love everything about it, the movies, games, music that are readily available with just a press of a button. I especially LOVE the lyrics scrolling as the songs play. I also love that if I travel, as long as where ever I go has wifi, I'll be able to take it with me. Fantastic little device!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "mdpowershopper"}, {"rating": 2.0, "review": "Some apps have bugs where you go to open it and it starts the show you just watched instead of the home page. I have had to uninstall and reinstall some apps every time I want to use them. Also, there is way to much buffering and skipping. I had a roku attached to the tv I am currently using the stick on and it never buffered and skipped as much as the Fire Stick does. For an amazon product I am really disappointed in it.", "verified": true, "helpfulness": "0/1", "author": "Pen Name"}]