[{"rating": 5.0, "review": "Love it!!", "verified": false, "helpfulness": "0/0", "author": "Living the dream"}, {"rating": 5.0, "review": "Best purchase I've made in a long time.  So much to offer with the Prime membership I already had.", "verified": true, "helpfulness": "0/0", "author": "T. Kelleher"}, {"rating": 5.0, "review": "Loved it", "verified": true, "helpfulness": "0/0", "author": "L. Edmondson"}, {"rating": 5.0, "review": "Amazing technology!  We haven't had an opportunity to use it much but we like it so far!  You can watch just about anything on it!  Netflix is great and Pandora comes through no problems.  The best thing about having something like this is NO BUFFERING!", "verified": true, "helpfulness": "0/0", "author": "Brandy Stauffer"}, {"rating": 3.0, "review": "The included remote is the only downside.  It started out great, but now the remote has had some errors.  The remote app works perfectly,so the issue is in the remote.  I will contact Amazon about this and will report back.Amazon sent me a new remote, same issue.  Randomly, if you press a button it will scroll infinitely in that direction.  It is super annoying.", "verified": true, "helpfulness": "0/0", "author": "David P. Retske"}, {"rating": 3.0, "review": "I've waited with my review to see if it would improve from my initial results.  When it works, its very nice.  However when I down-load a long movie, it cuts to a blank screen towards the end.  If I unplug it for awhile, it comes back on, which is very annoying.  Also I bought the voice command which is wonderful, however the other remote, that was shipped with the Fire TV Stick failed to work.  So in review, I got one bad remote, one firestick that works for awhile then blanks out, a voice control which is great and worth the money, and I would have to say, that had I had not bought the voice control too, it would never have gotten off the starting line.  I think the firestick is (heat sensitive) and that needs to be corrected, unless mine is just bad.", "verified": true, "helpfulness": "2/2", "author": "Russell"}, {"rating": 5.0, "review": "first this is not  chromecast which primary for sending video or screen display from a tablet pc or phone. fire stick is a stand alone device that plays games. the android fire control app has voice search fuction. does require a good wireless  connection the stick will output 5.1 dd + for show that send it. the fire stick outputs rgbvideo levels you may have to select rgb lower or 0 on your hdtv for correct black levels it also supports the fire game controller which is needed for most games some can be played with the remote only downside lack of storage maybe ver 2 could come with 16g or micro sd slot", "verified": true, "helpfulness": "0/0", "author": "robert bush"}, {"rating": 5.0, "review": "Fantastic!! Terrific job by Amazon, very simple to install and use. My Netflix doesn't buffer like it used to from time to time when I connected through my Wii or laptop. Glad I waited for this.", "verified": true, "helpfulness": "0/0", "author": "The Kwamster \"Kwamster\""}, {"rating": 1.0, "review": "Disappointing. Amazon claims this device is Miracast certified. As it turns out it will not work with Miracast on Windows devices. I'm reasonably certain that claiming it to be certified would mean it is compatible with ANY Miracast device.", "verified": true, "helpfulness": "5/7", "author": "John K"}, {"rating": 5.0, "review": "I love this! I not only own a stick but also other fire TV units. They are all extremely easy to use. The sticks are way easier to take places and move TV to TV when needed. The remote is easy to use, but you do need a tiny bit of adjustment time.A tiny hack that I found to help alot - I downloaded the App which you can use to type in things like your email. The voice search is nice but using the app seems to be quicker for me. Otherwise I just sit and scream at the TV. Comical for others but not very useful.But overall this is way better then the Chrome Sticks  (I owe one of those too).", "verified": true, "helpfulness": "0/0", "author": "Jessica"}]