[{"rating": 2.0, "review": "Device seemed cool nice and snappy but the problem comes when you plan to watch a movie it freezes after around 30 min of play time.", "verified": true, "helpfulness": "0/0", "author": "david"}, {"rating": 5.0, "review": "This is a more convient way to watch my favorite shows and movies from Prime. Great idea, and simple to use! It has many different add one as well. The only one I seem to have a problem with is Netflix .. It seems to have issues with the internet. Thank you for making my TV time more enjoyable!!", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 4.0, "review": "Almost perfect!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to plug in and get it to work.", "verified": true, "helpfulness": "0/0", "author": "Bernard Luscans"}, {"rating": 4.0, "review": "It is a little glitchy sometimes. In netflix, for example, it will get stuck scrolling for a while. I dont like that I cant actually turn it off, either. The biggest issue I have is that it cant be close to the router or it wont pick up, which means I cant use it in my living room, but I can use it fine in my bedroom. Overall, I am very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Candie"}, {"rating": 4.0, "review": "Its great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "Love my Fire TV Stick...so much that I have 2 now!Thank you Amazon Smile for giving back by donating a portion of our purchases to charity...so proud to be a Prime Member of this organization! Way to go Amazon, you make me Smile!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Faithful"}, {"rating": 5.0, "review": "Works as advertised, easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love this thing!!  Now I can see all the shows I miss while watching other programs.  It was well worth the money.", "verified": true, "helpfulness": "0/0", "author": "dmsbrit"}, {"rating": 1.0, "review": "Bought  3 of them to place on all my tvs to watch MLB.....Waste of money......Can't watch games because of continuous buffering which makes the games unwatchable. Amazon nor MLB doing anything to correct problem....", "verified": false, "helpfulness": "0/0", "author": "JV"}]