[{"rating": 5.0, "review": "I just started using the Amazon Fire TV Stick and it makes me want to cancel my ridiculously expensive cable. I am definitely considering it for the near future. I thinks it's really great. I'm enjoying Netflix even more on my television screen as well as ShowtimeAnytime. Also, having Pandora on there is the icing on the cake. I can't thank you enough for such a fantastic source of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Linda Merrill"}, {"rating": 3.0, "review": "Very easy to use and set up. So far works well except for freezing and buffering a couple of times.", "verified": true, "helpfulness": "0/0", "author": "vikki weisbeck"}, {"rating": 5.0, "review": "This thing is awesome! Super responsive, great apps, very user friendly! You get super easy access to your Amazon content, and there's even an app you can get to stream content from your computer. Love it more than cable!", "verified": true, "helpfulness": "0/0", "author": "Julie Schroeder"}, {"rating": 1.0, "review": "I was so excited to get this for my daughter for Christmas for $19. We set it up and wouldn't work correctly. I just figured it was my internet connection. She then started staying in her sister's room because big sister got a new loft bed so the Fire Stick got put on the back burner. We tried it again some time later...didn't work. We just tried it again and moved it to different rooms. It still kept giving me error messages. All of our other streaming devices work fine so it had to be the stick. I called Amazon cutomer service. My window to return it was already closed but I purchased the additional warranty. I explained my whole issue and got transfered to another person who had very limited English at best. We did the trouble shoot of unplugging it. Didn't work. He then argued I was past my window of return and didn't seem to care that I had the warranty. I finally got mad and hung up. Called again and had about the same issue. No one seemed to know what to do with it. After 3 calls, several transfers, and an hour later they said they were shipping me a new one. I would rather have had my $19 back!! I was very disappointed with Amazon's customer service. It's normally always been great. All but one of the people I spoke to had very limited English and were bad about just putting me on hold and not telling me or working on something else while talking to me.", "verified": true, "helpfulness": "2/2", "author": "J. Mitchell"}, {"rating": 4.0, "review": "Easy to set up. Appeared to work great. It did not have an app I wanted (Vudu) so I had to return it. If you have apps in mind you want, research the streaming media player first to see if they come with the media player.", "verified": true, "helpfulness": "0/0", "author": "T. Lyons"}, {"rating": 3.0, "review": "I love using this for watching shows on Amazon, Hulu Plus, SlingTV, etc... and I find that the services it provides are incredible. But this TV stick just has little issues very frequently.I started using the stick as a replacement for my old Playstation 3, which was my main streaming device. The available apps and ease of use for this Fire TV stick are what you would expect for a good streaming device.The performance is not. Frequently, the stick will just \"flash\" on and off in the middle of a show/movie. The screen will just go blank for 1 - 3 seconds and my TV will display the indicator that it's lost the HDMI connection, then it'll come right back on. Sure, I've only missed 3 seconds of the show/movie, but you can imagine that it gets very frustrating, depending on when it happens in a show.On a rarer basis, but still regular enough to be an issue, the stick may freeze completely, forcing me reboot it by unplugging and replugging it.At first, I thought that this issue was caused by not using the recommended AC Power Adapter (included). But I still encounter these issues with that adapter.After talking with Amazon over the phone about these issues, I went through a series of diagnostics that are requiring me to call them back multiple times, which is just getting frustrating.I hope to be able to try the bigger Kindle TV device and see if that's more stable.", "verified": true, "helpfulness": "1/1", "author": "Matthew"}, {"rating": 5.0, "review": "Much better interface than AppleTv I was using. Fire stick is being used to access SlingTV and I think it is great for that and so much more. Price was unbeatable and setup was painless. Thanks Amazon. You have me seriously considering s prime membership now!", "verified": true, "helpfulness": "0/0", "author": "Shagaloso"}, {"rating": 5.0, "review": "Simplicity in use. Performs precisely as Amazon advertises. Good price. And very good selection to access on Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Jim D. Mcneal"}, {"rating": 5.0, "review": "really works well as a substitute for a satellite box.  I have used it several times and have not had issues connecting or working with the Fire stick.", "verified": true, "helpfulness": "0/0", "author": "engchick50"}, {"rating": 5.0, "review": "I wish it was voice operated.", "verified": true, "helpfulness": "0/0", "author": "Leroy E Sizemore"}]