[{"rating": 2.0, "review": "The fire TV stick does not work when attached through a receiver.  I installed mine on a Denon receiver and the screen would flicker with noise and turn off.  The unit was plugged directly into the receiver and the power into the wall socket.I was able get it working when directly plugged into an hdmi I out on my tv.  After starting it immediately attempted to update the software and failed.  The unit displayed an error message suggesting to unplug the power and reapply power after several minutes.  After the second attempt the unit again tried to download the software and was still making no progress after 15 minutes.  I restarted the unit by pressing select and play for a few seconds.  Eventually the unit powered back on and successfull downloaded the software.I searched for information on the problem and found someone had a similar issue with an Onyko receiver and amazon had requested he contact them.  Based on that, assuming I perhaps had a faulty unit, I contacted Amazon support after three reps and a phone call, they eventually told me it was not compatible through a receiver....Extremely disappointing to say the least.  I'm going to hang on the unit since I brought it when it was on sale for $19 and use it elsewhere in the house but I wish I had known about this issue before I ordered it.  The units software downloading issues also creating some frustration. Overall I'm less than impressed....", "verified": true, "helpfulness": "1/3", "author": "Ceinwyn"}, {"rating": 5.0, "review": "I had a roku 3 in my bedroom and I disliked the interface on the thing once I got the fire tv.  But I didn't want to pay for another fire tv just because I hated how the roku 3 displayed the amazon instant videos.  Once the fire stick came out it was a no brainer to get one for my bedroom.I love how easier and faster it is to start up and play a video compared to the roku 3, plus the roku ended up having problems dropping my wifi connection the last month or two.Now that I have been informed how to turn off the auto advance feature, there is no reason to not give the device a five star rating.  I had originally given it four stars because it would keep on auto advancing episodes and I wasn't aware there was an option to turn that off.  I kept looking at settings on the fire stick, not my settings from my amazon account.", "verified": true, "helpfulness": "0/1", "author": "Jonathan Mattson"}, {"rating": 5.0, "review": "When my last child moved out, so went the gaming consoles leaving me no way to watch Netflix or Prime video on my TV.  I had been looking at the Chrome Stick and Roku as a possible solutions when Amazon had it's offer for the Fire Stick.  I figured it's worth a try for $19.  I absolutely LOVE this item.  Set up was easy for this technologically challenged person and the updates, downloads, and syncing only took about 20 minutes. The streaming is excellent as is the sound quality.  My husband and I love that we were able to sync our YouTube playlists and watch our trail ride videos together on a big screen.  I am still exploring all the features and each day I fall more and more in love with this.  My husband and I are not big \"live\" TV watchers and if we can find a way to watch news I'm pretty certain cable is going to go - saving me $140 / month.  I'm still trying to figure out how to get the channel watching apps that down load and work on my Kindle onto my Fire Stick.  My only complaint is they need some instructions for techno-dummies like me without all the industry lingo in regards to the apps, etc...  Otherwise, this was probably the best $19 I ever spent.", "verified": true, "helpfulness": "11/12", "author": "A. M. Carr \"Ruminant\""}, {"rating": 5.0, "review": "This has to be one of the great bargains of the year.  I bought it because Amazon offered it at such a great pre-order price that I thought even if I did not use it I had not invested much.  It arrived yesterday and I thought about asking my son to come over and install it for me but decided to give it a try.  It was so easy I had it installed and connected to my network in no time.  I love the fact that I can pair my TV so that I can select youtube videos from my computer and then watch on the large screen TV.  Since I am a prime member I have lots of options to explore. Thanks Amazon for providing a simple, powerful and affordable product.  I also like the fact that I was able to download the Amazon Fire app to my phone so I could do voice search without buying anything else.", "verified": true, "helpfulness": "12/12", "author": "Kay Robbins"}, {"rating": 5.0, "review": "I wish I would have preordered 5 more of these when they were on sale. I love it.", "verified": true, "helpfulness": "1/1", "author": "rydog"}, {"rating": 1.0, "review": "I would love to review the Fire stick I ordered back on October 28th, but that's not possible. You see, despite the fact that I can walk into my local Best Buy and buy a truckload, Amazon decided to bump my delivery date to January 5th. JANUARY 5TH! Are you kidding me? Either have the product or don't. This pre-order/request an invitation crap is absurd. You want us to feel valued as Prime customers, yet you jack us around time and time again. I will be canceling the stick order and not renewing my Prime.", "verified": true, "helpfulness": "15/36", "author": "TsarChasm"}, {"rating": 4.0, "review": "Finally able to watch Amazon Prime videos on my Samsung LED TV that doesn't offer the Amazon App.  So far, the Fire TV stick seems to be responsive and providing you have decent Wi-Fi, you should enjoy this upgrade to your TV.  BTW, the Fire TV stick will detect that you are using an \"unsupported USB power source\" (i.e. not using the USB wall adapter that ships with the product), but it seems to work fine by being plugged into the TV itself (Samsung's USB port on the back of the TV)--no visible cables.I'm weary that companies (such as Amazon) can use devices like this to do more sinister things with our Internet connections and power \"behind the scenes\" of what the product \"appears\" to offer, so I'm glad that the TV turns off the USB port to the Fire TV stick when not in use.  This device is basically a computer that could be remotely hacked.  I really don't want to be providing Amazon unfettered access to my internal network 24x7, do you?  ;)", "verified": true, "helpfulness": "0/1", "author": "Matt B."}, {"rating": 5.0, "review": "Great device. Makes watching Amazon prime a breeze.", "verified": true, "helpfulness": "1/1", "author": "Joseph d"}, {"rating": 5.0, "review": "Only had it running for 2 days, but we love it. I'm not sure what all the complaints are for. There's bound to be a few bugs, as with any new device that hits the market, but I haven't encountered any with the Fire TV Stick.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! its blazing fast the interface! much better than any other tv smart interface! The quality in Netflix and Hulu are amazing too! get it! love it!", "verified": true, "helpfulness": "1/2", "author": "Pedro Acevedo"}]