[{"rating": 5.0, "review": "Enjoying the Fire tv stick.  So many different options", "verified": true, "helpfulness": "0/0", "author": "Holly DeMoss"}, {"rating": 5.0, "review": "Works like the Fire TV just without the voice searching", "verified": true, "helpfulness": "0/0", "author": "Larry Tierney"}, {"rating": 4.0, "review": "amazon fire stick was very easy to install and set up ! not only do I get to view amazon prime movies and tv shows , I also can listen to all my amazon music and view all my pics on amazon cloud ! not to mention all the additional tv and gaming apps too down load !", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Pro'sMuch faster than the chromecast.Having a remote is nice not having to use a phone or tabletAnynet support is the best being able to turn on tv and go to Prime video with one push of a buttonCon'sMore app developmentHave to use included power supply", "verified": true, "helpfulness": "0/0", "author": "eugene"}, {"rating": 1.0, "review": "I have a Roku box and a Roku stick. Both loaded in seconds & months later work w/o effort.  Amazon stick arrived 2 months after ordering, constantly froze & timed out on setup.  Amazon stick keep rejecting my password even though it was entered correctly multiple times.  3 days later it accepted my password, but froze again. 4 days later i still couldn't set parental controls. I tried watching a show to test it & it kept freezing, dropping off my network, etc. This never happened w/the Roku stick on that same TV w/the same ultra fast wifi connection.  I plan to return the Amazon stick & reconnect my Roku stick.", "verified": true, "helpfulness": "0/0", "author": "Sew Perfect"}, {"rating": 5.0, "review": "I thought this would be kind of redundant, as we have a smart tv already - but it is pretty awesome.  I bought it when it was a one day deal to prime members for $19.99 - because I figured why not?  It works well and has a million movie, tv and music options (if you have prime).  We are now getting a TV in the bedroom because we can definitely use this in lieu of cable in a second room.  Really great product - glad I purchased it", "verified": true, "helpfulness": "0/0", "author": "Val"}, {"rating": 5.0, "review": "Very fast! excellent product", "verified": true, "helpfulness": "0/0", "author": "Carlos Ovelar Rojas"}, {"rating": 4.0, "review": "Did everything i needed it to do", "verified": true, "helpfulness": "0/0", "author": "Hilbert Bihn"}, {"rating": 5.0, "review": "Great I love it, can travel to with me also.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"shake52561\""}, {"rating": 5.0, "review": "Best device out there for XBMC sideload. Way better than the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "W L"}]