[{"rating": 5.0, "review": "Even better than I expected.", "verified": true, "helpfulness": "0/0", "author": "W. Ross"}, {"rating": 5.0, "review": "Love the options with this item.  Perfect online streaming device", "verified": true, "helpfulness": "0/0", "author": "Dylan Fischer"}, {"rating": 5.0, "review": "We absolutely LOVE our Fire TV Stick!  I was able to purchase it for $19.99 during the intro time.  However, I am probably about to buy another one!  It's so easy to install and use.  You do not have to be a computer/techno genius.  Easy to move from room to room, if needed.  We personally use it for Netflix and Amazon Prime shows and movies.  I highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "JWolaver \"booksaremyzen\""}, {"rating": 5.0, "review": "This has been great for hotels! I use it with my hot-spot however, as most hotels have a landing page, but that will supposedly be added in a future update.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "works great...but does have a cord that plugs into stick.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "Works exceptionally! Just plug in and watch your Netflix,  hulu or showtime.  Can't wait for hbo to come out though!", "verified": true, "helpfulness": "0/0", "author": "Christina Wong"}, {"rating": 5.0, "review": "I love this thing!  So glad I bought it.  I was concerned at first that it wouldn't be fast, or that it would have issues (mainly because of the very reasonable price) but I was wrong-- no issues at all.  Very good picture, downloads quick.  I am glad I bought it.  Makes my Amazon Prime experience that much better!", "verified": true, "helpfulness": "0/0", "author": "Lisa J. Williams \"LisaJO\""}, {"rating": 5.0, "review": "Everything that I expected and more.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "levi stork"}, {"rating": 1.0, "review": "It won't work on our tv because we don't have HDMI CP.So we are returning it.  We weren't told that we needed that when we made the purchase.", "verified": true, "helpfulness": "0/1", "author": "Sharon Loitz"}, {"rating": 5.0, "review": "I am completely pleased with the Fire TV stick.  It was so easy to hook up, and begin watching Netflix and Prime.  I have only had it a few days, so I haven't completely explored all the possibilities.  My biggest concern was whether my husband would use it.  He has always watched Netflix through our Wii.  He usually resists change of any kind, but I thought it'd be nice if he could enjoy some of the movies on Prime.  He had no trouble navigating it.  I also really enjoy being able to listen to my Prime music with it.", "verified": true, "helpfulness": "0/0", "author": "Tracie A. Smith"}]