[{"rating": 5.0, "review": "5 star", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 4.0, "review": "Just do yourself a favor and buy this if you're on the fence. It works great. It's not expensive. The only drawback is that there is no Fire TV Stick app available for Windows Phone 8.1, which is disappointing. I'd love to be able to use my Windows Phone to type search terms in the Fire Stick apps.I also use a Roku on another TV. I kinda like the Roku remote better compared to the Fire TV Stick, and the Roku Windows Phone 8.1 app works even better than the remote. The Roku is more expensive, however.Toss a coin if you have to. Either way, you'll be happy.", "verified": true, "helpfulness": "0/0", "author": "DinoZuma"}, {"rating": 4.0, "review": "Very easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Vanessa L. VanStee \"sneezedoc\""}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "James Jacobsen"}, {"rating": 4.0, "review": "Just started using it and like it very much.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Works well.  The way it lists movies is not as intuitive as hoped.  I have to search online and add to my watch list so I can search easier on days when not really sure what I want to watch but like to surf through.Update:  it seems to be overheating.. obviously it has no ventilation for internal circuitry.  When it overheats, it stops or catches.  Still believe it is a good deal.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazing item.. took it out plugged it in and boom...it works awesome", "verified": true, "helpfulness": "0/0", "author": "Jeff Roose"}, {"rating": 5.0, "review": "Great!!!  Love it. Easy as pie to install.", "verified": true, "helpfulness": "0/0", "author": "John Escoto"}, {"rating": 3.0, "review": "Only compatible with the primary receiver.", "verified": true, "helpfulness": "0/0", "author": "La Tucumana"}, {"rating": 2.0, "review": "Stupid design.  The problem is that I wanted to be able to use it when traveling on the hotel televisions.The problem is, that it provides no interface to \"log in\" to a secured network that requires you to \"Accept TOS\".  YOu know, like when you log into a hotel's wifi, and the first web page you go to gets redirected to the TOS contract that you must click yes/accept on before it will let your device use the wi-fi.  Well, this does not let you do that.  Stupid!", "verified": true, "helpfulness": "0/0", "author": "Straight Shooter \"Big Daddy Chad\""}]