[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "JennaLeigh"}, {"rating": 2.0, "review": "When I first bought the Amazon Fire TV stick it worked great but it's been a few months now and it seems to be having more and more issues. The menu takes forever to load up and Hulu plus won't even start up sometimes. If it does, it freezes and lags. I've checked my internet connection and it seems fine, I don't know if it's an Amazon update issue or the Fire stick only lasts a few months before it dies.", "verified": true, "helpfulness": "0/0", "author": "Megatron"}, {"rating": 1.0, "review": "Constantly buffers even though it is right next to the routerEvery series I want to watch cost $3+ per episodeBought it primarily to stream from my pc. But this requires Amazon prime membership anda long process of uploading to their cloud followed by still unable to watch my videos", "verified": true, "helpfulness": "0/2", "author": "kenneth willm"}, {"rating": 5.0, "review": "Love this product!  Ditch cable and use this instead!  Sling TV is also a great addition!", "verified": true, "helpfulness": "0/0", "author": "Tamara S."}, {"rating": 5.0, "review": "Easy to install. Great product.", "verified": true, "helpfulness": "0/0", "author": "CEP"}, {"rating": 2.0, "review": "I bought this for my disabled wife so she could watch movies on Prime/Netflix in her bedroom where she is at %99 of the time and not by choice. I read up on all devices like this that do pretty much the same thing and chose the Fire Stick due to my then high respect of Amazon products. I have it hooked up using only the provided cables/plug etc. but 99 out of 100 times when she tries to start a movie it gives her the blue screen that more less states your setup does not pass the copy protect system check and she is unable to watch anything she has to wait until I can assist her by ower cycling everything which again this was bought for a disabled person. My question is will there be any kind of patch or update to fix this? if not bad as I hate to I will have to trash it and by a different streaming device. Any info or suggestions greatly appreciated", "verified": true, "helpfulness": "0/0", "author": "Mindy Ford"}, {"rating": 4.0, "review": "I like it, but I wish u would have less pay for view. Wish u would post how much prime is.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "How to connect to you tube?Any advice?", "verified": true, "helpfulness": "0/0", "author": "sebastiao temponi leite"}, {"rating": 1.0, "review": "Wont keep a connection with the wifi.  Other devices in the same area connect to the wifi fine.  If I hold the end of the stick and can get it to work a little but not for long.  The control panel reads that it is receiving a strong signal.", "verified": true, "helpfulness": "0/0", "author": "Chad Gebhardt"}, {"rating": 4.0, "review": "give me a portal to everything in the entire world and put a price on it (or make it \"prime\" free if you want, i don't really care if its free or if it costs as long as it is at my fingertips). I will then give you 5 stars. until then...i choose to be a voice of encouragement in the journey to achieve greater heights. your content is limited. do better.", "verified": true, "helpfulness": "0/1", "author": "Steven"}]