[{"rating": 4.0, "review": "I really like the Amazon Fire TV Stick. It arrived on time, was simple to set up, and has a great selection of apps. The only thing that I did not like was not being able to active it on the HBO GO app. This because I have Comcast/Xfinity as my cable provider, whom I am extremely disappointed in every month, and the lack of agreement between them and Amazon for activation of the Fire stick for the HBO GO app. I wish that would've know this ahead of time. I didn't see anything about that when researching the Fire stick, and thought it would work, since the app allowed my Kindle Fire HD the be activated for the same app.Still a very good product,  and I would highly recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "Scott K. Halfacre \"Scuba Scott\""}, {"rating": 4.0, "review": "Awesome! Hulu and Netflix apps both skip, though.", "verified": true, "helpfulness": "0/0", "author": "Tasha"}, {"rating": 5.0, "review": "I am not very good with audio visual stuff but the Fire Stick was easy to set up.  It connects much faster than my Blu-ray in another room.  It replaced another blu-ray that just wouldn't connect well in my bedroom.  It connects to wi-fi quickly, loads Netflix and Prime quickly which are the two I use, and is a lot less visable than the blu-ray box I had.The remote is easy to use.  It doesn't have a lot of confusing buttons for me.  I have some arthritis in my hands and it is easy to navigate with it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Mary\""}, {"rating": 5.0, "review": "I love it!!! So versatile. If you don't get one your crazy.", "verified": true, "helpfulness": "0/0", "author": "Efrain Garzaro Jr"}, {"rating": 5.0, "review": "i LOVE my fire stick! beware though...if you work at home like i do...you will watch FAR too much tv and not do as much work. not for the undisciplined folks such as myself...lol. but i really do love this", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"fezgirl\""}, {"rating": 5.0, "review": "my son loves it", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 4.0, "review": "Works ok", "verified": true, "helpfulness": "0/0", "author": "Michael Spruill"}, {"rating": 5.0, "review": "Great experience overall. Sometimes it cuts out or freezes but that is on the slingtv app so I'm not entirely convinced it's the firestick.", "verified": true, "helpfulness": "0/0", "author": "Damon Goodson"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "A. Roberts"}, {"rating": 5.0, "review": "Easy to install, easy to use.  What an investment!  Buy one!!", "verified": true, "helpfulness": "0/0", "author": "Kevin Hitchcock"}]