[{"rating": 5.0, "review": "Works great and I am going to buy another one.", "verified": true, "helpfulness": "0/0", "author": "Virgil Ross"}, {"rating": 5.0, "review": "Over the last year or two I've tried a couple other WiFi/HDMI interfaces for my TV, and this one simply works. The other two weren't functional enough to bother with. The more recent was a Chrome stick, and that was better than the first (brand escapes me right now) but didn't meet my needs for transparency and ease of use. I think Amazon has hit on the right combination of functionality and provider relationships. The Fire TV Stick was impressively easy to set up. The Netflix and Hulu+ set-ups were obvious and easy. And of course the stick came with my Amazon Prime account pre-loaded. I'm enjoying the use of this tool, and considering dropping some of the premium services I have on my [cable] account.", "verified": true, "helpfulness": "0/0", "author": "Frank Paynter"}, {"rating": 4.0, "review": "The only disappointment so far is the large power supply.", "verified": true, "helpfulness": "0/0", "author": "Brad Kueter"}, {"rating": 3.0, "review": "Wasn't expecting to have to buy Net Flix after 30 day trial.  Also being a prime subscriber, You have to pay for some of the movies.", "verified": true, "helpfulness": "0/0", "author": "Laura Gayle"}, {"rating": 5.0, "review": "This is awesome", "verified": true, "helpfulness": "0/0", "author": "Brooke"}, {"rating": 5.0, "review": "The stick works well. I have some trouble connecting with my IPhone 6 to use a remote.  Otherwise installation was very easy.", "verified": true, "helpfulness": "0/0", "author": "Ronald Collett"}, {"rating": 5.0, "review": "Works flawlessly and provides a great experience for myself and my father who uses it just as much as I do!", "verified": true, "helpfulness": "0/0", "author": "Cody M"}, {"rating": 5.0, "review": "Great product. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "kerri flanagan"}, {"rating": 5.0, "review": "BOOM... FireTV is the real deal.  Calling all cord cutters...", "verified": true, "helpfulness": "0/0", "author": "Iman S Watson"}, {"rating": 5.0, "review": "Setup took about 10 minutes, then accessed hulu and netflix a short time later.  I got the remote without voice recognition because I have the Fire Tv box with the remote and it rarely understands me.  So, with all things considered and not utilizing any other product to compare it, I am very pleased with my purchase and definitely recommend Fire TV (box or stick).", "verified": true, "helpfulness": "0/0", "author": "LJLJ"}]