[{"rating": 5.0, "review": "Best investment we could have ever made!!! I am so glad to not be tied to the cable box anymore. I love that you add Netflix or Hulu for the ultimate in commercial free viewing. If you are thinking of walking away from the cable company.... DO IT!! You won't regret it!", "verified": true, "helpfulness": "0/0", "author": "Donovan & Sarah Wisehart"}, {"rating": 1.0, "review": "I feel totally duped by this product. I needed a vehicle for mobile HBO viewing (not my Kindle Fire), and, as a Prime member, decided to try a Fire stick. Amazon has been bragging about the HBOGo app so this should have been a no-brainer. Wrong. Silly I am to assume that since I can watch HBOGo on my Kindle, I could watch it on Fire TV. Much to my chagrin Comcast, one of the largest cable providers in the country, is woefully missing from the list of providers. I really don't understand how this omission can ever occur when there seems to be deals already in place. Oh well, shame on me for not completely researching before buying.", "verified": true, "helpfulness": "1/1", "author": "Glenn Chase"}, {"rating": 5.0, "review": "Great invention!  The only drawback is the amount of data that I use whenever I use the Fire Stick to watch Hulu and Netflix.", "verified": true, "helpfulness": "0/0", "author": "R. Dickens \"tv fanatic\""}, {"rating": 5.0, "review": "love the stick!  easy  setup.  works great", "verified": true, "helpfulness": "0/0", "author": "annie"}, {"rating": 4.0, "review": "Easy installation. Works great", "verified": true, "helpfulness": "0/0", "author": "Gabriel"}, {"rating": 1.0, "review": "Save your money. The antenna is so feeble I can't keep a connection to save my life. I spend more time rebooting the stick than I do watching anything with it.", "verified": true, "helpfulness": "0/0", "author": "L. Hamilton \"wyld4books\""}, {"rating": 3.0, "review": "The only problem I had with the Fire TV Stick was that I was unable to stream from Acorn TV.  It worked fine on Netflix and Amazon, however, I really enjoy Acorn TV and ended up exchanging my Fire Stick for a Roku device.", "verified": true, "helpfulness": "0/0", "author": "laruth"}, {"rating": 5.0, "review": "Made my smart tv smarter, worth the money if you have Prime. Disappointed with the game controler cost.", "verified": true, "helpfulness": "0/0", "author": "Anthony Drzewiecki"}, {"rating": 5.0, "review": "I love this! The movie streaming is great especially with amazon prime and the games are pretty good! I wish there was more integration with the fire stick remote and more apps would be nice but overall a great experience!", "verified": true, "helpfulness": "0/0", "author": "shamsham77"}, {"rating": 5.0, "review": "What a difference New tech makes! I had been streaming on a roku 2 that I've had for 4 years. I decided to try out the fire stick when Sling TV offered it free with 3 months of prepaid service. The picture clarity is amazing, videos load almost immediately and I love that it's practically cordless (still has a power cord, but no nerd for component cables like my old roku).The remote is really responsive, but I'm not a major fan of the button placement. It took me neatly a week to stop mistaking the home button for the play button. Minor problem in the long run. For less than 40 bucks. I can stream from my kindle, play spotify, and watch live tv. If only comcast infinity would approve hbogo on the Fire Stick, I'd completely throw out my roku (comcast users, Showtime anytime and HBOgo are not allowed yet on the fire stick - also there's no Starz app or FX app like on the roku). But again, for 40 bucks, I can't really complain.", "verified": true, "helpfulness": "0/0", "author": "Nikki Jay"}]