[{"rating": 5.0, "review": "This is an excellent device.  I have the larger Amazon TV unit and this one works the same.  I am quite happy with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the fire stick. Its snappy and just works. If your Amazon Prime, its even better. Prime instant, prime music and cloud photos are great. Its easy to install as long as you have an ac outlet behind your tv or a free usb port to power the stick. The remote works very well. There is also an app for tablet or phone that will allow you to use an on screen keyboard or voice search. That is a huge plus. I got it for half off when it was first released and wish I would have got a couple more.", "verified": true, "helpfulness": "0/0", "author": "James Mccarty \"expose\""}, {"rating": 4.0, "review": "Having owned the better of all streaming sticks on the market.. this clearly is the best performer.  My biggest complaint is the interface, which needs a major overhaul.  Amazon content is difficult to manage and 3rd party apps are worse.  But all in all I am pleased with this product and look forward to the day when interface gets a redesign.", "verified": true, "helpfulness": "0/0", "author": "Chris Marsh"}, {"rating": 4.0, "review": "Works well for me. It's small and easy to setup and move to different locations. I like the remote too - especially compared to using my Wii system and remote. My opinion may be a little biased though since I pre-ordered it for half price :-)", "verified": true, "helpfulness": "0/0", "author": "MyPick"}, {"rating": 4.0, "review": "Great device. I hooked mine into my receiver and made a custom configuration on my Harmony remote. It's always on but draws little power. Prime streaming is better than my Sony Blu-Ray.", "verified": true, "helpfulness": "0/0", "author": "Joey Stanford"}, {"rating": 5.0, "review": "Works perfectly", "verified": true, "helpfulness": "0/0", "author": "Alendor E. Vulaj"}, {"rating": 5.0, "review": "Wonderful!", "verified": true, "helpfulness": "0/0", "author": "silly"}, {"rating": 4.0, "review": "Great to watch movies with", "verified": true, "helpfulness": "0/0", "author": "John Turner"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "N. Allbert"}, {"rating": 5.0, "review": "very easy to use  works better than I anticipated", "verified": true, "helpfulness": "0/0", "author": "Wilma Harris"}]