[{"rating": 4.0, "review": "I have Fire TV (FTV) and Fire TV Stick. The Stick is just not as smooth or refined as its big brother. I am using the Stick on the same TV that I used to use the FTV (it was moved to another TV). I am comparing the Stick to the FTV when they were set up at the same location. So, WiFi distance/strength is not a factor in this comparison. Internet connection is 20Mbps, and WiFi is from a new Apple Extreme 15 feet away with no obstructions.Remote - The remote that comes with the Fire Stick feels cheap compared to the one that comes with Fire TV. The Stick version works well, but the hard plastic is not as nice as the soft-touch finish on the remote the comes with FTV. The voice function on the FTV remote is nice, but unless you are doing a lot of searches, it alone is not worth the price difference.Skip Feature - The operating system on both let you jump ahead or backwards by 10 seconds (per push on the remote). On the FTV, it is smooth and fast. On the Stick, it is glitchy and acts like it is trying to buffer. Sometimes the pause is longer than the 10 seconds you are actually skipping forward (or back).Buffering - The Stick has noticeable buffering issues. It takes longer to start a video, and occasionally it pauses to buffer during a video. Not that often, but it happens. The FTV is faster and never stopped to buffer during a video.ProsThe Stick is smaller than FTV, which makes it easier to take it with you.Price - A lot cheaper than FTVConsNots as refinedGlitchy search/skipBuffers(External power - more of a general gripe than a con)Bottom line - if you are looking for something that you set up once, and leave it alone, get the Fire TV instead. It is a better streaming device, comes with voice command remote, and has better sound output capabilities. If you are looking for something to move around the house, take with you, or just want the convenience of another streaming device, the Stick is a good choice. If you can get it on special for $19, it is a no-brainer.", "verified": true, "helpfulness": "1/1", "author": "M.M."}, {"rating": 5.0, "review": "I love it! Amazon did an amazing job!", "verified": true, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 5.0, "review": "Le pondria una sexta estrella", "verified": true, "helpfulness": "0/0", "author": "Pierre Costa Rica"}, {"rating": 4.0, "review": "Love the stick!  They said easy set up and it was.  Have used upstairs and in the basement and works great, just change the input.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 5.0, "review": "I absolutely love this fire stick !!!!! And someone like me (;) ), could even hook it up !! :)", "verified": true, "helpfulness": "0/0", "author": "Sarah Whittum \"pips mom\""}, {"rating": 4.0, "review": "Wow!  it is awesome and easy enough to use that I actually did it all by myself.", "verified": true, "helpfulness": "0/0", "author": "gail mattson"}, {"rating": 5.0, "review": "It's a great little toy to play with.... Although Comcast isn't on the list of TV subscribers so you can not get every show. Overall well worth the money !!!", "verified": true, "helpfulness": "0/0", "author": "Andrew Cautilli"}, {"rating": 5.0, "review": "Works absolutely perfect!", "verified": true, "helpfulness": "0/0", "author": "Kuuipo K"}, {"rating": 5.0, "review": "Easy to set up and easy to use", "verified": true, "helpfulness": "0/0", "author": "GF"}, {"rating": 4.0, "review": "The fire stick met my expectations and I am enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]