[{"rating": 5.0, "review": "I like the fire tv stick as i can now use the mirror function and get more use of the Prime movies", "verified": true, "helpfulness": "0/0", "author": "M. Arcy"}, {"rating": 5.0, "review": "Awesome device! Very easy to install and use.", "verified": true, "helpfulness": "0/1", "author": "V"}, {"rating": 5.0, "review": "Really like the Fire TV stick. Exceptionally easy to set up and use and the quality of the video is excellent. Makes it easy to get to the right content - also can use apps on your phone to control it - all-in-all a well thought-out design. Programs available on Amazon Prime just keep growing and getting better. A great benefit when combined with Prime shipping, feels like a plus-up!", "verified": true, "helpfulness": "0/0", "author": "C. Norris \"afishionado\""}, {"rating": 5.0, "review": "I love this product!! Super easy set-up,very user friendly! You can download Netflix and Hulu and stream all your favorite shows. Also a lot of great shows to choose from if you have Amazon Prime. I don't have cable so this is a great low-cost way for me to enjoy great T.V. with many more options!!!", "verified": true, "helpfulness": "0/0", "author": "clemsongirl"}, {"rating": 5.0, "review": "Easy to set up, perfect for bedroom TVs, as we purchased it for.", "verified": true, "helpfulness": "0/1", "author": "Lisa M. Wolfe \"LisaMarie\""}, {"rating": 4.0, "review": "Works very well but I have experienced some glitches. Remote suddenly will go into a scroll mode and go through multiple pages. Some slow response issues.", "verified": true, "helpfulness": "0/0", "author": "Gregg \"westernwizzard\""}, {"rating": 3.0, "review": "It has potential.  I like the simplicity to it. It does however lose my wifi connection on a regular basis despite my many Apple TVs not losing it.  Video quality is often not quite as good as my Apple TVs too.", "verified": true, "helpfulness": "0/0", "author": "BRANDON"}, {"rating": 5.0, "review": "I've had my Fire Stick (2 of them, actually) for more than 2 weeks now. I'm totally please by this device. It functions so quickly. The remote is small and simple to use. Many Apps are available for both common streaming services as well as unexpected ones. I especially enjoy the PBS app. And Amazon Prime Music is awesome via the Fire Stick. If you have wondered if this is worth its small cost, wonder no more. It's absolutely worth it. Try it!  I've had a Chromecast for nearly a year, but the Fire Stick blows it away.", "verified": true, "helpfulness": "0/0", "author": "2 Alarm Guy"}, {"rating": 5.0, "review": "Love it...and so do the kids.  Well worth the price!", "verified": true, "helpfulness": "0/1", "author": "Karen Connor"}, {"rating": 2.0, "review": "I like the features and the interaction the stick has but it does not play movies as well as the Google Chromecast. I have owned the Chromecast since it first came out and it does great even on a slow internet connection. So since I'm a prime member I would get the stick and it would be twice what I can do with the Chromecast. But on,The Fire stick is choppy and there is no way to adjust the settings so you can use it on slow internet connections . It's a shame, they say they have so much more Technology than chrome on the side by side comparison but when it comes down to frustration free entertainment they are losing the battle. I travel for a living and I like watching what I want when I get to my destination. I really wanted to like the Fire Stick and does great at very high speed connections . Unfortunately not every place has that option. I have only ran into a few spot the Chromecast failed but the Fire stick fails 3 times as much. If your going to use the Fire Stick and you have a good internet speed your going to love it. But if you have slower internet connection it will only frustrate you.", "verified": true, "helpfulness": "0/1", "author": "J. W V."}]