[{"rating": 5.0, "review": "I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Jazmine"}, {"rating": 5.0, "review": "Love it! I also love the app that turns my Samsung galaxy into a remote for the fire stick!", "verified": true, "helpfulness": "0/0", "author": "MelissaM"}, {"rating": 3.0, "review": "Biggest complait is you have to have it plugged into the wall at all times Inorder to use it. I feel like they mis advertised because the commercials make it look like all you have to do is plug it into the TV. The content of Amazon fire stick is great! We love the streaming and hundreds of apps to download", "verified": true, "helpfulness": "0/0", "author": "Ren Wakefield"}, {"rating": 2.0, "review": "It's fine...I feel like the navigation process is a little more work than a Roku or Apple TV as you have to click back multiple times to even causally scroll through all the options. Also you can't determine what is free or costs money until you click on the actual show/movie  you want to watch--it becomes quite tedious to go backwards rather than enjoying the show you thought you could watch with your Prime account.", "verified": true, "helpfulness": "0/0", "author": "Breana"}, {"rating": 5.0, "review": "Fire stick was received and with supplied instructions.  It was installed and running within 3 minutes.  It functions as expected with DSL speed.  I am very pleased.", "verified": true, "helpfulness": "0/0", "author": "Ed Tibesar"}, {"rating": 5.0, "review": "Love this gadget!! We needed a little help with our TV, but once we got that straightened out, this has been a wonderful way to view Netflix and Prime movies/shows. Highly recommend!!", "verified": true, "helpfulness": "0/0", "author": "Lucille Harrington"}, {"rating": 5.0, "review": "So easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Sports Mom"}, {"rating": 5.0, "review": "It worked flawlessly after plugging into an available HDMI port on my Sony TV. Setup was easy and after a couple of minutes I was able to see my Amazon Prime videos from my watch list. It's a great product.", "verified": true, "helpfulness": "0/0", "author": "TMA"}, {"rating": 5.0, "review": "So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Lynn Giles"}, {"rating": 4.0, "review": "Love it...easy to use", "verified": true, "helpfulness": "0/0", "author": "Nancy L. Pavelec"}]