[{"rating": 4.0, "review": "love the idea of not having to have and pay for cable tv or satellite but Prime is not organized very well and choices for news are slim. movies are not too great either. Unless you want to pay additional charges. In the long run then your better off just paying for cable tv. maybe Amizon will get better at it as time goes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a great device for our tv with no cable hookup. Very easy to install and easy to use. I highly recommend this, especially for people who have Netflix and Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "discolemonade"}, {"rating": 5.0, "review": "Great - easy to set up and perfect gift!", "verified": true, "helpfulness": "0/0", "author": "MH"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Timothy W. Coughlin"}, {"rating": 5.0, "review": "Great product but wish it came with the voice remote.", "verified": true, "helpfulness": "0/0", "author": "Siam T"}, {"rating": 3.0, "review": "I use Roku in the past but after my device dies over a year ago, I decided to give this a try since at pre-introduction rate (very cheap). However I notice even through the performance speed is okay, it doesn't have all the apps that roku seems to have. I love my kdrama and fire stick doesn't support Drama Fever and a few more apps I've came to love.  :(  I've had this almost a year now and have decided to go back to Roku. Fire Stick isn't that bad though, you can side load android aps (only a few will work right), the miracast isn't bad but it does get sluggish a lot. And I guess the best part would be fire stick is centralized around your amazon prime account so you can pull your videos and music up fairly quickly. The overall interface of fire stick leaves something to be desired though.", "verified": true, "helpfulness": "1/1", "author": "N. R. Williams \"Bashful Bibliophile\""}, {"rating": 5.0, "review": "We absolutely love this thing. So much so that we bought a second one for another room. The new iPhone remote app is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Thor"}, {"rating": 3.0, "review": "i enjoy chromecast more, but so far so good", "verified": true, "helpfulness": "0/0", "author": "brent burk"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Vic"}, {"rating": 4.0, "review": "arrived in record time . hooked it up in 5 minutes. however it has options for programming that are not free only a free trial period.. after a month they you are charged a monthly fee for many of its offers.. it does stream clear pictures and a variety of things to..not sure it was worth the cost knowing you still have to pay for features. thinking i have Prime would allow lots more features to be free. not the case. just saying it was easy to install but now knowing it will cost me more down the road might be a negative for me..thanks", "verified": true, "helpfulness": "1/1", "author": "Linda Kornilieff"}]