[{"rating": 5.0, "review": "Just like Apple TV bought it for my daughters room and we like it", "verified": true, "helpfulness": "0/0", "author": "jessica cranford"}, {"rating": 5.0, "review": "Love it!  I especially like the original programming, i.e.,  Bosch!", "verified": true, "helpfulness": "0/0", "author": "Sutton"}, {"rating": 1.0, "review": "Doesn't seem to work very well.  The video is choppy and about once a day it freezes and takes about 30 seconds to register each remote button push.  I have to shut down the whole TV/video/stereo system for a few seconds and reboot.  There is a \"reset\" button under system tools which works if you can get to it, but when the system is frozen you have no choice but to cut the power and start all over again.", "verified": true, "helpfulness": "0/0", "author": "J. Caruso"}, {"rating": 1.0, "review": "This is NOT a streaming type device like Roku so don't expect that you can access and download any apps.  It's fine if you have an older tv that doesn't stream anything but you will ONLY get the FIXED apps provided by Amazon. If you don't have prime membership then you'll have to pay some sort of subscription for movies/tv shows etc. And no, it does not have Vudu.", "verified": true, "helpfulness": "0/0", "author": "Rebecca M."}, {"rating": 4.0, "review": "Good and makes for lots of fun watching. The only thing I would recommend is make sure your internet is fast as I have the best that we can get in this area and it can not handle it sometimes at peak volume hours.", "verified": true, "helpfulness": "1/1", "author": "Jim Dandy"}, {"rating": 5.0, "review": "just what i was looking for sooo happy :)", "verified": true, "helpfulness": "0/0", "author": "jade carbonell"}, {"rating": 5.0, "review": "its just what i needed & more.", "verified": true, "helpfulness": "0/0", "author": "andy"}, {"rating": 5.0, "review": "So great, I bought four Fire TV boxes (two for me and one for a daughter).  We have one in our RV and one at home.  It is the perfect RV companion because we don't have to worry about the local channel line up or our finicky BluRay player on the road.  The best feature is the voice search - unbelievably accurate and fast.", "verified": true, "helpfulness": "0/0", "author": "Pacaurora"}, {"rating": 5.0, "review": "The best!!!!! love this little guy!", "verified": true, "helpfulness": "0/0", "author": "Sparks \"Dasha Aussies\""}, {"rating": 1.0, "review": "Very slow and buggy. We had to restart it often. The Fire TV box is much better.  Try to wait till it's on sale if you can.", "verified": true, "helpfulness": "0/0", "author": "CC"}]