[{"rating": 5.0, "review": "A friend who installs high-end home theatre systems/security systems and home automation systems kept telling me about the Fire TV Stickand how great it is,  especially since my wife and I are Amazon Prime members.Well, we finally caved and bought one.I can't say enough good things about it !!!Easy to install and set-up,  high quality components,  and even though there is no voice feature,  the remote works perfectly, is very intuitiveand simple to use. (The cartoon guy during set up was a nice touch Amazon programmers)Our WiFi base is upstairs and at the far end of the house and the Fire TV reception is \"almost\" flawless.during a one hour episode of \"Game of Thrones\" the system had a two second freeze up,  and that was it.so that's not even worth reporting, but anyone who uses this kind of tech should be realistic and realize that NOTHING is perfect.This device is not for everyone, but I have to give it my highest praise and recommend Fire TV Stick to anyone interested.", "verified": false, "helpfulness": "0/0", "author": "Jason H"}, {"rating": 5.0, "review": "Fast shipping, problem free setup, great product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I wish I could figure out how to get Pandora and Vudu on the Fire Stick.Other than that I like it a lot.", "verified": true, "helpfulness": "0/0", "author": "Ginger Jackson"}, {"rating": 5.0, "review": "I have Fire TV,  Fire TV stick and Google Chromecast. As far as general usage, streaming content and less power hungry games  the Fire TV stick feels and operates just as fast and fluid as the quad core equipped  Fire TV box. If you are not into processor and GPU specs, just know the Fire TV stick has plenty of processing power, graphics power and dual band WIFI to do pretty much anything you will want to use it for, especially streaming content. Very easy to set up and if you have a Prime Account and / or Netflix account, this product at this price point is a no brainier. The Fire TV remote app for Android and iOS has voice search and works very well. If you considering Chromecast versus Fire TV stick, I can say that our Chromecast hasn't been used once since we ordered the Fire TV box and Fire TV stick. The current version of Chromecast simply can't compete with the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Ronnie in Texas \"Ronny\""}, {"rating": 2.0, "review": "I love the idea of having an easy way to stream Amazon Prime to my TV but when I first installed the Firestick I had streaming issues in Hulu only. I was advised to uninstall and re install Hulu. That worked a little better but I have since cancelled Hulu because I had Netflix. Then I started having streaming problems in Netflix so I reinstalled Netflix but this only helped minimally. I'm going to switch back to the Chromecast that I have on another TV.", "verified": true, "helpfulness": "0/0", "author": "Diamondbrite"}, {"rating": 5.0, "review": "WE HAVE HAD FIRE FOR 1 WEEK LOVE EVERYTHING ABOUT IT. WOULD LIKE TO SEE ADULT MOVIES ALSO INCLUDED.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Needs a lot of work. My feeling is that the hardware is pretty solid, but the software is not very good. Amazon video services work pretty well, but I continuously get video playback errors with the Hulu and Netflix apps. My PS3 and Roku Streaming Stick work fine even when the Fire TV Stick (FTS) isn't, which tells me that the FTS is the issue. The FTS seems a little less responsive than you would like. It feels like it isn't very good at freeing up memory when you leave apps. I would pass on this device for now.", "verified": true, "helpfulness": "0/0", "author": "Michael Jensen"}, {"rating": 5.0, "review": "Great replacement for cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I never tried a streaming stick before and I did not know what to expect but I did expect more, at the same time I am happy with it and would recommend this product. The included remote is nice and sleek, that's a plus.", "verified": true, "helpfulness": "0/1", "author": "leo"}, {"rating": 5.0, "review": "Looking forward to using. So far it meets my expectations.", "verified": true, "helpfulness": "0/0", "author": "Thomas Conroy"}]