[{"rating": 5.0, "review": "Awesome streaming device I got 2 I'm very happy with them", "verified": true, "helpfulness": "0/0", "author": "sergio Henriquez"}, {"rating": 4.0, "review": "Functionality is great so far.  Very easy to set up and use.  Not happy about the need for the power strip plug-in connected to the stick...was hoping it could run off the power of the TV.  Now I need to find a long extender cord so I can run, yet another, cable behind my wall to hide, yet another, wire.", "verified": true, "helpfulness": "0/0", "author": "Adam Kloza"}, {"rating": 1.0, "review": "Kept buffering and would not relay wifi signal from an upstairs room. Changed to AppleTV box and it works perfectly. Maybe Amazon TV box would have worked properly.", "verified": true, "helpfulness": "0/0", "author": "Leslie Davis"}, {"rating": 3.0, "review": "Works well. I wish I could edit my music playlists on here, but only allows me to listen to playlists/music I added online. Additionally,  wish the iphone app would be released. using the remote is fairly annoying, just another remote to have laying around.Overall, the only benefit over my chromecast (which I love) is that it allows me to stream my prime tv shows. it does get misleading which are free/not though. Still a better fan of netflix.", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "Great product faster loading than my sons roku stick easy to use!Glad I purchased it!", "verified": true, "helpfulness": "0/0", "author": "JLK \"JLK\""}, {"rating": 5.0, "review": "WORKS GREAT. I MUST IF YOU HAVE UNLIMITED INTERNET AND AMAZON PRIME.", "verified": true, "helpfulness": "0/0", "author": "Samantha Brewer"}, {"rating": 3.0, "review": "When it works it is great, but the wireless drops off a lot and you have to start over.  All other devices have not problem staying online.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "it's working as far as for using netflix, amazon videos but I like to be able to stream from my laptop to the TV screen .will check out the google chromecast to see if it can do this.", "verified": false, "helpfulness": "0/1", "author": "Kim"}, {"rating": 4.0, "review": "Only had for a few days, but very pleased so far.  Set up was relatively easy, and the software is easy to use and responsive.  Wish it had more apps, and an iOS remote.", "verified": true, "helpfulness": "0/0", "author": "Dale Collingwood"}, {"rating": 3.0, "review": "Pretty good except you cant cast to it from anything but a fire phone :(Still have to use my chrome cast for that", "verified": true, "helpfulness": "0/0", "author": "Shrubby"}]