[{"rating": 1.0, "review": "Terrible.  Don't get it.  Failed after a month and I spent 2 hrs trying to get it fixed over the phone.  Now they sent me a new one.  Yayyyyyyy.", "verified": true, "helpfulness": "0/0", "author": "Izzi Moonshine \"book fiend\""}, {"rating": 2.0, "review": "The reason I am giving this 2 stars is at first this was great. Ran off of wifi was able to watch amazon prime and Netflix in my room. But then it gets very choppy and lags all the time now. i don't know if it is a memory issue or what. It is kinda disappointing especially since  I have the fire box and have no issues with it.", "verified": true, "helpfulness": "0/0", "author": "david racioppa"}, {"rating": 1.0, "review": "Totally worthless piece of electronics. No bandwidth, terrible picture, constantly buffering., no apps other than Amazon and Netflix, but Netflix will not load.Thought it was a problem with my wireless. But now have moved and have entirely new wireless network and it still will not stream anything without constantly buffering. Even directly next to my wireless router.Only app that works even halfway decent is Amazon Prime Video. Nothing else will load.Replacing this with a Roku device.", "verified": true, "helpfulness": "0/0", "author": "nbaker75"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "\"lucrecker\""}, {"rating": 2.0, "review": "the ad makes it easy to use, however i found it somewhat difficult. it seems to be an ad for amazon prime because for a lot of the options  you have to sign up for prime. also, i tried to set up history and hbo and i needed to have a tv provider, that is why i got the fire stick because i cut the cord. my girlfriend wanted the fire stick so we got it and will use it when we can but it is not going to be the go to item i thought it was going to be. i wold not recommend.", "verified": true, "helpfulness": "0/0", "author": "john weate"}, {"rating": 5.0, "review": "everything you need in a small package", "verified": true, "helpfulness": "0/0", "author": "Roy Steven Owens"}, {"rating": 5.0, "review": "The Fire TV Stick is just what I need.  I can finally get rid of cable.  I love the Fire TV Stick I can watch what I want to watch anytime of the day.", "verified": true, "helpfulness": "0/0", "author": "Wanda"}, {"rating": 4.0, "review": "yes, its great but there is not many free movies to watch. i dont have 100.00 to buy prime so i just watch what ever they have to offer to watch.they should have plans that customer can choose from then i will have more movies to watch.", "verified": true, "helpfulness": "0/0", "author": "steven sanders"}, {"rating": 1.0, "review": "Did not connect to wifi. Modem was 5ft away. My Chromecast had no problem connecting. Returned the fire stick  I'm now getting the roku instead.", "verified": true, "helpfulness": "0/0", "author": "Kerry Venuti"}, {"rating": 5.0, "review": "As an Apple fan, I have to say that I am loving this Fire TV Stick as a streaming box.After installing Kodi, it is just perfect. No more AppleTV for me...Great price and fast. I just wish the remote had the voice control as the normal Fire TV.", "verified": true, "helpfulness": "0/0", "author": "JM"}]