[{"rating": 5.0, "review": "I was getting very frustrated with Google Chromecast in that it would work reliably on only one TV in my home. There is a maximum distance restriction of around 20 feet from your internet router with Google Chromecast:-((. I received my Fire TV Stick yesterday. It took only minutes to install. It also works great with dual band routers, which Chromecast will not. I am happy to report that I can now watch Netflix on my living room TV with the smoothest streaming video ever! The remote is a big plus, too. This device is a keeper!", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "This has been a great money saver.  The installation was very easy and the content is great for the whole family.  Definitely buying another one for my son's room.", "verified": true, "helpfulness": "0/0", "author": "Classy1too"}, {"rating": 3.0, "review": "At the beginning the fire stick worked really good. After a week it started getting hot, what ever we were watching will stop more than five times.  That was really frustrating. I have to disconect and conected back again; but not all the time work.  It's getting to run too slow now.", "verified": true, "helpfulness": "0/0", "author": "claudia godinez"}, {"rating": 4.0, "review": "Works great noproblems and shipping was fast!!", "verified": true, "helpfulness": "0/0", "author": "thomas hernandez"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick exceeded my expectations with the quality, performance and clarity of the pictures and programs it received.  This product is worth the cost and a great replacement for cable TV.  I wish I had subscribe to the Fire TV years ago which would have saved thousands of dollars.  I would recommend this product for anyone because of its value.", "verified": true, "helpfulness": "0/0", "author": "Sammie Quillin"}, {"rating": 3.0, "review": "It kept dropping off my network, sometimes would link sometimes wouldn't.  I also have chromecast that one seems to hold connection better.  That's why I gave it 3 stars-but when it did work was awesome.", "verified": true, "helpfulness": "0/0", "author": "Pete V."}, {"rating": 5.0, "review": "Great! It works very well.", "verified": true, "helpfulness": "0/0", "author": "Rick Ferro"}, {"rating": 5.0, "review": "This thing is awesome.  We have three now, I give them as gifts to family.  If you're willing to share your password to Netflix or Hulu, your family can watch from their houses. There is a remote app for iPhone and iPad in case you lose the remote that comes with it.  Great for turning a regular TV into a smart tv.  If you already have a smart tv, you won't need this.", "verified": true, "helpfulness": "0/0", "author": "Heather Jones"}, {"rating": 5.0, "review": "Love it and so easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Sherri Bujano"}, {"rating": 5.0, "review": "Perfect for my needs: just a little bit a TV at night to relax after a long day of work.", "verified": true, "helpfulness": "0/0", "author": "Solene Fabre \"Solene Fabre\""}]