[{"rating": 4.0, "review": "If you have Amazon Prime and or Netflix also, this is a must! Easy set up, straight forward menus, great addition to the bedroom Hdtv...", "verified": true, "helpfulness": "0/0", "author": "CW \"Chris\""}, {"rating": 4.0, "review": "It powers on in an instant and provides quick access to all the services I need (Netflix, Hulu, TuneIn, etc.). Basically, the default interface is the Amazon Instant Video app. It's there by default, so you get quick access to Prime movies or recent releases and what have you. You also get easy access to Prime music and Prime photos. With the photos, in particular, I really like that you can set your screensaver to rotate through a set of photos from your library. Fun to watch while listening to podcasts.The remote works fantastically. I absolutely love that I don't have to point it at anything. I also installed the android app on my phone and it works really well. Love the voice search. The navigation using the touch screen is really clever and works well.The quality of the video and audio is excellent. It's reasonably performant in scrolling and navigating, but the PS3 (my other media streaming device) is definitely a bit smoother. My biggest gripe is that the video will stutter from time to time. You'll be watching and every 10 minutes or so it will just hang for half a second. Hopefully this can be resolved in a future software update.", "verified": true, "helpfulness": "0/0", "author": "Brandon Folkman"}, {"rating": 5.0, "review": "Was sad to have pre-ordered this and received it after everyone in the free world was able to walk into a Staples and buy it for $25 during the black friday sales.  Works really well with XBMC!!!  Use the providing wall wart to keep it running smooth as for some reason it didn't like the 5v usb on my TV and would constantly reboot on it own.", "verified": true, "helpfulness": "0/0", "author": "Keoke916"}, {"rating": 4.0, "review": "Was able to set up a wifi hot spot with my phone as well as stream from home wifi. Very easy to set it up, put in wifi password and change source to the HDMI and take it with me on a trip somewhere away from home. Wherever there is cell service, I can watch shows or movies just have to watch the data usage when using hot spot from phone.Downloaded a short free clip. So far, so good. Opens up my video and tv entertainment options. Netflix worked. I used to have to physically hook up my laptop to my TV, as I don't have a Smart TV yet. This works as I wanted it to, plus I like the ability to download and store movies or shows and take them on the road, if there is an HDMI TV available.", "verified": true, "helpfulness": "1/1", "author": "Sandy C \"Sandyc954\""}, {"rating": 4.0, "review": "Works great. I would give it a 5 if it continues to impress a few weeks from now.", "verified": true, "helpfulness": "0/0", "author": "Will is Roger"}, {"rating": 4.0, "review": "I love how the amazon fire stick works", "verified": true, "helpfulness": "0/0", "author": "Gary C Schaff"}, {"rating": 3.0, "review": "I got mine at the introductory $20 price. I probably wouldn't buy this at it's full $40 price though.Netflix forgets me login information everytime I unplug the power from the device. And it's very painful logging back into Netflix with the remote (there is remote app for Android that helps, but it's kinda clunky too). I don't know if this is Netflix's fault or Amazon's, but it's frustrating since Netflix is the main app I use on this.The UI itself I find awkward to navigate around. I much prefer Roku's much simpler and faster UI.HBO Go is available on the Fire TV now. But it's still not available on the Fire Stick.", "verified": true, "helpfulness": "0/1", "author": "Ravynmagi"}, {"rating": 5.0, "review": "Terrific enjoy it alot", "verified": true, "helpfulness": "0/0", "author": "karen jomoc"}, {"rating": 5.0, "review": "Very cool!", "verified": true, "helpfulness": "0/0", "author": "Maples"}, {"rating": 5.0, "review": "The fling / mirror feature that works with the HDX tablets is awesome.", "verified": true, "helpfulness": "0/0", "author": "CHARLES TANNER"}]