[{"rating": 5.0, "review": "Very easy to set up and use!  It made my non-smart TV into an instant smart TV.", "verified": true, "helpfulness": "0/0", "author": "Steven L. Cole"}, {"rating": 5.0, "review": "Love it", "verified": false, "helpfulness": "0/0", "author": "Frankie A"}, {"rating": 5.0, "review": "The fire stick is of the best products i have bought. I truly enjoyed it everyday.", "verified": true, "helpfulness": "0/0", "author": "armando juarez"}, {"rating": 1.0, "review": "Trying to get it to stay synced to my network has been a hassle!!!", "verified": true, "helpfulness": "0/0", "author": "john c. gallo"}, {"rating": 5.0, "review": "I really love my Fire TV Stick. I use if for the small television I have in my kitchen, and it's really great to be able to use it while I'm cooking or putting away groceries. I've found that the Fire Stick is very easy and intuitive to use, and love how smooth and responsive the system is. I really have only good things to say and am thinking seriously of buying another device for a television in another room.", "verified": true, "helpfulness": "0/0", "author": "B. Arnold \"equus167\""}, {"rating": 1.0, "review": "We returned it.  It constantly needed to be rebooted and sometimes the picture would freeze while the sound continued.  It was a real struggle.", "verified": true, "helpfulness": "0/0", "author": "Daily Reader"}, {"rating": 5.0, "review": "So easy to set up & start using.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline B"}, {"rating": 5.0, "review": "Very impressed especially with the price.  A wealth of entertainment virtually free. The games are much better than I thought they could be. Great add on for rooms where you do not have cable (you do need wifi).", "verified": true, "helpfulness": "0/0", "author": "William Crisswell"}, {"rating": 5.0, "review": "This thing is great", "verified": true, "helpfulness": "0/0", "author": "Richard A VanderMeeden"}, {"rating": 4.0, "review": "A mouse connected to the Fire TV Stick would be helpful.  Also, instructions on getting around add ons would be very helpful.  It does work and we have watched several movies that we wanted to see. I am sure it will be better as i learn my way around.", "verified": true, "helpfulness": "0/0", "author": "Ginny"}]