[{"rating": 5.0, "review": "It was extremely easy to install and set up and we really liked how easy it was to get to all the things on Amazon as well as other things.", "verified": true, "helpfulness": "0/0", "author": "EDRN"}, {"rating": 4.0, "review": "One of the easiest electronic gadgets I have ever installed and started using. Followed the on screen directions and within minutes I was watching Prime instant videos. No problems what so ever and I don't expect any.", "verified": true, "helpfulness": "0/0", "author": "Greg in Green Bay"}, {"rating": 4.0, "review": "Even after only a few days of use, I'm extremely satisfied with the Amazon Fire TV Stick. Aesthetically, Amazon did a great job with the design and the remote is very comfortable to use and designed well. The availability of Netflix and other streaming services is great and works flawlessly via WiFi in my household. Absolutely meets all my needs for the time being. Definitely more than worth the money and probably one of the better purchases I've made so far this year. Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "rspkt"}, {"rating": 4.0, "review": "It seems to me that the power/USB cord is far too long and complex. The power/USB cord design for the comparable Google Chromecast seems much better in my opinion. The Fire TV Stick requires a wall plug, long USB Cord, additional (but included) adaptor. It has to be plugged in to the wall. You can't just power the device by plugging the USB cord into the USB port on your television like the Chromecast can do.Other than the clunky cord system, I love my Amazon Fire TV Stick.  :-) Good product.", "verified": true, "helpfulness": "0/0", "author": "Zachary Franson"}, {"rating": 5.0, "review": "Finally cut the cable cord", "verified": true, "helpfulness": "0/0", "author": "Rich Burns"}, {"rating": 5.0, "review": "easy to set up.  The remote is super simple and it works great....Makes having a movie night in very fun and easy!!!!", "verified": true, "helpfulness": "0/0", "author": "Charlotte"}, {"rating": 3.0, "review": "Wish I could customize the interface more.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "I love it. bye bye cable", "verified": true, "helpfulness": "0/0", "author": "hector jaquez"}, {"rating": 5.0, "review": "It lived up to my expectations. Simple to use and connect up.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "It did everything I expected it to do and more....has a quick response time also.", "verified": true, "helpfulness": "0/0", "author": "Joe Earl"}]