[{"rating": 2.0, "review": "I should've stuck to Roku. It is horrible It freezes all the time. It is not my internet because I have tried it on three TVs and have the same problem whereas I don't have any issues with Roku.  I wish there weren't so many apps preinstalled.  It was total clutter I had to take a lot off.  Some apps not compatible.  Going back to Roku", "verified": true, "helpfulness": "1/1", "author": "sunscreen mom"}, {"rating": 4.0, "review": "Works well most of the time.  Easy, convenient, fairly fast.  Con:  loses connectivity from time to time even though has almost clear line of sight to router.  We use it for Netflix and sometimes, Pandora.  Also enjoy the fireplace display.  Small, easy to use remote.  The stick is completely unobtrusive which is nice.", "verified": true, "helpfulness": "0/0", "author": "MG"}, {"rating": 1.0, "review": "Love it, love it, love it!", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use great product.", "verified": true, "helpfulness": "0/0", "author": "Jerad"}, {"rating": 3.0, "review": "I'm still looking for the competitive market to step up and off a product that is not limited in some way. Roku offers more streaming services but caching is not robust. The Amazon FireTV stick seems to have fewer connectivity problems but doesn't offer an AcornTV app. The expectation for good connectivity (fewer interruptions while streaming) and a complete offering of streaming services would be a best seller. For now, I have to keep both my Roku and my Amazon FireTV stick. I only have one more HDMI slot remaining on my TV.", "verified": true, "helpfulness": "0/0", "author": "DonF"}, {"rating": 5.0, "review": "I am impressed with the Fire TV Stick.  It was so simple to install - I had it out of the box and running in 5 minutes (plug ac adapter into Fire Stick and electrical outlet, insert Fire Stick into HDMI port on TV, and use remote to set up wifi with password). After that, all I had to do was access my Amazon Prime and Hulu Plus accounts and enter my passwords. This was the easiest set-up I've ever encountered. So far the device works flawlessly. The picture is very clear and the streaming has worked great, even with the minimal download speeds my Internet allows. I haven't tried any of the games or other offerings yet. Best of all, the price is very affordable. I highly recommend the Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 3.0, "review": "I'm having problems so far. I purchased a movie but still haven't been able to view it because it didn't stream as expected.", "verified": true, "helpfulness": "0/0", "author": "GPatty"}, {"rating": 4.0, "review": "Satisfied!", "verified": false, "helpfulness": "0/0", "author": "Rodel"}, {"rating": 5.0, "review": "It is a wonderful piece of technology. Works well, intuitive controls.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 1.0, "review": "If you don't live in USA it not works.", "verified": true, "helpfulness": "1/2", "author": "Ricardo Polmon"}]