[{"rating": 4.0, "review": "This is a great little device.  I was especially impressed that mine was 100% trouble-free.  I'd also add that the excellent wireless remote uses RADIO, not infrared, meaning it does not have to be pointed in the right direction and will operate through wooden cabinets, glass, or pants pockets (prank your friends),  I disobeyed Amazon's recommendations and powered mine from my TV's USB port, and there's been no problem at all so far.  The only thing I didn't like is that the \"free\" (with Amazon Prime) streaming video seemed to be lower in quality than what I can get using Netflix in HD, which I also have.", "verified": true, "helpfulness": "0/0", "author": "vacuumtubejazzpro \"rich\""}, {"rating": 5.0, "review": "Though I have a bluray player with apps and a WD Live Plus with multi-terabyte drive and wireless keyboard,  I did not have anyway to play Prime content on my tv and entertainment center.  the Fire TV stick does the job very well.  it is smooth and fast with no buffering. I have it plugged into my Pioneer media receiver instead of my tv.  I am happy that the stick does not use an IR type remote. when the Pioneer is off so too is the stick but it does not forget what I watched.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"budweiser4\""}, {"rating": 4.0, "review": "The product is quite good. Load times are quick and the UI works well enough. The remote works quite well and I like the design.The video quality is surprisingly good. No problem streaming in HD.The selection of apps is substantial, but many free apps are low quality. Apps like Netflix and youtube work very well, but be wary of some of the other apps. Any other decent app seems to require a purchase.Surprisingly what I really liked is the music streaming via my prime membership. I've been meaning to check out a lot of music, primarily classical, and Amazon's assortment of overly large classical albums is a godsend. I don't quite why I far prefer steaming the music on the TV stick than on my computer, but I figure it has to do with the remote.I can't find a way to change the volumeMy rating would have been five stars if it was not for the various issues I had with it the first day. It would not connect to my wifi for quite some time, and when it did, it would not download the update. Eventually I got it to download the update, and then kept losing connection. Anyway, it eventually it sorted itself out and works without issue.", "verified": true, "helpfulness": "0/0", "author": "Nathan Pepin"}, {"rating": 3.0, "review": "things i like.when watching TV seasons it will automatically play the next episode.flappy birds.the remote is quite nice... better than my roku remote.pressing and holding next will smoothly flip through tv and movie listings (my roku will not do that)the netflix app on the fire tv stick is easier to navigate for me.things i dont likenetwork frequently drops off and either rebuffers or displays a black screen that says my network disconnected... i can say with a great amount of certainty that it is the fire tv stick's issue and not my network because my chromecast and roku has never done this. and my download speeds average 50Mbps. this issue also occured while watching netflix youtube and amazon videos.the fire tv stick needs a power source which is delivered via a microusb port and comes with a little usb brick to plug into the wall. i first plugged the usb cable into the television (which works for the chromecast). the fire tv stick did turn on but displayed a message saying that the power source is not recognized and that the network connection may suffer because of this. so i used the brick and it displayed the same message... weird.the youtube app bugs out when you press and hold the left or right button to scroll through videos. it will pause and then skip 5 or 6 videos and then lagg and catch up. i found myself having to be very careful to not click left or right too quickly as well because this will cause the same issue.the nice thing about the netflix app is then when you browse titles it will show a large picture on top with a description. the thing i dont like is if you click left or right to browse quickly the large display on top lags terribly and takes a while to catch up.my fire tv stick experience was extremely buggy. it was fun for about 45 minutes because it was new and interesting but that novelty has worn off and i am back to using my roku.", "verified": true, "helpfulness": "0/0", "author": "20mmf17"}, {"rating": 5.0, "review": "So far so good. Makes searching very easy.", "verified": true, "helpfulness": "0/0", "author": "Brook \"Brook RNC-OB\""}, {"rating": 3.0, "review": "So torn on this device...I bought it with the intention of replacing my old Logitech Revue.  One thing I do miss compared to the Logitech is the lack of an HDMI pass-through (which the regular Fire TV does not have either).  The smaller report and lack of keyboard hasn't bothered me yet.  Netflix and Amazon Prime video streaming both seem to work well - good video and audio quality.My biggest complaint is the fact that I cannot get Miracast to work from any device.  I've tried multiple Windows 8.1 computers and Android devices, and I still cannot get it to work properly, not even once.  Miracast support was a big part of why I purchased this device, since in theory, I would be able to replace both my Logitech Revue and my Netgear WiDi/Miracast standalone receiver.  Unfortunately, this seems to be a fairly common issue - a quick search online turns up many forums posts with other users experiencing similar issues.  If they can get this fixed, this thing would get an easy 5 stars from me.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've had a chromecast, xbox 360, xbox one, sony TV box, PS3 and the logitech revue. Simply put, if you are an amazon prime user I can't recommend a better streaming box for the money!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I thought it would work like tthe chromecast and have the ability to have my smartphone cast the app in use to the stick.  Unfortunately not the case. It works using the remote only. Looks like an app is coming to use as another remote, but definitely does not a cast from your app to the stick to the tv.At the end of the day, chromecast is better.  The firestick is only nice because you can stream your amazone videos which is something that cant be casted via chromecast.also bit dissappointed this was advertised to be comparable to the chromecast. If it had the same casting ability as chromecast from any app on the smartphone, I would have replaced my existing 3 chromecast i have plugged in throughout the devices in the house with another 3 firesticks.", "verified": true, "helpfulness": "0/0", "author": "yoej8"}, {"rating": 5.0, "review": "Excellent device and it does what are expected.", "verified": true, "helpfulness": "0/0", "author": "MXY"}, {"rating": 2.0, "review": "I want this to be awesome, but right now it's not. It buffers a lot... like several times in a 30 minute episode. I have an AppleTV and a Roku on the same network (50Mbps)... they don't. Sometimes (once or twice per 30 min episode) the sounds stutters or a digital audio artifact will occur. Some \"Apps\" just sit at a black screen indefinitely. The price is great, but I'm disappointed overall.", "verified": true, "helpfulness": "0/0", "author": "Ronno"}]