[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Norman R."}, {"rating": 5.0, "review": "Fast and easy to use. Love it.", "verified": true, "helpfulness": "0/0", "author": "Jason Stubbs"}, {"rating": 3.0, "review": "It is well formatted and easy to navigate.  There aren't nearly as many Prime movies (free to Amazon Prime members) as we expected.  At least not listed.  We are still getting acclimated.  But, we expected to be able to scroll through many more free choices than currently appear on the menu.  A bit disappointing in that regard.  Also, if you rent a movie, then like it enough to buy, you should be able to purchase it minus the amount you already paid to rent it.", "verified": true, "helpfulness": "0/0", "author": "Gianetta Ellis"}, {"rating": 5.0, "review": "Works very nice, having Prime definitely a plus", "verified": true, "helpfulness": "0/0", "author": "Gil"}, {"rating": 5.0, "review": "I have been streaming video since the day I received my Fire TV Stick.  It was so easy to set up, that I did it myself. And in about 5 minutes!  This is so simple to use for any Prime videos, and everything loads in no time. The best $39 I've spent in a long time.", "verified": true, "helpfulness": "0/0", "author": "d"}, {"rating": 5.0, "review": "I LOVE this. It is super easy to install and easy to navigate. You get so many selections of shows and movies. We used to have a Roku, this is far more superior. What did I do without it!", "verified": true, "helpfulness": "0/0", "author": "B. Smith \"barb\""}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "debbie"}, {"rating": 5.0, "review": "Works great, as advertised! I like it much better than my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Casey L Wilson"}, {"rating": 5.0, "review": "Thanks for the great deal and fast shipping.", "verified": true, "helpfulness": "0/0", "author": "Shirley Gabbert \"cremewhipper\""}, {"rating": 5.0, "review": "Was very easy to install and start using.  I have been using it mostly for Hula Plus as I am a member.  I really like the ease of watching Hulu Plus on my TV instead of my laptap or tablet.  I had considered getting a blu-ray player and tried that but had difficulties using that.  This is better than Blu-Ray Player.", "verified": true, "helpfulness": "0/0", "author": "Prairie Moon belly dancer \"Caprica\""}]