[{"rating": 5.0, "review": "I ordered the Fire Stick not knowing what to expect but since I subscribed to a few of the apps/services supported thought I'd give it a try. Bottom line it arrived and after we activated it it worked Great, even easier than I had hoped for. Even a better a better deal if your a Prime member.... Not only does it have a lot of content to watch but games for my children too, I may have to invest in the controller.... I may be ditching my expensive cable package and just get Internet from my provider.Fire Stick has something for everyone & easy to use, Highly Recommended.....", "verified": true, "helpfulness": "0/0", "author": "M. Redding \"Like to Read\""}, {"rating": 5.0, "review": "It works fine. Somehow I thought it would download to kindle fire, It does not. And why would you down load from kindle fire to the fire stick  when  the fire stick already in the TV . It does the same exact thing . I think it is amazing amazon prime is free sometimes, and when you go back its $1.99 or higher for the same TV shows you started watching for free. Give me Netflix  over amazon any day. I will not renew when year  ends but the fire stick does work .", "verified": true, "helpfulness": "0/0", "author": "roger"}, {"rating": 5.0, "review": "This item has exceeded my expectations & family , very easy to setup and used. The only thing I wish the remote was a little bigger", "verified": true, "helpfulness": "0/0", "author": "ray herrera"}, {"rating": 5.0, "review": "This is pretty cool, really like it..fast shipping too!", "verified": true, "helpfulness": "0/0", "author": "Vero-y-Jo"}, {"rating": 5.0, "review": "The fire stick is by far the best streaming device on the market AND the BEST value!!", "verified": true, "helpfulness": "0/0", "author": "S. Delepine"}, {"rating": 2.0, "review": "fair", "verified": true, "helpfulness": "0/0", "author": "shirley"}, {"rating": 4.0, "review": "Love the stick, and the remote is a cool feature.  If Amazon Prime allowed you to rate what you just watched, a lá Netflix, this would be pretty near perfect.", "verified": true, "helpfulness": "0/0", "author": "James Bunch"}, {"rating": 5.0, "review": "Works like a dream. Smooth and intuitive.", "verified": true, "helpfulness": "0/0", "author": "Happy Infidel"}, {"rating": 5.0, "review": "Good deal for the price.", "verified": true, "helpfulness": "0/0", "author": "Robert A. Guertin \"the woodworker\""}, {"rating": 5.0, "review": "Just what I needed..", "verified": true, "helpfulness": "0/0", "author": "John Romeo"}]