[{"rating": 5.0, "review": "I love the fire tv stick, prefer it over the roku!  So many options, it works flawlessly", "verified": true, "helpfulness": "0/0", "author": "K. Martinez"}, {"rating": 3.0, "review": "the stick is ok but it does not have a good app selection, also for showtime anytime direct tv is not on the provider list, the roku stick woks just as well and has all of the apps and providers that most people need, also the fire stick has  no hbo go. if you only want amazons prime video it is ok but roku has more and better coverage.", "verified": true, "helpfulness": "0/0", "author": "mwruss"}, {"rating": 5.0, "review": "The Fire TV Stick is awesome. I have not had any problems at all. Much better than Google's Chrome Cast or Rouku's stick.", "verified": true, "helpfulness": "0/0", "author": "Ray Ray"}, {"rating": 5.0, "review": "This is awesome", "verified": true, "helpfulness": "0/0", "author": "S. Shafazand \"Loving Life\""}, {"rating": 5.0, "review": "This exceeded my expectations based on price", "verified": true, "helpfulness": "0/0", "author": "menachem goldenberg"}, {"rating": 5.0, "review": "very good little device, 5 stars!", "verified": true, "helpfulness": "0/0", "author": "Lin Lin"}, {"rating": 5.0, "review": "Awesome little device! Makes my non-smart tv into a smart tv!", "verified": true, "helpfulness": "0/0", "author": "Dany Suarez"}, {"rating": 1.0, "review": "Had horrible connection issues. My router was 10 feet away. Also, if you want the stick to work at all you need to use the additional power adapter, which is misleading because all the commercials make it look like you can just plug it into your HDMI port. That's not the case. If you need to use the additional power adapter you might as well buy the Amazon Fire TV.", "verified": false, "helpfulness": "1/2", "author": "Hrag Kalebjian"}, {"rating": 5.0, "review": "Put away your google chrome and it's poor reception.  The intuitive remote, the signal strength and all of it making watching Netflix or prime so much better.  I have to say that this truly is a game changer and I love the small remote.", "verified": true, "helpfulness": "0/0", "author": "Atomeatball"}, {"rating": 4.0, "review": "I know lots of folks who have this and love it.  Not sure what is up with mine but it has a buzzing noise on pause and doesn't stream as fast as my old Roku.  But it does allow for closed captioning which my old Roku did not.", "verified": true, "helpfulness": "0/0", "author": "Jan Freeman"}]