[{"rating": 5.0, "review": "Works perfectly for my father, who is more comfortable with a TV remote than a mouse and keyboard.", "verified": true, "helpfulness": "0/0", "author": "Adrian Orihuela"}, {"rating": 4.0, "review": "Lots of good features. Batteries difficult to install on remote. Would definitely recommend to friends.", "verified": true, "helpfulness": "0/0", "author": "stutsman"}, {"rating": 5.0, "review": "Works well right out of the box.  Easy to set up and start using.  My internet is a little slow so I am looking forward to upgrading to cable internet.", "verified": true, "helpfulness": "0/0", "author": "Dale L Marshall"}, {"rating": 5.0, "review": "Works way better than the box that it replaced, and the price is right.  Easy to setup and use.  I have only used it to watch Amazon prime, Netflix, and WatchESPN.  So far I haven't experienced any buffering and I have no complaints.", "verified": false, "helpfulness": "0/0", "author": "Andrew Duvall"}, {"rating": 5.0, "review": "I ordered 2 when they came out for $19 and I should of ordered more because we love it. We have the reg Fire TV as well and love it but I would have rather bought 4 of these and saved the money since they do the same thing except for the voice command which we don't even use as much anyway. We don't have cable so we just do Amazon Instant along w Netflix and we have an abundant shows to watch including the news on the news app. So worth the money!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 5.0, "review": "Works just as described.  I love it!!", "verified": true, "helpfulness": "0/0", "author": "Alesa Lynn Burnham"}, {"rating": 5.0, "review": "I love my fire stick!! It had an easy set up and it is easy to operate.", "verified": true, "helpfulness": "0/0", "author": "judy Goodwin"}, {"rating": 1.0, "review": "I was able to purchase this for half price and still it was not worth the money. It was wonderful for the month that it worked. Now, it refuses to connect to wifi which renders it a worthless piece of junk. The extra money spent on a Roku is certainly worth it since will still be working well beyond a month. I guess it is true that you do get what you pay for.", "verified": true, "helpfulness": "0/1", "author": "Brian J. Lewis"}, {"rating": 5.0, "review": "The Fire TV Stick surpassed even my high expectations.  Performance is perfect --  I've used it on both Amazon Prime and Netflix. The setup couldn't have been easier. Except for the one time job of typing in the password for my router, the whole procedure could have been done in less than  2 minutes.  I have been using a Google Chromecast, which also performs very well.  However the Chromecast uses the cell phone for control and it is sometimes less than intuitive.  I prefer the separate control on the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "John F. Smith"}, {"rating": 1.0, "review": "I had to return because it requires 4/G wifi and I think if this fact needs to be listed.", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}]