[{"rating": 1.0, "review": "THIS DEVICE HANGS UP AND SKIPS!Coming from Chromcast I was excited to have a remote. Unfortunately encountered problems at every turn. From the start the actual plug was machined poorly and was difficult to plug into the TV. After bending the Amazon Fire stick HDMI port I was able to finally connect the Fire to the TV. The USB power from the TV that more than adequately provide power to my chromcast was not sufficient for the Amazon Fire and a external plug. Really poor design on the USB plug, it takes up a minimum of two ports on my power strip from it's bulky size. But the big problem comes in when I want to watch a movie. The device hangs up constantly! What's the point this device if it can't stream movies of TV? Also the app for this device is still not yet available for iOS..My $20 would have been better spent on a game of poop dollar", "verified": true, "helpfulness": "1/1", "author": "Daaaaaaaaaaaaaannnnnn \"dan dan dan dan1\""}, {"rating": 5.0, "review": "Loved the box, love the stick, but I hadn't previously thought about the power supply. I figured it would charge or take a battery, instead I have to plug it in, which is slightly less \"portable\" than I envisioned. I travel with this thing, its great for that.", "verified": true, "helpfulness": "0/0", "author": "Sophia"}, {"rating": 3.0, "review": "Fire TV stick has potential.  It is probably the most powerful streaming stick out there.  But, it is not there yet.The interface is clunky.  Searching for content is not intuitive.The channel lineup is a little bit sparse.It requires a wall plug.  You can't use it plugged directly into USB of your TV.  This will make it bad (or more work) for anyone that hides all of their wires.Also, I could not get the Screen Mirroring feature to work with any Miracast device that I tried.  This should not be an advertised feature because it probably doesn't work beyond Amazon's own devices.  Tech support has no answers about this.", "verified": true, "helpfulness": "0/0", "author": "Lawguy"}, {"rating": 3.0, "review": "I've been having mixed results during the first few uses of the Fire TV Stick. The HDMI extender cable proved difficult to connect to the TV with intermittent flashes of the Amazon & Fire Stick screens. Finally after much jiggling, I was able to make a solid connection (I never had this problem making an HDMI cable connection from the cable box or laptop to the TV). The first TV show I streamed had perfect HD video, but clipped audio. This was corrected by changing the audio setting. OK - we enjoyed episodes of \"Parade's End\" through Amazon Prime at no cost - no buffering, good audio & video. The next day, having changed no settings on the stick or TV, the video displayed a lot of \"snow\". Although I like the convenience of not having to connect my laptop to the TV stream media each time, I'm not sold 100% using the stick and am reluctant giving it a higher rating until this issue is resolved.", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 5.0, "review": "Very happy with the Fire TV Stick so far!  We have a roku on our downstairs tv which lets us access Amazon Prime, but we only had apple tv upstairs, so when I saw this special deal for prime member I jumped on it...very glad I did!  It seems to load movies MUCH faster than itunes and the quality is awesome!  I have watched a few college basketball games on the ESPN app also.", "verified": true, "helpfulness": "0/0", "author": "Brian Mac \"maccve\""}, {"rating": 2.0, "review": "I much prefer my Roku.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pretty Awesome! Easy setup! fast and does what it is to do.", "verified": true, "helpfulness": "0/0", "author": "heath henderson"}, {"rating": 1.0, "review": "Nothing exceptional.  It was $20 when I bought it so its hard to complain.  Not worth $40.", "verified": true, "helpfulness": "1/4", "author": "Smith"}, {"rating": 5.0, "review": "The Fire Stick was a gift fromour Son and we love it! So convenient. It connects to the back of your tv and you never see it.No wires. The remote can pick up the signal from anywhere. Behind your back. So there is no holding your arm up or down or side ways to change the options. Great gift! I would purchase the Fire Stick and give it as a gift.", "verified": true, "helpfulness": "0/0", "author": "Sandra"}, {"rating": 2.0, "review": "The Fire TV Stick does have basic parental controls which can prevent access to Games & Apps, Photos, and Music as a whole. However it lacks the granular features of FreeTime which can control access down to individual apps and videos. Also, you may want to get the voice control remote, but by that time you might as well pick up the full featured FireTV instead...", "verified": true, "helpfulness": "0/0", "author": "Sambucka"}]