[{"rating": 5.0, "review": "The Fire TV Stick is an outstanding product.  It works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Ronald P. Patterson"}, {"rating": 5.0, "review": "Great device and easy to install. Running it with your phone is perfect... Steve Jobs would approve!", "verified": true, "helpfulness": "0/0", "author": "Terry Fitzgerald"}, {"rating": 5.0, "review": "Such a great purchase", "verified": true, "helpfulness": "0/0", "author": "Lys"}, {"rating": 5.0, "review": "We love it!!  Our 8 & 2 yr old boys love it the most...it's in their playroom.  They never watch cable now!", "verified": true, "helpfulness": "0/0", "author": "Whitney Curtis"}, {"rating": 5.0, "review": "I've actually owned two Fire Sticks. The first was an early purchase, offered at a discount to Prime members. That unit suddenly quit working after two months. I reported this to Amazon, and two days later I had a replacement in hand. It looked identical, but immediately in installing it, it downloaded an updated operating system with vastly improved interface and functionality over the original.I was pleased with the earlier unit, and I'm more pleased with tis one. It does a far better job if streaming Amazon, Netflix, YouTube, PBS, and many other sources than does the built-in Internet streaming feature of my LG TV, and offers a number of sources that the TV doesn't. One caveat: I first tried it with my first generation digital Samsung TV, and it didn't work. I'm guessing that the TV was missing one or more of the control signals that the Fire Stick was looking for in the HDMI input, though I can't say for sure. Be aware that there may be some TVs out there that the Fire Stick won't work with.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Edelman"}, {"rating": 5.0, "review": "We love it and we really have so much more to investigate. Thanks to Amazon for giving us so many great entertainment options.", "verified": true, "helpfulness": "0/0", "author": "Barbara Wieder"}, {"rating": 4.0, "review": "As someone who has owned both a Chromecast and a Fire TV Stick:1. The Fire TV Stick is a BETTER BUILT device that is better for streaming video. The 1 GB of memory translates to smoother streaming and fewer lags. I have no issues streaming HD video from youtube, whereas I've had many issues with the Chromecast. It would sometimes take a few minutes for the Chromecast to buffer a short video and the quality was often very poor (240p or less).2. Remote is DEFINITELY a reason why you'd want to consider this device, as the Chromcast does not have one. I love having it so I don't have to find and access my phone or laptop or order to pause or select a video, and it's great for quickly perusing through the menus on youtube or netflix, etc. Keep in mind that the remote does not control volume though.3. As others have mentioned, the Fire TV Stick is not a mirroring device so it's capabilities are NOT perfectly identical to the Chromecast. So if you're looking to use your HDMI stick as a way to project what's showing on your chrome browser, know that Amazon's product will NOT do that.4. One thing I really like is the ability to make a video queue so you won't need to select new content as soon as your current video finishes. If you look at doing through youtube for instance the Chromecast is allows you to watch and make such a video queue simultaneously, while the Fire TV stick simply does not.Overall, I'd go with the Fire TV Stick as it's simply better for the most important feature of these HDMI sticks; streaming video fast and reliably. However, the Chromecast also lets you mirror so it has a few more features (excluding Amazon Prime Video of course), and is great for say, sharing a funny reddit thread on your TV so others can see it.", "verified": true, "helpfulness": "0/0", "author": "Alexander"}, {"rating": 5.0, "review": "Great price!", "verified": true, "helpfulness": "0/0", "author": "Clare Kelly"}, {"rating": 2.0, "review": "V disappointing! Read the fine print. I bought a replacement remote that didn't work w the hmdi etc so I've git to manually switch betw tv and stick", "verified": true, "helpfulness": "0/0", "author": "Kathryn Simon \"katsoul11\""}, {"rating": 5.0, "review": "So incredibly awesome. I can watch good tv from any too with a tv in my house.", "verified": true, "helpfulness": "0/0", "author": "Wendy Y. Alas \"wendyalas\""}]