[{"rating": 4.0, "review": "Easy set up and installation.  Already have a Prime and Netflix account and they were easy to load.  Don't be fooled there is an outside power source needed.  Comes with a plug and about 4 feet of cable.  I was thinking it was more of a USB powered device without a separate power supply.  Something similar to a flashdrive.  But even so, we are very happy with the device.  Easy to setup, easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "chris studnicki"}, {"rating": 5.0, "review": "I have the amazon fire TV in my living room and with the amazon fire TV stick in my master bedroom I get to enjoy all the programs upstairs and downstairs", "verified": true, "helpfulness": "0/0", "author": "MR BANKS 1"}, {"rating": 3.0, "review": "haven't really used it to much yet, so can't give to much of a review. Was a little surprised you had to plug this into electrical outlet, sure if i had done more research I would have known this. Its not a big deal, just was supervised.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Ccheryl"}, {"rating": 5.0, "review": "Love it. Bought it for my daughter's TV, plugged it in, and it was pretty much ready to go. Now she can watch Netflix and prime in her room without upgrading her TV.", "verified": true, "helpfulness": "0/0", "author": "inkabelle"}, {"rating": 2.0, "review": "Ok, when it works. I'm a huge fan of Amazon and all things Amazon and I really wanted to write a good review for this product, but I just can't. The device never can sync to my wifi and I have to reset my wifi every single time I use the Fire Stick. I don't have his problem with my Xbox. Please, do better Amazon.", "verified": true, "helpfulness": "0/0", "author": "Mossimo07"}, {"rating": 5.0, "review": "My family really likes it.", "verified": true, "helpfulness": "0/0", "author": "1234"}, {"rating": 4.0, "review": "It's ok...wish there were more free TV shows but they are priced lower than Netflix. Haven't really used it much but just looking through the various options, there isn't as much new movies as I expected. I'll keep it, mainly because it is cheaper than Netflix.", "verified": true, "helpfulness": "0/0", "author": "Eric D Orahood"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "James Little"}, {"rating": 3.0, "review": "I was expecting to be able to use more of the apps that i use on regular basis.  There are many apps, but only a couple that i use, such as netflix.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]