[{"rating": 4.0, "review": "Works very well. Have not had any problems.", "verified": true, "helpfulness": "0/0", "author": "Collins3352"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Ms. Alesse Norman"}, {"rating": 5.0, "review": "WOW! I LOVE it!", "verified": true, "helpfulness": "0/0", "author": "theguudtwin"}, {"rating": 5.0, "review": "Awesome product!! Wish I'd gotten it sooner. Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "ALA"}, {"rating": 5.0, "review": "This is the second one I have bought.  I love the ease of use.", "verified": true, "helpfulness": "0/0", "author": "Michele K"}, {"rating": 3.0, "review": "It's not really what I expected.  I was looking for something to load movies on to take in the camper to watch when I didn't have Wi-Fi.  From what I can tell, you have to have Wi-Fi to watch anything, as your watchlist is loaded to a cloud.  I thought I had read, 'watch movies anywhere, any time'", "verified": true, "helpfulness": "0/0", "author": "Janice S Orr"}, {"rating": 5.0, "review": "Easy set up. Awesome product.", "verified": true, "helpfulness": "0/0", "author": "A. Eric"}, {"rating": 2.0, "review": "My purpose for purchase was to use the xfinity tv go app for watching live sports on espn. It did allow me to do this except it would video buffer every few min. to the point it was annoying. Who wants to watch sports when someone gets ready to shoot the basketball and it starts to buffer. I returned it because of this. My internet connection is solid with 25gb download so I concluded it was the fire stick. I may try the fire as I understand it has more memory and faster processors.", "verified": false, "helpfulness": "0/0", "author": "RockonPirates"}, {"rating": 5.0, "review": "We LOVE our Fire Stick! This easily streams Netflix, YouTube, Amazon Prime shows and movies, plus we can use the slingbox app to watch what's showing on our cable box or shows on our DVR. It's so easy to use, my toddler can work the remote. Great product, we plan on buying another!", "verified": false, "helpfulness": "0/0", "author": "Kasandra Kuehl"}, {"rating": 5.0, "review": "Love it!!  Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "April"}]