[{"rating": 4.0, "review": "Works as advertised and  much more convenient than hooking up laptop to computer to watch Prime Videos", "verified": true, "helpfulness": "0/0", "author": "Zebulon"}, {"rating": 4.0, "review": "I only got this because it was an add-on for Sling TV but I must say I'm pretty impressed. I have a Samsung Smart TV thats about 3 years old and this device is so much more \"snappy\". The remote for app for the Iphone is excellent as well.", "verified": true, "helpfulness": "0/0", "author": "MJ"}, {"rating": 5.0, "review": "It's a great addition to my TV.  Due to getting my tax documents in order I haven't had much time to fully explore it.The little I have been able to use it was great! I also like the phone app for times I misplace the remote control or my wife hides it from me.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Works amazingly if you have a wifi connection with or without a password. The main reason I bought the fire tv stick was for traveling, but most hotels have a prompt in a browser to connect instead of a password. Rendering this product useless until they add some support for it. Very unsatisfied.", "verified": true, "helpfulness": "0/0", "author": "Steven Cowan"}, {"rating": 5.0, "review": "All smiles!!!", "verified": true, "helpfulness": "0/0", "author": "Rokell Carey"}, {"rating": 4.0, "review": "It is easy to install, as promised. Use is pretty straightforward. You turn on your tv, Fire comes up as source and it loads a menu.  You use a very small remote control to access the menu. Not a lot of buttons to figure out.  There is a nice, quick tutorial upon installation. A major issue, however, is that every couple of days, I've got to unplug the unit and let it reboot.  That gets a bit annoying.  I recognize the reboot symptoms when the remote quits working.  Annoying, but I'm using it.", "verified": true, "helpfulness": "0/0", "author": "J. Moore"}, {"rating": 4.0, "review": "Works great and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "desert flower"}, {"rating": 5.0, "review": "Great media device. Easy to take with you on the go. Use it primarily for Plex and Netflix. At home I have Kodi(XBMC) side loaded. Extremely capable media device with lots of different services all packed into a tiny but powerful package.", "verified": true, "helpfulness": "0/0", "author": "Ryan L."}, {"rating": 5.0, "review": "The Fire stick was a hit in my household ....Buying another one for the guest  bedroom.  Thanks Amazon ...", "verified": true, "helpfulness": "0/0", "author": "Yankee rose"}, {"rating": 1.0, "review": "The device keeps dropping network connection. I factory reset the stick, changed routers, all the basics. Nothing. This is an issue as my chromecast and bluray both don't have connectivity issues, and this hampers my migration away from Google (nexus7 to fireHD, galaxyS3 to fire phone), meaning I still have to juggle devices. Firstworldproblem, ill grant you, but still.....bummer", "verified": true, "helpfulness": "0/0", "author": "Ryan Robinson"}]