[{"rating": 5.0, "review": "Really haven't used it much but it seems to work great--have other friends that love it too!!", "verified": true, "helpfulness": "0/0", "author": "Deborah Stephens"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "00tima"}, {"rating": 5.0, "review": "I love this stick!! It's so compact. Like I need another big piece of electronics on my tv stand (Sarcasm).  It is really easy to use and I love that I can browse on my Kindle and add things to my watch list from there.The only negative thing is that I found the remote back hard to slide to put the batteries in. Hopefully the ones in there last long so I don't have to change them anytime soon.", "verified": true, "helpfulness": "0/0", "author": "Kelly P"}, {"rating": 5.0, "review": "Apple TV on a budget", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "An incredible value! I now own four Fire TV Sticks.", "verified": true, "helpfulness": "0/0", "author": "Conannick1"}, {"rating": 5.0, "review": "What a fun little dongle. Wanted something to be able to access Amazon and Netflix video on my kitchen counter TV, which is fortunately new enough to have an HDMI port. I ordered one of these but it was back ordered and I happened to stumble onto one at Best Buy so bought it there instead. This was a breeze to set up. It works flawlessly. There are some fun apps available. Intuitive and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "This is wonderful for watching non-cable viewing. The only catch is that the wireless connection gets messed up easily. I can't figure out why. I have to take it apart and plug it in again. Irritating. But when it works it is great!", "verified": true, "helpfulness": "0/0", "author": "susan kenworthy"}, {"rating": 5.0, "review": "Love it, easy user interface and great layout! Easy to navigate through all the menus and find what you want to see!", "verified": true, "helpfulness": "0/0", "author": "Ting de la Vega"}, {"rating": 5.0, "review": "Super easy to install and use.", "verified": false, "helpfulness": "0/0", "author": "kkirk"}, {"rating": 4.0, "review": "After the unit has been off for a while, it seems to take a few minutes for it to come up/on and the TV to recognize it. But works flawlessly after the initial...", "verified": true, "helpfulness": "0/0", "author": "Brian E. Niskala \"Brian E. Niskala\""}]