[{"rating": 4.0, "review": "Buying this at the sale price makes this purchase worth it.  It does need to be reasonably close to the wireless router in order to work.  My intention for the Fire TV Stick was to use on a TV in the basement.  I hooked it up and configured the wireless (which said it had full signal strength).  I was unable to stream anything.  I relocated this to a TV significantly closer to the router, and it worked just fine.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The Fire TV Stake is a OK product, with some issues.  The biggest problem with this device is that it's not compatible with every wifi router.  I tried hooking it up to my new router I bought a few months ago, it was unable to connect.  Turns out it's not compatible with all routers.  So I had to go back to my old one, it connected instantly.  Then my fiber-optic Internet is at 6 megabits, which has always worked excellent doing anything I wanted to do even streaming multiple videos at a time.  But well the device was updating it kept telling me there was a problem with my connection because it was taking too long.  Apparently this device was not created for the average person but for individuals who live in the city where the Internet speed is much higher.  Also it takes a while for the device to determine what the best quality available is for playing back videos.  So well it was trying to determine that the videos are very pixilated on some of the programs, such as Disney channel.  Going into settings and picking the desired playback corrected the problem.Other than that the issues are minute. However I have a friend who used both this device and the Roku stick side by side.  Apparently this device is a cheaper copy of the Roku.  This device is slower clumsier and has a few issues.  But they cost the same at least at the time of writing this.  I purchased the Fire TV Stake at a huge discount, but I would not paid more than $25.00 for this item without it having a significant upgrade in programming.  I've also used ChromeCast and even though it is slower the programming has some awesome features especially if you're using a new phone or tablet as your remote.  And it has a good price.", "verified": true, "helpfulness": "0/0", "author": "Richyyrich"}, {"rating": 4.0, "review": "Great ; easy to use and no lag. Just wish it had hbogo, maybe by next year it will.", "verified": true, "helpfulness": "0/0", "author": "Wade Hudson"}, {"rating": 5.0, "review": "Love the possibilities with my new Fie TV Stick! Very User Friendly!", "verified": true, "helpfulness": "1/1", "author": "Donna Polk"}, {"rating": 5.0, "review": "I love this thing! AND it really is THAT easy to use.", "verified": true, "helpfulness": "1/1", "author": "Christina, NM"}, {"rating": 2.0, "review": "Nice concept and works well, once its up and running.  But all I can say is watch your internet usage if your data is capped.  My husband and I watch 4 episodes of the good wife and a movie yesterday (along with some surfing the web) and we used almost 17.5 GB of data.  We never had to worry about this when we were using our Roku.  I think this might be going back.", "verified": true, "helpfulness": "1/2", "author": "mom2kandm"}, {"rating": 5.0, "review": "Using Amazon's game controller remote eliminates lost remotes!!! --My kids often misplace small remotes.  Amazon's game controller remote WILL link to the Fire TV stick, and it is almost impossible to lose it in a living room!!!  The voice remote @ $29 will also link to it.I really like being able to play music through Amazon and the Fire TV stick.  For about 30 minutes of nonuse, the Fire TV Stick displays a slide show of really beautiful scenes!We have both the Fire TV stick and Amazon's regular Fire TV device --- unless you're a gamer, the less-expensive Fire TV Stick will probably work just fine for you! ---", "verified": true, "helpfulness": "0/0", "author": "craigery"}, {"rating": 5.0, "review": "For such a small device, the Fire TV Stick really delivers. If you're an Amazon Prime member, then you'll find oodles of TV and movie offerings. You'll also find many of the streaming offerings available via other devices, including Netflix, Hulu+, and Crackle. The menu system is well laid out and easy to navigate. The streaming and viewing experience is excellent. Now the only thing that would improve this device would be to marry the Apple and Amazon ecosystems so that you could access digital content from either service over this one device. Perhaps one day! In any case, the performance of this device is superb and it would be difficult to complain.", "verified": true, "helpfulness": "0/0", "author": "Mike C."}, {"rating": 5.0, "review": "Wow, It  works so much better than what I expected. So much better than Chromcast.The fire stick really allowed me to enjoy the full extend of my Amazon Prime membership.I spend the whole day figuring out everything, and it has been a lot of fun.Pros:The UI was very informative and easy to navigate.The  remote even thou it's simple, it's very functional.I love how easy it was  to browse my photos in the amazon cloud drive.Very easy access to the Amazon Prime Videos.Cons:no on/off buttonno IOS app YET?Overall I'm very happy was my purchase of the Fire TV Stick.The $20OFF for prime membership was the first reason for my purchase to try it out, but have to say if I knew how good this was, I would gladly pay at the full price.", "verified": true, "helpfulness": "0/0", "author": "X. Chen"}, {"rating": 4.0, "review": "Very easy to use.need more apps and volume  control on remote", "verified": true, "helpfulness": "0/0", "author": "Albert Saldana"}]