[{"rating": 5.0, "review": "Love it! Easy to set up, operate and love that it just sticks into HDMI on TV... hidden from sight. Also, it is easy to pack for travel.", "verified": true, "helpfulness": "0/0", "author": "SS"}, {"rating": 3.0, "review": "First, let me state I am a prime member and love it. My wife and I are trying to get our household set up as \"smart\" as we can. Our next tv purchase will be a smart tv but until then we decided to try both roku and the new Fire stick. I would love to say that we'll be going with amazon but I can't, at least not now. So far using netflix has been so much slower with the Fire stick and with roku there is no delay with the same wifi. If Amazon can fix the slow and frequent buffering issue we might change our mind.", "verified": true, "helpfulness": "2/2", "author": "Drew Anderson"}, {"rating": 4.0, "review": "Opening the remote's battery compartment was quite a struggle.  Hopefully don't have to do it for some time.The Android remote app doesn't work ... yet.  Maybe I need to turn on MulticastingAble to fit the stick on the TV's HDMI port with the extension cable provided, nice!Wish I didn't have to sit through the \"Help\" video on first install.SEARCH is your friend when finding your fav show/movie.Streaming quality is good.", "verified": true, "helpfulness": "0/0", "author": "MT \"MT\""}, {"rating": 5.0, "review": "The Fire Stick is easy to setup and everything loads in very fast.", "verified": true, "helpfulness": "0/0", "author": "Sean Ryan"}, {"rating": 5.0, "review": "impressive.  as intuitive as netflix and even better at finding similar shows to those you like.  This is a very well thoughout and engineered device/service.  Even the automatic screensaver is beautiful.  got to figure out how to make the screensaver stay showing for longer though!", "verified": true, "helpfulness": "0/0", "author": "Ron Anderson \"BengalTigger\""}, {"rating": 3.0, "review": "its easy to setup and use.  major point, does not allow you to stream content from your computer.", "verified": false, "helpfulness": "0/0", "author": "Eric Miller"}, {"rating": 4.0, "review": "Everything seems to work fine but the synchronization with lips and sound are off a little", "verified": true, "helpfulness": "0/0", "author": "Roger Allen Craddock"}, {"rating": 5.0, "review": "Like it. It is very easy to use, very easy to set up, works on all our TVs, and our PC. Fast, and improved navigation from other products that offer Amazon streaming video.", "verified": true, "helpfulness": "0/0", "author": "blossom"}, {"rating": 4.0, "review": "So It looks real easy to set up but how do you open the remote to insert the batteries?", "verified": true, "helpfulness": "0/0", "author": "SPARKYMOM"}, {"rating": 2.0, "review": "Great interface, really nice. Unfortunately, even at 10mps unimpeded, it says my connection is too slow. FYI: two year old Apple TV still streams fine.  This is a shame, too, because I want to use my Prime membership to watch movies and TV. Thankfully, I can still order DVDs and get them in two days with Prime. But this stick is a non-starter.", "verified": true, "helpfulness": "0/0", "author": "J. Head \"addimac\""}]