[{"rating": 5.0, "review": "This thing is a great deal and, because it's android, you can load KODI (XBMC) onto it. I'm thinking about getting the fire box but not sure it's necessary unless you want to play games.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Easy setup, basically plug & play.... Works great...Tons of viewing choices.....I also have a R*** ...The fire stick is by far the best of the two....If I would have bought the Fire stick first I wouldn't have purchased the other device.....Delivery was fast(arrived a day earlier than expected)....W.E.R.", "verified": true, "helpfulness": "0/0", "author": "W. E. R."}, {"rating": 4.0, "review": "needs large bandwith", "verified": true, "helpfulness": "0/0", "author": "Howard D. Wolfson"}, {"rating": 3.0, "review": "Two major flaws: First, you will have to plug this thing into your wall outlet if you want to have a chance to get reception. Yet another device to plug into an already stuffed power strip. This is barely talked about in the sales literature. Second, if the device has network problems, trying to recover through the Settings does no good; you must unplug the thing and let it reboot. Other than these really annoying things it works really well and has an easy-to-use interface.", "verified": true, "helpfulness": "0/0", "author": "John B. Baker"}, {"rating": 5.0, "review": "Love the Fire Stick.  I can stream from all my various devices, phone, kindle, laptop.  Some of the channels are kind of quirky, but love the access I have to Pandora, You Tube, Netflixs etc.  Even like the screen saver.  Great little device!", "verified": true, "helpfulness": "0/0", "author": "Luv2read \"Luv2read\""}, {"rating": 5.0, "review": "Wonderful! I would highly suggest the 16 gb version, however. Bright, very clear HD. CAN SEE pimples on teen actors faces! Very easy to use. Fast.", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 5.0, "review": "Love my fire tv stick!", "verified": true, "helpfulness": "0/0", "author": "Kelly Matthews \"webdiva69\""}, {"rating": 5.0, "review": "Wow! Amazing. Should have gotten this long ago. Easy to set up right out of the box. Love, love, love it!!!! If you are on the fence....you should get it!!!!", "verified": true, "helpfulness": "0/0", "author": "TDW"}, {"rating": 5.0, "review": "It's great, Wish I had purchased it sooner.", "verified": true, "helpfulness": "0/0", "author": "Emy"}, {"rating": 5.0, "review": "I had to buy a stronger router/modem but after that no problems. I love watching entire series and new shows that are on TV today can be watched the very next night!", "verified": true, "helpfulness": "0/0", "author": "Pattie R. Deville \"MiMi\""}]