[{"rating": 1.0, "review": "I have had nothing but issues with this connecting to my wifi and have spent hours trying to get it to work. I will probably be returning this.", "verified": true, "helpfulness": "1/3", "author": "Anna Gravelin"}, {"rating": 5.0, "review": "Very impressive for the price. It isn't good for gaming. Many of those lag when playing. The full screen video part works perfectly. Could not ask for more for the money! The one thing I really wish it supported was Windows phones. The voice control app is only for Android and IOS, yuck. Overall, it exceeds my expectations.", "verified": true, "helpfulness": "0/0", "author": "Jeremy R."}, {"rating": 5.0, "review": "The Fire TV Stick has everything that I wanted.  I replaced Apple TV with the Stick, as Apple TV does not give access to Amazon Prime content. I use both Netflix and Amazon Prime (depending on content) regularly, so this is a better choice for me. The remote seems a bit cheap as compared to the highly-stylized stainless steel Apple TV remote, so hoping that it doesn't become a long-term issue.", "verified": true, "helpfulness": "0/0", "author": "Randy in PVD"}, {"rating": 5.0, "review": "I'm an Amazon Prime member and used to connect my laptop to my TV with an HDMI cable to watch Amazon Instant Videos. Worked fine except having to move my laptop and the HDMI every time was kind of a pain. With this Fire Stick, I just inserted theHDMI Stick and connected the power cable from the Stick to the Outlet. Then just find the HDMI source on your TV and it asks for you Wireless password and connects. Then just go to the menu an choose Amazon and all my saved movies in my watchlist are there. It also has Netflix, Hulu etc if you have subscription to them. I love not having to connect my laptop anymore.", "verified": true, "helpfulness": "0/0", "author": "Ritch Vernon"}, {"rating": 2.0, "review": "Fine for streaming from Amazon, Netflix and Hulu but truthfully it isn't really much use beyond that as there is (at least presently) a very limited selection of useful apps.If what you want it for is within the scope of Amazon's prime media services, or Netflix/Hulu then I think it's a reasonable buy.The usefulness of any device like this is really going to be defined by the software (apps) that are available for it unfortunately.  For me, this was/is a $20 buy.  Had I paid $40 I would have returned it...it's really not worth that price for what it can do right now.", "verified": true, "helpfulness": "0/1", "author": "Mr Legume \"63271864410\""}, {"rating": 3.0, "review": "So far, the actual device is great, in that it does what it says it does. It seems faster than my Roku and Chromecast, which isn't saying much. I am docking 2 stars because of the absolute ridiculousness that is the remote. The actual remote I guess is fine but the fact that it took me 20 mins to open the damn thing is terrible. The battery cover is on so tight I had to actually cut notches in the bottom to give traction to slide it open. Let me say that again, I HAD TO CUT MY BRAND NEW REMOTE BECAUSE IT WOULD NOT OPEN. Hey Amazon, put some finger grips on the damn thing so your customers can slide it open, or don't make it so tight. Sliding, prying, nothing worked. I actually broke a piece of metal that I used to open it at first once my finger nails didn't work. I guess 20 mins of working it fatigued the plastic. I have used hundreds of remotes and other electronics and never had this kind of difficulty before. I even downloaded the remote app but you can't connect to the device until you have selected the correct wifi network, so you are screwed unless the physical remote works.I have't played with the device long enough to say if it is all that much better than the other options out there other than it is faster than the Roku, which is my chief complaint of that device. I don't need 3,000 apps/channels. I just need it to select the 5 or 10 I use faster. If it wasn't for the remote, it would have been a much better experience. Here's to the batteries lasting long enough that I don't have to deal with the remote any time soon.", "verified": true, "helpfulness": "3/3", "author": "James Booker"}, {"rating": 1.0, "review": "Total Failure Right Out of the Box (boxes, we got two of these turkeys) ... WOULD NOT CONNECT TO WI/FI ... after three failed attempts to have this FireTV Stick connect to our Wi/Fi router, we gave up on them. Yes, we made double sure that we entered our correct password to our correct router.Next day we tried again, changing passwords, moving routers, LOTS of attempts. Sort of got one semi-working BUT what a piece of JUNK. VERY POORLY DESIGNED.VERY BUMMED that these did not work, as they appear to be a good idea. CAN NOT RECOMMENDED THESE AT ALL TO ANYONE.", "verified": true, "helpfulness": "2/4", "author": "Timothy S. Shropshire \"'rangsmith\""}, {"rating": 5.0, "review": "I love this Fire Stick. The use and picture quality are great!!", "verified": true, "helpfulness": "0/0", "author": "Randall Cullar"}, {"rating": 4.0, "review": "Nice little device, decent interface, I guess it's portable but if you still need an AC outlet how is it really different than a Roku or any other streaming device? Really like the music option of the digital music showing up that I've purchased, and the song lyrics playing was a cool feature too.Fire TV Stick wasn't fitting real easy into either TV's HDMI ports, felt like I was going to break it trying to push the stick in to the port. Not sure what's up with that because it was a problem on both TV's.So far both Fire Sticks have worked with no issues to report, but I've only had them for a few days.", "verified": true, "helpfulness": "1/1", "author": "theshawn"}, {"rating": 3.0, "review": "I agree with the other reviewers that have had connection problems.  My tv is just a few feet from the wifi access point. The fire tv stick has a strong signal when it connects (seems to prefer the 5 ghz band), but so far I have had a couple of random drops that require a power cycle reset.  Otherwise, it will just sit there acting like its buffering the stream forever.  When I reset it, it wants to restart the wifi setup (enter password), but then mysteriously remembers the password and goes to the home menu.  When it's working, the streaming works well.  So four complaints:1. Drops connection sporadically requiring power cycle to reset.2. Remote key presses are sometimes misinterpreted as multiple key presses or button hold down behavior making navigation erratic.3. Music playing in the background doesn't always stop/pause when another app is running.  For example, I paused a stream in the shotime app and the amazon prime music started blasting away through the tv speakers.  This happens even when I think the music has been paused.4. Shotime app doesn't load the thumbnails for the different shows and you need the thumbnails to access the content.  Once you have guessed at the correct selection, the streaming works fine.", "verified": true, "helpfulness": "0/0", "author": "R. Brown"}]