[{"rating": 3.0, "review": "Despite having a cleaner GUI than the Chromecast, I've experienced video playback issues with Netflix and Hulu Plus. Random intermittent gray screen for a few seconds has been annoying. Problem are not resolved by plugging directly into TV, I'm lucky that it works through my receiver. Additionally, I have not been able to fully experience the full range of audio with the device's limited functionality with receivers.", "verified": true, "helpfulness": "0/0", "author": "Jacob B Gardner"}, {"rating": 1.0, "review": "what a pile of crap.  i have both the fire tv and the fire tv stick and the firetv stick is total junk.  after  installing it and connecting it to my network and downloading and installing the update it will no longer connect to my wireless network.  amazon you have one pile of s*** here.", "verified": true, "helpfulness": "0/0", "author": "pap"}, {"rating": 2.0, "review": "It worked 2 times then nothing!", "verified": true, "helpfulness": "0/0", "author": "Smilin Jack"}, {"rating": 3.0, "review": "Had to buy a lot of tv series that we normally watch with amazon prime...after seeing that we cannot cancel our cable subscription which was the point of purchase I was disappointed ...other than that it was easy I set up and use.", "verified": true, "helpfulness": "0/0", "author": "Cherie Ann Dibler"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "We have had the fire stick for just over a month and love everything about it, except some of the older movies for example Mary Poppins have to be rented rather than streamed for free.", "verified": true, "helpfulness": "0/0", "author": "Ashley Ragsdale"}, {"rating": 4.0, "review": "Only used it twice so far.  Very easy set up.  Easy to use and to find what you are looking for.  So far I love it! If I have any issues I will rereview it.  Only gave it four because I haven't had it long enough to say whether there are any major problems.", "verified": true, "helpfulness": "0/0", "author": "P. Stewart"}, {"rating": 5.0, "review": "as advertised, worked right out of the box, easy setupj.", "verified": true, "helpfulness": "0/0", "author": "Daigh Tufts \"Lance Manly\""}, {"rating": 5.0, "review": "Once I conquered opening the battery compartment for the remote (push REALLY, REALLY HARD as you slide it open), I found the Fire Stick to be very easy to hook up and use.  I have a subscription to Amazon Prime and also Netflix, so there's plenty of things for me to watch.  It would be great if I could get all of the apps I have on my Kindle Fire HD.I've been using the Fire Stick almost every day.", "verified": true, "helpfulness": "0/0", "author": "B. C. Horvath \"Tina\""}, {"rating": 2.0, "review": "Does this device work out of US?I have a Prime membership and it does not work in my country.", "verified": false, "helpfulness": "0/1", "author": "Pedrink"}]