[{"rating": 5.0, "review": "EXCEEDED my expectations!! I have 2 Fire sticks and the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 5.0, "review": "Love!!!", "verified": true, "helpfulness": "0/0", "author": "L. Matthews"}, {"rating": 2.0, "review": "This thing is a bigger pain than it is worth. More often then not I get a big blue screen on it claiming  an \"HDCP Unauthorized Content Disabled\" violation. Seriously? I have to unplug it from the tv and the power. Sometimes that works but other times I have to sign out of all my accounts and sign back in. I love my Roku though. I've never had a problem with it and it has more to offer.", "verified": true, "helpfulness": "1/2", "author": "Wanda"}, {"rating": 5.0, "review": "We LOVE the fire stick!  I use it every day..I never even watch live TV anymore and I'm canceling cable!  I definitely recommend it!", "verified": true, "helpfulness": "0/0", "author": "Debbie"}, {"rating": 5.0, "review": "Best invention ever. Being tech illiterate I went years complaining about having to watch Prime Movies on my PC. Not my TV. Then I discovered Firestick & it's so easy to hook-up. Only downfall is I have satellite internet connection & watching prime movies on my large flatscreen really eats up my allowed monthly bandwidth. But I get free usage from midnight to 5:00 am so that's what I do most of the time.", "verified": true, "helpfulness": "0/0", "author": "GAM \"Movie Buff\""}, {"rating": 5.0, "review": "Pretty amazing for the price!...even though everyone has a few devices with some of the functionality already built in, this is definitely worth having.", "verified": true, "helpfulness": "0/0", "author": "Devon J Meyer"}, {"rating": 5.0, "review": "This is a great quality product. my daughter loves it and i will be subscribing to Prime. I switched from DirecTv  and am sooo happy i did!", "verified": true, "helpfulness": "0/0", "author": "nickko nunez"}, {"rating": 5.0, "review": "Makes streaming movies and shows super easy!", "verified": true, "helpfulness": "0/0", "author": "Debra De Zego"}, {"rating": 5.0, "review": "This fire stick is amazing! I was surprised at the many features, no need to even watch regular tv again.", "verified": true, "helpfulness": "0/0", "author": "Amalia Martinez"}, {"rating": 4.0, "review": "Works well in the hotel, Connection a little slow but once connected it works well", "verified": true, "helpfulness": "0/0", "author": "Tom Shelton"}]