[{"rating": 4.0, "review": "Amazon FireTV StickI ordered the base unit without the voice control remote. I did install the free Amazon fire TV app on my android phone. The Stick is capable of working with Amazon prime, Netflix, Pandora and many other services. Plus games, music, photos and more. I plugged mine into my A/V receiver but it should work the same plugged into your TV. It gets its power from a USB port on the side of the stick. If your equipment has a USB port the power can come from that. But it seems to need a little more power than a standard USB. It comes with a small wall power plug to USB adapter. When I plugged it into my A/V receiver's USB it did work but warned me it would work better with the included power adapter. It also failed to do an update when power came from the A/V receiver. Although everything else seemed to work ok. After using the included wall power adapter the update went fine.The menu system gives Amazon preference which is not surprising. The menu is laid out along the left side of the screen. Movies, music, watch list, new releases, etc. these are all from Amazon. There is also a home choice. From Home you access Netflix, Hulu Plus, Pandora,,etc.  So you could think of it as having Amazon services on the first tier of the menu and the other services on a second tier.The navigation controls are very responsive. I like the remote layout. It's very much like a Roku remote in size and layout. The big difference is there is no ok button. Instead it has a more conventional arrangement of a select button in the center of the navigational up, down, left , and right buttons. Video and sound quality are very good.I have not had any video stuttering or any other artifact showed up. One feature I did like was adjusting the screen to your monitor. When I first used it, it displayed 4 symbols at the edge of the display, at the top, bottom, left, and right side of the screen. You can then adjust it so the picture is sized right for your monitor.As mentioned there is an android app. iOS coming soon they say. It turns your android device into a fully functional remote with voice control. You must turn on the androids Wi-Fi for it to work. It does everything the basic remote does plus adds voice search. The voice search works very well. The voice search always searches  Amazon. In other words if you're in Netflix browsing and you use voice search it takes you to the video but in Amazon video not Netflix. You can use voice search from anywhere but it always searches Amazon.Video playing features: If watching a series it will auto play the next show after a small wait. After watching a movie or at the end of a series it will recommend similar movies/series.So far I've had it freeze up while navigating the menus a few times. This happened while quickly pressing the nav buttons. I've had no problems while watching videos. I had to unplug the power to reset it. As this is a brand new product I don't find this terribly concerning as many manufacturers seem to release products before their time and fix them with updates. So I assume this will get better with age. If not, then I recommend installing it so you can either get to the the Stick or the power plug easily making resetting easier.", "verified": true, "helpfulness": "1/1", "author": "Craig Youngman"}, {"rating": 2.0, "review": "I tried this on 2 separate TVs with the USB plugged into the TV for power. Both times the device kept restarting without moving beyond the Fire TV logo. I haven't tried with the USB cord plugged into a power brick yet. My power strip is full so I was really hoping the USB power would be enough. This is the reason why I'm rating this at 2 stars. The process to get this working is not as smooth as I was hoping.Also, the port for the USB cord on the side of the stick is in an awkward position. If you have multiple HDMI ports next to each other, then the Fire Stick would need to be on the very right so that the USB cord does not interfere with other HDMI cords. They include an HDMI extender in the box, and I think it's there to help with this issue.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Took 2 minutes to set up right out of the box. So far, it has worked perfectly!", "verified": true, "helpfulness": "0/0", "author": "Hawk Golfer"}, {"rating": 5.0, "review": "GREAT ITEM FOR THE PRICE", "verified": true, "helpfulness": "0/0", "author": "Truong V Dinh"}, {"rating": 5.0, "review": "Very responsive. Great streaming Netflix/Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Shawn Powers"}, {"rating": 5.0, "review": "LOVED it! Works better than my Roku ever did. Great speed, easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Katlyn"}, {"rating": 5.0, "review": "Very quick setup!  This replaced my Google Chromecast.  Very easy to use and navigate menus.  My daughter loves the game so I'll probably have to order game remote.  Overall very satisfied.  So good for $19.99!", "verified": true, "helpfulness": "0/0", "author": "Andy Anders"}, {"rating": 4.0, "review": "love it, basically a smaller less expensive version of our fire tv", "verified": true, "helpfulness": "1/1", "author": "Savana Kretchmar"}, {"rating": 4.0, "review": "So here are the streaming devices our family currently has:Roku 2100X XDSRoku 2 XS3rd gen Apple TVVarious streaming blu ray playersPS3Amazon Fire TVAmazon Fire TV StickThese are the services we use:iTunesAmazon Instant Video (Prime also)Netflix StreamingHulu PlusVarious Cable TV related appsIn the end the our favorites are the Apple TV and the Amazon Fire products including the Fire Stick.We originally liked the idea of Roku until we realized that over time, Roku does not allow updates to the apps on older models.This effectively forces you to but the newest model of the Roku to get updates to apps.  It's one thing for the Roku operating system but for the apps, this is unreasonable.  This does not seem to be the case with the other devices.  As least at this time.  They are also all cheaper than the higher end Roku devices.  But I'm digressing, if you primarily use the more mainstream apps like Netflix and Hulu as well as Amazon related media, than the Fire TV stick is a no brainer to me.  It's cheap and it's fast.  We liked the Fire TV enough (it originally replace one of our Roku's) that we got another one to replace our other Roku.  The Fire Stick and Fire both stream things much faster than our other devices...including our Apple TV but we have lots of Apple devices so that's why the Apple TV is in our top three.  In any case, I think that's the main reason to get the stick over other devices aside from the relatively cheap cost is the speed.  It was always annoying how long it takes to load videos.  And i think the only real difference between the Fire Stick and the Fire TV is the voice recognition remote.  We really don't use that function on the Fire TV so it wasn't a lost to use.", "verified": true, "helpfulness": "2/3", "author": "RKC"}, {"rating": 4.0, "review": "I have only had it a few days but I think its pretty great. The GUI is slick and fast. Only thing I didn't like was that I was hoping to power it with a USB port on my TV but the stick didn't like it and wanted an AC power source.Not a big deal I guess.", "verified": true, "helpfulness": "1/1", "author": "Todd Wagner"}]