[{"rating": 5.0, "review": "Great product. I use it all the time.", "verified": true, "helpfulness": "0/0", "author": "Dennis Zaremski"}, {"rating": 1.0, "review": "Not impressed.Have to log in through amazon for everything. Don't have to do that with crome", "verified": true, "helpfulness": "0/0", "author": "Scott Ponder"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Joretta Zajicek"}, {"rating": 4.0, "review": "Great purchase, good price for an alternate to roku. Has all the apps I was hoping it would.", "verified": true, "helpfulness": "0/0", "author": "Michael J Kuklinski"}, {"rating": 4.0, "review": "Great product especially at the price.  If you're an Amazon Prime user it's a must purchase.", "verified": true, "helpfulness": "0/0", "author": "Chad E. Maupin \"Chad Maupin\""}, {"rating": 5.0, "review": "This thing is fast! The menus and and remote are super responsive. Everything just works instantly and as advertised.The only downside was our TV's USB hub was not powerful enough to support the device and I needed to use the supplied power cube.", "verified": true, "helpfulness": "0/0", "author": "Aaron S. Talbot \"_aaron\""}, {"rating": 5.0, "review": "The Fire Stick is convenient and so much fun! I installed it myself. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "angelaugh"}, {"rating": 1.0, "review": "This product does not work through my Onkyo TX-NR3100 stereo receiver.  ChromeCast does.  Technical support said that it will not work with the HDMI Port on the receiver.  The Fire Stick would have to be plugged into the tv and then I would have to run an optical cable out to the receiver for sound or use the TV speakers.  I would have to use 2 remotes to and change settings on the receiver and the TV to make that happen and change them back to watch cable /dvr or Blu-ray.  Too much effort, Chromecast works fine through the HDMI port on the receiver.  If I want to watch Fire TV I will just plug my laptop into the tv.", "verified": true, "helpfulness": "0/0", "author": "edward j walsh"}, {"rating": 4.0, "review": "Great addition to my prime membership.", "verified": true, "helpfulness": "0/0", "author": "Beth Salamone"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Kevin Curzon"}]