[{"rating": 5.0, "review": "Liked the Fire TV so much I ordered this for my 2nd TV, works just as good as the regular Fire TV minus the voice remote", "verified": true, "helpfulness": "0/0", "author": "Bassetbob"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 4.0, "review": "I wish this device be capable connect to an ad hoc wireless network", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "Very happy!!", "verified": true, "helpfulness": "0/0", "author": "JHANKS"}, {"rating": 4.0, "review": "I like the remote control, its easy to navigate through.  The only reason I don't give it 5 stars is no YouTube. My kids are big on watching things on YouTube.", "verified": true, "helpfulness": "0/0", "author": "M. Whitfield"}, {"rating": 3.0, "review": "Interface a little cumbersome to use. Issues mirroring my devices.", "verified": true, "helpfulness": "0/0", "author": "Danny Beighley"}, {"rating": 5.0, "review": "Loving this thing so far", "verified": true, "helpfulness": "0/0", "author": "Montel"}, {"rating": 5.0, "review": "This little guy is amazing! Love it!", "verified": true, "helpfulness": "0/0", "author": "Katie G"}, {"rating": 5.0, "review": "Just what they advertised. Turned my TV into a smart TV. Thx", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 2.0, "review": "I've been using my FireTV stick on and off for about a month now. Bottom line, when I first got it I used it often and now I use it very little because it only occasionally works.  Here's a list of the good versus the bad:The Good:The remote is really easy to use and helpful. I wish more remotes took the minimalist approach and gave me a set of really useful buttons. It's also an RF remote by necessity so you can have it pointed in any direction and it works.Accessing Amazon Videos is much easier than on any other device. I've used Amazon Video on my computer, PS4, Wii, etc. This is by far the easiest interface to use.The bad:First thing is that you should plug the provided usb adapter in. My TV, like any well designed TV, shuts down the HDMI ports when I'm not displaying whats on them. This means that it doesn't update and takes forever to startup if you don't provide power. Not a big deal but important.Second Amazon Video is front and center, the rest of the menu is less intuitively designed. Apps are hidden several menus away from the most popular/editor's choice apps. It's workable but my Roku has better menus.Lastly, the biggest problem I have with this and the reason for the poor review, is that it has trouble performing is primary function, displaying video. Like many I get the BSOD when playing videos. I've attempted to resolve the issue by disconnecting and reconnecting the FireTV, and power cycling my TV. This doesn't work. I usually have to wait a few days for the issue to resolve itself. This is a result of poor design rather than what the FireTV Stick is plugged into. I regularly play blu-rays off of a PS4, my HTPC, and a finicky blu-ray player. I don't have any other device that has trouble with HDCP. The occasionally have an issue, but stopping and restarting playback almost always resolves the problem. The fact that the \"resolutions\" involve power cycling everything with a wire connected, regardless is totally unacceptable, at most just the FireTV should be power cycled (which isn't particularly easy).Amazon has been indicating that they're working on a fix for this problem, it's been 3 months since the FireTV has been released and no fix. It would seem that Amazon Corporate is far more concerned about the profits from the device than it is about well designed products and happy customers.", "verified": true, "helpfulness": "0/0", "author": "David Pruitt"}]