[{"rating": 4.0, "review": "Fire stick opens a whole new tv watching experience.", "verified": true, "helpfulness": "0/0", "author": "mark campbell"}, {"rating": 5.0, "review": "Love it !!!!!", "verified": true, "helpfulness": "0/0", "author": "Ruben"}, {"rating": 5.0, "review": "Very pleased with this product. I do wish I could have plugged it into a surge protector...but it would only work plugged into a wall socket.", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "This is the best investment I have made. I am enjoying all the shows. We did need to upgrade our internet to eliminate the streaming issues, but I am still saving over $100a month in what satellite was costing.", "verified": true, "helpfulness": "0/0", "author": "C. Rossi \"cool granny\""}, {"rating": 2.0, "review": "Disappointed it can't yet stream from computer or even use apps like CW (Arrow!). Nail that down this is great alternative to Chromecast. However, still using chromecast right now.", "verified": true, "helpfulness": "0/0", "author": "Rory"}, {"rating": 3.0, "review": "It is a great easy to use product but I have Xfinity and the apps don't work with my cable provider.", "verified": true, "helpfulness": "0/0", "author": "zachariah"}, {"rating": 5.0, "review": "This product is fantastic, I really enjoy the interface. Makes it very easy to use any number of apps and can switch easily between them. I would recommend to anyone who doesn't have a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Kelsey"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Tiffiney D. Pearson \"Tiff\""}, {"rating": 4.0, "review": "Fire TV Stick is easy to maneuver. fast and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Manchester_United_#1"}, {"rating": 5.0, "review": "I did't use my XboxLive account to play games and thought it wasn't worth keeping XboxLive in order to access Netflix or other apps. The fire stick is pretty fast. Faster than the 360 . I don't have to pay for a service like Xbox live for it to work. I don't have to have Prime to make it work but I think having Prime is a worth while service.  I am very pleased with the Fire stick .", "verified": true, "helpfulness": "0/0", "author": "Joseph D Shafer"}]