[{"rating": 5.0, "review": "Good product.", "verified": true, "helpfulness": "0/0", "author": "Mary K. McSweeney"}, {"rating": 5.0, "review": "it was a gift for my husband, he really enjoys it", "verified": true, "helpfulness": "0/0", "author": "granny Nan"}, {"rating": 3.0, "review": "To use this you have to be the PRIMARY prime amount holder.  We updated to primev and still had to buy a lot of the movies we wanted to watch ( this could be done with out a fire stick)", "verified": true, "helpfulness": "0/0", "author": "Joshua Monfreda"}, {"rating": 4.0, "review": "Pretty good streaming device, especially considering the price point. The interface is a bit clunky and I have noticed a tiny bit of lag between the video and audio, but this may have to do with my 720p, 60hz TV instead of the Fire Stick. Most of the apps that I use on my Apple TV are included here (Netflix, Hulu, Youtube), with the added benefit of streaming Amazon Prime, which is not available on Apple TV (unless you mirror from your iphone or ipad). I've heard that HBO Go Will be available on the Fire Stick soon, which is good news. The included controller is pretty solid and the device setup only took a few minutes. The Fire Stick itself is only about the size of your average thumb drive, but the way the HDMI ports are located on the TV in my bedroom, I have the use the included HDMI extender to plug in the device. It was a very smart move to include this on Amazon's part!I have enjoyed the Amazon Fire Stick quite a bit and would recommend it to anyone looking for an inexpensive, no-frills streaming device.", "verified": true, "helpfulness": "0/0", "author": "Morgan Hyman"}, {"rating": 5.0, "review": "Simply amazing and so easy to use!", "verified": true, "helpfulness": "0/0", "author": "Michelle Pursell"}, {"rating": 4.0, "review": "Need external power supply", "verified": true, "helpfulness": "0/0", "author": "Do \"toyer\""}, {"rating": 4.0, "review": "no problems, so far with the stick. connecting and setup is straight forward, connect device to open HDMI port on your TV and follow instructions.  The navigating the search function is a little funky with the standard remote but no different then any other V-keyboard design.  No buffering problems Amazon prime streaming,  nexflix did have a couple of wait/ buffering when trying to watching a movie but far better then trying to use my \"smart TV\"  I was a little disappointed that you are not able to access hotel wireless at this time (new feature this summer) but in all, this is a terrific product,  sure you are not going to be able to hack the pentagon with this device but you will be able to watch movies, access google store, listen to music and avoid high cable cost all for 39.00", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 4.0, "review": "We haven't used it yet. Been busy and etc. I really think we will enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Elma E Porter"}, {"rating": 5.0, "review": "Enjoying thoroughly,easy to use worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Jenipher"}, {"rating": 3.0, "review": "This would be 5 stars if the remote worked better.  Essentially I've had to download the app and use that as a remote.  If I was going to do that I could have saved a few bucks and bought a Chromecast.  The plus is that you do get access to your prime catalog if you are a prime member.", "verified": true, "helpfulness": "0/0", "author": "Joshua Duell"}]