[{"rating": 4.0, "review": "Does as advertised. Movies stop to reload periodically due to slow home wi-fi system, but I will recommend it to my friends.", "verified": true, "helpfulness": "1/2", "author": "Michael"}, {"rating": 5.0, "review": "I purchased this about two weeks ago and It is wonderful!  You just plug it in your TV, and power outlet, putt batteries in the remote and you are on your way. I've used it for Netflix and Amazon prime. Instructions are simple, picture is great.  I love the simplicity and the mobility.  As long as you have wireless connectivity, it works.  I would definitely recommend this product.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer \"Bookworm\""}, {"rating": 1.0, "review": "Poor connection, buffers a lot.", "verified": true, "helpfulness": "1/2", "author": "Shannon Mendenhall"}, {"rating": 5.0, "review": "Love it... Cutting the cable little by little", "verified": true, "helpfulness": "1/1", "author": "tom73837"}, {"rating": 5.0, "review": "Used the Fire TV box for two weeks and the main reasons I selected this box over the Apple TV box have already been confirmed. The remote is great, extremely responsive and works no matter where you point it due to the Bluetooth connection. Also, the box is much faster loading and switching apps compared to the Apple TV box. I'm planning to buy 1-2 more for our other bedrooms.", "verified": false, "helpfulness": "1/1", "author": "Brian"}, {"rating": 5.0, "review": "Installed in minutes and easy to use", "verified": true, "helpfulness": "0/0", "author": "Mike Wickline"}, {"rating": 5.0, "review": "I must say, Amazon has just struck GOLD with this! Stream TV at it's finest, minimum to little buffering, clear picture. Extremely impressed with all the features and overall performance!", "verified": true, "helpfulness": "1/1", "author": "Geoffrey Matthews"}, {"rating": 5.0, "review": "Wow!  Music, Movies, YouTube, & I've just gotten started.", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Travis"}, {"rating": 5.0, "review": "Amazon you knocked this one out of the park! From receiving it quickly, from the packaging, to installing it you hit a home run. The features and quality are awesome. It's a very pleasant experience.", "verified": true, "helpfulness": "0/0", "author": "Roger Biddle"}]