[{"rating": 5.0, "review": "Only had this 1 day, but so far it's working great.  I mainly use this for plex (cost $5.00 to activate on fire stick) which has not lagged or skipped at all so far.  I stream mkv, MP4 and avi videos of different sizes, some up to 12GB in size, with no issues.  I like the interface of the fire stick, but it can be more organized.Netflix, pandora and Amazon prime videos/music work fine so far also.  The games are a nice plus, as they are a good time killer.  If the fire stick continues to work good, I will be getting another.Also noteworthy, I have the fire stick plugged into a soundbar, not directly into the TV.  Setup was a breeze,  took about 7 minutes.  Definetly recommend this so far", "verified": true, "helpfulness": "0/0", "author": "andrew \"\\\\andrew\""}, {"rating": 5.0, "review": "Love that when you buy an Amazon device your account is already preinstalled and ready to go!,", "verified": true, "helpfulness": "0/0", "author": "Leilajake"}, {"rating": 4.0, "review": "nice product. I bought it on presale and got a good deal. This technology changes so rapidly, I wish Amazon would provide a trade in program to allow existing users to upgrade.", "verified": true, "helpfulness": "0/0", "author": "Mike Peters"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Marissa Matty"}, {"rating": 5.0, "review": "Pretty slick device!  Streams pretty decently, although I've gotten some interruptions along the way, not sure if it's my wifi or the stick itself.But it's pretty feature packed and super easy to use!", "verified": true, "helpfulness": "0/0", "author": "EricF \"--EricF\""}, {"rating": 5.0, "review": "just works fine – I previously bought the box when stick wasn't available. This does the job perfectly at a lower price. Press tab", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great, even for an old geezer like me.", "verified": true, "helpfulness": "0/0", "author": "Thomas R. Watkins, Jr."}, {"rating": 5.0, "review": "Works great having lots of fun", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "Very handy", "verified": true, "helpfulness": "0/0", "author": "Traveler"}, {"rating": 5.0, "review": "I love it I haven't used my cable since I received it. Super easy set up!", "verified": true, "helpfulness": "0/0", "author": "Georgia"}]