[{"rating": 1.0, "review": "I bought 2 of these and one of them does not work properly. It will connect with problems or never connects at all. It's only 5 to 10 feet from the WiFi.. wait until the second revision!", "verified": true, "helpfulness": "1/1", "author": "Eddie"}, {"rating": 5.0, "review": "I already own Amazon Fire TV and love that for Amazon Prime Video & TV. I too was fortunate to order one of these as soon as it was announced. As an Amazon Prime member like most of you, I was able to buy the Fire TV Stick for $19 during a two day sale. For that price, I figured, I might as well test it out! - Having said, I must admit for mere $20 this Fire TV Stick is an Awesome value product. Amazon has indeed made an excellent streaming media player for the masses and most cases works better than the Amazon app included in most big screen TVs.What I expected I got - Thank you Amazon for an amazing value product, now I can have the same capable streaming media player experience in my bedroom what I have been using all these days in living room via Amazon FireTV. Granted Amazon FireTV has Optical Audio out which integrates well into my 5.1 surround sound system but this one is perfect for the second TV in your household.PROS[+] Excellent quality product[+] (Advanced Streaming And Prediction) works great in pre-buffering and no lagging or spinning circles for the video to load[+] Better than chromecast in most respects and this one includes Remote![+] Includes all necessary hardware including power adapter, USB cables, HDMI extension cable, AAA batteries[+] PLEX app works great and can be used for streaming personal local media files from PLEX server[+] Netflix works perfectly[+] YouTube works greatCONS[-] No voice search since the included remote is not capable of that (you can always pair a voice search capable remote)[-] Little difficult to open the battery compartment of the included remote (minor quibble)Amazon FireTV stick is a very capable product and has a nicer user interface that everyone in your family can enjoy Prime shows & allows kids to play casual gaming on large screen TV.Overall I am pleased with this product and rating this with Five Stars!", "verified": true, "helpfulness": "0/0", "author": "rbhatta \"A Dinosaur you can trust!\""}, {"rating": 5.0, "review": "This is a great device!  Works just perfect if you have a good internet connection. I really like how I can use my phone to control it also!", "verified": true, "helpfulness": "0/0", "author": "Linda Golden"}, {"rating": 5.0, "review": "Really convenient.  Just plug it into the back of your smart tv and start watching prime movies and TV shows.  I also like the option of taking this with me anywhere especially family members home during the holidays. Watched a few movies on it already and the quality was good. So guess that means it picks up wifi signals well. Happy with the firestick.", "verified": true, "helpfulness": "0/1", "author": "Rivbea"}, {"rating": 4.0, "review": "I like this a lot better than google chromecast, there's a lot more features offered and it's very small and sleek. The only downside is that it randomly loses internet connection and stops playing right in the middle of a movie or tv show. I know it's not my internet because very often I take my work home and am using my laptop when the service drops, my laptop has internet connection, fire tv stick doesn't, it's a no brainer that it isn't my internet providers fault. I still like it though, very fast when it does connect to the internet, and even formats the picture before you play your first show, so it's precise to your screen and viewing requirements. I would five the fire tv stick five stars if there wasn't the common connectivity issue.", "verified": true, "helpfulness": "0/0", "author": "Krysta"}, {"rating": 5.0, "review": "Love this! Thankful for the Prime early purchase price.", "verified": true, "helpfulness": "0/0", "author": "Doc Marine"}, {"rating": 5.0, "review": "Absolutely the best deal we've had in a long time.  Because our Internet service is slow and unreliable, our Netflix just won't stream properly and our provider, Cincinnati Bell, says they never should have sold us 'high speed internet' because we are too far out (after how many years of collecting our fees????)  The Amazon Fire TV Stick gives us the usability to keep us unplugged from satellite.  We are VERY happy and I've recommended this product and Prime TV to a number of co-workers who are tired of poor internet service.  Couldn't be happier.....", "verified": true, "helpfulness": "0/0", "author": "Hometown Girl \"Kathy\""}, {"rating": 5.0, "review": "*happy dance* OMG.....I LOVE IT!! love, love, love! Get it! Everything is included to get set up in five minutes or maybe seven minutes. I'm so happy with it!! You won't regret it. The only thing you need is HDMI port on your tv and a wi-fi network.", "verified": true, "helpfulness": "0/0", "author": "Mary Dixon \"Spider Woman Web Design\""}, {"rating": 4.0, "review": "Pleased with overall operation and ease of use, including Apple Ipod Touch remote app. All apps/channels that we use, such as Hulu+, Amazon PRIME, and Netflix work fine. Not pleased that the recommendation is to have USB powering, however, it appears to run okay with the USB port power on the HDTV (close by).Would love to have the anticipated/promised ability to log into Hotel networks, which is why we bought this device (for travels). Until then, it's not that much different than a Roku stick in terms of high level functions.", "verified": true, "helpfulness": "1/1", "author": "SuchaGoodDeal \"Rick\""}, {"rating": 5.0, "review": "I really love this!  I grabbed a couple of these to put on my tv that dont have internet access. Now we can watch Netflix and Amazon Prime movies from all the tv. Wanted to get a couple more for holiday presents but they are all sold out.", "verified": true, "helpfulness": "0/0", "author": "Randz"}]