[{"rating": 5.0, "review": "The fire TV stick was easy to start using as soon as I received it. I can get more movies and old TV show  I miss seeing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A great device, easy to use and install. Wish the remote was a little bigger or had a light for in the dark.", "verified": true, "helpfulness": "0/0", "author": "Harold Rose"}, {"rating": 5.0, "review": "My boyfriend, who has a smart TV, said, \"why did I even buy a smart TV, when I can spend 40$ on this!?\" So, I feel pretty good about my purchase. It works very well, it's user friendly, it's highly responsive and it's way faster than smart TV's. The setup is easy, there's a video that shows you everything.I am incredibly pleased.", "verified": true, "helpfulness": "0/0", "author": "Eparkison"}, {"rating": 4.0, "review": "Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Theresa Bradley"}, {"rating": 3.0, "review": "Good product, easy to install and operate. The product gets 5 stars but loses 2 of them due to a really poor setup for finding shows. I have had it for a few weeks and to be honest use my computer to find shows, attach to watchlist and then watch using Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 2.0, "review": "well, it is easy setup, and it does work well to find all options for watching what you want to see...BUT-  this thing is not fast, nor does it stream well.  I have it less than 10' from my router, nothing between them, and it jumps and freezes and puts up warnings that my internet is too slow to work well.IN THE MEANTIME - my AppleTV is downstairs from this, with a number of items between it and the router, including the floor/ceiling, and nothing seems to slow it down.Tell me again how good this is....would you?  I'd not buy it again.  I'm pretty disappointed in the product.", "verified": true, "helpfulness": "0/0", "author": "Jack B. Frost \"JB\""}, {"rating": 5.0, "review": "Worked like a charm. Easy to set up and use. More options than Apple TV. Cheaper too. Much smaller device also.", "verified": true, "helpfulness": "0/0", "author": "Rae"}, {"rating": 5.0, "review": "Excellent device. Just wish it had better photo and file showing capabilities like web browsing and drop box. I'm a photographer and was hoping to use this for portfolio showing aside from Netflix. But amazing product over all if movies and music Is your only use out of it.", "verified": true, "helpfulness": "0/0", "author": "Eddy Esmail"}, {"rating": 5.0, "review": "Really like it. Works very well.", "verified": true, "helpfulness": "0/0", "author": "perk"}, {"rating": 5.0, "review": "Love it. No issues.", "verified": true, "helpfulness": "0/0", "author": "JackyAGLUV"}]