[{"rating": 5.0, "review": "Easy to install and operate.", "verified": true, "helpfulness": "0/0", "author": "Sami"}, {"rating": 3.0, "review": "Not working or my network?? Watched 2 movies then won't connect", "verified": true, "helpfulness": "0/0", "author": "Debra Larsen"}, {"rating": 2.0, "review": "Buttons stick on remote they arnt stuck physically im guessing its something wireless also the wifi keeps saying connected with problems not allowing me to load anything", "verified": true, "helpfulness": "0/1", "author": "Jeffrey Payne"}, {"rating": 5.0, "review": "This Fire TV Stick works great with Wifi and we love it! Would recommend it to anyone wanting to be able to watch Netflix on a TV in another room without a bunch of wires to get in the way. Of course, there are many other services you can get with it, but we just use it for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Kathryn J. Godwin"}, {"rating": 5.0, "review": "This is even better than the latest Roku, which I have. I set this up in our bedroom but when I started using it i found out it was better than my Roku 3 so I swapped it out. The Roku is now in the bedroom and the Fire TV Stick is in the living room.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "LOVE being able to get to what I want to watch so quickly. It has been so nice, the kids like it. The music portion is great, love the parental controls.", "verified": true, "helpfulness": "0/0", "author": "Loertscherlady"}, {"rating": 5.0, "review": "love the variety and image quality", "verified": true, "helpfulness": "0/0", "author": "UManiac"}, {"rating": 5.0, "review": "I bought 2 fire sticks and they both work great. I just plugged it in and followed the instructions.", "verified": true, "helpfulness": "0/0", "author": "M. Selders"}, {"rating": 5.0, "review": "I have a Roku and Chrome stick, but I find myself using the Fire TV Stick most of the time. Great with the Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Mike D."}, {"rating": 5.0, "review": "The fire stick was a great bargain for the $28 shipped that I paid for it on sale before Christmas from a B & M store. I bought it specifically to keep from having so many boxes cluttering the front of my tv. This sits in the back and does quite well. A Roku stick is much more expensive in my experience. Main uses for this are Netflix, WWE network, and Amazon Prime streaming. WWE Network works fine, Netflix works fine and looks good. Have not tried out the amazon prime streaming yet, but I would imagine it works better on this device than my old Roku or Sony box does. I think it's quite a good bargain and is completely hidden from view. Amazon knocked it out of the park with this little device. These are great stocking stuffers or good for any occasion, really. Would love to play with future amazon devices.", "verified": true, "helpfulness": "0/0", "author": "Justin B."}]