[{"rating": 4.0, "review": "can't get hob go to work with it", "verified": true, "helpfulness": "0/1", "author": "Darlene Hollingsworth"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "ernie duran"}, {"rating": 5.0, "review": "We are enjoying the fire stick...it was so easy to set up. Great to have with prime membership.", "verified": true, "helpfulness": "0/0", "author": "artzy"}, {"rating": 2.0, "review": "I really really wanted to like the fire tv stick; I bought one for my son, in another state, for Christmas and they love it, so I bought one for myself.  It has given me little but trouble the whole time I've had it.  It took several hours to get it set up to begin working - several calls to amazon and to our cable company (each sayig it was the other's fault it wasn't working - though they each tried to help).  Finally got it working.  Hurrah!  It worked well for a day or two, but since then, it pauses every couple of minutes when playing a program or movie.  I really like it when it works, it just doesn't work consistently.  Sometimes the message on the screen says my internet is too slow (so I call my cable company and they tell me I am getting the high speed internet I am paying for, so it can't be their fault); other times the message on my screen says that there is a program error and I need to call amazon.Bottom line is that it just did not work consistently. I finally gave up last week and just hooked my kindle fire back up to the tv, with the cord; that system works just fine - never a problem with speeds or anything.  I'm sure that means something, but I don't know what it would be.  I don't know if I would recommend the firestick to anyone because it just didn't work for me; but when it did work, I really liked it.", "verified": true, "helpfulness": "1/1", "author": "Loves A Good Story"}, {"rating": 5.0, "review": "Amazingly easy to install and such a selection to choose from.", "verified": true, "helpfulness": "0/0", "author": "Dotty Cooper"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Vinny"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "a manupelli"}, {"rating": 5.0, "review": "Very happy with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "MrsR"}, {"rating": 5.0, "review": "LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "lalala.m"}, {"rating": 5.0, "review": "I had Netflix on my Wii console, but I love the fire stick. All the different things I can watch and do on there is amazing!!", "verified": true, "helpfulness": "0/0", "author": "rayetta chambers"}]