[{"rating": 4.0, "review": "This is another good streaming device ( not great).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Nice product, I'll I expected and more!!!!!", "verified": true, "helpfulness": "0/0", "author": "Thomas L Steward"}, {"rating": 5.0, "review": "Replaced my apple tv with this. Works great!", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Easy set up and operation.  Works like a champ.  Amazon Prime has a lot more current movies and TV programs than Netflix, so it gives me a much better selection on a bad TV night or between seasons on the programs I like.", "verified": true, "helpfulness": "0/0", "author": "Jess Beaty"}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/0", "author": "Tell"}, {"rating": 5.0, "review": "Really great! We have loved it and the  Remote is easier to use than some other streaming devices", "verified": true, "helpfulness": "0/0", "author": "Katy Lucas"}, {"rating": 5.0, "review": "Pleasantly surprised. Works in a hotel with a captive portal when even a Roku or a Chromecast will not.", "verified": true, "helpfulness": "0/0", "author": "Trav1856"}, {"rating": 5.0, "review": "From a value standpoint, this little gem is unbeatable.  From just what I watched for the first few hours after I plugged it in, this device has already paid for itself.  HIGHLY recommended.", "verified": true, "helpfulness": "0/0", "author": "CRYPTLORD"}, {"rating": 5.0, "review": "Love this Fire TV Stick! I take it everywhere! No more watching commercials while in hotels!", "verified": true, "helpfulness": "0/0", "author": "Tammy Bonnette"}, {"rating": 5.0, "review": "Works awesome almost same features as the fire tv and only a nitch slower but still much faster than apple tv ii.  With netflix, kodi, and amazon prime there is always something to watch.  Great price, great features just get one", "verified": true, "helpfulness": "0/0", "author": "craig m north"}]