[{"rating": 4.0, "review": "Apple TV does not include Amazon so I purchased Fire Stick. Only complaint is that when plugged in while watching cable TV, the stick interrupts the signal for a second or two every 5 minutes. Very annoying so have to unplug when not using. Not sure if there is a problem with the TV.", "verified": true, "helpfulness": "0/0", "author": "LJO \"Linda O\""}, {"rating": 5.0, "review": "Super easy to set up even for a non-techie like me!  So far, I've been catching on movies from my watchlist.  Really cool to watch on TV as opposed to laptop or Kindle Fire.  Downloads are just as quick as on demand movies.  Worth the money paid!!", "verified": true, "helpfulness": "0/0", "author": "Loretta Goodwin"}, {"rating": 4.0, "review": "good option", "verified": true, "helpfulness": "0/0", "author": "James Boston"}, {"rating": 4.0, "review": "I'm enjoying my new fire stick however I'm trying to find a way to enjoy without running out of WiFi airtime.", "verified": true, "helpfulness": "0/0", "author": "Dwayne Washington"}, {"rating": 5.0, "review": "Works Great.  Bought it for my daughter.  I just wish Amazon Prime invitees could get the movies too.", "verified": true, "helpfulness": "0/0", "author": "Bill Esposito"}, {"rating": 5.0, "review": "We've had this about a month and so far I really like it. One question I have is do I have to unplug it everytime we are done with it? Any answers would be very helpful", "verified": true, "helpfulness": "0/0", "author": "PJR \"P. Raskin\""}, {"rating": 5.0, "review": "LOVE being able to switch to movies with the flick of a button. Easy to switch back to cable/satellite, as well. Lots of great original series to watch, as well as movies, like Bosch! Just plug this in, walk through the self-setup, and sit back to enjoy your new toy!", "verified": true, "helpfulness": "0/0", "author": "Janet O'Connor"}, {"rating": 5.0, "review": "I plugged it in, signed into Amazon and Netflix and was ready to watch. This is a great product.", "verified": true, "helpfulness": "0/0", "author": "nancy graham"}, {"rating": 5.0, "review": "Supremely easy to install. Ultra-fast speed for streaming HD. A true bargain, given the various offerings and functions.", "verified": true, "helpfulness": "0/0", "author": "Eric Almeida"}, {"rating": 5.0, "review": "My husband loves this Fire Stick.  He is on there everyday and we don't have a Prime subscription yet. He loves being able to get on our Netflix so easily.  It didn't always work that great with his Xbox.  He really wants to dump our cable because of it.", "verified": true, "helpfulness": "0/0", "author": "K. L. R."}]