[{"rating": 5.0, "review": "Amazon is my latest drug. I want to quit, but this was $20 for a full on digital tv player comparable to Apple TV and Roku. They still need some more selections in Prime Movie, but they're working on it. Alexa is coming Weds. I don't know why I bought it, but I'm addicted.", "verified": true, "helpfulness": "0/0", "author": "W. Funes \"phunlee\""}, {"rating": 3.0, "review": "Lots of disadvantages compare to chromecast", "verified": true, "helpfulness": "0/1", "author": "Ramesh"}, {"rating": 5.0, "review": "This is THE BEST!  Once you're set up with KODI and running PLUTO TV, there is no reason why you need to have subscription TV.  That is unless you want live sports.  You can run android apps and everything on this.", "verified": true, "helpfulness": "0/0", "author": "C. Bowen"}, {"rating": 5.0, "review": "Super easy setup and ooeration. My wife loves it!", "verified": true, "helpfulness": "0/0", "author": "Brett E. Murri \"Grampa_Brett\""}, {"rating": 5.0, "review": "I love my Fire TV Stick!!  It was easy to set up and use.  It took me less than 5 minutes to set-up!!  The Fire TV stick apps are the same as Apple TV.  The only difference was the cost.  Apple TV is double the price.  Highly recommend this!!!", "verified": true, "helpfulness": "0/0", "author": "elizab65"}, {"rating": 4.0, "review": "These works out well.", "verified": true, "helpfulness": "0/0", "author": "catmirass"}, {"rating": 4.0, "review": "I love my fire TVs stick it's more versatile them my Wii I have more options of TVs apps", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It's not as powerful as a Roku or FireTV box (its a bit slower in navigation), but it does the job.", "verified": true, "helpfulness": "0/0", "author": "Scooby"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Furstenberger"}, {"rating": 4.0, "review": "Good product but it's surprising how limited the free Amazon film library is. You'd think they'd have more old movies available for free or a reduced price.", "verified": true, "helpfulness": "0/0", "author": "Bill Neville"}]