[{"rating": 4.0, "review": "Does everything wish it had a web browser .", "verified": true, "helpfulness": "0/0", "author": "Thomas Lind"}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "vannessa"}, {"rating": 5.0, "review": "What a cool device and better than the chromecast. I like the remote and it is quick and easy to use. My 3 year old granddaughter uses it when my wife is baby sitting her and she maneuvers the Fire Stick with ease.Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Frank J. Shipkowski \"Healthy Bookman\""}, {"rating": 5.0, "review": "This thing is GREAT! Plug it in and it's running in a few seconds. Works perfectly and how do you get this much value for the next to nothing they charge? If you haven't bought one of these, do it today. And yes, we also have cable and all that, but now this is like having a second cable box in the house.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 4.0, "review": "My only complaint is the lag when watching MLBTV and Watch ESPN. Works great for Hulu, Netflix, HBOGo etc.", "verified": true, "helpfulness": "0/0", "author": "Dennis Brophy"}, {"rating": 5.0, "review": "I'd been using my computer (an old, slow thing) to watch TV (I don't have cable) on Hulu, Netflix, YouTube, etc., and when the adapter that connected the computer to the TV broke, I started watching shows directly on my computer (small screen!).  Not to mention the other issues that arose when you have a piece of machinery that is simply Not up to par!  I'd seen the commercials for the Amazon Fire Stick and Knew That Is What I Needed!  YEA!  It was simple to set up (you will need your computer to get the start up process going) and it is easy to add more apps to the stick... very similar to what you do with your phone or tablet.  Even easier than adding new \"channels\" to a smart TV, of which I also have.  The Fire Stick remote is very easy to use as there are not tons of buttons you have to figure out and get used to.  I am beyond thrilled with my new toy and for the price it was a steal!  Enjoy!One thing I forgot to mention in my original review... The ScreenSaver that comes on the Fire Stick is AWESOME!  The pictures, of which there may be as many as 50 different ones, are OUTSTANDLY GORGEOUS & STUPENDOUS!!  It was worth the price just for the ScreenSaver pictures alone!  So, All in All, the whole package is a GR8 Deal!  Happy Watching~", "verified": true, "helpfulness": "0/0", "author": "FairyKat \"Fairy Kat\""}, {"rating": 4.0, "review": "Nice device, works well  and portable.", "verified": true, "helpfulness": "0/0", "author": "Ron F. Reed \"fritz\""}, {"rating": 5.0, "review": "I love my new fire stick!!!", "verified": true, "helpfulness": "0/0", "author": "Nathan Keelen"}, {"rating": 4.0, "review": "Works great and was easy to set up.  The only trouble I had was getting the back off to insert the batteries.", "verified": true, "helpfulness": "0/0", "author": "Rosanna Palmer"}, {"rating": 5.0, "review": "We love love love the Amazon fire stick. It works great, it is easy to use, and there is not a lot of boxes or bulk to it, which I love.!", "verified": true, "helpfulness": "0/0", "author": "BLM516"}]