[{"rating": 5.0, "review": "love it don't ever want to let it go (awesome)", "verified": true, "helpfulness": "0/0", "author": "Kenneth F Case Jr."}, {"rating": 3.0, "review": "Works ok.", "verified": true, "helpfulness": "0/0", "author": "NikoM"}, {"rating": 5.0, "review": "It is very easy to set-up and has a variety of app options.", "verified": true, "helpfulness": "0/0", "author": "Isi"}, {"rating": 1.0, "review": "So restrictime has limited as to do and the interface is all amazon.", "verified": true, "helpfulness": "0/0", "author": "albert gofman"}, {"rating": 1.0, "review": "The Fire TV Stick gives me an error message saying that my bandwidth is too low to avoid interruption (buffering) while playing.  However, I can watch the same things on my laptop with no interruption so I am very unsatisfied with my purchase.", "verified": true, "helpfulness": "0/0", "author": "T. Barrett"}, {"rating": 4.0, "review": "I own this Amazon Fire TV Stick along with Roku 2. The Fire TV Stick is much faster and sleeker looking than Roku 2. Fire TV Stick requires very few reboots should it freeze up. The Roku 2 would intermittently reboot quite often without warning. Roku 2 has a bit more choices as for contents and apps.", "verified": true, "helpfulness": "0/0", "author": "J. CHOW \"HEAVEN888\""}, {"rating": 5.0, "review": "I love my fire stick!! So much I started buying them as gifts!!! Great user interface, the set up is so ridiculously easy!! My 7 yr nephew walked into the room picked up the remote and started using it like he had used it his whole life. Just another reason to love Amazon!!", "verified": true, "helpfulness": "0/0", "author": "SandraDee"}, {"rating": 5.0, "review": "Will this work in Costa Rica.", "verified": false, "helpfulness": "0/0", "author": "Victor Julio Camacho Torres"}, {"rating": 3.0, "review": "Enjoyed getting the fire Stick,  & i am trying to get more out of it, so I am still exploring the possibilities!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Stutters in Netflix and Hulu. I put the extender on it, which helped some. ItMight be heat related? I do have the power cord hooked up. Since Netflix is the main reason I wanted the stick, I am unhappy... I will replace it soon..,", "verified": true, "helpfulness": "0/0", "author": "Stonecrop"}]