[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/1", "author": "Elda Florencin"}, {"rating": 4.0, "review": "Met my needs and was easy to install and start using.", "verified": true, "helpfulness": "0/0", "author": "Hanna"}, {"rating": 5.0, "review": "My husband and I love this product easy to use", "verified": true, "helpfulness": "0/0", "author": "arcy"}, {"rating": 5.0, "review": "Google \"how to install xbmc on fire tv stick\". Once you get it opened up its the best 40$ you can spend. even with just 1channel.... if you are using it the way it came you have NO IDEA...great product. got mine for free from a buddie. will be buying at least one more soon.", "verified": true, "helpfulness": "0/0", "author": "Travis726"}, {"rating": 5.0, "review": "I enjoy using the amazon fire stick. its super easy to use as you just plug it into your hdmi slot. You must keep the stick plugged into the power cord. The content on the stick is amazing i think you need amazon prime to really enjoy this stick. I would definately reccomend it to friends and family.", "verified": true, "helpfulness": "0/0", "author": "Vanessa Kent"}, {"rating": 5.0, "review": "No complaints about the fire stick. It works quite well! I do wish more of my favorite older TV shows were available on Prime, but that's another issue all together.", "verified": true, "helpfulness": "0/0", "author": "Lucy Ruth Hughie"}, {"rating": 5.0, "review": "I love, love, LOVE this!", "verified": true, "helpfulness": "0/0", "author": "Kia Robinson"}, {"rating": 5.0, "review": "I have another fire stick and fire tv box. Love them all", "verified": true, "helpfulness": "0/0", "author": "Ebentley"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Ryan O'Riley"}, {"rating": 5.0, "review": "I was impressed first of all by the way that the Fire TV Stick was packaged. It came in this really nice box. I have been very impressed with it. My mother-in-law enjoyed watching it while she was here with us. Today my husband was watching Fire Stick TV because he said that Netflix is a lot faster and that the picture is better than on our Wii system. I would recommend purchasing it. I paid $35 for it but it is normally $39. For that price (a one time purchase) it is very affordable and a great way to be able to watch TV.", "verified": true, "helpfulness": "0/0", "author": "Rachel"}]