[{"rating": 5.0, "review": "Fantastic!  Should have bought one a long time ago.", "verified": true, "helpfulness": "0/0", "author": "Christen"}, {"rating": 5.0, "review": "I'll tell you how I like it in January when I get it.  Not complaining, I got the Prive discount but Can't wait to check it out.  They should have used the Voice remote as a default feature rather than make you buy it separately.  Who is not going to want it.?", "verified": true, "helpfulness": "0/0", "author": "Mclout99"}, {"rating": 5.0, "review": "Was well worth the money I paid. I love amazon and thier products I am beyond satisfied.", "verified": true, "helpfulness": "0/0", "author": "Demetria"}, {"rating": 5.0, "review": "3 times better than Chrome cast.  Embeded UI and phisical remote makes far easier to access contents.Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to set up,stream smoothly, the voice command works perfect.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 5.0, "review": "Love the new fire stick.  It was very easy to set up and navigate.  I have not tried streaming movies yet but plan to this weekend.  It shipped quickly and a good price.", "verified": true, "helpfulness": "0/0", "author": "Ann Madden"}, {"rating": 5.0, "review": "Great product, easy to install and use, fast and clear! highly recommneded!", "verified": true, "helpfulness": "0/0", "author": "Tong Song"}, {"rating": 3.0, "review": "I love my fire stick...or I did, for that one sweet day when it worked.  Then my remote went haywire, and pushing any directional button would cause it to act like you were holding the button down, making it impossible to browse or select anything to watch.  I contacted customer support, and they were awesome, as usual, and offered a replacement, which I gladly accepted.  The only issue now is that I have to wait a month for the replacement (after preordering and waiting a month for the original), and then find out whether or not the replacement works.I gave three stars because I didn't get a good product, and it will be a while before I get my replacement to find out whether or not that will have issues as well.  That said, when it did work, it was awesome, and I was really bummed to switch back to my roku, because the fire stick apps are much better than the roku.", "verified": true, "helpfulness": "0/0", "author": "liz"}, {"rating": 2.0, "review": "Very slow on wifi. It gets stuck I could not watch a movie on amazon prime instead watched it on my laptop.", "verified": true, "helpfulness": "0/0", "author": "Raveendra Hegde"}, {"rating": 5.0, "review": "This thing is pretty damn nifty.  The interface is slick, easy to use, and snappy.  Would buy again.My only complaint is that it won't run 'full power' off of a standard USB connection as found on most modern TVs and requires a power source to be most effective.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]