[{"rating": 5.0, "review": "Great portable streaming device. Easy setup, no issues so far. Already bought another as a gift.", "verified": true, "helpfulness": "0/0", "author": "SB"}, {"rating": 4.0, "review": "Just beginning....so far so good.", "verified": true, "helpfulness": "0/0", "author": "DIDO"}, {"rating": 2.0, "review": "I originally installed the fire stick into a hdmi port on my Sharp Aquos tv.  It was a snap to install and worked well, the  problem is that it bypassed my component sound system and audio came through the tv speakers.  Unacceptable.  Fortunately, there were two hdmi ports open on my Samsung RX-V567 av receiver.  Used one of them for the fire stick, a little fiddling with the input selection and success!  Now have outstanding sound using the fire stick.  The bonus is I can now use my Harmony 700 remote to control the on/off and the volume control (after reconfigure on My harmony app).  The two stars come from the fact that there is a horrible lip sync problem when viewing HBO Go.  Apparently not an uncommon problem after an Internet search.  There is no resolution here because Amazon points it's finger at HBO and HBO points it's finger at Amazon.  Back to Chromecast-ing for HBO Go.", "verified": true, "helpfulness": "0/0", "author": "Terry"}, {"rating": 5.0, "review": "I love this! I'm so happy that I can watch from my Amazon video library on my TV instead of my computer. I was an easy set up! I can even subscribe to Netflix if I choose. Haven't streamed from HULU yet...but so many options! I definately want to purchase one for the downstairs TV.", "verified": true, "helpfulness": "0/0", "author": "Sassywahine2003"}, {"rating": 5.0, "review": "Works great and easy to install and set up.", "verified": true, "helpfulness": "0/0", "author": "Jane Doe"}, {"rating": 5.0, "review": "It is awesome.  Don't know why you would pay more for the bigger box.  I also have a Chrome Cast and I world recommend the stick over it.  The remote is nicer than using your phone or tablet to control the Chrome Cast.  The stick is also easier to travel with.  The Chrome cast would not hook up to my phone's hotspot for some reason but the Fire stick worked flawlessly.  I have heard other people recommend the Roku (I have not tried it) but being a prime member I think this is the best fit for me.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kerry Taylor"}, {"rating": 5.0, "review": "I have an Apple TV2 as well. We rarely use it anymore. The content available from Amazon Prime is good.Much less buffering than on Apple TV. An incredible bargain. Makes me that much closer to cutting the cable cord and only keeping Internet.", "verified": true, "helpfulness": "0/0", "author": "Spencer"}, {"rating": 5.0, "review": "I've really been disappointed with Netflix- nothing I ever want to watch is available! A friend suggested I try Amazon and I love it. Almost everything I've queried has been available for streaming. I also really enjoy their web series Catastrophe.", "verified": true, "helpfulness": "0/0", "author": "Jim M \"Kip 7\""}, {"rating": 5.0, "review": "I travel often for work and this thing is a life saver when you're bored in a hotel room!", "verified": true, "helpfulness": "0/0", "author": "archetype52"}]