[{"rating": 5.0, "review": "We loved it so much that we bought a 2nd one!", "verified": true, "helpfulness": "1/1", "author": "Melissa Garcia \"The Consumer Queen\""}, {"rating": 5.0, "review": "The Fire TV Stick was easy to set up and use. My only problem was with my existing Amazon password, which I had to reset several times. I'm not sure where the problem was, but once that hurdle was crossed everything was easy. I am really enjoying my Fire Stick. It is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Cheryl McEwen"}, {"rating": 2.0, "review": "Sad because i was really excited about it but when i tried to use it i found out u have to buy just about everything and it really only works in the US. So the put in your pocket n carry anywhere is not accurate. Back to using my android box.", "verified": true, "helpfulness": "0/0", "author": "Reno Rankine"}, {"rating": 4.0, "review": "When cable got ridiculously expensive, I opted for the Fire Stick. We had a few issues getting a clear wifi signal, but once we did, setup was easy. Works great... But a word of caution. If your wifi is overloaded with devices, you may have issues.", "verified": true, "helpfulness": "0/0", "author": "DJ Lowery"}, {"rating": 4.0, "review": "The feature that allows you to login at a hotel did not quite work, but still a great product.", "verified": true, "helpfulness": "0/0", "author": "J. Humphries \"Coolbreeze\""}, {"rating": 5.0, "review": "Works great, able to view just about anything !", "verified": true, "helpfulness": "0/0", "author": "Hoyt Allen"}, {"rating": 1.0, "review": "I ordered this Fire Stick for our Colorado mountain retreat.  However, it will not stream. I'm thinking it may be our service is not strong enough (we have to endure Century Link UGH) so I will be taking it back to Texas and hopefully it will work there.", "verified": true, "helpfulness": "0/0", "author": "Carole H. Elmore \"waterboy\""}, {"rating": 3.0, "review": "need more buttons with better shortcuts", "verified": true, "helpfulness": "0/0", "author": "RWturtle"}, {"rating": 4.0, "review": "Easy set up, better functionality than Google Chromecast. Only drawback is no easy way to cast YouTube.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Robert Greene"}]