[{"rating": 4.0, "review": "very nice.. vudu not available yet...", "verified": true, "helpfulness": "0/0", "author": "Sean A. Blocton \"Seanb1\""}, {"rating": 2.0, "review": "Works fine as a streaming device, but the promised miracast functionality is buggy at best and refuses to connect to intel based devices such as a Surface Pro tablet.", "verified": true, "helpfulness": "0/0", "author": "CineRik"}, {"rating": 5.0, "review": "Worked better than expected!", "verified": false, "helpfulness": "0/0", "author": "MaMia313"}, {"rating": 3.0, "review": "Relative to Roku the Roku was a better value both in flexibility and cost.", "verified": true, "helpfulness": "0/0", "author": "Robert M. Herron"}, {"rating": 5.0, "review": "WONDERFUL!  The shows load quickly.  I've had other streaming products & the remotes are usually not very responsive.  This one takes the cake!  Not regrets on this purchase!", "verified": true, "helpfulness": "0/0", "author": "gayleskat"}, {"rating": 3.0, "review": "works ok if your close enough to your wireless router.  Needs a receptacle for and external antenna for longer range operation.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 4.0, "review": "It is awesome.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The inclusion of remote and the ability to play basic games makes this stick a winner.  The inability to stream mkv files or DTS makes this stick 4 stars instead of 5. Hopefully there will be updates in the future to rectify these issues. But for the price with the included remote I am happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Aaron B."}, {"rating": 3.0, "review": "Based on the specification, it's better and cheaper than the Chrome cast.  However, the WiFi connection is intermittent and I have recycle power to make it works properly.  I might have a defective one.  I also own a Chrome cast which is very stable at the same location.", "verified": true, "helpfulness": "0/0", "author": "handson"}, {"rating": 3.0, "review": "I was extremely excited to be able to jump on my Amazon Fire Stick for only $19! After reading everything that it was supposed to do, it definitely sounded like a winner. So when my stick arrived early, it felt like Christmas!Let me preface this by saying that I have a Roku, 2 Chromecasts, Smart TVs, Wiis, Xboxes, and a WDTV Live (not all in the same rooms, of course). So I've got a lot to compare it to!The initial set-up was easy. Plug into the HDMI port on the TV.  Plug it into the wall.  Put the batteries in the remote (now this was a bit of a challenge...I had the hardest time getting it to open!). Good to go.  Now, the registering should have been easy. It was a gift to me from my cousin, so it was tied to her Amazon account. No biggie. I'll just connect it to mine.  Or will I?  When I initially put in my email address, it kept displaying an error saying that it was not a valid email address.  What?! The letters on the screen were pretty huge, and my vision is great...after reading and rereading to figure out where the problem was, I erased a few of the characters and retyped them. And it went through.  Okay.  *whew*Then I input my password.  Yay!  Let's go.  Oops...NO.  It then tells me that the username/password isn't tied to an Amazon account.  WHAT?!  Of course it is!  Unfortunately, the Fire Stick didn't seem to care what I screamed at it, so I had to use the remote (which takes some time getting used to, because I accidentally kept pressing the wrong letter/number). It told me to re-enter my username and password. But I didn't. I simply pressed Okay on both screens to use what was already there (the values that I had input before).  And this time it worked.  What the heck?!  Um...all right.Now we're in business. I can't wait to check everything out!  Apps first. I was a little disappointed at the selection, since I didn't see HBO GO (or a few other apps that I can't remember right now).  And for some reason, the Lifetime App give me all of the full episodes with my TV provider (or any major one like Xfinity, AT&T;, DirectTV). Why not?! It works on my Roku!  Ugh...On to Hulu. I'm trying to activate my account on the computer, when my TV shuts off.  That's no good.  I turn it on, and it happens again.  Is the Fire Stick killing my TV?!  Let's hope not. I went into the TV settings and changed my CEC settings to Off. Not sure why, but it did stay on a little longer after that. And then it was bedtime.This morning, I'm ready to get on the Amazon Fire Stick again, hoping that I have better luck.  I turned my TV on...and it went right back off.  Whoa!  Maybe my brain isn't awake yet and it didn't really come in.  I press power again and the TV logo comes up and I see the Fire Stick screen...and then it disappears and the power light fades out.  No bueno!  Next time I turn the TV on, I quickly switch my input to the cable box.  Okay, the TV stays on.At this point I'm thinking that the Fire Stick might possibly be possessed by the devil. But I'm determined to cast him OUT of my device, so I won't give up.  I switch the TV input back to the Fire Stick, and it works this time without the TV shutting off.  YAY!  So now I'm watching Australia's Next Top Model. That'll surely get the devil to leave...So in conclusion (hahaha)...*  The registration process can be a little buggy at times.*  For some reason, the device might make your TV shut off. It may be remedied by making sure your TV is turned on to an input other than the Amazon Fire Stick.*  The number of apps are limited, but it's a new device, so hopefully they'll have more in the near future.*  The network permissions for the apps may not be the same as it is on your other devices. I suppose the cable providers aren't yet too approving of the Fire Stick.  :(*  The picture quality is great.*  The remote will take a little getting used to.  And the center/ok button can be a bit sensitive. It also might be hard to get the battery cover off.Perhaps I'll re-review after I've used it for a while. But overall, I can't be mad because I paid $19 for it...", "verified": true, "helpfulness": "1/1", "author": "ShaRhanda Bynum \"ShaRhanda R. Bynum\""}]