[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Jones"}, {"rating": 5.0, "review": "Couldn't be better !", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 4.0, "review": "I would have given it a 5+ stars but it needs HBO Go...then, it will have met all my expectations.  Excellent!", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 4.0, "review": "I was hoping it more interactive with my Kindle Fire tablet. Other than that it's great. My grand-daughters love it and it frees up my Fire tablet for myself. Love that it jest plugs-in and is easily moved from TV to TV", "verified": true, "helpfulness": "0/0", "author": "Frank Utterback"}, {"rating": 5.0, "review": "Awesome device", "verified": true, "helpfulness": "0/0", "author": "O. Lopez \"Buyer\""}, {"rating": 5.0, "review": "I love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Brittany Pennywell"}, {"rating": 5.0, "review": "I love the fact that you can new movies, and all the television shows you what. It is so easy to use that my kids know how to use it too.", "verified": true, "helpfulness": "0/0", "author": "Josh's Kindle"}, {"rating": 5.0, "review": "Great,meets all expectations.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 1.0, "review": "this thing was a complete waste of money - it would connect and disconnect from the wifi in my house and you couldn't watch a single hour of programming without constantly having to restart.  I have excellent wifi connectivity with all other devices so it's just this piece of crap.  I would not waste your time ordering one.", "verified": true, "helpfulness": "0/0", "author": "tiffany mendez"}, {"rating": 4.0, "review": "Was wondering how to get computer programs such as Amazon Prime off my computer and cell phone to a larger screen. Fire TV stick was my answer!  Great new tool to gain access to so many free and subscription programs....all off of our wi-fi . Had it up and running in a very short time. Remote is good but still need to access regular remote to change HDMI port on television for Fire TV. The price is good and I would recommend this to anyone who has an older non Smart TV..", "verified": true, "helpfulness": "0/0", "author": "steevw"}]