[{"rating": 5.0, "review": "I love this and you can't beat the price.  Fast easy access to my favorite services, Amazon Video and Netflix.  We put it into our receiver rather than the TV so we get great sound as well.", "verified": true, "helpfulness": "0/0", "author": "L. Bartnik"}, {"rating": 4.0, "review": "Needs stronger internet pickup. But works pretty well.", "verified": true, "helpfulness": "0/0", "author": "jasman"}, {"rating": 5.0, "review": "I've spent tens of thousands of dollars on Amazon purchases over my years as a Prime customer.And though I'm ashamed to admit as much as I rely on Amazon reviews, I've never left a review; I guess I never liked the idea of being an unpaid spokesman for someone else's product.After a few weeks with the Fire TV Stick, I'm happy to write my first review. We -- the whole family -- LOVE it. It's intuitive, and easy for everyone to use. My seven-year-old son loves it. Our Mac Mini (which is hooked up to our TV as a Media Center) has been sitting unused since we started using the Fire TV Stick. The only thing that the Fire TV Stick doesn't do better than the Mac Mini is HBO. If HBO came out with an app for Fire TV, I think we might never use the Mac Mini again It has gone well beyond our expectations. Excellent job to the Amazon team behind the hardware and software; you've really done a great job!", "verified": true, "helpfulness": "3/3", "author": "Tres"}, {"rating": 5.0, "review": "This has been amazing.  I am cutting back on my current tv package because we use Fire Stick so much.  Only problem we had was opening the remote to insert batteries.  Very difficult and no directions included. Great help from telephone support.", "verified": true, "helpfulness": "1/1", "author": "CHERYL HARRINGTON"}, {"rating": 5.0, "review": "We love it. We can get shows and movies that we could not get before.", "verified": true, "helpfulness": "0/0", "author": "Peggy Schneider"}, {"rating": 5.0, "review": "Works great. I have had it for two days and I already like it better than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Jason Whitlock"}, {"rating": 5.0, "review": "Very convenient! I love it!", "verified": true, "helpfulness": "0/0", "author": "Anna A."}, {"rating": 5.0, "review": "Awesome product c", "verified": true, "helpfulness": "0/0", "author": "Phyllis Jeffers"}, {"rating": 3.0, "review": "I really do enjoy the fire stick...but I am kicked out of my Netflix account every time I try to open it. I then have to sign back in. Its just tedious.Also... No HBOgo?!", "verified": true, "helpfulness": "0/0", "author": "stevie"}, {"rating": 5.0, "review": "We LOVE the Fire TV stick. Would highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Val A."}]