[{"rating": 5.0, "review": "easy to set up, navigate and enjoy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to install and extremely simple to operate", "verified": true, "helpfulness": "0/0", "author": "cesar maciel"}, {"rating": 3.0, "review": "I don't like that I had to change my modem settings just to get this to work which now prevents my laptops from connecting.", "verified": true, "helpfulness": "0/0", "author": "C. E"}, {"rating": 5.0, "review": "Perfect!!", "verified": true, "helpfulness": "0/1", "author": "Beth"}, {"rating": 5.0, "review": "I just love it, I really don't need cable anymore...", "verified": true, "helpfulness": "0/0", "author": "Yusmilka Rodriguez"}, {"rating": 5.0, "review": "A great device put out by Amazon. I have it installed on my 40\" plasma screen and the process is smooth as silk. Having the phone app is also user friendly. I would certainly recommend this and will look to buy more in the future as a gift around the holidays for friends and family.Packaging and delivery achieve highest level of satisfaction. The fact that this was already tied to my account made things even easier. When buying for someone else it is a good idea to know this since you can and will need to set it up for them once hooked up. Again, very easy.The remote is extremly functional and is 10x better than the AppleTV remote, and as i mentioned earlier the FireTV app for phones and tablets is absolutely a great added feature.No issues, no problems, no brainer. Worth the cost for the years of use and i am a big fan. Great for kids shows too.", "verified": true, "helpfulness": "1/1", "author": "USA4Life"}, {"rating": 5.0, "review": "Easy to install, works great", "verified": true, "helpfulness": "0/0", "author": "Fashanta"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "JM"}, {"rating": 5.0, "review": "I own three fire tv sticks and I just love them, got this one when it first came out at a great price for prime members and the other two I bought them at Best Buy. Before I was about to get me a smart tv which I know now that would of just limit what I can do.  Love that I can mirror my phone to the screen and that I can just take it anywhere I go. Have use chromecast and roku and I can assure you that the fire tv is way better.I don't like the interface, but that's a software issue, hopefully Amazon will change it to make it easier to navigate.Totally recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "J Rodriguez"}, {"rating": 5.0, "review": "I don't really like the fire tv user interface but it's pretty simple to get used to.  Being an Android system It's just not what I expected.  I bought this with the intent of using it as a secondary XBMC player for smaller rooms around my house.  It's very powerful for such a tiny device and is great for a networked media player.  I no longer need my Western Digital media players that were solely used for local files and were total junk for streaming content.I have my fire tv stick setup to boot into XBMC and I was plesently surprised that XBMC automatically recognises the Fire TVs apps under programs.  I can easily access any native Amazon app without ever leaving the beauty of my custom XBMC user interface. The FireTV has great content with a lot of flexibility, truly something for everybody. Bluetooth functionality is cool and I like that I have a lot of freedom in the future to add keyboards or game controllers.I have a top of the line wireless router and my Fire TV Stick works great on my home network.  I've experienced much slower load times while at a friend's house because of a slightly slower network and very poor connectivity at hotels where network speeds are slow during peak times.  These are about the only negative experiences I've had but I can't blame the fire tv stick for a slow network,  it does what it's suppose to do. However, I do wish that I had the option to directly connect my Fire TV Stick to the internet using a cable. But there's the full Amazon Fire TV for that.", "verified": true, "helpfulness": "1/1", "author": "Fully Completely"}]