[{"rating": 5.0, "review": "Works so simply and effectively !  We love it!", "verified": true, "helpfulness": "0/0", "author": "Russell Todd"}, {"rating": 5.0, "review": "Easy to set up and works great!!  I did have to reset it after it initially connected to my wireless, but once reset have had no problems at all.  And it is very fast to load from Netflix.", "verified": true, "helpfulness": "0/0", "author": "T Blanchard"}, {"rating": 4.0, "review": "Everything works good except some limitation causes plex not to work good. According to Plex they haven't been able to get full support to help with the streaming issues from Amazon. But anything else it runs pretty good.", "verified": true, "helpfulness": "0/0", "author": "Grant"}, {"rating": 3.0, "review": "Works ok with online TV shows and movies....the UI lags a little bit...whereas the screen casting from tablets/phones is horrible right now and can be improved upon if fire stick wants to remain competitive in this segment!!", "verified": true, "helpfulness": "0/0", "author": "Jigar Parekh"}, {"rating": 5.0, "review": "It was so easy to install.  I love having Netflix, Amazon prime, Pandora, I Heart Radio, plus many other features at my fingertips.  We are heading to beach soon and will take this with us.  Doesn't get any easier than that!", "verified": true, "helpfulness": "0/0", "author": "Kathy G."}, {"rating": 5.0, "review": "Was so easy to figure out and use!!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer B. Johnson"}, {"rating": 5.0, "review": "I love the fire stick! I purchased 2 fire sticks, I can move it any where in the house.. No need to run out and buy a smart TV when you can purchase a fire stick for cheaper.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love being able to watch all the prime shows and movies on the tv with my family instead of crowding around our kindle!", "verified": true, "helpfulness": "0/0", "author": "Jaime Mennell"}, {"rating": 3.0, "review": "It is okay but A lot of things have to be purchased.....", "verified": true, "helpfulness": "0/0", "author": "TIERRA N DAVIS"}, {"rating": 1.0, "review": "Did not work", "verified": true, "helpfulness": "0/0", "author": "robert komorny"}]