[{"rating": 5.0, "review": "The Fire TV Stick is amazing, you can install XBMC player for more fun than the apps already installed..", "verified": true, "helpfulness": "0/0", "author": "Blot League"}, {"rating": 5.0, "review": "Very easy to install for us non techies.  Love the apps and can now really take advantage of my PRIME membership with movies on the big screen", "verified": true, "helpfulness": "0/0", "author": "Marg"}, {"rating": 4.0, "review": "You can find similar reviews online comparing two or all three of these devices so I won't waste time with much detail on that. I do own all three and I find each has their pluses and minuses. When it comes right down to it, here is how I would rank them: Roku3, Chromecast, Fire TV Stick. The reason Roku gets top billing from me is because of all the channels it has. One particular is BYUtv. I cannot cast this channel with either the Chromecast or fire stick. Chromecast is second because I can cast almost anything to it using my phone. The little remote that comes with the fire is OK but if you lose it, the fire tv won't work. It just sits there on startup saying \"searching for remote\". Fire TV is good if you use amazon prime video, it's obvious that it caters to their product. The \"cast\" feature doesn't work but it may be something goofy with my TV because I use it on the same tv as my roku3 and I can't get the mirror screen feature to work on it either. They both may work on my newer TV.*************3/10/15 - UpdateI am not sure why but the cast feature does not work. I tried it on my newer TV that the Chromcast works fine on. Since the original review, I don't use the fire stick at all. I use the Roku3 on one TV and Chromecast on the other. IF I had amazon prime and didn't have the other devices I would probably use it much more.*************3/27/15 - UpdateI am not sure if there was an update of some kind but I am now able to stream video to the Fire TV Stick and Roku3 just like I was able to on the Chromecast. Because of that, I bumped my review up to 4 stars.The Chromecast still responds a lot faster to streaming from a device (phone/tablet/laptop) than the other two but I wanted to state that I am able to stream to all three devices now. I still favor the Roku3 and Chromecast though. If I had Amazon prime I would probably use the Fire TV Stick more. I forgot to mention in my original review, I really do like the HDMI extender cable that comes with the Fire TV Stick. When you have a lot of devices/things plugged into the back/side of your TV it is nice to not have to try and cram this in the small space. it allows it to hang outside at any angle to fit better and if for some reason it gets bumped, you don't have to worry about the Fire TV Stick or your HDMI port getting damaged.", "verified": true, "helpfulness": "0/0", "author": "J Peterman"}, {"rating": 5.0, "review": "Does what I wanted", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to connect and linked right to my account.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the fire TV stick,  easy to use and works great. I have a slingbox and I love that this device has an app for that! Makes cable TV portable and I have one in every room now. No need for a media pc anymore!", "verified": true, "helpfulness": "0/0", "author": "Joengelhart"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Lisa F Binion"}, {"rating": 4.0, "review": "good value", "verified": true, "helpfulness": "0/0", "author": "captainjunker"}, {"rating": 4.0, "review": "I got this on the $19 Fire TV Stick sale.  When it arrived, we had it set up in minutes and started watching Amazon Prime movies.  The resolution is much better than the native Sony smart TV Amazon option.  I love the dedicated remote, it was too hard to remember what function the color keys performed on the Sony remote.  Overall it was a good buy and I love being able to listen to my Amazon music on my TV.", "verified": true, "helpfulness": "0/0", "author": "slow cooker"}, {"rating": 5.0, "review": "I previously I purchased a competitors product. It was the most complicated item I've ever purchased.  I then bought the Fire TV stick, in less than 5 minutes I was up and running, This was so easy to connect.  I highly recommend this to everyone instead of using a HDMI cord.", "verified": true, "helpfulness": "0/0", "author": "patricia ryan"}]