[{"rating": 5.0, "review": "love it, love it!! and really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Shirley McWhorter"}, {"rating": 3.0, "review": "Works well, easy set up, best part for me supports Plex", "verified": true, "helpfulness": "0/0", "author": "S. G. Olson \"grasshopper\""}, {"rating": 1.0, "review": "It is freezing up every single day! I am probably going to get my money back!", "verified": false, "helpfulness": "1/1", "author": "walter mainville"}, {"rating": 1.0, "review": "I have the Fire phone and I bought the Fire stick assuming that the Fire stck app would work seamlessly. It did the first day. After that the phone never detected the Fire stick even though both the phone and the stick were on the same wifi network. Even the Fire stick when operated by itself needs to be consistently 'rebooted'. I need to remove it from the HDMI slot or from the power source to be able to view the apps. I also own Chromecast and Roku3 and both of the other products seem better. Chromecast is great in that I am able to get my tablet and spare android phone perfectly connected everytime.", "verified": true, "helpfulness": "1/1", "author": "Jay"}, {"rating": 5.0, "review": "Preliminary review as I just got the Fire TV Stick last week, but it is as easy as pie to install and use.  I can already see how my late nights, when I can't sleep and there is nothing on the television, will improve.  I have a huge \"Watchlist\" with Amazon Prime and to be able to watch on my tv in lieu of the computer (plus the comfort of the couch versus the office chair) is a huge bonus.  My only negative (unless I haven't researched enough) is that there is more detailed information on the listings on the computer.  For instance, if a movie on your \"watchlist\" is no longer streaming but is now charging a fee to watch, that is not information that is provided on the television.  Just make sure all of the items on your \"watchlist\" are free and you're good to go.", "verified": true, "helpfulness": "0/0", "author": "Anne Schulman"}, {"rating": 5.0, "review": "Works like a charm.  Have 2 Roku units, but the Fire TV Stick works as good or maybe at times better.  It was a gift and a very nice gift. If I knew it was going to be this good I would have had a Fire Stick when they came out.", "verified": true, "helpfulness": "0/0", "author": "M. Urso"}, {"rating": 5.0, "review": "Great tool for streaming. Much better connection than streaming on Xbox Live", "verified": true, "helpfulness": "0/0", "author": "Adam Muise"}, {"rating": 5.0, "review": "Great. Amazing access to all kinds of media!!", "verified": true, "helpfulness": "0/0", "author": "Cicely Wynne"}, {"rating": 5.0, "review": "Works great! So glad I purchased it . Only downside is it has to stay plugged into the wall outlet to work.", "verified": true, "helpfulness": "0/0", "author": "CCross"}, {"rating": 3.0, "review": "Better have good internet connection.  It buffers alot.  When not buffering it works like a charm.", "verified": true, "helpfulness": "0/0", "author": "C. Bell"}]