[{"rating": 5.0, "review": "I love this thing. The only thing better is the next model up with voice activation. I have one of those too.", "verified": true, "helpfulness": "1/1", "author": "Martin Holcomb"}, {"rating": 4.0, "review": "My fire tv stick did crash the first few times on USB power, so make sure you use the supplied AC adapter.  I was hoping the TV usb port would be enough because I hate having to run cables all over the place.  The stick does get warm once and a while but it preforms great and can handle anything I throw at it.", "verified": true, "helpfulness": "1/1", "author": "Jon L."}, {"rating": 5.0, "review": "This is the first one of these we have every had. And now wonder how we lived without it. Yes we can't compare it to other devices so we might be missing something but I can't image what that would be.This is simple and quick get Amazon prime and Netflix and your done. All my movie packages with DTV are gone.I can find no down side to this and you get youtube and every picture from your kindle and other than the $8.00 for Netflix NO bill.", "verified": true, "helpfulness": "0/0", "author": "R. T. Swisher"}, {"rating": 4.0, "review": "Just received this item through amazon and I am still working through all of the features....Most of all its portable and I can use this when I travel.", "verified": true, "helpfulness": "0/0", "author": "K. Beamon \"thenewjamal121878\""}, {"rating": 5.0, "review": "I like it a lot.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "\"Did the Amazon Fire Stick, meet my expectations?\"  Boy, did it ever!  It's the best thing since sliced bread!  Talk about options, they are endless.  I may never leave the house again. Straightforward, easy setup and usable in minutes.  A superb value. Hands down, it's a winner! Five stars for sure.  Thank you Amazon.", "verified": true, "helpfulness": "1/1", "author": "WFJ"}, {"rating": 5.0, "review": "I love this fire stick.  It came in handy on our vacation.  The only thing that was disappointing is that it did not have the Showtime.", "verified": true, "helpfulness": "0/0", "author": "Sandra B."}, {"rating": 5.0, "review": "I used to have chromecast and all I can say is it's no where near this fire tv stick. I bought it few days ago when they had that $15 off and all I can say is it's worth every penny.", "verified": true, "helpfulness": "0/0", "author": "gail"}, {"rating": 5.0, "review": "WORKS GREAT. DON'T HAVE ANY BUFFERING ISSUES .MOVIES COME UP BEAUTIFULLY.MY MUSIC PLAYS CLEAR. I WOULD RECOMMEND THIS TO ANYONE.", "verified": true, "helpfulness": "0/0", "author": "tony dibari"}, {"rating": 4.0, "review": "good product I haven't​ had any problems with it so far.", "verified": true, "helpfulness": "0/0", "author": "roger smith"}]