[{"rating": 5.0, "review": "Very easy to useWith a Prime membership there are gazillions of movies to watch and enough games to choke a horse.YEEEEE-HAAWWWWW", "verified": true, "helpfulness": "0/0", "author": "Jeri"}, {"rating": 5.0, "review": "Love this so much easy to install and work just love it", "verified": true, "helpfulness": "0/0", "author": "judy manzoor"}, {"rating": 5.0, "review": "Phenomenal gadgetGreat purchase ... Was setup and in use within minutesPicture quality is excellent", "verified": true, "helpfulness": "0/0", "author": "Irie Living"}, {"rating": 5.0, "review": "Love this.  I've used the Chromecast for a few years now and have replaced it with the Fire Stick.  Way more optiosn with the Fire Stick and easy to use.  Will be ordering an additional one for my bedroom!  Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Kevin65721"}, {"rating": 5.0, "review": "It is everything I expected and more. Ease of installation, rapid response time, ease of operation.Wonderful purchase.", "verified": true, "helpfulness": "0/0", "author": "RICHARD S. YANT"}, {"rating": 4.0, "review": "Although slightly less powerful than the big-brother FireTV, this is a great and compact product for a bedroom TV. Loading it with your favourite apps (either from Amazon store or loaded via adb), this Stick gives you access to Netflix, Hulu Plus, Amazon Prime Video and much much more. Awesome products for a bargain price. Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Abele Stoelwinder"}, {"rating": 1.0, "review": "It's only for Amazon Prime members", "verified": true, "helpfulness": "0/0", "author": "J Choi"}, {"rating": 4.0, "review": "I love it. It was easy to set up and we can move it to different TVs with no problems. I'm already ordering another one for my daughter. It's definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Shannon Long"}, {"rating": 2.0, "review": "Very laggy. Buttons on remote are not very intuitive. Accidentally hit the home button a lot.", "verified": true, "helpfulness": "0/0", "author": "David \"David\""}, {"rating": 5.0, "review": "Everything I hoped for and more.", "verified": true, "helpfulness": "0/0", "author": "amy"}]