[{"rating": 4.0, "review": "Good Product. Could have been awesome, but Amazon forgot to add Volume Control in the remote. :(", "verified": true, "helpfulness": "0/0", "author": "Harshal Indane"}, {"rating": 5.0, "review": "My Firestick is so easy to use. I love it.", "verified": true, "helpfulness": "0/0", "author": "Ellissa Geary"}, {"rating": 4.0, "review": "I think this  is a great product  I wish it included the app called Vudu", "verified": true, "helpfulness": "0/0", "author": "cyril hall"}, {"rating": 1.0, "review": "I wish I could give this zero stars. As a dedicated and loyal Prime member I expected way better quality then this. I am 8 mins and 34 seconds into a movie and it has stopped 11 times. During set up it kept saying Internet failure.  Considering we have two Apple TVs that run seamlessly, the problem is this stick. We also have two wireless routers and this stick won't connect to either. It's a total piece of junk. I'm ticked we spent $19, and most assuredly would be even more upset if we paid full price. Don't waste your time or money on this!!!", "verified": true, "helpfulness": "4/7", "author": "Koop06"}, {"rating": 2.0, "review": "The remote needs universal TV volume control. I mean really, Amazon, is it 1989 and I need a fist full of remotes to run everything?", "verified": true, "helpfulness": "0/0", "author": "KanMan"}, {"rating": 5.0, "review": "Love our Fire TV on the living room TV, thought about getting more but then Amazon came up with the Fire TV Stick and we bought these for our boys room TVs.  They are a great alternative for there use.Recommend both the Fire TV Stick and Fire TV.  Both have there strengths, so pick the right one for each of you TVs.The Fire TV sticks allow for most Fire TV games and the streaming video is great.For voice control use the Fire TV Android app on your phone or Kindle Frre.I do recommend you make sure you have good WiFI, especially when running multiple streaming devices.  My one son's room was on the edge of our old WiFi set up.  Just upgraded to a Linksys WRT-1900AC works great with Cat 7 cables to the main router.  The With all our Kindles,the Fire TV, Fire TV sticks and laptops you need the bandwidth.Thankfully, Amazon has everything needed.", "verified": true, "helpfulness": "0/0", "author": "K. Kirschke"}, {"rating": 4.0, "review": "kids very happy with it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"audie\""}, {"rating": 5.0, "review": "Especially for Amazon prime, this is a great unit.  Granted, I got it for $20, but it compares well with my Roku units in terms of picture quality, useability, and selection.  The only thing missing is HBO Go.  Setup was easy, even considering my household wireless is a non-standard, non-broadcasting SSID.  Most of the negative reviews are the result, I believe, of not using the included micro USB power supply.  If you look at the power supply, you may notice that it has a 1 amp output.  Most TVs (or computers, for that matter) output 500 mA (1/2 A), the USB standard, if they have a USB plug at all.  The Fire Stick needs more, much like an iPad or an Android tablet.  Users - don't get stupid on the power.  And if you do, don't post a negative review.  RTFM.", "verified": true, "helpfulness": "0/0", "author": "Deek"}, {"rating": 5.0, "review": "Not as fast or smooth as the FireTV, but still well worth the money!", "verified": true, "helpfulness": "0/0", "author": "CommonSense"}, {"rating": 5.0, "review": "Love it so very much I ordered two... I have uploaded all 9000 pictures to my Amazon cloud and my entire itunes play lists and now can listen to them or see pics.. oh also have Prime movies... Love it!", "verified": true, "helpfulness": "0/0", "author": "Lake House Granny"}]