[{"rating": 1.0, "review": "I don't broadcast the SSID of my wireless network.  A scan will not show my wireless network SSID.  My Stick did not give me a simple menu option of entering the SSID when I first set it up.So here we are on Friday night, wanting to watch a movie and FAIL,  it can't connect to Amazon Services, which in turn won't let me use Netflix either.  My wireless works fine, the Stick says it has a very good signal, but no joy.  No Amazon Home, No Netflix, No PBS, Nada.Plugged my 3 year old Roku box back in, it got the (same) wireless signal and fired right up.The Fire TV Stick is on it's way back to Amazon for a refund.", "verified": true, "helpfulness": "4/16", "author": "Wine Country \"Tim\""}, {"rating": 5.0, "review": "No complaints. Easy set-up.", "verified": true, "helpfulness": "1/2", "author": "Sarah N."}, {"rating": 1.0, "review": "The remote does not open, can't even install the batteries!", "verified": true, "helpfulness": "0/18", "author": "KSH"}, {"rating": 5.0, "review": "Best Performance Video, Wireless and Usability", "verified": true, "helpfulness": "1/2", "author": "Joseph E"}, {"rating": 4.0, "review": "I really can't complain too much about something that was $19, but for someone that might have paid full price I can see where there would be some annoyance. It has most of the apps everyone wants. YouTube, Netflix, Hulu, iHeartRadio, etc. The only one that seems to be missing is hbogo. A negative I've noticed is there's an update to install when you first recievr the device, and it takes FOREVER.  Another issue is the software seems to be a little buggy. YouTube videos would freeze and the remote would become unresponsive for quite some time. I'm sure a software update will fix the bugs. Overall I'm pretty impressed, for $19 (a prime member promo they had) it was a no brainer.", "verified": true, "helpfulness": "0/1", "author": "mguimond1990"}, {"rating": 1.0, "review": "Wont get past \"connect to network\" no networks are showing up hidden or not... And the stick gets super hot. Fire Stick indeed. I'll try my second one tomorrow.", "verified": true, "helpfulness": "3/9", "author": "Ramathor Bangsalot \"I rate things\""}, {"rating": 5.0, "review": "great device to play netflix and other usual online streaming content. super useful when you sideload tvmc or Kodi versions of xbmc. never ending possiblities ...all for 19 dollars i paid for fire stick. Awesome .", "verified": true, "helpfulness": "3/4", "author": "John Q"}, {"rating": 1.0, "review": "Amazon fireTV stick is a real disappointment. It is released more than a year after chromecast and is even not better than the apps on my three years old smart tv and does not provide any additional useful features to my TV. There is no way to control it through your laptop, there is no way to stream any contents from your computer, there is no way to browse the internet, there is no way to mirror your computer screen on the television. To control it and work with it, you should use the provided remote control which just takes a lot of time to enter a simple title (yes, using only arrows on the remote you should enter \"It is always sunny in Philadelphia\"!!). Amazon claims that they have an android app to fix it but there is no IOS app and no way to control it through the computer. It is truly a big disappointment. I bought it through the special offer (19$) for the prime members but even that does not worth it.", "verified": true, "helpfulness": "1/16", "author": "BruceT"}, {"rating": 1.0, "review": "It's not working, my tv can't recognize it, but it shows up in my remote app, which means it's connected to Wi-Fi. The support guy made me unplug and plug again for hours, they also don't know what the problem is. Came here to see few others havng same issues, so I am not the only one. Hope they fix it, or send me a new one asap....", "verified": true, "helpfulness": "4/10", "author": "vsarda \"vishnu\""}, {"rating": 3.0, "review": "Have been using it for two days now, and the stick seems to work well.  The initial updating process took about 5 to 10 minutes.  Menu layout is very linear, so navigation isn't quite as easy as a Roku, but is fairly intuitive (I have no previous Fire TV experience).  Control via Fire TV app for Android is very convenient, and flinging apps from phone to screen is simple enough.Complaints so far:-I was watching a Netflix video but sent a YouTube video to my screen to watch.  No immediately obvious way to switch directly back to Netflix without going back to homescreen, re-entering the app, selecting account, and continuing playback.  Using the back button on the remote only takes me back to the YouTube \"What to Watch\" menu.-The screen-mirroring option is buried in settings and doesn't seem to work with my Samsung Galaxy S5.  It would be nice for this to be more upfront and functional.I'll keep an eye on system updates to see how things progress.", "verified": true, "helpfulness": "2/4", "author": "Reviewer"}]