[{"rating": 5.0, "review": "My 13 year old son loves it. He was upset with us for canceling DirecTV but very pleased with this streaming device. We already pay for Netflix, Hulu, and Amazon Prime, so really he is not missing anything in his bedroom. Bonus for him was YouTube, once he saw that he was hooked.", "verified": true, "helpfulness": "0/0", "author": "Tad Waddell"}, {"rating": 4.0, "review": "Disappointed that it doesn't support HBO Now.", "verified": true, "helpfulness": "0/0", "author": "Vicki"}, {"rating": 5.0, "review": "Kids love it", "verified": true, "helpfulness": "0/0", "author": "Charity"}, {"rating": 4.0, "review": "Love it, but wish it did not have to be plugged in!", "verified": true, "helpfulness": "0/0", "author": "FlatLover"}, {"rating": 5.0, "review": "Very easy to set up  Accesses  a ton of content", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome!! Meets and exceeds the expectations.", "verified": true, "helpfulness": "0/0", "author": "Jason H."}, {"rating": 5.0, "review": "Does everything,  that it claims to do.", "verified": true, "helpfulness": "0/0", "author": "Paul Price"}, {"rating": 5.0, "review": "Works great. I have no complaints at all!", "verified": true, "helpfulness": "0/0", "author": "Travis lovell"}, {"rating": 3.0, "review": "Although the Fire TV Stick does everything it claims and has the added benefit of a remote control, it is useless without a subscription to a media provider.  By comparison, Chromecast (I own both Fire TV Stick and Chromecast) can project anything from your computer, tablet, or smart phone using the free app.  This includes free media like YouTube.", "verified": true, "helpfulness": "0/0", "author": "Craig Barboza \"normal guy\""}, {"rating": 4.0, "review": "I got tired from moving my PS3 from bedroom to the living room again and again so I bought this item. Now the PS3 is at the living room and the FIRE TV STICK is at the bedroom. it is very easy to use, I use it mainly for Netflix but sometimes also Amazon Prime. The only let down is the connection to my WIFI at home. its pretty slow on connection and once a while it disconnect from the internet. My PS3 was at the same location for over a year and I never had this problem with it! (I have a fast internet at home).", "verified": true, "helpfulness": "0/0", "author": "regency fire protection"}]