[{"rating": 5.0, "review": "Amazing! Have no complaints and would recommend to everyone", "verified": true, "helpfulness": "0/0", "author": "S"}, {"rating": 5.0, "review": "I like using the Fire TV Stick better than the apps on my smart TV. The connectivity is great and I am very happy to have this product. The only negative thing I would say is that the remote is a little cheap.", "verified": true, "helpfulness": "0/0", "author": "K. Scott"}, {"rating": 3.0, "review": "First the \"HDCP unauthorized content disabled\" thing, though unplugging TV plugging back up gets it to work, now after watching movie for awhile the picture moves to the left hand corner of screen and becomes about 2 inches square, kind of defeats the purpose of a 42 inch TV. The only way to get it working again is to reboot then awhile later it does it again. Life is too short to be rebooting every time I want to watch a movie. Guess I'll send it back , maybe the replacement will work like it should, if not I'll buy a book.", "verified": true, "helpfulness": "1/1", "author": "ckc \"smokin\""}, {"rating": 5.0, "review": "Best Streaming device yet", "verified": true, "helpfulness": "0/0", "author": "SanjayG"}, {"rating": 5.0, "review": "Awesome, fast processor no cons!", "verified": true, "helpfulness": "0/0", "author": "Billgon \"billgon\""}, {"rating": 5.0, "review": "I love this thing - I have 2 tv's that are not \"smart\" with this gadget they are now just like my TV that is \"smart\"!  I've only used it to watch Prime movies and TV, it performed perfect and was easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Pinkie"}, {"rating": 5.0, "review": "Impressed with the kindle, and even more impressed with the firestick! Finally, something that works.", "verified": true, "helpfulness": "0/0", "author": "MLBHE"}, {"rating": 1.0, "review": "I wanted to love this device....  To me this device is not ready for the big show... Out of the box I updated the software (no biggie).  After configuring and watching about 45 min worth of movies/show, the device began showing a \"purple poltergeist\" type of screen and restarting.  I unplugged the device and resumed viewing and the problem would return ever so often.  This issue was extremely frustrating...  I contacted customer service and after initial troubleshooting, they sent a replacement device.  The replacement device had the same issue although not as bad.  I know my tv or network was not the cause of this issue as my Chromecast works fine.  I replaced the firestick with a Roku 3 and have not hand ANY issues.", "verified": true, "helpfulness": "1/1", "author": "emonsoon"}, {"rating": 5.0, "review": "I LOVE the idea of the fire stick - but it doesn't work well in my set-up. I continually receive messages that I don't have the bandwidth to run it. Sometimes it will run for hours - and sometimes minutes. Because of my computer set-up the router is far from the fire stick. I'm sure that's the problem. UPDATE - I got a new FIOS installation with a strong Internet router. Works great - am enjoying my Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "DL in Annapolis \"Dinah Little\""}, {"rating": 1.0, "review": "Didn't work at first but was great after it did begin working. Great purchase. Just wish they", "verified": true, "helpfulness": "1/1", "author": "Natalie A. Lopez"}]