[{"rating": 5.0, "review": "I love this new Fire TV Stick!  I had been wasting so much time, waiting for the buffering of my Netfix programs to finish.  Now I can watch Netflix, Youtube, HBO Go, and so many other programs, in a way they were meant to be watched, without tons of delays as they were buffering.  This TV Stick is easily worth five times as much!", "verified": true, "helpfulness": "0/1", "author": "Tom"}, {"rating": 5.0, "review": "I have to admit I stream more than I watch straight tv and sometimes you really want to watch something  on the larger tv screen than on your computer or a portable device. I waited on my Fire Stick to come from back order and the wait was well worth it. This was easy to hook up to the tv and is fairly easy to operate. If you stream and have Amazon Prime or Netflix this is for you. It has many other apps as well but those are the 2 main things I use it for.", "verified": true, "helpfulness": "0/1", "author": "Pat the Bookjunky \"Bookjunky\""}, {"rating": 5.0, "review": "Easy to install and works very well - What I would expect from Amazon!", "verified": true, "helpfulness": "0/1", "author": "Robert H. King"}, {"rating": 5.0, "review": "i love my  Fire Stick!! I can watch all my NCIS reruns on Netflix and then go to my Bible shows and Christian movies. I''m actually considering cancelling my Cable TV because I can get everything I want with my Fire Stick. I'm so grateful to my nephew for talking me into getting it. Great idea Amazon!!!", "verified": true, "helpfulness": "0/1", "author": "jane"}, {"rating": 5.0, "review": "For Price, The best choice I made, also it`s the best streaming media I have owned because the android settings.", "verified": true, "helpfulness": "0/1", "author": "Juan Alvarado \"closed eyes\""}, {"rating": 5.0, "review": "Great streaming device recommend it to everyone.", "verified": true, "helpfulness": "0/1", "author": "Josh Little"}, {"rating": 4.0, "review": "Not bad", "verified": true, "helpfulness": "0/1", "author": "Ken"}, {"rating": 5.0, "review": "Love to watch Netflix this is perfect can move from one TV to another no problems.....", "verified": true, "helpfulness": "0/1", "author": "diane volk"}, {"rating": 5.0, "review": "More than worth the money", "verified": true, "helpfulness": "0/1", "author": "Sandy Hallett"}, {"rating": 1.0, "review": "Do not order this!!!!! My husband spent over an hour with tech support trying to make this piece of junk work. We were told that the router had to be within 2.5 feet of the device.  I purchased two of these along with Amazon Prime. When I said I was fed up and I wanted a full refund on both fire sticks and Amazon Prime, which I've had for maybe three weeks, the supervisor said that he would prorate the refund. I said absolutely not and he finally agreed to provide a full refund. A terrible product, misleading and incomplete product info and despicable customer service. I'm through with Amazon. Buyer beware!!!", "verified": true, "helpfulness": "0/2", "author": "Pam McGraner"}]