[{"rating": 5.0, "review": "Love it! Easy to use!", "verified": true, "helpfulness": "0/1", "author": "Kolt Chauvin"}, {"rating": 5.0, "review": "LOVE IT!! We got this during the $19 sale too and are super happy we did! I thought we might try it out and then pass it along as a gift to parents but once my husband tried it he wouldn't let it go. Sorry Mom and Dad!Does everything it promises and more! Amazon content at finger tips and Netflix is super simple to access. Downloads lots of Apps and we're still having fun playing around with it. Easy to set up and use right out of the box. We have replaced the Wii access we were using and now are thrilled with the ease of the Fire Stick access.Suggestion for upgrade, sleep mode on main menu, right now you have to go into settings to turn the thing to \"sleep\". Remote, although similar to iPad TV remote is a bit small and \"delicate\" to the touch compared to standard TV remotes.", "verified": true, "helpfulness": "0/0", "author": "K. Morton"}, {"rating": 1.0, "review": "The fire sticks tv is not as good as the bigger fire tv, the  larger one has much better streaming and much less buffering .. I wish I never bought the sticks.......This a up date: In previous review I gave this 2 stars, now going down to 1 star, to bad Amazon has drop the Fire TV Box by far much better built and much better picture, the stick has to many problems... The One that drives me Nutz is when it stops working,,, saying Network problems,, open Network,,, then saying good signal - connection with problems... you have to unplug it from power, and wait a few moments, replug it in, this will let it clear it's memory and rebuffer,,, then it will work again,,, another thing you can do to help this problem is put a longer HEMI cord on it get it away from the TV, you will get a better signal and it stays COOLER", "verified": true, "helpfulness": "1/1", "author": "Glenn S."}, {"rating": 5.0, "review": "Pretty awesome!", "verified": true, "helpfulness": "0/1", "author": "Saad"}, {"rating": 1.0, "review": "I got the Kindle Fire TV Stick for a spare bedroom and had high hopes for it since I love all my other Kindle products but I actually could not get it to play. The remote was not very responsive and would delay 15-20 seconds before the indicator on screen would move. I pressed the button so many times that by the time it would start moving on screen it certainly went way past the item I was trying to reach. It wasn't a problem with my internet because the other items connected worked and responded as they always did. I had to return the Fire Stick and got a Google Chromecast instead. I've had no problems with the Chromecast.", "verified": true, "helpfulness": "3/3", "author": "Victoria"}, {"rating": 5.0, "review": "Greasy product; easy set up with great connection!", "verified": false, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Device worked great when it works. Stream came through HD quality and kept up with fast forwarding. It had a difficult time staying on my Wireless, not like my SmartTV or my CCast. Sometimes there was no Audio from my Streaming, in which case I needed to power down and reboot the device. I had to power cycle about 1-2 times a week.", "verified": true, "helpfulness": "1/1", "author": "J. Lee"}, {"rating": 5.0, "review": "Everything I was hoping it would be. Love watching amazon prime video in HD. Easy setup and use", "verified": true, "helpfulness": "0/1", "author": "Francis Felice"}, {"rating": 5.0, "review": "Wonderful gadget,  have not used a cable channel in several days.........", "verified": true, "helpfulness": "0/0", "author": "Keith A. Felton \"AVCHD editor\""}, {"rating": 3.0, "review": "BEWARE! - This ships preloaded with your Prime credentials.  I almost gifted this after purchasing, glad I didn't. Powered it up and it was connected to my Prime account including photos I sync'd from my cell phone.Make this a little better by requiring credentials during setup.", "verified": true, "helpfulness": "0/0", "author": "Hugemongus"}]