[{"rating": 4.0, "review": "Perfect for streaming amazon. Hopefully add HBO go in the future. Do need to plug into a power source.", "verified": true, "helpfulness": "0/0", "author": "Ajay Joshi"}, {"rating": 4.0, "review": "Good product. It is still buggy but I'm sure this is because it is a new product", "verified": true, "helpfulness": "0/0", "author": "Diana Olivera"}, {"rating": 4.0, "review": "It works well, but the Netflix app takes a while to load. I'm not sure if it's a Fire Stick concern or a Netflix concern, but it does knock the usability of the device down a peg. It should also specify in the app descriptions which are subscription based and which aren't.", "verified": true, "helpfulness": "0/0", "author": "I am disappoint"}, {"rating": 1.0, "review": "This is the first time that I have been disappointed with Amazon. This product drops signals since the day I got it. I called customer service twice. Each time ended with me being told a technician would contact me with no follow up. There are lots of people having similar issues. It should be recalled. Amazon is ignoring this issue. I do not recommend.", "verified": true, "helpfulness": "1/1", "author": "maureen singer"}, {"rating": 5.0, "review": "Way better than any other tv stick on the market", "verified": true, "helpfulness": "0/0", "author": "lindystar"}, {"rating": 5.0, "review": "At first, my internet connection was not fast enough to use the fire stick.  One little call to my internet provider and I am now LOVING it!  It is so nice to be able to throw the shows that my husband likes onto his large screen TV.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "With netflix and amazon prime accounts, an interent enabled BluRay player and a tivo, this stick doesn't really gain me much of anything.But at a $20 price, it was worth trying.That said, we watch amazon prime offerings via the stick because the interface is better than the blu-ray option.Amazon prime though is a lot like netflix, new release offerings are fairly limited for what you can see for free.Plenty of options to download other movies at $3-6If you have an HMDI Tv and no other access to Amazon offerings, this would be an easy way to do it.", "verified": true, "helpfulness": "0/0", "author": "Samuel Twist"}, {"rating": 5.0, "review": "We still have the old type of \"flat screen\" tv.. I was wondering if this would work through our Playstation 3? From what I've seen, this equipment seems amazing and we'll worth the money. We just don't see a point in getting a new TV yet when ours works fine.", "verified": false, "helpfulness": "0/0", "author": "Brittany Nicole Killian"}, {"rating": 5.0, "review": "I have the first Apple TV this is probably better but very similar. had no problems with watching a movie but was slow watching a HD video I had on the Amazon cloud.  Got it at a reduced price when it first came out so it was worth the price not sure it if would be worth the full price if you already had apple TV or one of the others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am completely in love with my Fire Stick. Instead of buying a whole new blu ray player that had either few apps, or apps that were not running well I just bought the one and can transfer between TVs as needed. Can't wait for more apps to be updated by Amazon!", "verified": true, "helpfulness": "1/1", "author": "Renee Cook"}]