[{"rating": 5.0, "review": "Very nice and intuitive interface. Love the additional apps and music selections. I would highly recommend Amazon Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Christopher Ronk"}, {"rating": 5.0, "review": "I Love it.  Now when there's nothing good on regular TV, I can watch something good using the Fire TV Stick.  I can even program the TV using my Kindle.  Great invention!Mollie", "verified": true, "helpfulness": "0/0", "author": "Mollie Kirkland"}, {"rating": 1.0, "review": "Product freezing up while watching Hulu. Picture freezes but audio continues. also no picture after commercials.", "verified": true, "helpfulness": "0/0", "author": "Trhea"}, {"rating": 5.0, "review": "Its been great. I love having movies all the time through Prime and Netflix!", "verified": true, "helpfulness": "0/0", "author": "Krysta Carter"}, {"rating": 5.0, "review": "If you have Prime you should definitely get a Fire Stick. I don't even pay for cable anymore. All my favorite shows and apps are available with Fire. I also have Fire TV and Kindle so I can access my content wherever I go. I love them all!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "I had to return it because it didn't seem to be compatible with my RCA HD TV.", "verified": true, "helpfulness": "0/0", "author": "Colleen F. Kline"}, {"rating": 5.0, "review": "Even better with the \"personal\" upgrade I made.", "verified": true, "helpfulness": "0/0", "author": "chris coar"}, {"rating": 5.0, "review": "great great more than expected  the old classic tv was clearer than I remember  thanks amazon", "verified": true, "helpfulness": "0/0", "author": "martin owens"}, {"rating": 5.0, "review": "Better then all other devices", "verified": true, "helpfulness": "0/0", "author": "Peter Arden"}, {"rating": 3.0, "review": "Occasionally some red static lines will cross the screen.  I have decided to just put up with it since I've already returned one refurbished stick.", "verified": true, "helpfulness": "0/0", "author": "sara hall"}]