[{"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Sherry"}, {"rating": 5.0, "review": "Product is as it's described.  Sets up effortlessly and works perfectly!!  Very happy", "verified": true, "helpfulness": "0/0", "author": "lowell beglinger"}, {"rating": 5.0, "review": "Awesome product for the price. Provides excellent audio/video resolution on all the plasma and/or LCD screens we have. Very small and transportable--I move it around from TV to TV in the house and plan to take it with me when I visit family members. Never any performance lags in video playback. It's a fun entertainment \"tool\" and fun to experiment with.The only negative comment is that there is  not a lot of documentation on how to install other apps on the TV stick. I've installed a few--some work and some don't. Not sure what that's the case, but as I said, documentation is somewhat lacking.I received this as a gift, but would definitely recommend buying one to provide additional entertainment capabilities and a very low price point.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fire stick is awesome! It turns my regular TV into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Sxymma1983"}, {"rating": 5.0, "review": "So convenient and easy to use - especially since I am a Prime member.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "awesome - get one!", "verified": true, "helpfulness": "0/0", "author": "Robert Dunshie"}, {"rating": 5.0, "review": "I love the Fire TV Stick I use it all the time.Some family members even love it. They are thinking about getting one for their home.", "verified": true, "helpfulness": "0/0", "author": "DAWN KLUKOWSKI"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Brenda Shivery"}, {"rating": 5.0, "review": "Awesome, I love it. Now I can watch Mozart in the Jungle, Transparent and all Amazon original programs. Best money I have spent lately.", "verified": true, "helpfulness": "0/0", "author": "A.V. Rose"}, {"rating": 5.0, "review": "I was surprised how easy it was to install. The worse part I had, I had to change my router  to (Quantum) as, mine was old. and, that took my dumb head a little time.  Actually I had  installed it correctly but had to have /verizon  varify that. I intend to really enjoy this little\" :TOY\"", "verified": true, "helpfulness": "0/0", "author": "B. Bassler \"loubetsy\""}]