[{"rating": 5.0, "review": "Excellent!!!", "verified": true, "helpfulness": "0/0", "author": "Michael Ortegon"}, {"rating": 5.0, "review": "works great AND no commercials, we use this more than regular TV", "verified": true, "helpfulness": "0/0", "author": "S Lynn Cooper"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Easy to set up and very easy to use. Way easier than my smart tv.", "verified": true, "helpfulness": "0/0", "author": "Christopher D. Rogers"}, {"rating": 5.0, "review": "This is really a lot of fun. My two yr old granddaughter loves Dora and it will run forever for her. I'm looking forward to watching all the amazing content. I like the HDMI extension, I don't have to worry about moving the TV and accidentally snapping off the Fire stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"SC\""}, {"rating": 3.0, "review": "If you have Amazon Prime, you can use voice search in Amazon Instant Video with the Fire Stick app... But you have to use the awful onscreen keyboard to search in anything else, like the Netflix or YouTube apps (very frustrating). Hopefully more apps will be available in the future, but for now, it's not very versatile. Also, sometimes the little remote that came with it doesn't respond when we press the buttons. That being said, it is easy to set up and use, and I like that it automatically goes to sleep when I turn off my TV.", "verified": true, "helpfulness": "1/1", "author": "Rianne"}, {"rating": 5.0, "review": "Amazing!!!", "verified": true, "helpfulness": "0/0", "author": "aneta mancevski"}, {"rating": 5.0, "review": "Had it for a couple of months and is an excelent device for watching Netflix, Amazon Prime and Youtube. I have Prime photos too so it's a good extra to be able to watch my pictures on the big screen TV. Previously had a Playstation 3 for streaming video but the Fire TV stick as replaced it for those needs since it's easier to use and it's watt usage is a lot less.", "verified": true, "helpfulness": "0/0", "author": "Sergio"}, {"rating": 5.0, "review": "With sling.com and a firestick, cable TV will soon go the way of the landline", "verified": true, "helpfulness": "0/0", "author": "Jeff Chastain"}, {"rating": 3.0, "review": "Was good but hard to get connections in bedrooms", "verified": true, "helpfulness": "0/0", "author": "charles"}]