[{"rating": 5.0, "review": "Fine", "verified": true, "helpfulness": "0/1", "author": "K. Ahlrich \"ahlrichmom002\""}, {"rating": 5.0, "review": "Fits the bill perfectly for hotels and other travel. However for home tv, nothing beats Roku for speed. This is only a \"stick\" though but it works well enough to encourage me to order the box next time. Set up very easy.", "verified": true, "helpfulness": "0/1", "author": "Reggae Lover \"Reggae Lover\""}, {"rating": 4.0, "review": "I used an Apple TV for several years, but found myself fed up with the random restarting, deleting, and adding of apps.  After purchasing the Fire Stick for my dad, I decided to get one for myself and love it!  It's a great little piece of equipment.PROS-lots of apps-relatively easy to use-fast-great apps and features-access to Netflix, Amazon Prime, YouTube, Hulu, etc.CONS-can be misleading when it comes to free vs. paid TV and movies - have to keep a close eye on that!-the interface is a little messy-searching (say in YouTube) can be frustrating-separate plug for powerOverall, I'd recommend it.  I like it a lot and am looking forward to a long and happy life together. :)", "verified": true, "helpfulness": "0/1", "author": "J. Keely"}, {"rating": 3.0, "review": "Needs more apps available on it. But what it does have works and it is easy to use and set up.", "verified": true, "helpfulness": "0/1", "author": "Mallorie"}, {"rating": 5.0, "review": "Very happy with the Fire TV Stick ! I was trying to watch Netflix through my bluray player and couldn't because of constant rebuffering and problems. I Switched over to Fire Stick to watch the same program and had NO problems.  Is it me , or is the picture better too ?", "verified": true, "helpfulness": "0/1", "author": "Evelyn Gauthier"}, {"rating": 5.0, "review": "Helped me make my decision for cutting the cable. Easy to use and install!", "verified": true, "helpfulness": "0/1", "author": "Fred Kriss"}, {"rating": 5.0, "review": "Better than Roku and Chromecast!", "verified": true, "helpfulness": "0/1", "author": "william chaple"}, {"rating": 5.0, "review": "WOW, why didn't anyone tell me about this before ?? !!  Fantastic, Love it, opened up a whole new world for me!!", "verified": true, "helpfulness": "0/1", "author": "Anne N. Stoddard \"Nanny\""}, {"rating": 5.0, "review": "LOVE THIS!", "verified": true, "helpfulness": "0/1", "author": "Janet Rae"}, {"rating": 5.0, "review": "A must have if your a Prime member!!! Super Fast!!!", "verified": true, "helpfulness": "0/1", "author": "tredmon"}]