[{"rating": 4.0, "review": "Does everything I expected, Would have been nice if it charged off the TV power as opposed to having its own power supply.  That why I did not rate 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Felicity MacDonald"}, {"rating": 5.0, "review": "I want three more hahaha", "verified": true, "helpfulness": "0/0", "author": "C Harper"}, {"rating": 5.0, "review": "Really cool stuff.", "verified": true, "helpfulness": "0/0", "author": "Doug Beek"}, {"rating": 5.0, "review": "I received the fire TV Stick as a Christmas present from my children.  I have been enjoying the numerous selections of movies and television shows it offers. No more loading and unloading DVD's. It's very easy to use and I can move it to any TV in my house.", "verified": true, "helpfulness": "0/0", "author": "V.B.H."}, {"rating": 5.0, "review": "GREAT", "verified": true, "helpfulness": "0/0", "author": "Paul W Memminger"}, {"rating": 5.0, "review": "Low cost. Easy to install. Awesome. Strongly recommend.", "verified": true, "helpfulness": "0/0", "author": "tweety"}, {"rating": 4.0, "review": "Works great. Really convenient. I was then back that a power cord was needed but not a deal breaker.", "verified": true, "helpfulness": "0/0", "author": "franklin johnson"}, {"rating": 5.0, "review": "A very good option", "verified": true, "helpfulness": "0/0", "author": "Omar Jose Ruiz Ramos"}, {"rating": 1.0, "review": "Instructions are easy to follow and if you are a prime customer, installation and activation is even easier.  It's so much easier to enjoy watching video material on a big screen rather than a tablet", "verified": true, "helpfulness": "1/4", "author": "hank"}, {"rating": 5.0, "review": "Very easy to set up and use.  I watch mostly amazon prime, netflix, (and hulu when I'm desperate, I hate commercials!), so this little gadget is perfect for me.  I have a Roku downstairs on our main TV and the Fire Stick is upstairs in my bedroom.  My router is at the opposite end of my house and downstairs but I have no buffering issues at all.  I'm very pleased with the fire stick and the price is perfect.", "verified": true, "helpfulness": "0/0", "author": "K. Murphy"}]