[{"rating": 5.0, "review": "Great invention....we even took it to the hotel! Can't believe we waited so long to purchase.  Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Ariana"}, {"rating": 5.0, "review": "Love, so easy to use any where!", "verified": true, "helpfulness": "0/0", "author": "Tonya Ruggles"}, {"rating": 4.0, "review": "Still under review but working great so. The intent was to ditch cable TV but have not been because not much live streaming if any. I'm yet to explore that.", "verified": true, "helpfulness": "0/0", "author": "Capito \"Jay\""}, {"rating": 5.0, "review": "Fantastic. No complicated install instructions. Anyone can do it.", "verified": true, "helpfulness": "0/0", "author": "Harvey R. Lambert"}, {"rating": 5.0, "review": "It works great. :)", "verified": true, "helpfulness": "0/0", "author": "DelmisG28"}, {"rating": 2.0, "review": "What they don't tell you is that you will have to pay Amazon Prime $100 to get the channels and shows you want to watch.", "verified": true, "helpfulness": "0/0", "author": "Lynne Hiskett"}, {"rating": 5.0, "review": "I thought it would be easier to buy a second stick for my other tv than moving it...can this be done on same account?", "verified": true, "helpfulness": "0/0", "author": "MKD"}, {"rating": 1.0, "review": "The fire stick doesn't seem to work without getting Amazon Prime. I am taking mine back to the store.", "verified": true, "helpfulness": "0/0", "author": "Denise Davidson"}, {"rating": 5.0, "review": "works great. easy to connect even for someone like me that do'sent know anything about computers. found the password on my modem. I was at a loss before then. would be nice if they gave you more instructions on how to use it, and get more out of it. but really worth the money, so far. thanks again amazon", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it.  I now have plenty shows to watch during the television summer re-run season.", "verified": true, "helpfulness": "0/0", "author": "Sarah Ruth Holbrook \"Queen Mum\""}]