[{"rating": 3.0, "review": "First I would like to say this is a good product, but I sugguest to anyone make sure you do a lot of research before you purchase this item. Some things I found out is that although it states Showtime and HBO can be viewed they only offer select cables networks. Another thing to be aware of is to make sure you have the Internet capability to operate the device effectively. I had the wifi capability, buy when you have multitble devices; such as iPads it does do work well without turning the wifi off of those devices. I did that and it still needed to buff every 10-15 minutes. I was able to get support and that is how I found that information out, but it still not not work. Needless to say it took away from the enjoyment of the device.This device is NOT compatible with Comcast.", "verified": true, "helpfulness": "0/0", "author": "Read Between the Lines \"Steff\""}, {"rating": 4.0, "review": "I was amazed how this little device Rock quality picture in to my house.the picture was just as good or better than cable TV.", "verified": true, "helpfulness": "0/0", "author": "Ernie"}, {"rating": 5.0, "review": "I am so glad I got the fire stick. It is everything and more that I hoped for. It's a snap to connect to the TV and the remote is a breeze to operate. This is the best this ever. I love it. When my husband has control of the remote in one room, I don't care anymore I just go in the other room and watched what I want or play what I want to play. Need to get one for the other bedroom.", "verified": true, "helpfulness": "0/0", "author": "Peggy Ray"}, {"rating": 5.0, "review": "Works great, remote is a little dinky but otherwise love it.", "verified": true, "helpfulness": "0/0", "author": "Dean L. Grassino"}, {"rating": 5.0, "review": "only issues was difficulty removing the back cover to install the batteries.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "After purchasing 3 Chromecast to use with our Kindle Fire, I discovered that Chromecast no longer supported the Kindle. I learned that the Fire Stick would give me the mirror casting option I was looking for.", "verified": true, "helpfulness": "0/0", "author": "Craig M."}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/1", "author": "ivan sims"}, {"rating": 4.0, "review": "Its better than using the internet and faster.", "verified": true, "helpfulness": "0/0", "author": "Tammie Witt"}, {"rating": 5.0, "review": "Super easy to use, even for an old timer like me. (My first TV was B&W;).", "verified": true, "helpfulness": "0/0", "author": "John Suberbielle"}, {"rating": 4.0, "review": "I am satisfied with the item. I only had a buffering problem once and I think it might have been because I paused the movie.  I'm not really fond of the remote, but I won't use it that often.", "verified": true, "helpfulness": "0/0", "author": "D. Shields"}]