[{"rating": 5.0, "review": "fantastic  surpasses all expectations", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 5.0, "review": "Absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "connie hung"}, {"rating": 5.0, "review": "Amazing! My family and I have really enjoyed the Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Emily Arce"}, {"rating": 2.0, "review": "it by itself is very good BUT if I had known that you had to rent or buy all the movies before you watch them I would have NEVER bought I only kept it because I can now watch hulu and netflix on my tv.", "verified": true, "helpfulness": "0/0", "author": "stacy crandle"}, {"rating": 5.0, "review": "Got this when it first came out for $19 (I'd pay the full $40).  They even delivered it earlier than predicted.  Something like two weeks earlier than I expected it.Works great in bedroom on third story of our house (Router is on the first floor).  I've read that people have had connection issues with their Fire Stick, but that has not been the case for me.  Not one issue so far.  I have a newer router, but it's nothing spectacular.After using Roku's for years, it's a bit hard to get used to the interface, but I've just learned to deal with it.  For the price, I think I would buy another Fire Stick over another Roku, and I've owned five Roku's.", "verified": true, "helpfulness": "0/0", "author": "J. Taylor \"THX 1138\""}, {"rating": 5.0, "review": "Does everything I want it to do. Very impressed with the solid connection and ease of use.", "verified": true, "helpfulness": "0/0", "author": "Win"}, {"rating": 5.0, "review": "Got it as a gift for Christmas! Best gift ever!", "verified": true, "helpfulness": "0/0", "author": "Nadine Allen"}, {"rating": 4.0, "review": "I absolutely love the Amazon stick.  I was having issues with my Wii connecting to Netflix and got tired of it not working so I purchased the Amazon stick.  I was already a Prime member and had a subscriber of Hulu and Netflix.  I went with the stick because I really don't care about the voice command feature.  I haven't had any issues and have enjoyed being able to watch Netflix and Hulu on my tv screen as opposed to my laptop.  It's very user friendly and simple to hook/up connect.  I would highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Stasia \"stasia113\""}, {"rating": 5.0, "review": "Works perfectly. Now I can see my Cloud Drive Photos and play my Prime music on my TV. Great for sharing photos; you don't need to pass your cell phone around. Amazon video plays great using this with very little buffering delays after the initial start-up.It also has a cool feature where you can start playing music and then start a photo slide show (with nice transitions) and the music keeps playing.", "verified": true, "helpfulness": "0/0", "author": "SpeedyMan"}, {"rating": 5.0, "review": "Worked first time !", "verified": true, "helpfulness": "0/0", "author": "James L Beaudry"}]