[{"rating": 5.0, "review": "This is the best purchase I made all year.  I spent the weekend catching up on all of the HBO series that I missed over the years.  The kids are able to watch their shows too.", "verified": true, "helpfulness": "1/1", "author": "Mike Luczynski"}, {"rating": 5.0, "review": "Really like it. Getting it up and running was a breeze. I have Amazon Prime. Selection there is pretty good. I do like the Watchlist feature that allows you to add recently released movies as well as those in Prime.", "verified": true, "helpfulness": "0/0", "author": "John Taggart"}, {"rating": 3.0, "review": "Nice to be able to access my pics & videos on the TV but the remote is too small and have to restart frequently.  Mobile remote app fails to sync with fire stick frequently as well.", "verified": true, "helpfulness": "0/0", "author": "JPL"}, {"rating": 4.0, "review": "The stick works fantastic but as a Prime member I am disappointed at how few movies are free.", "verified": true, "helpfulness": "1/1", "author": "Caroline Hooper \"Glass girl\""}, {"rating": 5.0, "review": "I just got this and also downloaded the remote for my phone!! With the cell phone app you can do voice searches. I used to be a fan of chromecast but the fire stick is so much more robust! You dont need a computer to use it. I found tons of free apps and now my netfilx and prime are synced up as well.", "verified": true, "helpfulness": "1/1", "author": "Jonathan S. Sher \"Jon From Worcester\""}, {"rating": 2.0, "review": "Easy to hook up and the iPhone app works great for voice search but overall the content is stale - not a replacement for cable or dish tv.", "verified": true, "helpfulness": "0/1", "author": "Tony Chromczak"}, {"rating": 4.0, "review": "So far, so good.  Will try more programs. Works well though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pros:* Works right out of the box.* It synced with my Netflix account very quickly.* It has a miracast/screen cast mode which works with my android tablet.* Remote feels good.* Great bang for the buck (when I compare this to my friend's Chromecast, I would say that the price difference is definitely worth it).Cons:* External power adapter is a tad bit wider than I would have liked- it occupies more space than it should on my power strip.* No Amazon fire tv app for Windows Phone.", "verified": true, "helpfulness": "0/0", "author": "Shiva Ghose"}, {"rating": 5.0, "review": "Did as advertised!", "verified": true, "helpfulness": "0/0", "author": "William M. Davidson, Jr"}, {"rating": 1.0, "review": "Its constantly buffing even though the fire stick is 12 inches from the modem. Cant watch movies or shows on Netflix without it buffing through the entire movie. The Fire TV is worth the money than wasting your money on the stick.", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}]