[{"rating": 5.0, "review": "Works as described, esp. if you have amazon Prime.........great for those nights where you don't know what to watch, CHOICES galore.....", "verified": true, "helpfulness": "0/0", "author": "AM"}, {"rating": 5.0, "review": "Great price - fast shipping.  Love this product!", "verified": true, "helpfulness": "0/0", "author": "Avo O'Brian"}, {"rating": 3.0, "review": "I was disappointed because it is not user friendly.  The text option is slow and clumsy.  It also doesn't take passwords I use on other devices with Netflix or Amazon.  I end up watching the shows on my computer", "verified": true, "helpfulness": "0/0", "author": "charlotte zerof"}, {"rating": 2.0, "review": "Slow interface, and very slow reaction time as compared with Chrome and Samsung Smart TV functions connected to the same network.", "verified": true, "helpfulness": "0/0", "author": "Anthony C. Shelley"}, {"rating": 3.0, "review": "Even with a great signal, we have trouble buffering NeFlix, and Prime does not buffer at all. They should offer an external antenna or external booster, not everyone is hard wired in.", "verified": true, "helpfulness": "0/0", "author": "John57106"}, {"rating": 5.0, "review": "The Fire TV Stick was so easy to setup and it has given me many hours of enjoyable entertainment.  I highly recommend this product.  The service I received, as usual, was superior.", "verified": true, "helpfulness": "0/0", "author": "Diane E Organ"}, {"rating": 5.0, "review": "Great product.  Now able to view so many more shows, specials, etc.", "verified": true, "helpfulness": "0/0", "author": "Ruth Ann Smith"}, {"rating": 2.0, "review": "The lack of support for mirroring really makes this product inferior to the Chromecast.  I was hoping to upgrade my chromecast with this device which has better hardware, but find myself going back and not using the Stick.", "verified": true, "helpfulness": "0/0", "author": "Carl Brochu"}, {"rating": 3.0, "review": "It works faster than my Roku, and doesn't get as hot. However, i haven't been able to project my phone video on my TV like i can with the Roku! The Amazon Pime seems like a joke to me, any movie i look for still has a rental price and the youtube stuff about how to hack into it doesn't work unless i'm doing it wrong. Which could be, i'm not fluent with electronics anymore. Definately better than cable or satellite though. I cancelled my tv and only watch through my fire stick.", "verified": true, "helpfulness": "0/0", "author": "arrick"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "javier lopez"}]