[{"rating": 5.0, "review": "Great product!!! I have the box also and both are excellent. I plan on buying another stick for my kids bedroom. Don't even bother looking at all the other options on the market. Especially the Fire Box blows them all away!!!!!", "verified": true, "helpfulness": "0/0", "author": "Mitchell  radell"}, {"rating": 5.0, "review": "Easy to set up! Easy to use! Perfect! So happy I invested in this!", "verified": true, "helpfulness": "0/0", "author": "Chelsea"}, {"rating": 5.0, "review": "Love  that I will recommend  to all my friends. Now  I can  watch  all the movies  I want", "verified": true, "helpfulness": "0/0", "author": "Ewa Grance"}, {"rating": 5.0, "review": "I have to say.... I love it - when I can't find something to watch on 'regular' tv, I flip to the Fire Stick and start browsing.  Easy to use, piece of cake to set up and for the price it has been worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Elle Gardner"}, {"rating": 4.0, "review": "Works as advertised right out of the box.  But of course, you still have to buy the memberships for the applications in order to access their content.  Based on our usage pattern, it is much cheaper than buying a smart tv.", "verified": true, "helpfulness": "0/0", "author": "S. P. Drolshagen"}, {"rating": 2.0, "review": "Not at all impressed with this item.  Have to keep unplugging our signing out and back in to watch anything.  I would not spend the money on another one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Mikayla Michaud\""}, {"rating": 5.0, "review": "Bought for my daughter's room. She loves it", "verified": true, "helpfulness": "0/0", "author": "Gina"}, {"rating": 4.0, "review": "Works well but the apps are better on my Roku.  Time will tell.", "verified": true, "helpfulness": "1/1", "author": "FooBar"}, {"rating": 5.0, "review": "very happy with the firestick!", "verified": true, "helpfulness": "0/0", "author": "Raymond L. Gremminger \"Robbie\""}, {"rating": 5.0, "review": "Great product. Easy setup. Remote is easy to use.", "verified": true, "helpfulness": "0/0", "author": "bh"}]