[{"rating": 5.0, "review": "I love this fire stick...I'm able to watch my shows on Amazon Prime, Hulu plus so many more others. My kids also love playing games from the apps option. Way cheaper than buying a smart tv....that was what I was initially shopping for then I realized that it's cheaper to just buy the stick and nice flat screen tv with HDMI...Way cheaper!", "verified": true, "helpfulness": "0/0", "author": "JCLOPEZ23"}, {"rating": 4.0, "review": "Could not be more simple to install and initiate.  Very beginner friendly.  Had my wife navigating thru the menu, using multiple features and using the Fire Stick on first day.  Unbelievable simplicity!!!!  Feed to TV and picture resolution are excellent.  Matched this product with my SlingTV order and got a world class product !!  Thumbs up on this partnership.", "verified": true, "helpfulness": "0/0", "author": "George Campbell"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "balice"}, {"rating": 5.0, "review": "Ive been using my wii to access my netflix for the past few years and it was such a hassle having to move it from the basement to the upstairs and setting it up when someone wanted to watch a movie upstairs. With the fire stick now all of our TVs can access netflix. It was simple to install and use. Definitely worth the money for those who don't have a smart TV", "verified": true, "helpfulness": "0/0", "author": "brittany"}, {"rating": 5.0, "review": "I ordered one of these as soon as it was announced. As an Amazon Prime member, I bought for $19 during a two day sale. I figured, for that price, I might as well test it out! It came a couple of month later. This 1st one was commandeered buy my kids so I bought on for my room also. The kids are enjoying some of the free games.It was super easy to set up, wireless seems smooth, the interface is intuitive and easy to navigate.THE REMOTE!!! I say this loudly because it’s the best thing.Every “Casting” device should have this. I stream it in full HD and vary rarely have a hiccup.I really like the Amazon Fire TV Stick. It's the best way to view your Amazon content on a TV. Its interface is fast and easy. For any Amazon Prime members, it’s a must have.", "verified": true, "helpfulness": "0/0", "author": "clayton sweet"}, {"rating": 4.0, "review": "Very good offering for use with any HDMI enabled TV. The connection has been patchy, but that could be the wifi signal in our home. The apps are easy to navigate. Picks up your Amazon media. Hope they add HBO go soon. That's the only real down side.", "verified": true, "helpfulness": "0/0", "author": "H B P"}, {"rating": 2.0, "review": "I expected a lot more of the content to be freely available.  A filter to only show what's available until I want to search for something to buy would be very nice.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Half-Adder\""}, {"rating": 5.0, "review": "Awesome, works great and best thing I bought myself in a long time!", "verified": true, "helpfulness": "0/0", "author": "Mama D \"non-junk buyer\""}, {"rating": 2.0, "review": "I was really excited to finally have this come and it worked ok the first day. After that it just went downhill from there. I live in an 840 square foot apt. My router is in my front room and the fire tv stick connected to the tv in the very next room - it's not far from the router by any means. However, the fire tv stick will not stay connected. It will go from saying signal strong connection very good to connected with problems to just disconnecting altogether. I even got a message a couple times saying the device bandwidth was too low to stream videos and I would have nothing else streaming at the time. I would then test my other devices and stream on my smart tv that's connected to the same router even further away and have no problem AT ALL. My laptop still streams fine, my phone, etc again all connected to the same router. I've put the extender on, re-installed my router, reset my device and nothing works. I love the easy set up and really wanted this to work - it's unfortunate. I don't understand some people experiencing this and others aren't.", "verified": true, "helpfulness": "1/1", "author": "Cocoa Puff"}, {"rating": 5.0, "review": "Great stuff", "verified": true, "helpfulness": "0/0", "author": "william jarrell"}]