[{"rating": 5.0, "review": "Great product. Much better than Apple TV or Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"SDKletzien\""}, {"rating": 5.0, "review": "Everything and more!", "verified": true, "helpfulness": "0/0", "author": "Michael Brotten"}, {"rating": 2.0, "review": "(updated review after using it a few months) I've actually gone back to my old Roku, as much as I love the interface in this over the Roku interface, it just has too many problems to keep using it.  It has major buffering problems, it will randomly freeze mid playback, and there are times when the playback starts skipping.  I may be willing to try the full fledged Fire TV for the better interface, but the stick is just too underpowered for streaming.  My advice would be avoid the stick players in general, I had a roommate who had the same problems with the Roku stick, and just spend the extra on a full fledged stand alone device.(out of the box review) A great product, definitely better than the Roku that I had been using.  That said, it does have its limitations.  The biggest complaint I have is that it does not yet support screen sharing with Windows 8.1 (the product description does acknowledge that it is not yet 8.1 certified, so I can't say that I wasn't warned).  Otherwise, the interface is responsive and fairly intuitively organized (it does have a slight learning curve if you are used to the Roku, but took less time to get used to overall), the video and audio is very clear, and being completely hidden behind the TV is great for keeping the entertainment center appearing neat and organized.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Gawthrop \"smileyeagle\""}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Robet"}, {"rating": 3.0, "review": "No more or no less than I expected. I already have Netflix and it seems that if I want anything more current, I have to pay for it even though I have a Prime account!", "verified": true, "helpfulness": "0/0", "author": "Shel Kirchner"}, {"rating": 5.0, "review": "The fire stick is excellent !  I own 2 now.  The wireless reception is excellent.  I actually have one installed on my new  Sharp 70\" Aquos Smart TV because the TV only gets 2 bars on the wifi causing it to buffer a lot on Pandora.  Firestick never skips, freezes, or buffers. It is redicules that I have to install a firestick on a smart TV.  It also has many more apps preloaded on it than the smart TV.  For $39 it is a great buy,  and I could have saved at least couple hundred dollars buying a 'dumb' TV using the Firestick.", "verified": true, "helpfulness": "0/0", "author": "Karl Maurer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Vincent N. Mallamo"}, {"rating": 4.0, "review": "Easy to install. Works great sometimes some of the programming pauses (ShowtimeGO) or just does not work (Fox Sports) . However I do not think that has anything to do with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Martin Torres"}, {"rating": 5.0, "review": "I love it !!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Cathy"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "phillip calandra"}]