[{"rating": 3.0, "review": "Very easy set up.  Great if you subscribe to Prime; limited if you don't.", "verified": true, "helpfulness": "0/0", "author": "Douglas N Reinholtz"}, {"rating": 3.0, "review": "I have and regularly use the Fire TV Stick, Roku 3, and Chromecast.  Each have their strengths.  The Fire TV Stick provides the best interface into your Amazon content.  However, by optimizing the experience for Amazon content, I find it has made access to non-Amazon content to be a non-optimal experience.  It's easier and faster to use the Roku for content like Netflix, Youtube, Pandora, etc...  So if you plan to spend most of your time accessing Amazon content, go for the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Steven E."}, {"rating": 5.0, "review": "Good buy for prime users to make a dumb TV smart", "verified": true, "helpfulness": "0/0", "author": "Paul Simanauskas \"I shall name thee \"Stabatha\"\""}, {"rating": 1.0, "review": "I never had any problem with Chrome Cast I only switched to Fire Stick to view Prime movies.  The Fire Stick constantly loses connection to the internet.  Never had the problem with Chrome Cast so it is NOT a WIFI issue.  I am soooooo incredibly disappointed in this product!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey A. Shelton"}, {"rating": 5.0, "review": "Love this. Thought my ChromeCast was great.... and it is....but this is even better.  I can stream Prime with the Firestick.  Works great.", "verified": true, "helpfulness": "0/0", "author": "laurie aldridge"}, {"rating": 5.0, "review": "This is my first purchase for this type of item and I would like to say - AWESOME!!!!  I was streaming with cables from my laptop previously.  May I just say No More :-)  This Fire TV Stick is user friendly, easy to set up and works like a charm.", "verified": true, "helpfulness": "0/0", "author": "PAMELA KING"}, {"rating": 3.0, "review": "Works off and on with amazon prime.  Sometimes will not work states internet connection to slow but other systems seem to work fine. So when it works it is great otherwise frustrating", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutely awesome!", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "robert jackson"}, {"rating": 4.0, "review": "It's addicting", "verified": true, "helpfulness": "0/0", "author": "Jo-Anne Whalen"}]