[{"rating": 4.0, "review": "WORKS GREAT WITHOUT HAVING TO LOG IN WITH THE COMPUTER - PLUS MY SON LOVES THE GAMES", "verified": true, "helpfulness": "0/0", "author": "Jody Miller"}, {"rating": 5.0, "review": "I love the fire stick. It basically turned my 6 year old TV into a smart tv. It certainly is better than having to buy a brand new smart tv.", "verified": true, "helpfulness": "0/0", "author": "Bookworm"}, {"rating": 5.0, "review": "So happy with this purchase.  I have a WD media player that does similar things, but wanted something that was easily portable.  This definitely fits the bill!  I like how easily accessible amazon prime movies and shows are and the reliability of playback has been great.  Very little to no buffering as I experienced with other devices.  I would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "A. Young"}, {"rating": 4.0, "review": "its ok", "verified": true, "helpfulness": "0/0", "author": "sam691"}, {"rating": 3.0, "review": "Doesn't work very well with my router. I've bought a new router because I needed one anyways but even this did not seem to solve the problem. I always get connection issues causing me to have to restart the Fire Stick. Get use to the network connection error message. Still slow to load when I am in the middle of movies.(Buffer City)Commercials show Gary Buesy holding a stick. You actually need an external power cord they do not show in the commercial or in the display picture. Power cord comes with device but was still kind of disappointed to have to plug it in versus having it powered by the TV port.", "verified": true, "helpfulness": "0/0", "author": "Ross Gallant"}, {"rating": 4.0, "review": "Not enough selection", "verified": true, "helpfulness": "0/0", "author": "Laura M. Ruane \"freelance photographer\""}, {"rating": 5.0, "review": "Awesome. Love it.", "verified": true, "helpfulness": "0/0", "author": "Christopher N Conti"}, {"rating": 5.0, "review": "Easy setup.  Works great!!", "verified": true, "helpfulness": "0/0", "author": "Monika"}, {"rating": 5.0, "review": "I am in love, much better than my Chromecast on many accounts.", "verified": true, "helpfulness": "0/0", "author": "JRameau"}, {"rating": 4.0, "review": "It's a good product!! But some times fails with the internet connection. I think that could be an improve", "verified": true, "helpfulness": "0/0", "author": "Diego Loaiza"}]