[{"rating": 4.0, "review": "So technology isn’t my thing.  I just want to turn on my TV and watch TV.  But my 20 something kids came for a visit and brought a Amazon Fire Stick with them and we were hooked.  We played games on together, we watched Netflix and Amazon Prime shows.  My son showed me how easy it was to use and I said, yes, order me one please!  It came and even without the kids around I got it hooked up and have been using it to enjoy all sorts of shows.", "verified": true, "helpfulness": "0/0", "author": "clemson mom"}, {"rating": 4.0, "review": "Great product once you get it going. The lack of instructions make the set up a bit challenging, especially the remote battery door. I actually had to google how to open it. Once up and running, it is a wonderful product", "verified": true, "helpfulness": "0/0", "author": "Robert Lynn"}, {"rating": 4.0, "review": "Pretty good so far.  I also have the Amazon Fire TV, which is a bit faster but not night and day difference.  My main reason for buying the stick was for the price and it's portability b/c I like to stream when I travel and watch on a TV instead of a computer.  The set-up was easy, same layout as FireTV menu.  The only thing I've noticed is that it has cut in and out a few times during viewing.  It lasts but a second and doesn't make you start from scratch.  Similar wait when streaming is \"buffering\", just that it goes black instead of seeing the buffering percent).  Don't even know if that's why it's doing it.  Hopefully it will work itself out and won't be a constant issue.Overall  - great product for price and portability....just need to work on cutting in/out (if it remains an issue).", "verified": true, "helpfulness": "0/0", "author": "Canfit"}, {"rating": 5.0, "review": "Amazing! Love it, love it,  love it. I never truly utilized my prime tv and movies until i started using this. SO EASY. Just plug it in and it's ready to go. I love that netflix and other apps you may just to view tv/movies or listen to music(pandora) are on there too. Perfect for get togethers as well!", "verified": true, "helpfulness": "0/0", "author": "SkinCareFanatic"}, {"rating": 5.0, "review": "Affordable, easy to use.  Love the phone app for remote usage.  Smooth playback, easy set up.  Easily worth the money, especially since you don't have to find space for a gaming console or box unit to access the same entertainment.  Make sure you have an outlet handy to plug in the Fire TV stick (it needs an external power source).  Very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Robertson"}, {"rating": 5.0, "review": "We already have been using the larger Amazon Fire TV box and game controller, so we know the prime use of this product.PROWorks greatSet Up fastCONController lesser quality than the full Amazon Fire TV unit (Feels cheaper)OVERALLWorks great, Great Price, Would buy again if I add another TV to our house hold.Buy it if you use Netflix, Prime, You Tube on your TV", "verified": true, "helpfulness": "0/0", "author": "Harry Dresden P.I. \"fuego\""}, {"rating": 5.0, "review": "Coolest thing ever.  Everything I need.", "verified": true, "helpfulness": "0/0", "author": "Dominique Knaus"}, {"rating": 5.0, "review": "Very simple to install and use. You  plug it into your HDMI port then plug the power cable into the stick and the other end into a USB port or a wall outlet. Plug it in then go to your TV's input button on your remote, select the location where you plugged it in and follow the promopts. You put in your wifi password and you're done.  The fire remote is easy to use. We were using our wii box to watch Netflix but the controllers are a pain for that. The Fire stick is much better for our Amazon Prime and Netflix. It's so great, I'm thinking about dumping cable and subscribing to Hulu.", "verified": true, "helpfulness": "0/0", "author": "Ipodcrazy"}, {"rating": 5.0, "review": "LOVE THIS PRODUCT! No joke. I was hesitant at first, but its gone beyond my expectations. The quality is PERFECT on the tv. Its very clear and just great. I am so happy I got this product. Now I can enjoy everything again all on one hdmi channel!", "verified": true, "helpfulness": "0/0", "author": "Alexis"}, {"rating": 5.0, "review": "Hooked up easily, use every night a real joy and easy to use...have 2, only one now works.", "verified": true, "helpfulness": "0/0", "author": "Jimpasz"}]