[{"rating": 5.0, "review": "I really love it!", "verified": true, "helpfulness": "0/0", "author": "Gary W. Hall \"Proud reader\""}, {"rating": 5.0, "review": "With Prime Membership, there are so many choices of things to watch.  Love it so far....", "verified": true, "helpfulness": "0/0", "author": "Michael A Nopper"}, {"rating": 4.0, "review": "So far we love this device! Haven't  had a chance to use all of the Apps yet but we are enjoying  it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "We loved it at first, but in recent weeks Fire Stick keeps stopping during a movie to reload.  On Friday February 20 we were watching  \"Predestination\"  and it stopped dozens of times.  Problem got progressively worse as evening continued.  Tried rebooting, unplugging Fire Stick, everything, to no avail.  Will be seeking a refund on what was a lousy movie rental experience.  We'll dump Fire Stick if this problem is not resolved.", "verified": true, "helpfulness": "1/1", "author": "Steve Y"}, {"rating": 3.0, "review": "lags a little and cant hook up sound sytem for audio.", "verified": true, "helpfulness": "0/0", "author": "Abel Moreno"}, {"rating": 5.0, "review": "Love my fire stick every amazon prime person should have this product. It is easy to use one of my better purchases", "verified": true, "helpfulness": "0/0", "author": "Dennis Miller"}, {"rating": 5.0, "review": "I would order this Fire TV Stick again in a heartbeat!!!  I love the fact that all I have to do is push any button on my the remote and not only will it turn on my TV but will also turn the TV to the correct input.  I was able to set it up in about 15 minutes.", "verified": true, "helpfulness": "0/0", "author": "DivaMama"}, {"rating": 5.0, "review": "I like the way this product works. Easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Awesome!  Amazon Firestick, where have you been all my life?", "verified": true, "helpfulness": "0/0", "author": "Tracie"}, {"rating": 4.0, "review": "This item is great.  Only reason I give it 4 stars is because Amazon Fire TV box is better.  Goes well with Amazon Prime if you have it.", "verified": true, "helpfulness": "0/0", "author": "A Dad \"Chris\""}]