[{"rating": 5.0, "review": "It works great!", "verified": true, "helpfulness": "0/0", "author": "Janice Monson"}, {"rating": 4.0, "review": "Great value. I wish it had Chromecast-like features, but I'll take Kodi/XBMC unofficial support, 1080p and a remote. The Miracast display mirroring function does not work at all though.  Tried it with an HTC One M8 and Moto X.", "verified": true, "helpfulness": "0/0", "author": "Dan N"}, {"rating": 5.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "Julio"}, {"rating": 4.0, "review": "Doesn't have HBO Togo  appwhy?", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 5.0, "review": "This is the streaming device that I have been looking for! I bought the Fire TV Box, and am ordering two of the Fire Tv Sticks! I absolutely love them! As a Roku owner ( Roku 1, Roku LT, and Roku 3) I thought Roku was the way to go, but after getting my Fire, I now know that this is the streaming device that everyone needs to have. Lightning fast and responsive, with great features! in fact I began storing my videos and photos in the Amazon Cloud Drive because if the Amazon Fire. Couple it with a way better Plex experience than what is on my Rokus and you have a winner. The power you need, the speed you want and the games are outstanding. My whole family agrees that Roku is out...and Amazon Fire is here to stay! This is the media streaming device you want! Click buy!", "verified": false, "helpfulness": "1/1", "author": "Christopher Smith"}, {"rating": 5.0, "review": "I received as a gift and I just love it.  In the past, I watched my favorite Prime shows on my Kindle.  I can now watch on my TV.  Very easy to use.  Many choices.  I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Jennie Frelich"}, {"rating": 5.0, "review": "I love my Fire TV stick, I've had it about 2 weeks now and I use it all the time, the ability to use applications like Pandora, Netflix, TEDtalks, and dailyburn with just a few clicks is awesome.  There are also tons of movies and tv shows included with the Prime membership and the rent or purchase options are not priced to badly.", "verified": true, "helpfulness": "0/0", "author": "Jess"}, {"rating": 4.0, "review": "Like the title says, this product is pretty great.Pros:You can watch full HD videos on Netflix, Hulu Plus, HBO GO or whatever you want. The video quility is great.It's pretty speedy and you can play games on it, which are pretty decent. The remote helps with the games and whatnotIt's great to access content if you have amazon prime.Cons:Can't use the school internet if you live in the dorms.If you don't have amazon prime, the amazon content can be quite overwhelming to look at.Can't wait for an update to be able to use it in my dorm, until then I'm still stuck using the WiiU.", "verified": true, "helpfulness": "0/0", "author": "Brian Garcia"}, {"rating": 4.0, "review": "Provides easy access to movies and TV series very easy to operate.", "verified": true, "helpfulness": "0/0", "author": "Sandra Bryan"}, {"rating": 5.0, "review": "I love it! It is easy to work and was easy to install.  I wish I could get some of the old TV shows like Barney Miller, MASH, I Love Lucy, etc. But that has nothing to do with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Adriane Zindell"}]