[{"rating": 5.0, "review": "Easy to install and easy to use. What a great product#", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "awesome invention!! who needs cable anymore?!:)", "verified": true, "helpfulness": "0/0", "author": "Jodi Baker"}, {"rating": 5.0, "review": "This thing is awesome. Received it faster than they said.", "verified": true, "helpfulness": "0/0", "author": "MelissaC"}, {"rating": 5.0, "review": "Really amazed at what amazon has created, best money I've ever spent and recommend it to everyone.", "verified": true, "helpfulness": "1/1", "author": "Mike"}, {"rating": 5.0, "review": "Love the Fire Stick.  Still exploring the numerous option.  Was able to cut down my cable cost using the Stick and get stuff I couldn't get with my cable company.", "verified": true, "helpfulness": "2/2", "author": "Clyde Haley"}, {"rating": 5.0, "review": "love it, it's so easy to use and easy to set up", "verified": true, "helpfulness": "1/1", "author": "TheDoctor"}, {"rating": 5.0, "review": "I test Chromecast  and AppleTV, and  definetly chose FireTV Stick", "verified": true, "helpfulness": "1/1", "author": "Ramon Castro"}, {"rating": 1.0, "review": "no games i really was hoping to play some android games but low specs won't let it i will buy the box next.", "verified": true, "helpfulness": "0/1", "author": "D. Hawkins"}, {"rating": 5.0, "review": "I love this!!! We cancelled cable and bought this. We already had Amazon Prime and we signed up for Netflix and we don't miss cable at all and save over $100 a month. The fire stick is very easy to hook up and use. It is easy to flip through the apps and find shows. I wish we would have bought this when it first came out!", "verified": true, "helpfulness": "2/2", "author": "StanleyJ"}, {"rating": 5.0, "review": "I've been looking high and low for a device that can get my spotify sounds to come out of my TV. FINALLY I found Amazon Fire TV stick. It's got all your standard apps plus Spotify Connect which is everything I ever hoped for. Also, I'm definitely feeling this little remote guy. I have Google Chromecast also and I'd say they are similar products but function a little differently. Chromecast operates from apps on your phone. Amazon Fire TV stick is completely self sufficient and doesn't require a phone to operate although essentially you can use both products to control apps on your TV. I like Amazon Fire TV stick a little bit better than Chromecast if I'm honest.", "verified": true, "helpfulness": "2/2", "author": "OnlineAddict72"}]