[{"rating": 5.0, "review": "Great product bought if for the tv in my sons room so the could use my prime Hulu and Netflix. They love being able to watch there favorite movies and shows anytime.", "verified": true, "helpfulness": "0/0", "author": "Isabella Thacker"}, {"rating": 3.0, "review": "Just got done installing and using the Fire stick. Despite all the issues I've read the installation went without a hitch. The device was pre registered, and connected to my network quick. I only used it for Amazon videos, which was my intention all along as I have Chromecast for pretty much everything else. I also have an old Roku that I currently use for Amazon. The stick would have replaced that device.In short it's going back. The issue is picture quality. While I don't have fastest internet it's plenty enough for HD streaming as it is evident from my other devices. With the stick however the picture looked bit starved, lots of shimmering and pixelization all hallmark of low quality streaming. Of course most people would think it's their network speed, but soon as I switched back to Roku, also connected wirelessly the quality of the picture looked way superior instantaneously. There was also buffering and stuttering with the stick, which never happens with the Roku.I think the issue is with the wireless radio in the stick, which is rather surprising since the Fire Tablets are regarded highly in that regard, and Amazon claims they use the same technology, but not sure if they use the same chip.BTW I installed the stick on the back of my A/V Pre amp, the same fashion as my Chromecast, as this is the only way to get 5.1 sound in my system, which it did via DD+ so no problem there.All in all it's a good product with a good UI and good remote, however it needs a better WiFi radio or CPU which ever hinders it's ability to produce high quality picture. I had requested  a return this morning.YMMV", "verified": true, "helpfulness": "0/0", "author": "The Hun \"thehun\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "jared"}, {"rating": 5.0, "review": "I DO love it....has better features compared to Roku.  Why did Amazon wait so long to put this product into the market ? It is really great and it uses the full screen on my Philips HD TV, too !  I'm buying another one for my bedroom TV and one for a Christmas gift.", "verified": true, "helpfulness": "0/1", "author": "CadiMan"}, {"rating": 4.0, "review": "Pretty easy.  But I didn't realize that it required an additional connection by USB for power.  Other than that, it's pretty good", "verified": true, "helpfulness": "0/0", "author": "TonyB"}, {"rating": 1.0, "review": "Terrible", "verified": false, "helpfulness": "1/3", "author": "Jacob Nissen"}, {"rating": 4.0, "review": "if your TV is not that \"smart\" this is a great cheap option to upgrade it and get all the extra links like Amazon Prime movies, Pandora, etc.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Becks\""}, {"rating": 5.0, "review": "Beats Apple TV.  That's all you need to know.", "verified": true, "helpfulness": "0/0", "author": "shiprocks \"Bill\""}, {"rating": 5.0, "review": "Easy set up and go....works as described", "verified": true, "helpfulness": "0/0", "author": "beacon"}, {"rating": 4.0, "review": "Everything I expected and more. Im taking Prime over Netflix", "verified": true, "helpfulness": "0/0", "author": "Joemoe"}]