[{"rating": 5.0, "review": "Great for when you travel and there is nothing on tv worth watching.", "verified": true, "helpfulness": "0/0", "author": "David Garcia"}, {"rating": 5.0, "review": "You're going to Netflix and chill so hard with the Fire TV stick they're going to call you Val Kilmer. The Fire TV stick is the \"Everybody Loves Raymond\" of wifi-only streamers; the streamer you know you want, but you wouldn't want to tell everyone you enjoy it (though you can hide it literally anywhere on the TV with the HDMI extender). I own a Chromecast as well, and I have to say Fire TV is a serious contender. My only complaint: at the time of writing this review, there is no YouTube app (at least I was shocked by this).", "verified": true, "helpfulness": "0/0", "author": "Mark A Zavala"}, {"rating": 5.0, "review": "easy to set up, under 5 min. Went right to amazon prime and netflick as advertised with no problem", "verified": true, "helpfulness": "0/0", "author": "william mullen"}, {"rating": 1.0, "review": "in the description of the item , it is not specified which does not work OUTSIDE THE USA.en la descripción del artículo, no se especifica que no trabajan fuera de EE.UU.NO FUNCIONA FUERA DE USA basura", "verified": true, "helpfulness": "0/0", "author": "Eshop"}, {"rating": 5.0, "review": "My favorite niece gave me the fire stick as a birthday gift and it took me forever to connect it to my TV.  I'm somewhat technologically challenged.  What an amazing device.  I love that I can watch Netflix and listen to music on my phone.  I'm still figuring out all the possibilities.", "verified": true, "helpfulness": "1/1", "author": "chiweb"}, {"rating": 5.0, "review": "Awesome tool on television you can't beat it!", "verified": true, "helpfulness": "0/0", "author": "Richard Morton"}, {"rating": 5.0, "review": "Fast and furious. Works sharp. Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Raymond Perez"}, {"rating": 5.0, "review": "It exceeded my expectations and is as good if not better than apple tv.", "verified": true, "helpfulness": "0/0", "author": "Jhon Cores"}, {"rating": 5.0, "review": "Husband loves this. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Tonia Hargett"}, {"rating": 5.0, "review": "Better than cable. It works great", "verified": true, "helpfulness": "0/0", "author": "Sharee"}]