[{"rating": 5.0, "review": "Great addition to have more movie choices,can take with you on vacation.", "verified": true, "helpfulness": "2/2", "author": "roger"}, {"rating": 5.0, "review": "easy to install, runs fast and streams video without a hitch, impressive for such a small device", "verified": true, "helpfulness": "2/2", "author": "Mauro Oliveira \"Rated M\""}, {"rating": 5.0, "review": "Just received it today and usually don't write a review until I've had a product for a while but this is too easy.  Product worked as advertised, period.  The only function I wanted to talk about was connecting it to the TV.  In the reviews I read on this thing, there were only a couple touching on a question I had.  Would it work connecting it through an A/V Receiver instead of plugging directly into the TV?  One review said it absolutely would not work through an A/V Rcvr.  Don't know what he had for a receiver or TV or how he was connecting it, but I have a Sony A/V Receiver and plugged the Fire Stick into one of the HDMI ports on the back. Turned on the Sony unit and the TV and immediately saw the opening screen for the Stick.  Went through the whole setup, it found my network, asked for my P/W, went to my network and checked my internet speed and in about 15 seconds the intro screen came on with the intro video and then the Menu opened.  Tried a movie and watched it for about 10 minutes, no jumping, no buffering, just a smooth great picture and great sound coming through my 7.1 receiver.  Plan to move some pictures to the Cloud to watch on the big screen.  Have music already in the Cloud so played it and came through my sound system beautifully.Nothing else to say but Thanks Amazon, for a great product.  Great investment for the price.", "verified": true, "helpfulness": "4/4", "author": "Larry G. Roberts"}, {"rating": 5.0, "review": "Great product but had to return it and buy it from Best Buy.  They are offering it for $15 cheaper and amazon wouldn't match the price.  Good thing it's so easy to return products to Amazon.", "verified": true, "helpfulness": "1/1", "author": "Paul J. Mirabella Jr."}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Holger Menendez Alava"}, {"rating": 5.0, "review": "Smart stick for netflix and apps on the large screen.", "verified": false, "helpfulness": "0/0", "author": "Burl Johnson"}, {"rating": 5.0, "review": "I take it on trips with me to see movies on Hotel and condo wi-fi.", "verified": true, "helpfulness": "0/0", "author": "Barron L. Rothberg \"BLRAtlanta\""}, {"rating": 4.0, "review": "Works great keeps my little one happy has a good selection of movies and shows", "verified": true, "helpfulness": "0/0", "author": "kayla"}, {"rating": 1.0, "review": "Complete waste of money.  I have a good WIFI signal in my bedroom, but I continue getting messages that the connection is too slow.  Nothing but the spinning circle... forever.", "verified": true, "helpfulness": "0/3", "author": "C. Apley"}, {"rating": 4.0, "review": "great compared to the chrome cast minus browser casting", "verified": true, "helpfulness": "0/0", "author": "simple user"}]