[{"rating": 4.0, "review": "Live the fire stick ... Took a couple of tries to get it setup but works great now. I have a variety of movies at my fingertips. Great value", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 3.0, "review": "Appears to be some software issues. We have to unplug, then plug the fire stick in almost everytime we try to use it just so it works. Also disconnects from the Internet and won't recognize signal until it's reset.", "verified": true, "helpfulness": "1/1", "author": "TravandKim D'Amico"}, {"rating": 5.0, "review": "Loving my Fire Stick! Set up was just as the instructions stated. Started watching programs right away! First purchase was seamless. No complaints! Easy to search with remote and save to watchlist. Wish my husband would let me cancel our satellite network!!", "verified": true, "helpfulness": "0/0", "author": "Kristi B"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "jeffery"}, {"rating": 5.0, "review": "I was not expecting much with this been the first one but I'm glad I got it. It's easy to use right from the box. No problems so far.", "verified": true, "helpfulness": "0/0", "author": "E.v"}, {"rating": 5.0, "review": "Just one word...\"WOW\"", "verified": true, "helpfulness": "0/0", "author": "Fred Baetz \"moviefan\""}, {"rating": 5.0, "review": "Fire stick is much easier to use than the chrome was,", "verified": true, "helpfulness": "0/0", "author": "Mary Lou Breunig"}, {"rating": 3.0, "review": "Had trouble updating the firmware.  Once updated, it worked OK.", "verified": true, "helpfulness": "0/0", "author": "Keith Windsor"}, {"rating": 5.0, "review": "There's so much available through Amazon Prime, but watching it through my Samsung \"smart\" (really \"stupid\") TV was grueling... lots of waiting and loading and pressing many buttons to get where you wanted to go.  With the Amazon Fire TV Stick it's instantaneous! We absolutely love it. It saves so much time and eliminates frustration.", "verified": true, "helpfulness": "0/1", "author": "D. Holt"}, {"rating": 5.0, "review": "The Fire stick has exceeded my expectations. I would recommend to others.", "verified": true, "helpfulness": "0/0", "author": "Jamie S. Davis"}]