[{"rating": 5.0, "review": "To give this review some context, I'm also a long-time user of the original \"full sized\" Fire TV, which I bought on the day of release. It's in constant use, so much so that we decided to buy this Fire TV Stick for the TV in the kitchen. I think they both have different strengths and weaknesses. I hope this review will help you choose between the two versions.## What do you need to make it work? ##You need a decent WiFi signal in the location you intend to use the TV, and preferably an unlimited data package (otherwise, video streaming will burn through your data allowance in no time).Your TV must have an HDMI port. [Edit 29/4/15: you can even use a computer monitor if it has speakers and an HDMI port that supports HDCP (HD Content Protection). Pretty much every TV made since 2003 will have this, but many monitors do not].The device works best if you have an Amazon Prime subscription, which is an extra £79/year. This is required to access the large library of free movies and TV shows (movie rentals are £3.49 each for non-members). You can install Apps for Netflix, BBC iPlayer, and other purveyors of fine video content, but really, all the emphasis is on Amazon's content, and the majority of the home screen is devoted to showcasing their latest movies & shows. You won't get the best out of this thing unless you're a Prime subscriber.## Setup ##The Fire TV Stick is tiny, and can be hidden behind a TV in seconds. Yes, you can buy a mount that holds the bigger model, but the Stick is a much cleaner solution. A short HDMI extension cable is included, which is handy if your TV has awkwardly-positioned ports. Power is supplied by a small USB wall adapter. My TV has a USB port, but it doesn't supply enough power for the Stick.Setup is easy. Your Amazon account details are already programmed into the device (they're easy to change, though). All you have to do is enter your WiFi password, using a simple on-screen prompt. There's no need to go hunting for obscure settings. After a short introductory video, everything is ready to go. The interface is a piece of cake. There is a list down the left side of the screen, allowing you to select Movies, TV Shows, Apps, Music or Photos. The music tab allows you to play anything you have bought from the Amazon mp3 store (including the mp3s you get with AutoRip CDs). The Photos tab allows you to view any images you have uploaded to Amazon Cloud driveVideo quality is excellent. When I stream Amazon Instant video from my laptop, there is an annoying buffering period. The Fire TV Stick pre-loads shows as you browse the description (this is what is meant by the so-called \"ASAP\" technology). The result is that videos start playing almost *instantly*.## Remote control ##The supplied remote is great. It connects by Bluetooth which is much, much faster than an Infra-red remote, and it doesn't matter which direction you point it. It comes already paired to the stick, so again, no setup is necessary.It doesn't have the speech recognition feature of its larger sibling. Should you buy the optional Voice Remote? I would say no. Voice search is undoubtedly a cool feature when you first use it, but as a long-term owner of the \"big\" Fire TV, I rarely use it, for a number of reasons. Firstly, I don't often need to search, as the home screen is well organised, and puts all the popular content and recent additions front and centre. Secondly, 9 out of 10 times, the voice search leads to paid content (rather than \"free with Prime\"). Thirdly, and most importantly, voice search doesn't work within third-party apps.Besides, if you're going to spend £25 on a remote, you might as well get the full-sized Fire TV for just a little extra. Alternatively, you can get the feature for free by downloading the \"Fire TV Remote\" app for iPhone or Android.## Portability ##For me, the key feature of the Stick is that it's more portable than its big brother. If you think portability isn't important, then you have never spent a rainy bank holiday at the in-laws' with 2 kids.You just need access to WiFi, enter the password, and you're off. It even worked when connected to my phone's \"mobile hotspot\" mode. I was not able to log into our local public WiFi (\"The Cloud\"), though.## Apps ##The built-in App Store has hundreds of Apps that can be downloaded directly. Most are free, such as YouTube or Vimeo, but there are two paid apps in particular that are worth the money:Plex (Free, with optional in-app purchases) is an app that can stream media from your computer hard drive. It requires the installation of a free \"server\" app on your PC or Mac. This is an easy job that only needs to be performed once. It's very useful if you already have a large media collection.Secondly, Apple users who have imported a lot of non-DRM video will want to check out the £1.78 AirReceiver app. This enables the Fire TV Stick to act as an AirPlay device, to stream music or video from iTunes/iPhone etc. The quality is just as good as my Apple TV. Might be helpful to know this if you are trying to decide between the two devices. Note that this will only work with video you have imported to iTunes yourself - protected files from the iTunes video store don't work.## What's missing? ##There aren't many features that you'll miss versus the full-size Fire TV, but depending on your circumstances they might be important:Voice searchAs mentioned above, you need to purchase an additional remote, or use a smartphone app, if you want this feature.No wired ethernet connectionIf you have a poor WiFi signal, you may need or prefer a wired connection. An easy way to test is to take your smartphone or laptop to the exact location you want to use the Fire TV Stick. If you have only 1 or 2 bars of WiFi signal, this might be an issue for you.No optical audio outputIf you have a fancy home audio system that can accept an optical input, you may want the full-sized box to get the full Dolby Digital experience. Of course, many modern AV receivers are able to decode the Dolby Digital signal via HDMI anyway. Also, if you're using your TV's speakers, this won't matter.Processor speed and memoryI have been using the full-sized Fire TV on a since last year. I honestly didn't notice any difference in performance until I directly compared both devices in the same room; the Stick is a little slower to update menus, sure, but it's still orders of magnitude more responsive than the menus on my TV or Humax DVR. Processor speed is only going to be an issue if you play a lot of games (and, really, if you're a serious gamer, wouldn't you use a console anyway?).## Recommendation ##The omissions mentioned above will be irrelevant to the majority of people. If you have terrible WiFi connectivity, want voice search, optical audio, or plan to play graphics-intensive games, you should look at the \"big\" Fire TV. For everyone else, the Fire TV stick is a good buy.## FAQs ##Q: Does the Fire TV Stick display subtitles?A: Yes, but this depends on the video actually having subtitle support. A lot of older content on Prime Instant Video doesn't support subs. They are getting better at this - around 60% of new releases have subtitles available.Q: Can I use it outside the UK?A: You can run apps and games anywhere, but in order to access Amazon Instant Video movies and TV shows, you must be physically present in the UK and have a UK billing address.Q: Can you play Prime Video content on 2 devices at the same time?A: Yes, provided you have fast enough broadband, you can use multiple Fire devices at once in different rooms.PS: I hope you find this review helpful. If not, please leave a comment so I can address any queries, errors or omissions.", "verified": false, "helpfulness": "3/3", "author": "Henrietta Emerick"}, {"rating": 5.0, "review": "I purchased the second Fire Stick for a friend. I love the ease of use and the ability to watch movies anywhere you go on a bigger screen.  Sure, I can watch a video or stream on my laptop but why not use a 55 inch TV or even the 40 inch in the hotel room for a better quality picture.  I thoroughly enjoy the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Jimmy B. Morgan"}, {"rating": 4.0, "review": "Enjoying the firetv stick. Takes a little getting use to but easy to use and very convenient. No issues and would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "dominique root"}, {"rating": 4.0, "review": "It's great, except for the MLB app. It freezes. Otherwise, all others apps are great.", "verified": true, "helpfulness": "0/0", "author": "Micah Kaskavage"}, {"rating": 5.0, "review": "Between Amazon Prime & Netflix, you got all the movies you want. Can drop Showtime, HBO, etc., on cable or satellite providers and save some money. Super easy install & setup. Must have good Wi-Fi signal. Find the stick gets pretty hot the longer it runs. Then it gets kind of quirky. Running straight for 8 hours seems to be OK. After that, becomes a bit hot and quirky. But a couple hours down-time & you're good to go again. Great for the price.", "verified": true, "helpfulness": "0/0", "author": "Elaine M. Bell"}, {"rating": 3.0, "review": "No web browser included so I returned it ;(  Maybe the future will bring updates and I would happily try it out again.", "verified": true, "helpfulness": "0/0", "author": "Stacy H"}, {"rating": 4.0, "review": "Easy to install and use.  Have to say I am disappointed in the number of movies and tv series available for free under prime.  Found some I would like to watch but most of what I would like to watch is either unavailable or I have to pay to watch them.  And I prefer older shows and movies, not the latest.  There is so much more to watch on Netflix. The advertising for the Fire Stick is misleading as it makes it sound like there are all these free movies etc to pick from for free viewing when the free choices are minimal.  I am retired  and on a fixed income so the lack of choices was a bit upsetting.", "verified": true, "helpfulness": "0/0", "author": "Sharyn \"swittrup1\""}, {"rating": 5.0, "review": "Super easy. We've had all of the Rokus (not wireless) except the stick.  We have a Dlink which is wireless, but timing is a bit off when using remote, delay is a real bug, but still use in other room.This new deal is great, easy to set up and so easy to use. Very customer ffriendly.", "verified": true, "helpfulness": "0/0", "author": "Bryn"}, {"rating": 1.0, "review": "Unstable wifi connection. Can't even stream Amazon Music without problems. I'll be going back to the Roku.", "verified": true, "helpfulness": "0/0", "author": "Nancy Thompson"}, {"rating": 3.0, "review": "Its great when it stays connected. Often the movie will not \"be available\" due to streaming problems", "verified": true, "helpfulness": "0/0", "author": "Alaya"}]