[{"rating": 5.0, "review": "It took me awhile to figure out how to work it but I love it! Have to force myself to turn it off at night and get to bed. With the same movies and shows on TV all the time, it was a great addition to my TV watching. I find it to be worth the money right now.", "verified": true, "helpfulness": "0/0", "author": "Smiling"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "deviouse25"}, {"rating": 5.0, "review": "I love this Firestick!  I have access to so much on my non-smart tv!!  No problems!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent product. It only took minutes to set up", "verified": true, "helpfulness": "0/0", "author": "Patricia Winters-Baker"}, {"rating": 5.0, "review": "It does it's job and my son loves watching cartoons on prime videos. Plus it's cheaper in price then other streaming sticks and does the same job.", "verified": true, "helpfulness": "0/0", "author": "Stanley Flores"}, {"rating": 5.0, "review": "I recommend this product , it's simple and super easy to use ! And it's cheaper then cable every month !!! Subscribe to net flix and Hulu plus and your set . Tons to watch and then pandora is an option to . I haven't really went into it that much but I know there are games and much much more !!! Buy this !!! Best $40 I ever spent", "verified": true, "helpfulness": "0/0", "author": "Paola Errante"}, {"rating": 1.0, "review": "I was happy with this until they started putting advertisements in between the series I've been watching. EXTREMELY ANNOYING. Especially since it's 5 times louder than the program. I even was considering buying another one for our other tv, but if there's no way to stop this I won't. Give me a break Amazon. I buy tons of stuff from you and am a Prime member. That REALLY SUCKS.  Would have been  5 star rating. Now you get a 1.", "verified": true, "helpfulness": "0/0", "author": "BethA"}, {"rating": 5.0, "review": "Amazing! Just plug it in and wow no set up. I use this in a bedroom that doesn't have a smart tv. It works just as well and is faster that my smart tv,", "verified": true, "helpfulness": "0/0", "author": "T. Smith \"Teresa\""}, {"rating": 4.0, "review": "Kept loosing a single so had to purchase a range extender", "verified": true, "helpfulness": "0/0", "author": "Virginia Kerbs"}, {"rating": 5.0, "review": "Best streaming product ever! Great price!!", "verified": true, "helpfulness": "0/0", "author": "Traci"}]