[{"rating": 5.0, "review": "Easy to use. Small but perfect. Easy to hook up. I have used it regularly now and I am very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Babs \"BJH\""}, {"rating": 5.0, "review": "I just received my stick and hooked it up. It was very simple to do. The only thing that I have used it for is netflix. I am very pleased with it. I am now considering getting amazon prime it looks like a pretty good deal.", "verified": true, "helpfulness": "0/0", "author": "miket"}, {"rating": 5.0, "review": "The best value of Set top box device on the market! It uses same Android 4.x system as Fire TV, so you can easily enable adb debug option and using adbfire to connect to it and loads tons of apk apps that designed for TV, fantastic!!! Can't explain how much I love it.", "verified": false, "helpfulness": "0/0", "author": "Michael Jones"}, {"rating": 5.0, "review": "Love it highly recomment", "verified": true, "helpfulness": "0/0", "author": "Son Phan \"SON -P\""}, {"rating": 5.0, "review": "Excellent.  Can't believe how fast and convenient this is to use.  Easy set up, intuitive navigation, and exceptional picture quality.  A real bargain for 39.99!", "verified": true, "helpfulness": "0/0", "author": "B. Baker"}, {"rating": 5.0, "review": "Love it. I can now use my Netflix, Hulu and WWE accounts without having to unplug the kids Xbox to do it. Easy to set up and easy to use, plus very affordable.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Soto Deon"}, {"rating": 5.0, "review": "This replaced my Chromecast. Much better investment.", "verified": true, "helpfulness": "0/0", "author": "MB"}, {"rating": 4.0, "review": "The Fire Tv stick works great!", "verified": true, "helpfulness": "0/0", "author": "macadoodle \"macadoodle\""}, {"rating": 5.0, "review": "Good,but sling buffs quite a bit so kind of optimistic about subscribing, other than that,good product and price is reasonable.", "verified": true, "helpfulness": "0/0", "author": "Edward Jacobs"}, {"rating": 5.0, "review": "I have two home theater systems, one with an HDMI receiver and an older one with a non-HDMI receiver.  I ordered the Amazon Fire TV to be connected to my non-HDMI receiver.  The connection is identical to my Apple TV.  Since I also ordered a Fire TV Stick at the same time, I initially connected both to my HDMI receiver for a side-by-side test.  Both worked well; however, both my wife and I agreed that the picture quality on the TV was slightly better with the Fire TV Stick.Other reviews stated that the Fire TV Stick will not work well when connected directly to the HDMI receiver instead of the TV, but I did not find this to be accurate.  To test the surround sound capability, I downloaded several \"action\" movies from Amazon Prime.  The surround sound appeared to be accurate.If any readers can suggest any very good Amazon Prime movies to additionally test the surround sound capability, I will gladly test and report the results.", "verified": true, "helpfulness": "0/0", "author": "ex-bomber guy"}]