[{"rating": 5.0, "review": "bought this for my brother.  He has an LCD tv that is not a smart tv.  Now he can watch Netflix, Amazon Prime and Hulu!", "verified": true, "helpfulness": "0/0", "author": "Kerry Bailey"}, {"rating": 1.0, "review": "Died within a couple weeks and then on back order so have to wait weeks to get replaced", "verified": true, "helpfulness": "0/1", "author": "lance"}, {"rating": 4.0, "review": "Love it. The only complaint I have is it should come with a longer power cord, because attaching it to a inside extension cord adds too much weight to it (I had to tape the extension cord to the wall to eleviate the extra weight).", "verified": true, "helpfulness": "0/0", "author": "Nicole Price"}, {"rating": 3.0, "review": "Maybe I need to spend more time with this new toy but it is not as easy to use as I expected. I also don't like the fact that I had to leave the stick plugged in.", "verified": true, "helpfulness": "0/0", "author": "Chris Ray"}, {"rating": 4.0, "review": "I have a blue ray player with apps and it is extremely slow. The fire stick is impressively fast and I love the iPhone app with voice search. I wish you could download Rhapsody, but I understand the competition.", "verified": true, "helpfulness": "0/0", "author": "Amanda Mihaly"}, {"rating": 1.0, "review": "This was very cool . However it is very unstable at first I thought it was my Internet. But hooked the old roku box back up and not a problem", "verified": true, "helpfulness": "0/0", "author": "Edward Northcutt"}, {"rating": 5.0, "review": "Until I bought the Fire TV Stick I was streaming through my Blu-Ray player.  Three remotes and 5 minutes what ever I wanted to watch would be up and running.  With the Fire Stick, swap the TV over to HDMI for input (it's normally on HD) and it's up off we go.  I don't have to change to audio, it continues to use my surround sound through the TV without changing the input, and streaming starts.  In less than a minute I can watch whatever I want.There is less buffering, as in none.  It experienced a little when I first set it up after that none.  Set up is less than 10 minutes, plug it in to the HDMI port, power into an outlet, find the wireless network, sign in, that is it.Great for binge watching a series.  One episode ends, the next is queued and ready to start without any input from me.I'm very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "can not make it turn on, I may have change router set up, i don't remember how, would take me half a day. not as simple as plug and turn on!", "verified": true, "helpfulness": "0/1", "author": "mike t reilly"}, {"rating": 5.0, "review": "Much faster and more responsive than going through a Blueray device.  It is particularly great with Amazon Instant Videos", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 3.0, "review": "I thought there would be more free movies", "verified": true, "helpfulness": "0/0", "author": "Linda Alvarado"}]