[{"rating": 4.0, "review": "Very slick and easy to set up. So far I like everything about it except I wish I could access my media on my LAN with it. Recommended for those who watch and listen to everything via the Internet. I have yet to figure out how to get to my personal photos and videos without putting them in the cloud first.I prefer this interface to the Chromecast, I think a traditional remote interface is better than having to use a phone or tablet. That is a good option, but shouldn't be required IMO.", "verified": true, "helpfulness": "1/1", "author": "MattB"}, {"rating": 2.0, "review": "UPDATE: I am leaving my original review at the bottom, since much of it is applicable still. After a few months of using this thing, I've decided to downgrade the rating to 2 stars because of 2 main issues. First:Video quality is not always great. I have very fast internet at home so this is definitely on Amazon's side. I think even their \"HD\" content is heavily compressed and possibly an interpolated frame rate as well. Some things look perfect, others wonky.Sound out of sync and/or crackling: This happens OFTEN, sometimes by as much as 1 or 2 seconds where the audio is either ahead of or lagging behind the picture. Sometimes pausing and restarting works, other times I have to shut the whole thing off and restart. This happens on average once per day. Other times there will be a lot of weird static noises. So far pausing/unpausing fixes it. Regardless, none of the other streaming devices I've used have this issue so it's kind of annoying.Amazon has a serious issue with not understanding how to design products for consumers.Amazon, we need to talk. Have you ever actually used an entertainment system? Do you understand how power strips work? Did you deliberately design your plug to be as small and inconvenient at the same time as possible? You can actually plug this in and take up three outlets in a typical powerstrip. I have 1 empty spot. Did you think that this strategy might force people to get rid of competing products? Have you ever seen the plug Apple uses? Notice how it tucks right in, taking up exactly the space it deserves and no more? LIKE MAGIC!Anyhow, the plug is awful. They also have a big warning about not using any other cables or plugs. After this unreasonably angry rant I plan on googling some specs to see if the apple plugs will work (it's just a plug with a USB port, so I assume it's fine). If not, I might return this.Let's get positive for a second: It works well! I briefly owned the other amazon TV roku copy, which had poor and shifting video quality and just a lot of wonkiness that seemed bad even in beta. When I got the offer to buy this for $20, I figured even if it is nothing more than a amazon prime/netflix/hulu player, that would be just fine.It had trouble setting itself up. I had to unplug it and start over twice (this was what the dongle suggested doing). I have fast internet that otherwise had no problems that night, but maybe Amazon was overloaded. Once updated, it puts you through an infuriatingly stupid cartoon with exceptionally patronizing instructions that you cannot skip. If I ever meet anyone involved in making this video I will punch them in the face (I'm not even kidding). Oh wait, be positive. The set up includes a handy moment where you can hit mute and go pee. Both me and my dog needed to pee so this worked out well. Adding insult to this cartoonish injury, the system is fairly well designed and intuitive. I had planned on using online help/the user manual if I got stuck, but I never needed to. If you are illiterate or possibly a dog, you might appreciate the video though.The video quality was a-ok! The system turned on quickly.One quirk: while watching an offering from Prime TV the audio and video got out of sync. Pausing and unpausing fixed it on the first try.I have a Sharp Smart TV. The TV's remote works with the Fire TV (both of them), which is great. I assume that means most universal remotes would also work.I haven't yet got the audio for my entertainment system back to full power (my new TV and old receiver are not compatible) so I can't comment on the audio performance. Unlike the fire box, this does not have an audio out other than the HDMI port. I really only care about having solid stereo audio (no surround sound or the like) so I don't think I'll care much about any possible limitations there, but something to consider.I was hoping I'd be able to mirror my ipad and occasionally laptop screen and right now it seems that is not possible, which is a disappointment. But, I would imagine this is something that can be fixed soon.Overall, so long as the plug issue can be resolved and get some sort of assurance or solution for mirroring a real tablet I will likely keep it, especially for $20. After the holidays we plan on canceling netflix so the convenience this thing will give us in accessing amazon prime alone makes it worth hanging onto. I don't think it's worth $40, but at the same time that's still not that much.", "verified": true, "helpfulness": "0/0", "author": "clevernonsense"}, {"rating": 4.0, "review": "No DLNA support, no Windows Media server functionallity.Turns a regular HDTV into a smart tv. The speed of the Amazon app is fast, some of the others are still as slow as the ones built into my smart tv. The firmware update took 3 tries, and I had to manually connect to wireless each time.Maybe Amazon Tech suport can update the firmware to add WMC or DLNA and make this a great all in one device?", "verified": true, "helpfulness": "2/3", "author": "Erin M."}, {"rating": 2.0, "review": "This device works better than the chromecast but its big downfall is that it doesn't support vudu or any other ultraviolet streaming service (chromecast does).Appletv doesn't have a vudu app but will allow me to cast a movie from my ios device to watch a movie.I understand not wanting competitors but amazon should either support UV or get a 3rd party app that does.Thanks", "verified": true, "helpfulness": "1/3", "author": "B-man"}, {"rating": 3.0, "review": "The video is not high definition. The screen seems gray. There is bug in the networking. Sometimes I can't do anything because it says the network in not connecting but the network works fine on my other devices. But it is easy to install and control. All in all not a bad product.", "verified": true, "helpfulness": "0/0", "author": "Heng Wang"}, {"rating": 4.0, "review": "I was one who got the stick for $19. Set-up was very easy, and was able to register my Netflix and Hulu accounts with it. However, when I tried to watch a Prime movie, it would pause every couple of minutes, which meant I had to keep hitting play to continue watching. That was pretty irritating. I was able to stream the same movie to my Chromecast from the computer, so I knew it wasn't my Internet connection. I was also able to watch Netflix movies and Hulu on my Chromecast with no issues.I called Amazon, and the rep said to reboot the router. I did, and it seemed to work fine after that. Time will tell, I guess.I like the simple remote, the interface is nice, but I just hope the pausing doesn't continue.", "verified": true, "helpfulness": "1/1", "author": "Hoosiermama \"Mary Loveless\""}, {"rating": 3.0, "review": "Over all the amazon fire stick is a great product, but it is in its infancy. Navigation is great with only a few quirks. Great video playback quality and speed, easy navigation, and very easy acess to amazon prime content.Pros:fast and easy navigationGreat video qualityIntuitive and beautiful UIDecent content.Con's:No way to attach external devicesNo access to Vudu movie serviceNo access to google play moviesWelcome how to video (that shows you how to use the remote) play AFTER you have to use the remote to set it up. Which is fine, but for some users might not be helpful.Extreamly limited apps not much to choose from\"Fling\" feature only works from fire products. No IOS or Android devices.In closing. Amazon fire stick is a Fantastic device for the price, but is still quite limited in ability. Great for Hulu, Netflix, and prime.", "verified": true, "helpfulness": "0/1", "author": "thomas l stewart"}, {"rating": 5.0, "review": "Bought this through an Amazon Prime introductory offer at a very low price, and am pleased so far.  It is definitely faster than my old Roku box, although there are fewer channels available on the Fire TV as of now.  Works as advertised.", "verified": true, "helpfulness": "1/1", "author": "SamBrad"}, {"rating": 5.0, "review": "Excellent Device!! I've had it for last 2 days and its running flawlessly; my other device had connectivity issues due to location of router and this one seems to be doing much better, I guess its due to its Dual band capability.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It works great!  That is if you have A PROVIDER other than CENTURYLINK OR DIRECTV neither of which have ESPN Watch available.", "verified": true, "helpfulness": "0/1", "author": "gpable"}]