[{"rating": 5.0, "review": "Love it. What a great buy.", "verified": true, "helpfulness": "0/0", "author": "rvilla"}, {"rating": 5.0, "review": "The fire TV stick plays much smoother than my Chromecast with much better image and sound quality even when playing Youtube videos. Of course, it plays Amazon videos very smoothly (my Chromecast has issues with Amazon instant videos even when I disabled silverlight).The remote is pleasant to hold and the stick is lightweight and easy to setup. I started finding my TV to be much more useful after this purchase.", "verified": true, "helpfulness": "0/0", "author": "Xiaoshan Cai"}, {"rating": 4.0, "review": "Great little streaming device.  Just missing HBO Go and a real Spotify app.  Hopefully they keep adding apps though.", "verified": true, "helpfulness": "0/0", "author": "D. Lievense"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Cynthia Paternostro"}, {"rating": 5.0, "review": "it works great", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 3.0, "review": "I HAVEN'T USED IT MUCH, SIMPLY BECAUSE I HAVE NOT HAD THE TIME.  THIS IS PROBABLY NOT A TRUE RATING.", "verified": true, "helpfulness": "0/1", "author": "dorothy"}, {"rating": 4.0, "review": "I'm watching it right now. Doesn't seem to be any lag. Setup was easy. I even downloaded the fire TV app to my smartphone and iPad. The app can use voice control. Only problem I see is that it needs power and the power cord may not be long enough to get to an outlet.", "verified": true, "helpfulness": "0/0", "author": "Mamacita"}, {"rating": 5.0, "review": "It could not be easier - great product", "verified": true, "helpfulness": "0/0", "author": "Sam Turner"}, {"rating": 4.0, "review": "works well if the buddy app worked would give 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Ami Dinsmore"}, {"rating": 5.0, "review": "Very easy to install and excellent streaming. I wish I had known about this before I purchased my Sony wireless LAN with built-in Wi-Fi Blu-ray Disc/dvd player.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Shelia A Gray"}]