[{"rating": 5.0, "review": "This is great, the best thing I've ever gotten.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 4.0, "review": "Great access", "verified": true, "helpfulness": "0/0", "author": "Marg"}, {"rating": 2.0, "review": "I got this as a replace item. But this one worked for few days and now it is no good compared to the previous item. Remote does not respond sometimes. Navigation is terrible. It just jumps from one menu to the other or back. None of the apps have quality. Should not buy any Amazon Fire products. I hope I can return this item. I would like to buy a 100% android product. Sometimes network error. My old roku and PS3 are much better then this device.", "verified": true, "helpfulness": "0/0", "author": "Manu"}, {"rating": 5.0, "review": "Amazon Fire Stick in one word- ADDICTING", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Does exactly what I needed it to.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "We love it!!", "verified": true, "helpfulness": "0/0", "author": "Beth B."}, {"rating": 4.0, "review": "I just wish some of the apps on the regular Fire TV worked on the Stick as well.  Hopefully more apps will be available soon.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 2.0, "review": "Was compared to chromecast and that is why I purchased your Fire TV Stick, but it doesn't come close.  Now I have to get chromecast.", "verified": true, "helpfulness": "0/0", "author": "lashan king"}, {"rating": 5.0, "review": "Great gadget for the price! Very easy to set up also!! Works very well with my wifi internet! The compartment on the remote control for the batteries was hard to open, but other than that nothing bad to say!! I would recommend this product to buy especially anyone who has Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Marie Wilhelm"}, {"rating": 5.0, "review": "Wish I would of got this a long time ago", "verified": true, "helpfulness": "0/0", "author": "Jeff \"bergue04\""}]