[{"rating": 3.0, "review": "I had high hopes for this device, but sadly it is not performing much better than the 2 roku devices I already own. When used in the same room as my router it keeps a connection fairly well, but even then loses the signal fairly often.  When used in the bedroom (very small house) it can rarely manage to play a single episode of anything without losing the signal.  When it does this I check the connection and the device reports that it sees the connection and that it is strong but cannot connect.  I never have any connection issues from any room when using my android phone so I have to conclude that the problem is in the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "federalwaychick \"FederalWayChick\""}, {"rating": 4.0, "review": "It's easy to use, but it could be easier.  Apps that I would like to use, such as Hulu Plus freeze on video while the sound continues to play.  When I followed Hulu's instructions to delete the cache and content, I noticed that I had a game app that cannot be deleted.  I have no desire for the game app, nor some of the other pre-loaded, un-deletable apps.  The remote is really user friendly, though I would like an off button.  The remote is really small and unfortunately easy to lose.", "verified": true, "helpfulness": "0/0", "author": "An on my mouse"}, {"rating": 3.0, "review": "We have both this and a Chromecast. For most Amazon Videos, Netflix and Plex needs, this works great!  Lots and lots of quirks with Plex, but that's not on Amazon.What is on Amazon is the sheer lack of compatibility with Amazon apps.  No CBS app, no Crunchyroll, no CW app, no NBC app... pretty much all the great channels that make Fire TV great, are NOT available for Fire Stick.  It's a shame... and maybe with time they will add support, but for $39, Chromecast is better (at $35).To be honest, for $19, it's not bad.  When it doesn't work, we just go \"meh\"...", "verified": true, "helpfulness": "1/1", "author": "Fabio Nishimura"}, {"rating": 5.0, "review": "I bought it mainly to stream from my NAS with Plex. It works great.", "verified": true, "helpfulness": "0/0", "author": "Michael B."}, {"rating": 5.0, "review": "Excellent Product and Service...", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "This is very easy to install and use, and it works very well.  I also have a Chromecast that I still use, but I find myself using the Chromecast less and less.  But I really love the dedicated remote that came with the Fire Stick - it is compact and has a great feel to it.  The screen saver photos are great - I just wish that the pictures were labelled with where they were taken.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 5.0, "review": "Great tool to stream all key apps. Waiting for HBOGO this spring. Had to download $5 Airplay/DLNA receiver Pro app to do mirror screen from my ios devicesON BEHALF OF HUNDREDS OF THOUSANDS OF CRICKET FANS, REQUESTING THE CREATORS TO PLEASE ADD WILLOW TV APP TO STREAM LIVE CRICKET", "verified": false, "helpfulness": "1/2", "author": "prasad vadvalkar"}, {"rating": 1.0, "review": "I am not impressed. I have used the fire stick a few times and every single time it gives me trouble. First wouldn't connect to the Internet, had to reset a bunch of time before getting connected. Now every time I use Netflix it always encounters some error message a few times before finally connecting. Once I finally get a show playing on Netflix it's constantly rebufferinng. I know for a fact its not my internet as I use my blue ray to play Netflix on another TV without ever an issue connecting or rebuffering. It has to be the Fire Stick that just doesn't work right. I was hoping for a better product.", "verified": true, "helpfulness": "1/3", "author": "EMM \"EMM\""}, {"rating": 5.0, "review": "It is way better then Chrome Cast. It is very easy to stream videos and movies. I recommend it to everyone. It is also very cheap.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this dongle! Works great out of the box. Setup is very easy and has a pleasant UI... gets the job done. The remote sure beats using an application like ChromeCast. Got one of those, too! Buy one, you'll like it.", "verified": true, "helpfulness": "0/0", "author": "Mark"}]