[{"rating": 5.0, "review": "I just love it! EASY to install. Works great, good picture.  I haven't even explored all that it can do. Very good price.", "verified": true, "helpfulness": "0/0", "author": "Theresa Cronin"}, {"rating": 5.0, "review": "Is a good divace,I like", "verified": true, "helpfulness": "0/0", "author": "Ramiro Resendiz"}, {"rating": 5.0, "review": "Love it. !!!!!!!", "verified": true, "helpfulness": "0/0", "author": "don vuj"}, {"rating": 4.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "NICOLE SHIRLEY"}, {"rating": 4.0, "review": "Works fine most of the time.  I use it for HBO, Netflix, and ESPN and all hanging momentarily, occasionally, particularly after long periods (weeks) without unplugging for a time.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "I am enjoying it very much", "verified": true, "helpfulness": "0/0", "author": "cammie jamrog"}, {"rating": 5.0, "review": "LOVED IT!  Bought  two and they are great.  Easy to set up, immediately sets itself up when plugged and you just look for Firestick name on your imput list.  Connect to internet and Wah Lah!  Done!", "verified": true, "helpfulness": "0/0", "author": "D. J. Georgetti Piro \"GFMOM\""}, {"rating": 4.0, "review": "Still exploring all the features. So far I have not been blown away with the selection. Reception is great.  Very clear. Easy to search.", "verified": true, "helpfulness": "0/0", "author": "Mari"}, {"rating": 4.0, "review": "Love this product the only reason I took away 1 star was because I keep getting a cache full message and after that I start to lag or what I'm watching starts buffering. Fix that bug and it's a 5star product for sure.", "verified": true, "helpfulness": "0/0", "author": "william vega"}, {"rating": 2.0, "review": "I have to say, I was a bit disappointed in the Fire Stick.  I didn't want to spring to run satellite to my basement, so bought the Fire Stick as an alternative.  The reviews were so glowing I thought it would be fantastic.  Once I had it plugged in, however, most content has to be purchased.  If you are not an Amazon Prime member (which I now am), you really have very little access to a decent catalog of things to watch.  Yes, you can watch YouTube and a couple shows on apps like the History Channel, but by and large, I was far better served to purchase a cord to run from my Kindle to my TV and watch everything on that.  Disappointing.", "verified": true, "helpfulness": "0/0", "author": "Laura \"Laura M\""}]