[{"rating": 5.0, "review": "How easy can something be? The Fire stick is awesome", "verified": true, "helpfulness": "0/0", "author": "Dirk D."}, {"rating": 5.0, "review": "Our family owns 2 Roku players. When I saw the Amazon Fire Stick on sale over the holidays, it was too good of a deal to pass up. We are an AMAZON family and own several Kindles, so I knew that this would integrate well. We were not disappointed! It does everything our ROKU players do, but in a more 'user friendly' format. I like the graphics more and the ease of just plugging the stick into the back of the TV. No wires to deal with. What we love most, is that we can take the small Fire Stick with us on vacations and visiting friends. We have loved using this in hotels during our travels. It pairs up great with my Kindle Fire HDX and allows me to switch from my Kindle to the TV. The Android App for the Fire Stick is AMAZING! I can't believe how quick it works!  All in all, we are VERY pleased with our purchase.", "verified": true, "helpfulness": "0/0", "author": "JLC"}, {"rating": 5.0, "review": "Obsessed.", "verified": true, "helpfulness": "0/0", "author": "aander7"}, {"rating": 3.0, "review": "I would have given this 5 stars if it had HBO Go.  Now I have to also buy another medium to be able to have that also.", "verified": true, "helpfulness": "0/0", "author": "J.C."}, {"rating": 5.0, "review": "Easy to install and operate.  Fantastic to be able to access Netflix and Amazon Prime Instant Video without having to purchase a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Dr. Barbee Myers-Oakes"}, {"rating": 5.0, "review": "so easy to install.", "verified": true, "helpfulness": "0/0", "author": "diane landry"}, {"rating": 1.0, "review": "It nickle3s and dimes you to death. I think net flex is a better deal at $8.00 a month", "verified": true, "helpfulness": "0/0", "author": "James Hudson"}, {"rating": 4.0, "review": "This was VERY easy to install  and the set up was easy as well.  My only confusion initially was that once I signed up for Netflix I assumed that Netflix would be the default but Amazon is always the default.  Each time I want to watch Netflix, I have to sign into that.  It's not a big deal, I just initially found it confusing.", "verified": true, "helpfulness": "0/0", "author": "M. Harrison"}, {"rating": 5.0, "review": "The Fire TV Stick was easy to install and fulfilled my expectations. I especially like the number of shows and movies included for Amapzon Prime members at no additional charge.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "LOVE IT! It's loaded with all kinds of apps, movies, TV shows and sooo much more!", "verified": true, "helpfulness": "0/0", "author": "Anna"}]