[{"rating": 5.0, "review": "Really enjoying my new Fire Stick. Works great and doesn't take room on the counter! 😊", "verified": true, "helpfulness": "0/1", "author": "Lynne"}, {"rating": 2.0, "review": "We had no problem with the Fire TV, but this stick hasn't worked yet. The first time I installed it it connected to my network, but failed to update software.  Amazon help desk told me to connect the extender, unplugged, and reconnect.  It seemed to work as the update process started, but only got to the halfway mark after more than 30 minutes.  So, I reconnected my Roku to continue to watch, and will try again today.", "verified": true, "helpfulness": "0/0", "author": "H. Le"}, {"rating": 5.0, "review": "This is awesome so far!!!!!", "verified": true, "helpfulness": "0/1", "author": "tbirdtimmy"}, {"rating": 3.0, "review": "I was hoping for an app or program for Laptop to broadcast screen using Fire Stick....only from phone......bummer", "verified": true, "helpfulness": "1/1", "author": "J. Young"}, {"rating": 5.0, "review": "A very good product, but I would have to suggest that you get the owners manual.", "verified": true, "helpfulness": "0/0", "author": "Terry Terrell"}, {"rating": 5.0, "review": "Was easy to setup and worked great.  We have a smart tv with the Amazon app on it as well as a Blu-Ray player with the Amazon app.  Both work slowly and are a little clumsy, but the Fire TV Stick is very responsive.  Very happy so far", "verified": true, "helpfulness": "0/0", "author": "John Selby"}, {"rating": 4.0, "review": "Great device for the price I got it. Snappy performance. Great selection of services and apps. Remote works well as it does the Android phone app. I removed one star, because during setup the stick would not connect to the remote. I followed the troubleshooting steps and was eventually able to set it up. The other shortcoming is that streaming video thru the amazon cloud is only up to 20 minutes. Streamming videos longer than that need the use of third party apps like allcast which is not that great. I whish amazon comes up with a better way to stream video from a phone or pc into the fire tv stick. All in all the fire tv stick is way better than chromecast and some what better than roku stick. For the $19.99 I payed this is the best streaming device. Buy it. Even for the current 39.99 is a deal.", "verified": true, "helpfulness": "1/1", "author": "G.V."}, {"rating": 4.0, "review": "Over all I'm very impressed with the Fire TV Stick. The only issue that I've run into is with the wifi connection. It connected very easily on initial setup, but 48 hours later, it wouldn't connect to the Internet. A quick power cycle of the device cleared the issue, and it's connecting correctly again.", "verified": true, "helpfulness": "0/0", "author": "Greg Hampton"}, {"rating": 5.0, "review": "very easy set up! got it when they had prime member offer for $19.99 totally worth $40 defiantly should have bought two!", "verified": true, "helpfulness": "0/0", "author": "Bryan P."}, {"rating": 3.0, "review": "Please advise if I can watch Netflix, hulu and other channels in eastern European countries like Ukraine and Moldova", "verified": false, "helpfulness": "1/2", "author": "Ravi"}]