[{"rating": 5.0, "review": "Works great, easy to install.", "verified": true, "helpfulness": "0/0", "author": "Abby Weimer"}, {"rating": 5.0, "review": "Love the Fire TV Stick, as soon as I am out of contract with Direct Tv Im cancelling it!", "verified": true, "helpfulness": "0/0", "author": "Christina R. Zeravica \"Christina\""}, {"rating": 5.0, "review": "Best Streaming Connector ever... First time using it and the HD Quality is out of this world. I recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "John Rivera"}, {"rating": 2.0, "review": "MLB.TV is literally unusable.  It constantly freezes, buffers, stops, etc. and is a known issue that still hasn't been fixed 3+ weeks into the season.  The other streaming apps I've tested work fine (SLING TV, WATCHESPN, etc.), but the fact that this thing can't play video in MLB.TV when my 3-year old Roku 2 3100XS can is very disappointing.  Not sure if the issue is with the Fire TV Stick itself or the MLB.TV app itself but regardless, the Fire TV Stick is useless for that app.", "verified": true, "helpfulness": "0/0", "author": "125white"}, {"rating": 5.0, "review": "I previously owned the Amazon Fire TV and bought the stick to try it. In short, it gives the same amazing experience that the Fire TV brings. Excellent product and it is setup in seconds.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Slow to fully access network. Otherwise an Apple TV killer. Games are playable. Streaming is very fast, renting is easy and quick. Intsantly switches to correct HDMI port when turned on.", "verified": true, "helpfulness": "0/0", "author": "Norman Jose Caldera \"texasstudent0203\""}, {"rating": 3.0, "review": "Pros: Cheap and simple.  Great for those who just want to stream video from one of the supported apps.  The second screen integration with Fire tablets works great.  X-Ray and jumping to scenes works great.  Video playback is smooth.The biggest thing that I do with my Amazon account is to stream Prime Music channels.  The device doesn't support this.  You can listen to playlists but not stations.  I have been doing this by mirroring my tablet display to my Smart TV.  But this doesn't always work well due to Miracast being such a poor technology.  Since this feature is missing, I haven't been able to make any progress in this areaEverybody hates remote controls. I have a Fire tablet.  I don't want to have to use the remote control that came with the Fire TV stick.  You have to use it in order to get the device initially setup.  Chromecast can be setup entirely from your tablet and this should be the same.  It's not just for setup.  I find myself getting the thing out all the time.  I should be able to do everything from my Fire tablet.  I can control every other single piece of my home theater equipment via tablet app and the marketing for this product makes it seem like you can, but the remote control app is awful and can't do everything.Display mirroring is supported but only via Miracast.  It works better than the version on my TV.  (Presumably due to MIMO) but it's still Miracast.  If you plan to do display mirroring, you will need a Chromecast as well.If the remote app were better and it supported prime music stations I would have given a 5 star review.  I knew about the Miracast limitation when I bought it.  I was hoping not to have to use the feature.  I'm not taking off any points for that.  Just letting people know.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Ed Tice\""}, {"rating": 5.0, "review": "I am so happy with the Fire Stick. I love all the free TV and movies! I wish there was a keyboard that worked with the Afire Stick. I hate having to use the remote to type in search words. But it is still really awesome!", "verified": true, "helpfulness": "0/0", "author": "angela"}, {"rating": 5.0, "review": "I must say this item is the best thing since peanut butter and jelly. I have a flatscreen in the living room and the bedroom. The one in the bedroom does not have the programs to access various options like the one in the living room does. This forces me to ask the wife to watch tv in the bedroom so I can watch Amazon or Netflix which I feel bad doing. I purchased this item and now I can lay in bed and watch movies without having to ask the wife to change rooms. The hardest thing about the stick was trying to open the remote to put the batteries in and Amazon has a video that I googled that will show you how to open it as they discovered that many people as myself had a problem with opening the remote to insert the batteries. After that I followed the brief instruction that were only needed for hook up and within 5 minutes I was watching Amazon Prime movies just that fast. Would recommend this product to anyone without hesitation", "verified": true, "helpfulness": "0/0", "author": "tom"}, {"rating": 1.0, "review": "Worked great for the first 4 months now remote died noting plays without stopping and I am so irritated i will most likly not renew prime", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]