[{"rating": 5.0, "review": "Love it but there is delay if other internet products are running.", "verified": true, "helpfulness": "0/0", "author": "Di"}, {"rating": 5.0, "review": "I Love it! I have cable tv & although there 1 million channels hard to find the movies & shows I want to watch. This was easy to set up & I have even ordered the voice remote for it", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 4.0, "review": "Easy to connect..... no problems so far.", "verified": true, "helpfulness": "0/0", "author": "JORGE RIOS MORALES"}, {"rating": 5.0, "review": "Simply a fantastic product.", "verified": true, "helpfulness": "0/0", "author": "Barry Carter"}, {"rating": 5.0, "review": "Love this little gadget! It's easy to use and it works great!!!!The only thing I would like to see as a capability with this is being able to order pay per view sports events!!!", "verified": true, "helpfulness": "0/0", "author": "Lela Retzloff"}, {"rating": 5.0, "review": "Very easy to set up and took less than five minutes.  Love the fact that we can take this and hook up to our tv  or lap top in the camper when we travel.", "verified": true, "helpfulness": "0/0", "author": "Madalyn A. Lambert"}, {"rating": 5.0, "review": "I Love it.  Own a Chromecast, this beats it.  Nice remote too.", "verified": true, "helpfulness": "0/0", "author": "J in Oklahoma \"J in Oklahoma\""}, {"rating": 4.0, "review": "It just doesn't work, I always am able to connect to my wifi network but whenever I try watching something I get \"Connected with problems\".  Unfortunately the only troubleshooting it tells you is to restart the device or move your router closer, I get full connectivity and after restarting I get the same issue.  I am unable to watch anything on this and have to go back to my old player.They also do not offer any other kind of troubleshooting, I wanted to go into the network settings and try to fix it but it simply only tells you connected with problems and there is pretty much nothing you can do to fix it.Edit: was able to fix it after a few hours, my suggestion is to keep restarting the stick and your router until it works.  It took me about 5 tries and waiting about an hour in between each time.Otherwise the fire stick is great once you get it working.", "verified": true, "helpfulness": "0/0", "author": "anik9"}, {"rating": 3.0, "review": "Streaming need alittle work", "verified": true, "helpfulness": "0/0", "author": "misha jeffers"}, {"rating": 3.0, "review": "Overall I'm happy with the fire stick. But it does have a significant downside: the remote makes a really loud \"CLICK!\" sound with every button press--which I could get used to, but  my wife, not so much. I tried to muffle it (the remote, not my wife) by using it under a comforter and pillow, but that didn't help. Otherwise I would have given it 4 or 5 stars. (Ergonomics engineers: how did you not notice this?)", "verified": true, "helpfulness": "0/0", "author": "P. Tucker"}]