[{"rating": 4.0, "review": "Works well, offers good options to make up for cable.", "verified": true, "helpfulness": "0/0", "author": "LYDIA  WILLIAMS"}, {"rating": 5.0, "review": "Great product for the Price! Great selection of apps. I use it to watch Hulu +, Netflix and Amazon instant video. Works great on all of them!", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 4.0, "review": "So far, so good. Excellent streaming from Netflix, Hulu, HBO Go, etc. without any interruptions. Love the interface as well. The only drawback is accessing the battery compartment on the remote. It needs a better design otherwise it is a struggle to open.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Tammy L. O'Neal"}, {"rating": 2.0, "review": "Buffers a lot", "verified": true, "helpfulness": "0/0", "author": "Marjorie M. Mccall \"grand mom\""}, {"rating": 5.0, "review": "Great device. I've been using it for a few weeks and, so far, no issues. Other than using my PS3, my other devices that has built in Wi-Fi had streaming issues. But after using the fire stick for a month now, there had been no streaming. So far, it's working great.", "verified": true, "helpfulness": "0/0", "author": "Dre B."}, {"rating": 5.0, "review": "I am loving my Fire TV Stick...best purchase in a year!  I have Chromecast and this one knocks it outta the park. I have cancelled Netflix and with what I save on that subscription, I bought Amazon Prime for $99.00 per year for my Kindle and TVs. I have cancelled my Direct TV and saved $1,400.00 per year. I bought the Avantek HD antenna with amplifier from Amazon for $39.00. It brings in all my main TV channels and a few extras. I am enjoying saving a lot of money in these hard economic times, and enjoying TV and books as never before!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it. just wished it would down load the hole movie at once.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Best $35 dollars I've ever spent.", "verified": true, "helpfulness": "0/0", "author": "Schyler"}, {"rating": 3.0, "review": "So far not near as good as chromecast which is way better", "verified": true, "helpfulness": "0/0", "author": "TG"}]