[{"rating": 3.0, "review": "It would have probably been better if we didn't have the Fire TV first. The stick is slower to load & only works well if it's real close to the wireless router. My wifi pumps out just over 30 mbps. I didn't think I'd have a problem with it. I ended up returning it & getting another Fire TV", "verified": true, "helpfulness": "0/0", "author": "CPatrick"}, {"rating": 5.0, "review": "Awesome! Easy to set up and use and with Prime there are hours and hours of movies to watch.", "verified": true, "helpfulness": "0/0", "author": "Mark and Kathy"}, {"rating": 5.0, "review": "Easy to set up - great audio and video - fast seamless downloads - great selections of movies and tv shows (especially for Amazon Prime members). I can control it from my iPhone or Kindle HDX besides the included remote. Outstanding product.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 3.0, "review": "It is easy to \"install\" and navigate. But most of my TVs have their HDMI slots full so have to unplug something to use Firestick.. just real unhandy. The major problem i have is that my movies do not fully load. They stop every few minutes to buffer.", "verified": true, "helpfulness": "0/0", "author": "Debby"}, {"rating": 5.0, "review": "Super easy to set up. It was actually minutes from the box to watching our first movie,  We. are very pleased with the large selection of movies and TV shows available for free with Amazon Prime.  Really good buy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"penross\""}, {"rating": 1.0, "review": "Will try and return this! I have a roku and thought I would try this from all the grand reviews. Don't do it. Sluggish and does not offer much at ALL with out a prime membership! Save your self the time and go roku!!!!", "verified": true, "helpfulness": "0/1", "author": "Janelle McRoberts"}, {"rating": 5.0, "review": "If you were even considering buying Google's Chromecast, stop considering it and get the Amazon Fire TV Stick. You get waaaaay more viewing options, including Amazon Instant Video. This is especially great if you're a Prime member. Everything you do with Chromecast has to be controlled from your computer!! The Fire TV Stick comes with a great little remote control. The only thing the Fire TV Stick is lacking is HBO Go, and that is supposed to be coming this spring. It's the perfect, inexpensive option for adding Netflix, Amazon Instant video, Hulu Plus, Showtime Anytime and soon as I said, HBO Go to your TV. Not to mention games, music, and a Windows screen mirroring app also coming soon. Some people complain that it has to be plugged in to a power source. This should not be a big deal, as your TV should be near a power source anyway. But if you have a revent model TV and it has a USB port, you can plug it into the USB port for power, eliminating the need for an electrical outlet to be used. For the price, it is pure perfection. It simply can't be beat.", "verified": true, "helpfulness": "1/1", "author": "Pac Deo"}, {"rating": 5.0, "review": "now if we can get our KC royals we will be golden!!!", "verified": true, "helpfulness": "0/0", "author": "Larry Linhardt"}, {"rating": 4.0, "review": "Cool device, works well, has a lot of features and provides a lot of entertainment for the TVs that cannot get all such content or that aren't smart... I do feel that the remote signal is awkward and the response time is not the best...", "verified": true, "helpfulness": "0/0", "author": "Alejandro Bonilla \"petarro\""}, {"rating": 4.0, "review": "Great product/concept and I love the Amazon Prime access. I've only had it a couple of weeks and haven't accessed all the features.", "verified": true, "helpfulness": "0/0", "author": "Brian"}]