[{"rating": 5.0, "review": "Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "richard grenier"}, {"rating": 5.0, "review": "Works great. I got it for the kids and the cartoons on Netflix keeps them entertained for hours.", "verified": true, "helpfulness": "0/0", "author": "Cornelius Daniels"}, {"rating": 4.0, "review": "We recently purchased the Fire TV Stick for one of our 'dumb' TV's to gain access to internet content such as Amazon Prime, Netflix and Hulu Plus.  The price of this unit is very competitive and reasonable.  As for usability the unit was easy to setup, has a nice user interface and navigational control, remote does most functions with ease. Also very nice is the ability to use Amazon Photo and Music (Prime Subscription required).  I did not spend any time with games so can't comment much there.While text entry can be accomplished with the remote it can be a tedious tasks for some.  However, if you have an Android device (phone or tablet) there is an app that provides voice search, keyboard entry and navigation control.I highly recommend the Fire TV Stick to anyone looking to enhance their TV viewing experience.  I would also give 5-stars if the unit worked with an external keyboard (Bluetooth or IR) and provided search results from all sources and not just focused on Amazon Prime content.", "verified": true, "helpfulness": "0/0", "author": "Ruffhousen"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "Nina Herrera"}, {"rating": 5.0, "review": "i love it. although i want to search for movies and shows and the sear menu option is to tricky and specific. there should be an option to put any actor in or title.  just keep seeing the sme things in the menu options", "verified": true, "helpfulness": "0/0", "author": "Sherry Ray-Von"}, {"rating": 5.0, "review": "The Fire Stick is as it was advertiseed to be and more. I like it very much and will get a lot of use out of it.", "verified": true, "helpfulness": "0/0", "author": "Thelbert Edwards"}, {"rating": 4.0, "review": "I am very pleased with the purchase of the Fire TV stick. It is very easy to use. I now have the advantage of having a \"smart\" tv.", "verified": true, "helpfulness": "0/0", "author": "Mary Delores Torres"}, {"rating": 5.0, "review": "My daughter said to me \"Check this out on Amazon.\" Boy am I ever glad I did. This was a very good purchase. Reasonable price. Great performance. So easy to install I could do it and trust me that's saying a lot about my ability to handle electronics.Really recommend the Fire Stick. Can't think of a reason not to.Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Sharon R. Steinecke"}, {"rating": 5.0, "review": "Excellent value. It even works as advertised. Neat product..", "verified": true, "helpfulness": "0/0", "author": "John Felton Wagner"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "gabriel delgado"}]