[{"rating": 5.0, "review": "Love the fire stick! super easy to install!", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Access to a plethora of movies and tv shows. I have no regrets with this purchase. Cons: you're at the mercy of live streaming, signal is only as good as the weakest link", "verified": true, "helpfulness": "0/0", "author": "Daniel Silva"}, {"rating": 5.0, "review": "Excellent product .", "verified": true, "helpfulness": "0/0", "author": "hector navarro"}, {"rating": 5.0, "review": "Works great on my non-smart bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Carolgae"}, {"rating": 5.0, "review": "Have a ROKU and like this a lot better. We watch this daily and never have had a problem.", "verified": true, "helpfulness": "0/0", "author": "Kelsey Overacker \"K O\""}, {"rating": 5.0, "review": "The Fire TV Stick works great. I was able to abandon getting access to Netflix through a BluRay player that was awkward and frustrating. The Fire TV Stick is easy to use and gives me access to see my favorite TV episodes again and again.", "verified": true, "helpfulness": "0/0", "author": "Michael Fleming"}, {"rating": 5.0, "review": "Easy to use and set up", "verified": true, "helpfulness": "0/0", "author": "dudley"}, {"rating": 5.0, "review": "I absolutely LOVE my fire TV stick.Initially, it took a little while to get it set up because I didn't realize that I needed an available power source when I purchased it. All of my outlets were used up by my TV, set top box, and DVD player. Fortunately, I had an extra power strip, so I used that to accommodate all of my plugs. The plug for the fire stick is pretty wide and takes up at least 2 slots on a power strip, so just be aware of that if you need to move some things around to plug it in like I did.Once I got all of my power issues sorted out, it was smooth sailing. The video tutorial came up automatically and was short and to the point. I am blown away by how multifunctional the fire TV stick is. Once I entered my Wi-Fi password, my Amazon Prime account connected instantly and my Netflix account only required me to sign in before all of my information was transferred over to the stick. The image quality is phenomenal and I have had no issues with buffering while watching TV shows and movies. I also uploaded some music to my Prime library on my computer, which automatically transferred over to my fire TV stick. I love that you can use the stick to play music from your prime library or choose pre-made playlists to listen to.A pleasant surprise: I paused my TV show using the remote and walked away to get dinner ready, and when I came back a slideshow of nature pictures was playing! I had no idea that there were pre-loaded photos for screen savers. You can also have a link sent to your phone or email that will allow you to automatically upload all of your personal pictures to your fire stick to display on your TV.If you are considering purchasing the fire TV stick but you don't have Amazon Prime, I strongly suggest becoming a Prime member. The benefits of free TV shows and movies aren't a huge deal if you already have a Netflix or HuluPlus account, but it is great to have your music and photos uploaded onto your fire stick. Plus, you really can't beat 2-day shipping.Overall, this is a wonderful product. I am even thinking about purchasing another one for the TV in my bedroom!", "verified": true, "helpfulness": "0/0", "author": "Marissa Ferry"}, {"rating": 5.0, "review": "Simple, convenient, and easy to use. I love that I can be browsing through my Amazon Prime selection within seconds of sitting on my couch.", "verified": true, "helpfulness": "0/0", "author": "Noah"}]