[{"rating": 3.0, "review": "somewhat disappointing.  wifi connection lags and fails at times for no obvious explanation when other devices stream easily.  Interface is easy.  I have not used a usb connector, instead opting for direct power.  Library of shows is very good and expanding.  But I don't use it as much because it doesn't stream well despite good wifi signal and fast internet speeds.  Will likely look to upgrade to a different product (apple tv most likely) for improved streaming and better coordination with other devices (ipad and iphone)", "verified": true, "helpfulness": "1/1", "author": "HusbandDad&Geek"}, {"rating": 3.0, "review": "When i go to see my huluplus app shows it keeps freezing up and sjow continues but the screen is frozen after like 3 minutes or so then it continues but i have missed part of the show!. Not happy!!!", "verified": true, "helpfulness": "1/1", "author": "Ana Oliviery"}, {"rating": 5.0, "review": "works great - love having amazon prime on regular tv", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "M. Smith"}, {"rating": 3.0, "review": "Good device overall, but I am having issues where it cuts out after watching for about a hour, the stick drops the network connection then requires rebooting and seems to work fine after this for a random amount of time.", "verified": true, "helpfulness": "1/1", "author": "Brian"}, {"rating": 3.0, "review": "Do not get me wrong is a great product, great hardware but some apps are not working as they work on other devices. Apps as Netflix fail to reproduce content time to time, causing me to reinstall the app.Another thing that bothers me, has nothing to see with the product but with the content of some apps like amazon prime videos and music that can not be stream to my country, Dominican Republic.", "verified": true, "helpfulness": "1/1", "author": "Noe Luzon"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Dennis Ortiz Jr."}, {"rating": 3.0, "review": "Love all the programs videos. Have a problem with  stick. Fire Stick. When  I switch from cable to Fir Stick.it does not work and I have to unplug Stick. Same thing happens with my ons Stick also.  basically happy with stcick.", "verified": true, "helpfulness": "0/0", "author": "eileen irgang"}, {"rating": 3.0, "review": "FIRE STICK,WHY? Installation,was a breeze,setup and settling in to explore took 15 minutes maximum,and all was sublime until the stuttering and frozen playback began. We explored forums but have found no true solution. Overheating, perhaps?", "verified": true, "helpfulness": "1/1", "author": "Queenie 55"}, {"rating": 1.0, "review": "After waiting forever for this, it won't connect to my home wifi network.  Do not waste your money!", "verified": true, "helpfulness": "0/0", "author": "Scott Wolff"}]