[{"rating": 5.0, "review": "I've been using my playstation to watch netflix and prime for a couple of years now.  This thing is much better, should have bought it a long time ago", "verified": true, "helpfulness": "0/0", "author": "jeremy weatherman"}, {"rating": 5.0, "review": "I can't get Spotify on the appleTV, or Amazon Prime, or some other apps I like. Fire stick is better for streaming as well, with fewer \"stutters\". I use both, but for this price, what a great addition to your entertainment portfolio.", "verified": false, "helpfulness": "0/0", "author": "gaylemichel \"oochie\""}, {"rating": 1.0, "review": "Have to pay for moives if they are not Prime and you pay for prime.", "verified": true, "helpfulness": "0/1", "author": "gigi"}, {"rating": 5.0, "review": "Great device! Easy to use & the phone remote app is awesome, works a little better/easier on the iPad than the iPhone for some reason. But all together worth the purchase, especially with Prime. I plan to get more for other tvs in the house.", "verified": true, "helpfulness": "0/0", "author": "Keith Yagel"}, {"rating": 5.0, "review": "This is AMAZING!!", "verified": true, "helpfulness": "0/0", "author": "kodamama"}, {"rating": 5.0, "review": "Getting this stick inspired me to get a GaiamTV subscription because it was featured on only the Fire Stick! I've never been so healthy since, and I absolutely love all the features on the stick. I also have AppleTV. I find that the Fire Stick tops AppleTV with all of the available apps. Redbull TV I noticed popped up on there, Pilates apps, GaiamTV, there's so much! Now, if I could just figure out how to \"AirPlay\" on to my fire stick using my iPad 😁", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 1.0, "review": "So far, i have not been able to play anything through it, but it for my girlfriend and every time we give it a chance, it fails.", "verified": true, "helpfulness": "0/0", "author": "Luis Acevedo-Cervantes"}, {"rating": 5.0, "review": "Best thing to get if you have cable wifi, get rid of the extra boxes and finally start getting your $ back from the Cable Companies!!!", "verified": true, "helpfulness": "0/0", "author": "Christopher Fay"}, {"rating": 5.0, "review": "Set up was a breeze... Easy to use... Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I am highly disappointed with this purchase. I bought it to stream MLB.com mostly as well as some other apps. It streams so slowly, pauses every 10 seconds to buffer. I have a chromecast the streams these same apps fine, I bought this because I liked the remote and user interface. Beware anyone who plans to watch MLB.TV with this, it does not run well at all", "verified": true, "helpfulness": "0/0", "author": "Daniel"}]