[{"rating": 5.0, "review": "I can't imagine this little thing being any better unless they could cut the cord on the power. Quite simply, it works as advertised. Losing the ac adapter is the only thing I would change.", "verified": true, "helpfulness": "0/0", "author": "Dave Albers"}, {"rating": 4.0, "review": "Works great,easy-to-use.", "verified": true, "helpfulness": "0/0", "author": "FRED"}, {"rating": 4.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 4.0, "review": "Had to call Amazon for help with opening the remote control!  After finally opening it, had to figure out the up/down/left/right feature on the remote-had no arrows or markings.  However, after the remote was handled, the Fire TV Stick was great!", "verified": true, "helpfulness": "0/0", "author": "Marilyn Hembury"}, {"rating": 4.0, "review": "good shows", "verified": true, "helpfulness": "0/0", "author": "Patrick J Conway"}, {"rating": 1.0, "review": "Got the product connected it as instructed and it will not correct to the internet no matter how many times I try. Very disappointed and will be returning it asap.", "verified": true, "helpfulness": "0/0", "author": "amanda roark"}, {"rating": 5.0, "review": "Totally awesome. I recommend getting the smartphone/tablet app since the remote can become annoying if you are searching for something or have larger hands.", "verified": true, "helpfulness": "0/0", "author": "R. L"}, {"rating": 4.0, "review": "My only issue is that it often drops my network when I leave for a while, and I have to unplug it and plug it back in to get it to connect again.", "verified": true, "helpfulness": "0/0", "author": "Steve Gifford"}, {"rating": 5.0, "review": "Fire TV Stick lives up to expectations. This device gets me movies, tv series and my Prime account service As well as my cloud stored photos. I haven't explored all it's possibilities and apps but it instantly changed my screen time life.", "verified": true, "helpfulness": "0/0", "author": "Aleph the Seeker \"Aleph the Seeker\""}, {"rating": 4.0, "review": "Took four hours to set up because it wasn't registered and a lady said it was broken and said I would have to wait two months for another, talked to 2 more people and finally got it to work. Works great after installation", "verified": true, "helpfulness": "0/0", "author": "Angela"}]