[{"rating": 5.0, "review": "Now this was in the words of Monty Hall, \"a really good deal\".  I cannot begin to describe the ease of using this product as it is extremely intuitive.  A perfect complement to Netflix or Amazon Prime,  (my main source of inspiration for purchasing).  It is easily moveable between television sets and for the first time I have been able to search and view You Tube videos on the main T.V. in the house.  If you haven't purchased one of these by now, skip reading the rest of this review and go order one for yourself.  You will not be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Jack Morrissey"}, {"rating": 5.0, "review": "Easy to operate", "verified": true, "helpfulness": "0/0", "author": "peggy constantino"}, {"rating": 4.0, "review": "Fire stick meet my expectations,except, Amazon CHARGES for Most movies that I wanted to watch. SOME were free but most of New movies were NOT free. I then swich over to NETFLEX.. Over all, it was very nice to watch movies through my wifi on a 55 inch TV with HD.I am still looking at all the different view possibilities at this writing.", "verified": true, "helpfulness": "0/0", "author": "N. VanCleve \"Happy Customer\""}, {"rating": 5.0, "review": "Perfect for what I needed!  Using this along with Netflix and Hulu plus, I can cut the cord!", "verified": true, "helpfulness": "0/0", "author": "Ronald"}, {"rating": 4.0, "review": "It is good but I wish I could watch \"Walking Dead\" on it without having to pay!", "verified": true, "helpfulness": "0/0", "author": "Vaneshia June Ames"}, {"rating": 5.0, "review": "Easy, perfect solution to cable.  Don't hesitate to make the switch.", "verified": true, "helpfulness": "0/0", "author": "T. Roepke"}, {"rating": 5.0, "review": "Best way to optimize your Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "DeAnna Moore"}, {"rating": 3.0, "review": "The stick works well but looses connection with the internet regularly.  We have a Chrome stick to fall back on when it fails.", "verified": true, "helpfulness": "0/0", "author": "Prairiedoll"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Porcha Davis"}, {"rating": 5.0, "review": "Yes , just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "CR"}]