[{"rating": 5.0, "review": "We use this all the time. To watch movies and listen to music.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "The fire stick is awesome. Easy to setup and works great. Going to buy a second one for my other TV.", "verified": true, "helpfulness": "0/0", "author": "SMM"}, {"rating": 1.0, "review": "Can't get it to work, account locked up.......difficult to reach a human to talk thru it.", "verified": true, "helpfulness": "0/0", "author": "Steven Carroll"}, {"rating": 3.0, "review": "The Fire Tv stick arrived quickly, was prertty simple to setup and had a lot of interesring apps. unfortunately the only movies that streamed wirhout any problems was from amazon. Netflix, hulu+ and even streamimg directly from my pc caused buffering problems. Luckily a had a roku setup om the same tv and when the tv stick would buffer or freeze, I could connect with my roku and continue watching my show or movie without this particular issue. The fire tv stick has a lot of potential but my primary reason purchasing this product is streaming movies and shows and it doesn't meet my expectations in that respect.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"blue hen\""}, {"rating": 5.0, "review": "Exceeded my expectations. Bought it stream pandora and netflix and it does that great. has tons of other apps and games too. Much easier to setup than a chromecast and way easier to use", "verified": true, "helpfulness": "0/0", "author": "GAce"}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Justin Wright"}, {"rating": 4.0, "review": "Just learning!! Still not sure what I can do.", "verified": true, "helpfulness": "0/0", "author": "Jo Ann"}, {"rating": 5.0, "review": "The Fire TV Stick was very easy to install and simple to operate. We love it.", "verified": true, "helpfulness": "0/0", "author": "Alan D.MacDonald"}, {"rating": 5.0, "review": "Couldn't be better. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "david"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Miguel Solano"}]