[{"rating": 5.0, "review": "Just the ticket for a great selection of movies and TV series. The menu is superior to the one I was using on my blue ray player. Was able to add Netflix which was a great improvement also. The Fire Stick was easy to set up and is a breeze use. I says this being a senior who is tech challenged. As always great product from Amazon and fast shipping.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 4.0, "review": "Fire Stick appears to work as advertised.  But,  I am trying to use it to connect with Slingbox and it appears that there is some form of ISP block which keeps disconnecting Slingbox from the 'net.  Because of this, I have not been able to give Firestick a fair trial.  We'll keep trying.  Fred S", "verified": true, "helpfulness": "0/0", "author": "Fred S"}, {"rating": 1.0, "review": "Bought for Sling TV which doesn't work well. Sling TV customer service told me tough luck. I still have to pay for 3 months of service which is barely visible. Amazon gave me $10, but do not buy for Sling TV!!!  You've been warned.", "verified": true, "helpfulness": "1/3", "author": "Jason"}, {"rating": 4.0, "review": "Great for the bedroom TV, a few issues with My Wifi (blocked signal) once I got that resolved everything is cool. Good product, for such a small device. L I K E .", "verified": true, "helpfulness": "0/0", "author": "no1amigo \"no1amigo\""}, {"rating": 5.0, "review": "We love the Fire Stuck! Perfect for upstairs in our bedroom.", "verified": true, "helpfulness": "0/0", "author": "Megan Miles"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Tales"}, {"rating": 5.0, "review": "Wasn't sure that someone a little older and technically challenged would be able to figure this out, but I did!  I use the Fire TV Stick on my tv in the basement when I am on my exercise bike and treadmill.  I now look forward to exercising as I am able to watch a HBO series that I have always wanted to access, but didn't want to spend the money for HBO on cable.  Great invention.", "verified": true, "helpfulness": "1/1", "author": "Claire Sullivan"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Steve Hathaway"}, {"rating": 5.0, "review": "This works awesome.  I love being able to watch MLBTV and Sling TV with no issues. plus i can watch my prime tv and movies.  I am very impressed", "verified": true, "helpfulness": "0/0", "author": "JustBrianMeyer"}, {"rating": 2.0, "review": "Device has poor apps.Cable company I use not offered on hbogo or showtime.The only redeeming point is it comes with a remote.Kindle does not cast well with this device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]