[{"rating": 4.0, "review": "Pretty well done, I do have to say.  Some minor issues with the phone remote app in terms of sensitivity to the slider pad and I've also seen some sync issues with the audio to the video where the sound didn't match the lip movement in the video (very distracting!) on the HBO GO app but as far as ease of use and installation, excellent!Overall, it is a slick concept and I'm sure I've barely scratched the surface of capability.", "verified": true, "helpfulness": "0/0", "author": "T. Geery"}, {"rating": 5.0, "review": "This thing is awesome! It's easy to use and it has anything and everything you want to watch. If you have Amazon Prime it's even better!", "verified": true, "helpfulness": "0/0", "author": "Andrea Tanory"}, {"rating": 3.0, "review": "It is hard to fine anything to watch if you are used to cable or satellite, haven't played that much with it to find the in and outs of it.", "verified": true, "helpfulness": "0/0", "author": "Deryl"}, {"rating": 5.0, "review": "I wasn't entirely sure what to expect from the Fire TV Stick but I am very happy with it.  The menus are intuitive, the remote is set up well, and everything integrates seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Rabid Sofa Pillow"}, {"rating": 4.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Mark Williamson"}, {"rating": 5.0, "review": "Love it !!!", "verified": true, "helpfulness": "0/0", "author": "brenda sanders"}, {"rating": 4.0, "review": "Works just as described very easy to setup and use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Easy to install. No buffering like other devices! Awesome!", "verified": true, "helpfulness": "0/0", "author": "SHELLYM_76"}, {"rating": 5.0, "review": "We love it!  I wish there was more of a selection on prime videos, we don't seem to watch those very often. We've joined netflix and watched on some other apps too. It is very fast. And it has lots of apps. Very simple.", "verified": true, "helpfulness": "0/0", "author": "luvindisney"}, {"rating": 5.0, "review": "Thank to a very patient customer service rep. I finally got things set up and I could not be happier!", "verified": true, "helpfulness": "0/0", "author": "Georgianne Pagano"}]