[{"rating": 2.0, "review": "It's ok that's about it.", "verified": true, "helpfulness": "0/0", "author": "anthony constantine"}, {"rating": 5.0, "review": "Excellent product all around, from the price, to the ease of setup, to the packaging.  It's quick to set up and extremely intuitive to use.  Works great on my Vizio 720p TV.", "verified": true, "helpfulness": "0/0", "author": "PorkChop"}, {"rating": 4.0, "review": "It does what I expected to do and works well. Some problems I have had:1) Fast forward is way to fast! I pressed it and I can either make it crawl way to slow or it jumps through most of the episode.2) Netflix seemed to start in low quality (no where near HD) and then over the course of about 30 sec quality improved (but I have seen this happen with the wii as well).3) The iphone app does not seem to be working and was asking me to enter a pin every time it tried to find the device.4) It had a few brief pauses once in every two episodes I watched through netflix on it but this could have been due to my own wifi of netflix itself.Easy installation and easy to use. I understood it really easily and am average with technology use. However, the instruction manual is quite bare and could be problematic for those that are struggling with understanding technology.", "verified": true, "helpfulness": "0/0", "author": "Daniel R."}, {"rating": 5.0, "review": "Easy to install, nice tutorial to get you started. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Daisy"}, {"rating": 5.0, "review": "Worked very well for me.  The less technical family members found it much easier to use than the internet access features built in to our Blue Ray player.  Its also much faster and doesn't suffer from the occasional glitches that the BR player seems to encounter from time to time.", "verified": true, "helpfulness": "0/0", "author": "JK Baker"}, {"rating": 2.0, "review": "Got this  and I want to say I do like it, when it works. First issue I ran into was the remote. After the first couple days, when scrolling with the remote it would \"jump\" or just start going all the way in the direction i was scrolling which made selecting a movie/action pretty difficult. Changed the batteries and that doesn't seem to help. Next issue is the wifi dc/network lag. I self mgmt my wifi and it just has issues with dropping it, and not finding any for a while. A hard power cycle and this seems to fix it. I've done a FR and reupdated and still the same. Could be that I have a dud, as I use to joke and say \"never buy first gen tech, they are always buggy nowadays\" but it seems to be true for this one. The stick itself might just need a firmware update, which Amazon could be working on but as for now,  As far as function, it works great as it says. Have no problem running Netflix, Hulu and Watching Vids on Prime, and Plex even works just fine. I do like it, its just got some issues...", "verified": true, "helpfulness": "0/0", "author": "Michael Serrano"}, {"rating": 3.0, "review": "Will be worth it when HBO GO is added", "verified": true, "helpfulness": "0/0", "author": "ebo213"}, {"rating": 4.0, "review": "Very disappointed that Gary Busey doesn't yell \"wwWOOAHH!\" when it starts up. Otherwise great concept, easy to use. I wish it had internet browsing capabilities (or have I just not figured that out yet?)", "verified": true, "helpfulness": "1/1", "author": "jacquelinenyc"}, {"rating": 5.0, "review": "so simple, now i can watch what i want in the comfort of my bed at nite.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Elaine"}, {"rating": 1.0, "review": "Terrible compared to ROKU stick. I bought this to use on a second TV but the fire stick will not stay connected to the internet and is therefore useless. I tried on 3 different TV's in the house all of which the ROKU stick work great on but the Amazon Fire stick will not hold a connection for more than a few minutes. Constant buffering and pixelated screen. Not worth it even for $19.00 so it's going back.", "verified": true, "helpfulness": "1/1", "author": "A Parent"}]