[{"rating": 5.0, "review": "Faster than most ... Extremely satisfied!!!!", "verified": true, "helpfulness": "0/0", "author": "L Anderson"}, {"rating": 5.0, "review": "yes works very good", "verified": true, "helpfulness": "0/0", "author": "gene wright"}, {"rating": 4.0, "review": "Some trouble with iPhone connectivity, otherwise a great product.  It had a lot of options unknown to me before I used the Fire Stick.  Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Mikec"}, {"rating": 5.0, "review": "This thing is amazing!  Have it set up on our bedroom TV and am enjoying Amazon Prime.  This was a breeze to set up and it connects to the wifi instantly.  There is no lag, freeze, or loss of signal.  Thinking of buying two more for the other bedrooms.  I have new Samsung smart TV in the living room and this Fire stick is much faster when accessing the apps and running them.  My only regret is not buying it when it was first offered for $19.  Still a great deal at $39.", "verified": true, "helpfulness": "0/0", "author": "JimBob"}, {"rating": 5.0, "review": "so far very good.", "verified": true, "helpfulness": "0/0", "author": "Wilma Gilchriest"}, {"rating": 5.0, "review": "Love this!  Our son bought it for us for Christamas, great gift.  Love the movie selection (and got caught up on Downton Abbey).  Thanks!!", "verified": true, "helpfulness": "0/0", "author": "William G Savage"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "J. Minich"}, {"rating": 5.0, "review": "So farI am very impressed!  It took way too long to get here after ordering, but I am pleased with the purchase!!", "verified": true, "helpfulness": "0/0", "author": "John Williams"}, {"rating": 5.0, "review": "Like that I can access Amazon as well as Netflix.", "verified": true, "helpfulness": "0/0", "author": "Diane S. Maehr"}, {"rating": 5.0, "review": "Fire TV Stick was recommended to us by our son, who loves it, and we do, too. We recommended it to our daughter and she has ordered one! Easy to figure out and simple to use. Has really broadened our TV watching. The only downside was having to wait so long to get it delivered.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]