[{"rating": 5.0, "review": "works great...taking advantage of all the great apps..", "verified": true, "helpfulness": "0/0", "author": "Dwight"}, {"rating": 5.0, "review": "great product works like a charm", "verified": true, "helpfulness": "0/0", "author": "Rosalie Broad"}, {"rating": 5.0, "review": "just what i needed to see more tv. thank you", "verified": true, "helpfulness": "0/0", "author": "jan smith \"bookworm\""}, {"rating": 5.0, "review": "This device works great, I think that it is idiot proof. Even I was able to use without calling one of our children.", "verified": true, "helpfulness": "0/0", "author": "John Hartsfield"}, {"rating": 4.0, "review": "We use it with Amazon Prime, Netflix, & YouTube mostly. Easy to use, and usually fast/very responsive. The only reason I'm giving it 4 stars instead of five is the WiFi occasionally won't connect to our home network. I then have to unplug the stick from the TV and power adapter to reset it. Also, after using it for about a month now,  the remote is starting to feel like it may not hold up to long term use.... I guess we'll find out because my whole family uses it.", "verified": true, "helpfulness": "0/0", "author": "Nathan B Smith"}, {"rating": 5.0, "review": "From the ordering to delivery, everything was perfect. The stick has opened a whole new world of entertainment. Love it.", "verified": true, "helpfulness": "0/0", "author": "Namma"}, {"rating": 2.0, "review": "Sure more free tv", "verified": true, "helpfulness": "0/0", "author": "Sandra Thomas"}, {"rating": 2.0, "review": "Not sure about this. I thought it was great but now we have reached the final episode of a series from History channel watched via the stick we are being forced to pay to view that one episode by signing up for a cable or satellite provider such as Dish. Feels like a bait and switch.", "verified": true, "helpfulness": "0/0", "author": "cmt018"}, {"rating": 3.0, "review": "works well met my expectations however the batteries were not good and I needed to change them", "verified": true, "helpfulness": "0/1", "author": "Brian Ahearn"}, {"rating": 5.0, "review": "Very easy to set up.  Short to the point instructions.  I'm so enjoying Netflix!", "verified": true, "helpfulness": "0/0", "author": "Linda C. Embry"}]