[{"rating": 4.0, "review": "We like it for our bedroom.  It is not as user friendly as the Roku.  I would not recommend it for a primary interface for all TV in a household.  The remote is super small and we seem to be looking for it all the time.", "verified": true, "helpfulness": "0/0", "author": "B. Steele \"Go Noles!\""}, {"rating": 1.0, "review": "Apple TV provided a much better picture", "verified": true, "helpfulness": "0/1", "author": "Wayne Hokom"}, {"rating": 5.0, "review": "Easy to install.  Great picture!  Totally satisfied", "verified": true, "helpfulness": "0/0", "author": "wbd"}, {"rating": 5.0, "review": "Easy to install!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "the fire stick works great. really fast, and easy to set up, i would definately recommend itIt works great with NETFLIXthe only downfall - is that you think you are going to get all of these channels with it (Like HISTORY channel) and you can, but its just an alternative way of getting it if you have subscribed to it thru cable TV only  - in other words -  no cable TV- no History Channel.", "verified": true, "helpfulness": "1/1", "author": "mike Halgrimson"}, {"rating": 5.0, "review": "The stick was so easy to get up and running.  No worries, just media... exactly as desired.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Marcus T"}, {"rating": 3.0, "review": "It's just OK. I bought it to replace my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Engaged observer \"Engaged observer\""}, {"rating": 5.0, "review": "I originally had ChromeCast hooked to my TV but after multiple issues with having to reboot the stupid thing (because it my tablet kept loosing the signal), I thought I would try the Fire Stick when it came out.  I love it, love it, love it!!!!I can now watch movies and shows off Amazon Prime, some of which are no charge because of my Prime membership; the movies that I do have to pay for are much cheaper then Direct TV's On Demand; with the remote control, everyone who is watching can see the choices and movie descriptions so I don't have to read them out loud; and not only can I access my Netflix and Hulu accounts, but I can also download other movie apps from Amazon for more choices.Get the Fire Stick!! You will NEVER regret it!!!", "verified": true, "helpfulness": "0/0", "author": "itigger \"ccupps\""}, {"rating": 4.0, "review": "Excelente producto!!", "verified": true, "helpfulness": "0/0", "author": "Zoraris Rosario"}, {"rating": 4.0, "review": "The Fire TV Stick is very convenient. I like that you just use a remote and not a phone/tablet/computer screen like you do with Chrome Cast. The only issues I've noticed is that you have to charge this device instead of it drawing power from the TV, which is weird, and the WiFi seems to stutter every once in a while. I know the WiFi is the Fire Stick and not our connection because nothing else has this issue.", "verified": true, "helpfulness": "0/0", "author": "jessica fowler"}]