[{"rating": 5.0, "review": "The Fire Stick is extremely easy to use and setup, we had no problems setting it up straight out of the box. I am amazed at the speed at which it operates, and the remote is slick and controls are easy to use. Even compared to a smart blu ray player, this is much faster and easier to use, and doesn't take up any space! Its also 100000 better than the Chromecast which requires another device to stream the media.", "verified": true, "helpfulness": "0/0", "author": "Benson K."}, {"rating": 5.0, "review": "FANTASTIC,watch want you want when you want to", "verified": true, "helpfulness": "0/0", "author": "Helen Cole"}, {"rating": 5.0, "review": "Love this thing!  If you have Prime you need this....", "verified": true, "helpfulness": "0/0", "author": "carol pinnell"}, {"rating": 5.0, "review": "I LOVE the Fire Stick.  This little device packs a BIG punch.  I consider myself an AMAZONIAN;  I have two fire phones, a Kindle Fire HD, I just ordered the Echo and I received my Fire Stick a few weeks ago.  It was SO easy to set up and is super easy to use.  I can watch my Prime shows and pilots, Netflix, etc, listen to music, play games and if I start on one of my devices, can pause and finish watching on my TV or vice versa.  Get it, buy it, use it, you'll love it!", "verified": true, "helpfulness": "0/0", "author": "Daniel Margosis \"Screenwriter/producer\""}, {"rating": 1.0, "review": "It is not user friendly.  I can't install apps to it. Very few apps but they are useless. I can't mirror cast.", "verified": true, "helpfulness": "2/3", "author": "Nathan Vue"}, {"rating": 5.0, "review": "Was exactly what I was hoping for! Easy, plug and play installation and now I can utilize my prime videos :)", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Beckner"}, {"rating": 5.0, "review": "Santa left this in my stocking and my husband had to tell me what it was and what it was for.  We don't have a roku, are total amazon lovers, so this worked great!  We travel every year at the holidays, and I loved that we could access our amazon and rental subscriptions with this.  Much less buttons than trying to use a regular remote at home since it had its own remote.  We watched all the rest of Season 4 Downton Abby we missed with my family and since we recently got smartphones, we love swiping from the phone to the tv, or kindle to the tv.", "verified": true, "helpfulness": "0/0", "author": "stimpy"}, {"rating": 3.0, "review": "Need to include more apps.", "verified": true, "helpfulness": "0/0", "author": "NETO"}, {"rating": 4.0, "review": "Great device just wished there wasn't so many geographical restriction on the apps n prime programming", "verified": true, "helpfulness": "0/0", "author": "Soul"}, {"rating": 5.0, "review": "VERY COOL PRODUCT.  We call it happy tv. The kids love it, we love it and it's just fun. I suggest this for any age that can use a remote.", "verified": true, "helpfulness": "0/0", "author": "AmazonMom"}]