[{"rating": 5.0, "review": "Works as advertised.  Can't believe how much there is to choose from.", "verified": true, "helpfulness": "0/0", "author": "Redline7"}, {"rating": 5.0, "review": "Love this product! So glad Amazon made one of these!", "verified": true, "helpfulness": "0/0", "author": "Blake Ross"}, {"rating": 3.0, "review": "It's ok except too often when it goes to a commercial it returns to the main menu. It gets really agitating to have to continue to start the show your watching back over again. It was easy to install and start. At first the control went crazy and wouldn't stop going, going, going. I changed the batteries it quit running alone. Just don't know what to do about the constant returning to the main menu.", "verified": true, "helpfulness": "0/0", "author": "Kriket Love"}, {"rating": 5.0, "review": "Love it! Everything in one place!", "verified": true, "helpfulness": "0/0", "author": "vivian catanese"}, {"rating": 2.0, "review": "Main reason for return: too many interruptions with wifi network. I have an Apple TV in our basement and decided to buy a Fire TV Stick for our upstairs TV thinking it would be convenient since, as advertised, all you'd have to do was stick it into your TV. But, on the box it states you should plug it into an outlet so now we have a cord hanging from our mounted TV (the one thing I was trying to avoid). I was excited to have the ability to stream Prime TV shows and have Netflix. But, upon watching a series on Netflix, about every 15 minutes it would need to buffer it seemed liked. I think we only went through one episode where there was no buffering needed. After it was buffering for the 8th time in a 40 min. episode, I went downstairs to see if it was our internet or if it was the Stick. The clarity was much better and the buffering stopped altogether upon watching it on the Apple TV in the basement. I am returning this and hope Amazon can fix the problem with later models as I will continue using the Apple TV in the meantime.", "verified": true, "helpfulness": "0/1", "author": "braidss"}, {"rating": 5.0, "review": "Love it so much that we bought a second one.  Our son uses it for gaming, my wife uses it for yoga, and I get my Netflix fix.  May need to get a 3rd one!", "verified": true, "helpfulness": "0/0", "author": "MizzouAKL"}, {"rating": 5.0, "review": "Its great ! I no longer use the wii to watch nextflix.", "verified": true, "helpfulness": "1/1", "author": "Lavinia Ghinea"}, {"rating": 1.0, "review": "Drops connection ability frequently, requires rebooting the device, seems this v1 is not ready for prime time.Other than that, it's fast and works well compared to my Roku.", "verified": true, "helpfulness": "0/1", "author": "ben hencke"}, {"rating": 5.0, "review": "The Fire Sticks works good and does every thing that its should I am very pleased with it", "verified": true, "helpfulness": "0/0", "author": "Kenneth w Franklin"}, {"rating": 5.0, "review": "I have Fire TV on my Family Room TV, purchased this stick for my bedroom TV.  Works great, Sync with my Fire TV receiver was seamless. I can't say enough good things about Fire TV, but the one thing I haven't seen anyone say is how easy it is to use.  My 90 year old Dad has always had trouble with all the buttons on the cable remote (you know how many buttons and how small the print is on a remote).  Fire TV remote has eight buttons, just 8.  Now all he has to do is press the voice search (that button has a picture) and he is in business. Way to go Amazon.", "verified": true, "helpfulness": "0/0", "author": "James L. Bridges"}]