[{"rating": 5.0, "review": "The Fire Stick was on sale for $19 so I figured, 'what do I have to lose.'  What I did not realize was how much I would gain.  As a Prime member the numbers of options to watch with Fire Stick are really comprehensive.It onlt took a few minutes to setup and then the family was enjoying movies, HBO shows and a whole host of Web content via the app store.Final raversion is the quality of the streamed content.  It's top notch.If you're looking for a great, one inexpensive gift to stuff in the stocking of someone you love...I highly recommend the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Wolf Georges \"Wolf Georges\""}, {"rating": 3.0, "review": "The packaging is nice but the device in the package is just plain.  Seems like they put lots of money and thoughts into the packaging but the actual device design is just after thought.  once it is connected, it takes very long time to download a new software.  After 30 minutes or so of waiting it is finally downloaded.  The apps are very very limited.  I have 2 chromcasts, Apple tv, and roku and this fire stick needs to add more apps soon.  with this sick I only uses it for Netflix and Amazon prime movies.", "verified": true, "helpfulness": "0/0", "author": "DonaldC"}, {"rating": 5.0, "review": "I have 3 Chromecast Sticks and I got the FireStick on a promotional deal.  I have to say, it's twice is good as the Chromecast after adding all the extra apps along with the Android App for my phone.  I use it and abuse it .. only thing I can knock is that the remote app seems a little too sensitive the cheap little app that comes with it works fine.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 2.0, "review": "It was easy to set up and initially I was pleased with it.  Pandora works well but I'm unable to watch Netflix or movies because there appears to be a problem with the buffering during the data download from our wireless router.  The spinning circle stops at 25% during the download and a message comes up that there is a problem with the router.  The router is located 4 feet away from the Firestick and have never had any problems with any other wireless equipment in our home.There is also a loud \"beep\" periodically when listening to music or when watching a movie.Unless the data download problem goes away, I'll return it.", "verified": true, "helpfulness": "2/2", "author": "Green Bay Fan"}, {"rating": 5.0, "review": "I've been playing with my Fire TV Stick for a couple hours now, and I love it. Out of the box it came preregistered to my Amazon account, so I had instant access to all my TV Subscriptions and Prime TV. Setup was a breeze, though I did have a bit of trouble getting the battery cover off the remote to add the batteries (Press the cover inwards where the indent is and then move back. Mine took a little bit of force, but it finally budged).My favorite thing about this has to be the included remote. It has excellent range, and it's very responsive when I navigate the interface.My least favorite aspect, as this is minor, is that  the Fire TV Stick is very finicky when it comes to where you plug the USB power adapter. With my Chromecast I could simply use the USB port on my TV, but the Amazon Fire TV stick has to use included AC power adapter if you choose to use the booster. The good thing is that this unit still works reasonably well (as long as it has a strong WiFi connection) without the external power adapter.I bought this thing because it was offered at a discount for being a Prime member, and because I was curious to see how it would compare. I'm an avid subscriber to TV shows through Amazon Instant, so this turned out far better than imagined. I will be ordering a couple more for family and personal use!", "verified": true, "helpfulness": "0/0", "author": "HUGGIES"}, {"rating": 5.0, "review": "I love it. I havery cable in the living room and use this in my office. Great for sharing my clod pic and music and catching up on TV shows. Setup was easy and I might be getting another", "verified": true, "helpfulness": "0/0", "author": "Bill Scriven"}, {"rating": 5.0, "review": "Hats off to Amazon once again for making a great product that everyone can afford.  I picked up one on Amazon day one and have no regrets.  I love how you can even side-load apps. I plan on putting one in each kids room. I hope they bring more apps out soon such as Google Music and HBO go. Interface is simple and easy to learn at any age and by far the fastest streaming device I have used. You hit the button and you have your movie. I have a Chromecast but it is always a pain in the rear to pause and constantly losing connectivity. I have a very expensive router with great bandwidth too. Not sure if it the extra under the hood on the fire stick compared to the Chromecast but I can tell a huge difference. Go ahead and purchase one, you will not be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this portable powerhouse of entertainment!", "verified": true, "helpfulness": "0/0", "author": "Johnny Mac"}, {"rating": 5.0, "review": "Awesome streaming device I got 2 I'm very happy with them", "verified": true, "helpfulness": "0/0", "author": "sergio Henriquez"}, {"rating": 4.0, "review": "Functionality is great so far.  Very easy to set up and use.  Not happy about the need for the power strip plug-in connected to the stick...was hoping it could run off the power of the TV.  Now I need to find a long extender cord so I can run, yet another, cable behind my wall to hide, yet another, wire.", "verified": true, "helpfulness": "0/0", "author": "Adam Kloza"}]