[{"rating": 4.0, "review": "I bought this device so I could watch Amazon Instant Video on my TV. It does exactly what it is supposed to do at an inexpensive price. I like the fact that the remote is radio based so I don't need line of sight to the device. The only thing I didn't like was having to plug in a wall adapter to properly power the device.", "verified": true, "helpfulness": "0/0", "author": "Steve \"s_brune\""}, {"rating": 4.0, "review": "I would have given it a full five stars because it is an amazing device!  We have two of them, plus a Chromecast!  The only drawback is that it needs to be relatively close to your Wifi, or it doesn't work that well.  My Chromecast is at the other end of the house and works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Captainpooopypants"}, {"rating": 5.0, "review": "Love it! So easy to use.  I will definitely buy a 2nd one soon.", "verified": true, "helpfulness": "0/0", "author": "Sylvia Cline"}, {"rating": 5.0, "review": "LOVE IT.  Easy to use.  If you already have Amazon Prime, just plug into TV and power and you are done.  Very easy.  Now I can watch Netflix, Amazon shows, etc. all in one easy click.  Previously had another system for Netflix, etc., and this is much better.", "verified": true, "helpfulness": "0/0", "author": "RangeQueen"}, {"rating": 5.0, "review": "Faster than my Roku", "verified": true, "helpfulness": "0/0", "author": "Ricky"}, {"rating": 5.0, "review": "Selects  from 3 hdmi inputs wireless.", "verified": true, "helpfulness": "0/0", "author": "Steven J. Kammeraad"}, {"rating": 4.0, "review": "Love my Amazon Fire TV Stick, for Streaming it works well. I like PBS so I am able to catch Downton Abbey. It does give you some channels but like all streaming devices, you still have to pay for the premium channels. For what I need it suits me just fine. Just keep in mind that it does not have a browser app yet, waiting to see one, this would make it better, then I can catch my local news via the Internet. So I am keeping cable on a little longer until the browser app is working and in place.", "verified": true, "helpfulness": "0/0", "author": "Eddie T. \"Video Shoots\""}, {"rating": 1.0, "review": "Temperamental would be a good description of the device. I love the Fire TV and thought I would get the Fire Stick for a secondary television. The Fire Stick wouldn't stay connected to the internet and when it did for a few minutes it couldn't deliver anything but the pre-programmed 'how to' video. I own several Fire tablets and the Fire TV box so I expected better. I'm disappointed with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Michael L. Graham"}, {"rating": 5.0, "review": "Love it! Easy to use. Bought another for my elderly mom since it's a breeze to install and use.", "verified": true, "helpfulness": "0/0", "author": "Riley McGee"}, {"rating": 5.0, "review": "well done, excellent user interface.", "verified": true, "helpfulness": "0/0", "author": "Frank Fell"}]