[{"rating": 5.0, "review": "Awesome! Highly recommend this product. Who needs cable when you have this?!", "verified": true, "helpfulness": "0/0", "author": "Grace A Jensen"}, {"rating": 5.0, "review": "Love it !!!", "verified": true, "helpfulness": "0/0", "author": "William E. Dell"}, {"rating": 4.0, "review": "I love the features and all of the apps and channels available but it loses its wifi signal a lot. Also, I hate that there is no way to tell if you have to pay for something before opening it. If you have small children you know once they are set on  movie they want to watch that movie and it is a meltdown otherwise", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I had difficulty maintaining connection and", "verified": true, "helpfulness": "1/1", "author": "Cecily"}, {"rating": 4.0, "review": "So easy to maneuver and gives you such great access to thousands of movies/games and apps", "verified": true, "helpfulness": "0/0", "author": "Griselda Rogoff"}, {"rating": 4.0, "review": "The device did not work on the TV that I bought it for. It works great on my other TVs. I used both the HDMI extender and the USB power cable and the WIFI keep on dropping with the device only being about 10 feet from the router. When I move the Fire TV Stick to another TV, which was about 40 feet away from the router it works great.", "verified": true, "helpfulness": "0/0", "author": "Diane Gleason"}, {"rating": 5.0, "review": "I wish there were more information about what a customer could expect to see on TV after installing the Fire TV Stick.  It appears this is the instrument needed to purchase TV entertainment a bit of a disappointment.", "verified": true, "helpfulness": "0/0", "author": "David Masching"}, {"rating": 4.0, "review": "I have used it once and so far it has been a good buy.", "verified": true, "helpfulness": "0/0", "author": "David Amador"}, {"rating": 5.0, "review": "eSo easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Bought it for my daughter she loves it", "verified": true, "helpfulness": "0/0", "author": "PAMMAP"}]