[{"rating": 1.0, "review": "I was wanting this for a while, finally got it. When it works, it's terrific and gets daily use, but it is often very buggy. Apps will crash, Netflix and Prime TV will freeze at a 25% buffer, some apps won't load at all. I have to often unplug the thing and plug it back in for it to work. I kind-of get tired of having to do that 2-3 times to get through one movie.UPDATE: Lowered the star rating, as issues and bugs are getting worse. Netflix streams terribly on this, stopping to buffer every 15-20 seconds. This thing spends more time buffering than streaming anything. Not reccomended.", "verified": true, "helpfulness": "0/0", "author": "CodyD"}, {"rating": 3.0, "review": "Boots up faster than roku stick ,i like that, and it has free games .But they need more Apps ,  i like Vudu they dont have.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Absolutely does not compete with Chromecast.  Takes more effort trying to make it work than its worth. A serious fail.", "verified": true, "helpfulness": "0/1", "author": "Joshua A. Goettsch"}, {"rating": 2.0, "review": "I loved the Fire Stick when I first received it because it was so easy to use. Now, after 5 months, it disconnects itself from WiFi almost continually. I can no longer watch any shows. Occasionally, it will stay connected for a few minutes, but then it disconnects again. I really expect a product like this to last longer.", "verified": true, "helpfulness": "0/0", "author": "Lana"}, {"rating": 5.0, "review": "Move over ROKU...(I have both now)....this is much easier to navigate! Compact Love IT", "verified": true, "helpfulness": "0/0", "author": "Ms. Neville \"Savy Consumer\""}, {"rating": 5.0, "review": "One word, awesome. Best bang for your buck.", "verified": true, "helpfulness": "0/0", "author": "Michael Allen"}, {"rating": 1.0, "review": "Bought this at Best Buy and it quit working after a few weeks. I loved it before it quit working, but Best Buy wouldn't do anything to help us.", "verified": true, "helpfulness": "0/0", "author": "L.M.M."}, {"rating": 5.0, "review": "Easy to install and set up. Great benefit to Prime shipping.", "verified": true, "helpfulness": "0/0", "author": "Allen Bergstrom"}, {"rating": 1.0, "review": "I don't like it", "verified": true, "helpfulness": "0/4", "author": "Francoise Kymaka"}, {"rating": 5.0, "review": "I can't say enough good things about this product.  It is such a step forward.", "verified": true, "helpfulness": "0/0", "author": "nerdguy42"}]