[{"rating": 5.0, "review": "Love the amazon stick have plenty new movies on prime to watch", "verified": true, "helpfulness": "0/0", "author": "EmZuz"}, {"rating": 5.0, "review": "I love the Amazon Fire Stick. The set up is simple and because I ordered it with my Amazon account the device was already registered to my account so all I had to was connect it to the internet. Right out of the box I can control the Fire Stick with either my my Fire Phone or the Fire HDX without the need to download a secondary app. The device has a simple streamlined menu and allows you to download apps like PBS, HBO GO, and Netflix only if you want them unlike other devices liek the Apple TV which comes preloaded on it and you can't get rid of it. Also you can play games on it. The device also had seamless streaming and as long as the internet co0nnection is great no buffering.", "verified": true, "helpfulness": "0/0", "author": "Courtenay \"Flash\""}, {"rating": 4.0, "review": "Love it almost 100%. The only problem is that ever since I got it, it has slowed down my internet speed by a ton.", "verified": true, "helpfulness": "0/0", "author": "hunter"}, {"rating": 5.0, "review": "Nice but does need to be plugged up to workCool part is use remote from your phone", "verified": true, "helpfulness": "0/0", "author": "Tammie Hendley"}, {"rating": 4.0, "review": "I do like the fire stick a lot after finally getting it to work after a lot of trouble shooting, and after buying a wifi extender so it could be used in an upstairs bedroom. But once we got it working it is amazing and I enjoy a whole lot and it's a joy to use and very intuitive", "verified": true, "helpfulness": "0/0", "author": "Jaimell Johnson"}, {"rating": 5.0, "review": "When I first bought the Fire Stick, I was unable to use it as my only internet connection was xfinity wifi. As you need to manually login to access xfinity, it did not work with the Fire Stick. Just an FYI -This plugs into one of the HDMI slots in the back of most if not all new flat screen TVs. It comes with a USB and charger that will need to stay plugged in to an outlet to provide power to the stick. I am not familiar with Roku or Chromecast, so I cannot speak to those, but I LOVE the Amazon Fire Stick. I can easily watch Netflix/HBO without having to go through my Wii or having to hook my computer up to my TV. There are a ton of apps you can download for free to add to your experience. My son loves watching Minecraft videos on YouTube, so that's his favorite aspect. He can now watch that on the TV rather than a small screen of a tablet or phone.I've had no issues and have been beyond pleased with the capability and user friendliness of this product. I highly recommend it! It makes cutting the cable cord so much easier!", "verified": true, "helpfulness": "0/0", "author": "Jamie L. Landuyt"}, {"rating": 4.0, "review": "I have only had it for a week, but I am very happy with the purchase.  It really exceeds my expectations.  The remote is easy to use, and the quality of the streaming is excellent.  Thinking of buying a second one.", "verified": true, "helpfulness": "0/0", "author": "Debra James"}, {"rating": 5.0, "review": "We are very happy with the firestick. it is very easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "dco"}, {"rating": 1.0, "review": "This item does not work at all. Do not buy it. It is absolutely terrible. The wifi will be at full strength and it will lose the connection, it will buffer maybe 20 times during a 30 minute TV show. Overall this is a piece of trash. Thank you Amazon for the waste of $40", "verified": true, "helpfulness": "0/0", "author": "Conor Brennan"}, {"rating": 3.0, "review": "I'll start by saying I am not yet used to the Fire Stick and perhaps my opinion is jaded because of my familiarity with Roku.I find the Fire Stick is much slower to bring up programs.  There is far too much clutter on the screen, too many other programs seem to overtake my \"recently viewed\" or my list.  I am hoping I get used to all the clutter and can learn to disregard. I don't find the arrangement of information to be organized, for example, I have NetFlix, Amazon Prime, and the other streaming services such as Hulu etc.  They are all over the place so it is a hunt 'n peck to find something.I am THRILLED though with this feature -- when you are done watching a show, if a series, it goes right on to the next episode without the need of using the remote to select again (as with Roku).  This little feature along is worth all the other things I don't care for.", "verified": true, "helpfulness": "0/0", "author": "deborah"}]