[{"rating": 5.0, "review": "Other than some problems that originated from my ISP, I love this little doohickey!!!  Navigation is smooth and intuitive, the movies that are selected on Netflix boot-up and start very quickly, and the image quality is more than acceptable for my needs.  Overall, I consider the purchase to have been a good one.", "verified": true, "helpfulness": "0/0", "author": "Sylvester Simons \"Mazlow7\""}, {"rating": 4.0, "review": "Very easy to setup.  Needs VuDu as an additional service.", "verified": true, "helpfulness": "0/0", "author": "Bob Castellano"}, {"rating": 5.0, "review": "Love this thing - super easy to use, very intuitive, fast, great menus, a no-brainer.", "verified": true, "helpfulness": "0/0", "author": "Steve P."}, {"rating": 2.0, "review": "It's not that it's bad.  It's just that the Google Chromecast is so much easier to use.  I'm not a fan of having to use a remote to control the unit.  If you could get the Amazon Prime Instant Video app to cast to Chromecast, then you'd have a winner!", "verified": true, "helpfulness": "0/0", "author": "DeVal Johnson"}, {"rating": 4.0, "review": "I like the way everything, pictures, videos, music is available from the menu", "verified": true, "helpfulness": "0/0", "author": "Richard Fine \"Richard\""}, {"rating": 4.0, "review": "When I first took it out of the box it took a long while for the software to update which was a bit frustrating. It kept saying my internet was too slow. After it finally was updated I was very impressed. I love the way you can scroll and find your items purchased verses prime items, and how you can easily access both Netflix and You Tube. I purchased both the Google Chrome and the Amazon Fire Stick. I like that play offers easy access through my cell phone, laptop, and Ipod. I haven't tried to set my Fire Stick up through those means yet but it didn't seem as easy. Also the connecting and putting in a password to link YouTube to Fire Stick was a little cumbersome compared to the plug and play versatility of the Google Chrome. I am happy with the Fire TV Stick though. It's menu helps one navigate easier than the Google Chrome one and I don't have Amazon access through the Google Chrome (which I am assuming is intentional on Amazon's part).", "verified": true, "helpfulness": "0/0", "author": "kdwhite39 \"ed lx prof\""}, {"rating": 5.0, "review": "Love the Fire Stick. I can see that I will use it often. Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Barbara Zantop"}, {"rating": 5.0, "review": "Very happy with this product!  I became a \"cord cutter\" a few years ago and relied on over-the-air broadcasts for local news and major network TV shows.  Online offerings have been great but limited me to watching on my laptop until I bought the Fire TV stick.  I was also really pleased to see that I could watch every game on WatchESPN without having a cable TV subscription.", "verified": true, "helpfulness": "0/0", "author": "D. Hunt"}, {"rating": 5.0, "review": "I absolutely  love it! The whole family uses it and loves it.", "verified": true, "helpfulness": "0/0", "author": "tracey berry"}, {"rating": 5.0, "review": "Fun games, some free, and the streaming is great.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Green"}]