[{"rating": 5.0, "review": "Simple fast fun", "verified": true, "helpfulness": "0/0", "author": "Danielle Williams"}, {"rating": 5.0, "review": "So convenient! !!!!!", "verified": true, "helpfulness": "0/0", "author": "GIA9400 \"GIA9400\""}, {"rating": 2.0, "review": "The fire stick keeps freezing up, it has done it several times and a few times it wouldn't unfreeze so I had to unplug it. It always runs really hot, now it starts glitching and skipping while watching videos on YouTube and Netflix. Only reason I'm giving it two stars is because it worked great the first few days of having it. I'll probably be returning it soon, I'm very displeased...", "verified": false, "helpfulness": "0/0", "author": "Cody Clouser"}, {"rating": 3.0, "review": "Have Apple TV and love it but that didn't come with Amazon Prime app so decided to give this a try when we chose to expand our homes TV footprint with these kind of devices. Not too fond of the navigation vs Apple TV. Love the price vs Apple TV though I should say we got a door buster. I may have just stuck with Apple TV if Fire Stick was full price. Wifi connection to our router has already had connection errors. The devices are directly across the hall so it is not a signal issue. A simple reboot of Fire stick solved the problem. 2 weeks out of the box does make me a bit concerned. Remote is Bluetooth so works via proximity vs line of site. That has plus and minus. I wish I could set up my existing TV remote with it but that is not possible due to the standard TV remote not having Bluetooth capabilities. It is nice to not have to point at anything in order for it to work everytime. These remotes are smaller so in our house they seem to get lost much easier. Overall, a nice less expensive alternative to other options but still has lots of room to improve. Most likely, if I expand the TV footprint again with devises like this, I will go back to my trusted Apple TV product.", "verified": true, "helpfulness": "0/0", "author": "Tom Moriarty"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Mrs. S"}, {"rating": 5.0, "review": "More of a TV box in a stick than the Chrome Cast.  Nice so far, but I'm just starting to use it.", "verified": true, "helpfulness": "0/0", "author": "TCombel"}, {"rating": 5.0, "review": "For the Price it cant be beat!  Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Michael R Martinez SR"}, {"rating": 5.0, "review": "Seems to be the most sensible answer to viewing programs other than local, regular TV programs. Met my expectations and at a great price.  Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Sandi"}, {"rating": 5.0, "review": "Perfect for the prime user!!! We watch movies on her at least a few times a week. Bought it when it was $19.99 for two days before it came out. Such a great deal for the amount of shows and movies that are on prime.", "verified": true, "helpfulness": "0/0", "author": "Theresa Markowitz"}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Neeraj Kumar"}]