[{"rating": 1.0, "review": "Freezes up continuously and the power has to be disconnected.  Very frustrating. All other wifi enabled devices work fine in same location within house.", "verified": true, "helpfulness": "1/1", "author": "Shawn Darche"}, {"rating": 5.0, "review": "Easy to set up.  I was streaming in no time!", "verified": true, "helpfulness": "0/1", "author": "Angi"}, {"rating": 5.0, "review": "love my FS!! lots of cool apps to stream through, tiny remote fits all snug in my hand, you can just call me the \"Stream Queen\"!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Enjoying it.", "verified": true, "helpfulness": "0/1", "author": "donald h."}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/1", "author": "sam"}, {"rating": 1.0, "review": "Useless", "verified": true, "helpfulness": "1/1", "author": "George klompis"}, {"rating": 4.0, "review": "Good product. Very cheap and easy to use and comes with a multitude of different apps you can download from the marketplace, including youtube, netflix, hulu and a lot more, but those are the only ones I use.Only complaint is that the video stutters occasionally when playing HD videos which can get a bit annoying but one remedy seems to be restarting it.", "verified": true, "helpfulness": "0/0", "author": "Anthony Val \"AV\""}, {"rating": 3.0, "review": "The Pros: It's small and cheap.The Cons: Some of the apps are buggy. The Prime TV app doesn't always remember where I stopped a show and it will start at the beginning when I click \"Resume\". The HBO Go app is a steaming pile of subpar software development. The audio and video don't always line up. If the Fire Stick goes to sleep when HBO Go is up the app has to be exited and restarted. I've had to restart the Fire Stick itself to get the HBO Go app to work properly.", "verified": true, "helpfulness": "0/0", "author": "M. Larson"}, {"rating": 5.0, "review": "Awesome wifi tv the best wifi TV yet", "verified": true, "helpfulness": "0/0", "author": "peterg2461"}, {"rating": 5.0, "review": "Great gift!", "verified": true, "helpfulness": "0/0", "author": "Amanda Rentschler"}]