[{"rating": 1.0, "review": "Love it", "verified": true, "helpfulness": "0/5", "author": "Maria C. Mahoney \"confused\""}, {"rating": 5.0, "review": "Very cool for a very small price!  You can take this thing anywhere too (vacation, etc.).  We basically took a below avg. tv w/out any cable hook-up and turned it into a smart tv.", "verified": true, "helpfulness": "0/1", "author": "Todd"}, {"rating": 5.0, "review": "As an Amazon prime customer I adore the fire stick. I am able to stream everything right to my television instead of streaming to my iPadthe Fire stick works really well and smooth. The fire stick hooked right uptime television and worked well quickly. Love it!!", "verified": true, "helpfulness": "0/1", "author": "Suz"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Heather"}, {"rating": 5.0, "review": "Love it best stick money can buy", "verified": true, "helpfulness": "0/1", "author": "christina"}, {"rating": 5.0, "review": "This is even better than I hoped and was extremely easy to setup. Absolutely recommend it.", "verified": true, "helpfulness": "0/1", "author": "Matthew Mattera"}, {"rating": 4.0, "review": "Doesn't mention it but works with Mirror Cast. I bought a MS stick and only works on some TV's. Tried this to screen cast with  my LG phone, ASUS x205 and a Surface Pro and it works on all of them.", "verified": true, "helpfulness": "0/1", "author": "T. Henley"}, {"rating": 5.0, "review": "Works as expected.", "verified": true, "helpfulness": "0/1", "author": "AARON P."}, {"rating": 5.0, "review": "Once the price dropped I purchased 2 additional sticks and am satisfied with all three.", "verified": true, "helpfulness": "0/1", "author": "Tony Newton"}, {"rating": 3.0, "review": "Connecting it to the TV set and activating it is uncomplicated. It's easy to use. BUT! The Prime Instant Video selections included with Prime membership are a major disappointment. There are way too many \"C\" grade movies. F-R-E-E movies and TV shows is the reason why I got the Stick. After reviewing what I can watch for free, I can say without hesitation that using Amazon to watch movies and TV shows will take a back seat to Netflix.", "verified": true, "helpfulness": "0/1", "author": "Deevah"}]