[{"rating": 5.0, "review": "Worked as advertised", "verified": true, "helpfulness": "0/0", "author": "odell"}, {"rating": 5.0, "review": "Works great  we realy like the prime settings it is fast and works better then previous systems Ive tried also it was easy to install but more then the add on TV  suggest  of just pluging it in . very good product.", "verified": true, "helpfulness": "0/0", "author": "Leonard T. Nanna"}, {"rating": 5.0, "review": "Buy this. You won't regret it. It has fundamentally changed my TV habits as much as my first TiVo machine did ten years ago.", "verified": true, "helpfulness": "0/0", "author": "John Kohl \"kohlwpb\""}, {"rating": 5.0, "review": "I love my fire stick I leave it plugged into my TV 24/7 and can switch over easy and fun to use", "verified": true, "helpfulness": "0/0", "author": "lauriejw55"}, {"rating": 5.0, "review": "Very easy to use simple to set up, have not used netflix but fine the firestick changing how we view entertainment", "verified": true, "helpfulness": "0/0", "author": "adpratt"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 5.0, "review": "So simple even I could use it! Great product to use with Amazon Prime. Highly recommend it for anyone who likes to watch TV a lot!", "verified": true, "helpfulness": "0/0", "author": "Wetzy"}, {"rating": 5.0, "review": "I cannot believe this thing is $39.  So easy to set up, use, and watch things on my TV instead of my laptop.  And, by the way, Transparent is just about the greatest show ever made. Not for the easily offended or uber conservative, but the writing and acting is just incredible.OK, I have also heard people say that the streaming stops and is jittery.  I've watched for at least 7 hours and have not had that happen once.I love love love the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Soph"}, {"rating": 1.0, "review": "No hbogo...put it on and you'll get 5stars.", "verified": true, "helpfulness": "1/1", "author": "kyle4anderson"}, {"rating": 2.0, "review": "The Amazon fire TV stick is neat... when it works. I have a small home and my Wifi router is located realitivly close to the fire stick but for some reason it completly drops wifi signal. I can't get through 1 half hour show without frequent stops and 2 or 3 reconnections to the network. I also own a Chromecast and one of the first Roku players. Both of these devices vastly out perform the Fire TV Stick. I highly recomend either of these devices over the TV Stick. maybe the much more expensive Fire TV is better?", "verified": true, "helpfulness": "0/0", "author": "knight53089"}]