[{"rating": 1.0, "review": "Got this free with a trial of SlingTV. Overall usefulness is OK. Just OK. The limitations of this USB device shows with speed, image quality and sound quality. Oh, and SlingTV on the FireStick is mediocre and for some reason the sound levels never seemed to be optimal for SlingTV. Also got tired of the constant disconnects from my wifi router. I disconnected, and replaced with a Roku3, very happy with the performance improvement.", "verified": true, "helpfulness": "0/0", "author": "Henry Kim \"Xsnirvana\""}, {"rating": 5.0, "review": "Love this", "verified": true, "helpfulness": "0/0", "author": "Chris Boyd"}, {"rating": 5.0, "review": "Amazing  it does so much. No need for cable. Great game platform. Movies tv shows etc. Super value.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this! I was very excited that I could listen to the streaming music on it, as well as the shows!!! And the games are an added bonus! Totally worth it!", "verified": true, "helpfulness": "0/0", "author": "Angela Ferguson"}, {"rating": 5.0, "review": "Very happy with the Fire Stick. Installed in minutes and has provided hours of entertainment for us. I love the variety of programing and especially like the abundance of children's movies and TV programs.", "verified": true, "helpfulness": "0/0", "author": "Diane Edwards"}, {"rating": 5.0, "review": "Awesome. Easy to hook up. Purchased it for my bedroom tv and have the fire tv for our family room. Great product.", "verified": true, "helpfulness": "0/0", "author": "schoolmarm"}, {"rating": 1.0, "review": "no different then any smart tv or dvd player with same service.", "verified": true, "helpfulness": "0/0", "author": "John or Barb Garven"}, {"rating": 5.0, "review": "Easy to install and get started", "verified": true, "helpfulness": "0/0", "author": "Linda J. \"LJ\""}, {"rating": 5.0, "review": "Just loaded it today!  Glad to be rid of cable... Easy to set up.  Fast loading of content and quality video.  I love it already!!!", "verified": true, "helpfulness": "0/0", "author": "Laurie W. Fleury \"flowerp\""}, {"rating": 5.0, "review": "Exactly what I needed for my other tvs", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]