[{"rating": 5.0, "review": "Absolutely love my fire stick! Easy to use and I have everything plus more at my fingertips!", "verified": true, "helpfulness": "0/0", "author": "Ashley Stewart"}, {"rating": 5.0, "review": "This is an awesome product. I bought two!!  Once we installed the first one, and saw how great it worked, I immediately ordered another.  So if you do not have a \"Smart TV\", don't think you have to miss out on viewing content from Hulu, NetFlix, Pandora, etc.  Just get the Fire TV Stick - easy to install, same viewing pleasure as a Smart TV (which I do have one of, so I know.)", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 5.0, "review": "Amazing invention!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "They kids love it.", "verified": true, "helpfulness": "0/0", "author": "jgsjr"}, {"rating": 4.0, "review": "Contents are awesome, the main shortage is the hardware, which will not decode anything in good manner if hardware decode is not available.", "verified": true, "helpfulness": "0/0", "author": "Vash theStampede"}, {"rating": 5.0, "review": "It was easy to install and the choices you have great", "verified": true, "helpfulness": "0/0", "author": "Holly Massia"}, {"rating": 5.0, "review": "How cool is this! Just plug it in and go. Immediate access to tons of movies and TV shows. Just wish I could find the TV mini-series Centennial.", "verified": true, "helpfulness": "0/0", "author": "Lola Anderson"}, {"rating": 5.0, "review": "If I could give more stars I would! ! Very easy to use. No buffering issues and tons to choose from. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "excellent product great transaction", "verified": true, "helpfulness": "0/0", "author": "Jeffrey"}, {"rating": 4.0, "review": "Works faster than our previous instant view technology, but has some trouble with play and pause.  Sometimes if I pause a show, it won't start playing again when I press the play/pause button.  This also happens in reverse.  I have to rewind a bit and then hit play to get started again.  However, easy set-up, quick play, gets the services that I want at a great purchase price.", "verified": true, "helpfulness": "0/0", "author": "Willis"}]