[{"rating": 1.0, "review": "Apparently, my internet speed is not fast enough.  Plus I did not know that I would have to play my router as close to the product as possible to maximize reception.  This is (in my view) unsightly.  I have to return the product.", "verified": true, "helpfulness": "0/0", "author": "Sandy Buerle"}, {"rating": 5.0, "review": "Worked exactly as advertised.  Could not be more pleased.", "verified": true, "helpfulness": "0/0", "author": "Ean Sullivan"}, {"rating": 4.0, "review": "So far, so good!", "verified": true, "helpfulness": "0/0", "author": "Robert E."}, {"rating": 5.0, "review": "Wish we would have bought it sooner!", "verified": true, "helpfulness": "0/0", "author": "Sandra Simons"}, {"rating": 4.0, "review": "I did get it to work.  WiFi reception is a bit tricky given that the \"stick\" is behind the TV, which is in a build-in enclosure.", "verified": true, "helpfulness": "0/0", "author": "JJS \"JJS\""}, {"rating": 4.0, "review": "Would have received 5 stars if I didn't have to add power to the HDMI stick.  I must not have read the description well enough.  Not an easy install if you are running cords through the wall. Now I have a power cord running up to a mounted tv.  Blah  I do like the service however", "verified": true, "helpfulness": "0/0", "author": "John Parrish"}, {"rating": 5.0, "review": "My son and I love it.  Nice to have the Apps I want on my screen television without having to go through the blu ray player.", "verified": true, "helpfulness": "0/0", "author": "Natasha Williamson"}, {"rating": 4.0, "review": "This device is definitely for someone who want to turn their regular flat screen into a smart TV.  One thing it doesn't show here is the power cable you need to attach to it so make sure you have a power source near by.  On top of the regular Netflix and amazon prime setup, there is a series of other media sources but on top of that you have music as well as video games which I didn't see that coming.  Overall its more than I expected.  But its not as good as the amazon fire TV.", "verified": true, "helpfulness": "0/0", "author": "Gift Card \"New Godzilla\""}, {"rating": 5.0, "review": "Yes I got it.  It is great.  Best thing since sliced bread.", "verified": true, "helpfulness": "0/0", "author": "cashemac"}, {"rating": 5.0, "review": "Love it!! Best thing ever!", "verified": true, "helpfulness": "0/0", "author": "Ann Seders"}]