[{"rating": 4.0, "review": "The Firestick makes your TV almost like a Smart TV. I am very happy with the one time I've used it. My wife has since taken over and is watching her shows. And she loves it, too!", "verified": true, "helpfulness": "0/0", "author": "Tom Quicksell"}, {"rating": 5.0, "review": "One of the greatest, most economical, tech inventions ever.  No more paying $100+ to a cable or satellite company.  With this gizmo, you can continue to watch all of your favorite shows, at your convenience for as little as $3.66/month.", "verified": true, "helpfulness": "0/0", "author": "Dane Dobrinska"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "derek"}, {"rating": 5.0, "review": "This is a great low cost smart TV option.", "verified": true, "helpfulness": "0/0", "author": "fjn3"}, {"rating": 5.0, "review": "Absolutely great!", "verified": true, "helpfulness": "0/0", "author": "SuperSam \"a11ys\""}, {"rating": 1.0, "review": "i wanted to get one of these today for Prime day...but amazon falsely gave the impression that i could get one for $25...but those are all gone and if you want one you can get it at the regular price...so...i will buy one for the regular price..but NOT on amazon. will buy it on Bestbuy just because Prime Day sucks!!!", "verified": false, "helpfulness": "3/7", "author": "Steve Khanpradie"}, {"rating": 1.0, "review": "What an absolute joke of a virtual garage sale.  Add in the fact that the ONE item I actually wanted to purchase (Fire TV Stick @ $24.00) sold out in seconds, allowed me to be put on the waitlist...and now keeps removing me from said waitlist?!This is just pathetic.  Time to rethink my online shopping options...", "verified": false, "helpfulness": "3/7", "author": "Malmom"}, {"rating": 4.0, "review": "Slow at times.", "verified": true, "helpfulness": "0/0", "author": "Jose L Olivares"}, {"rating": 1.0, "review": "12+ hours left on the deal for this Fire TV Stick for $24.00 and the wait list is full.  BUT...you can still purchase it for $39.00.  What a bunch of crock!", "verified": false, "helpfulness": "3/7", "author": "Andrea Donahue"}, {"rating": 3.0, "review": "Seems like this would be nice, but it's tough for those of us on the West Coast, since the Prime deal is sold out by the time we can get to it.  Amazon either needs to offer more of them, or stagger the hours of the offer to allow us a fair chance at the deal.  It's note even 10 am in Alaska.  Feels like \"bait and switch\".", "verified": false, "helpfulness": "2/5", "author": "Ken"}]