[{"rating": 4.0, "review": "We are trying to get rid of our Direct TV. This works great but we will not be getting rid of Direct just yet. I like to watch our local news and you cannot get local news from this. I'm thinking about getting a tv antenna for the roof of our house and keeping this also. There are a lot of episodes that need to be paid for- which I refuse to pay $2-5 for an episode of SpongeBob or any other show.", "verified": true, "helpfulness": "0/0", "author": "amy cooper"}, {"rating": 5.0, "review": "really enjoy this a lot great movies", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"mayan67\""}, {"rating": 5.0, "review": "Great device and easy to use. The remote is a better alternative (for controlling basic functions) to using the phone to control especially if your phone is usually locked and you have to spend extra seconds turning on the phone, opening an app etc.", "verified": true, "helpfulness": "0/0", "author": "Sriram"}, {"rating": 5.0, "review": "always good", "verified": true, "helpfulness": "0/0", "author": "Thomas J. Lorenzini \"tomsbills\""}, {"rating": 3.0, "review": "This thing is not intuitive to program in the least and I think I rated it too high", "verified": true, "helpfulness": "0/0", "author": "Michael Houghton"}, {"rating": 5.0, "review": "Love this but would love to see more new releases available", "verified": true, "helpfulness": "0/0", "author": "Debbie Hall"}, {"rating": 5.0, "review": "I love the amazon fire tv stick. Everytime I turn it on I find something else new. I feel like a kid in candy store. I love it!", "verified": true, "helpfulness": "0/0", "author": "mika"}, {"rating": 2.0, "review": "FALSE ADVERTISING.  The Amazon page shows apps that are NOT AVAILABLE  for the Fire Stick TV at all: Watch ESPN for example.  Very limited apps, no web browser app at all.  It is really designed to work well with Prime.", "verified": true, "helpfulness": "0/0", "author": "porvel"}, {"rating": 1.0, "review": "Love it--Until it overheats and have to unplug it to cool it off!!! Seems like a fire hazard!", "verified": true, "helpfulness": "0/0", "author": "chrisrem1978"}, {"rating": 5.0, "review": "Amazon fire it is obviouslly a 5 star product! Best Streaming!", "verified": true, "helpfulness": "0/0", "author": "SAMUEL BARBU"}]