[{"rating": 4.0, "review": "We've had the stick for about 3 weeks. We love how easy it was to set up and how easy it is to integrate our own media. After watching several shows for 2.5 weeks it has started forcing ads just in the last couple days. At first it started just between show choices now it's inserting them like commercials. No thanks amazon, no thanks. I'd like a no ad choice.", "verified": true, "helpfulness": "2/2", "author": "Elise Richard"}, {"rating": 5.0, "review": "Absolutely love the fire stick.  Access to so many apps makes it worth it.  Bought it for my workout room and have been using it daily.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this product! This is the third fire stick I have bought. If you are an Amazon Prime member, then you will like this even better than the Chromecast stick! There are so many TV shows to watch for free. Movies aren't as current, but you can still find some. If you have kids, you will love that the shows will play one after another, unlike On Demand where you have to put a new episode on for them when their show is over. As far as the actual device, it works great without any lag time, and moves from one TV to another with ease.  Buy one and you won't be disappointed!", "verified": true, "helpfulness": "0/0", "author": "Kara B."}, {"rating": 4.0, "review": "This thing works great and is very fast compared to the Roku and Chrome cast I have", "verified": true, "helpfulness": "0/0", "author": "Robert L Hill"}, {"rating": 5.0, "review": "Great product ..Love!", "verified": true, "helpfulness": "0/0", "author": "Rena Bishop"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "kris"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "NONE"}, {"rating": 5.0, "review": "Beyond expectations!", "verified": true, "helpfulness": "0/0", "author": "carlos norvani"}, {"rating": 5.0, "review": "Excellent value and quality", "verified": true, "helpfulness": "0/0", "author": "chibi kika"}, {"rating": 5.0, "review": "It make it easier to get to all the stuff and it on my TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]