[{"rating": 5.0, "review": "just great", "verified": true, "helpfulness": "0/0", "author": "tom harney"}, {"rating": 3.0, "review": "I would recommend anyone to use this who is looking primarily for Amazon services.  Outside of the Amazon services, i have found in comparing with my 2 Chromecasts, that Fire TV stick falls short. Here's some background:I have 2 Chromecasts that i love and have been using for about a year now.  I have them on both ends of my house (one in my bedroom, the other in my livingroom).  I was going to get a third one for my kitchen TV, but decided to get the Fire Stick instead because i just signed up for Prime Amazon services and since i buy all my music and online movies from Amazon, I wanted to take advantage of the services, not just the fast shipping ;)I have had my Fire TV stick for about 2 weeks and here is what i have found that i like about the fire stick:1.  Set up was super easy, the demo video was great, really helps.  I would rate this part a 5 since it's really user friendly and they packaged it well for consumers to understand how to use their product.  I was already familiar with this type of technology but i thought it was really helpful.2.  The user interface and the remote is great for the amazon sections of the product.  The remote is super easy to use, simple and reacts well.  The menu is really easy to use, although being someone who watches a lot of TV/Movies via nothing but streaming devices (i don't have cable), I think it's pretty easy to use with the exception of some of the menu items when trying to figure out how to add to a queue, viewing history, etc.  I would rate this a 4 for now. It could also just be me :)3.  When viewing amazon prime TV shows, movies and music that i have bought, it's super responsive and streams really well.Here are my challenges so far:1.  The hulu app experience was very negative.  It took a long time to get running and then when i finally had the patience last night to let it run it's course, i watched one episode and it continually froze the screen while the dialogue continued in the background.  Probably a hulu thing, but definitely hulu and Amazon need to talk.  Chromecasting hulu does not have that problem.2.  In the first week i had to re-boot the fire stick because it said there was no network connection. I tested this by switching to my other HDMI port where my chromecast was connected and was immediately able to play netflex.  Flashed back to Amazon and still \"no connection\".  I re-booted it and was able to go about  my merry way.  In comparison to chromecast, in the year that i have used it, i have had to re-boot it probably 5 times because my app's weren't getting the ability to cast.  Hopefully this won't be a continuing problem when streaming netflix.So far this has been my experience with the device.  Having the chromecast to compare it to helps me determine what the issues are, which so far have been specific to the firestick and not my network. I also work from home, have 3 other wireless devices that are constantly running on my dual-band wifi network so i am a very heavy user of streaming/wireless devices in my home.If the hulu and netflix app's could be fixed to work better with the firestick, i would rate this higher, but for now, this is only useful to me when i want to watch an amazon movie or prime tv show.  It's too bad, i was really thinking i would switch to this device over time in the rest of the house, given how easy the rest of the product/interface is and you don't have to download extra app's onto mobile devices.", "verified": true, "helpfulness": "0/0", "author": "Sondra E Hibler"}, {"rating": 5.0, "review": "I got the Fire TV stick so that I could watch all of my favorite show on Netflix with having to use my Wii. I also love the fact that it has hundreds of free movies and music. There is endless possibilities with the Fire Stick. I highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Janice Clark"}, {"rating": 5.0, "review": "Love it!! I got more than I expected.", "verified": true, "helpfulness": "0/0", "author": "Wanda Langley"}, {"rating": 5.0, "review": "I AM SO SATISFIED WITH AMAZON FIRE STICK! I DONT KNOW WHY I WAITED SO LONG TO CUT THE CORD WITH MY CABLE PROVIDER.  I WAS ABLE TO GET THE PROMOTION WITH SLING TV AND MY FIRE STICK WAS FREE.  I ADDED HULU AND NETFLIX AND I AM GOOD TO GO.", "verified": true, "helpfulness": "0/0", "author": "Jessica Victoria"}, {"rating": 5.0, "review": "Love it really easy to get started.  Plug and begin watching!!!!  Great buy.", "verified": true, "helpfulness": "0/0", "author": "Javon R."}, {"rating": 5.0, "review": "A great device for the price!", "verified": true, "helpfulness": "0/0", "author": "Margaret"}, {"rating": 5.0, "review": "This is a great product. The picture quality is amazing, even with a slow internet connection, and it's pretty simple to use and setup. I love that you can download a remote app on your phone for it too (although apparently apple hasn't jumped on that band wagon yet). I much rather use the Fire TV Stick than my PS3, Samsung TV, or WiiU. Not only is the picture quality better, but you can only assume that your sucking up a little less electricity using this than a gaming console, BD player or computer if you connect the power source to the TV's flash port. It's also super convenient if you use the amazon cloud feature as a prime member. It's easier and faster to transition from one app to another than any of my BD players or consoles. I'd definitely harass my friends into buying this. ^_^", "verified": true, "helpfulness": "0/0", "author": "EYR"}, {"rating": 1.0, "review": "sending it back.  You would think that the easiest thing would be to plug in into the tv but it wont go in.  I feel like I am breaking the tv.", "verified": true, "helpfulness": "0/2", "author": "Linda Erickson"}, {"rating": 5.0, "review": "Yes we wanted to add more streaming to our TV choices.  It works great!", "verified": true, "helpfulness": "0/0", "author": "Terry"}]