[{"rating": 5.0, "review": "easy to set up and works very well", "verified": true, "helpfulness": "0/0", "author": "Jameson58"}, {"rating": 5.0, "review": "I have both the Fire TV Stick and the Fire TV.  I got both the week they came out and actually enjoy using them both.I can say the Fire TV stick for me has been just as good as the Fire TV for streaming both TV ( I don't play games on these devices)The ONLY thing I like about the Fire TV vs. the Fire TV stick is that the Fire TV has an Ethernet port.  I have good wifi coverage in my home but I always prefer wired when possible.", "verified": true, "helpfulness": "0/0", "author": "Brian McL"}, {"rating": 5.0, "review": "It was easy to set up and we love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Having a remote is nice that way my phone or tablet is being taken by my kids when they want to watch tv.", "verified": true, "helpfulness": "0/0", "author": "Heidi Bisaha"}, {"rating": 5.0, "review": "I really enjoy my fire TV stick, it's nice having a remote to use with it instead of the chromecast where if your phone shuts off or you lose Bluetooth connection and you can't pause your TV show or movie, plus I get my Prime Instant video on here too which chromecast doesn't offer either, i'm going to buy another one of these for my bedroom :)", "verified": true, "helpfulness": "0/0", "author": "KristyK"}, {"rating": 5.0, "review": "Great programs!", "verified": true, "helpfulness": "0/0", "author": "Douglas G Blanton"}, {"rating": 4.0, "review": "Still learning about it so far meets most of my needs still need to find local channels some place cutting the cord is the goal", "verified": true, "helpfulness": "0/0", "author": "John D."}, {"rating": 5.0, "review": "Very easy to use after tech support confirms your address and easy access to all movies you offer", "verified": true, "helpfulness": "0/0", "author": "Pamela Moore"}, {"rating": 5.0, "review": "I like it so far but haven't had time to watch many movies but love the idea of being able to without interruptions.", "verified": true, "helpfulness": "0/0", "author": "Lynn Croxell"}, {"rating": 5.0, "review": "Love it! Had my doubts at first but it is actually pretty good!", "verified": true, "helpfulness": "0/0", "author": "Cyreeta Gajadhar"}]