[{"rating": 4.0, "review": "good product but should have used somebody other than postal to deliver. it had return to sender stamps on it and looked like it got smashed, but it still came. i think the post man didn't want to deliver it on christmas eve so the mail man just stamped everything with return to sender and went home early. it came the day after christmas even though amazons tracking said delivered on christmas eve. oh well cant expect mail people to get everything done perfect. still works great for what it is", "verified": true, "helpfulness": "0/0", "author": "alex hornbeck"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "murat sevinc"}, {"rating": 2.0, "review": "Not good!  The Internet connection constantly goes out saying \"good connection but, problem connecting\"  Then you have to wait sometimes hours for it to figure it out and work again, extremely aggravating when you order a movie for $ and can't watch it! Gave it 2 stars cause it is a great idea, good library of shows and movies.  Since I already had the Chromecast, and trying to get rid of cable and had Amazon prime, bought it for $20 through Amazon when they had it on sale. Just wish it wouldn't crap out all the time and have to go back to my Chromecast, hope they fix the problems cause it is a great idea.", "verified": true, "helpfulness": "0/0", "author": "Eric Hrubecky"}, {"rating": 5.0, "review": "I was able to cut my cable bill down. The Amazon stick offers more of a variety instead of the same old shows.", "verified": true, "helpfulness": "0/0", "author": "Angelica Hawks"}, {"rating": 5.0, "review": "I got this a week or so before Christmas and we put it to good use over the holidays.  Installation was very simple and once I added it to my network, it streamed Netflix & Amazon movies without a hitch.  Certainly much better than the clunky computer setup I have been using.  I'll probably get a couple more of these and install on all of my TV's in the house.The unit itself is only slightly larger than a USB thumb drive. I plugged it into my 6 year old Samsung TV and it recognized it immediately.  I did have to plug it into a power strip.  This is much more convenient for Netflix, Amazon Prime & HuluPlus.  However it you want to watch ChromeCast or You Tube, I don't think this will work.", "verified": true, "helpfulness": "0/0", "author": "gadgetdad"}, {"rating": 4.0, "review": "I've used roku boxes, google TV boxes, chromcast, and misc smart TVs but this is my favorite so far. The ui could use a little work, but still is more polished than the others. The easiest way to add prime videos to your TV in an easy affordable way.If prime videos or renting/buying media from amazon is your thing this is a no brainer. If amazon services aren't your thing but want Netflix and Hulu this is still great.It appears the fire stick also works like a Chromecast in that the mobile apps will beam to it. I haven't tested it much, if this is supported or intended then it is just a Chromecast with a ton of extra features.", "verified": true, "helpfulness": "0/0", "author": "MW"}, {"rating": 5.0, "review": "Easy to use.  Great Wi-Fi capability.", "verified": true, "helpfulness": "0/0", "author": "Bunny"}, {"rating": 4.0, "review": "As a prime member, I was able to purchase this at the rock bottom price and for that value I am happy.  Smooth interface but as an owner of Apple TV and Roku, I can honestly say I prefer Roku.  Not knocking the Fire Stick, it has great graphics and ease of use but there is not that much difference from the competitors.  I have yet to try out the gaming but am hopeful that will go smoothly.", "verified": true, "helpfulness": "0/0", "author": "Annlynnmarie"}, {"rating": 4.0, "review": "I have experience with a lot of streaming devices. I've used an HTPC, Rokus, Chromecast, and various other devices. The Amazon stick works very well and I would have a hard time not recommending it for most people looking for a main cord cutting device. I would still recommend a Roku for most people since it has the most comprehensive list of \"apps\" available. However, if you're budget conscious, then the Fire TV Stick will get the job done.", "verified": true, "helpfulness": "0/0", "author": "James V. Mudd"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Mark Wilson"}]