[{"rating": 5.0, "review": "AWESOME LITTLE STICK! SOMETIMES IT DOES HAVE GLITCHES BUT THAT HAS TO DO WITH OUR INTERNET, BUT OTHERWISE IT WORKS AS IT IS SUPPOSED TO! I BOUGHT A 2ND ONE!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "fire stick is amazing. buying them for the whole house. hint: research Kodi/xbmc and genesis add-ons if your computer-savvy. you can get a ton out of this device.", "verified": true, "helpfulness": "0/0", "author": "John Doe \"-Joe\""}, {"rating": 5.0, "review": "This thing rocks.  It runs Kodi with horsepower to spare.  The remote control works from like 50 feet away, it's awesome too.  The only thing is that they should have put an LED or two on the stick for some kind of feedback about power and network status.  Really smooth.", "verified": true, "helpfulness": "0/0", "author": "A. Brown"}, {"rating": 4.0, "review": "The fire stick was easy to setup and has worked well for us", "verified": true, "helpfulness": "0/0", "author": "Rod H."}, {"rating": 1.0, "review": "I am very disappointed in this product. I have the fire tv that works great, but the Firestick constantly loses the signal and when I check the network it shows I have a full signal. I can't get through a full movie or episode with out it stopping. I am not happy", "verified": true, "helpfulness": "0/0", "author": "nicole"}, {"rating": 5.0, "review": "Awesome ui... Super fast. Bought 2 of them... Wish I would of bought these before my roku stick's", "verified": true, "helpfulness": "0/0", "author": "William fonseca"}, {"rating": 5.0, "review": "I wish I had this a long time ago! I wish there was more good free content but $99/year for Prime and $8/ month for Hulu (the services I subscribed to) are great.I'm still getting use to the system. When I switch my TV to HDMI to watch the Fire Stick TV, the screen is black, I have to press home on the remote which is wierd (maybe it's my TV, idk).The remote is small. It's nice the way it fits in my hand. However, I feel like it's going to get lost A LOT. I downloaded the app on my iPhone so at least I have a backup.So far, I'm very happy. I can't wait to use it more.", "verified": true, "helpfulness": "0/0", "author": "Shawn Barnes"}, {"rating": 5.0, "review": "We are very pleased with the Fire tv Stick.", "verified": true, "helpfulness": "0/0", "author": "george spon"}, {"rating": 5.0, "review": "Works like a charm. Nice little device and simple to install.", "verified": true, "helpfulness": "0/0", "author": "Roderick Logan"}, {"rating": 5.0, "review": "Could not get Prime Music without it.  Got movies/tv from Amz via dvd player but apparently needed this for Prime Music", "verified": true, "helpfulness": "0/0", "author": "jeanne mcdonald"}]