[{"rating": 4.0, "review": "Overall it is a fairly good system.  The only problems that I see are that when you stop a show there is a buzz and the every so often there is a pop and a screen glitch.", "verified": true, "helpfulness": "0/0", "author": "SiFi"}, {"rating": 4.0, "review": "Plugged it directly into the HDMI port and a USB port on my Vizio TV, and it started right up (I got the warning to plug it into an outlet, but I don't currently have one available- the TV USB port seems to be working fine). At first I was worried because it appeared as if the WiFi connection to my router was really slow or unstable because it took about 15 minutes to download and install the updated software (everything else in my entertainment setup is wired via ethernet). Once it was up and running, though, it was snappy. I was on Netflix watching one of my shows within 2 minutes (basically as much time as it took to input my login credentials with the controller).There's way less buffering than on my 2nd Generation Apple TV, and the improvement in resolution is a welcome 'feature' from that device. Previously, I had been using the Vizio's built in apps for Amazon Prime, so that is also a huge improvement in usability. The Fire TV UI is a cluttered mess, but as long as what I need to use is easy to find, I don't care (I'd rather just have icons for the things I use- I don't need all the advertising). The Fire TV remote app for Android is nice too. I'm using it on a Nexus 7 (2013).I only wanted to try out the Fire TV Stick for Netflix and Amazon Prime videos, perhaps some YouTube, Netflix, and XBMC eventually. Nothing else it offers mattered to me (music, games, photo sharing... don't need it on my TV). For the promotional price I paid, I certainly can't complain!Edit: I've since sideloaded Kodi and it works great! Just as well as XBMC was running on my jailbroken Apple TV 2. No troubles streaming 1080p content over AFP from my Synology NAS, even with my touchy household wifi setup.Edit 2: I can't believe that it has only been just over a month since I got this thing- I've been using the heck out of it. I've been using an app on my Nexus 7 that'll let me sideload apps directly to the Fire TV stick (http://forum.xda-developers.com/fire-tv/themes-apps/fire-tv-loader-app-android-t2963536). That's been really handy. Also a app on the Nexus 7 that emulates a mouse and keyboard (http://www.amazon.com/Remote-Mouse-for-Fire-TV/dp/B00S4MU62I/). Both have added to the usefulness of the device. I do occasionally play some \"mobile\" games, Zen Pinball and Crossy Road, and have just been using the included remote as the controller... this has got me interested in researching vintage console emulators, and buying a bluetooth controller. I have a feeling that I might run out of space and processor power and want to upgrade to the full Fire TV...", "verified": true, "helpfulness": "0/0", "author": "Spacecat"}, {"rating": 5.0, "review": "This device is awesome. The remote control works very good and if you download the remote control app to your kindle tablet and your fire phone, it will make your experience even better. I am very pleased. (It will be nice if everything will sync with the Amazon Echo)", "verified": true, "helpfulness": "0/0", "author": "Arlene💗"}, {"rating": 1.0, "review": "I was hoping to use the Fire TV Stick when travelling. I have not been able to connect with any hotel wireless network.I received the e-mail claiming (quoted below) to fix this problem. Exactly the same problem as before. All I get is \"connected with errors\". If it was possible to put negative stars I would. So far this device has been totally useless. Please fix it!!!\"Connect to your hotel or dorm room Wi-Fi with captive portal support—Take your favorite movies, TV shows, games, and more with you when you're away from home. Fire TV Stick enables you to connect to Wi-Fi that requires web authentication—this includes Wi-Fi at most major hotels, as well as some universities.\"", "verified": true, "helpfulness": "1/2", "author": "Donald W. Graham"}, {"rating": 4.0, "review": "For a cheap streaming device I really like the fire stick.  I have the Roku2 and Roku3, and I feel like The Fire stick is just as good as my Roku 3.  There are some features that I prefer on the Roku like the slingplayer channel for my sling box, and I really love the audio out jack on the Roku remote.  However For $40 the fire stick is pretty darn good.Here are some of the pro's of the fire stick:-Very small footprint.-easy to use and setup-access to a bunch of prime content as well as other channels such as plex and netflix-side load of some android apps is possible-seems impressively fast given the small size-Voice feature still can be used with fire remote app via your smart phone.Some of the Cons I've found from using a couple of days:-The Remote control for the stick seems to not work well.  Nav buttons are starting to stick and cause unwanted scrolling-It can sideload apps however I don't think it has the power to run most of the ones I attempted, or the app doesn't work properly-Although the front end is very visually pleasing, you can't modify the layout or customize what you see on your home screen-Sideloaded apps are not accessible via your apps on the home screen. Have to go through settings->applications-> manage all apps to access them.-Home screen overloaded with amazon prime content (I guess no way around that given it's made by amazon.)Overall I'm extremely happy with it.  If the remote worked extremely well I would have given it 5 stars.  I got the 19.99 pre-launch deal so It was a no-brainer purchase.  Now I'm considering making the switch to Move my Roku 3 down stairs and get a full blown fire TV unit for my main viewing area.  I currently have 3 TV's in the house.  I would most likely keep my roku3, keep the firestick, and potentially replace my Roku2 with the Fire TV unit.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Morton"}, {"rating": 5.0, "review": "Got it early than expected. Easy to operate and set up.", "verified": true, "helpfulness": "0/0", "author": "Sam72 \"Sam\""}, {"rating": 5.0, "review": "Easy to setup and even easier to use. We have enjoyed the Fire TV Stick quite a bit since we received it, and it was delivered earlier than we were expecting as well!", "verified": true, "helpfulness": "0/0", "author": "TheLaw"}, {"rating": 5.0, "review": "This product is awesome! I bought it on a whim on Black Friday. It was discounted to $25, and I thought why not? It has basically turned my TV into a smart TV. I mainly use this for Netflix, which is great and easy to browse, and Spotify. I love Spotify, and the fact I can sync it up to my TV using my phone is AWESOME! I highly recommend this product, in fact after I bought it, I loved it so much I went back to buy some as christmas presents for the tech-savvy people in my life. :)", "verified": true, "helpfulness": "0/0", "author": "Bailey"}, {"rating": 5.0, "review": "Plugged in.  Switched AV input to it.  Bingo.  Setup was easy and in my limited experience so far, it has been reasonably fast and video has streamed without a hitch", "verified": true, "helpfulness": "0/0", "author": "ROY WINTERS"}, {"rating": 4.0, "review": "Still working on it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]