[{"rating": 5.0, "review": "OMG.  Love this product so much.  I ordered during a promotional special so I received it at half-price, but had to wait several months for it to be delivered.  Well worth the wait. We can now take the ability to stream videos to a television wherever there is an internet connection.", "verified": true, "helpfulness": "0/0", "author": "Christina Willis"}, {"rating": 4.0, "review": "like it alot", "verified": true, "helpfulness": "0/0", "author": "Waynell Jemmott"}, {"rating": 5.0, "review": "The fire stick lets my daughter watch YouTube videos on the tv, which means I now get to shower by myself while she sits in a trance like state watching other people play with play doh. Thanks, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Taylor Gordon"}, {"rating": 5.0, "review": "This is just what I needed! I recommend this to anyone without a \"smart tv\" that wants to be able to watch Netflix, Hulu or anything else on it! Easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Anndrea bishop"}, {"rating": 5.0, "review": "Could not be happier with the Fire Stick....have gotten hooked on 3 new shows that I would not have been able to watch....Great to have during the bad weather...don't have to go out to rent a movie....", "verified": true, "helpfulness": "0/0", "author": "CKSun"}, {"rating": 5.0, "review": "We love our Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Amy Bielema"}, {"rating": 4.0, "review": "I've had my Amazon Stick for a couple of weeks now and i really enjoy it and all its features. I would have given it 5 stars but the only dislike i have is the selecting cable providers for certain apps like Disney. I got this fire stick bc i no longer wanted the cable bill but it asks for your cable provider and then you have to put in a username and password. I would love if you were able to just do it like the other apps and put the code in and then have access to the shows. Other than that, i thoroughly enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Shamika Sims"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "SpecialK"}, {"rating": 4.0, "review": "Have not installed", "verified": true, "helpfulness": "0/1", "author": "Baxter"}, {"rating": 5.0, "review": "Great solution for the tv", "verified": false, "helpfulness": "0/0", "author": "ahmed"}]