[{"rating": 5.0, "review": "We love it. Easy to use. Great price too.", "verified": true, "helpfulness": "0/0", "author": "Faith E."}, {"rating": 2.0, "review": "Having problems with it freezing and buffering a lot.  Have to pull the plug to reset it.", "verified": true, "helpfulness": "0/0", "author": "Doug Broek"}, {"rating": 5.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "william smith"}, {"rating": 5.0, "review": "I was a little surprised how easy this was to get started and how great it works. I finally got to watch \"Band of Brothers\" series and it was like having my own theater", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it. Now I can watch YouTube on the television and view my prime videos as well as look at my photos saved to the cloud.", "verified": true, "helpfulness": "0/0", "author": "Karen M"}, {"rating": 5.0, "review": "Plugged it in and it works perfectly, much to my surprisel, as my last gizmo, Chrome Bar was a dud.  Thank you very much.  Great price", "verified": true, "helpfulness": "0/0", "author": "Richard L. Bracamonte"}, {"rating": 5.0, "review": "yes, I wasn't convinced at first, but once I got to try it at my daughter's home, I wanted it!  Glad I did!!", "verified": true, "helpfulness": "0/0", "author": "Catherine Grant"}, {"rating": 4.0, "review": "Easy to install and configure.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "I love it.....it has been more than expected. I am not very techy...the installation was so easy!  If I had one complaint it would be using the search keys....I would like to see it keep what I have searched instead of having to redo everything.", "verified": true, "helpfulness": "0/0", "author": "Peggy Herdlicka"}, {"rating": 5.0, "review": "Works great...once you figure out how to open the remote control battery compartment.  Searched YouTube and found tge solution of inserting small screw driver into the seam. Excellent product.", "verified": true, "helpfulness": "0/0", "author": "bookcat"}]