[{"rating": 5.0, "review": "I Totally love the Fire  TV stick.  I previously used a ChromeCast.  When the Fire stick arrived,  I did a side by side test, and the Chrome went to the box where I keep things too good to throw out, but will probably never again be used.The Amazon product is far easier to use.  The remote is a pleasure.  The only improvement I could want is for faster internet without paying such a premium.  I am a customer of Time Warner and unlike many others, have no complaints about the service.  I just do not like their pricing policy.  Comcast is in the process of buying them, and I wonder what surprises are in store.I plan to someday, maybe  soon, to buy a \"Smart\" TV and will no longer need the Fire Stick,but since I installed it, the TV buying plans are on a long-term hold.  I am sure that the product has had the same reaction in a lot more homes because it performs so well.", "verified": true, "helpfulness": "0/0", "author": "Herbertk"}, {"rating": 4.0, "review": "Very happy with purchase - easy set-up and works just as I had hoped.", "verified": true, "helpfulness": "0/0", "author": "Karen Toohey"}, {"rating": 5.0, "review": "the stick is only missing the voice search that the main unit has.  Or at least i haven't noticed a difference beyond this.  I take this thing everywhere while on the road.  The adapter, key fob, remote, and a wireless connection is all you need to have prime and netflix at your finger tips.  Hotels, family visits, etc.  Good stuff.", "verified": true, "helpfulness": "0/0", "author": "Tom Ace \"knower of most\""}, {"rating": 5.0, "review": "Great device I love it.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 4.0, "review": "This thing works great wish i would of orderd sooner. Iv had 4 streaming devices this is by far the best. It has over heated a couple times i just unplug and cool off and it powers right back up. Hopefully it has some longevity. As for the apps very happy, it gets alot of movies and tv. I got sling right now and thats good. As for free tv not bad and as for pay as you go there is a ton of options.", "verified": true, "helpfulness": "0/0", "author": "MARK BONNENFANT"}, {"rating": 5.0, "review": "This is an update to a previous review (left below).  I purchased a second fire stick as we got another television in the home and as it turns out the problem was with my receiver.  I ended up purchasing a Panlong hdmi switch from Amazon https://www.amazon.com/gp/product/B00LM3R4L2/ref=cm_cr_ryp_prd_ttl_sol_24 which outputs audio over optical which solved all of the problems .  As a result all of the cons from my earlier review have been negated as they were the result of HDCP issues related to my pre/pro.  The pros all still remain and make this an excellent device with a 5 star review.Having had the Fire TV Stick since launch I will list the pros and cons within the realm of my home theater setup as some users may have different experiences.Pros:1.  Easy to setup and use.2.  Familiar interface to users of Amazon ecosystem devices.3.  Excellent picture quality and the ability to output multi-channel audio, when coded to the source.4.  The ability to run select games is great for kids.5.  Excellent Amazon library, Pandora, Netflix, other media availability through one device.Cons:1.  When used with my preamp/processor the audio feed drops wen clicking through menus.  Once audio is playing in a movie or video this problem disappears.2.  A few months in, the Fire Stick now takes a significant amount of time to sync the video and allow it to appear on the display.  This may be the result of a recent update to the Fire Stick as it is something that has just begun.3.  Despite power isolation, there is an audible low frequency hum from the subwoofer when the Fire Stick is actively playing audio.The cons are significant and severely hamper the enjoyment of the device, but the access to the Amazon ecosystem using the great interface weigh heavily in allowing me to give 3 stars.", "verified": true, "helpfulness": "0/1", "author": "TGFather"}, {"rating": 5.0, "review": "Love it!!! I just hate that some of the movies u have to buy but besides that I love it thinking bout buying another one my husband done took over it so I barely get to watch what I want", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great, it's fast and easy to use. The remote makes it so much easier to navigate.", "verified": true, "helpfulness": "0/0", "author": "Novarox71"}, {"rating": 5.0, "review": "Makes streaming so easy!", "verified": true, "helpfulness": "0/0", "author": "Nindy \"Nindy Lou\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "juan"}]