[{"rating": 5.0, "review": "Easy setup.Larger display on my Smart TV.Remote is easier to use than TV remote.", "verified": true, "helpfulness": "0/0", "author": "Farmer Griffin"}, {"rating": 5.0, "review": "The Fire TV Stick was very easy to set up and works very well.  The Amazon Movies and You Tube are my favorite apps.", "verified": true, "helpfulness": "0/0", "author": "Tom Whissel"}, {"rating": 5.0, "review": "Just got mine today. 10 days eailer than original delivery date. I was just planning on sticking this in the TV in the bedroom but as of now it has replaced my Apple TV in the living room. I found an app that lets me use AirPlay from my iPhone. It even mirrors my display on the TV. Very cool.The games you can play with the remote are surprising fun and with some pretty good graphics, especially coming from such a small device. This thing ownes the Apple TV. (2nd gen) and that's coming from a diehard apple fanboy.Installation was a breez. Plugged it in, connected to my wifi, installed the latest firmware and downloaded the apps of my choosing. I bought this when it was only 20 dollars but even 40 bucks is a great deal.  Can't wait for the iOS app.", "verified": true, "helpfulness": "0/0", "author": "Ryan T."}, {"rating": 5.0, "review": "Love what you can do with this stick, especially running Kodi and Allcast...I bought 5 already for relatives, all happy with it.", "verified": true, "helpfulness": "1/1", "author": "Nirari"}, {"rating": 4.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Neal Petzold"}, {"rating": 1.0, "review": "I wanted an easy to use all in one device that allows me to use my prime membership content. I really wanted this device to be as useful as the Chromecast and have access to my prime movies. The interface is clunky, the ui is slow, the remote is nearly useless, and the phome app is unusable. It is a hook to buy shows and movies from amazon. I don't really care who I pay to rent a movie (Google or Amazon).  I returned this device because Google's product is easier to use and this device does not yet allow me to ditch the Chromecast. I'll just keep casting my prime content from a web browser; it is easier than messing with Fire TVstick.", "verified": true, "helpfulness": "2/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "First night with the Fire TV Stick. WOW! I had previously used a Chromecast. This is like moving from a Piper Cub to a fighter Jet. With my Prime connection online I have access to everything. This just simply redefines how I process entertainment. Movies, TV shows, my photos (which are automatically stored on my cloud) and my music can ALL flow through my TV stick. Beyond incredible!!! I will get another one for my other TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I was excited by the idea of a cheap Roku type device that had Miracast support.  I tried it with a Samsung TV and with my Onkyo receiver.  It showed only the Amazon logo, then blackness.  The support person sent me a new stick.  Same behavior.  I then tried plugging it into my other Samsung TV directly.  It appears to be working on that one.  Very disappointed that I can't use it on my Onkyo when every other device like my bluray player works fine.", "verified": true, "helpfulness": "0/2", "author": "Stephen Rowe"}, {"rating": 5.0, "review": "Installation was fast and uninterrupted. It came pre-programmed with our Prime account info which was surprising. If giving as a gift, you have to note it as gift to remove this feature.I bought this for $19 during the Prime only launch. We recently cancelled Cable for good. And It is well worth it. The remote alone trumps Chromecast as I did not want my phone to be connected and know my TV viewing habits.  Used this on our 7 year old Samsung LCD and worked perfectly. It runs much smoother than the built in Amazon prime app in our new 240hz 55\" Smart Samsung TV.Wish it came with the voice activated remote like in the Gary Busey advert.", "verified": true, "helpfulness": "0/0", "author": "H. NGUYEN \"Pic\""}, {"rating": 5.0, "review": "Very easy and convenient to use.", "verified": true, "helpfulness": "0/0", "author": "Rolando Alejandro"}]