[{"rating": 5.0, "review": "The Amazon Fire TV Stick works very well for our families entertainment needs.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Took a bit of time to get installed,  once up and running IS GREAT", "verified": true, "helpfulness": "0/0", "author": "David W. Nicol"}, {"rating": 3.0, "review": "My lovely  wife and i give it 3 stars....keep up the FABULOUS work.  Katherine and Jeffrey", "verified": true, "helpfulness": "0/0", "author": "J."}, {"rating": 5.0, "review": "Ever since I got this android device I don't even use my old Roku3 anymore.", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 5.0, "review": "Exceeded expectations. Going to buy two more and cut cable!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Easy to install !!", "verified": true, "helpfulness": "0/0", "author": "Linda Gunderson"}, {"rating": 1.0, "review": "This is the worst streaming device I have ever used!  And, as I have read on other negative posts, when you call Support, you are told that you have to be within 10 feet of your router.  So, I asked the agent, should I move my kitchen to my home office or, my home office to my kitchen.  Nowhere on the site does it state you need to be within 10 feet.  I have been on the phone with their techs for almost an hour, done herculean back flips and this device is just terrible.  And yes, my Apple TV, an inch away works seamlessly.  So much for the benefit of Amazon Prime and streaming videos. Unless you live in a studio, and stream on top of your router, stay away.  I just wish there was a rating of zero stars.  This is going right in the trash.", "verified": true, "helpfulness": "0/0", "author": "Terrye"}, {"rating": 5.0, "review": "We have Amazon Fire TV at home.... and got the Stick to take with us on vacation for our kids.  It is great to use at the beach house and in hotels.", "verified": true, "helpfulness": "0/0", "author": "Dana Edwards"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "T.Y."}, {"rating": 5.0, "review": "The Fire TV Stick works like a charm. It was easy to install and provides us with numerous and enjoyable TV watching hours. Thank you amazon!", "verified": true, "helpfulness": "0/0", "author": "Madonna King"}]