[{"rating": 5.0, "review": "Easy to set up and it works well", "verified": true, "helpfulness": "0/0", "author": "Nancy Lovallo"}, {"rating": 4.0, "review": "This works as advertised.I had some initial problems getting it to work with my router; but Amazon help was able to get it functioning (it was as simple as restarting the router, but I had tried everything else with it working, and was ready to send it back as not functioning properly).Directions for use could have been better.  I miss the days when a small booklet accompanied products and described exactly how to use it, and included a troubleshooting section.Connecting to my Kindle Fire HDX requires an additional step not covered in the instructions.You must use the alternate power source if you want it to work properly; which means you are going to need access to an electrical outlet.  This may not be a problem on your home TV, but it can be a challenge when you find yourself in a hotel room with all the cords neatly hidden out of site.", "verified": true, "helpfulness": "0/0", "author": "Randall Barron \"randallbarron\""}, {"rating": 5.0, "review": "I love the Amazon Fire stick. We currently own this and the Apple TV. We've had the apple for a couple of years now and our \"wish list\" of apple fixes were answered by Amazon. No more waiting 5 minutes for the system to stop clocking. One button takes you to the home screen unlike Apple where you have to continuously hit the menu button over and over and over again toEven think about going to the home screen. And it hides behind the tv. One less appendage hanging off of the television. Well done Amazon.", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 5.0, "review": "works great.", "verified": true, "helpfulness": "0/0", "author": "Anthony Powell"}, {"rating": 5.0, "review": "I just installed this yesterday and I am so pleased so far.  It was very easy to install.  The hardest part was moving the chest out from the wall so I could get to the outlet.  I was watching a movie in no time at all.I am having trouble with the music part of it thru Prime but I have not really taking time to figure it out.  I did buy a user Guide for it and I'm sure I will get it going with that.  I just haven't had time to do that yet.  Life calls.I wish I had found it when it was on sale for Christmas.And I'm thinking it would be better to have the voice remote that goes with it but it was another 29.99.  I think it would be easier to find movies you want to watch.  Amazon needs to rethink their set up for movies and their library for kindle prime lending.", "verified": true, "helpfulness": "0/0", "author": "Jean D \"pipmaxjas\""}, {"rating": 5.0, "review": "So easy to use - Reliable download speed - some movies listed as free are previews only though (\"Ascension\")", "verified": true, "helpfulness": "1/2", "author": "Lenzerini \"LancezFun\""}, {"rating": 5.0, "review": "Amazing in every possible way.", "verified": true, "helpfulness": "1/2", "author": "BriaHofland"}, {"rating": 5.0, "review": "Set-up took less than 5 minutes......great add on to my television at an awesome price.", "verified": true, "helpfulness": "2/3", "author": "Veronica Richards"}, {"rating": 5.0, "review": "Works as advertised, great to travel with in hotels with internet and a flat screen!", "verified": true, "helpfulness": "1/2", "author": "Stephen Gilman"}, {"rating": 5.0, "review": "Easy setup and simple to use, it is a great addition to our home entertainment.", "verified": true, "helpfulness": "0/0", "author": "shoe9"}]