[{"rating": 5.0, "review": "Very great item hands down best I've used and easiest", "verified": true, "helpfulness": "0/0", "author": "keith"}, {"rating": 5.0, "review": "I love it.  It was easy to set up and easy to watch movies.  A great item.  Only one problem.  When the Fire Stick is connected it interferes with my regular TV viewing, so I have to unplug it.  I've read other Samsung owners have the same problem.  Other than that I am really glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "D Dunn \"Old Dave\""}, {"rating": 5.0, "review": "Works great.  I bought another!", "verified": true, "helpfulness": "0/0", "author": "Rick Tremmel \"rtremmel\""}, {"rating": 1.0, "review": "I bought 2 firesticks.  They work real well on amazon prime movies. But then I subscribed to netflix and thats when the trouble started.  The picture on netflix would start breaking up and tiling.  Amazon told me it was my internet connection but as I get 40 mbps, I did not think this was true.  So I went out and bought a Roku 3 just to see if it was my internet connection or the firestick itself.  On the Roku, netflix and everything else streams perfectly.  Do not buy this piece of crap.  Get a Roku.  You won't be sorry.", "verified": true, "helpfulness": "0/1", "author": "David Strauss"}, {"rating": 5.0, "review": "Cool", "verified": true, "helpfulness": "0/0", "author": "Kelvin F."}, {"rating": 5.0, "review": "I have both the fire tv and now the stick. If you are not into gaming the stick is all you need! Don't waste your money on a smart tv. Get yourself a stick.", "verified": true, "helpfulness": "0/0", "author": "Andres Carrera"}, {"rating": 5.0, "review": "The best tool I have purchased to view t.v. with.", "verified": true, "helpfulness": "0/0", "author": "Creative Beauty"}, {"rating": 1.0, "review": "It's a waste of money", "verified": true, "helpfulness": "1/3", "author": "alan"}, {"rating": 3.0, "review": "I own the Fire TV Stick plus I have two google chromecast, apple tv, roku and Kodi (XBMC) so I know what I'm talking about when I said this device is three stars, If I have to put them on line of which one is better for sticks ChromeCast is better, is faster and doesn't reboot itself, for box RasperryPi is the cheeper way to watch TV/Movies.Fire TV Stick have potencial for gaming and TV which in theory is superior to ChromeCast but the problem is that is slow, I don't have patience to wait for it, also the WIFI speed is only 802.11b witch is not the best one for streaming my tv is next to me router and I was watching a movie in 480P because of the internet speed in the device I have 75MPS so its not my IPS connection.", "verified": true, "helpfulness": "1/2", "author": "Luis Tejada"}, {"rating": 3.0, "review": "Not bad, but definitely way below expectations.Amazon claims Fire stick is better than Roku stick. This is definitely a stretch. I think is the other way around. Let see the pros and cons:Pros:- Fire stick is cheaper- You don’t have to register it. It comes pre-registered to your Amazon account. You have also the option of changing the account as and when you wish to do so.Cons:- Fire user interface sucks. It is not necessarily counterintuitive but is not comfortable either. Roku has a better and customizable user interface.- Amazon claims higher speed for Fire and no buffering. This is false claim. So far it has taken Fire more time than Roku to start the same show on the same network.- Amazon fire stick lost network connection at least 4 times in a day. This never happened to Roku stick on the same room, on the same TV.- Any app has to be downloaded and manually installed on Fire. They are preinstalled on Roku stick. You just have to activate it/added to the favorites.- CC is either too small (1” tall on a 55” TV ) or huge on some channels. There is no way to adjust it. Roku offers the user the option of easily customizing the CC size.I had seriously considered yesterday returning the stick to Amazon. It does not worth the hassle. Most likely the stick will end up somewhere in a box with other obsolete electronics. I will stop by Best Buy today to buy a second Roku stick.", "verified": true, "helpfulness": "1/2", "author": "L.M.H."}]