[{"rating": 5.0, "review": "exactly what I wanted. If we can get more content,etc. this is a great solution to having cable.", "verified": true, "helpfulness": "1/1", "author": "Jarrod Watson"}, {"rating": 5.0, "review": "I love it! !!!! $", "verified": true, "helpfulness": "0/0", "author": "MIRELLA PEREZ"}, {"rating": 5.0, "review": "It's awesome...haven't had any issues with a lag or buffering!!  Very happy we got this, it's nice to watch amazon instant video and Netflix on something other than my ipad!!", "verified": true, "helpfulness": "0/0", "author": "Catherine A. Pudwill"}, {"rating": 5.0, "review": "I purchased this for my older flat screen that was not a smart TV, and it works great.  I have access to all the programs and everything I need.  Installation was minimal and everything was up and running in less than 10 minutes.  Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Tom Thomason"}, {"rating": 2.0, "review": "I have an issue with this there seems to be a fault  on it and I can't use Netflix!Lots of the channels that look worthwhile look like a subscription is due to watch..", "verified": true, "helpfulness": "0/0", "author": "catchdatdeal2"}, {"rating": 5.0, "review": "I am very pleased with this purchase! So easy to install!!! I didn't get frustrated one time! LolComes with Amazon prime movies, as well! I only wish I got this when it came out and got the Amazon prime lower price!!! 5 stars +++++", "verified": true, "helpfulness": "0/0", "author": "Syd"}, {"rating": 4.0, "review": "nice, better than i thought", "verified": true, "helpfulness": "0/0", "author": "tradog626"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "stephen cowan"}, {"rating": 5.0, "review": "I love this. Sure beats cable. I am watching shows I didn't even know existed.  It was easy to set up and easy to use", "verified": true, "helpfulness": "0/0", "author": "phyllis ives"}, {"rating": 3.0, "review": "I am unsure if I have received a faulty product or what the deal is... but when watching shows I get an error message telling me that my internet connection is gone, when I know in fact it is not. To get it to connect again is a pain in my rear. I have tried several times to log in to my Netflix account and there is an error with that. It is a frustrating purchase especially since I want to love it so much.", "verified": true, "helpfulness": "1/1", "author": "Sandra"}]