[{"rating": 5.0, "review": "Not having a Smart TV, this was a necessity.to download from the Internet... videos from Amazom", "verified": true, "helpfulness": "0/0", "author": "Jean M. Kirby \"TV of BibleCode\""}, {"rating": 5.0, "review": "Love it, ordered it with subscription to Sling tv.  All we watch is prime tv, netflix.  My hub watches ESPN 2 for fishing and I like AMC for walking dead so this suited our needs :)  I may check out better call saul too.  Sling also has abc family and we like modern family so that is cool as wel!!!!!  It has adult swim and cartoon network which shows some popular cartoons and such for the teenagers.I digress.  Anyway we hooked it up without issue to our Sony Bravia television and the picture was stunning!  I was also able to connect through the kindle fire stick app on my 2012 kindle hd tablet and download the app to my android cell phone and connect and use the \"fling\" feature through there.  This made the fire stick even EASIER to use because it come with a keyboard function.You can download several apps and games as well and probably even shop on there too I am geussing if you wanted :)great purchase.  For 20 bucks a month sling gave us a great alternative to cable.  I pay $80 a month for the highest/fastest internet I can get as I have a family of computer/gamers.  So for around 100 a month I know have a little television and internet.  I find this is still less than many popular \"bundled\" packages.As a prime member I also have access to lots of free content on amazon and the option to rent current content on family nights, which is almost like the \"on demand\" option through cable, I feel as though I am missing nothing????What a hit!  Thanks amazon!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jaime-anne Billiel"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "DRINA HUDSON"}, {"rating": 5.0, "review": "We love this already. I cannot give any opinion on the technical aspects.  It does have a good picture and we actually had to turn the volume on the TV down because it is louder than cable.  We are still exploring everything and look forward using it.", "verified": true, "helpfulness": "0/0", "author": "Michelle Gibson"}, {"rating": 1.0, "review": "The Fire TV stick repeatedly disconnects from wifi, I don't think I've ever had more than 30 minutes of uptime.  I preordered in Oct and received in Dec.  After initial set up I was so annoyed that I never used it again and forgot about it.  I  still has access to Prime on the Roku so it wasn't a large issue. Recently I remembered it and tried it again, but on multiple networks it had the same connection problems. It says strong connection but it isn't connected; only unplugging it briefly seems to fix it.This is a very common complaint and it pretty much renders the device useless.  Restarting the stick does temporarily fix it but that is not something I should have to do frequently.  I'm an early adopter so this kind of snafu is always a risk, but I didn't expect it from a major player like Amazon.I'm really glad I preordered for only $20.  I don't know if I can get a return at this point.On the plus side I appreciate my Roku that much more now.If you are considering the Fire TV stick wait to see if a fixed product is released, then wait again to see if it actually works.", "verified": true, "helpfulness": "3/3", "author": "D and K"}, {"rating": 5.0, "review": "This device is an excellent value. Setup was very simple; it ships pre-configured to your Amazon Prime account. I purchased this for the main purpose of viewing Prime video and Netflix, and it does both very well.", "verified": true, "helpfulness": "0/0", "author": "Mike Assad"}, {"rating": 5.0, "review": "No need for cable or dish any more.", "verified": true, "helpfulness": "0/0", "author": "broc"}, {"rating": 5.0, "review": "Arrived fast, and works great. The phone app makes it even easier to use.", "verified": true, "helpfulness": "0/0", "author": "Matthew S."}, {"rating": 5.0, "review": "I absolutely love my Fire Stick. We have had it a few months now. It makes using Netflix so much easier. I also have Amazon Prime and have found plenty to watch using the fire stick. We also play games through it as well. And I can now play Pandora through my t.v and stereo system.  It  renders things quickly and have not had any problems with it. I wish we had gotten this sooner. Having the remote means we do not have to use our phone to cast things like you do Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Witt"}, {"rating": 5.0, "review": "This works so well, I can't believe how affordable it is.", "verified": true, "helpfulness": "0/0", "author": "Doc IA \"KM\""}]