[{"rating": 3.0, "review": "It's not bad but I got it to mirror my kindle to the tv, this feature does not work with kindle fire he so that was kinda disappointing and was also disappointed that there is no hbo go app.  Other than that it does everything it says it does.", "verified": true, "helpfulness": "0/0", "author": "John Bulmer III \"John B\""}, {"rating": 5.0, "review": "A lot more features than I expected.", "verified": true, "helpfulness": "0/0", "author": "Zachary August"}, {"rating": 4.0, "review": "have had it for 1 wk and enjoyed it.  it has met all of my expectations. i do have to pay an additional fee for any of the new tv shows that i want to watch ( 1.99 per episode) but still has been nice", "verified": true, "helpfulness": "0/0", "author": "John Staggers"}, {"rating": 1.0, "review": "It always drops the network connection! no matter how many times we toggle, unplug, plug back in or restart out router this always happens! a total waste of money!", "verified": true, "helpfulness": "1/1", "author": "Katrina"}, {"rating": 5.0, "review": "I love it!!! So easy to install and watch on my tv.", "verified": true, "helpfulness": "0/0", "author": "fwraynor"}, {"rating": 5.0, "review": "I pucchased the Fire tv stick after doing several months of reserch best i can say is i enjoyed it so much i bought 1 for my daughter as a birthday present", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Enjoying it very much. So much to view or catch up on. Very easy installation.", "verified": true, "helpfulness": "0/0", "author": "Marilyn"}, {"rating": 5.0, "review": "love this thing. and with the free app you can run it from your smart phone as well. so you know amazon isn't trying to screw you with having to replace a remote if you ever lose one. Its this kind of attitude from Amazon that will probably keep me a customer for life.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very cool gadget. Can do so much more than chromecast. Router is two walls aways and the signal is solid. Battery compartment on the remote is haaard to open - an odd oversight on amazon's part.", "verified": true, "helpfulness": "0/0", "author": "Alexander"}, {"rating": 5.0, "review": "Love it. We use it in our bedroom on TV so we can access Prime instant video and Netflix upstairs(we don't have a smart TV). Works great and as advertised.", "verified": true, "helpfulness": "0/0", "author": "Daniel P. Earle \"DPEarle\""}]