[{"rating": 1.0, "review": "I don't understand why Amazon support was so difficult to work with in this instance. I've never had problems working with them before.The device behaves as follows: Device initializes/boots, prompt to press the play/pause button to continue, scans and finds available WiFi networks, I select my WiFi network and enter the correct password for authentication (all other wireless devices in my household connect successfully, so yes it is the correct password), the device states it successfully connected, and it checks for updates.Note: At this point there may be an issue as it just moves right along as it found no updates.Next the device asks me to select my Amazon account or to use a different account, and I select my Amazon account. The device states \"successfully registered\". The next screen is \"checking network speed\" after this it displays a blank screen for several minutes with no error messages, codes, etc. It displays nothing.The device reboots, and redirects back to the very first screen (press play/pause to continue) as though it is starting up for the very first time. Then it proceeds to go through the exact same first-time initialization steps that I just outlined.I spoke with Amazon support, and they walked me through the motions of basic troubleshooting. I have disconnected and reconnected the device several times with and without the HDMI extender/adapter. I have power cycled my network several times. I have tried the device in two different TVs, on every HDMI port available. I even tried with and without the HDMI adapter on all of those ports, and power cycled my network during that process several times.It behaves the same way every time. I even requested an exchange, and instead I received an email from Amazon stating I should try to troubleshoot the device by power cycling the network which I already did. They also recommend checking for updates through the settings menu, but as I already pointed out I haven't been able to get past the initial setup! I can't get the the HOME screen.I'm returning the device, and I guess I'll stick with my Roku which works perfectly fine connected via WiFi on my network.", "verified": true, "helpfulness": "4/4", "author": "Nathan"}, {"rating": 3.0, "review": "Missing some major Apps like Vudu.", "verified": true, "helpfulness": "0/0", "author": "Winthrop"}, {"rating": 4.0, "review": "Its a Snappy Device and easy to setup. i have a few so so feelings..wish the controller didn't click so loud when u hit a button and i'm not really into the User Interface Menu set up, would like if i could customize it and make it look cleaner. navigating to stuff is a'little messy. Maybe i'm just use to my Roku setup. But for the Price its still a Solid Device !!", "verified": true, "helpfulness": "0/0", "author": "Acdzbrn"}, {"rating": 1.0, "review": "Mirroring doesn't work.  Amazon has not gotten back to me in over 2 weeks.", "verified": true, "helpfulness": "3/3", "author": "RAE \"RAE\""}, {"rating": 5.0, "review": "Streaming quality and speed is excellent! Very happy with this purchase. Great value!", "verified": true, "helpfulness": "0/0", "author": "Tim K"}, {"rating": 3.0, "review": "My router is \"too far away\" for this to work on the family TV (in a 1200 sq ft house).  Works fine in bedroom, where it is across the hall from the router.", "verified": true, "helpfulness": "1/1", "author": "Cathy McFarland"}, {"rating": 3.0, "review": "No HBO GO!!!!", "verified": true, "helpfulness": "0/1", "author": "Carl Payne"}, {"rating": 1.0, "review": "EPIC FAIL! Amazon Fire Stick Not Ready For Prime Time.Day 1: Didn't work without  HDMI extender. Looks good. Clear, sharp HD image. Very pleased with Fire Stick. Then, bottom falls out and Fire Stick sucks out. No fire, no connection. Remote has no effect, no control. Frustrated, cursing, Vow to return product.Day 2: Seems to work fine in morning and early afternoon, then at night...same problems, after good reception for about 20 minutes, picture starts freezing, sound continues, then everything blacks out. Hit Pause, then Play, show resumes for maybe two-minute intervals, always with picture freezing. This goes on for about 5 pause/plays and finally we get frustrated and shut the whole thing off and go back to Roku. Roku reception: fine. Fire Stick dependability: 0.What the hell happened, Amazon? You should work the bugs out before you take peoples' money. Shame on you.I am returning this thing for a refund. Thanks for the waste of time and the frustration.", "verified": true, "helpfulness": "3/4", "author": "Randy Chandler \"Randy Chandler\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Tony raymaker"}, {"rating": 5.0, "review": "Love it. Its great. I was surprised it came earlier than expected.", "verified": true, "helpfulness": "0/0", "author": "Memphis Man \"eldrick\""}]