[{"rating": 4.0, "review": "I would have given this 5 stars on first use. But then it started buffering and locking saying network was \"too slow\". There is nothing wrong with the network. I tried it with and without the dongle. I am going to assume a defective unit and get it replaced, hope for improvement.Update, after way to much time with \"customer support\" they finally agreed to replace the unit. New unit seems to be working fine. What it offers completely meets my needs and it is idiotproof (me-proof) to install.", "verified": true, "helpfulness": "6/6", "author": "R. Gordon \"LePin\""}, {"rating": 4.0, "review": "The Amazon Fire TV Stick works really well for the Amazon ecosystem. I really enjoyed the experience.The installation process is reasonable straightforward. After connecting the power, I plugged it to one of the HDMI ports on my Onkyo Receiver which is connected to the TV through HDMI cable. Installation on TV using the remote control is pretty straightforward except entering the network password using the remote, which failed numerous times because I was confused by one of the letters displayed on screen. It's annoying that it doesn't connect to the router by using WPS protocol. This is my first connected A/V device that doesn't allow WPS connection.It connects to the network and Amazon server in seconds. I used to take a break when connecting to Amazon server using my Samsung Blu ray player. So this is a big plus.  Thanks to its fast processor and the 8GB on board memory, the 10 sec fast rewind and fast forward buttons are very sweet, doing that on smart blu ray is nearly impossible. Slow connection to server, slow download, and poor response to remote control are the main reasons that I prefer local media over streaming. Amazon Fire TV Stick large takes care of these issues.Going through contents is smooth, thanks to the fast response to the remote control. Youtube works well. Currently there are not many Apps or subscriptions available, which doesn't bother me much because I don't use them. A major concern is that it doesn't play any local contents, such as photos, musics, and videos stored on a network drive. You need to keep your media player such as smart blu ray player.The hardware is pretty well designed with just a few minor issues. The USB power supply plug is a cool looking tiny box, but it's a bit too wide that it lands on the base of the adjacent plugs. Plug slots are typically precious near the entertainment center. There is no reason to have a USB power plug taking up 3 slots. The remote control is sleek and the minimalistic keys are easy to access by touch (i.e. I don't to look at them in the dark). The battery cover for the remote control is very hard to open. Hopefully I'll not need to be open it again. The remote control feels a bit slippery and cheap. A rubber finish or a texture  finish would help.Pros:1. Reasonably easy to install2. Very fast connection to server and download3. Fast and responsive remote control actions help the experience closer to local media play4. Fast 10s rewind and forward keys work wellCons:1. Lack of WPS router connection means you have to enter the network password with a remote control.2. USB power plug lands on the base of the adjacent plugs - would take 3 slots on a power strip.3. The battery cover for the remote control is very hard to open.4. It doesn't play any local media stored on network drives.Buying the Fire TV Stick is a very nice experience. I pre-ordered it for $19, which was a very sweet deal and I barely glanced through the feature listing before placing my order. It was originally scheduled for early January 2015 delivery. Amazon moved up the date twice so I received it on 12/12j, which means I can play with it and watch movies during the holiday season. I have to say Amazon really knows how to spoil their customers. Very pleased.", "verified": true, "helpfulness": "1/1", "author": "Jz8084cc"}, {"rating": 5.0, "review": "Simply amazing....", "verified": false, "helpfulness": "0/0", "author": "Prakash Manikwar"}, {"rating": 5.0, "review": "Absolutely love this Fire TV Stick; am considering buying another.And it's even better once  you sideload XBMC.", "verified": true, "helpfulness": "0/0", "author": "Vicki"}, {"rating": 2.0, "review": "Mother once told me that things I wait for would be better... well, I waited... almost two months, and two delays, and maybe I expected too much, but I was sorely disappointed with the Stick.  I have two Rokus, one on a different floor, probably 50 ft away from my modem, and the reception is fine.  I put the stick in a room maybe 20 ft from the modem, and it cannot hold the signal.  I am either going to have to move my modem, or attach the Stick to the tv I use for a computer monitor in my office.  I do not care to watch tv at my desk.  I tried it, just to see the selection, and find the Roku selection much better plus I had loaded many \"private\" channels ( addresses available if you subscribe to the free weekly Roku newsletter) to the Roku.  .  Not sure what I'm going to do with the stick, but sure am disappointed.  I had hoped to be able to watch movies on that tv..", "verified": true, "helpfulness": "1/1", "author": "Dollhunter \"Diana\""}, {"rating": 3.0, "review": "love it... except, it creates signal interference with over the air antenna signal. Strong enough to cause the TV to lose signal every 10, 20, 30 seconds. BUMMER. I have to unplug the Fire Stick to watch antenna TV. I unplugged the power supply from the wall and the interference stops. I unplugged the Fire Stick from the power supply, the power supply still plugged in, interference stops. It's not the power supply, it is the Fire Stick. It's emitting the signal interference.This needs to be addressed by Amazon and a remedy provided those of us with the issue. I also have an Apple TV and that's not an issue with it.", "verified": true, "helpfulness": "0/0", "author": "Carl Edwards"}, {"rating": 1.0, "review": "I've had nothing but setup problems,  made several calls to customer service tech line, gotten nowhere. It's been weeks & I still can't get it to function.", "verified": true, "helpfulness": "2/3", "author": "Deborah A Straley"}, {"rating": 3.0, "review": "I was excited that I received it early I the mail! Worked wel the first night we used it.  Although we are trying to watch a movie now and we hear it but unable to see anything. Anyone else experiencing his?", "verified": true, "helpfulness": "1/1", "author": "Veronica Kunkel"}, {"rating": 3.0, "review": "Preordered this one for $20 but it was taking a long time to be delivered, and before that Staples came out with a $25 deal, so grabbed that one and cancelled this preorder. For the price, it's a very good device, but as other reviewers mentioned, this is best for people who use Amazon contents; for others including myself, this might not be the best choice. I wanted to use this to watch Youtube videos and play around with a lot of Android apps, and was disappointed with the navigation system and USB/Bluetooth accessories/apps incompatibility which completely killed all my excitement to use it as my Media Center and a big screen computer. If I could somehow flash pure Android into this device, I might use it, if not, it will be just a waste of my time and $25 since I don't use Amazon's video contents.Few days later, I instead bought the $60 Winbook 7\" Windows 8.1 tablet from Microcenter which featured HDMI, bluetooth, USB ports and Micro SD slot. I connected this tablet to my 47\" 3D Smart TV, connected wireless keyboard and mouse, and now my TV is a huge computer which serves all my purposes, something which I expected from the Amazon Fire TV Stick, but it could not deliver.", "verified": true, "helpfulness": "0/2", "author": "Kaji Lama"}, {"rating": 5.0, "review": "This is a really nice, small device that works as it should. Using the Fire TV stick is binging your Amazon content where it should be - to your living room. Over the years, I purchased a number of songs on Amazon and I use Amazon Prime to watch videos. All of this happened on my laptop. Now, I have the same content in my living room, ready to use at the tap of the remote control. I love it, and I am rediscovering content I own but forgot about. How great is that?We have it connected to an ASUS computer LED monitor and with a 90 degree adapter it fits perfectly into the back. It also has no problem getting a wireless signal in our house - although the router is on the second floor. Set-up was a breeze, took me less than 5 minutes and I was ready to go. The menu takes some getting used to and could respond a bit faster, but it works well with the remote. For the price, the little Fire TV stick is well worth it.", "verified": true, "helpfulness": "0/0", "author": "K. Libertus"}]