[{"rating": 4.0, "review": "We love being able to take our kids' shows with us when traveling to grandparents or even hotels.  Had very, very few connection issues.  Did NOT work in Europe.  (That would have been AWESOME!)", "verified": true, "helpfulness": "0/0", "author": "Mazzie Bee \"Teacher and Mom\""}, {"rating": 5.0, "review": "Very easy to set up. Had trouble with wifi at first, but it had to do with the location of my router. Very intuitive and convenient for anyone who doesn't have a smart TV or has a dated one. Processes excellently, rarely needs time to load anything native.", "verified": true, "helpfulness": "0/0", "author": "Robert Almeida"}, {"rating": 3.0, "review": "Wifi receiver doesn't seem that strong. Must keep power cord plugged in. Would prefer a way to plug in ethernet. All in all it's pretty convenient though.", "verified": true, "helpfulness": "0/0", "author": "josh"}, {"rating": 5.0, "review": "Wonderful, works perfectly!!!", "verified": true, "helpfulness": "0/0", "author": "AA"}, {"rating": 5.0, "review": "Wicked cool device. Rrally allowed our family to take advantage of prime video, prime music and pandora.  Works great, simple to install. Even some games for the kids. And for 20 bucks on prime day....no.complaints here.", "verified": true, "helpfulness": "0/0", "author": "Gargoyle"}, {"rating": 5.0, "review": "Works as advertised.  The fast start feature seems to depend on very fast data rates.  I reliably get 20 MB/sec, but still it gripes and jitters a little on starting a stream.  But after that it works flawless.  I turned off the gripe and am very happy with it.", "verified": true, "helpfulness": "0/0", "author": "James Hendrix Jr."}, {"rating": 5.0, "review": "Amazing!!!", "verified": true, "helpfulness": "0/0", "author": "LoUdOgG24 \"Louis L. A. Romano\""}, {"rating": 5.0, "review": "Awesome buy. For an awesome price.", "verified": true, "helpfulness": "0/0", "author": "ALFREDO I RODRIGUEZ"}, {"rating": 5.0, "review": "Arrived quickly and was easy for set up. Noticed that it didn't turn on right away so I used the included HDMI extention. Turned on immediately after. Using it daily without any issues.", "verified": false, "helpfulness": "0/0", "author": "Nonomex"}, {"rating": 5.0, "review": "Just as good as the Fire TV and faster than Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Patrick Fenoughty"}]