[{"rating": 2.0, "review": "I bought the Fire Stick for the sole purpose to use the nba game time app so I could stream games. The app constantly freezes.  So disappointed.", "verified": true, "helpfulness": "0/0", "author": "Regina Murray, OSB"}, {"rating": 5.0, "review": "Tons of stuff to watch and do........ it's awesome!!!!!", "verified": true, "helpfulness": "0/0", "author": "Erika"}, {"rating": 4.0, "review": "The Fire TV Stick was a Christmas gift.  I am very pleased with it and will get a lot of use out of it.  It was easy to install on my TV.  We have watched one movie which streamed perfectly, no gaps or interruptions.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow. now the Wii console is downstairs and we have all our connectivity.Took 3 mins to install and use due to pre programming be Amazon.", "verified": true, "helpfulness": "0/0", "author": "Lance"}, {"rating": 4.0, "review": "The setup was very easy. The only thing i was hoping to be able to do access more tv shows without cost. Other than that its great", "verified": true, "helpfulness": "0/0", "author": "southernangel"}, {"rating": 5.0, "review": "This has been great!", "verified": true, "helpfulness": "0/0", "author": "Lyndsie"}, {"rating": 1.0, "review": "Save your money.  Even at $19 I realized I made a mistake when I got this thing up and running.  I found it nearly impossible to move around in the movie world offered by Amazon without wasting most of my life moving from index to index.  Why did Blockbuster have to fold anyway?", "verified": true, "helpfulness": "1/1", "author": "Bob \"Bob\""}, {"rating": 5.0, "review": "Worked right out of the box. Extremely simple installation.  Now I can use my Prime membership on my TV, not just my kindle.  Great product.", "verified": true, "helpfulness": "0/0", "author": "Richard C. Lehrman \"Roach353\""}, {"rating": 3.0, "review": "Delivers amazon content well, but I bought it to stream twitchTV and the twitch app is horrible.  No sign in, no search, and no chat.", "verified": true, "helpfulness": "0/0", "author": "Dan Jones"}, {"rating": 5.0, "review": "Super easy to use and makes a non smart TV basically into one! Way better than using my tablet or computer", "verified": true, "helpfulness": "0/0", "author": "steph"}]