[{"rating": 5.0, "review": "It works well", "verified": true, "helpfulness": "0/0", "author": "danny shepherd"}, {"rating": 5.0, "review": "Great for streaming", "verified": true, "helpfulness": "0/0", "author": "Louis"}, {"rating": 5.0, "review": "Very cool for the money and add Sling TV for $20 a month and you can cut the cord.  https://www.sling.com/", "verified": true, "helpfulness": "0/0", "author": "Know it all Mike \"Mike from Ohio\""}, {"rating": 3.0, "review": "The fire stick is easy to use.  There are a lot of options with all the games, movies, tv shows, etc.  The negatives are that a lot of the tv shows and movies are Pay Per View so that would quickly bring the $99/year you pay for Amazon Prime up.  We couldn't figure out how to use it on a different tv so I'm not sure that's possible.  Also, there was so much buffering that we cancelled it during our free trial.", "verified": true, "helpfulness": "0/0", "author": "Tammy Cachat"}, {"rating": 4.0, "review": "More than expected.", "verified": false, "helpfulness": "0/0", "author": "Susan Kirby"}, {"rating": 4.0, "review": "Have played 2 movies thru Amazon Prime and both worked ok except when I wanted to fast forward or rewind I got this awful noise thru the sound.  What would cause this?", "verified": true, "helpfulness": "0/0", "author": "Richard V."}, {"rating": 4.0, "review": "outstanding", "verified": true, "helpfulness": "0/0", "author": "Dorsey Abbott"}, {"rating": 1.0, "review": "The only reason I bought this is, because of the sad fact that it was the only way I can watch Amazon video on TV with subtitles and guess what? FireTV Stick break again and again, it won't work again after a week. I'm sick and tired of it.Network disconnections, constantly rebooting, glitchy video playing, and so much more.", "verified": true, "helpfulness": "1/2", "author": "Tyler"}, {"rating": 4.0, "review": "Had issues getting it set up. Was told by tech it wasn't designed for a RCA they were wrong would be 5 stars if it wasn't for the tech support department", "verified": true, "helpfulness": "0/0", "author": "ALbert Nadeau"}, {"rating": 5.0, "review": "I use amazon on a daily and ordering the firestick for my TV was the best choice I've made. I used to have to plug up my computer and that was getting to be a pain. Just plug the firestick in and go. Set up was really easy, and they had a short video to explain the things you could do. Now my movies, tv shows, music, and games are all at the control of a remote!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]