[{"rating": 5.0, "review": "Easy to use. great solution for a \"non\" smart TV.", "verified": true, "helpfulness": "0/0", "author": "green girl"}, {"rating": 5.0, "review": "It's working great and has a fast processor.", "verified": true, "helpfulness": "0/0", "author": "robert"}, {"rating": 2.0, "review": "Like some others have stated, my unit is fine when freshly powered on, but after it's been on for a day or so, it starts freezing.  At first it's just a little, but then the freezing get's worse and worse until I have to power cycle the stick.  Then it's fine.  I never had to do that with my Roku in the exact same set up.  Not thrilled.", "verified": true, "helpfulness": "0/0", "author": "Phillip Beauchamp"}, {"rating": 4.0, "review": "Image seems a little washed out, starts up fast, wish it would go directly to netflix, it has great integration with amazon", "verified": true, "helpfulness": "0/0", "author": "Joshua D. Cadwell"}, {"rating": 5.0, "review": "I absolutely love this thing! The menu is incredibly snappy and responsive which is a major issue I have with one of my media boxes. It has a remote which is great too. It has an app for almost everything which is very nice also.I have a couple small issues that I've found annoying, but that don't take away from the device/service.1. Amazon music doesn't always work quite like it should. The repeat function sometimes doesn't work when using the firestick.2. Amazon music again... you don't get a nice browseable selection, you have to do searches. I'm sure this will be changed eventually.3. When it loses power mine lost my account settings for things like pandora and netflix and it all had to be re-entered.Those are relatively minor complaints though. The fire tv stick has taken over from our chromecast as our main media viewer. I still love my chromecast too, but having to have a smartphone/tablet/pc to use it is a little annoying.", "verified": true, "helpfulness": "0/0", "author": "Joleme"}, {"rating": 5.0, "review": "I love my Fire Stick! Easy to stream & download, kids like the games really well. Liked it so much I bought a second one for my other TV :)", "verified": true, "helpfulness": "0/0", "author": "Trish"}, {"rating": 5.0, "review": "Easy to use, easy to set up.", "verified": true, "helpfulness": "0/0", "author": "victory"}, {"rating": 5.0, "review": "loving the speed", "verified": true, "helpfulness": "0/0", "author": "ajit"}, {"rating": 5.0, "review": "Great product! I like the Fire Stick a lot more than the Chromecast and Roku.", "verified": true, "helpfulness": "0/0", "author": "Rehan Ali"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]