[{"rating": 5.0, "review": "perfect for the bedroom TV which isn't a smart TV", "verified": true, "helpfulness": "0/0", "author": "Erik W."}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Steve Stepanic"}, {"rating": 5.0, "review": "Best tech under $50", "verified": true, "helpfulness": "0/0", "author": "Erik DeMicco"}, {"rating": 4.0, "review": "This is a well engineered, albeit different, device. It works as advetised. If you have a question about it and go to the website noted in the simple instruction sheet you get nothing, nada, nichtn nuttin. It actually tells you the page is not there and go to home page which is set up to sell you more stuff. All I needed was to find out what to do when my available memory was used up, you know- how do I return it when I don't need it or what is eating it. Right now I will wait until it runs over and stops then call them on phone and ask for tech help and proceed like I did when I bought it.", "verified": true, "helpfulness": "0/0", "author": "Robert B. Deal \"herbavor\""}, {"rating": 1.0, "review": "We haven't even used it due to connection issues.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Fiesel"}, {"rating": 5.0, "review": "Easy to set up and works great", "verified": true, "helpfulness": "0/0", "author": "Bee"}, {"rating": 5.0, "review": "Very impressed with the Fire TV stick.  The hardest part of the installation for me was getting the battery cover off the remote!  Very easy to surf the menus and have enjoyed a movie and several episodes of the series \"Downton Abbey\".  Planning to spend many hours enjoying the programming.  Haven't checked out Nexflix or Hulu yet, there is enough available on Amazon Prime to keep me entertained.", "verified": true, "helpfulness": "0/0", "author": "Gary Fletcher"}, {"rating": 5.0, "review": "Awesome. Comes with 30 days of prime. It's geared towards Prime but you can easily download apps etc w/o having Prime. Definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Itsthattime"}, {"rating": 4.0, "review": "It works as I expedited.  It's small but allows me to see all the programming I'm looking for, I highly recommend this to anyone who is considering a streaming TV solution.", "verified": true, "helpfulness": "0/0", "author": "Herb Lorenz"}, {"rating": 5.0, "review": "Awesome device. Works great. Do buy!", "verified": true, "helpfulness": "1/1", "author": "Kevin Jameson"}]