[{"rating": 5.0, "review": "Love it. Don't have to turn on the xbox to watch  youtube, or netflix or amazon prime anymore.  I did have some issues with the updates, took longer than I expected. (about 30 min) had to also unplug it a couple times I guess to reboot it.  But after that works great!  Do wish they made the plug a little longer.  The remote could have a few more functions that would be a plus. But in all a great item!", "verified": true, "helpfulness": "0/0", "author": "frank"}, {"rating": 3.0, "review": "I finally received my Fire TV Stick in the mail last night and needless to say I was pretty excited.  Amazon did a nice job with the packaging and nothing was overly packaged or protected or wrapped in excessive cellophanes or Styrofoam.  The pieces were very easy to make sense out of.  The batteries go in the remote, the USB cord plugs into the power brick and the Fire Stick and the Fire Stick plugs into your TV.  Easy peasy... wrong.My plan was to use this in our bedroom to replace an outdated and ugly UI streaming box we've had for a couple of years now.  The TV is smaller and older in the bedroom, so I used the HDMI extender to make things a little easier on my self for accessibility.  I plugged everything in and the Fire stick booted right up, connected to the remote and searched for wifi networks without a hitch.I must have tried both my 2.4 and 5G networks about a dozen times each, always failing to connect.  I rebooted and refreshed, watched the stupid how-to videos on Amazon and went through all the troubleshooting guides.  Nothing worked.  I set up with the same configuration out in the living room, so I was closer to my router with better reception.  Still nothing.  I removed the HDMI extender feeling it was unnecessary at this point and thinking it had something to do with my ridiculously complicated wifi password, I set up a simple guest 5G network with no password.  BAM, PRESTO, it works.  WTF.So now I run the updates and register and watch the stupid video you can't skip through and I get to my home screen with tons of media to watch.  I think okay, it's working, let's set it back up in the bedroom.  I put back the HDMI extender and plug everything in and now my home screen is just a spinning wheel.  It lost the wifi connection, but how.  The Fire TV Stick holds the wifi info in it's memory and automagically reconnects when that network is present.  Our phones, tablets and old crappy streaming box could connect just fine in the bedroom and now this brand new piece of equipment can't reconnect to a single-user 5G guest network I just set up... hmmm.For s***s and giggles and remove the HDMI extender and plug the TV Stick directly into my TV.  Guess what?  It works now.It seems that somehow, using the HDMI extender inhibited the wifi reception so bad that no matter how close I was to my router (within 10ft) it wouldn't let the Fire TV Stick connect to the wifi network.A 5 minute setup ended up taking about 4 hours of random troubleshooting.  There's not much content in the way of help forums for this product yet, so I hope this review might help others in the future.  I'm still giving 3 stars because once it works, it works pretty well.  Small compact size and user friendly interface.That's my story and I'm \"Stick\"-ing to it.  Good luck and happy streaming!", "verified": true, "helpfulness": "6/6", "author": "Michael"}, {"rating": 4.0, "review": "Update after 9 months:I'm still impressed with what this little gizmo can do at a low price, but after using it very consistently for 9 months, we've noticed the Fire TV Stick's WiFi isn't as reliable as our Apple TV.  Especially with Netflix, we have a lot of times where it stops mid-size to load. Occasionally it drops the connection completely and I have to reboot the system. Our Apple TV never has that issue. So I took a star back for WiFi connectivity but overall I still recommend this.------------------------------------------------I'm so happy with the Fire TV stick!!  We have an Apple TV, Chromecast and this.  I hate the Chromecast and it's currently sitting in a drawer.  We use the Apple TV entirely for streaming (Netflix, Hulu, YouTube, Disney JR, and a few others) and I was hoping this would cover that job.  It definitely does for a fraction of the price. My only gripe is that they try (like the Chromecast ads) to make it appear like it doesn't have a power cable.", "verified": true, "helpfulness": "0/0", "author": "snowfire555"}, {"rating": 5.0, "review": "This is the very best  technology item I've purchased.  I received my Fire TV Stick just yesterday, popped it into my Samsung TV, and while I had a few moments of it not connecting correctly:  #1-I had to literally unplug my Samsung blue ray player because it seemed to prohibit me from accessing the Fire TV Stick. #2-I also disconnected it from the HDMI extender cable.In any case, it was so very much worth the minor glitch in my systems.  The remote control is super easy to use, and I was hugely impressed with the speed by which everything is accessed.  I am a Prime member, however I had to log in with my username  (it should have been automatic.) No big deal with Fire TV Stick - the scrolling with the remote is UBER fast and efficient (they've even included @gmail and @yahoo on the keyboard!)It's awesome and so very easy to use. My husband is absolutely useless (self-proclaimed) with technology, and after his protests at watching the Excellent introductory video with the  Fire TV Stick, he was totally in control of the system.  Ah yes, another remote control I won't have access to.  But it's really THAT easy.Included are lots of apps for TV, Movies, Music and Games.  We don't have small children, however I could easily see the value of getting the game controller (sold separately) and have the kids use Prime games, one stop shopping - it's fantastic really.I was smart and lucky enough to purchase this early at a discounted price, however I'd pay the full price for another one.  It's THAT good.", "verified": true, "helpfulness": "0/0", "author": "TE"}, {"rating": 5.0, "review": "Great works good for me.", "verified": true, "helpfulness": "0/0", "author": "Nerio  Arany Peï¿½a Amaya"}, {"rating": 5.0, "review": "It passed my expectations.The fact that it is android system and you can install android applications into it, makes it a plus.Very intuitive and just works. Now, if you are an Amazon Prime member, you have to have this stick.It will give you access to all of your benefits. I haven't turned on the cable TV since I have it installed.", "verified": true, "helpfulness": "0/0", "author": "Claudio S. De Souza \"scriptori\""}, {"rating": 5.0, "review": "Please note that I ordered 2 of these at the $19 discounted price. So obviously I can not have complaints, but for even $39, it would be worthwhile.People have to realize that this is a computer - it is obviously not a necessity but is a lot cheaper and better then most other solutions.As of the current updated firmware (12/11/2014), you are able to turn on ADB and install \"unknown\" source installs. I used this to install Kodi and FiredTV launcher. Kodi works just like other computer installs, so you can install your favorite addons and watch sports/TV from around the world (for free). FiredTV launcher is nicer then the normal home screen and makes everything less buggy.As it stands, if you install 3rd party apps, it does not show up under recent history and you have to go into \"all installed apps\" under settings; hence why I installed the other \"launcher.\" I would like to see amazon let people either a) design/sell themes for FireTV or b) let the users customize the home screen in some ways (being able to remove categories). As I do not use 95% of what Amazon wants you to use it for (their TV shows/apps/etc) but I would like to customize it for what I use.. but I can't.I wish this did not need to be plugged into the wall, but that is obviously not Amazon's fault .. as a computer kinda needs power to run. The remote is great to have. I know other people said it \"feels\" flimsy but I think it looks/feels what you would expect from the photo. It at least feels like it will last a few years until it would have issues.. but by then I am sure this will seem like junk by then anyway. Plus you can use other devices like your phone, so even if it breaks, you are not screwed.This DID work with a monitor that I have this is NOT MHL compatible. Great if you have monitors just lying around like me ;) (but monitors are cheap which could give you the ability to have several \"cheap\" TV's that could work at once).If you are trying to decide whether you should get something like this vs a full on HTPC, I would suggest to try this first and see. As this only uses 5w max and if you use a normal computer, that can run 200W+. If that computer is on 24/7 for a year - you could save $137 in electric alone (@ $0.08 p/kWh). If you need more storage (say for your ripped DVD collection), you are better off using a separate computer as a server so you can run Raid5/6 (or better yet ZFS Raidz1/2). Then you can deploy several of these Amazon Sticks around the house and have them connect to the \"server.\" Then you could get redundancy off this option more easily/cheaply - as I doubt many do this on their HTPC's. Plus you do not have a huge clunky/noisy computer right next to your TV as well.All-in-all you are buying a <$40 computer which includes the OS, remote, Wifi, a charger, micro-USB cord, and batteries! Things like this were selling for $200 just a few years ago for less specs. Obviously this will happen anyway due to Moore's Law, but this is truly not a bad item to even just \"play\" with.", "verified": true, "helpfulness": "2/2", "author": "Michael Howard"}, {"rating": 4.0, "review": "Very good purchase. performs wonderfully.  My only complaints are:1. that the remote is small. I duct taped it to a piece of wood so that the kids don't lose it.2. No HBOgo", "verified": true, "helpfulness": "0/0", "author": "michael McFadden"}, {"rating": 5.0, "review": "Working great so far. Quite a marvelous piece of technology", "verified": true, "helpfulness": "0/0", "author": "Logic for the Masses"}, {"rating": 5.0, "review": "The Fire Stick is great,easy to setup and lots of fun to access my Prime account and other great channels I enjoy. I can't wait to get the voice app to use on my smart phone.", "verified": true, "helpfulness": "0/0", "author": "Albert N."}]