[{"rating": 5.0, "review": "This is a great unit and works as advertised.", "verified": true, "helpfulness": "0/0", "author": "John C. T. Meyer"}, {"rating": 1.0, "review": "I'm a big Amazon user, since back when they only sold books.  I average 3-6 orders of random stuff per month, toilet paper, TVs and everything in between.  I've got 3 Kindles, and though I generally prefer using my iPad, they do see regular use.  As a general rule, I hate to return items and rarely leave negative reviews.  My point here is that a product has to be pretty lousy for me to go through the effort of sending it back and leaving a negative review.Fire TV Stick is that bad.Even at the early Prime offer of half-off, it (or they, I bought 2) weren't worth keeping.  I was hoping for something as fast and intuitive as the Chromecasts they were intended to replace, but with the added benefit access to the Amazon eco-system: Prime, Instant Video, Cloud Drive photos/videos.  After 2 days of use, here's what I discovered:Pros:1) East to hookup.2) Access to everything in the Amazon is dead simple (when it works).3) Affordable (especially the early Prime offer).Cons:1) No iOS app, so non-Android users are stuck using the remote (with no voice compatibility)2) Flaky Wi-Fi connection, constantly lost my home network and would need to be reset.3) YouTube app was unstable and even after pairing with my account, casting from other devices wouldn't work.  And it was noticeably laggy.4) Painful tutorial that can't be skipped and is pretty pointless since it tells you what Fire TV Stick does and how to hook it up AFTER YOU'VE ALREADY BOUGHT IT AND HOOKED IT UP.  And since I had to keep doing factory resets to find my wifi, I had to watch it over and over.I was sorry I even took the time to crawl behind my entertainment center to hook it up.  Other than missing Amazon content (and thanks for that, Jeff), Chromecast is a better product in every way.  Fast, stable, intuitive, with a slick app for your smartphone, regardless of OS.  I think Amazon probably knows that, which is why they won't directly compete and offer a Chromecast app for their content.  And that's too bad.", "verified": true, "helpfulness": "9/10", "author": "krikiter"}, {"rating": 5.0, "review": "Better than Chromecast", "verified": true, "helpfulness": "1/1", "author": "kenneth nguyen"}, {"rating": 5.0, "review": "Easy to set up and use...like it better than roku!", "verified": true, "helpfulness": "1/1", "author": "MOS"}, {"rating": 5.0, "review": "After having a Google Chromecast and being only moderately impressed by the device, I had my doubts as to whether the fire stick would wow me.Color me impressed.I had no idea something so simple could be as easy to use, and responsive as it is.The packaging is very nice, the interface is simple.  It comes pre-loaded with my amazon info so there was no log in woes.One thing it does that I couldn't seem to get my chrome cast to do is closed captions.  Very very impressed with that function.I love that I dont have to use my phone to work the device, and so does my wife, as it is not hard to learn and she says \"I will actually use this.\"If this is a sign of things to come with the ECHO device, I can't wait.", "verified": true, "helpfulness": "1/1", "author": "D. Johnston"}, {"rating": 4.0, "review": "Everything about the fire stick is perfect...except it's not. First, it can only mirror video from amazon fire devices. Also there is no HBO app for the fire stick -- big down side. There are other features/apps lacking. I won't go into detail because people want different things out of a streaming device. The apple TV is a lot better, but the price of the fire stick is good. So either plan on buying the fire stick first and and apple tv later or go ahead and get an apple tv now.", "verified": true, "helpfulness": "1/2", "author": "Kimberly Huey"}, {"rating": 5.0, "review": "This is a very great product! Simple to use and operate. I have attempted to use other products (cables, etc.,) using my phone to complete the same thing as this device and it has cost me more.There are 2 complaints that I have.1.) It's another cable that I have to hide because it requires you to either use the USB or an outlet to operate.2.) IOS compatible...not yet... C'mon Jeff Bezos! Hurry up...I recommend that you use the HDMI extenderOther than that, I really love this product!", "verified": true, "helpfulness": "2/2", "author": "y12srt \"y12srt\""}, {"rating": 1.0, "review": "Fired up the stick, loved the content layout. Loaded the Hulu app and fired up a show - btw, I am a subscriber. Show started with a commercial, oh joy! Commercial came in beautifully. Then the show started and I get this blue screen saying, HDCP unauthorised. content disabled (yes, I spelled unauthorised as the screen displayed). Audio came through fine. Got on chat with amazon's helpdesk while letting the show continue to play. Time for a commercial, video came up beautifully! Watched the commercial, then the show started with the blue screen again. I tried my amazon prime account to play something, same results.BTW - amazon chat was clueless. My issue was esculated to engineering. I think that means I might hear something in 6 months? IDK - very disappointing in amazon's new technology. This was to be a test to see if I wanted to go for the full Fire TV, thinking not now. We'll see if they EVER respond to my issue, but I'm not holding my breath.One other thing - google the error message - this is not a \"unique\" issue. Amazon should have done a better job at beta testing. Fail. Good thing I still have my Chromecast. ;-)2/27/2015: No feedback from Amazon's Tech Support. Zero. Nada.", "verified": true, "helpfulness": "33/38", "author": "Murph \"Not zucchini, fettuccini, or bulger wheat, but a big warm bun and a huge hunk of meat.\""}, {"rating": 2.0, "review": "Interface leaves a lot to be desired, I like the Roku interface much better. Netflix plays ok but Amazon prime has a need to buffer frequently as does Youtube . Buffering may be due to my ISP, but Amazon Prime movies do very little buffering with my Roku 3.", "verified": true, "helpfulness": "1/1", "author": "Kevin L. Pottorff \"retired\""}, {"rating": 3.0, "review": "It worked really well when I first set it up. I use it for Netflx, Prime Video and WatchEspn. Slowly after using it for about a couple of weeks it began to freeze up when use, but I would just unplug it from the tv and power and replugin. After then about another week it stopped connecting to the internet. Now it basically is unable to do anything.The worst about the Fire TV stick is the stupid video they force you to watch when setting up. This device is great because even stupid people should be able to use this device without watching a video teaching you how to use it.", "verified": true, "helpfulness": "0/0", "author": "nazman"}]