[{"rating": 4.0, "review": "It works great so far, EXCEPT for the fact that when you put it to \"sleep\" it literally takes forever to wake it up - almost to the point where I give up on watching Fire Tv completely.", "verified": true, "helpfulness": "0/0", "author": "Debra Doktor"}, {"rating": 5.0, "review": "The Amazon Fire Stick is awesome. It's easy to set up and it makes streaming, whether it's through Amazon Prime or Netflix so easy. I love the functionality of being able to go from one episode to the next seamlessly, as well as the capability of pausing and picking up where you left off. Hands-down, this was $39 well spent. It makes me want to eliminate cable all together.", "verified": true, "helpfulness": "0/0", "author": "Jennifer A. Krawczyk \"JAKrawczyk\""}, {"rating": 1.0, "review": "It constantly buffers during peck hours.", "verified": true, "helpfulness": "0/0", "author": "Sara Pierce"}, {"rating": 5.0, "review": "I had Amazon Prime for a few years to get the shipping benefit, and finally bought the stick.  I should have done it much sooner.  Installation was easy.  Extra points for shipping me a stick already linked to my account.  I just had to connect it to the WIFI and I was up an running.  Whoever designed the menus did a really good job.  (Verizon and Optimum should take notice).  Also, attempts at \"ads\" are far less intrusive than on normal cable.  If you get the stick, be sure to get the Pluto TV app as well.  It's free TV.  (I am now seriously tempted to cancel my triple-play and just pay for internet).", "verified": true, "helpfulness": "0/0", "author": "A"}, {"rating": 2.0, "review": "For adults that have prime, it's ok. You have some options for TV and movies that you wouldn't otherwise get for the price. HOWEVER, it doesn't even compare to netflix for kids shows and movies, and the ones it does have, you PAY 3.99 or more to have it for 24 hours! Same for some of the adult prime movies, nothing is free- You might as well rent a movie from your cable for the same price.", "verified": true, "helpfulness": "1/1", "author": "mallory markowicz"}, {"rating": 5.0, "review": "Great product, easy to install", "verified": true, "helpfulness": "0/0", "author": "Daniel Jackson"}, {"rating": 5.0, "review": "It is easy to use and immediately gave us access to Netflix and numerous other similar online services.", "verified": true, "helpfulness": "0/0", "author": "Philip Stine \"Discriminating Reader\""}, {"rating": 5.0, "review": "One of the best item I have every gotten for my house.", "verified": false, "helpfulness": "0/0", "author": "carlos ortiz"}, {"rating": 4.0, "review": "Happy with this purchase. User friendly with a clean interface.", "verified": true, "helpfulness": "0/0", "author": "Daniel Rojas"}, {"rating": 5.0, "review": "as long as you have a good internet connection this product is great and easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]