[{"rating": 5.0, "review": "Love the fire Stick. It has so many options and very easy to use. I would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "stacy"}, {"rating": 3.0, "review": "I bought this when it was on sale for $19, and got it to use in my bedroom to stream mainly plex and some watchespn.  the interface is great, but it stutters and buffers a ton (it will stop playback for about 15 seconds every couple of minutes) when streaming plex over a local network.  I will go back to my chromecast, 0 buffering issues with it.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "I love it💓💖💓💖💓💜😆", "verified": true, "helpfulness": "0/0", "author": "Shelbylyn trimelle"}, {"rating": 4.0, "review": "Great device, mostly if you have Amazon Prime. I wish apps such as Netflix and others could be located on the main screen.", "verified": true, "helpfulness": "0/0", "author": "Santos Dumont \"14-Bis\""}, {"rating": 3.0, "review": "Liked the remote. Too much paid content.", "verified": true, "helpfulness": "0/0", "author": "Daniel Bonney"}, {"rating": 3.0, "review": "I have problems with my Fire TV Stick not always getting a signal. But when it does, I enjoy the movies!!! Great option to cut the price of cable...", "verified": true, "helpfulness": "0/0", "author": "pokey"}, {"rating": 1.0, "review": "God!!! the worst purchase ever...I have not been able to connect to my wireless network, finds my router but doesn't establish a connection even though it's within 15ft of it, been unable to use it.", "verified": true, "helpfulness": "2/3", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This is an amazing product. It is like a stick super computer. Not much buffering, jumping from app to app or program to program is very fluid. Super easy to install and user friendly!", "verified": true, "helpfulness": "0/0", "author": "Planet Adobo"}, {"rating": 5.0, "review": "So easy to use! Works like a charm, and integrates Netflix seamlessly.", "verified": true, "helpfulness": "0/0", "author": "taptap"}, {"rating": 5.0, "review": "Great product, a must have :)", "verified": true, "helpfulness": "0/0", "author": "Charly Chakar"}]