[{"rating": 5.0, "review": "So far so good - extremely easy set up. I'm a prime member and now I can view everything on my Kindle fire. Definitely recommend", "verified": true, "helpfulness": "0/0", "author": "Christina Falls"}, {"rating": 4.0, "review": "I am very happy with the performance of my Fire TV  Stick. However, it would have been helpful to have directions on HOW to connect to my network. I had to call my daughter to find out that I had to download an app on my phone or tablet. I was not impressed with that lack of information. No one likes to feel stupid, and that's how I felt with the lack of information.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I already have a Chromecast and a Blu Ray player with wifi and streaming capabilities. Unfortunately, I can't stream Prime movies on either -- so I bought the Fire TV Stick. Prime streaming is the only advantage this has over Chromecast. I just like the Chromecast set-up better. It's a personal preference, I know, but I think it's simpler and more intuitive. Also, unlike Chromecast, the Fire TV Stick has to be plugged directly into an outlet. I tried ignoring the directions and plugging it into the USB port on my TV instead--but it doesn't work that way. The USB port didn't give it enough power to stream video without repeatedly pausing to buffer ... over and over again. So I gave in and followed the directions and set it up the right way. The outlet-requirement might not be an issue for some, but the included cord didn't stretch far enough to reach my outlet without some (thankfully minor) rearranging. I used the Fire TV Stick for a few days and then switched back to Chromecast. I'll keep the Fire TV Stick as a back-up and use it if I really want to stream Prime on the TV...but I'm sticking with Chromecast for everything else.", "verified": true, "helpfulness": "1/1", "author": "megatsea"}, {"rating": 5.0, "review": "I am an avowed apple lover since college, almost 30 years ago, but this device is far superior to apple tv for 1/4 the price.  Videos load MUCH quicker, quality is fine, and the prime library is amazing.", "verified": true, "helpfulness": "0/0", "author": "John P Flanagan"}, {"rating": 5.0, "review": "Great device. No complaints at all, although I was waiting a very long time for the delivery. Easy to install, simple to operate and works really well- I can stream any TV services from my wifi (or any WiFi) into my TV (or any TV). Using Plex as my TV storage /server. Grab an over the air signal for local channels then", "verified": true, "helpfulness": "0/0", "author": "njview"}, {"rating": 3.0, "review": "I was very pleased thank you. going to oder one more please contact me.", "verified": true, "helpfulness": "0/0", "author": "donald thompson"}, {"rating": 5.0, "review": "I need to get another one of these. I think I can get rid of Comcast Cable with this and internet access.", "verified": true, "helpfulness": "1/1", "author": "Dirk Derkle \"DakineAthon\""}, {"rating": 5.0, "review": "Does everything you could possibly want out of a streaming device and the interface is simple and very nicely designed.", "verified": true, "helpfulness": "0/0", "author": "Griffin Payne"}, {"rating": 1.0, "review": "lt is not for stereo surround sound only for tv return and now have amazon  fire TV", "verified": true, "helpfulness": "0/0", "author": "William M Saunders"}, {"rating": 5.0, "review": "So far so good?......", "verified": true, "helpfulness": "0/0", "author": "Anthony Califano"}]