[{"rating": 5.0, "review": "Met my expectations", "verified": true, "helpfulness": "0/0", "author": "Fatima"}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Michael V."}, {"rating": 5.0, "review": "Excellent---remote makes it easy to use  far better than using the iphone controller that others need", "verified": true, "helpfulness": "0/0", "author": "Ralph Mudge"}, {"rating": 2.0, "review": "These are great for the first couple of months, but after that it has way too many glitches.", "verified": true, "helpfulness": "0/0", "author": "Janette Potter"}, {"rating": 4.0, "review": "Alone the firestick has some nice features, sideload additional applications and the thing is dynamite as a \"cut the cord\" device. For the cost this device compares to higher end android devices on the market.The design is spectacular. Straight forward for beginners and experts alike, plugged straight into the HDMI port on a tv or monitor, along with WiFi access, have at it.There are many ways to add more features to the stick, well done.", "verified": true, "helpfulness": "0/0", "author": "J. Danzig"}, {"rating": 3.0, "review": "just starter out with fire TV stick still searching for best bang for the buck and local channels", "verified": true, "helpfulness": "0/0", "author": "gerald b hosley jr"}, {"rating": 4.0, "review": "Easy to set up - works great.  The only negative is how the home screen is designed.  A little confusing.  But otherwise, a great product for the price!", "verified": true, "helpfulness": "0/0", "author": "Miriam Overton"}, {"rating": 1.0, "review": "It didn't work", "verified": true, "helpfulness": "0/0", "author": "jerry mcdonald"}, {"rating": 1.0, "review": "I mainly bought this thinking it would work as a Miracast device to let me play Spotify music on my tv. It barely works as that, and it requires you to do some manual setup each time you connect.As for the rest of the functionality, the UI reminds me of something I would expect from a children's toy given out at McDonald's.The fact that I am even bothering to write this should be taken as a sign of how bad this device is, since I rarely write these reviews.", "verified": true, "helpfulness": "0/1", "author": "Chris Bilson"}, {"rating": 2.0, "review": "Sad it doesn't support internet browser", "verified": true, "helpfulness": "0/1", "author": "SABRINA"}]