[{"rating": 5.0, "review": "Exelente manera para ver television !!!Exellent way to watch tv at home !!!", "verified": true, "helpfulness": "0/0", "author": "CHRISTIAN"}, {"rating": 5.0, "review": "Bought it. Plugged it in. Works like a charm. So far no issues like the ones I read. Really slick device. Amazon continues to amaze me.", "verified": true, "helpfulness": "0/0", "author": "FLChic"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Keith Jones"}, {"rating": 5.0, "review": "Perfect!  I love this Fire TV Stick", "verified": true, "helpfulness": "0/0", "author": "Sundance"}, {"rating": 4.0, "review": "I've tried just about everyone out there, and they all have their limitations.  Overall I found the fire tv stick the best overall choice.  This is device had the best mirroring options, because it is using the more open architecture technology, making it PC compatible.  In general though, There was nothing special about any of them.  If you have built in streaming on your TV, this device probably isn't necessary, although it will give you a few more options over just about anything else.  And I seriously have tried them all.  Chromecast I returned.  Apple TV I returned.  Microsoft wireless display adapter I returned.  The Microsoft adapter worked best with mirroring windows.  Chromecast I found pretty useless because it was so locked into the chrome browser, and it just way too underdeveloped.  It felt more like an experiment.  Apple TV was way to heavily MAC, apps were very limited, and I found the mirroring (airplay) to be somewhat unreliable.  The technology for all of it just isn't quite there.  The Fire TV stick seemed to be the most complete, offering mirroring on both Mac and PC.  With Mac mirroring, you needed to buy a relatively inexpensive app.  Windows mirroring worked out of the box.  In general, none of them seemed much better than my playstation, or much better than the built in streaming capabilities of a smart TV.  I guess with the smaller sticks, like chromcast and Fire TV stick, you could easily travel with them.  They should plug into a hotel tv or rental property tv if you wanted to take your streaming with you.  The microsoft adapter would be a must have for presentations and business needs.  The Apple TV is a total waste of money.", "verified": true, "helpfulness": "1/1", "author": "andreasjva"}, {"rating": 5.0, "review": "Better than cable!", "verified": true, "helpfulness": "0/0", "author": "Dori Pacheco"}, {"rating": 4.0, "review": "easy to use", "verified": true, "helpfulness": "0/0", "author": "ed nevins"}, {"rating": 5.0, "review": "Great useful tool that is very simple to install to watch numerous TV shows!", "verified": true, "helpfulness": "0/0", "author": "Timothy Renno Sr."}, {"rating": 4.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "Hibaq_21"}, {"rating": 2.0, "review": "Driving turnpikes without GPS or map.  Not easy to find something I want to watch. And every time, $, $, $,  Paying tollsBarely works for those paid $99 amazon prime", "verified": true, "helpfulness": "0/0", "author": "Alex"}]