[{"rating": 5.0, "review": "plug in play was easy downloaded the app for the phone Android and it works as advertised very good product I recommend it", "verified": true, "helpfulness": "0/0", "author": "r garcia"}, {"rating": 1.0, "review": "It wasn't what I expected!! It keeps freezing up.", "verified": true, "helpfulness": "1/1", "author": "Deadra Shelton"}, {"rating": 5.0, "review": "The Fire Stick has so much available content. I would give them out as Christmas gifts, but they won't be back in stock until January.", "verified": true, "helpfulness": "0/0", "author": "Footdoc"}, {"rating": 1.0, "review": "I am totally disappointed in Amazon customer service when it comes to this device.  My stick keeps giving me \"can't connect\" when entering my Wi-Fi password, and yes, I know, it's case sensitive and yes, I know I input it correctly.  I spent an enormous amount of time with a tech who concluded the stick was defective and sent another.  Same problem with that stick.  This time, customer service bounces me back and forth between countries, with each level of assistance more clueless than the one before it.  I can see from the questions posted that I am not the only one with this problem.  I guess I will just return these pieces of garbage and get a second Roku box- never had any problems with Roku and it is  actually much cheaper if you factor in the hours of time I have wasted troubleshooting the firestick.", "verified": true, "helpfulness": "5/6", "author": "Lidgemeister"}, {"rating": 5.0, "review": "Works great...good price.", "verified": true, "helpfulness": "0/0", "author": "Pamela Zyski"}, {"rating": 5.0, "review": "Easy to set up and use. Small and compact. Now I can watch Amazon Prime movies and Netflix on my upstairs TV. Love it!", "verified": true, "helpfulness": "0/0", "author": "LicheeNut"}, {"rating": 5.0, "review": "This was a great purchase in my mind! I can cast straight from note 4, or just use one of the many apps on the Amazon app store. I went from a chromecast to the Fire stick, and I love it", "verified": true, "helpfulness": "0/0", "author": "Dylan Bushong"}, {"rating": 4.0, "review": "It was a gift. I found it very easy to install and use", "verified": true, "helpfulness": "0/0", "author": "sandra harvey"}, {"rating": 4.0, "review": "An absolute must if you have Amazon Prime. Simple interface, easy to search, lots of power in a little stick. Once it gets HBO GO, it'll be perfect.", "verified": true, "helpfulness": "0/0", "author": "Daniel Stefano"}, {"rating": 5.0, "review": "Love it! Love it! Love it! Why can't Apple do the same thing with the AppleTV product.  Amazon, keep up the amazing work. Kudos!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Johnny Bridge"}]