[{"rating": 5.0, "review": "Magic stick", "verified": true, "helpfulness": "0/0", "author": "dennis camacho"}, {"rating": 5.0, "review": "Easy to install and am loving all the things we can do with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Mr Bach\""}, {"rating": 4.0, "review": "Great product. Wifi strength somewhat annoying but love features.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Can't seem to get the same content on the youtube ap on the fire stick as on the computer. Maybe me, I'll go 5 stars if I could get that corrected.", "verified": true, "helpfulness": "0/1", "author": "Eric Hoffman"}, {"rating": 4.0, "review": "Good product !!", "verified": true, "helpfulness": "0/0", "author": "Vipul Patel"}, {"rating": 5.0, "review": "Love this thing!!!", "verified": true, "helpfulness": "0/0", "author": "matthew jacoby"}, {"rating": 5.0, "review": "Wonderful!  Absolutely loved it!!", "verified": true, "helpfulness": "0/0", "author": "Cathy M. Rose \"Nanny\""}, {"rating": 2.0, "review": "The remote is completely useless.  It doesn't respond at first and then suddenly it moves several spaces instead of just one.  It's completely wonky.  This is on my bedroom TV so I'm only 10 feet away.  I tried their troubleshooting suggestions but nothing has improved.  Other than that, I have used it for Netflix and that has worked well.  I downloaded the app for the remote on my galaxy pad and I've been able to use that so far.  It took a second to figure out because it didn't have arrows for the directional wheel.  There was just a blank box which I wasn't sure if something didn't load at first.  Then after playing with it I realized that if you dragged your finger the direction would show up.  Not exactly the best design if you ask me.  Really considering returning it but I'll try a few more channels to see if I can live with it.  Amazon should really take another look at this one.  Roku has a big leg up on them so far.", "verified": true, "helpfulness": "0/1", "author": "ella"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Tabatha Shields"}, {"rating": 5.0, "review": "This has been a great device. I'm stuck in the hospital and my husband brought it to me it works great on their tv and I can watch all my shows while I'm stuck in here. I love it!", "verified": true, "helpfulness": "0/0", "author": "Karen Disney"}]