[{"rating": 5.0, "review": "So far so good. I love Amazon Prime Instant Movies and that this can support some games too. This is a must have for Amazon Prime members as it allows us to fully take advantage of the products offered in the Prime package. I got mine on the special $19 pricing back in Oct-Nov. Still, at full price, it's a good deal.", "verified": true, "helpfulness": "1/1", "author": "J. D. Martin"}, {"rating": 3.0, "review": "Needs chromecast added with it, then it would be great.", "verified": true, "helpfulness": "0/0", "author": "christopher s childress"}, {"rating": 4.0, "review": "Great product for the price.", "verified": true, "helpfulness": "0/0", "author": "Doug Fyfe"}, {"rating": 5.0, "review": "This is the best! Set up was so easy. I hate when my boyfriend goes out of town and I have a new gadget. but this was so easy! put in your WEP password and it recognizes your Prime Account. Done!I love that it remembers all my shows.  And I am hooked on a new show ORPHAN BLACK! all because of Fire!I wish they had other movies, but if i want to see a particular movie -- i switch over to cable and find it free there. Love the options!", "verified": true, "helpfulness": "1/1", "author": "Cat"}, {"rating": 4.0, "review": "A while back, the Fire TV stick had a deal for Prime members to get this at a good discount. I bought two.  I already own a Fire TV and my family has been using it daily since we got it.  Why get two more?  One as a gift for my mom, who has bad TV reception where she lives.  The second one because we were driving up to Portland over Christmas and I wanted something to use at the hotels on the way up and back, and also where we were staying up there (consistency with favored shows helps amuse our almost 3 year old).  Plus, I just liked the Fire TV a lot and wanted to show it off.First the good.  Very easy to use. Compares very favorably with the standard Fire TV.  No difference really except that you can't directly connect the stick to the network.  Can play games and do everything else the same.  The stick comes with a standard remote, and I went ahead and purchased the voice remote to give to my mom.  She loves it.  She's watching all sorts of shows and documentaries and old movies.  I'm actually very surprised how much she loves it.My frustration happened at the hotels.  We couldn't use it at all. There's no browser or other means to connect to a network that requires a browser type login. Given how this really is the \"travel\" version of the Fire TV, it's really frustrating that this isn't an available feature yet.  It says \"coming soon\" but that wasn't soon enough for us.I also wish there was a travel bag to bundle it together better than using the larger box.", "verified": true, "helpfulness": "0/0", "author": "Patrick O \"A lover of truth, beauty, and occasionally silliness\""}, {"rating": 5.0, "review": "This works very well in guest bedroom. Easy to learn and setup. A person in my household who is techie unsavy and who shall remain nameless set this up all by herself.", "verified": true, "helpfulness": "1/1", "author": "rudiclem"}, {"rating": 5.0, "review": "Love this!!  I love that I can get Netflix, order amazon movies and Especially ESPN just wish I could get SEC network and some of the others on it as well.", "verified": true, "helpfulness": "1/1", "author": "Stephanie Cornell"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "1/1", "author": "ULYSSES SIMMONS"}, {"rating": 5.0, "review": "Love, love, love this little device. While it may be smaller it has all of the applications plus some that I didn't expect. Such as Disney and ESPN. I have this and the Chromecast and the Chromecast has not been used and I actually don't even know where I put it. The Fire Stick is much more convenient with the remote than the chrome cast was for me. At the moment I have it plugged into my daughter's not so smart tv in her room. I use it on some nights when they behave and it takes only a couple minutes to turn on and cycle through the movies/shows to find something that we are both interested in watching/learning. The operating system is user friendly and has a simple layout so you can find what you need. I haven't played any games on it since it is in my daughters room. I like it so much I have considered getting one to plug into the back of my Xbox One even though it has all of those applications already. But anyways I would highly recommend this if you are looking for something that can access media/smart tv like applications.", "verified": true, "helpfulness": "1/1", "author": "Brandon Zamora"}, {"rating": 3.0, "review": "Thought there should have been more explanation of its capabilities.", "verified": true, "helpfulness": "0/0", "author": "Jay Fisher"}]