[{"rating": 5.0, "review": "Nice five stars, fire stick is awesome gray picture quality on 720p 1080 p", "verified": true, "helpfulness": "0/0", "author": "Carlos E."}, {"rating": 5.0, "review": "I enjoy it alot", "verified": true, "helpfulness": "0/0", "author": "Anna Zurita"}, {"rating": 4.0, "review": "We love the Fire Stick. We were able to cancel all of the extras on our cable package and get everything we need with this. I was skeptical at first bc aside from the free prime movies we still needed to have a subscription to Netflix. Well, that's not needed to use the fire stick but it gives you more options. And it makes Netflix better by streaming through the tv. Only gave a 4 star review bc the set up was confusing. There was no where to put in your password through the remote with the tv in order to connect to our prime account. Even though it was already supposed to be linked. I had to call customer service to get it figured out.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 4.0, "review": "Great purchase if you are a prime member", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome little toy...have one for all my kids and their TVs and even bought a few for my brothers and sisters.Allows easy access to apps like Netflix and HBO Go. Everyone uses it and loves it.", "verified": true, "helpfulness": "0/0", "author": "mark plunkett"}, {"rating": 4.0, "review": "I like  it very much", "verified": true, "helpfulness": "0/0", "author": "David Luera"}, {"rating": 3.0, "review": "Just wish there were more free movies and TV shows that are airing now.", "verified": true, "helpfulness": "0/0", "author": "Kelli Shersty"}, {"rating": 4.0, "review": "Did not work on my 9 year old Samsung DLP so I had to plug it in to another TV and set it up and adjust the resolution to 720p and then put it back into my Samsung. So now it works. Don't rely on Amazon for any customer support.", "verified": true, "helpfulness": "0/0", "author": "Jermaine"}, {"rating": 5.0, "review": "I love it. It's great! Work wonderfully on my HD projecto. A man cave bonus! Movies, TV, Music,App games and more", "verified": true, "helpfulness": "0/0", "author": "eric rivera"}, {"rating": 5.0, "review": "Love this lil gadget...", "verified": true, "helpfulness": "0/0", "author": "Mike daly"}]