[{"rating": 5.0, "review": "Easy to install works great.", "verified": true, "helpfulness": "0/0", "author": "ssenn"}, {"rating": 5.0, "review": "It really is less hassle for my Netflix the buffering time is cut way down and I love that. Just one click no waiting!!", "verified": true, "helpfulness": "0/0", "author": "Traci Wilson"}, {"rating": 5.0, "review": "I love it. Arrrived in time for House Of Cards", "verified": true, "helpfulness": "0/0", "author": "happy with purchase"}, {"rating": 5.0, "review": "Love the fire stick and glad there is a free trial to  Amazon pride even though you do not have to buy anything you do not like just to use just the fire stickGreat job amazon now I dont have to worry about using my tablet to use netflix or Hulu", "verified": true, "helpfulness": "0/0", "author": "Janis Culbertson"}, {"rating": 5.0, "review": "It's awesome! Smart TV was dumb - wouldn't load, had a hard time connecting to wifi. The Fire TV stick is going to replace our satellite TV as soon as our contract is up.", "verified": true, "helpfulness": "0/0", "author": "Mashleyfox"}, {"rating": 4.0, "review": "The Fire Stick itself is good, however, it states it is easy set up. It is not. I spent the portion of 3 hours on the phone with Amazon, Netflix (which was why I initially purchased it) and Comcast.  Amazon's help desk is outsourced, so there language barrier and the first guy didn't reset anything correctly and told me it was an Netflix issue.  Netflix double checked everything on their end and sent me back to Amazon....This all started this past Friday evening.  Last night (Sunday) was the first time I was able to use it.", "verified": true, "helpfulness": "0/0", "author": "Debora L Perillo"}, {"rating": 4.0, "review": "I find it to be very convenient and love that I can add apps from my Amazon.  I am disappointed that it tends to lag at times like it is buffering and that sucks when you are in to a show!", "verified": true, "helpfulness": "0/0", "author": "Roxanne Humphrey"}, {"rating": 5.0, "review": "Great product so far", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 4.0, "review": "It's a great tool for people who don't have smart tvs", "verified": true, "helpfulness": "0/0", "author": "Robert Hill II"}, {"rating": 5.0, "review": "Loving this - works well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"KJ\""}]