[{"rating": 5.0, "review": "great price.", "verified": true, "helpfulness": "0/0", "author": "Robert jares"}, {"rating": 5.0, "review": "Very easy to use, did exactly what I needed it to! Great for Netflix and other streaming.", "verified": true, "helpfulness": "0/0", "author": "Amanda Helland"}, {"rating": 5.0, "review": "This exceeded my expectations. It works great and is easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Kayla Boggs"}, {"rating": 4.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Jerzie Doll"}, {"rating": 2.0, "review": "I purchased the fire stick on pre order in October of 2014. For the first couple months I was pleased with my purchase. And the price was amazing, half of what it is now.Unfortunately the device had a problem of disconnecting from wifi and not being able to reconnect. The only way to fix the issue is to disconnect the power cable. This is very inconvenient as it happens on a daily basis after about an hour of watching.Other than this it's a good device but my device was defected and I am sure I waited to long for a replacement.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "I love and it works beautiful easy to use logs in right now.", "verified": true, "helpfulness": "0/0", "author": "Lyle Allen"}, {"rating": 1.0, "review": "We find this to be almost unusable with apps such as HBO go and Netflix. The apps freeze. The picture stutters. The wifi connection is deemed inadequate. We also have a Chromecast and an Apple TV and they work flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 4.0, "review": "Great way to see movies on Prime.", "verified": true, "helpfulness": "0/0", "author": "Grant R"}, {"rating": 5.0, "review": "I have been reviewing the need to ditch cable. It has not been an easy task. Sling TV was offering a free Amazon TV Stick and I missed that offer. I decided to give the fire stick a try anyway because I have Amazon prime already. The fire stick is for my Hitachi TV that is not a smart TV. I am very satisfied with it so far.I resisted the Fire Stick because I have a smart blue ray player. I quickly discovered that the fire Stick is way faster than the blue ray. I did run some test. My blue works very well in my living room. But it does not stream well in my bedroom where my non smart TV is.My only recommendation would be to include additional software like the Samsung link. This is the one benefit that I love about all my smart Samsung devices that I do not have with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Jimmy Godard"}, {"rating": 5.0, "review": "This is a swell product. Plus, it is a no brainer to hook up. I'm a 69 year old woman who isn't electronically savvy. Just find the HDMI port on your tv and plug it in. Follow the simple directions on the screen and you're all set. For a measly 39 bucks, you get huge value for that amount. Don't hesitate to get it. If you have Amazon Prime, this is a MUST BUY. It really is worth the money any way you look at it. Don't have Amazon Prime? At 99 dollars a year, it is a steal if you can't get out to shop any more regardless of reason. The two day shipping is an awesome feature and has 'saved' our necks more than once because of needing a gift for a forgotten occasion.", "verified": true, "helpfulness": "0/0", "author": "fanfic  nutcase \"xenite\""}]