[{"rating": 2.0, "review": "Not impressed. Keeps dropping from wifi and won't reconnect till I unplug and wait", "verified": true, "helpfulness": "1/1", "author": "MW"}, {"rating": 5.0, "review": "Now my basic TV is no longer basic!", "verified": true, "helpfulness": "0/0", "author": "David R Shields"}, {"rating": 4.0, "review": "Why if I am paying to watch this do I still have to watch commercials?", "verified": true, "helpfulness": "0/0", "author": "Lorena Paff"}, {"rating": 5.0, "review": "Small -quick-easy to use and so much better than Roku", "verified": true, "helpfulness": "0/0", "author": "manfred nadke"}, {"rating": 1.0, "review": "Probably every movie ever made can be found on the fire stick, but getting it for free is a different story. I find that basically only a handful are completely free providing you have prime membership. This is very disappointing and the free titles consistently change so one day something will be free the next they want $15 for it. It was a nice idea, but it is clearly just a way for Amazon to make more money. The other thing that really upsets me is that every time I try to watch a movie I get green lines across my screen. I have called Amazon and try to resolve this three times and I am basically giving up now because they cannot fix it. They do not want to send me a new fire stick under any circumstances and this is very disappointing. So if you don't mind shelling out hundreds of hundreds of dollars you should definitely get a fire stick. Again it was a good idea but it is not for me.", "verified": true, "helpfulness": "1/2", "author": "Marshall Dworkis \"Broadway lover\""}, {"rating": 5.0, "review": "Better...impossible!", "verified": true, "helpfulness": "0/0", "author": "Edwin Agramonte"}, {"rating": 5.0, "review": "This is Amazing. Easy to set up and use and has a ton of apps. I would say it's like a Roku, Chromecast or Apple TV but better and cheaper! Get this! You will not be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Ryan Dombroski"}, {"rating": 5.0, "review": "Works better that I expected, fast start up and clear picture.", "verified": true, "helpfulness": "0/0", "author": "Russell Jackson"}, {"rating": 1.0, "review": "LAsted about 2 weeks and Broke ...", "verified": true, "helpfulness": "0/0", "author": "D. Shreve"}, {"rating": 5.0, "review": "For what I want this is a five star indeed.", "verified": true, "helpfulness": "0/0", "author": "otis ray bonds"}]