[{"rating": 5.0, "review": "I am completely satisfied with the Amazon Fire TV Stick.  It was easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "Nikki N. \"mystic1\""}, {"rating": 4.0, "review": "love the instant access and variety of entertainment", "verified": true, "helpfulness": "0/0", "author": "John P. Downes"}, {"rating": 2.0, "review": "Works great *when* it's right next to my wireless router.  All of my other devices work just fine all over the house.  I keep getting connection issues with the Fire Stick, however.  They even sent me a second one, still doesn't work.", "verified": true, "helpfulness": "0/0", "author": "DanaB"}, {"rating": 5.0, "review": "I love it!  I  don't know  how  I lived  without  this  for  long", "verified": true, "helpfulness": "0/0", "author": "Tiff \"Tiff\""}, {"rating": 4.0, "review": "I like it very much but I wish that the remote control had a volume button.  I have to use my remote TV to increase or decrease the sound, thus using two remotes simultaneously and this becomes too cumbersome .  Can someone tell me if there is a way to use the remote to control the volume?", "verified": true, "helpfulness": "0/0", "author": "LJA"}, {"rating": 1.0, "review": "was working fine first 3-4 weeks, then stopped working.  can not get it to hook into internet connection.  the internet is working just fine.  tried to unplug and reboot, can not get it to work at all. waste of money.  paid for the prime membership, wish I hadn't now", "verified": true, "helpfulness": "0/1", "author": "drapple2"}, {"rating": 2.0, "review": "This screwed up our Wi-Fi- Disconnected Fire Stick -all is good again. Will try when we get a newer Modem.", "verified": true, "helpfulness": "0/0", "author": "M. MJL"}, {"rating": 5.0, "review": "Love my fire stick, so easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Patsy Sadler"}, {"rating": 5.0, "review": "Easy to install really enjoying movies and TV  shows.", "verified": true, "helpfulness": "0/0", "author": "Dorinda Jelle"}, {"rating": 5.0, "review": "Very happy with Amazon fire stick.  I don't have cable or satellite TV.  I do have Amazon Prime.  With the fire stick and Amazon Prime  there is so much to watch.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"QC Denise\""}]