[{"rating": 3.0, "review": "Glad I picked up the  stick. Easy to install, setup and  use.", "verified": true, "helpfulness": "0/0", "author": "Chiefdnd"}, {"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Matt M."}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "John F. deVeaux"}, {"rating": 4.0, "review": "I bought this to use HBO go, and it won't let me because I have comcast. Shame.", "verified": true, "helpfulness": "0/0", "author": "paige"}, {"rating": 4.0, "review": "It's great!  It would be better with more free content. It seems like all the movies cost $4 each.", "verified": true, "helpfulness": "0/0", "author": "Brenda Case"}, {"rating": 4.0, "review": "Fire TV Stick works as advertised. I'm able to watch Amazon Prime and You Tube content on my HD TV. Using the remote to search for content is a little slower than normal internet search. I also had a small issue when plugging in the Stick to a power strip. TV could detect the Stick but I was not getting the menu / content to load. There problem was the Stick was not getting power despite being plugged in. Error message displayed on TV did not pinpoint the problem as lack of charge. I identified the issue by unplugging / reconnecting the device and discovered I had to wiggle the plug in the electric socket. Power light indicator on stick might be helpful.", "verified": true, "helpfulness": "0/0", "author": "John K. Waskiewicz"}, {"rating": 4.0, "review": "I like the way it works but am frustrated with some apps they let you watch 2 seasons then want you to pay for the 3rd", "verified": true, "helpfulness": "0/0", "author": "Terri Walker"}, {"rating": 5.0, "review": "Makes my life so much easier", "verified": true, "helpfulness": "0/0", "author": "Ju. Ju."}, {"rating": 5.0, "review": "Easy setup, and works great!", "verified": true, "helpfulness": "0/0", "author": "S. McDyer"}, {"rating": 5.0, "review": "I've only used my Fire Stick for a very short while, but so far I am beyond thrilled! Easy to set up and easy to use. Woohoo!", "verified": true, "helpfulness": "0/0", "author": "Amber M \"Blondie82479\""}]