[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "will frost"}, {"rating": 4.0, "review": "Great product, but the interface is a bit hard to use. My amazon tv seems to give me many more options of sorting shows by channel.", "verified": true, "helpfulness": "1/1", "author": "KG"}, {"rating": 4.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/2", "author": "Rodney woods"}, {"rating": 1.0, "review": "This is a waste of money and false advertising.Things that don't work:-Miracast-Netflix-Black Level AdjustmentSo Miracast was advertised as supported at launch. I got a bunch of these and the only devices they work with is Android ones. Doesn't work with Windows, WiDi, BlackBerry, or Windows Phone. So it isn't Miracast compliant.Also, Netflix CONSTANTLY has issues with playback. Often drops to the lowest resolution and doesn't want to go back to HD. A bigger issue is it often fails to buffer past exactly 25%. This requires multiple app closures and power cycles to fix. Completely ridiculous and a known issue with only the Fire TV Stick. Doesn't happen on any other device I own.Another problem is you cannot adjust the HDMI Black Level on the Stick. You must change it on the TV, which is a pain if you an A/V Receiver.Remote situation is bad since its RF so you can't use a Harmony.Also burns through TONS of data (800MB per update) constantly updating itself (no user interaction needed).Overall this was a good idea but poorly implemented.", "verified": true, "helpfulness": "4/8", "author": "Peter"}, {"rating": 5.0, "review": "Picture quality is superior to the competitors.  Love the form factor.  Have prime, and the integration is also superior to alternative options.  I personally have no use for the added app store, however it's a nice touch.  Honestly, this is an unbeatable deal with prime integration.  The default screen saver, while useful, is seriously nice eye candy, so nice.  This is a finely tuned device, and has a very quality oriented feel.  One additional item of note, while it doesn't have prime digital music downloading integrated, it appears it may have the ability to purchase and download new music in the future, which would be a nice feature.  For the price, it could be my expectations were not as high as they could have been, however, I am quite pleased with this device.", "verified": true, "helpfulness": "1/1", "author": "Gregory A"}, {"rating": 5.0, "review": "fast great picture . fantastic product", "verified": true, "helpfulness": "1/1", "author": "wendy"}, {"rating": 4.0, "review": "I have had and used my Fire Stick now for about 3 days. I have only used Netflix, which works well and has a nice interface, Prime, of course looks and works great, and the main reason I bought it was for Plex. I am very happy with the Plex app on the Fire Stick.I have downloaded other apps to try, but do not see MLB. I hope they get a usable MLB as I know the apps have problems on other devices. Overall the Fire Stick is at this time best priced, streaming stick for your money. I removed 3 chromecasts from my house and installed Fire Sticks.", "verified": true, "helpfulness": "2/2", "author": "Chris Allison"}, {"rating": 5.0, "review": "The fire stick works great. There is no pause for streaming.  I love it.", "verified": true, "helpfulness": "0/1", "author": "Misty A Forsythe"}, {"rating": 3.0, "review": "still having issues with connectivity and staying connected when it decides to connect with the internet.", "verified": true, "helpfulness": "1/1", "author": "rmoore"}, {"rating": 5.0, "review": "super easy to install and use.  Apps for phone and iPad are easy to use too.  Kids love the games", "verified": true, "helpfulness": "1/1", "author": "Kristin Herr"}]