[{"rating": 4.0, "review": "Bought 2, the first works great but the second one had some flaws so I had to return. But we are enjoying the fire tv stick that works.😃", "verified": true, "helpfulness": "0/0", "author": "Cjrak"}, {"rating": 4.0, "review": "I really expected this to be just a little novelty that I would hardly use, but I am shocked to say, I think it has become my primary \"TV\" watching tool.I have my computer hooked up to my TV, so that has been my default viewing machine for about two years now. But, this little device manages to deliver a better user experience and even a better image that my computer does...I love it, and I really think you will too.The downside:1. Navigating is a little slow. The menus just aren't quite as snappy is I would have expected, but really, that is a minor issue.2. You CANNOT use it at most hotels. Because hotels usually require you to verify terms and conditions via a web browser (which the Fire Stick does NOT have), the Fire Stick basically becomes unusable. Honestly, if they could fix that issue, I'd give them 5 stars, even with the navigation lag...This item is definitely a buy. It's simple to setup (pretty much just plug it in...), it has an amazing picture, and a good selection of apps too. But if you're more of a road warrior, Chromecast is still probably the better fit for you.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 5.0, "review": "Still learning all the ins and outs of using this but love it so far.", "verified": true, "helpfulness": "0/0", "author": "Dollar Family"}, {"rating": 5.0, "review": "Got my fire tv sticks yesterday. Very easy to set up. I'm in love with this little stick. The only con I have is that I don't like that it needs to be plugged into a electrical socket as well as the back on the tv. The stick goes into the HDMI imput then a power cord comes off the stick and needs to be plugged in for best performance. Other than that I have no other cons. It's great.", "verified": true, "helpfulness": "0/0", "author": "Jessica Jones"}, {"rating": 5.0, "review": "Sleek. Nice UI. Perfect streaming device", "verified": true, "helpfulness": "0/0", "author": "Haribabu Mopathy Gajendran"}, {"rating": 5.0, "review": "Edit: Everything works great.. might even switch to fire TV when the price drops below 50. One recommendation is to add a rating button in the remote. That way customers will be more involved with the prime membership, instead of going to pc for adding the rating. A Netflix style recommended shows based on the customer ratings can be easily done.", "verified": true, "helpfulness": "0/4", "author": "Amazon Customer \"reviewer\""}, {"rating": 4.0, "review": "I have an chrome cast and a fire stick, I would have to say the fire stick is my favorite streamer. It seems to load faster and stream better plus Amazon has way more free content to stream. The remote feels a little cheap and a tad to small. Other than that I would recommend the to anyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"G.Brainard\""}, {"rating": 2.0, "review": "I have been using the Amazon Fire Stick since it first came out. I love the interface, the ease of setup, the simple remote control, and the easy access to all of the Prime features.Unfortunately, 3 months with 2 different Fire Sticks and several calls to Amazon tech support have revealed major performance problems.First were the hiccups. Video played smoothly, but after a month or so, it started to stutter, regardless of the TV I used, or whether I was watching Amazon Instant, Prime, Netflix or other apps. A couple of calls to tech support got that resolved, then a couple of weeks later it happened again.  Each time involved disconnecting, resetting, etc.Now when I try to use it to play video on my big screen TV, I get audio only, and \"DHCP Error\" appears on the screen. Again, this is true whether it's purchased videos, Amazon Prime videos, Netflix, etc. Everything was working fine two days ago, but now Amazon tech support says there was an update and my 2011 model 65\" TV with 4 HDMI inputs is no longer supported. He said I needed to get a new TV.Really?", "verified": true, "helpfulness": "0/0", "author": "Quaker"}, {"rating": 1.0, "review": "So far I cant get it to work, will keep working on it", "verified": true, "helpfulness": "1/4", "author": "Angie Miller"}, {"rating": 5.0, "review": "I already have the Fire TV and love it so when I saw this I had to buy two. I got them and have to say it works just like the Fire TV and can't believe how fast it is and easy to setup.PROS-Fast-Easy Setup-Same as my Fire TVCONS-Has a plug that you need to plug into the wall", "verified": true, "helpfulness": "1/1", "author": "Roger"}]