[{"rating": 4.0, "review": "I'm Very Happy with My fire stick it performs flawlessly as long as Comcast holds up there end of the wi-fi  and internet bandwidth (more often than not , is that a issue. the only thing  I see that could improve  the whole user experience is  maybe some free PRIME movies here and there.  I'm a prime member  from a former  point and looking to sign up again .  if i could just get a chance to enjoy some of there exclusive content  i would opt to resign faster  but all and all i suggest you give it a try", "verified": true, "helpfulness": "0/0", "author": "adamg"}, {"rating": 2.0, "review": "It was easy to start . But the biggest problem l have is that the movies and programs on prime are not what you what you would call prime because all of them are older or not ever heard of .would like to see more recent movies and programs the stick would not work during a recent thunderstorm.hoping things will improve", "verified": true, "helpfulness": "0/0", "author": "Walter Marks"}, {"rating": 5.0, "review": "We love this Fire Stick. We already owned the Fire TV and wanted something for our bedroom. The Stick works just as well as the Fire TV as far as what I use it for. This serves as a interface for TVs without SmartTV technology whether they're old or just don't come with it. All you need is a HDMI port and a power source. We are currently trying to decide if we should get another Stick for our guest room/study or get another Fire TV for our room and move the Stick to the other room. Either way, both products are great for anyone looking to \"Cut the cord\" on cable/satellite. You can't go wrong with Amazon products; I'm convinced.", "verified": true, "helpfulness": "0/0", "author": "JRP"}, {"rating": 5.0, "review": "Great product easy to set up works great", "verified": true, "helpfulness": "0/0", "author": "Kenny"}, {"rating": 3.0, "review": "It functions as expected.", "verified": true, "helpfulness": "0/0", "author": "Martin Yan"}, {"rating": 5.0, "review": "Works Great!", "verified": true, "helpfulness": "0/0", "author": "kiy"}, {"rating": 5.0, "review": "Very user friendly!  Easy to install and use - love it!", "verified": true, "helpfulness": "0/0", "author": "Ann Bryant"}, {"rating": 1.0, "review": "Although, I have almost always had good experiences with shopping on Amazon, This fire stick came with poor directions. Myself, and two other people more familiar with setting up electronics, spent several hours trying to get it to work.  We read all of the online help directions and nothing worked.  We also couldn't read the ID on the fire stick because it is less than 4 point type and printed in black on black--a really stupid design mistake. Amazon is NOT Apple--and that is a good thing.  Amazon is usually good in anticipating consumer needs, but this one is a loser.", "verified": true, "helpfulness": "0/0", "author": "Mary Jane Zander"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Melissa Johnson"}, {"rating": 5.0, "review": "We only got it hooked up a couple day's ago and we enjoyed two movies thus far... I'm sure we are going to love it.", "verified": true, "helpfulness": "0/0", "author": "Dreamer"}]