[{"rating": 4.0, "review": "I am pleased overall. However I am an older and was dismayed to find each service required an addition monthly fee in addition to the $100 I pay for prime per year. While have more access to BBC programmingI am a widow living on a pension I love my fire and fire stix.", "verified": true, "helpfulness": "0/0", "author": "KarenDClarke"}, {"rating": 5.0, "review": "We absolutely love everything about the fire stick! It's user friendly and has tons of options- I'd highly recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "Theresa King"}, {"rating": 4.0, "review": "Good - need more content", "verified": true, "helpfulness": "0/0", "author": "Joshua Orozco"}, {"rating": 4.0, "review": "Have to pay for current movies!  Not good", "verified": true, "helpfulness": "0/0", "author": "DOLORES HOOD"}, {"rating": 5.0, "review": "Amazing technology, and also love Amazon Prime movies and television selection!", "verified": true, "helpfulness": "0/0", "author": "Kevin Keosoff"}, {"rating": 5.0, "review": "Very impressed by the ease navigation and content. Only wish I could down load network tv apps to play on the fire stick.", "verified": true, "helpfulness": "0/0", "author": "David Roman"}, {"rating": 5.0, "review": "The Firestick was free with prepaying three months Sling subscription, so no complaints about the price. I gave it to my daughter. Her family likes it.", "verified": true, "helpfulness": "0/0", "author": "Stephen R. Conrad"}, {"rating": 5.0, "review": "Love the Fire Stick!  Makes watching Amazon Prime and Netflix easy.", "verified": true, "helpfulness": "0/0", "author": "B. Litsey \"B. Litsey\""}, {"rating": 5.0, "review": "Love it! Hours of movies and TV. So easy to use.", "verified": true, "helpfulness": "0/0", "author": "SheLoves2Shop"}, {"rating": 4.0, "review": "Good content. I had the same issue described by others where it would not pick up the wireless well. In its defense though,  I had another competitive device have the same problem in the same location. A Nintendo wii in the same place worked fine. It's working ok now,  after moving my router a bit and I intend to just get a wifi extender to solve the problem permanently.The content is great - tons of available apps and free stuff,  and the navigation and interfaces are well-designed and easy to use.My only gripe is that to install apps (which are not pre-loaded) requires linking to a billing address on the Amazon account.  This for some reason was not set up despite my having purchase history,  and had to be done online.Cool feature : you can browse and select apps on the website and load them directly to the device.  Very convenient,  but I didn't see it anywhere in the approximately 65 words of included documentation.  It may have been in the intro video,  but  I left the room since you can't skip it and it's really long and stupid. A simple Google search though and I was able to get apps installed and everything up and running  with only a little hassle.  Overall,  money well spent I think.", "verified": true, "helpfulness": "0/0", "author": "Jon Baldridge"}]