[{"rating": 1.0, "review": "Had it for a couple of days and now it won't connect to the internet. Tried everything. No fix. Bought me a Roku, better product.", "verified": true, "helpfulness": "0/0", "author": "cdrice"}, {"rating": 5.0, "review": "I love it. It's perfect for me. It seems to run a bit hot if I keep it plugged in, but I don't usually keep it plugged in unless I'm using it. My son has the Chromecast, but even he uses my Fire Stick more than his Chromecast.It's perfect for travel too. Just remember to pack it back up with you when you're going home!", "verified": true, "helpfulness": "0/0", "author": "Watty Watts"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "joel banda"}, {"rating": 4.0, "review": "Amazon Fire Stick is everything I expected it to be. I'm buying an additional one as a gift. I'd like to add the gaming remote soon.", "verified": true, "helpfulness": "1/1", "author": "AmazonFL"}, {"rating": 5.0, "review": "Love the ability to be able to watch just about anything as well as getting music and apps.  Very easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "MJ"}, {"rating": 5.0, "review": "It's great. So,easy to install. Roku still has best selection for channels", "verified": true, "helpfulness": "0/0", "author": "Sandy Lochrie"}, {"rating": 1.0, "review": "The remote and stick don't talk to each other. I've tried the stick on several TVs, and have the same problem on each one. (Yes, I've also tried new batteries, using the extender cord, etc.) Must walk to TV and aim remote at the back of the TV for it to work. Sometimes I can find a weird position from across the room that works, but for the most part, I'm not a fan. Chromecast is more intuitive and is much easier to use, in my experience. Maybe I just got a lemon?", "verified": true, "helpfulness": "0/0", "author": "Anne"}, {"rating": 4.0, "review": "Portable, excellent selection of programs.", "verified": true, "helpfulness": "0/0", "author": "R. Basham"}, {"rating": 5.0, "review": "Truly I have enjoyed the fire stick, one of best investments I have made electronically in a while. Only issue i can say is that sometimes Netflix may have a glitch buffering, I dont know if its stick of my cable. Overall its a good product, now my teen wants one. lol", "verified": true, "helpfulness": "0/1", "author": "Olivia Stith \"Author/Motivational Speaker\""}, {"rating": 5.0, "review": "so much faster and better than working through our Wii; picture quality is amazing I didn't think our TV was capable. Setup was really easy and worked right away, already associated to our account, just needed a WiFi password.", "verified": true, "helpfulness": "0/0", "author": "Lara B"}]