[{"rating": 1.0, "review": "Ok I love Amazon and their Prime service.  I order EVERYTHING on Amazon except food.  So we thought we would try these Sticks, 2 of them.After 6 months, we are done.  VERY VERY SLOOOOOOOOW system.  Not enough memory.  With the stick just 15 feet UNOBSTRUCTED to the router, we would STRUGGLE to get 480 streaming.  And my network is fine, all other devices were fast.  30Mbs down, 5Mbs up.  And the neighbors are too far away to interfere with signal.  Heck, my computer on the other side of the house would connect at faster speeds than the stick.After many app uninstall/reinstalls, clearing cache, clearing data, restarts, reconnecting to network, and finally reset factory setttings, we were done.  In fact after the last reset, we couldn't connect to the network anymore.Also I HATE the menu.  I like the idea of keeping Amazon content INSIDE a channel/app but Amazon mixes their content into the Home Screen.  Disorganized, and ugly.  And did I mention SLOW menu moving?We went to the Roku3 (not the stick) and oh my GOD it's fast.  No issues with speed or streaming quality. It just works great.Stick with Amazon, and Prime.  But the Fire Stick is NOT ready for prime time.  Too bad.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Audio sync is out on HBO, Starz, and Netflix. After searching the internet for a solution for hours nothing seemed to work so i will be returning the stick and trying the full FireTV.", "verified": true, "helpfulness": "0/0", "author": "Rob L."}, {"rating": 1.0, "review": "It's ok. I was hoping all the people talking about connection issues just had their networks configured wrong but unfortunately there is a real issue with the way the fire stick connects to the Amazon servers. Maybe the issue is with the servers themselves. Either way a dropped connection is unacceptable since the only point of this device is to connect you to your entertainment. I'm a very happy Amazon customer and have been for years but they dropped the ball with this", "verified": true, "helpfulness": "1/1", "author": "ryan meehan"}, {"rating": 5.0, "review": "Learning curve but love the basis! I am an Amazon Prime fan and it is now my go to place! This just made it much better! Now the kids can have movie night on their TV! All the movies we buy at their finger tips for them to enjoy together. Especially at spend the night parties! One big down side, the popping noise. Would have 5 stars if it weren't for this painful popping. I can't figure out how to stop this popping noise the sick makes through the speakers when making selections. Also another set back we got around.... make sure it is close enough to the WiFi or in an unobstructed area. If not, you will constantly have connection issues. Our port was in back not on the side and was a problem. We solved this issue by using the attachment extender. It then hung below our TV instead of behind and now it gets WiFi signal no problem. Still would highly recommend it though!", "verified": false, "helpfulness": "1/1", "author": "Cooper"}, {"rating": 3.0, "review": "This item is useless in most cases I have tried to use it. For my home, I prefer to pay the extra and buy a full Fire TV. I bought this for travel and in most hotels it is absolutely useless as internet settings cannot be set via the device in most hotels and in many hotels it is impossible to access the slot for hdmi plug in.", "verified": true, "helpfulness": "0/0", "author": "Adam S \"Avid Reader, Critic, and Shopper\""}, {"rating": 5.0, "review": "Very enjoyable to be able to watch something that you can like instead of just surfing from one channel to the next to find something interesting when you want to stay in and relax.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Richard"}, {"rating": 5.0, "review": "Well-crafted", "verified": true, "helpfulness": "0/0", "author": "painslayer \"EL\""}, {"rating": 3.0, "review": "A great idea but poor implementation of the streaming video on a stick concept.For a baseline with wifi signal, I have around 45Mbps actual transfer rate in the receiving room on a tablet pc on wifi. My wired Ethernet is much faster.Here are the observations I have about this product.1. It's cheap, so cheap I can justify purchasing this to experiment with if it doesn't work.2. The antenna for wifi can't pick up much of any signal from router 20 feet away until I purchased a new Asus N66U router, and even then I still had sporadic SD streaming instead of 1080p HD. I eventually ended up upgrading to bigger antennas and spent hours tweaking the wireless channels to remove interference and router placement and antenna degree angles. This was way too much effort just to get HD streaming to work so from that perspective this product is defective.3. No USB support for external storage.4. You can stream videos from local network wifi shared devices with windows home share via other apps on amazon such as Vimu.5. Kodi side loading possible6. Two cables will always connect to the stick, don't let those other product images fool you. You need the hdmi extender so the stick antenna doesn't get blocked by the tv, and you need the power cord on the side to connect to ac power. This is no longer a \"stick\" product so much as mini version of the fire tv with the same amount of cords minus the voice control, ethernet and usb support.7.Did I mention no wired Ethernet support? So you're stuck with poor antenna reception and SD content if you got a lousy router or old wire mesh reinforced walls like me.8. Stick does get hot under operation. It becomes too hot to hold.9. Large amount of movies and TV shows including HD movies are available for prime members to stream on this device at no extra cost.10. No live TV from amazon unless you use third party apps at your own expense.11. The simple remote and user interface are amazing, the remote is very clean and easy to use.So unless you like to play with something mostly experimental and highly finicky, I'd save your money and just wait.Amazon app is already available on more robust platforms like the full fire tv box and playstation consoles.In summary, this is a good idea for a product with a large amount of promise and huge application add on base, but I would wait for the next hardware version to come out or buy the full fire tv.  Maybe an announcement of new version of fire tv stick for next holiday?*crosses fingers for better antenna*", "verified": true, "helpfulness": "0/0", "author": "kaz"}, {"rating": 5.0, "review": "so glad I finally purchased this.. easy to use, intuitive icons and the prime selection is fantastic!  Just one more reason to love my Amazon Prime status!!", "verified": true, "helpfulness": "0/0", "author": "Jules"}, {"rating": 2.0, "review": "Can't get it to work. Advertised as simple to use, just plug in. Not true!!!!", "verified": true, "helpfulness": "0/0", "author": "hwillis38"}]