[{"rating": 5.0, "review": "I love my Amazon Fire Stick! Its quick and easy to use and since I pre-ordered it I got it at a lower price. It has worked flawlessly on every tv I have but it on but the best part is that I can attach it to my projector. Awesome! Another plus is the screen share where I am able to see my phone or tablet screen on my TV and play videos, movies, even my casino apps, etc from my phone or tablet. That part alone is worth the price!", "verified": true, "helpfulness": "0/0", "author": "M. Mendez \"gadget queen\""}, {"rating": 5.0, "review": "Picked up on the Prime offer. Was unsure how the product would be. Installation was a breeze. Plugged into usb for power and hdmi. User interface is nicely laid out. (I wish they would update the tablets). Graphics and user interface is much better than Roku.Not a lot of apps currently. Showtime (not currently available to Comcast subscribers), the excellent Red Bull Tv, Flixster, and a few others. HBO Go is slated to be coming soon!Remote is Rf.  Navigates reasonable well. iOS app coming soon which allows for voice search.Having better specs than competing products is displayed in how responsive the unit is and how quickly the shows steam in HD. I had been using a PS4 on the living room television for streaming but have now switched to the Fire TV Stick and don't plan on going back.Hope to have more content add, MLS Direct Kick, NHL, NFL, NBA, Vudu, Target Ticket, Cinema Now, Disney", "verified": true, "helpfulness": "0/0", "author": "J. Alexander"}, {"rating": 5.0, "review": "Got my Fire TV Stick today. First good thing is that it came a month earlier than told when I ordered it. Next it was simple to install get up and running. Finally it was already registered to me through my Amazon Prime account. Simple to install and setup and simple to use. Only thing even close to a problem was opening the remote to put batteries in. Would recommend to anyone!", "verified": true, "helpfulness": "0/0", "author": "offduty and retired"}, {"rating": 5.0, "review": "I love this. I had no expectations when I ordered this... I think I was just curious. But I love it. I really wanted to be able to able to watch my Prime on my TV and it is really awesome. Watching YouTube on my flatscreen is really cool as well.There are some cable channels you can get even though you don't have a cable subscription (like A&E; and Lifetime) - and some you can't (like Showtime and HBO), which is fine. I just wish this info was listed in the product description for complete transparency.The TV picture is way WAY better than when I am not using Fire Stick - which I am hoping to figure out b/c the picture is much sharper and the colors are just popping. I am going to try to watch my favorite shows with this new and improved imagery. The new clarity is just that good.I am glad I didn't read any of the 1 star reviews (which I usually do) before I purchased b/c I am not having any of the problems that were listed like connectivity issues, etc - and I think the remote is super intuitive. My set up was really easy - just follow the instructions - and it took me 2 minutes ( and I HATE setting up stuff like this...)Love my Fire Stick. Worth every Penny.", "verified": true, "helpfulness": "1/1", "author": "Skeptical Shopper"}, {"rating": 5.0, "review": "This is a great device.  It lets you play all of your Amazon Prime videos and is super fast to navigate and control. There is no boot time and I can see all episodes of a show at the blink of an eye.  This is way better than having a DVD player linked to Amazon because of the navigation that it provides and how fast it loads.  It doesn't sit and check connection speed before every movie, it just loads it and I am watching movies in seconds instead of the typical half minute of waiting for everything to get loaded.  Got one for the mother in law and she loves how it works and that she can have a slide show of all the pictures she took and loaded on her Amazon account.  I got them both when they were on special for $19.99 which made them a great deal.Wish this item had a way to navigate to files on a NAS and play videos from there since I have a lot of content that my Smart TV Box plays, that this device will not.  I would really like to get rid of the Smart TV Box and just have one that did it all, but I have not found something that will do Amazon Prime, Play files from NAS, HBO GO, Xfinity, Netflix, Youtube.  I know I could have a computer do it all, but I want a small device that does it all for me and has nice navigation so my wife can use it!", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 1.0, "review": "I purchased this for $19 when they offered it to me and I'm really glad I didn't pay any more than that.My biggest problem is that it's network connectivity is very spotty and I can't make it through 10 min of browsing the menus or downloading a single app without it loosing my wireless network which it claims has a \"Very Strong\" signal.I like the interface as it looks like Plex, but it does me no good when I can't do anything with the selections!The power brick that came with it is a horrible design.  It's so flat, but yet so wide it takes up 3 outlets on my power strip!  And It won't power off the TV's Service port like my Chromecast does.This thing is absolutely worthless.  Dont waste your money.  My Chromecast and AppleTV work great.  This doesn't work at all.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This device is highly responsive for being a compact TV streaming device.  There is a great deal of content to choose from that starts streaming within a couple seconds of selecting a video.  The device is connected to a TV that is roughly 5 feet away from my WiFi router on a 35Mbit downstream.  Utilizing on a 40 inch Sony Bravia.Pros- Highly responsive- Access to a large store of media- Quick access on loading media once selected (35Mbit connection)- Smooth frame rate on TV/Movies- Small form factor- screen saver function for idle/timeout- Completely lag free with zero hiccups in video streamsCons- Newest movies have compression artifacts, especially dark colors (might be Amazon service itself)- Idle/time out sometimes spazzes out a little jumping back into the loading splash screen (might be due to my TV)- Ran across a couple apps that appeared to not be available for downloadVery solid piece that is simple in design.  The remote is easily understood.  The menu is intuitive. Overall, it is a great product.  Would like to see more content made available to it but that can come in time.", "verified": true, "helpfulness": "0/0", "author": "Michael Lawrence"}, {"rating": 3.0, "review": "I just received the stick and for the most part I like it.  In comparison I have a Roku 2 and it is so far a lot better in load speed and quality.  I used the recommended equipment which is the power cord and the HDMI extender.  I do not know how the stick works without the power cord or extender.  It was easy to set up.  I just plugged it in and it started up and it did a quick video about the stick.  It also recognized my amazon account so it was already set up for amazon prime TV.Pros:Easy to set up.Fast load and picture quality.Can download an app and use it as a remoteCons:My remote that came with the Stick is very touchy or either sticks and keeps scrolling in the menus.The remote app is only for Android devices.  Three stars because the remote was not working correctly. (Update on the remote... I am experiencing more problems with the remote not working at all.  Maybe this is the stick I am unsure but I know the device does not work after awhile).", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "So happy we got this while Amazon was running the special a few months back for $19.99. Better than Roku!", "verified": true, "helpfulness": "0/1", "author": "SD \"SD\""}, {"rating": 3.0, "review": "I'm having the same problems getting the batteries installed. I can't get it open at all ! If your strong you might break the little remote !", "verified": true, "helpfulness": "0/0", "author": "Guess Who ?"}]