[{"rating": 5.0, "review": "Wonderful device. Don't know how we managed without it.", "verified": true, "helpfulness": "0/0", "author": "janice grillo"}, {"rating": 2.0, "review": "Connection keeps dropping. I had to run a dvi/HDMI cable from my computer to my TV because it worked better with the desk top program has", "verified": true, "helpfulness": "0/0", "author": "gary pedraza"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Biker"}, {"rating": 5.0, "review": "I'm a late bloomer when it comes to techno savvy. My phone isn't smart. The Fire TV stick was necessary because my digital, hd tv was not on the list of apparati that readily accepted the opportunity of Amazon's Amazing offer of free streaming..... .Now that I'm retired I have a kinder, simpler life and like to do exactly what I want and didn't want my mind bent or even concerned with complicated electronics.  After 2 letters from Amazon I finally took advantage of  Prime's offer of free movies, t.v. and music and purchased the Fire TV Stick. With a little help from Amazon I got it installed within minutes of receiving it. It seems all they told me it was. If you have Prime, you won't pay for these privileges so don't pass this up! I used 'chat' for a little kind Amazon assistance and also got a 1 time $20 discount on the stick . Don't know why I waited so long.", "verified": true, "helpfulness": "0/0", "author": "Danelle Libhart Acord"}, {"rating": 5.0, "review": "This is awesome.  Much better than using my blue ray player to access amazon prime, netflix, etc.  Easy to setup and use.  Have yet to try it when I travel.", "verified": true, "helpfulness": "0/0", "author": "The Scot \"The Professor\""}, {"rating": 5.0, "review": "Very user friendly,", "verified": true, "helpfulness": "0/0", "author": "Manuel lozano"}, {"rating": 4.0, "review": "Voice commands would be nice...", "verified": true, "helpfulness": "0/0", "author": "elmer pacardo"}, {"rating": 3.0, "review": "It's a great concept, unfortunately some of the most important apps, like Hulu have serious problems. The Hulu app freezes sometimes, crashes sometimes, and generally is barely functional for TV viewing. I've switched back to using my XBOX 360 for watching television on the internet on my television.", "verified": true, "helpfulness": "0/0", "author": "Stephen A. Goss"}, {"rating": 5.0, "review": "Easy to use and set up. Price was right. Only now I'm watching to much TV.", "verified": true, "helpfulness": "0/0", "author": "Robert B."}, {"rating": 5.0, "review": "I have Prime and I was tossed between renewing Netflix or streaming Prime. Prime has more to offer, entire TV series that I've missed where Netflix does not. It was so simple to set up and I\"m completely happy.", "verified": true, "helpfulness": "0/0", "author": "Marie Hermans"}]