[{"rating": 5.0, "review": "Fantastic device.  Extremely easy to use. I also found that the preloaded apps on the firestick (Hulu, Netflix, etc) worked better than the same apps one web tv.", "verified": true, "helpfulness": "0/0", "author": "In the Day you See"}, {"rating": 5.0, "review": "Awesome as long as you have Prime.  Only thing I wish you could do is sort by the movie rating...PG, PG-13, ect.", "verified": true, "helpfulness": "0/0", "author": "Dan Boerman"}, {"rating": 5.0, "review": "This is really great. And very easy to use with great options", "verified": true, "helpfulness": "0/0", "author": "Arlene Evans"}, {"rating": 3.0, "review": "Great device, but would be better if it has accessibility features like the Apple TV does.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Easy to install easy to use highly recommend", "verified": true, "helpfulness": "0/0", "author": "kelly mazzara"}, {"rating": 5.0, "review": "This product is awesome! Works like a charm right away. Easy to use, easy to install. Love it!", "verified": true, "helpfulness": "0/0", "author": "jrltll"}, {"rating": 5.0, "review": "I'm a Prime member, so my Fire TV Stick was ready to go right out of the box. Just plug it in and start watching. Even if you aren't a Prime member, setup is still very simple.", "verified": true, "helpfulness": "0/0", "author": "david"}, {"rating": 5.0, "review": "Love it so far! No issues, super fast connection.", "verified": true, "helpfulness": "0/0", "author": "Susie Beery"}, {"rating": 5.0, "review": "Love my Fire Stick. Bought it during pre sale for $20. Wish I had bought a few more. Does everything Amazon says it will. My guest bedroom TV has a new lease on life.", "verified": true, "helpfulness": "0/0", "author": "Shah-n-shah \"Good Book Lover\""}, {"rating": 5.0, "review": "Nice product. Wish it had a browser feature. If it does I haven't found it but other than that I really like it.", "verified": true, "helpfulness": "0/0", "author": "Glen"}]