[{"rating": 5.0, "review": "The Fire TV Stick is easier to use and works a lot better than any of the smart TV's we have in our Florida house.  Plus it is protable to any TV with a Usb and wifi in the area.", "verified": true, "helpfulness": "1/1", "author": "Jeffrey D. Mogg"}, {"rating": 2.0, "review": "It's pretty laggy and everytime I play HBO Go it skips and stalls.  I'm going ot try Fire TV in hopes it works better.", "verified": true, "helpfulness": "1/1", "author": "Tyler"}, {"rating": 5.0, "review": "Excellent streaming device! Remote works fine but wish it had volume button.", "verified": true, "helpfulness": "1/1", "author": "Ryan"}, {"rating": 2.0, "review": "If you want to watch Amazon Video, it performs great.  It is lousy as a device to mirror your tablet or computer screen, which is half of the reason I bought it.  Also other third party video services like \"Crackle\" do not work well.", "verified": true, "helpfulness": "1/1", "author": "alaskaboy"}, {"rating": 5.0, "review": "Very easy set up,works great", "verified": true, "helpfulness": "0/0", "author": "Brenda B."}, {"rating": 4.0, "review": "This is an amazing product - Especially for $39.  We use it in our bedroom and it works really well.The only reason I didn't give it 5 stars is because I wish it had 2 features:1.  The remote doesn't glow and it's more complicated than the apple TV remote.2.  I wish it had some sort of HDMI pass through.  I hate having to switch TV input away from cable.  Honestly, I understand that Amazon wants you watching their service.  But I haven't cut the cord yet, and the fact that this is on a different input actually makes me watch it less.  Which is a shame, because it's a really good product.Having said that, it's $39 - Just buy it.", "verified": true, "helpfulness": "0/0", "author": "DanDadNJ"}, {"rating": 4.0, "review": "Absolutely love this product!", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 4.0, "review": "I have only used it for music and HBO go at this point and have been happy for the most part.  HBO go buffered A LOT, but it may have been the website.  It's never done that to me in the past while watching on my Kindle tablet, so I don't believe it was my internet.", "verified": true, "helpfulness": "0/0", "author": "jrshirk"}, {"rating": 5.0, "review": "works great carry it with me everywhere smare tv  just plug it in", "verified": true, "helpfulness": "0/0", "author": "Paul J. Dube"}, {"rating": 5.0, "review": "Love it. Only problem is, if wifi disconnects then you have to unplug power to fire stick and replace to in order to reconnect to wifi.", "verified": true, "helpfulness": "0/0", "author": "Natalie Black"}]