[{"rating": 5.0, "review": "It's great, I'd recommend it...", "verified": true, "helpfulness": "0/0", "author": "FR"}, {"rating": 1.0, "review": "I read all the information on the website very carefully prior to buying this. Nowhere does it let you know that you need to have wifi to use it! In fact, it says somewhere about how you can view all these shows, movies, etc., \"at no extra cost.\" The first time I saw anything about needing a wifi connection was when the device arrived. Now I have a device which is of no use to me!", "verified": true, "helpfulness": "0/5", "author": "ellie"}, {"rating": 5.0, "review": "Perfect product", "verified": true, "helpfulness": "0/0", "author": "Jeffrey J Wheeler"}, {"rating": 3.0, "review": "It's freezes and drops connection frequently but it's cool otherwise.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "works well.  xbmc compatible.  make sure your have a strong wifi connection.", "verified": true, "helpfulness": "1/1", "author": "D. Myers"}, {"rating": 5.0, "review": "Much more useful than my Chromecast has been, flawless streaming of Prime video has been great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Beautiful and user.friendly interface. I live it, would definitely recommend to my friends.", "verified": true, "helpfulness": "0/0", "author": "Julio Lopez"}, {"rating": 4.0, "review": "Nice easy controls, and was a bargain as we pre-ordered.", "verified": true, "helpfulness": "0/0", "author": "Meggles57"}, {"rating": 4.0, "review": "works great so far.  Except miracast.  Can't get anything to mirror.", "verified": true, "helpfulness": "0/0", "author": "Duy T. Le"}, {"rating": 5.0, "review": "Surprise, surprise. I ended up in the Fire revolution. I bought this device to test its suitability in higher education for providing a mirroring platform for Android devices. iOS is covered with Apple TV and AirServer and their protocols, Android - not so much. Chromecast was of course option #1 but I chose to wait, the Roku stick followed then the Fire TV stick. Android has failed to mirror correctly on most of the devices I tested but I'll dedicate this review to my pleasant surprise... as a media device this rocks.I'll still use my PS3 and Playstation Media Server to stream local content from my desktop to my TV but this has pretty much replaced my need for cable. I mostly watch ESPN and CNN with a dash of some other stuff... It doesn't have a CNN live streaming app... but I sure hope it gets one. The HD is clear, buffering is minimal so their codecs are fine (20MB down, 2MB up) and its an all round decent device ESPECIALLY IF YOU'RE A PRIME CUSTOMER.", "verified": true, "helpfulness": "0/0", "author": "DJ Carbon \"\"Whenever you hear something said with a lot of confidence the first thing you should ask is, 'Is that true?\" - Noam Chomsky\""}]