[{"rating": 5.0, "review": "Enjoying the simplicity, ease of use and size.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow", "verified": true, "helpfulness": "0/0", "author": "Joey Rodriguez"}, {"rating": 4.0, "review": "This is my first device like this but so far I like It. I already had a kindle that I was watching prime exclusive shows on so this was a perfect addition.", "verified": true, "helpfulness": "0/0", "author": "margaret holler"}, {"rating": 1.0, "review": "I live in South Korea as a US Soldier and this product won't work in Korea.", "verified": true, "helpfulness": "0/1", "author": "charlie bryant"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Corey Nunn"}, {"rating": 1.0, "review": "Works to start but then cannot connect to wifi properly.  Requires reset.  Seems like others have similar issue.  Hope a fix is coming.", "verified": true, "helpfulness": "0/0", "author": "Dixon Low \"LD\""}, {"rating": 4.0, "review": "For some reason sometimes the images freeze. How can that be if it doesn't require an antenna. I doubt it's the internet speed connection because I've never had a problem watching videos on my laptop.", "verified": true, "helpfulness": "0/0", "author": "Enmanuel De Jesus"}, {"rating": 1.0, "review": "The Firestick never worked well for me. I would get a message saying that there is no internet. I would to settings and it will tell me that it is connected to my wifi and the signal is good. When I finally get it to work and start watching something the program stops and says that the Internet is slow. It takes me two hours to watch for ten minutes. Tech support just takes me through the same steps that I take. Like I said \"It's not working for me\"!I've gone back to read the reviews. Apparently it's not working for a lot of people. Are these the people that paid $20.00? Why does it appear that it works for some people. Are these the people that paid $40.00? Could it be that the people that paid $20.00 is paying for the manufacture and/or the repair for the units that went out to the people that paid $40.00. Look at the quantity of people that gave it one star and are not returning it. How about the people that didn't bother to rate or write a review for their non working units? That's a lot of money.I DON'T KNOW! I'm not surprised by crazy business practices nowadays. What is Amazon going to do? What can we do as consumers?Who are these people that are giving it Five Stars?Are you kidding me?!!!You need to go back and tell the truth. Maybe you rated it just after it happened to have work for the first time! GO BACK AND RATE IT AGAIN!", "verified": true, "helpfulness": "0/0", "author": "Ellell \"llssmythe\""}, {"rating": 2.0, "review": "I compared it to the Google stick on the same location. the wifi is so picky and on/off for no reason. Sometime lock up during boot process and required reboot to make it work.", "verified": true, "helpfulness": "0/0", "author": "Yu Chen"}, {"rating": 5.0, "review": "We ditched the cable company recently (after another round with them). This has been really worthwhile.It's about the same price as a chromecast, but much easier to use and more responsive. Plus, it has amazon (along with the normal hulu and netflix). There are a few games too - and some are so much more addictive than you'd expect.", "verified": true, "helpfulness": "0/0", "author": "HR"}]