[{"rating": 5.0, "review": "Got this for my mom for xmas since her DVR is always over run with shows she hasnt watched. Took maybe 15 minutes to setup since it had to download and update but after that she was able to easily navigate the device. She was super excited to be able to catch up on a lot of shows with netflix and hulu.", "verified": true, "helpfulness": "2/3", "author": "Veronica"}, {"rating": 5.0, "review": "I'm not sure why I didn't get mine until December, since I pre-ordered mine, but I'm very satisfied with the Fire Stick! We took it with us home for the holidays & were able to watch all our faves within minutes!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This device is a complete waste of money. It only connects to the internet sporadically and when it does connect it randomly disconnects in the middle of a program. We've tried it on multiple TV's in different rooms and always the same. We never had this issue with our Apple TV's.", "verified": true, "helpfulness": "1/1", "author": "L. Harper \"L. Harper\""}, {"rating": 2.0, "review": "Rushed to market - drops wifi connections. ROKU is more mature.", "verified": true, "helpfulness": "0/0", "author": "PeeceeWizard"}, {"rating": 4.0, "review": "My order was placed in October, I didn\"t receive the stick until December.  It\"s okay. The stick reminds me of cable, must pay for extras. This is the reason why I have not had cable since 2006. ESPN always freeezes. Enjoying the Free Prime.", "verified": true, "helpfulness": "0/0", "author": "Miss LMH"}, {"rating": 5.0, "review": "Fantastic little streamer. Reaaly blows away Chromecast!", "verified": true, "helpfulness": "1/1", "author": "H. Wright \"DVD Enthusiast\""}, {"rating": 2.0, "review": "It requires you to plug the USB into the wall. My Chromecast's USB power source plugs right into the TV next to the HDMI outlet, so I don't have to worry about cords or plug overloads. Funny that the advertising always leaves out THAT part... I wanted to love it, but I ended up returning it.", "verified": true, "helpfulness": "0/2", "author": "Jared F. Heath \"Jared\""}, {"rating": 5.0, "review": "Much better than ChromeCast!", "verified": true, "helpfulness": "0/0", "author": "Will Langston"}, {"rating": 5.0, "review": "fantastic little device with tons of features. remote seems to have excellent range and is very responsive.  the device is a little wide and had some trouble fitting it in the tv, next to the bulbous chromecast I have, but the extension/adapter cable the comes with it, allowed it to be used nonetheless.", "verified": true, "helpfulness": "0/0", "author": "L. Briscoe"}, {"rating": 5.0, "review": "The am Amazon Fire TV stick adds the \"smart\" to your not so smart TV. This device lets you add all kinds of content providers via your internet. It has great interfaces for the major services that I've tried. And it's quite easy to setup", "verified": true, "helpfulness": "0/0", "author": "L. D. Johnson"}]