[{"rating": 4.0, "review": "It works great in our sons room. He's 6 and has no issue with using it.", "verified": true, "helpfulness": "0/0", "author": "Hawk Fam \"Hawk\""}, {"rating": 4.0, "review": "Worked flawless, however used 6gb for a 2 hour movie with my Verizon Jetpack. Not happy with that.....Is that normal?", "verified": true, "helpfulness": "0/0", "author": "Doug C."}, {"rating": 4.0, "review": "I've had the FireTV stick for almost a month now and it's been great for the most part. It's a pretty simple setup (though I wish you could skip the intro video). Most of the apps run pretty fast and work well. Some apps do cause the entire device to restart on occasion; Plex has been the biggest cause so far. It's hard to place blame on the FireTV Stick, because I think a lot of this is the app's fault.One thing that the device is not very good (which is unfortunate, because it's your only option on the Stick) is the wifi. Granted this will vary heavily based on router type / setup, but in one particular instance where I've had my FireTV Stick installed, the wifi performance was horrible. I will place some blame on the FireTV Stick itself, as a cell phone on wifi in the same area performs just fine. The FireTV Stick will often disconnect from the wifi when behind the TV in this scenario. I found that using the HDMI extension cable and trying to hang it to the side of the TV helps a little bit.Something that works extremely well, that I think a lot of people will be happy about, is Kodi Media Center (XBMC). You have to enable dev mode and side-load the APK; but that process is pretty easy (for a techy person). The other pain is that you need to go into settings and manage apps to get to side loaded apps. Other than that, Kodi itself runs very fast and well. 1080p / 720p HD videos stream from a NAS with no lag or issues. Way, way, way faster, in fact, than Plex on the same FireTV. If you're looking for an inexpensive way to get Kodi on your TV, look no further than the FireTV Stick.On another note, I like that you can search for media and it offers alternative sources to play the media from (such as Hulu Plus). Though I don't recommend bothering with Hulu Plus. I setup a trial as a result of it being shown as an alternative source to play a TV show I searched for, but just as soon as my episode finished, I cancelled the trial subscription. Hulu has good content and streams high quality, but the ads just ruin it; and with no plan available to disable ads for a higher price... Anyhow, that's a rant for another place/time.", "verified": true, "helpfulness": "0/0", "author": "S. Clyde"}, {"rating": 4.0, "review": "I recommend the Fire Stick to anyone who has a Amazon Prime account & Netflix account. It's easy to install & easy to navigate through. You don't need your phone to run it, like Chromecast. I recommend you keep up with the remote. It's useless with out it. All in all, I love it.", "verified": true, "helpfulness": "0/0", "author": "cowboys4lyfe76"}, {"rating": 5.0, "review": "Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "ND"}, {"rating": 3.0, "review": "I am constantly searching for the best media playback device for my digital multimedia collection. The Fire TV stick plays media (Netflix and Plex Media Client) butter-smooth with an occasional hiccup that might be due to my wireless connection. I noticed that without an active Internet connection the Fire TV Stick is practically useless.", "verified": true, "helpfulness": "0/0", "author": "Christopher McIntosh"}, {"rating": 4.0, "review": "Remote is convenient. Nice interface, but streaming seems perhaps a tad slower than through my DVD player, which also allows streaming. PBS streaming is unacceptably slow. Not sure why it doesn't draw power from the USB plug-in instead of requiring a separate outline connection to power.", "verified": true, "helpfulness": "0/0", "author": "Robert Gray \"Bob\""}, {"rating": 5.0, "review": "I love that it is small and stays behind the TV.  I did have to use the included extender on my set but we love it", "verified": true, "helpfulness": "0/0", "author": "realtormoma"}, {"rating": 5.0, "review": "Great device! Super fast!", "verified": true, "helpfulness": "0/0", "author": "Moussassa"}, {"rating": 1.0, "review": "I have a 600 mbs router next to the fire stick and it still doesn't offer a consistent picture, my blue ray player has more processing power and is fine... Not sure what is up with the stick...", "verified": true, "helpfulness": "0/1", "author": "Matt"}]