[{"rating": 4.0, "review": "I really enjoy this stick. Worth every penny", "verified": true, "helpfulness": "0/0", "author": "Khalid"}, {"rating": 5.0, "review": "Best thing close to a full smarttv", "verified": true, "helpfulness": "0/0", "author": "michael kidd"}, {"rating": 5.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Buhr"}, {"rating": 1.0, "review": "I didn't buy a fire stick", "verified": true, "helpfulness": "0/2", "author": "David Tatsak"}, {"rating": 5.0, "review": "I have tried both the Google Stick and the Amazon Fire TV Stick, the Fire hands down beats the other sticks out there. There is no need to use another device, like a tablet, laptop or phone, this is super easy to install and use and at $39 it is affordable for every room in the house!!! Love, love Amazon!!!!", "verified": true, "helpfulness": "0/0", "author": "Leslie Spaulding"}, {"rating": 2.0, "review": "Disappointed. I'll stick with my Roku boxes.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "This is amazing!  I had it hooked up in about 3 minutes.  This is awesome!  No commercials to fast forward through!  YAY!!", "verified": true, "helpfulness": "0/0", "author": "BRENDA K."}, {"rating": 3.0, "review": "I have a hard time keeping it connected to our network, but when it does work its not bad.", "verified": true, "helpfulness": "0/0", "author": "R. Downey"}, {"rating": 5.0, "review": "The FIRE TV works well, which could improve it by adding subtitles in Spanish to all series and movies from Amazon Instant Video, for Spanish speakers.", "verified": true, "helpfulness": "0/0", "author": "MANUEL ESPINOZA \"MR.\""}, {"rating": 4.0, "review": "I got it last week and connected at once. It started to work right away perfectly. I cannot give 5 stars since I am a new user of the Stick and would need more time to get an experience to give a more objective assessment. However up to this point it is a fantastic tool and less expensive than other options. If your TV set has only one HDMI socket I suggest you buy a device with two or more socket so that you can also use other items such as cable tv without having to connect and disconnect continually.  I already ordered the latter to make transfers easily. Hope will work also fine. Nevertheless, the stick does not allow non USA customers to rent movies which limits the offer of entertainment. I have detected in the menu several movies that I would like to rent but the purchasing process is discontinued automatically. Amazon should straighten this unfortunate limitation.", "verified": true, "helpfulness": "0/0", "author": "Juan B. Mansfield"}]