[{"rating": 5.0, "review": "Great product. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "margaret gafner"}, {"rating": 3.0, "review": "It works pretty good when it's not complaining it can't connect to the router. Seems like it overheats on occasion. I had to send it back for a replacement already due to this. Have had some minor issue with the replacement but not as bad. Disappointed they have blocked the ability to install Kodi directly.", "verified": true, "helpfulness": "0/0", "author": "Ryan Mann"}, {"rating": 5.0, "review": "super easy", "verified": true, "helpfulness": "0/0", "author": "alain guignard"}, {"rating": 5.0, "review": "Very easy set up.  I have used Netflix, Amazon video, HBO Go, Showtime Anytime, & Lifetime TV with no problems.  This is the first time that I am able to download and use all of those apps on one device.  No hesitation in streaming.  It is flawless.  I was going to purchase a bluray player, but it did not have all of these apps.  The Amazon Fire TV Stick has more apps that I use than any bluray player I have seen and for a lot less money.  Am very happy & would highly recommend this.The only thing that would make this perfect is if it had the Dish Anywhere app.  It does not.  Hopefully they will update it in the near future.", "verified": true, "helpfulness": "0/0", "author": "L_Ann_F \"kitchen gadget queen\""}, {"rating": 5.0, "review": "Works great, made my \"dumb\" TV smart!Easy to set up, wide variety of apps, easy to use.Works in conjunction with your Amazon prime benefits.", "verified": true, "helpfulness": "0/0", "author": "lzkashmir13"}, {"rating": 5.0, "review": "Love, love, love it!  If you are considering it and are even just a Netflix viewer, buy it.  It is a great buy.", "verified": true, "helpfulness": "0/0", "author": "Jessicat83 \"Jessicat\""}, {"rating": 5.0, "review": "Love the Amazon Fire Stick and I love that it will autoplay when I'm binge watching, unlike my older Roku. It comes with an adapter in case you don't want it to stick straight out from your tv which I was happy about because my hdmi ports are in a weird place and it wouldn't fit. Works great!", "verified": true, "helpfulness": "0/0", "author": "J-Rae \"judirae\""}, {"rating": 4.0, "review": "The Fire stick was delivered five days ago and my first impression was \"I LOVE this!\" I am a baby-boomer and not as computer savvy as my 30 something kids, but this was indeed a plug and play item. Perfect... except... We live in the country and have limited internet options. Therefore, the best option we could get does limit our data. But we are not gamers and use internet for working and streaming a movie an evening or two a week and the occasional grandchild visit with their \"toys\". We realized yesterday that the fire stick was zapping the data from our plan even though it has not been used for the last 3 days! I quickly unplugged it so it would not be connected to the WiFi. I guess I will just plug it in as needed. My husband did a web search and sure enough, this is a complaint many folks had.If you have unlimited data or a very high data plan this is amazing - I would highly recommend it. However, if you are also on a limited data plan be forewarned.QUESTION: Is there a way to disconnect this from the WiFi when it is not in use? I do not mind waiting a few seconds to stream a video. But it is a hassle to get behind the TV to disconnect and unplug every time we are finished watching a movie or show.  Any help will be appreciated.", "verified": true, "helpfulness": "1/1", "author": "Amazon Friend"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Ana"}, {"rating": 1.0, "review": "So lets talk fire TV Stick.  It's a nice concept however it misses the mark for technical execution.  Randomly during shows the Fire TV shuts down and when restarting it syncs to a different resolution 1080p, 720p, 480p.  It will then cycle through its startup a few times and crashes usually about the time you get back into the show you were watching.  I considered getting the Amazon Fire TV box, but after this debacle I think I am going to go with an Apple TV instead because everybody seems to love it and it does not have theses issues.  That remote interface needs significant help as well, so instead I have been using the phone app to quickly search and find shows.  I do however like the screen mirroring feature that I can sync a YouTube video between my phone and the TV as well as the huge Amazon Prime selection.", "verified": true, "helpfulness": "0/0", "author": "Anthony Schumacher"}]